{
    "title": "How Much is an SB Worth?",
    "post_id": "k7w2xj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k7w2xj/how_much_is_an_sb_worth/",
    "author": "AFSMSgt",
    "body": "On another post, a pot SD asked if he could be successful in the bowl as a frugal SD. That got me thinking, what are my SBs worth.?\n\nAt the age of 58, I was burned out. My job was consuming me. My marriage, though I had (and still have ) a wonderful wife, was stale. There was no thrill, excitement, or even much joy, since my kids were grown and gone, in my life. Then, by accident, I stumbled into my first SR with a most wonderful, down-to-earth, young lady. My life was changed forever by her.\n\nThat was 16 years ago. From then until now, a series of wonderful women have made me so happy, so fulfilled, so glad to be the man I am.\n\nSo I'll answer my own question: what is an SB worth? To me they are priceless.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k7w2xj/how_much_is_an_sb_worth/",
    "score": 166,
    "upvote_ratio": 0.94,
    "created_utc": 1607269947.0,
    "num_comments": 100,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "The associated benefits of having an SB, the improved self-care, mental health and general happiness that comes with an arrangement is hard to place a value on. But those things cannot be attributed to any one person or experience but rather the lifestyle overall.",
            "author": "gingerdaddy56",
            "id": "geuhtzg",
            "parent_id": "t3_k7w2xj",
            "score": 47,
            "created_utc": 1607273494.0,
            "replies": [
                {
                    "body": "I have just found this sub and this is not the perspective I expected to find. Interesting and kinda wholesome.",
                    "author": null,
                    "id": "gew52rf",
                    "parent_id": "t1_geuhtzg",
                    "score": 10,
                    "created_utc": 1607300906.0,
                    "replies": [
                        {
                            "body": "When it's done right, yes, like many things.",
                            "author": "gingerdaddy56",
                            "id": "gew6x1b",
                            "parent_id": "t1_gew52rf",
                            "score": 2,
                            "created_utc": 1607301923.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The same is true in the reverse! As an SB, I work from home (currently no regular team meetings or anything) and I also work a dead-end manual labor job. I'm 100% a slob. All the self-care associated with going on a date does make me feel better. On lonely days, I can't get motivated enough to even use body lotion after bath.",
                    "author": "SuperduperDUCKS",
                    "id": "gex3q4g",
                    "parent_id": "t1_geuhtzg",
                    "score": 3,
                    "created_utc": 1607322438.0,
                    "replies": [
                        {
                            "body": "Indeed, and this was largely true pre-pandemic!",
                            "author": "gingerdaddy56",
                            "id": "gey2aq9",
                            "parent_id": "t1_gex3q4g",
                            "score": 1,
                            "created_utc": 1607353084.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agree 100%",
                    "author": "AFSMSgt",
                    "id": "geui8cq",
                    "parent_id": "t1_geuhtzg",
                    "score": 8,
                    "created_utc": 1607273706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "geuf0u5",
            "parent_id": "t3_k7w2xj",
            "score": 38,
            "created_utc": 1607272004.0,
            "replies": [
                {
                    "body": "My wife, children, and grandchildren are taken care of. What's left is mine to do with as I please, and this pleases me.....immensely",
                    "author": "AFSMSgt",
                    "id": "geufibm",
                    "parent_id": "t1_geuf0u5",
                    "score": 61,
                    "created_utc": 1607272269.0,
                    "replies": []
                },
                {
                    "body": "Same. I just limit my sugar budget to an arbitrary percentage of my net income. When not actively sugaring, more of it gets diverted into additional savings/investments unless I decide to buy new toys.",
                    "author": "sdthrowaway006",
                    "id": "geuil6w",
                    "parent_id": "t1_geuf0u5",
                    "score": 23,
                    "created_utc": 1607273895.0,
                    "replies": [
                        {
                            "body": "I’m curious... what percentage of income do SDs usually allocate to sugar?",
                            "author": "hereyougococo",
                            "id": "geurpms",
                            "parent_id": "t1_geuil6w",
                            "score": 9,
                            "created_utc": 1607278393.0,
                            "replies": [
                                {
                                    "body": "75-80% of my disposable income (income after all expenses are met) goes to my SBs and SR related activities. I have nothing else to spend it on and no reason to save it.",
                                    "author": "AFSMSgt",
                                    "id": "geuwpv7",
                                    "parent_id": "t1_geurpms",
                                    "score": 25,
                                    "created_utc": 1607280522.0,
                                    "replies": [
                                        {
                                            "body": "Like my dad always says, \"Spend money while you can- you cant take it with you\"\nMy dad's ma was very poor her whole life and he grew up on welfare. She had a surprising amount of savings to her name, my dad discovered after her passing. It was sad though because she always struggled, and the money she didnt touch would have helped improve her life immensely.  She didn't have a will so why did she save so much? Probably to hide it from my aunt who still lived and mooched off of her her whole life. You can't take your money into the afterlife, so if you're living comfortable and prepared for retirement and emergencies, your happiness is worth more and will bring more joy into you life than the money just sitting in the bank itself ever would.\n\n Spending on people being their lives is always a good cause. Dont give to charities, just help people directly. Doesnt need to be a SB. You could get a houseless person a room for a night. When I become a kajillionaire, I want to help out kids who have always been in poverty and had their dad or something locked up their whole life. They struggled from things that weren't their fault, and I'd want to give them a leg up and provide more opportunity and pay for a community college course or term after thei graduate HS. Even tutoring in HS if they're failing.  Don't end up where your dad has been your whole life, I'll help get you into a better future!!!",
                                            "author": "kimchi_Queen",
                                            "id": "gevpj6p",
                                            "parent_id": "t1_geuwpv7",
                                            "score": 7,
                                            "created_utc": 1607292889.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I have a separate account that I put a flat 10% of my GROSS income/AR into, and that covers all of my dating, gifts, trips, etc without me feeling like I’m being irresponsible. Then once a year before season ends I’ll load up a full 30% for a month to have a long vacation for the remainder of the year",
                                    "author": "deuseyed",
                                    "id": "geuvwfl",
                                    "parent_id": "t1_geurpms",
                                    "score": 9,
                                    "created_utc": 1607280210.0,
                                    "replies": []
                                },
                                {
                                    "body": "I allocate less than 15% of my net W2 income. So after taxes, insurance, maxing out my retirement accounts, and maxing out any other tax-favorable investment vehicles available to me. But before my living expenses, including housing, are factored in.\n\nI believe I allocate a relatively high proportion of my income compared to other SDs. There was a poll some time ago (and probably several since then) that showed SDs tended to allocate closer to 5-10% of their income to sugar. Whether that figure represented a percentage of net income or gross income was a bit iffy. I just assumed it was net, but this is the Internet...",
                                    "author": "sdthrowaway006",
                                    "id": "geutwn7",
                                    "parent_id": "t1_geurpms",
                                    "score": 8,
                                    "created_utc": 1607279351.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This!\n\nVery well planned out mate :)",
                            "author": "xchromeheartsx",
                            "id": "geuqext",
                            "parent_id": "t1_geuil6w",
                            "score": 8,
                            "created_utc": 1607277768.0,
                            "replies": []
                        },
                        {
                            "body": "My experience is that a great LT sugar relationship more than pays for itself in terms of increased productivity (thanks to a better attitude) and a healthier lifestyle.  Sugar is the ultimate performance enhancer........  Of course in the pursuit stages the time wasted on SA is lost forever......   \n\n That  leads to the rule  ----- search carefully, recruit boldly and maintain diligently.........",
                            "author": "pinotandsugar",
                            "id": "gevegzc",
                            "parent_id": "t1_geuil6w",
                            "score": 8,
                            "created_utc": 1607287572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree with all of this with one technicality... I would not give everything I own for my SR activities and I'm sure no one else would either.  So where to draw the line?  No choice other than the free market.",
            "author": "TY2022",
            "id": "geubroe",
            "parent_id": "t3_k7w2xj",
            "score": 21,
            "created_utc": 1607270221.0,
            "replies": [
                {
                    "body": "Certainly. No argument there.",
                    "author": "AFSMSgt",
                    "id": "geuebrg",
                    "parent_id": "t1_geubroe",
                    "score": 6,
                    "created_utc": 1607271616.0,
                    "replies": []
                },
                {
                    "body": "Well said!👏🏼👏🏼",
                    "author": "supportiveceo",
                    "id": "geuc6rc",
                    "parent_id": "t1_geubroe",
                    "score": 2,
                    "created_utc": 1607270451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "After reading threads that reference value, free markets, “prices” going up & down based on demand I’ve come to the slow but certain realization that the “wealthy SD” is just a myth / unicorn.",
            "author": "BGDDDY1",
            "id": "geuhm0c",
            "parent_id": "t3_k7w2xj",
            "score": 13,
            "created_utc": 1607273378.0,
            "replies": [
                {
                    "body": "I think whales exist, just not on SA or this sub",
                    "author": "AFSMSgt",
                    "id": "geuhznv",
                    "parent_id": "t1_geuhm0c",
                    "score": 12,
                    "created_utc": 1607273576.0,
                    "replies": [
                        {
                            "body": "I get that.  \n\nI consider a whale a guy that has a mid 8 figure low 9 figure net worth.  \n\nTravels on a private  jet, has multiple homes, multiple expensive cars. \n\nI’m just talking about “wealthy”\n\nLike a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n\nIt seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.",
                            "author": "BGDDDY1",
                            "id": "geuing4",
                            "parent_id": "t1_geuhznv",
                            "score": 18,
                            "created_utc": 1607273929.0,
                            "replies": [
                                {
                                    "body": "It is not fun to get screwed out of even a dollar. But if you have to worry about getting rinsed for 1 or 2 large, maybe you are not really a sugar daddy. No offense. Just my opinion.",
                                    "author": "AFSMSgt",
                                    "id": "geuxg5h",
                                    "parent_id": "t1_geuing4",
                                    "score": 15,
                                    "created_utc": 1607280812.0,
                                    "replies": [
                                        {
                                            "body": "Exactly.  \n\nAnd if you are regularly getting rinsed you shouldn’t be a SD.  \n\nYou are 10,20,30,40,50 years older & successful.  \n\nConstantly getting fooled by young girls is a SD problem, not a SB problem.",
                                            "author": "BGDDDY1",
                                            "id": "gev0vyw",
                                            "parent_id": "t1_geuxg5h",
                                            "score": 12,
                                            "created_utc": 1607282147.0,
                                            "replies": [
                                                {
                                                    "body": "Couldn’t agree more with both of you.",
                                                    "author": "longrunfun",
                                                    "id": "gevan2v",
                                                    "parent_id": "t1_gev0vyw",
                                                    "score": 5,
                                                    "created_utc": 1607285731.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Hey hey hey. No victim blaming here. \n\nGet fooled once, you shouldn’t feel bad. Learn your lesson and we shouldn’t blame you. \n\nGet fooled multiple times, then yeah, it’s your problem. I suggest you take my $250 online class to avoid scammers.",
                                                    "author": "AsianBabyGirlie",
                                                    "id": "gey3t6c",
                                                    "parent_id": "t1_gev0vyw",
                                                    "score": 2,
                                                    "created_utc": 1607353930.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "If you are loose with how you operate on SA you will get taken for 1 or 2 large daily.  It’s fifty percent plus scammers or rinsers.  The “prove you are a real SD” is the preferred method.   For most of us it isn’t about losing a small amount of money,  it’s about not being a chump.    One meet and greet with a fair gift and then she knows if she likes you or not.  It doesn’t take multiple paid dates for them to decide,   They know in the first 5 minutes of the first meeting.  \n\nI also laugh at any SB talking about someone with a low 8 figure net worth as Splenda.   GTFO with that BS.   A very 8 figure net worth puts you in the top 1%.  At a conservative 4% draw down you can spend thirty three thousand a month without earning a penny and break even.   You have some girl living in an apartment with no bed frame calling that Splenda... that’s silly.",
                                            "author": "LotBuilder",
                                            "id": "gev4dyv",
                                            "parent_id": "t1_geuxg5h",
                                            "score": 11,
                                            "created_utc": 1607283338.0,
                                            "replies": [
                                                {
                                                    "body": "I think that base income isn’t always the issue, there are people who earn less per year but are better with how they use and make their money work for them.  The percentage of disposable income is the important part.  The 8 figure earner who is paying a lot for the mansion and 2 ex-wives and child support may not be able to be as generous as the 7 figure earner 🤷🏻‍♀️",
                                                    "author": "insertsnappyname",
                                                    "id": "gevixrn",
                                                    "parent_id": "t1_gev4dyv",
                                                    "score": 2,
                                                    "created_utc": 1607289636.0,
                                                    "replies": [
                                                        {
                                                            "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
                                                            "author": "LotBuilder",
                                                            "id": "gevkkk7",
                                                            "parent_id": "t1_gevixrn",
                                                            "score": 3,
                                                            "created_utc": 1607290424.0,
                                                            "replies": [
                                                                {
                                                                    "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                                                                    "author": "Saskcatwhore",
                                                                    "id": "gewjm2t",
                                                                    "parent_id": "t1_gevkkk7",
                                                                    "score": 4,
                                                                    "created_utc": 1607309003.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                                                                            "author": "LotBuilder",
                                                                            "id": "gewk5xy",
                                                                            "parent_id": "t1_gewjm2t",
                                                                            "score": 1,
                                                                            "created_utc": 1607309315.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                                                                    "author": "Saskcatwhore",
                                                                                    "id": "gewkz83",
                                                                                    "parent_id": "t1_gewk5xy",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607309777.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                                                                            "author": "LotBuilder",
                                                                                            "id": "geworqw",
                                                                                            "parent_id": "t1_gewkz83",
                                                                                            "score": 3,
                                                                                            "created_utc": 1607311996.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Agreed",
                                                                    "author": "insertsnappyname",
                                                                    "id": "gf44m5z",
                                                                    "parent_id": "t1_gevkkk7",
                                                                    "score": 1,
                                                                    "created_utc": 1607473536.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gevyv8u",
                                                            "parent_id": "t1_gevixrn",
                                                            "score": 1,
                                                            "created_utc": 1607297708.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                                                    "author": "AutoModerator",
                                                                    "id": "gevyvam",
                                                                    "parent_id": "t1_gevyv8u",
                                                                    "score": 1,
                                                                    "created_utc": 1607297709.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I checked some estimates and found that number is correct if talking about \"households\" (in the US): net worth of $10 million puts you at the threshold of top 1% of households. There are about 130 million households, so the top 1% corresponds to 1.3 million.",
                                                    "author": "highfructoseSD",
                                                    "id": "gew0mt3",
                                                    "parent_id": "t1_gev4dyv",
                                                    "score": 1,
                                                    "created_utc": 1607298632.0,
                                                    "replies": [
                                                        {
                                                            "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
                                                            "author": "LotBuilder",
                                                            "id": "gew12l4",
                                                            "parent_id": "t1_gew0mt3",
                                                            "score": 1,
                                                            "created_utc": 1607298855.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yup, 8 figure net worth is 1% in terms of net worth.\n\nAs an SB, I don't focus too much on income/net worth, but y'know, how they approach spending on sugar dating... There's a reason that the group of 1% per income and 1% per net worth are not the same group of people.",
                                                    "author": "SuperduperDUCKS",
                                                    "id": "gex5r9c",
                                                    "parent_id": "t1_gev4dyv",
                                                    "score": 1,
                                                    "created_utc": 1607324196.0,
                                                    "replies": [
                                                        {
                                                            "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
                                                            "author": "LotBuilder",
                                                            "id": "gex6aj0",
                                                            "parent_id": "t1_gex5r9c",
                                                            "score": 1,
                                                            "created_utc": 1607324683.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">I’m just talking about “wealthy”  \n>  \n>Like a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n>  \n>It seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.\n\n  \nThat's my definition of [splenda / generous John / escort-lite stuff](https://www.reddit.com/r/sugarlifestyleforum/comments/k6whob/im_seeing_some_sbs_becoming_escortsshouldnt_it_be/genypke?utm_source=share&utm_medium=web2x&context=3)....   \n\n\nYep. A lot of \"wealthy\" men but very few true SD or generous.....  even in Silicon Valley. And even fewer whales. The 3 whales I met were all 9 and 10 figures. I ended up with the 10-figure guy for a few months. I was a lucky woman.",
                                    "author": "ExExpectations",
                                    "id": "geumwio",
                                    "parent_id": "t1_geuing4",
                                    "score": 11,
                                    "created_utc": 1607276026.0,
                                    "replies": [
                                        {
                                            "body": "I repeat often on here that wealth does not equal generosity.",
                                            "author": "AFSMSgt",
                                            "id": "geux2do",
                                            "parent_id": "t1_geumwio",
                                            "score": 13,
                                            "created_utc": 1607280660.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "My whale is acting like a jerk right now but I’m so afraid of SA",
                                    "author": "ItsOnlyRizzy",
                                    "id": "geulpkf",
                                    "parent_id": "t1_geuing4",
                                    "score": 2,
                                    "created_utc": 1607275442.0,
                                    "replies": []
                                },
                                {
                                    "body": "Richie Rich Rich.",
                                    "author": "craa141",
                                    "id": "geuty1i",
                                    "parent_id": "t1_geuing4",
                                    "score": 1,
                                    "created_utc": 1607279368.0,
                                    "replies": [
                                        {
                                            "body": "Lol..yep Richie Rich rich",
                                            "author": "BGDDDY1",
                                            "id": "geuv4i3",
                                            "parent_id": "t1_geuty1i",
                                            "score": 1,
                                            "created_utc": 1607279873.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Whales do exist on SA. Very much so.   \nIt's likely very rare, but I've personally met three and had an SR with one.",
                            "author": "ExExpectations",
                            "id": "geuix0j",
                            "parent_id": "t1_geuhznv",
                            "score": 10,
                            "created_utc": 1607274065.0,
                            "replies": [
                                {
                                    "body": "Co-signing...I’m primarily based in a smaller Midwestern metropolis and have met several of the “mythical unicorn whales” that people don’t think exist on SA. \n\nSorry guys, your lowball grooming foiled again!",
                                    "author": "NewGirfriend",
                                    "id": "geummms",
                                    "parent_id": "t1_geuix0j",
                                    "score": 5,
                                    "created_utc": 1607275891.0,
                                    "replies": [
                                        {
                                            "body": "They are everywhere! (Ok not everywhere, but they are out there!)  \nThe mythical whale I had an SR with, holds a 10-figure net worth.",
                                            "author": "ExExpectations",
                                            "id": "geunxhf",
                                            "parent_id": "t1_geummms",
                                            "score": 4,
                                            "created_utc": 1607276542.0,
                                            "replies": [
                                                {
                                                    "body": "ENDORSED - you should always write (or say) 10-figure net worth, never billionaire. Keep people on their toes, sharpen their math reasoning skills.",
                                                    "author": "highfructoseSD",
                                                    "id": "gew1je2",
                                                    "parent_id": "t1_geunxhf",
                                                    "score": 5,
                                                    "created_utc": 1607299095.0,
                                                    "replies": [
                                                        {
                                                            "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
                                                            "author": "BGDDDY1",
                                                            "id": "gew6ifw",
                                                            "parent_id": "t1_gew1je2",
                                                            "score": 2,
                                                            "created_utc": 1607301697.0,
                                                            "replies": [
                                                                {
                                                                    "body": "😂 I was just following suit since you mentioned digits haha 😆",
                                                                    "author": "ExExpectations",
                                                                    "id": "gew88fd",
                                                                    "parent_id": "t1_gew6ifw",
                                                                    "score": 1,
                                                                    "created_utc": 1607302660.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "😘",
                                                                            "author": "BGDDDY1",
                                                                            "id": "gew8cmq",
                                                                            "parent_id": "t1_gew88fd",
                                                                            "score": 2,
                                                                            "created_utc": 1607302727.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Why not just say billionaire. I’m trying to do the math to figure out how much this was lol.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gevk17e",
                                                    "parent_id": "t1_geunxhf",
                                                    "score": 3,
                                                    "created_utc": 1607290159.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thank you for saying this!",
                    "author": "longrunfun",
                    "id": "gevahgd",
                    "parent_id": "t1_geuhm0c",
                    "score": 2,
                    "created_utc": 1607285654.0,
                    "replies": []
                },
                {
                    "body": "We shouldn't use the words free market.  People don't understand what that means.  It's kind of like women's suffrage.  More often than you think, they take a negative stance based on the words they hear rather than their meaning.",
                    "author": null,
                    "id": "geuy3la",
                    "parent_id": "t1_geuhm0c",
                    "score": 1,
                    "created_utc": 1607281066.0,
                    "replies": [
                        {
                            "body": "Your last sentence is 100% true but...\n\nI think in the long run it’s wrong not to use the right words.  You just need to patiently explain the context. \n\nBut in this context..sugaring..the free market concept is just wrong when it’s being used to discuss ppms/allowance.  \n\nSRs vary way too much",
                            "author": "BGDDDY1",
                            "id": "gev0itq",
                            "parent_id": "t1_geuy3la",
                            "score": 1,
                            "created_utc": 1607282012.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I spend almost all my discretionary income on my SBs and sugaring related activities. Like what u/sfbay2_ mentioned, Sugaring and specifically a couple of my SBs in the past have lead to an acceleration in my career, mostly by increasing my self confidence, willingness to take risks, the contentment that comes with being in a great relationship, living the life that was missed when I was younger and getting motivated by the drive and ambition of my ex Sgf to name a few.\n\nI don’t think the return of investment would have been anywhere close to this unmeasurable positives in my life if I had decided to just invest the money I spent on sugaring.\n\nSo I would agree with OP that sugaring and SBs are priceless for me personally but as u/TY2022 mentioned, we have to start with the free market.",
            "author": "supportiveceo",
            "id": "geujw1x",
            "parent_id": "t3_k7w2xj",
            "score": 14,
            "created_utc": 1607274563.0,
            "replies": []
        },
        {
            "body": "It honestly depends on the woman. I have had SGFs I would do anything for (at the time), but I had two shortish lived SBs who were horrible, and the price vs. The drama vs. The worth didn't equal out and I ended things. Well those SGFs eventually had the same problems but they got more, and I did too, until I didn't. The last ex SGF I literally gave everything I had to make her life better, and it did for a time, but that did not make us better. \n\nThe best relationship i have ever had and sort of had because of this lifestyle was my most recent ex vanilla GF.   The happiest time of my adult life was my 8 months with her. But alas... i would have given her everything, but she didn't ask for everything. She was and is priceless. Honestly, I would give everything to have her back, but her religious convictions are stopping that. Oh well. Trying to love on has been far easier said than done.",
            "author": "BigBearSD",
            "id": "geum4aa",
            "parent_id": "t3_k7w2xj",
            "score": 6,
            "created_utc": 1607275641.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "geufpg8",
            "parent_id": "t3_k7w2xj",
            "score": 12,
            "created_utc": 1607272376.0,
            "replies": [
                {
                    "body": "Did the opposite for me. The job, career, future became less important. I became more into the now and enjoying the time with her. I was less concerned about competing for the next promotion, or making the extra buck so I could get a new beemer every year.",
                    "author": "AFSMSgt",
                    "id": "geuggtm",
                    "parent_id": "t1_geufpg8",
                    "score": 11,
                    "created_utc": 1607272787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry but as a potential sugar baby... this turns me on. A man taking a woman under his protective wing and being so generous and intimate even though the woman may be very independent and self reliant is just quite appealing. I’m very interested in and pleased with so many of your responses here and how much thought you put into this. I like the idea of having a sugar daddy and have been putting a lot of thought into it as of late. Anyone have resources for a newbie? Websites? Blogs? YouTube? I don’t know anything that could give me a more overall view of this Sugar life style?",
            "author": "JustTheTipOkk",
            "id": "gevqegl",
            "parent_id": "t3_k7w2xj",
            "score": 7,
            "created_utc": 1607293336.0,
            "replies": [
                {
                    "body": "There are sugar baby subs on here, and several groups through out different social media platforms. Someone does blog about it probably in this day and age. One of them i am in on here(maybe even this one?) I know has resources shared at the top for new SBs. You have to put in the effort to do the research though and get different POVs because each SR is unique at the end of the day, but with similar themes throughout.",
                    "author": "BadWolf1318",
                    "id": "gevyfib",
                    "parent_id": "t1_gevqegl",
                    "score": 4,
                    "created_utc": 1607297485.0,
                    "replies": [
                        {
                            "body": "Thanks. I read the glossary here and it just didn’t  touch all the topics I would imagine come up. I’ll look around, just thought I’d ask people who are in the bowl how they learned about it",
                            "author": "JustTheTipOkk",
                            "id": "gew05a4",
                            "parent_id": "t1_gevyfib",
                            "score": 2,
                            "created_utc": 1607298382.0,
                            "replies": [
                                {
                                    "body": "Is it okay if I message you, so I may come back to you to share the group I am thinking of? They had information about SA, how to screen between splenda/real SDs, how to protect yourself for intial M&Gs, what you can expect for the beginnings, etc and I'd like you to be able to see it.",
                                    "author": "BadWolf1318",
                                    "id": "gew2lvh",
                                    "parent_id": "t1_gew05a4",
                                    "score": 1,
                                    "created_utc": 1607299630.0,
                                    "replies": [
                                        {
                                            "body": "Please do! I welcome any and all civil and friendly conversations 😊",
                                            "author": "JustTheTipOkk",
                                            "id": "gew2q7k",
                                            "parent_id": "t1_gew2lvh",
                                            "score": 1,
                                            "created_utc": 1607299693.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I also would very much appreciate that info if you would be so kind!",
                                            "author": "AlwaysOobie1",
                                            "id": "gewiy2d",
                                            "parent_id": "t1_gew2lvh",
                                            "score": 1,
                                            "created_utc": 1607308630.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gf19g1z",
                                            "parent_id": "t1_gew2lvh",
                                            "score": 1,
                                            "created_utc": 1607413867.0,
                                            "replies": [
                                                {
                                                    "body": "The group I was thinking of was this one, if you go under menu at the top of the sub. And just search  \"sugar baby\" and hit communities on here for the others.",
                                                    "author": "BadWolf1318",
                                                    "id": "gf2fzh0",
                                                    "parent_id": "t1_gf19g1z",
                                                    "score": 1,
                                                    "created_utc": 1607445736.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's like how much is an all inclusive vacation to some island is worth? it is worth whatever I am willing to pay for that experience and satisfaction I get from partaking in it.",
            "author": "ramjam201",
            "id": "gewfg4f",
            "parent_id": "t3_k7w2xj",
            "score": 3,
            "created_utc": 1607306712.0,
            "replies": []
        },
        {
            "body": "About tree fiddy",
            "author": "gangsta_baby",
            "id": "geuflwg",
            "parent_id": "t3_k7w2xj",
            "score": 10,
            "created_utc": 1607272323.0,
            "replies": [
                {
                    "body": "🤣",
                    "author": "BGDDDY1",
                    "id": "geuht9w",
                    "parent_id": "t1_geuflwg",
                    "score": 2,
                    "created_utc": 1607273484.0,
                    "replies": []
                },
                {
                    "body": "This just took me out. 🤣🤣🤣",
                    "author": "Tay_DAWN",
                    "id": "gevpwum",
                    "parent_id": "t1_geuflwg",
                    "score": 2,
                    "created_utc": 1607293086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gevyd2k",
            "parent_id": "t3_k7w2xj",
            "score": 2,
            "created_utc": 1607297450.0,
            "replies": [
                {
                    "body": "Not having an SB....unthinkable\n50%",
                    "author": "AFSMSgt",
                    "id": "gewhn9v",
                    "parent_id": "t1_gevyd2k",
                    "score": 1,
                    "created_utc": 1607307910.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I provide my sugar baby with an  allowance that's equivalent to a teacher's pay, a police officer's pay, or firefighters pay in my area. I would pay a lot more because I can afford it. However, moving that much money around month after month and year after year is tough",
            "author": "longknight8883",
            "id": "gewn4wo",
            "parent_id": "t3_k7w2xj",
            "score": 2,
            "created_utc": 1607311031.0,
            "replies": [
                {
                    "body": "Maybe divorce your poor wife? Lol",
                    "author": "perkytitssolidshits",
                    "id": "gifqihw",
                    "parent_id": "t1_gewn4wo",
                    "score": 1,
                    "created_utc": 1610035867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And she works full-time and provides for her husband, who rarely works, and two of his kids.",
            "author": "longknight8883",
            "id": "gewn8ni",
            "parent_id": "t3_k7w2xj",
            "score": 2,
            "created_utc": 1607311091.0,
            "replies": []
        },
        {
            "body": "what is the price to change your whole life? That is exactly what a SB does, so just try to take care of her, change her life. It's everything a SB deserves and expects, do your best for her and will be enought. \n\nI'm glad you think we are priceless, I hope find one like you here in Brazil 😉😘",
            "author": "SugarMayBr",
            "id": "gf9ruc6",
            "parent_id": "t3_k7w2xj",
            "score": 2,
            "created_utc": 1607603444.0,
            "replies": []
        },
        {
            "body": "My husband of 27 years got two sugar babies which I just found out about \n\nSo I’ll answer from wife’s perspective.   What is a sugar baby worth.   Only to be with me who are not married.    The cowardly men who wznt to keep burn the wife but gave what they are missing is not a man But a disgusting coward if I are missing something in marriage try to talk to wife snd get things back or divorce and get a sugar baby cuz it’s not fair having both it’s a betrayal\n\nMy husband spent over 40,000 in two years on two sugar babies which is money we could have used to o pop su for ur child’s college or trips we could have spent together instead of being v with someone he should be with.   So if u think a sugar baby is worth facing when married and is priceless. Think again.  U are betraying ur wive beyond comprehension.",
            "author": "linda-crugnale",
            "id": "geus8gf",
            "parent_id": "t3_k7w2xj",
            "score": 6,
            "created_utc": 1607278639.0,
            "replies": [
                {
                    "body": "You need counseling with your husband not telling the world about your insecurities and broken lost marriage",
                    "author": "KayKolache",
                    "id": "geux0ud",
                    "parent_id": "t1_geus8gf",
                    "score": 7,
                    "created_utc": 1607280643.0,
                    "replies": [
                        {
                            "body": "Wow.   Apologies you feel that way especially since I was the one that started the question \n\nInsecure at one point when I found out yes.  Now.   Realize it was a him Problem.",
                            "author": "linda-crugnale",
                            "id": "gey1iqb",
                            "parent_id": "t1_geux0ud",
                            "score": 2,
                            "created_utc": 1607352648.0,
                            "replies": []
                        },
                        {
                            "body": "Apparently mot maybe I didn’t want to go with hi. Either.   It goes both ways but again I  wasn’t a coward",
                            "author": "linda-crugnale",
                            "id": "gey1ltw",
                            "parent_id": "t1_geux0ud",
                            "score": 1,
                            "created_utc": 1607352698.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "geyke5q",
                                    "parent_id": "t1_gey1ltw",
                                    "score": 1,
                                    "created_utc": 1607361883.0,
                                    "replies": [
                                        {
                                            "body": "I’ve said the exact same things to his face and find this platform as a way of healing",
                                            "author": "linda-crugnale",
                                            "id": "gez3255",
                                            "parent_id": "t1_geyke5q",
                                            "score": 3,
                                            "created_utc": 1607369186.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gev6ujk",
                    "parent_id": "t1_geus8gf",
                    "score": 7,
                    "created_utc": 1607284101.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gevz8up",
                            "parent_id": "t1_gev6ujk",
                            "score": -1,
                            "created_utc": 1607297905.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gevzlwy",
                                    "parent_id": "t1_gevz8up",
                                    "score": -1,
                                    "created_utc": 1607298097.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gevzwx3",
                                            "parent_id": "t1_gevzlwy",
                                            "score": 2,
                                            "created_utc": 1607298260.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gew03rl",
                                                    "parent_id": "t1_gevzwx3",
                                                    "score": 0,
                                                    "created_utc": 1607298360.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gew0nxi",
                                                            "parent_id": "t1_gew03rl",
                                                            "score": 4,
                                                            "created_utc": 1607298648.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gew0ugy",
                                                                    "parent_id": "t1_gew0nxi",
                                                                    "score": 1,
                                                                    "created_utc": 1607298739.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "gew10z8",
                                                                            "parent_id": "t1_gew0ugy",
                                                                            "score": 5,
                                                                            "created_utc": 1607298832.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gew0toz",
                                            "parent_id": "t1_gevzlwy",
                                            "score": 1,
                                            "created_utc": 1607298728.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gew0z7j",
                                                    "parent_id": "t1_gew0toz",
                                                    "score": 1,
                                                    "created_utc": 1607298806.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "gew15ba",
                                                            "parent_id": "t1_gew0z7j",
                                                            "score": 2,
                                                            "created_utc": 1607298894.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m sorry you feel you wasted 27 years with this man, I can sense it’s been very painful for you. As someone who was married for 10 myself, I might recommend some advice: look at what you gained during that time, figure out where you can improve in your next relationship, and use whatever support you’re getting from him right now to get yourself back in the worlds as an emotionally healthy, independent woman who men want to chase.\n\nSomething happened in the marriage that resulted in him cheating. He is responsible for his own actions but if you continue to stay stuck in the victim mentality and blame him for everything, then you are virtually giving up all control over your happiness. Even if you truly feel you weren’t at fault, you can set better boundaries for yourself in the future.\n\nNot all men who cheat are cowardly, some are making a calculated decision with regards to what they feel would hurt their sweet wife the least. Would you really have been happier if he left you 10 years ago? If you didn’t have the lifestyle he was providing? If your kids had to suffer through a divorce? Have you considered that he put his own happiness aside to care for the family and then eventually needed another outlet to mentally escape so he could come back happier and more focused?",
                    "author": "LVSugarBebe",
                    "id": "gewwhj1",
                    "parent_id": "t1_geus8gf",
                    "score": 2,
                    "created_utc": 1607316886.0,
                    "replies": [
                        {
                            "body": "I appreciate ur comments and thank you from ur perspective \n\nBut getting a sugar baby 30 years younger  for substitution or to fill a void and lie for long personnally is not helping me or family it’s humiliating instead of fessing up to the problem and either fixing or walking away.   But getting a sugar baby is only filling a temp void with someone u don’t want to fully be with but u can’t have your cake and eat it too!!!!\n\n\nI am finally starting to move on but it still stings !!!!! \nHe certainly",
                            "author": "linda-crugnale",
                            "id": "gey0dd9",
                            "parent_id": "t1_gewwhj1",
                            "score": 3,
                            "created_utc": 1607351981.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sounds like you gotta get yourself a sugar daddy, sis",
                    "author": "LunaLlena09",
                    "id": "geuwziu",
                    "parent_id": "t1_geus8gf",
                    "score": 6,
                    "created_utc": 1607280628.0,
                    "replies": []
                },
                {
                    "body": "That sounds like youre bringing your personal issue out on a barely related topic. Your issue is with your husband. Many are single or even practice nonmogonomy to begin with. Some do lie and cheat, but it is their choice to do so and theyre entitled to that. It takes 2 to tango, and you failed your part by either  not make your husband feel comfortable to be able to be open with you or not having the hard conversations and dealing with your feelings in a healthy manner since you felt the need to bring this up in the way you did.",
                    "author": "BadWolf1318",
                    "id": "gevzo4q",
                    "parent_id": "t1_geus8gf",
                    "score": -1,
                    "created_utc": 1607298129.0,
                    "replies": [
                        {
                            "body": "Why is it when a husband cheats especially with a sugar baby it’s the wife’s fault Absolutely agree he was t getting something at home or no longer loved me but getting a sugar baby is temp fix to a problem or walk away or be a man and try to work with me to fix it.  Now he made more problems",
                            "author": "linda-crugnale",
                            "id": "gey0q6w",
                            "parent_id": "t1_gevzo4q",
                            "score": 2,
                            "created_utc": 1607352185.0,
                            "replies": [
                                {
                                    "body": "It's usually a combo of both sides not communicating their needs and wants realistically. I said your part, not that it was entirely \"your fault\", as he IS  still the the one who made that choice and all the smaller ones to get to that point too. I just pointed out some of the common culprits.",
                                    "author": "BadWolf1318",
                                    "id": "geyizls",
                                    "parent_id": "t1_gey0q6w",
                                    "score": 2,
                                    "created_utc": 1607361336.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Second of all mentioned earlier was in therapy and forgive me for asking a question to get other perspectives.  Like yours. Abd yes it takes two to tango I am well aware.   Thank you",
                            "author": "linda-crugnale",
                            "id": "gey46m4",
                            "parent_id": "t1_gevzo4q",
                            "score": 1,
                            "created_utc": 1607354137.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Apparently, he didn’t want to go on a trip with you.",
                    "author": "garret6758",
                    "id": "gev45qa",
                    "parent_id": "t1_geus8gf",
                    "score": -3,
                    "created_utc": 1607283271.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Invitation to a philosophical question once we get past the real, if yucky, about markets, net worth, budgets, attractiveness, etc.    Simply put, the large age gap makes the relationship with an SB rare and unique. The more multi-dimensional it becomes, as a matter of mutual agreement and interest, the further it slides toward being “priceless”. And one is up against the mystery of touching the real and the unreal in the same head spinning moment. And eventually ponders that on SLF with others!",
            "author": "jacknjilled",
            "id": "geudiny",
            "parent_id": "t3_k7w2xj",
            "score": 4,
            "created_utc": 1607271173.0,
            "replies": [
                {
                    "body": "I was educated and spent my life as an engineer. The philosophical eludes me. But I know what I feel even if the words to express that escape me.",
                    "author": "AFSMSgt",
                    "id": "geueo2t",
                    "parent_id": "t1_geudiny",
                    "score": 7,
                    "created_utc": 1607271805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> So I'll answer my own question: what is an SB worth? To me they are priceless.\n\nI would disagree.  Something that is priceless - means you would essentially bankrupt yourself doing it.\n\nThe problem I have with your question is it starts to imply that what an SD provides is the \"worth\" of a person (his SB).  I don't think a person's worth has anything to do with an allowance they receive.\n\nA better question to ask - would be, what is an SR worth ?  The relationship, would be easier to target.\n\nAnd in that - I'd say, it's worth exactly the amount I spend on it each month.  \n\n> From then until now, a series of wonderful women have made me so happy, so fulfilled, so glad to be the man I am.\n\nIs it really - that singular of a factor?  I enjoy sugaring, don't get me wrong.  And I'm \"less happy\" when I'm not sugaring - such as the last 8 months during covid.\n\nBut to ascribe as much value as have here?  I can't even fathom it.",
            "author": "SDstartingOut",
            "id": "gev9xxq",
            "parent_id": "t3_k7w2xj",
            "score": 3,
            "created_utc": 1607285390.0,
            "replies": [
                {
                    "body": "You will when you get older.",
                    "author": "AFSMSgt",
                    "id": "gewh0ol",
                    "parent_id": "t1_gev9xxq",
                    "score": 5,
                    "created_utc": 1607307563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gewdeyd",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1607305577.0,
            "replies": [
                {
                    "body": "my SD definition of frugal is WAYYYY different than my version of frugal. XD if its more than $20 im not buying it but for him if its more than a house he starts complaining about how expensive his new car will be XD",
                    "author": "mustardand",
                    "id": "gf1uqee",
                    "parent_id": "t1_gewdeyd",
                    "score": 1,
                    "created_utc": 1607434380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Discuss prices with potential sb and if you feel it’s too pricey negotiate with them/he/her.",
            "author": "KayKolache",
            "id": "geux477",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1607280682.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "geutgnd",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1607279152.0,
            "replies": [
                {
                    "body": "I didn't think there would be a discussion frankly. I was commenting on my perception of my SR.  And I certainly did and do not want to descend to dollars and cents",
                    "author": "AFSMSgt",
                    "id": "geuvu5j",
                    "parent_id": "t1_geutgnd",
                    "score": 4,
                    "created_utc": 1607280183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t know how much to say (as a SB) because most the time it’s between the SD/SM & SB.... however, what is a given is the difference in each relationship. Some are physical, some are emotional. It’s whatever you’re comfortable and it’s whatever the SB is comfortable of receiving. In order to be in a healthy relationship though, the numbers of allowance can’t be exaggerated, can’t be low bargained either.... but both should be open to be able to be satisfied in a grey area. \n\nI personally haven’t found anyone but what I personally can say, it’s whatever the person wants to give. I can only do so much and I’m sure the person can find someone else better. I’m grateful for the any opportunity and that’s me being humble. But it is time\nConsuming for both and that shouldn’t be taken away especially since time is worth more than anything.",
            "author": "Sugar_Baby_Bry",
            "id": "gewfg6f",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1607306713.0,
            "replies": []
        },
        {
            "body": " I’d spend about half my disposable income.\nI think we add to each other’s life.\nSo in that sense it’s worth a lot to me having a SR",
            "author": "SydSd1",
            "id": "gewik6j",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1607308418.0,
            "replies": []
        },
        {
            "body": "looking for a SD if anyone is interested dm me!!",
            "author": "hinrichsen19",
            "id": "gewzohp",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1607319202.0,
            "replies": []
        },
        {
            "body": "You are right. The sugar baby are priceless. You also can get a precious SR from your sugar baby.",
            "author": "Neither_Stranger_976",
            "id": "gh9oy0q",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1609139207.0,
            "replies": []
        },
        {
            "body": "I don't want to divorce her. We still enjoy each other's company, we travel together, we share in hobbies, we eat meals and talk in depth, we share household chores, routinely watch Netflix and Amazon prime together, etc. She just slowly lost the desire for intimacy a few years ago. And I recently found out she never really enjoyed it first 20 years of marriage. I on the other hand, have always been highly sexual starting in Middle School. I miss that much of my life so much I decided I needed to satisfy those basic human needs.",
            "author": "longknight8883",
            "id": "gifr9ea",
            "parent_id": "t3_k7w2xj",
            "score": 1,
            "created_utc": 1610036210.0,
            "replies": []
        },
        {
            "body": "I have just found this sub and this is not the perspective I expected to find. Interesting and kinda wholesome.",
            "author": null,
            "id": "gew52rf",
            "parent_id": "t1_geuhtzg",
            "score": 10,
            "created_utc": 1607300906.0,
            "replies": [
                {
                    "body": "When it's done right, yes, like many things.",
                    "author": "gingerdaddy56",
                    "id": "gew6x1b",
                    "parent_id": "t1_gew52rf",
                    "score": 2,
                    "created_utc": 1607301923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The same is true in the reverse! As an SB, I work from home (currently no regular team meetings or anything) and I also work a dead-end manual labor job. I'm 100% a slob. All the self-care associated with going on a date does make me feel better. On lonely days, I can't get motivated enough to even use body lotion after bath.",
            "author": "SuperduperDUCKS",
            "id": "gex3q4g",
            "parent_id": "t1_geuhtzg",
            "score": 3,
            "created_utc": 1607322438.0,
            "replies": [
                {
                    "body": "Indeed, and this was largely true pre-pandemic!",
                    "author": "gingerdaddy56",
                    "id": "gey2aq9",
                    "parent_id": "t1_gex3q4g",
                    "score": 1,
                    "created_utc": 1607353084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree 100%",
            "author": "AFSMSgt",
            "id": "geui8cq",
            "parent_id": "t1_geuhtzg",
            "score": 8,
            "created_utc": 1607273706.0,
            "replies": []
        },
        {
            "body": "My wife, children, and grandchildren are taken care of. What's left is mine to do with as I please, and this pleases me.....immensely",
            "author": "AFSMSgt",
            "id": "geufibm",
            "parent_id": "t1_geuf0u5",
            "score": 61,
            "created_utc": 1607272269.0,
            "replies": []
        },
        {
            "body": "Same. I just limit my sugar budget to an arbitrary percentage of my net income. When not actively sugaring, more of it gets diverted into additional savings/investments unless I decide to buy new toys.",
            "author": "sdthrowaway006",
            "id": "geuil6w",
            "parent_id": "t1_geuf0u5",
            "score": 23,
            "created_utc": 1607273895.0,
            "replies": [
                {
                    "body": "I’m curious... what percentage of income do SDs usually allocate to sugar?",
                    "author": "hereyougococo",
                    "id": "geurpms",
                    "parent_id": "t1_geuil6w",
                    "score": 9,
                    "created_utc": 1607278393.0,
                    "replies": [
                        {
                            "body": "75-80% of my disposable income (income after all expenses are met) goes to my SBs and SR related activities. I have nothing else to spend it on and no reason to save it.",
                            "author": "AFSMSgt",
                            "id": "geuwpv7",
                            "parent_id": "t1_geurpms",
                            "score": 25,
                            "created_utc": 1607280522.0,
                            "replies": [
                                {
                                    "body": "Like my dad always says, \"Spend money while you can- you cant take it with you\"\nMy dad's ma was very poor her whole life and he grew up on welfare. She had a surprising amount of savings to her name, my dad discovered after her passing. It was sad though because she always struggled, and the money she didnt touch would have helped improve her life immensely.  She didn't have a will so why did she save so much? Probably to hide it from my aunt who still lived and mooched off of her her whole life. You can't take your money into the afterlife, so if you're living comfortable and prepared for retirement and emergencies, your happiness is worth more and will bring more joy into you life than the money just sitting in the bank itself ever would.\n\n Spending on people being their lives is always a good cause. Dont give to charities, just help people directly. Doesnt need to be a SB. You could get a houseless person a room for a night. When I become a kajillionaire, I want to help out kids who have always been in poverty and had their dad or something locked up their whole life. They struggled from things that weren't their fault, and I'd want to give them a leg up and provide more opportunity and pay for a community college course or term after thei graduate HS. Even tutoring in HS if they're failing.  Don't end up where your dad has been your whole life, I'll help get you into a better future!!!",
                                    "author": "kimchi_Queen",
                                    "id": "gevpj6p",
                                    "parent_id": "t1_geuwpv7",
                                    "score": 7,
                                    "created_utc": 1607292889.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I have a separate account that I put a flat 10% of my GROSS income/AR into, and that covers all of my dating, gifts, trips, etc without me feeling like I’m being irresponsible. Then once a year before season ends I’ll load up a full 30% for a month to have a long vacation for the remainder of the year",
                            "author": "deuseyed",
                            "id": "geuvwfl",
                            "parent_id": "t1_geurpms",
                            "score": 9,
                            "created_utc": 1607280210.0,
                            "replies": []
                        },
                        {
                            "body": "I allocate less than 15% of my net W2 income. So after taxes, insurance, maxing out my retirement accounts, and maxing out any other tax-favorable investment vehicles available to me. But before my living expenses, including housing, are factored in.\n\nI believe I allocate a relatively high proportion of my income compared to other SDs. There was a poll some time ago (and probably several since then) that showed SDs tended to allocate closer to 5-10% of their income to sugar. Whether that figure represented a percentage of net income or gross income was a bit iffy. I just assumed it was net, but this is the Internet...",
                            "author": "sdthrowaway006",
                            "id": "geutwn7",
                            "parent_id": "t1_geurpms",
                            "score": 8,
                            "created_utc": 1607279351.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This!\n\nVery well planned out mate :)",
                    "author": "xchromeheartsx",
                    "id": "geuqext",
                    "parent_id": "t1_geuil6w",
                    "score": 8,
                    "created_utc": 1607277768.0,
                    "replies": []
                },
                {
                    "body": "My experience is that a great LT sugar relationship more than pays for itself in terms of increased productivity (thanks to a better attitude) and a healthier lifestyle.  Sugar is the ultimate performance enhancer........  Of course in the pursuit stages the time wasted on SA is lost forever......   \n\n That  leads to the rule  ----- search carefully, recruit boldly and maintain diligently.........",
                    "author": "pinotandsugar",
                    "id": "gevegzc",
                    "parent_id": "t1_geuil6w",
                    "score": 8,
                    "created_utc": 1607287572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Certainly. No argument there.",
            "author": "AFSMSgt",
            "id": "geuebrg",
            "parent_id": "t1_geubroe",
            "score": 6,
            "created_utc": 1607271616.0,
            "replies": []
        },
        {
            "body": "Well said!👏🏼👏🏼",
            "author": "supportiveceo",
            "id": "geuc6rc",
            "parent_id": "t1_geubroe",
            "score": 2,
            "created_utc": 1607270451.0,
            "replies": []
        },
        {
            "body": "I think whales exist, just not on SA or this sub",
            "author": "AFSMSgt",
            "id": "geuhznv",
            "parent_id": "t1_geuhm0c",
            "score": 12,
            "created_utc": 1607273576.0,
            "replies": [
                {
                    "body": "I get that.  \n\nI consider a whale a guy that has a mid 8 figure low 9 figure net worth.  \n\nTravels on a private  jet, has multiple homes, multiple expensive cars. \n\nI’m just talking about “wealthy”\n\nLike a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n\nIt seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.",
                    "author": "BGDDDY1",
                    "id": "geuing4",
                    "parent_id": "t1_geuhznv",
                    "score": 18,
                    "created_utc": 1607273929.0,
                    "replies": [
                        {
                            "body": "It is not fun to get screwed out of even a dollar. But if you have to worry about getting rinsed for 1 or 2 large, maybe you are not really a sugar daddy. No offense. Just my opinion.",
                            "author": "AFSMSgt",
                            "id": "geuxg5h",
                            "parent_id": "t1_geuing4",
                            "score": 15,
                            "created_utc": 1607280812.0,
                            "replies": [
                                {
                                    "body": "Exactly.  \n\nAnd if you are regularly getting rinsed you shouldn’t be a SD.  \n\nYou are 10,20,30,40,50 years older & successful.  \n\nConstantly getting fooled by young girls is a SD problem, not a SB problem.",
                                    "author": "BGDDDY1",
                                    "id": "gev0vyw",
                                    "parent_id": "t1_geuxg5h",
                                    "score": 12,
                                    "created_utc": 1607282147.0,
                                    "replies": [
                                        {
                                            "body": "Couldn’t agree more with both of you.",
                                            "author": "longrunfun",
                                            "id": "gevan2v",
                                            "parent_id": "t1_gev0vyw",
                                            "score": 5,
                                            "created_utc": 1607285731.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Hey hey hey. No victim blaming here. \n\nGet fooled once, you shouldn’t feel bad. Learn your lesson and we shouldn’t blame you. \n\nGet fooled multiple times, then yeah, it’s your problem. I suggest you take my $250 online class to avoid scammers.",
                                            "author": "AsianBabyGirlie",
                                            "id": "gey3t6c",
                                            "parent_id": "t1_gev0vyw",
                                            "score": 2,
                                            "created_utc": 1607353930.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "If you are loose with how you operate on SA you will get taken for 1 or 2 large daily.  It’s fifty percent plus scammers or rinsers.  The “prove you are a real SD” is the preferred method.   For most of us it isn’t about losing a small amount of money,  it’s about not being a chump.    One meet and greet with a fair gift and then she knows if she likes you or not.  It doesn’t take multiple paid dates for them to decide,   They know in the first 5 minutes of the first meeting.  \n\nI also laugh at any SB talking about someone with a low 8 figure net worth as Splenda.   GTFO with that BS.   A very 8 figure net worth puts you in the top 1%.  At a conservative 4% draw down you can spend thirty three thousand a month without earning a penny and break even.   You have some girl living in an apartment with no bed frame calling that Splenda... that’s silly.",
                                    "author": "LotBuilder",
                                    "id": "gev4dyv",
                                    "parent_id": "t1_geuxg5h",
                                    "score": 11,
                                    "created_utc": 1607283338.0,
                                    "replies": [
                                        {
                                            "body": "I think that base income isn’t always the issue, there are people who earn less per year but are better with how they use and make their money work for them.  The percentage of disposable income is the important part.  The 8 figure earner who is paying a lot for the mansion and 2 ex-wives and child support may not be able to be as generous as the 7 figure earner 🤷🏻‍♀️",
                                            "author": "insertsnappyname",
                                            "id": "gevixrn",
                                            "parent_id": "t1_gev4dyv",
                                            "score": 2,
                                            "created_utc": 1607289636.0,
                                            "replies": [
                                                {
                                                    "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
                                                    "author": "LotBuilder",
                                                    "id": "gevkkk7",
                                                    "parent_id": "t1_gevixrn",
                                                    "score": 3,
                                                    "created_utc": 1607290424.0,
                                                    "replies": [
                                                        {
                                                            "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                                                            "author": "Saskcatwhore",
                                                            "id": "gewjm2t",
                                                            "parent_id": "t1_gevkkk7",
                                                            "score": 4,
                                                            "created_utc": 1607309003.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                                                                    "author": "LotBuilder",
                                                                    "id": "gewk5xy",
                                                                    "parent_id": "t1_gewjm2t",
                                                                    "score": 1,
                                                                    "created_utc": 1607309315.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                                                            "author": "Saskcatwhore",
                                                                            "id": "gewkz83",
                                                                            "parent_id": "t1_gewk5xy",
                                                                            "score": 1,
                                                                            "created_utc": 1607309777.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                                                                    "author": "LotBuilder",
                                                                                    "id": "geworqw",
                                                                                    "parent_id": "t1_gewkz83",
                                                                                    "score": 3,
                                                                                    "created_utc": 1607311996.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Agreed",
                                                            "author": "insertsnappyname",
                                                            "id": "gf44m5z",
                                                            "parent_id": "t1_gevkkk7",
                                                            "score": 1,
                                                            "created_utc": 1607473536.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gevyv8u",
                                                    "parent_id": "t1_gevixrn",
                                                    "score": 1,
                                                    "created_utc": 1607297708.0,
                                                    "replies": [
                                                        {
                                                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                                            "author": "AutoModerator",
                                                            "id": "gevyvam",
                                                            "parent_id": "t1_gevyv8u",
                                                            "score": 1,
                                                            "created_utc": 1607297709.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I checked some estimates and found that number is correct if talking about \"households\" (in the US): net worth of $10 million puts you at the threshold of top 1% of households. There are about 130 million households, so the top 1% corresponds to 1.3 million.",
                                            "author": "highfructoseSD",
                                            "id": "gew0mt3",
                                            "parent_id": "t1_gev4dyv",
                                            "score": 1,
                                            "created_utc": 1607298632.0,
                                            "replies": [
                                                {
                                                    "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
                                                    "author": "LotBuilder",
                                                    "id": "gew12l4",
                                                    "parent_id": "t1_gew0mt3",
                                                    "score": 1,
                                                    "created_utc": 1607298855.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yup, 8 figure net worth is 1% in terms of net worth.\n\nAs an SB, I don't focus too much on income/net worth, but y'know, how they approach spending on sugar dating... There's a reason that the group of 1% per income and 1% per net worth are not the same group of people.",
                                            "author": "SuperduperDUCKS",
                                            "id": "gex5r9c",
                                            "parent_id": "t1_gev4dyv",
                                            "score": 1,
                                            "created_utc": 1607324196.0,
                                            "replies": [
                                                {
                                                    "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
                                                    "author": "LotBuilder",
                                                    "id": "gex6aj0",
                                                    "parent_id": "t1_gex5r9c",
                                                    "score": 1,
                                                    "created_utc": 1607324683.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">I’m just talking about “wealthy”  \n>  \n>Like a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n>  \n>It seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.\n\n  \nThat's my definition of [splenda / generous John / escort-lite stuff](https://www.reddit.com/r/sugarlifestyleforum/comments/k6whob/im_seeing_some_sbs_becoming_escortsshouldnt_it_be/genypke?utm_source=share&utm_medium=web2x&context=3)....   \n\n\nYep. A lot of \"wealthy\" men but very few true SD or generous.....  even in Silicon Valley. And even fewer whales. The 3 whales I met were all 9 and 10 figures. I ended up with the 10-figure guy for a few months. I was a lucky woman.",
                            "author": "ExExpectations",
                            "id": "geumwio",
                            "parent_id": "t1_geuing4",
                            "score": 11,
                            "created_utc": 1607276026.0,
                            "replies": [
                                {
                                    "body": "I repeat often on here that wealth does not equal generosity.",
                                    "author": "AFSMSgt",
                                    "id": "geux2do",
                                    "parent_id": "t1_geumwio",
                                    "score": 13,
                                    "created_utc": 1607280660.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My whale is acting like a jerk right now but I’m so afraid of SA",
                            "author": "ItsOnlyRizzy",
                            "id": "geulpkf",
                            "parent_id": "t1_geuing4",
                            "score": 2,
                            "created_utc": 1607275442.0,
                            "replies": []
                        },
                        {
                            "body": "Richie Rich Rich.",
                            "author": "craa141",
                            "id": "geuty1i",
                            "parent_id": "t1_geuing4",
                            "score": 1,
                            "created_utc": 1607279368.0,
                            "replies": [
                                {
                                    "body": "Lol..yep Richie Rich rich",
                                    "author": "BGDDDY1",
                                    "id": "geuv4i3",
                                    "parent_id": "t1_geuty1i",
                                    "score": 1,
                                    "created_utc": 1607279873.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Whales do exist on SA. Very much so.   \nIt's likely very rare, but I've personally met three and had an SR with one.",
                    "author": "ExExpectations",
                    "id": "geuix0j",
                    "parent_id": "t1_geuhznv",
                    "score": 10,
                    "created_utc": 1607274065.0,
                    "replies": [
                        {
                            "body": "Co-signing...I’m primarily based in a smaller Midwestern metropolis and have met several of the “mythical unicorn whales” that people don’t think exist on SA. \n\nSorry guys, your lowball grooming foiled again!",
                            "author": "NewGirfriend",
                            "id": "geummms",
                            "parent_id": "t1_geuix0j",
                            "score": 5,
                            "created_utc": 1607275891.0,
                            "replies": [
                                {
                                    "body": "They are everywhere! (Ok not everywhere, but they are out there!)  \nThe mythical whale I had an SR with, holds a 10-figure net worth.",
                                    "author": "ExExpectations",
                                    "id": "geunxhf",
                                    "parent_id": "t1_geummms",
                                    "score": 4,
                                    "created_utc": 1607276542.0,
                                    "replies": [
                                        {
                                            "body": "ENDORSED - you should always write (or say) 10-figure net worth, never billionaire. Keep people on their toes, sharpen their math reasoning skills.",
                                            "author": "highfructoseSD",
                                            "id": "gew1je2",
                                            "parent_id": "t1_geunxhf",
                                            "score": 5,
                                            "created_utc": 1607299095.0,
                                            "replies": [
                                                {
                                                    "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
                                                    "author": "BGDDDY1",
                                                    "id": "gew6ifw",
                                                    "parent_id": "t1_gew1je2",
                                                    "score": 2,
                                                    "created_utc": 1607301697.0,
                                                    "replies": [
                                                        {
                                                            "body": "😂 I was just following suit since you mentioned digits haha 😆",
                                                            "author": "ExExpectations",
                                                            "id": "gew88fd",
                                                            "parent_id": "t1_gew6ifw",
                                                            "score": 1,
                                                            "created_utc": 1607302660.0,
                                                            "replies": [
                                                                {
                                                                    "body": "😘",
                                                                    "author": "BGDDDY1",
                                                                    "id": "gew8cmq",
                                                                    "parent_id": "t1_gew88fd",
                                                                    "score": 2,
                                                                    "created_utc": 1607302727.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Why not just say billionaire. I’m trying to do the math to figure out how much this was lol.",
                                            "author": "Fun_Focus8159",
                                            "id": "gevk17e",
                                            "parent_id": "t1_geunxhf",
                                            "score": 3,
                                            "created_utc": 1607290159.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for saying this!",
            "author": "longrunfun",
            "id": "gevahgd",
            "parent_id": "t1_geuhm0c",
            "score": 2,
            "created_utc": 1607285654.0,
            "replies": []
        },
        {
            "body": "We shouldn't use the words free market.  People don't understand what that means.  It's kind of like women's suffrage.  More often than you think, they take a negative stance based on the words they hear rather than their meaning.",
            "author": null,
            "id": "geuy3la",
            "parent_id": "t1_geuhm0c",
            "score": 1,
            "created_utc": 1607281066.0,
            "replies": [
                {
                    "body": "Your last sentence is 100% true but...\n\nI think in the long run it’s wrong not to use the right words.  You just need to patiently explain the context. \n\nBut in this context..sugaring..the free market concept is just wrong when it’s being used to discuss ppms/allowance.  \n\nSRs vary way too much",
                    "author": "BGDDDY1",
                    "id": "gev0itq",
                    "parent_id": "t1_geuy3la",
                    "score": 1,
                    "created_utc": 1607282012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did the opposite for me. The job, career, future became less important. I became more into the now and enjoying the time with her. I was less concerned about competing for the next promotion, or making the extra buck so I could get a new beemer every year.",
            "author": "AFSMSgt",
            "id": "geuggtm",
            "parent_id": "t1_geufpg8",
            "score": 11,
            "created_utc": 1607272787.0,
            "replies": []
        },
        {
            "body": "There are sugar baby subs on here, and several groups through out different social media platforms. Someone does blog about it probably in this day and age. One of them i am in on here(maybe even this one?) I know has resources shared at the top for new SBs. You have to put in the effort to do the research though and get different POVs because each SR is unique at the end of the day, but with similar themes throughout.",
            "author": "BadWolf1318",
            "id": "gevyfib",
            "parent_id": "t1_gevqegl",
            "score": 4,
            "created_utc": 1607297485.0,
            "replies": [
                {
                    "body": "Thanks. I read the glossary here and it just didn’t  touch all the topics I would imagine come up. I’ll look around, just thought I’d ask people who are in the bowl how they learned about it",
                    "author": "JustTheTipOkk",
                    "id": "gew05a4",
                    "parent_id": "t1_gevyfib",
                    "score": 2,
                    "created_utc": 1607298382.0,
                    "replies": [
                        {
                            "body": "Is it okay if I message you, so I may come back to you to share the group I am thinking of? They had information about SA, how to screen between splenda/real SDs, how to protect yourself for intial M&Gs, what you can expect for the beginnings, etc and I'd like you to be able to see it.",
                            "author": "BadWolf1318",
                            "id": "gew2lvh",
                            "parent_id": "t1_gew05a4",
                            "score": 1,
                            "created_utc": 1607299630.0,
                            "replies": [
                                {
                                    "body": "Please do! I welcome any and all civil and friendly conversations 😊",
                                    "author": "JustTheTipOkk",
                                    "id": "gew2q7k",
                                    "parent_id": "t1_gew2lvh",
                                    "score": 1,
                                    "created_utc": 1607299693.0,
                                    "replies": []
                                },
                                {
                                    "body": "I also would very much appreciate that info if you would be so kind!",
                                    "author": "AlwaysOobie1",
                                    "id": "gewiy2d",
                                    "parent_id": "t1_gew2lvh",
                                    "score": 1,
                                    "created_utc": 1607308630.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gf19g1z",
                                    "parent_id": "t1_gew2lvh",
                                    "score": 1,
                                    "created_utc": 1607413867.0,
                                    "replies": [
                                        {
                                            "body": "The group I was thinking of was this one, if you go under menu at the top of the sub. And just search  \"sugar baby\" and hit communities on here for the others.",
                                            "author": "BadWolf1318",
                                            "id": "gf2fzh0",
                                            "parent_id": "t1_gf19g1z",
                                            "score": 1,
                                            "created_utc": 1607445736.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣",
            "author": "BGDDDY1",
            "id": "geuht9w",
            "parent_id": "t1_geuflwg",
            "score": 2,
            "created_utc": 1607273484.0,
            "replies": []
        },
        {
            "body": "This just took me out. 🤣🤣🤣",
            "author": "Tay_DAWN",
            "id": "gevpwum",
            "parent_id": "t1_geuflwg",
            "score": 2,
            "created_utc": 1607293086.0,
            "replies": []
        },
        {
            "body": "Not having an SB....unthinkable\n50%",
            "author": "AFSMSgt",
            "id": "gewhn9v",
            "parent_id": "t1_gevyd2k",
            "score": 1,
            "created_utc": 1607307910.0,
            "replies": []
        },
        {
            "body": "Maybe divorce your poor wife? Lol",
            "author": "perkytitssolidshits",
            "id": "gifqihw",
            "parent_id": "t1_gewn4wo",
            "score": 1,
            "created_utc": 1610035867.0,
            "replies": []
        },
        {
            "body": "You need counseling with your husband not telling the world about your insecurities and broken lost marriage",
            "author": "KayKolache",
            "id": "geux0ud",
            "parent_id": "t1_geus8gf",
            "score": 7,
            "created_utc": 1607280643.0,
            "replies": [
                {
                    "body": "Wow.   Apologies you feel that way especially since I was the one that started the question \n\nInsecure at one point when I found out yes.  Now.   Realize it was a him Problem.",
                    "author": "linda-crugnale",
                    "id": "gey1iqb",
                    "parent_id": "t1_geux0ud",
                    "score": 2,
                    "created_utc": 1607352648.0,
                    "replies": []
                },
                {
                    "body": "Apparently mot maybe I didn’t want to go with hi. Either.   It goes both ways but again I  wasn’t a coward",
                    "author": "linda-crugnale",
                    "id": "gey1ltw",
                    "parent_id": "t1_geux0ud",
                    "score": 1,
                    "created_utc": 1607352698.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "geyke5q",
                            "parent_id": "t1_gey1ltw",
                            "score": 1,
                            "created_utc": 1607361883.0,
                            "replies": [
                                {
                                    "body": "I’ve said the exact same things to his face and find this platform as a way of healing",
                                    "author": "linda-crugnale",
                                    "id": "gez3255",
                                    "parent_id": "t1_geyke5q",
                                    "score": 3,
                                    "created_utc": 1607369186.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gev6ujk",
            "parent_id": "t1_geus8gf",
            "score": 7,
            "created_utc": 1607284101.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gevz8up",
                    "parent_id": "t1_gev6ujk",
                    "score": -1,
                    "created_utc": 1607297905.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gevzlwy",
                            "parent_id": "t1_gevz8up",
                            "score": -1,
                            "created_utc": 1607298097.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gevzwx3",
                                    "parent_id": "t1_gevzlwy",
                                    "score": 2,
                                    "created_utc": 1607298260.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gew03rl",
                                            "parent_id": "t1_gevzwx3",
                                            "score": 0,
                                            "created_utc": 1607298360.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gew0nxi",
                                                    "parent_id": "t1_gew03rl",
                                                    "score": 4,
                                                    "created_utc": 1607298648.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gew0ugy",
                                                            "parent_id": "t1_gew0nxi",
                                                            "score": 1,
                                                            "created_utc": 1607298739.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gew10z8",
                                                                    "parent_id": "t1_gew0ugy",
                                                                    "score": 5,
                                                                    "created_utc": 1607298832.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gew0toz",
                                    "parent_id": "t1_gevzlwy",
                                    "score": 1,
                                    "created_utc": 1607298728.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gew0z7j",
                                            "parent_id": "t1_gew0toz",
                                            "score": 1,
                                            "created_utc": 1607298806.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "gew15ba",
                                                    "parent_id": "t1_gew0z7j",
                                                    "score": 2,
                                                    "created_utc": 1607298894.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry you feel you wasted 27 years with this man, I can sense it’s been very painful for you. As someone who was married for 10 myself, I might recommend some advice: look at what you gained during that time, figure out where you can improve in your next relationship, and use whatever support you’re getting from him right now to get yourself back in the worlds as an emotionally healthy, independent woman who men want to chase.\n\nSomething happened in the marriage that resulted in him cheating. He is responsible for his own actions but if you continue to stay stuck in the victim mentality and blame him for everything, then you are virtually giving up all control over your happiness. Even if you truly feel you weren’t at fault, you can set better boundaries for yourself in the future.\n\nNot all men who cheat are cowardly, some are making a calculated decision with regards to what they feel would hurt their sweet wife the least. Would you really have been happier if he left you 10 years ago? If you didn’t have the lifestyle he was providing? If your kids had to suffer through a divorce? Have you considered that he put his own happiness aside to care for the family and then eventually needed another outlet to mentally escape so he could come back happier and more focused?",
            "author": "LVSugarBebe",
            "id": "gewwhj1",
            "parent_id": "t1_geus8gf",
            "score": 2,
            "created_utc": 1607316886.0,
            "replies": [
                {
                    "body": "I appreciate ur comments and thank you from ur perspective \n\nBut getting a sugar baby 30 years younger  for substitution or to fill a void and lie for long personnally is not helping me or family it’s humiliating instead of fessing up to the problem and either fixing or walking away.   But getting a sugar baby is only filling a temp void with someone u don’t want to fully be with but u can’t have your cake and eat it too!!!!\n\n\nI am finally starting to move on but it still stings !!!!! \nHe certainly",
                    "author": "linda-crugnale",
                    "id": "gey0dd9",
                    "parent_id": "t1_gewwhj1",
                    "score": 3,
                    "created_utc": 1607351981.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you gotta get yourself a sugar daddy, sis",
            "author": "LunaLlena09",
            "id": "geuwziu",
            "parent_id": "t1_geus8gf",
            "score": 6,
            "created_utc": 1607280628.0,
            "replies": []
        },
        {
            "body": "That sounds like youre bringing your personal issue out on a barely related topic. Your issue is with your husband. Many are single or even practice nonmogonomy to begin with. Some do lie and cheat, but it is their choice to do so and theyre entitled to that. It takes 2 to tango, and you failed your part by either  not make your husband feel comfortable to be able to be open with you or not having the hard conversations and dealing with your feelings in a healthy manner since you felt the need to bring this up in the way you did.",
            "author": "BadWolf1318",
            "id": "gevzo4q",
            "parent_id": "t1_geus8gf",
            "score": -1,
            "created_utc": 1607298129.0,
            "replies": [
                {
                    "body": "Why is it when a husband cheats especially with a sugar baby it’s the wife’s fault Absolutely agree he was t getting something at home or no longer loved me but getting a sugar baby is temp fix to a problem or walk away or be a man and try to work with me to fix it.  Now he made more problems",
                    "author": "linda-crugnale",
                    "id": "gey0q6w",
                    "parent_id": "t1_gevzo4q",
                    "score": 2,
                    "created_utc": 1607352185.0,
                    "replies": [
                        {
                            "body": "It's usually a combo of both sides not communicating their needs and wants realistically. I said your part, not that it was entirely \"your fault\", as he IS  still the the one who made that choice and all the smaller ones to get to that point too. I just pointed out some of the common culprits.",
                            "author": "BadWolf1318",
                            "id": "geyizls",
                            "parent_id": "t1_gey0q6w",
                            "score": 2,
                            "created_utc": 1607361336.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Second of all mentioned earlier was in therapy and forgive me for asking a question to get other perspectives.  Like yours. Abd yes it takes two to tango I am well aware.   Thank you",
                    "author": "linda-crugnale",
                    "id": "gey46m4",
                    "parent_id": "t1_gevzo4q",
                    "score": 1,
                    "created_utc": 1607354137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Apparently, he didn’t want to go on a trip with you.",
            "author": "garret6758",
            "id": "gev45qa",
            "parent_id": "t1_geus8gf",
            "score": -3,
            "created_utc": 1607283271.0,
            "replies": []
        },
        {
            "body": "I was educated and spent my life as an engineer. The philosophical eludes me. But I know what I feel even if the words to express that escape me.",
            "author": "AFSMSgt",
            "id": "geueo2t",
            "parent_id": "t1_geudiny",
            "score": 7,
            "created_utc": 1607271805.0,
            "replies": []
        },
        {
            "body": "You will when you get older.",
            "author": "AFSMSgt",
            "id": "gewh0ol",
            "parent_id": "t1_gev9xxq",
            "score": 5,
            "created_utc": 1607307563.0,
            "replies": []
        },
        {
            "body": "my SD definition of frugal is WAYYYY different than my version of frugal. XD if its more than $20 im not buying it but for him if its more than a house he starts complaining about how expensive his new car will be XD",
            "author": "mustardand",
            "id": "gf1uqee",
            "parent_id": "t1_gewdeyd",
            "score": 1,
            "created_utc": 1607434380.0,
            "replies": []
        },
        {
            "body": "I didn't think there would be a discussion frankly. I was commenting on my perception of my SR.  And I certainly did and do not want to descend to dollars and cents",
            "author": "AFSMSgt",
            "id": "geuvu5j",
            "parent_id": "t1_geutgnd",
            "score": 4,
            "created_utc": 1607280183.0,
            "replies": []
        },
        {
            "body": "When it's done right, yes, like many things.",
            "author": "gingerdaddy56",
            "id": "gew6x1b",
            "parent_id": "t1_gew52rf",
            "score": 2,
            "created_utc": 1607301923.0,
            "replies": []
        },
        {
            "body": "Indeed, and this was largely true pre-pandemic!",
            "author": "gingerdaddy56",
            "id": "gey2aq9",
            "parent_id": "t1_gex3q4g",
            "score": 1,
            "created_utc": 1607353084.0,
            "replies": []
        },
        {
            "body": "I’m curious... what percentage of income do SDs usually allocate to sugar?",
            "author": "hereyougococo",
            "id": "geurpms",
            "parent_id": "t1_geuil6w",
            "score": 9,
            "created_utc": 1607278393.0,
            "replies": [
                {
                    "body": "75-80% of my disposable income (income after all expenses are met) goes to my SBs and SR related activities. I have nothing else to spend it on and no reason to save it.",
                    "author": "AFSMSgt",
                    "id": "geuwpv7",
                    "parent_id": "t1_geurpms",
                    "score": 25,
                    "created_utc": 1607280522.0,
                    "replies": [
                        {
                            "body": "Like my dad always says, \"Spend money while you can- you cant take it with you\"\nMy dad's ma was very poor her whole life and he grew up on welfare. She had a surprising amount of savings to her name, my dad discovered after her passing. It was sad though because she always struggled, and the money she didnt touch would have helped improve her life immensely.  She didn't have a will so why did she save so much? Probably to hide it from my aunt who still lived and mooched off of her her whole life. You can't take your money into the afterlife, so if you're living comfortable and prepared for retirement and emergencies, your happiness is worth more and will bring more joy into you life than the money just sitting in the bank itself ever would.\n\n Spending on people being their lives is always a good cause. Dont give to charities, just help people directly. Doesnt need to be a SB. You could get a houseless person a room for a night. When I become a kajillionaire, I want to help out kids who have always been in poverty and had their dad or something locked up their whole life. They struggled from things that weren't their fault, and I'd want to give them a leg up and provide more opportunity and pay for a community college course or term after thei graduate HS. Even tutoring in HS if they're failing.  Don't end up where your dad has been your whole life, I'll help get you into a better future!!!",
                            "author": "kimchi_Queen",
                            "id": "gevpj6p",
                            "parent_id": "t1_geuwpv7",
                            "score": 7,
                            "created_utc": 1607292889.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I have a separate account that I put a flat 10% of my GROSS income/AR into, and that covers all of my dating, gifts, trips, etc without me feeling like I’m being irresponsible. Then once a year before season ends I’ll load up a full 30% for a month to have a long vacation for the remainder of the year",
                    "author": "deuseyed",
                    "id": "geuvwfl",
                    "parent_id": "t1_geurpms",
                    "score": 9,
                    "created_utc": 1607280210.0,
                    "replies": []
                },
                {
                    "body": "I allocate less than 15% of my net W2 income. So after taxes, insurance, maxing out my retirement accounts, and maxing out any other tax-favorable investment vehicles available to me. But before my living expenses, including housing, are factored in.\n\nI believe I allocate a relatively high proportion of my income compared to other SDs. There was a poll some time ago (and probably several since then) that showed SDs tended to allocate closer to 5-10% of their income to sugar. Whether that figure represented a percentage of net income or gross income was a bit iffy. I just assumed it was net, but this is the Internet...",
                    "author": "sdthrowaway006",
                    "id": "geutwn7",
                    "parent_id": "t1_geurpms",
                    "score": 8,
                    "created_utc": 1607279351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This!\n\nVery well planned out mate :)",
            "author": "xchromeheartsx",
            "id": "geuqext",
            "parent_id": "t1_geuil6w",
            "score": 8,
            "created_utc": 1607277768.0,
            "replies": []
        },
        {
            "body": "My experience is that a great LT sugar relationship more than pays for itself in terms of increased productivity (thanks to a better attitude) and a healthier lifestyle.  Sugar is the ultimate performance enhancer........  Of course in the pursuit stages the time wasted on SA is lost forever......   \n\n That  leads to the rule  ----- search carefully, recruit boldly and maintain diligently.........",
            "author": "pinotandsugar",
            "id": "gevegzc",
            "parent_id": "t1_geuil6w",
            "score": 8,
            "created_utc": 1607287572.0,
            "replies": []
        },
        {
            "body": "I get that.  \n\nI consider a whale a guy that has a mid 8 figure low 9 figure net worth.  \n\nTravels on a private  jet, has multiple homes, multiple expensive cars. \n\nI’m just talking about “wealthy”\n\nLike a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n\nIt seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.",
            "author": "BGDDDY1",
            "id": "geuing4",
            "parent_id": "t1_geuhznv",
            "score": 18,
            "created_utc": 1607273929.0,
            "replies": [
                {
                    "body": "It is not fun to get screwed out of even a dollar. But if you have to worry about getting rinsed for 1 or 2 large, maybe you are not really a sugar daddy. No offense. Just my opinion.",
                    "author": "AFSMSgt",
                    "id": "geuxg5h",
                    "parent_id": "t1_geuing4",
                    "score": 15,
                    "created_utc": 1607280812.0,
                    "replies": [
                        {
                            "body": "Exactly.  \n\nAnd if you are regularly getting rinsed you shouldn’t be a SD.  \n\nYou are 10,20,30,40,50 years older & successful.  \n\nConstantly getting fooled by young girls is a SD problem, not a SB problem.",
                            "author": "BGDDDY1",
                            "id": "gev0vyw",
                            "parent_id": "t1_geuxg5h",
                            "score": 12,
                            "created_utc": 1607282147.0,
                            "replies": [
                                {
                                    "body": "Couldn’t agree more with both of you.",
                                    "author": "longrunfun",
                                    "id": "gevan2v",
                                    "parent_id": "t1_gev0vyw",
                                    "score": 5,
                                    "created_utc": 1607285731.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hey hey hey. No victim blaming here. \n\nGet fooled once, you shouldn’t feel bad. Learn your lesson and we shouldn’t blame you. \n\nGet fooled multiple times, then yeah, it’s your problem. I suggest you take my $250 online class to avoid scammers.",
                                    "author": "AsianBabyGirlie",
                                    "id": "gey3t6c",
                                    "parent_id": "t1_gev0vyw",
                                    "score": 2,
                                    "created_utc": 1607353930.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If you are loose with how you operate on SA you will get taken for 1 or 2 large daily.  It’s fifty percent plus scammers or rinsers.  The “prove you are a real SD” is the preferred method.   For most of us it isn’t about losing a small amount of money,  it’s about not being a chump.    One meet and greet with a fair gift and then she knows if she likes you or not.  It doesn’t take multiple paid dates for them to decide,   They know in the first 5 minutes of the first meeting.  \n\nI also laugh at any SB talking about someone with a low 8 figure net worth as Splenda.   GTFO with that BS.   A very 8 figure net worth puts you in the top 1%.  At a conservative 4% draw down you can spend thirty three thousand a month without earning a penny and break even.   You have some girl living in an apartment with no bed frame calling that Splenda... that’s silly.",
                            "author": "LotBuilder",
                            "id": "gev4dyv",
                            "parent_id": "t1_geuxg5h",
                            "score": 11,
                            "created_utc": 1607283338.0,
                            "replies": [
                                {
                                    "body": "I think that base income isn’t always the issue, there are people who earn less per year but are better with how they use and make their money work for them.  The percentage of disposable income is the important part.  The 8 figure earner who is paying a lot for the mansion and 2 ex-wives and child support may not be able to be as generous as the 7 figure earner 🤷🏻‍♀️",
                                    "author": "insertsnappyname",
                                    "id": "gevixrn",
                                    "parent_id": "t1_gev4dyv",
                                    "score": 2,
                                    "created_utc": 1607289636.0,
                                    "replies": [
                                        {
                                            "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
                                            "author": "LotBuilder",
                                            "id": "gevkkk7",
                                            "parent_id": "t1_gevixrn",
                                            "score": 3,
                                            "created_utc": 1607290424.0,
                                            "replies": [
                                                {
                                                    "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                                                    "author": "Saskcatwhore",
                                                    "id": "gewjm2t",
                                                    "parent_id": "t1_gevkkk7",
                                                    "score": 4,
                                                    "created_utc": 1607309003.0,
                                                    "replies": [
                                                        {
                                                            "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                                                            "author": "LotBuilder",
                                                            "id": "gewk5xy",
                                                            "parent_id": "t1_gewjm2t",
                                                            "score": 1,
                                                            "created_utc": 1607309315.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                                                    "author": "Saskcatwhore",
                                                                    "id": "gewkz83",
                                                                    "parent_id": "t1_gewk5xy",
                                                                    "score": 1,
                                                                    "created_utc": 1607309777.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                                                            "author": "LotBuilder",
                                                                            "id": "geworqw",
                                                                            "parent_id": "t1_gewkz83",
                                                                            "score": 3,
                                                                            "created_utc": 1607311996.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Agreed",
                                                    "author": "insertsnappyname",
                                                    "id": "gf44m5z",
                                                    "parent_id": "t1_gevkkk7",
                                                    "score": 1,
                                                    "created_utc": 1607473536.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gevyv8u",
                                            "parent_id": "t1_gevixrn",
                                            "score": 1,
                                            "created_utc": 1607297708.0,
                                            "replies": [
                                                {
                                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                                    "author": "AutoModerator",
                                                    "id": "gevyvam",
                                                    "parent_id": "t1_gevyv8u",
                                                    "score": 1,
                                                    "created_utc": 1607297709.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I checked some estimates and found that number is correct if talking about \"households\" (in the US): net worth of $10 million puts you at the threshold of top 1% of households. There are about 130 million households, so the top 1% corresponds to 1.3 million.",
                                    "author": "highfructoseSD",
                                    "id": "gew0mt3",
                                    "parent_id": "t1_gev4dyv",
                                    "score": 1,
                                    "created_utc": 1607298632.0,
                                    "replies": [
                                        {
                                            "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
                                            "author": "LotBuilder",
                                            "id": "gew12l4",
                                            "parent_id": "t1_gew0mt3",
                                            "score": 1,
                                            "created_utc": 1607298855.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yup, 8 figure net worth is 1% in terms of net worth.\n\nAs an SB, I don't focus too much on income/net worth, but y'know, how they approach spending on sugar dating... There's a reason that the group of 1% per income and 1% per net worth are not the same group of people.",
                                    "author": "SuperduperDUCKS",
                                    "id": "gex5r9c",
                                    "parent_id": "t1_gev4dyv",
                                    "score": 1,
                                    "created_utc": 1607324196.0,
                                    "replies": [
                                        {
                                            "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
                                            "author": "LotBuilder",
                                            "id": "gex6aj0",
                                            "parent_id": "t1_gex5r9c",
                                            "score": 1,
                                            "created_utc": 1607324683.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I’m just talking about “wealthy”  \n>  \n>Like a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n>  \n>It seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.\n\n  \nThat's my definition of [splenda / generous John / escort-lite stuff](https://www.reddit.com/r/sugarlifestyleforum/comments/k6whob/im_seeing_some_sbs_becoming_escortsshouldnt_it_be/genypke?utm_source=share&utm_medium=web2x&context=3)....   \n\n\nYep. A lot of \"wealthy\" men but very few true SD or generous.....  even in Silicon Valley. And even fewer whales. The 3 whales I met were all 9 and 10 figures. I ended up with the 10-figure guy for a few months. I was a lucky woman.",
                    "author": "ExExpectations",
                    "id": "geumwio",
                    "parent_id": "t1_geuing4",
                    "score": 11,
                    "created_utc": 1607276026.0,
                    "replies": [
                        {
                            "body": "I repeat often on here that wealth does not equal generosity.",
                            "author": "AFSMSgt",
                            "id": "geux2do",
                            "parent_id": "t1_geumwio",
                            "score": 13,
                            "created_utc": 1607280660.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My whale is acting like a jerk right now but I’m so afraid of SA",
                    "author": "ItsOnlyRizzy",
                    "id": "geulpkf",
                    "parent_id": "t1_geuing4",
                    "score": 2,
                    "created_utc": 1607275442.0,
                    "replies": []
                },
                {
                    "body": "Richie Rich Rich.",
                    "author": "craa141",
                    "id": "geuty1i",
                    "parent_id": "t1_geuing4",
                    "score": 1,
                    "created_utc": 1607279368.0,
                    "replies": [
                        {
                            "body": "Lol..yep Richie Rich rich",
                            "author": "BGDDDY1",
                            "id": "geuv4i3",
                            "parent_id": "t1_geuty1i",
                            "score": 1,
                            "created_utc": 1607279873.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whales do exist on SA. Very much so.   \nIt's likely very rare, but I've personally met three and had an SR with one.",
            "author": "ExExpectations",
            "id": "geuix0j",
            "parent_id": "t1_geuhznv",
            "score": 10,
            "created_utc": 1607274065.0,
            "replies": [
                {
                    "body": "Co-signing...I’m primarily based in a smaller Midwestern metropolis and have met several of the “mythical unicorn whales” that people don’t think exist on SA. \n\nSorry guys, your lowball grooming foiled again!",
                    "author": "NewGirfriend",
                    "id": "geummms",
                    "parent_id": "t1_geuix0j",
                    "score": 5,
                    "created_utc": 1607275891.0,
                    "replies": [
                        {
                            "body": "They are everywhere! (Ok not everywhere, but they are out there!)  \nThe mythical whale I had an SR with, holds a 10-figure net worth.",
                            "author": "ExExpectations",
                            "id": "geunxhf",
                            "parent_id": "t1_geummms",
                            "score": 4,
                            "created_utc": 1607276542.0,
                            "replies": [
                                {
                                    "body": "ENDORSED - you should always write (or say) 10-figure net worth, never billionaire. Keep people on their toes, sharpen their math reasoning skills.",
                                    "author": "highfructoseSD",
                                    "id": "gew1je2",
                                    "parent_id": "t1_geunxhf",
                                    "score": 5,
                                    "created_utc": 1607299095.0,
                                    "replies": [
                                        {
                                            "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
                                            "author": "BGDDDY1",
                                            "id": "gew6ifw",
                                            "parent_id": "t1_gew1je2",
                                            "score": 2,
                                            "created_utc": 1607301697.0,
                                            "replies": [
                                                {
                                                    "body": "😂 I was just following suit since you mentioned digits haha 😆",
                                                    "author": "ExExpectations",
                                                    "id": "gew88fd",
                                                    "parent_id": "t1_gew6ifw",
                                                    "score": 1,
                                                    "created_utc": 1607302660.0,
                                                    "replies": [
                                                        {
                                                            "body": "😘",
                                                            "author": "BGDDDY1",
                                                            "id": "gew8cmq",
                                                            "parent_id": "t1_gew88fd",
                                                            "score": 2,
                                                            "created_utc": 1607302727.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Why not just say billionaire. I’m trying to do the math to figure out how much this was lol.",
                                    "author": "Fun_Focus8159",
                                    "id": "gevk17e",
                                    "parent_id": "t1_geunxhf",
                                    "score": 3,
                                    "created_utc": 1607290159.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your last sentence is 100% true but...\n\nI think in the long run it’s wrong not to use the right words.  You just need to patiently explain the context. \n\nBut in this context..sugaring..the free market concept is just wrong when it’s being used to discuss ppms/allowance.  \n\nSRs vary way too much",
            "author": "BGDDDY1",
            "id": "gev0itq",
            "parent_id": "t1_geuy3la",
            "score": 1,
            "created_utc": 1607282012.0,
            "replies": []
        },
        {
            "body": "Thanks. I read the glossary here and it just didn’t  touch all the topics I would imagine come up. I’ll look around, just thought I’d ask people who are in the bowl how they learned about it",
            "author": "JustTheTipOkk",
            "id": "gew05a4",
            "parent_id": "t1_gevyfib",
            "score": 2,
            "created_utc": 1607298382.0,
            "replies": [
                {
                    "body": "Is it okay if I message you, so I may come back to you to share the group I am thinking of? They had information about SA, how to screen between splenda/real SDs, how to protect yourself for intial M&Gs, what you can expect for the beginnings, etc and I'd like you to be able to see it.",
                    "author": "BadWolf1318",
                    "id": "gew2lvh",
                    "parent_id": "t1_gew05a4",
                    "score": 1,
                    "created_utc": 1607299630.0,
                    "replies": [
                        {
                            "body": "Please do! I welcome any and all civil and friendly conversations 😊",
                            "author": "JustTheTipOkk",
                            "id": "gew2q7k",
                            "parent_id": "t1_gew2lvh",
                            "score": 1,
                            "created_utc": 1607299693.0,
                            "replies": []
                        },
                        {
                            "body": "I also would very much appreciate that info if you would be so kind!",
                            "author": "AlwaysOobie1",
                            "id": "gewiy2d",
                            "parent_id": "t1_gew2lvh",
                            "score": 1,
                            "created_utc": 1607308630.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gf19g1z",
                            "parent_id": "t1_gew2lvh",
                            "score": 1,
                            "created_utc": 1607413867.0,
                            "replies": [
                                {
                                    "body": "The group I was thinking of was this one, if you go under menu at the top of the sub. And just search  \"sugar baby\" and hit communities on here for the others.",
                                    "author": "BadWolf1318",
                                    "id": "gf2fzh0",
                                    "parent_id": "t1_gf19g1z",
                                    "score": 1,
                                    "created_utc": 1607445736.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow.   Apologies you feel that way especially since I was the one that started the question \n\nInsecure at one point when I found out yes.  Now.   Realize it was a him Problem.",
            "author": "linda-crugnale",
            "id": "gey1iqb",
            "parent_id": "t1_geux0ud",
            "score": 2,
            "created_utc": 1607352648.0,
            "replies": []
        },
        {
            "body": "Apparently mot maybe I didn’t want to go with hi. Either.   It goes both ways but again I  wasn’t a coward",
            "author": "linda-crugnale",
            "id": "gey1ltw",
            "parent_id": "t1_geux0ud",
            "score": 1,
            "created_utc": 1607352698.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "geyke5q",
                    "parent_id": "t1_gey1ltw",
                    "score": 1,
                    "created_utc": 1607361883.0,
                    "replies": [
                        {
                            "body": "I’ve said the exact same things to his face and find this platform as a way of healing",
                            "author": "linda-crugnale",
                            "id": "gez3255",
                            "parent_id": "t1_geyke5q",
                            "score": 3,
                            "created_utc": 1607369186.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gevz8up",
            "parent_id": "t1_gev6ujk",
            "score": -1,
            "created_utc": 1607297905.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gevzlwy",
                    "parent_id": "t1_gevz8up",
                    "score": -1,
                    "created_utc": 1607298097.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gevzwx3",
                            "parent_id": "t1_gevzlwy",
                            "score": 2,
                            "created_utc": 1607298260.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gew03rl",
                                    "parent_id": "t1_gevzwx3",
                                    "score": 0,
                                    "created_utc": 1607298360.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gew0nxi",
                                            "parent_id": "t1_gew03rl",
                                            "score": 4,
                                            "created_utc": 1607298648.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gew0ugy",
                                                    "parent_id": "t1_gew0nxi",
                                                    "score": 1,
                                                    "created_utc": 1607298739.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gew10z8",
                                                            "parent_id": "t1_gew0ugy",
                                                            "score": 5,
                                                            "created_utc": 1607298832.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gew0toz",
                            "parent_id": "t1_gevzlwy",
                            "score": 1,
                            "created_utc": 1607298728.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gew0z7j",
                                    "parent_id": "t1_gew0toz",
                                    "score": 1,
                                    "created_utc": 1607298806.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gew15ba",
                                            "parent_id": "t1_gew0z7j",
                                            "score": 2,
                                            "created_utc": 1607298894.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I appreciate ur comments and thank you from ur perspective \n\nBut getting a sugar baby 30 years younger  for substitution or to fill a void and lie for long personnally is not helping me or family it’s humiliating instead of fessing up to the problem and either fixing or walking away.   But getting a sugar baby is only filling a temp void with someone u don’t want to fully be with but u can’t have your cake and eat it too!!!!\n\n\nI am finally starting to move on but it still stings !!!!! \nHe certainly",
            "author": "linda-crugnale",
            "id": "gey0dd9",
            "parent_id": "t1_gewwhj1",
            "score": 3,
            "created_utc": 1607351981.0,
            "replies": []
        },
        {
            "body": "Why is it when a husband cheats especially with a sugar baby it’s the wife’s fault Absolutely agree he was t getting something at home or no longer loved me but getting a sugar baby is temp fix to a problem or walk away or be a man and try to work with me to fix it.  Now he made more problems",
            "author": "linda-crugnale",
            "id": "gey0q6w",
            "parent_id": "t1_gevzo4q",
            "score": 2,
            "created_utc": 1607352185.0,
            "replies": [
                {
                    "body": "It's usually a combo of both sides not communicating their needs and wants realistically. I said your part, not that it was entirely \"your fault\", as he IS  still the the one who made that choice and all the smaller ones to get to that point too. I just pointed out some of the common culprits.",
                    "author": "BadWolf1318",
                    "id": "geyizls",
                    "parent_id": "t1_gey0q6w",
                    "score": 2,
                    "created_utc": 1607361336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Second of all mentioned earlier was in therapy and forgive me for asking a question to get other perspectives.  Like yours. Abd yes it takes two to tango I am well aware.   Thank you",
            "author": "linda-crugnale",
            "id": "gey46m4",
            "parent_id": "t1_gevzo4q",
            "score": 1,
            "created_utc": 1607354137.0,
            "replies": []
        },
        {
            "body": "75-80% of my disposable income (income after all expenses are met) goes to my SBs and SR related activities. I have nothing else to spend it on and no reason to save it.",
            "author": "AFSMSgt",
            "id": "geuwpv7",
            "parent_id": "t1_geurpms",
            "score": 25,
            "created_utc": 1607280522.0,
            "replies": [
                {
                    "body": "Like my dad always says, \"Spend money while you can- you cant take it with you\"\nMy dad's ma was very poor her whole life and he grew up on welfare. She had a surprising amount of savings to her name, my dad discovered after her passing. It was sad though because she always struggled, and the money she didnt touch would have helped improve her life immensely.  She didn't have a will so why did she save so much? Probably to hide it from my aunt who still lived and mooched off of her her whole life. You can't take your money into the afterlife, so if you're living comfortable and prepared for retirement and emergencies, your happiness is worth more and will bring more joy into you life than the money just sitting in the bank itself ever would.\n\n Spending on people being their lives is always a good cause. Dont give to charities, just help people directly. Doesnt need to be a SB. You could get a houseless person a room for a night. When I become a kajillionaire, I want to help out kids who have always been in poverty and had their dad or something locked up their whole life. They struggled from things that weren't their fault, and I'd want to give them a leg up and provide more opportunity and pay for a community college course or term after thei graduate HS. Even tutoring in HS if they're failing.  Don't end up where your dad has been your whole life, I'll help get you into a better future!!!",
                    "author": "kimchi_Queen",
                    "id": "gevpj6p",
                    "parent_id": "t1_geuwpv7",
                    "score": 7,
                    "created_utc": 1607292889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a separate account that I put a flat 10% of my GROSS income/AR into, and that covers all of my dating, gifts, trips, etc without me feeling like I’m being irresponsible. Then once a year before season ends I’ll load up a full 30% for a month to have a long vacation for the remainder of the year",
            "author": "deuseyed",
            "id": "geuvwfl",
            "parent_id": "t1_geurpms",
            "score": 9,
            "created_utc": 1607280210.0,
            "replies": []
        },
        {
            "body": "I allocate less than 15% of my net W2 income. So after taxes, insurance, maxing out my retirement accounts, and maxing out any other tax-favorable investment vehicles available to me. But before my living expenses, including housing, are factored in.\n\nI believe I allocate a relatively high proportion of my income compared to other SDs. There was a poll some time ago (and probably several since then) that showed SDs tended to allocate closer to 5-10% of their income to sugar. Whether that figure represented a percentage of net income or gross income was a bit iffy. I just assumed it was net, but this is the Internet...",
            "author": "sdthrowaway006",
            "id": "geutwn7",
            "parent_id": "t1_geurpms",
            "score": 8,
            "created_utc": 1607279351.0,
            "replies": []
        },
        {
            "body": "It is not fun to get screwed out of even a dollar. But if you have to worry about getting rinsed for 1 or 2 large, maybe you are not really a sugar daddy. No offense. Just my opinion.",
            "author": "AFSMSgt",
            "id": "geuxg5h",
            "parent_id": "t1_geuing4",
            "score": 15,
            "created_utc": 1607280812.0,
            "replies": [
                {
                    "body": "Exactly.  \n\nAnd if you are regularly getting rinsed you shouldn’t be a SD.  \n\nYou are 10,20,30,40,50 years older & successful.  \n\nConstantly getting fooled by young girls is a SD problem, not a SB problem.",
                    "author": "BGDDDY1",
                    "id": "gev0vyw",
                    "parent_id": "t1_geuxg5h",
                    "score": 12,
                    "created_utc": 1607282147.0,
                    "replies": [
                        {
                            "body": "Couldn’t agree more with both of you.",
                            "author": "longrunfun",
                            "id": "gevan2v",
                            "parent_id": "t1_gev0vyw",
                            "score": 5,
                            "created_utc": 1607285731.0,
                            "replies": []
                        },
                        {
                            "body": "Hey hey hey. No victim blaming here. \n\nGet fooled once, you shouldn’t feel bad. Learn your lesson and we shouldn’t blame you. \n\nGet fooled multiple times, then yeah, it’s your problem. I suggest you take my $250 online class to avoid scammers.",
                            "author": "AsianBabyGirlie",
                            "id": "gey3t6c",
                            "parent_id": "t1_gev0vyw",
                            "score": 2,
                            "created_utc": 1607353930.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If you are loose with how you operate on SA you will get taken for 1 or 2 large daily.  It’s fifty percent plus scammers or rinsers.  The “prove you are a real SD” is the preferred method.   For most of us it isn’t about losing a small amount of money,  it’s about not being a chump.    One meet and greet with a fair gift and then she knows if she likes you or not.  It doesn’t take multiple paid dates for them to decide,   They know in the first 5 minutes of the first meeting.  \n\nI also laugh at any SB talking about someone with a low 8 figure net worth as Splenda.   GTFO with that BS.   A very 8 figure net worth puts you in the top 1%.  At a conservative 4% draw down you can spend thirty three thousand a month without earning a penny and break even.   You have some girl living in an apartment with no bed frame calling that Splenda... that’s silly.",
                    "author": "LotBuilder",
                    "id": "gev4dyv",
                    "parent_id": "t1_geuxg5h",
                    "score": 11,
                    "created_utc": 1607283338.0,
                    "replies": [
                        {
                            "body": "I think that base income isn’t always the issue, there are people who earn less per year but are better with how they use and make their money work for them.  The percentage of disposable income is the important part.  The 8 figure earner who is paying a lot for the mansion and 2 ex-wives and child support may not be able to be as generous as the 7 figure earner 🤷🏻‍♀️",
                            "author": "insertsnappyname",
                            "id": "gevixrn",
                            "parent_id": "t1_gev4dyv",
                            "score": 2,
                            "created_utc": 1607289636.0,
                            "replies": [
                                {
                                    "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
                                    "author": "LotBuilder",
                                    "id": "gevkkk7",
                                    "parent_id": "t1_gevixrn",
                                    "score": 3,
                                    "created_utc": 1607290424.0,
                                    "replies": [
                                        {
                                            "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                                            "author": "Saskcatwhore",
                                            "id": "gewjm2t",
                                            "parent_id": "t1_gevkkk7",
                                            "score": 4,
                                            "created_utc": 1607309003.0,
                                            "replies": [
                                                {
                                                    "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                                                    "author": "LotBuilder",
                                                    "id": "gewk5xy",
                                                    "parent_id": "t1_gewjm2t",
                                                    "score": 1,
                                                    "created_utc": 1607309315.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                                            "author": "Saskcatwhore",
                                                            "id": "gewkz83",
                                                            "parent_id": "t1_gewk5xy",
                                                            "score": 1,
                                                            "created_utc": 1607309777.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                                                    "author": "LotBuilder",
                                                                    "id": "geworqw",
                                                                    "parent_id": "t1_gewkz83",
                                                                    "score": 3,
                                                                    "created_utc": 1607311996.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Agreed",
                                            "author": "insertsnappyname",
                                            "id": "gf44m5z",
                                            "parent_id": "t1_gevkkk7",
                                            "score": 1,
                                            "created_utc": 1607473536.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gevyv8u",
                                    "parent_id": "t1_gevixrn",
                                    "score": 1,
                                    "created_utc": 1607297708.0,
                                    "replies": [
                                        {
                                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                            "author": "AutoModerator",
                                            "id": "gevyvam",
                                            "parent_id": "t1_gevyv8u",
                                            "score": 1,
                                            "created_utc": 1607297709.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I checked some estimates and found that number is correct if talking about \"households\" (in the US): net worth of $10 million puts you at the threshold of top 1% of households. There are about 130 million households, so the top 1% corresponds to 1.3 million.",
                            "author": "highfructoseSD",
                            "id": "gew0mt3",
                            "parent_id": "t1_gev4dyv",
                            "score": 1,
                            "created_utc": 1607298632.0,
                            "replies": [
                                {
                                    "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
                                    "author": "LotBuilder",
                                    "id": "gew12l4",
                                    "parent_id": "t1_gew0mt3",
                                    "score": 1,
                                    "created_utc": 1607298855.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yup, 8 figure net worth is 1% in terms of net worth.\n\nAs an SB, I don't focus too much on income/net worth, but y'know, how they approach spending on sugar dating... There's a reason that the group of 1% per income and 1% per net worth are not the same group of people.",
                            "author": "SuperduperDUCKS",
                            "id": "gex5r9c",
                            "parent_id": "t1_gev4dyv",
                            "score": 1,
                            "created_utc": 1607324196.0,
                            "replies": [
                                {
                                    "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
                                    "author": "LotBuilder",
                                    "id": "gex6aj0",
                                    "parent_id": "t1_gex5r9c",
                                    "score": 1,
                                    "created_utc": 1607324683.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I’m just talking about “wealthy”  \n>  \n>Like a net worth in the very low 8 figures. Someone that doesn’t give af about 500$ or 1000$.  \n>  \n>It seems like most SDs blow a gasket & insist on intimacy before giving a woman that much for a few platonic dates before sex because they might get “rinsed”.\n\n  \nThat's my definition of [splenda / generous John / escort-lite stuff](https://www.reddit.com/r/sugarlifestyleforum/comments/k6whob/im_seeing_some_sbs_becoming_escortsshouldnt_it_be/genypke?utm_source=share&utm_medium=web2x&context=3)....   \n\n\nYep. A lot of \"wealthy\" men but very few true SD or generous.....  even in Silicon Valley. And even fewer whales. The 3 whales I met were all 9 and 10 figures. I ended up with the 10-figure guy for a few months. I was a lucky woman.",
            "author": "ExExpectations",
            "id": "geumwio",
            "parent_id": "t1_geuing4",
            "score": 11,
            "created_utc": 1607276026.0,
            "replies": [
                {
                    "body": "I repeat often on here that wealth does not equal generosity.",
                    "author": "AFSMSgt",
                    "id": "geux2do",
                    "parent_id": "t1_geumwio",
                    "score": 13,
                    "created_utc": 1607280660.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My whale is acting like a jerk right now but I’m so afraid of SA",
            "author": "ItsOnlyRizzy",
            "id": "geulpkf",
            "parent_id": "t1_geuing4",
            "score": 2,
            "created_utc": 1607275442.0,
            "replies": []
        },
        {
            "body": "Richie Rich Rich.",
            "author": "craa141",
            "id": "geuty1i",
            "parent_id": "t1_geuing4",
            "score": 1,
            "created_utc": 1607279368.0,
            "replies": [
                {
                    "body": "Lol..yep Richie Rich rich",
                    "author": "BGDDDY1",
                    "id": "geuv4i3",
                    "parent_id": "t1_geuty1i",
                    "score": 1,
                    "created_utc": 1607279873.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Co-signing...I’m primarily based in a smaller Midwestern metropolis and have met several of the “mythical unicorn whales” that people don’t think exist on SA. \n\nSorry guys, your lowball grooming foiled again!",
            "author": "NewGirfriend",
            "id": "geummms",
            "parent_id": "t1_geuix0j",
            "score": 5,
            "created_utc": 1607275891.0,
            "replies": [
                {
                    "body": "They are everywhere! (Ok not everywhere, but they are out there!)  \nThe mythical whale I had an SR with, holds a 10-figure net worth.",
                    "author": "ExExpectations",
                    "id": "geunxhf",
                    "parent_id": "t1_geummms",
                    "score": 4,
                    "created_utc": 1607276542.0,
                    "replies": [
                        {
                            "body": "ENDORSED - you should always write (or say) 10-figure net worth, never billionaire. Keep people on their toes, sharpen their math reasoning skills.",
                            "author": "highfructoseSD",
                            "id": "gew1je2",
                            "parent_id": "t1_geunxhf",
                            "score": 5,
                            "created_utc": 1607299095.0,
                            "replies": [
                                {
                                    "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
                                    "author": "BGDDDY1",
                                    "id": "gew6ifw",
                                    "parent_id": "t1_gew1je2",
                                    "score": 2,
                                    "created_utc": 1607301697.0,
                                    "replies": [
                                        {
                                            "body": "😂 I was just following suit since you mentioned digits haha 😆",
                                            "author": "ExExpectations",
                                            "id": "gew88fd",
                                            "parent_id": "t1_gew6ifw",
                                            "score": 1,
                                            "created_utc": 1607302660.0,
                                            "replies": [
                                                {
                                                    "body": "😘",
                                                    "author": "BGDDDY1",
                                                    "id": "gew8cmq",
                                                    "parent_id": "t1_gew88fd",
                                                    "score": 2,
                                                    "created_utc": 1607302727.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Why not just say billionaire. I’m trying to do the math to figure out how much this was lol.",
                            "author": "Fun_Focus8159",
                            "id": "gevk17e",
                            "parent_id": "t1_geunxhf",
                            "score": 3,
                            "created_utc": 1607290159.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is it okay if I message you, so I may come back to you to share the group I am thinking of? They had information about SA, how to screen between splenda/real SDs, how to protect yourself for intial M&Gs, what you can expect for the beginnings, etc and I'd like you to be able to see it.",
            "author": "BadWolf1318",
            "id": "gew2lvh",
            "parent_id": "t1_gew05a4",
            "score": 1,
            "created_utc": 1607299630.0,
            "replies": [
                {
                    "body": "Please do! I welcome any and all civil and friendly conversations 😊",
                    "author": "JustTheTipOkk",
                    "id": "gew2q7k",
                    "parent_id": "t1_gew2lvh",
                    "score": 1,
                    "created_utc": 1607299693.0,
                    "replies": []
                },
                {
                    "body": "I also would very much appreciate that info if you would be so kind!",
                    "author": "AlwaysOobie1",
                    "id": "gewiy2d",
                    "parent_id": "t1_gew2lvh",
                    "score": 1,
                    "created_utc": 1607308630.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gf19g1z",
                    "parent_id": "t1_gew2lvh",
                    "score": 1,
                    "created_utc": 1607413867.0,
                    "replies": [
                        {
                            "body": "The group I was thinking of was this one, if you go under menu at the top of the sub. And just search  \"sugar baby\" and hit communities on here for the others.",
                            "author": "BadWolf1318",
                            "id": "gf2fzh0",
                            "parent_id": "t1_gf19g1z",
                            "score": 1,
                            "created_utc": 1607445736.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "geyke5q",
            "parent_id": "t1_gey1ltw",
            "score": 1,
            "created_utc": 1607361883.0,
            "replies": [
                {
                    "body": "I’ve said the exact same things to his face and find this platform as a way of healing",
                    "author": "linda-crugnale",
                    "id": "gez3255",
                    "parent_id": "t1_geyke5q",
                    "score": 3,
                    "created_utc": 1607369186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gevzlwy",
            "parent_id": "t1_gevz8up",
            "score": -1,
            "created_utc": 1607298097.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gevzwx3",
                    "parent_id": "t1_gevzlwy",
                    "score": 2,
                    "created_utc": 1607298260.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gew03rl",
                            "parent_id": "t1_gevzwx3",
                            "score": 0,
                            "created_utc": 1607298360.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gew0nxi",
                                    "parent_id": "t1_gew03rl",
                                    "score": 4,
                                    "created_utc": 1607298648.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gew0ugy",
                                            "parent_id": "t1_gew0nxi",
                                            "score": 1,
                                            "created_utc": 1607298739.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gew10z8",
                                                    "parent_id": "t1_gew0ugy",
                                                    "score": 5,
                                                    "created_utc": 1607298832.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gew0toz",
                    "parent_id": "t1_gevzlwy",
                    "score": 1,
                    "created_utc": 1607298728.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gew0z7j",
                            "parent_id": "t1_gew0toz",
                            "score": 1,
                            "created_utc": 1607298806.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gew15ba",
                                    "parent_id": "t1_gew0z7j",
                                    "score": 2,
                                    "created_utc": 1607298894.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's usually a combo of both sides not communicating their needs and wants realistically. I said your part, not that it was entirely \"your fault\", as he IS  still the the one who made that choice and all the smaller ones to get to that point too. I just pointed out some of the common culprits.",
            "author": "BadWolf1318",
            "id": "geyizls",
            "parent_id": "t1_gey0q6w",
            "score": 2,
            "created_utc": 1607361336.0,
            "replies": []
        },
        {
            "body": "Like my dad always says, \"Spend money while you can- you cant take it with you\"\nMy dad's ma was very poor her whole life and he grew up on welfare. She had a surprising amount of savings to her name, my dad discovered after her passing. It was sad though because she always struggled, and the money she didnt touch would have helped improve her life immensely.  She didn't have a will so why did she save so much? Probably to hide it from my aunt who still lived and mooched off of her her whole life. You can't take your money into the afterlife, so if you're living comfortable and prepared for retirement and emergencies, your happiness is worth more and will bring more joy into you life than the money just sitting in the bank itself ever would.\n\n Spending on people being their lives is always a good cause. Dont give to charities, just help people directly. Doesnt need to be a SB. You could get a houseless person a room for a night. When I become a kajillionaire, I want to help out kids who have always been in poverty and had their dad or something locked up their whole life. They struggled from things that weren't their fault, and I'd want to give them a leg up and provide more opportunity and pay for a community college course or term after thei graduate HS. Even tutoring in HS if they're failing.  Don't end up where your dad has been your whole life, I'll help get you into a better future!!!",
            "author": "kimchi_Queen",
            "id": "gevpj6p",
            "parent_id": "t1_geuwpv7",
            "score": 7,
            "created_utc": 1607292889.0,
            "replies": []
        },
        {
            "body": "Exactly.  \n\nAnd if you are regularly getting rinsed you shouldn’t be a SD.  \n\nYou are 10,20,30,40,50 years older & successful.  \n\nConstantly getting fooled by young girls is a SD problem, not a SB problem.",
            "author": "BGDDDY1",
            "id": "gev0vyw",
            "parent_id": "t1_geuxg5h",
            "score": 12,
            "created_utc": 1607282147.0,
            "replies": [
                {
                    "body": "Couldn’t agree more with both of you.",
                    "author": "longrunfun",
                    "id": "gevan2v",
                    "parent_id": "t1_gev0vyw",
                    "score": 5,
                    "created_utc": 1607285731.0,
                    "replies": []
                },
                {
                    "body": "Hey hey hey. No victim blaming here. \n\nGet fooled once, you shouldn’t feel bad. Learn your lesson and we shouldn’t blame you. \n\nGet fooled multiple times, then yeah, it’s your problem. I suggest you take my $250 online class to avoid scammers.",
                    "author": "AsianBabyGirlie",
                    "id": "gey3t6c",
                    "parent_id": "t1_gev0vyw",
                    "score": 2,
                    "created_utc": 1607353930.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you are loose with how you operate on SA you will get taken for 1 or 2 large daily.  It’s fifty percent plus scammers or rinsers.  The “prove you are a real SD” is the preferred method.   For most of us it isn’t about losing a small amount of money,  it’s about not being a chump.    One meet and greet with a fair gift and then she knows if she likes you or not.  It doesn’t take multiple paid dates for them to decide,   They know in the first 5 minutes of the first meeting.  \n\nI also laugh at any SB talking about someone with a low 8 figure net worth as Splenda.   GTFO with that BS.   A very 8 figure net worth puts you in the top 1%.  At a conservative 4% draw down you can spend thirty three thousand a month without earning a penny and break even.   You have some girl living in an apartment with no bed frame calling that Splenda... that’s silly.",
            "author": "LotBuilder",
            "id": "gev4dyv",
            "parent_id": "t1_geuxg5h",
            "score": 11,
            "created_utc": 1607283338.0,
            "replies": [
                {
                    "body": "I think that base income isn’t always the issue, there are people who earn less per year but are better with how they use and make their money work for them.  The percentage of disposable income is the important part.  The 8 figure earner who is paying a lot for the mansion and 2 ex-wives and child support may not be able to be as generous as the 7 figure earner 🤷🏻‍♀️",
                    "author": "insertsnappyname",
                    "id": "gevixrn",
                    "parent_id": "t1_gev4dyv",
                    "score": 2,
                    "created_utc": 1607289636.0,
                    "replies": [
                        {
                            "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
                            "author": "LotBuilder",
                            "id": "gevkkk7",
                            "parent_id": "t1_gevixrn",
                            "score": 3,
                            "created_utc": 1607290424.0,
                            "replies": [
                                {
                                    "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                                    "author": "Saskcatwhore",
                                    "id": "gewjm2t",
                                    "parent_id": "t1_gevkkk7",
                                    "score": 4,
                                    "created_utc": 1607309003.0,
                                    "replies": [
                                        {
                                            "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                                            "author": "LotBuilder",
                                            "id": "gewk5xy",
                                            "parent_id": "t1_gewjm2t",
                                            "score": 1,
                                            "created_utc": 1607309315.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                                    "author": "Saskcatwhore",
                                                    "id": "gewkz83",
                                                    "parent_id": "t1_gewk5xy",
                                                    "score": 1,
                                                    "created_utc": 1607309777.0,
                                                    "replies": [
                                                        {
                                                            "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                                            "author": "LotBuilder",
                                                            "id": "geworqw",
                                                            "parent_id": "t1_gewkz83",
                                                            "score": 3,
                                                            "created_utc": 1607311996.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Agreed",
                                    "author": "insertsnappyname",
                                    "id": "gf44m5z",
                                    "parent_id": "t1_gevkkk7",
                                    "score": 1,
                                    "created_utc": 1607473536.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gevyv8u",
                            "parent_id": "t1_gevixrn",
                            "score": 1,
                            "created_utc": 1607297708.0,
                            "replies": [
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "gevyvam",
                                    "parent_id": "t1_gevyv8u",
                                    "score": 1,
                                    "created_utc": 1607297709.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I checked some estimates and found that number is correct if talking about \"households\" (in the US): net worth of $10 million puts you at the threshold of top 1% of households. There are about 130 million households, so the top 1% corresponds to 1.3 million.",
                    "author": "highfructoseSD",
                    "id": "gew0mt3",
                    "parent_id": "t1_gev4dyv",
                    "score": 1,
                    "created_utc": 1607298632.0,
                    "replies": [
                        {
                            "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
                            "author": "LotBuilder",
                            "id": "gew12l4",
                            "parent_id": "t1_gew0mt3",
                            "score": 1,
                            "created_utc": 1607298855.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yup, 8 figure net worth is 1% in terms of net worth.\n\nAs an SB, I don't focus too much on income/net worth, but y'know, how they approach spending on sugar dating... There's a reason that the group of 1% per income and 1% per net worth are not the same group of people.",
                    "author": "SuperduperDUCKS",
                    "id": "gex5r9c",
                    "parent_id": "t1_gev4dyv",
                    "score": 1,
                    "created_utc": 1607324196.0,
                    "replies": [
                        {
                            "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
                            "author": "LotBuilder",
                            "id": "gex6aj0",
                            "parent_id": "t1_gex5r9c",
                            "score": 1,
                            "created_utc": 1607324683.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I repeat often on here that wealth does not equal generosity.",
            "author": "AFSMSgt",
            "id": "geux2do",
            "parent_id": "t1_geumwio",
            "score": 13,
            "created_utc": 1607280660.0,
            "replies": []
        },
        {
            "body": "Lol..yep Richie Rich rich",
            "author": "BGDDDY1",
            "id": "geuv4i3",
            "parent_id": "t1_geuty1i",
            "score": 1,
            "created_utc": 1607279873.0,
            "replies": []
        },
        {
            "body": "They are everywhere! (Ok not everywhere, but they are out there!)  \nThe mythical whale I had an SR with, holds a 10-figure net worth.",
            "author": "ExExpectations",
            "id": "geunxhf",
            "parent_id": "t1_geummms",
            "score": 4,
            "created_utc": 1607276542.0,
            "replies": [
                {
                    "body": "ENDORSED - you should always write (or say) 10-figure net worth, never billionaire. Keep people on their toes, sharpen their math reasoning skills.",
                    "author": "highfructoseSD",
                    "id": "gew1je2",
                    "parent_id": "t1_geunxhf",
                    "score": 5,
                    "created_utc": 1607299095.0,
                    "replies": [
                        {
                            "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
                            "author": "BGDDDY1",
                            "id": "gew6ifw",
                            "parent_id": "t1_gew1je2",
                            "score": 2,
                            "created_utc": 1607301697.0,
                            "replies": [
                                {
                                    "body": "😂 I was just following suit since you mentioned digits haha 😆",
                                    "author": "ExExpectations",
                                    "id": "gew88fd",
                                    "parent_id": "t1_gew6ifw",
                                    "score": 1,
                                    "created_utc": 1607302660.0,
                                    "replies": [
                                        {
                                            "body": "😘",
                                            "author": "BGDDDY1",
                                            "id": "gew8cmq",
                                            "parent_id": "t1_gew88fd",
                                            "score": 2,
                                            "created_utc": 1607302727.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Why not just say billionaire. I’m trying to do the math to figure out how much this was lol.",
                    "author": "Fun_Focus8159",
                    "id": "gevk17e",
                    "parent_id": "t1_geunxhf",
                    "score": 3,
                    "created_utc": 1607290159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please do! I welcome any and all civil and friendly conversations 😊",
            "author": "JustTheTipOkk",
            "id": "gew2q7k",
            "parent_id": "t1_gew2lvh",
            "score": 1,
            "created_utc": 1607299693.0,
            "replies": []
        },
        {
            "body": "I also would very much appreciate that info if you would be so kind!",
            "author": "AlwaysOobie1",
            "id": "gewiy2d",
            "parent_id": "t1_gew2lvh",
            "score": 1,
            "created_utc": 1607308630.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gf19g1z",
            "parent_id": "t1_gew2lvh",
            "score": 1,
            "created_utc": 1607413867.0,
            "replies": [
                {
                    "body": "The group I was thinking of was this one, if you go under menu at the top of the sub. And just search  \"sugar baby\" and hit communities on here for the others.",
                    "author": "BadWolf1318",
                    "id": "gf2fzh0",
                    "parent_id": "t1_gf19g1z",
                    "score": 1,
                    "created_utc": 1607445736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve said the exact same things to his face and find this platform as a way of healing",
            "author": "linda-crugnale",
            "id": "gez3255",
            "parent_id": "t1_geyke5q",
            "score": 3,
            "created_utc": 1607369186.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gevzwx3",
            "parent_id": "t1_gevzlwy",
            "score": 2,
            "created_utc": 1607298260.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gew03rl",
                    "parent_id": "t1_gevzwx3",
                    "score": 0,
                    "created_utc": 1607298360.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gew0nxi",
                            "parent_id": "t1_gew03rl",
                            "score": 4,
                            "created_utc": 1607298648.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gew0ugy",
                                    "parent_id": "t1_gew0nxi",
                                    "score": 1,
                                    "created_utc": 1607298739.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gew10z8",
                                            "parent_id": "t1_gew0ugy",
                                            "score": 5,
                                            "created_utc": 1607298832.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gew0toz",
            "parent_id": "t1_gevzlwy",
            "score": 1,
            "created_utc": 1607298728.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gew0z7j",
                    "parent_id": "t1_gew0toz",
                    "score": 1,
                    "created_utc": 1607298806.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gew15ba",
                            "parent_id": "t1_gew0z7j",
                            "score": 2,
                            "created_utc": 1607298894.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Couldn’t agree more with both of you.",
            "author": "longrunfun",
            "id": "gevan2v",
            "parent_id": "t1_gev0vyw",
            "score": 5,
            "created_utc": 1607285731.0,
            "replies": []
        },
        {
            "body": "Hey hey hey. No victim blaming here. \n\nGet fooled once, you shouldn’t feel bad. Learn your lesson and we shouldn’t blame you. \n\nGet fooled multiple times, then yeah, it’s your problem. I suggest you take my $250 online class to avoid scammers.",
            "author": "AsianBabyGirlie",
            "id": "gey3t6c",
            "parent_id": "t1_gev0vyw",
            "score": 2,
            "created_utc": 1607353930.0,
            "replies": []
        },
        {
            "body": "I think that base income isn’t always the issue, there are people who earn less per year but are better with how they use and make their money work for them.  The percentage of disposable income is the important part.  The 8 figure earner who is paying a lot for the mansion and 2 ex-wives and child support may not be able to be as generous as the 7 figure earner 🤷🏻‍♀️",
            "author": "insertsnappyname",
            "id": "gevixrn",
            "parent_id": "t1_gev4dyv",
            "score": 2,
            "created_utc": 1607289636.0,
            "replies": [
                {
                    "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
                    "author": "LotBuilder",
                    "id": "gevkkk7",
                    "parent_id": "t1_gevixrn",
                    "score": 3,
                    "created_utc": 1607290424.0,
                    "replies": [
                        {
                            "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                            "author": "Saskcatwhore",
                            "id": "gewjm2t",
                            "parent_id": "t1_gevkkk7",
                            "score": 4,
                            "created_utc": 1607309003.0,
                            "replies": [
                                {
                                    "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                                    "author": "LotBuilder",
                                    "id": "gewk5xy",
                                    "parent_id": "t1_gewjm2t",
                                    "score": 1,
                                    "created_utc": 1607309315.0,
                                    "replies": [
                                        {
                                            "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                            "author": "Saskcatwhore",
                                            "id": "gewkz83",
                                            "parent_id": "t1_gewk5xy",
                                            "score": 1,
                                            "created_utc": 1607309777.0,
                                            "replies": [
                                                {
                                                    "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                                    "author": "LotBuilder",
                                                    "id": "geworqw",
                                                    "parent_id": "t1_gewkz83",
                                                    "score": 3,
                                                    "created_utc": 1607311996.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Agreed",
                            "author": "insertsnappyname",
                            "id": "gf44m5z",
                            "parent_id": "t1_gevkkk7",
                            "score": 1,
                            "created_utc": 1607473536.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gevyv8u",
                    "parent_id": "t1_gevixrn",
                    "score": 1,
                    "created_utc": 1607297708.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "gevyvam",
                            "parent_id": "t1_gevyv8u",
                            "score": 1,
                            "created_utc": 1607297709.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I checked some estimates and found that number is correct if talking about \"households\" (in the US): net worth of $10 million puts you at the threshold of top 1% of households. There are about 130 million households, so the top 1% corresponds to 1.3 million.",
            "author": "highfructoseSD",
            "id": "gew0mt3",
            "parent_id": "t1_gev4dyv",
            "score": 1,
            "created_utc": 1607298632.0,
            "replies": [
                {
                    "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
                    "author": "LotBuilder",
                    "id": "gew12l4",
                    "parent_id": "t1_gew0mt3",
                    "score": 1,
                    "created_utc": 1607298855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup, 8 figure net worth is 1% in terms of net worth.\n\nAs an SB, I don't focus too much on income/net worth, but y'know, how they approach spending on sugar dating... There's a reason that the group of 1% per income and 1% per net worth are not the same group of people.",
            "author": "SuperduperDUCKS",
            "id": "gex5r9c",
            "parent_id": "t1_gev4dyv",
            "score": 1,
            "created_utc": 1607324196.0,
            "replies": [
                {
                    "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
                    "author": "LotBuilder",
                    "id": "gex6aj0",
                    "parent_id": "t1_gex5r9c",
                    "score": 1,
                    "created_utc": 1607324683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ENDORSED - you should always write (or say) 10-figure net worth, never billionaire. Keep people on their toes, sharpen their math reasoning skills.",
            "author": "highfructoseSD",
            "id": "gew1je2",
            "parent_id": "t1_geunxhf",
            "score": 5,
            "created_utc": 1607299095.0,
            "replies": [
                {
                    "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
                    "author": "BGDDDY1",
                    "id": "gew6ifw",
                    "parent_id": "t1_gew1je2",
                    "score": 2,
                    "created_utc": 1607301697.0,
                    "replies": [
                        {
                            "body": "😂 I was just following suit since you mentioned digits haha 😆",
                            "author": "ExExpectations",
                            "id": "gew88fd",
                            "parent_id": "t1_gew6ifw",
                            "score": 1,
                            "created_utc": 1607302660.0,
                            "replies": [
                                {
                                    "body": "😘",
                                    "author": "BGDDDY1",
                                    "id": "gew8cmq",
                                    "parent_id": "t1_gew88fd",
                                    "score": 2,
                                    "created_utc": 1607302727.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why not just say billionaire. I’m trying to do the math to figure out how much this was lol.",
            "author": "Fun_Focus8159",
            "id": "gevk17e",
            "parent_id": "t1_geunxhf",
            "score": 3,
            "created_utc": 1607290159.0,
            "replies": []
        },
        {
            "body": "The group I was thinking of was this one, if you go under menu at the top of the sub. And just search  \"sugar baby\" and hit communities on here for the others.",
            "author": "BadWolf1318",
            "id": "gf2fzh0",
            "parent_id": "t1_gf19g1z",
            "score": 1,
            "created_utc": 1607445736.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gew03rl",
            "parent_id": "t1_gevzwx3",
            "score": 0,
            "created_utc": 1607298360.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gew0nxi",
                    "parent_id": "t1_gew03rl",
                    "score": 4,
                    "created_utc": 1607298648.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gew0ugy",
                            "parent_id": "t1_gew0nxi",
                            "score": 1,
                            "created_utc": 1607298739.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gew10z8",
                                    "parent_id": "t1_gew0ugy",
                                    "score": 5,
                                    "created_utc": 1607298832.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gew0z7j",
            "parent_id": "t1_gew0toz",
            "score": 1,
            "created_utc": 1607298806.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gew15ba",
                    "parent_id": "t1_gew0z7j",
                    "score": 2,
                    "created_utc": 1607298894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s not what was said.  It was said that unless you are a private jet/wale type of guy then you are a Splenda/generous John.   Which is utter bullshit.",
            "author": "LotBuilder",
            "id": "gevkkk7",
            "parent_id": "t1_gevixrn",
            "score": 3,
            "created_utc": 1607290424.0,
            "replies": [
                {
                    "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
                    "author": "Saskcatwhore",
                    "id": "gewjm2t",
                    "parent_id": "t1_gevkkk7",
                    "score": 4,
                    "created_utc": 1607309003.0,
                    "replies": [
                        {
                            "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                            "author": "LotBuilder",
                            "id": "gewk5xy",
                            "parent_id": "t1_gewjm2t",
                            "score": 1,
                            "created_utc": 1607309315.0,
                            "replies": [
                                {
                                    "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                                    "author": "Saskcatwhore",
                                    "id": "gewkz83",
                                    "parent_id": "t1_gewk5xy",
                                    "score": 1,
                                    "created_utc": 1607309777.0,
                                    "replies": [
                                        {
                                            "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                            "author": "LotBuilder",
                                            "id": "geworqw",
                                            "parent_id": "t1_gewkz83",
                                            "score": 3,
                                            "created_utc": 1607311996.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed",
                    "author": "insertsnappyname",
                    "id": "gf44m5z",
                    "parent_id": "t1_gevkkk7",
                    "score": 1,
                    "created_utc": 1607473536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gevyv8u",
            "parent_id": "t1_gevixrn",
            "score": 1,
            "created_utc": 1607297708.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gevyvam",
                    "parent_id": "t1_gevyv8u",
                    "score": 1,
                    "created_utc": 1607297709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The top 1% in net worth in the US is eleven million, ninety nine thousand.  Top 1% income is five hundred thirty one thousand.",
            "author": "LotBuilder",
            "id": "gew12l4",
            "parent_id": "t1_gew0mt3",
            "score": 1,
            "created_utc": 1607298855.0,
            "replies": []
        },
        {
            "body": "For sure.  The free spenders are the easiest to deal with.  The good old boys that own a successful construction or sales guys.    The doctors, lawyers, engineers, accountants, etc tend to have a different mentality and are tighter.",
            "author": "LotBuilder",
            "id": "gex6aj0",
            "parent_id": "t1_gex5r9c",
            "score": 1,
            "created_utc": 1607324683.0,
            "replies": []
        },
        {
            "body": "So ironically true. \n\nI can see all the people counting zeros on their fingers as I’m responding",
            "author": "BGDDDY1",
            "id": "gew6ifw",
            "parent_id": "t1_gew1je2",
            "score": 2,
            "created_utc": 1607301697.0,
            "replies": [
                {
                    "body": "😂 I was just following suit since you mentioned digits haha 😆",
                    "author": "ExExpectations",
                    "id": "gew88fd",
                    "parent_id": "t1_gew6ifw",
                    "score": 1,
                    "created_utc": 1607302660.0,
                    "replies": [
                        {
                            "body": "😘",
                            "author": "BGDDDY1",
                            "id": "gew8cmq",
                            "parent_id": "t1_gew88fd",
                            "score": 2,
                            "created_utc": 1607302727.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gew0nxi",
            "parent_id": "t1_gew03rl",
            "score": 4,
            "created_utc": 1607298648.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gew0ugy",
                    "parent_id": "t1_gew0nxi",
                    "score": 1,
                    "created_utc": 1607298739.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gew10z8",
                            "parent_id": "t1_gew0ugy",
                            "score": 5,
                            "created_utc": 1607298832.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gew15ba",
            "parent_id": "t1_gew0z7j",
            "score": 2,
            "created_utc": 1607298894.0,
            "replies": []
        },
        {
            "body": " See to me Splenda refers to how much you’ll give to your SB not how much the SD is. But that’s just me. Like it’s great if you make 8 figures but if you’re battering bc you don’t wanna spend more than 3 figures a month you a Splenda, be you 10 figures or 5 figures",
            "author": "Saskcatwhore",
            "id": "gewjm2t",
            "parent_id": "t1_gevkkk7",
            "score": 4,
            "created_utc": 1607309003.0,
            "replies": [
                {
                    "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
                    "author": "LotBuilder",
                    "id": "gewk5xy",
                    "parent_id": "t1_gewjm2t",
                    "score": 1,
                    "created_utc": 1607309315.0,
                    "replies": [
                        {
                            "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                            "author": "Saskcatwhore",
                            "id": "gewkz83",
                            "parent_id": "t1_gewk5xy",
                            "score": 1,
                            "created_utc": 1607309777.0,
                            "replies": [
                                {
                                    "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                                    "author": "LotBuilder",
                                    "id": "geworqw",
                                    "parent_id": "t1_gewkz83",
                                    "score": 3,
                                    "created_utc": 1607311996.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed",
            "author": "insertsnappyname",
            "id": "gf44m5z",
            "parent_id": "t1_gevkkk7",
            "score": 1,
            "created_utc": 1607473536.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gevyvam",
            "parent_id": "t1_gevyv8u",
            "score": 1,
            "created_utc": 1607297709.0,
            "replies": []
        },
        {
            "body": "😂 I was just following suit since you mentioned digits haha 😆",
            "author": "ExExpectations",
            "id": "gew88fd",
            "parent_id": "t1_gew6ifw",
            "score": 1,
            "created_utc": 1607302660.0,
            "replies": [
                {
                    "body": "😘",
                    "author": "BGDDDY1",
                    "id": "gew8cmq",
                    "parent_id": "t1_gew88fd",
                    "score": 2,
                    "created_utc": 1607302727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gew0ugy",
            "parent_id": "t1_gew0nxi",
            "score": 1,
            "created_utc": 1607298739.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gew10z8",
                    "parent_id": "t1_gew0ugy",
                    "score": 5,
                    "created_utc": 1607298832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That wasn’t the context but I agree.   SD’s are either below the local market, at the local market or above the local market.   And usually the allowance is just a starting point,  most girls are just too new or near sighted to see that.    There is a lot of value in having a wealthy guy in your back pocket for when life’s emergencies arise.   Most of us end up doing things down the road that we never would have agreed to up front but we care for them and see a legitimate need.",
            "author": "LotBuilder",
            "id": "gewk5xy",
            "parent_id": "t1_gewjm2t",
            "score": 1,
            "created_utc": 1607309315.0,
            "replies": [
                {
                    "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
                    "author": "Saskcatwhore",
                    "id": "gewkz83",
                    "parent_id": "t1_gewk5xy",
                    "score": 1,
                    "created_utc": 1607309777.0,
                    "replies": [
                        {
                            "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                            "author": "LotBuilder",
                            "id": "geworqw",
                            "parent_id": "t1_gewkz83",
                            "score": 3,
                            "created_utc": 1607311996.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😘",
            "author": "BGDDDY1",
            "id": "gew8cmq",
            "parent_id": "t1_gew88fd",
            "score": 2,
            "created_utc": 1607302727.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gew10z8",
            "parent_id": "t1_gew0ugy",
            "score": 5,
            "created_utc": 1607298832.0,
            "replies": []
        },
        {
            "body": "Sorry I’m at like...23 hours no sleep? So reading context is a bit of a struggle. And there is value to that but not if a man making 6-7 figures only wants to spend 3 figures, yet expect meeting 2-4 times a week expecting intimacy (a POT I just met..). There’s a point as a SB we also need to think of if having this nice guy in a relationship worth barely breaking even between travel, self care to hold physical expectations, loss of potential income and otherwise. Splenda in way I see it used in SB groups I am in is often used in reference to guys just above salt or Splendas that I appreciate reading about, that understand they’re paying below market but not expecting above market $$(ie online only platonic text etc).",
            "author": "Saskcatwhore",
            "id": "gewkz83",
            "parent_id": "t1_gewk5xy",
            "score": 1,
            "created_utc": 1607309777.0,
            "replies": [
                {
                    "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
                    "author": "LotBuilder",
                    "id": "geworqw",
                    "parent_id": "t1_gewkz83",
                    "score": 3,
                    "created_utc": 1607311996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Each girl has a different definition of what’s “worth it”.  I’ve never said anything bad about a girl whose expectations don’t line with with mine.  I wish them the best.  I would day a SD is Splenda if he is offering a monthly allowance that is below the average 1 bedroom apartment in that city.",
            "author": "LotBuilder",
            "id": "geworqw",
            "parent_id": "t1_gewkz83",
            "score": 3,
            "created_utc": 1607311996.0,
            "replies": []
        }
    ]
}