{
    "title": "New SB’s pls do your homework!",
    "post_id": "xy12zn",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xy12zn/new_sbs_pls_do_your_homework/",
    "author": null,
    "body": "I’m proud new SB’s are on the forum and trying to learn.. but WHY do some wait to apply our advice until it’s too late?? I understand advice can be subjective, but some advice is “no exception until proven otherwise” (for your safety and to avoid scams.) Seasoned SD’s and SB’s are here to help you! We can’t help if you completely ignore our advice, come back & post excuses why you didn’t listen so now you need help or clarification. \n\nI read too many posts lately about new SB’s sending their bank info, sleeping with a POT without an allowance/ppm established, or sending nudes with their face included but haven’t met irl. New SB’s- Please do your homework, take notes and apply it sooner rather than later.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xy12zn/new_sbs_pls_do_your_homework/",
    "score": 157,
    "upvote_ratio": 0.96,
    "created_utc": 1665154111.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Some people don’t learn until it happens to them. Or they are completely desperate.\nRule I always go by, if it sounds to good to be true; it is.",
            "author": "Important-Sherbert-1",
            "id": "iresjac",
            "parent_id": "t3_xy12zn",
            "score": 44,
            "created_utc": 1665154525.0,
            "replies": [
                {
                    "body": "Same for us SDs when we hear the ladies raving about “previous SD” who gave them truckloads of cash for platonic!!!",
                    "author": null,
                    "id": "irfppx3",
                    "parent_id": "t1_iresjac",
                    "score": 6,
                    "created_utc": 1665169525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To u/pwatk29 's point in another response, about an SB saying \"I've been reading slf but...\" and then goes on to get scammed on exactly the scam we all warn about over and over...\n\nThis happens incredibly often.  On the scam thread, you might notice that many of the scams now are written as \"he wants you to buy a google or steam or itunes *or any other card whatsoever for any reason whatsoever*\", \"he wants to have his personal assistant or accountant or lawyer or CFO *or any other person whatsoever* send you your allowance\", etc.\n\nI've had to do that because as SBs came in to the scam thread or DM'ed me directly, and told me they'd been scammed, I found that they often had read the scam thread, **but desperately looked for any possible reason to not consider the scam to apply to them**.  If I didn't name the right card, they decided it wasn't a match.  If it was their butler who was going to send the allowance, and I didn't specifically name butler, then it wasn't a match.  I recently got a DM from someone whose situation exactly, perfectly matched the scam described in the scam thread, but the scammer-SD was a diamond member, and she's not sure if this applies to diamond members.\n\nI am re-thinking my approach of how to get this across.  I never expected how aggressively and overwhelmingly people's various emotional motivations (e.g. desperation) would drive them to find any way to be scammed, victimized, or used for sex, even when they've read clear guidance on how to identify and avoid it.",
            "author": "Azurecole",
            "id": "irfdaxo",
            "parent_id": "t3_xy12zn",
            "score": 29,
            "created_utc": 1665163851.0,
            "replies": [
                {
                    "body": "These girls are too desperate. Go get a job and be able to pay your own bills! Become self sufficient. Take care of yourself and stop getting into this so a man can take care of you and you become financially dependent on him. Stop looking for the \"easy\" way out. Sugaring should serve as a supplement / bonus, not something you're doing because you feel you have no other option. A desperate mind will always override a logical one.",
                    "author": "candygirlcj",
                    "id": "irffl9b",
                    "parent_id": "t1_irfdaxo",
                    "score": 21,
                    "created_utc": 1665164875.0,
                    "replies": [
                        {
                            "body": "I've started letting them know right away that if they're looking for a savior - they need to keep looking.",
                            "author": "rodeopete3281",
                            "id": "irg4x9u",
                            "parent_id": "t1_irffl9b",
                            "score": 2,
                            "created_utc": 1665176587.0,
                            "replies": []
                        },
                        {
                            "body": "Amén candy! Perfectly said.",
                            "author": "starsdesires",
                            "id": "irhp8yw",
                            "parent_id": "t1_irffl9b",
                            "score": 2,
                            "created_utc": 1665210655.0,
                            "replies": []
                        },
                        {
                            "body": ">These women are too desperate.\n\nSums up almost every single \"woe is me\" post from SBs on this sub.",
                            "author": null,
                            "id": "irfqo7f",
                            "parent_id": "t1_irffl9b",
                            "score": 1,
                            "created_utc": 1665169973.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is really important. I’ve also felt that recently there have been too many posts, from both sides, seeming to say that the sd is paying for everything an sb may need. This is highly unlikely. It must be a supplement to your life or else it’s desperation and that leads to negative outcomes.",
                    "author": null,
                    "id": "irg6x9j",
                    "parent_id": "t1_irfdaxo",
                    "score": 4,
                    "created_utc": 1665177540.0,
                    "replies": []
                },
                {
                    "body": "The DESIRE to believe can outweigh any written word or spoken advice.  It’s the same impulse that encourages people to believe that the dice will come up, that the ball will land on their number, that the cards they’re being dealt will be a winning hand.\n\nI told multiple young soldiers ‘the stripper doesn’t love you’, and damned few listened.",
                    "author": "NVOkie9018",
                    "id": "irgpi9n",
                    "parent_id": "t1_irfdaxo",
                    "score": 3,
                    "created_utc": 1665187304.0,
                    "replies": []
                },
                {
                    "body": "I think it's a human thing to unconsciously not want to apply basic rules. I see it every day in life when I explain things and then my staff go and do entirely something else. Or when we do trainings and they say, \"oh, it's common sense\" and the next moment they completely do something else.\n\nI wonder if putting too much wording into an advice might be a hindrance. I see some basic rules here about scamming and I would sum it up as such:\n\n\"You (SB) are supposed to be paid. If anyone wants you to pay you for something, you are doing it wrong.\"\n\nI was given this advice in high school about human trafficking and looking for jobs abroad. If someone wants YOU to pay to work abroad, then they don't have good intentions. While I can't vouch for possible honest job offers among those, I have certainly never been trafficked.\n\nHowever, you just have to make your peace with the fact that people will always believe stories that are too good to be true.",
                    "author": "AnSteall",
                    "id": "iri5fps",
                    "parent_id": "t1_irfdaxo",
                    "score": 3,
                    "created_utc": 1665226370.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "literally if you send nudes to ANYONE, don’t show your face. do not show your face.",
            "author": null,
            "id": "iresai5",
            "parent_id": "t3_xy12zn",
            "score": 52,
            "created_utc": 1665154416.0,
            "replies": [
                {
                    "body": "*Now you tell me?!* 🤣",
                    "author": "Chill_SD1974",
                    "id": "ireyqek",
                    "parent_id": "t1_iresai5",
                    "score": 16,
                    "created_utc": 1665157337.0,
                    "replies": [
                        {
                            "body": "\\* Rapidly posting Chill\\_SD's nudes on every questionable site on the interwebs... \\*",
                            "author": "BinghamtonSD",
                            "id": "irfowbd",
                            "parent_id": "t1_ireyqek",
                            "score": 5,
                            "created_utc": 1665169145.0,
                            "replies": [
                                {
                                    "body": "If you would please avoid the SPH websites. I already have enough trauma just from my SB. \n\nThanks 😊",
                                    "author": "Chill_SD1974",
                                    "id": "irfv0xu",
                                    "parent_id": "t1_irfowbd",
                                    "score": 3,
                                    "created_utc": 1665171984.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "llamf!",
                            "author": "Unlikely_Factor_54",
                            "id": "irfbrdn",
                            "parent_id": "t1_ireyqek",
                            "score": 3,
                            "created_utc": 1665163156.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "irewlcr",
                    "parent_id": "t1_iresai5",
                    "score": 7,
                    "created_utc": 1665156368.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iu4pkmr",
                            "parent_id": "t1_irewlcr",
                            "score": 1,
                            "created_utc": 1666969874.0,
                            "replies": [
                                {
                                    "body": "you obviously do in your pfp",
                                    "author": null,
                                    "id": "ivjmel4",
                                    "parent_id": "t1_iu4pkmr",
                                    "score": 1,
                                    "created_utc": 1667914412.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "But my face is my best asset 😭😭😭",
                    "author": "llama_luff",
                    "id": "irft3qn",
                    "parent_id": "t1_iresai5",
                    "score": 3,
                    "created_utc": 1665171104.0,
                    "replies": [
                        {
                            "body": "I send nudes with only my face in it.",
                            "author": "SeekingInToronto",
                            "id": "irgabxc",
                            "parent_id": "t1_irft3qn",
                            "score": 11,
                            "created_utc": 1665179213.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "7 billion people on the planet and you think it's not anonymous enough?  I wouldn't give out a real name or phone number anyway so......",
                    "author": "Independent_Soil_256",
                    "id": "irgj5q0",
                    "parent_id": "t1_iresai5",
                    "score": 1,
                    "created_utc": 1665183787.0,
                    "replies": [
                        {
                            "body": "okay???",
                            "author": null,
                            "id": "irgqwa7",
                            "parent_id": "t1_irgj5q0",
                            "score": 1,
                            "created_utc": 1665188085.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A good portion of what I've seen has been a mix of two things:\n1) They don't have enough vanilla experience or confidence establishing boundaries. They end up going through with things because they're overly polite or don't trust their intuition.\n2) They are in a vulnerable financial situation. Perhaps the risk of being taken advantage of is less tangible that the risk of falling into or worsening their hardships. We're irrational creatures, and their minds might ignore red flags just because the alternative seems worse.",
            "author": "lardlovrr22",
            "id": "irfbl01",
            "parent_id": "t3_xy12zn",
            "score": 16,
            "created_utc": 1665163075.0,
            "replies": [
                {
                    "body": "It’s interesting to read an actual explanation and the psychology behind it. But imo, either reason means they shouldn’t be in the sugar bowl at all! The inability to set boundaries, or sugaring while financially desperate can be extremely dangerous.",
                    "author": null,
                    "id": "irfc6ki",
                    "parent_id": "t1_irfbl01",
                    "score": 7,
                    "created_utc": 1665163346.0,
                    "replies": [
                        {
                            "body": "I definitely agree they shouldn't be here, at least not yet. Technically, these are also two things warned about in this sub, so it doesn't really answer the question of why it still seems to happen so often.",
                            "author": "lardlovrr22",
                            "id": "irfcw1q",
                            "parent_id": "t1_irfc6ki",
                            "score": 2,
                            "created_utc": 1665163664.0,
                            "replies": [
                                {
                                    "body": "It happens so often because people want to sugar coat sugar relationships giving the impression that you will build a relationship with the other person. Using terms like ppm or allowance does not help either. If anyone would have told me right from the beginning that a SB is a sex worker, and you should expect to be paid for the services provided I do not think that I would had tried so hard to first stablish a relationship and never mention money because I did not want to sound like a prostitute. \n\nI am not saying that a SB is a prostitute either, but certainly the only relationship I was able to stablish with my SDs was sexual. I tried so hard to send messages during the week etc., but they would contact me only when they were horny. Now, I heard so many times people saying, \"this is not a real SD\" and blablabla. Really? Then, what is the guy paying for if not sex? Stop sugar coating things and these girls will have more realistic expectations.",
                                    "author": null,
                                    "id": "irgl2gz",
                                    "parent_id": "t1_irfcw1q",
                                    "score": 6,
                                    "created_utc": 1665184823.0,
                                    "replies": [
                                        {
                                            "body": "I couldn’t disagree more with this comment, and it’s sad. If your SD only cares about you in the bedroom or hits you up when he’s horny.. that’s not normal and please don’t try to pass that as “being realistic”. My main SD is my friend and his mood doesn’t shift if we have sex or not. We check in often, he calls when I need advice or is a shoulder to cry on when I had a bad day. We’re all free to define a SD/SB relationship as whatever we want, but your experiences sound toxic.",
                                            "author": null,
                                            "id": "irgno9c",
                                            "parent_id": "t1_irgl2gz",
                                            "score": 7,
                                            "created_utc": 1665186284.0,
                                            "replies": [
                                                {
                                                    "body": "I find great that you have a good relationship with your SD, that what I was looking for at the beginning. But you are an exception, otherwise there were not so many SBs in this site complaining about their SRs.",
                                                    "author": null,
                                                    "id": "irgozkc",
                                                    "parent_id": "t1_irgno9c",
                                                    "score": 2,
                                                    "created_utc": 1665187016.0,
                                                    "replies": [
                                                        {
                                                            "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
                                                            "author": "iknowwhatiwantbroski",
                                                            "id": "irhu4ip",
                                                            "parent_id": "t1_irgozkc",
                                                            "score": 1,
                                                            "created_utc": 1665215079.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                                                                    "author": null,
                                                                    "id": "iri7vj9",
                                                                    "parent_id": "t1_irhu4ip",
                                                                    "score": 1,
                                                                    "created_utc": 1665228511.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "if your “SD” has a bad day and wants to cry on your shoulder would you let him without any payment ?",
                                                    "author": "cen-x",
                                                    "id": "iri67v8",
                                                    "parent_id": "t1_irgno9c",
                                                    "score": 1,
                                                    "created_utc": 1665227075.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Knowledge isn't power... APPLIED knowledge is power!",
            "author": "NegativeRutabaga1145",
            "id": "irezm32",
            "parent_id": "t3_xy12zn",
            "score": 11,
            "created_utc": 1665157724.0,
            "replies": [
                {
                    "body": "And, good information in a toxic mind is still bad information, sadly.",
                    "author": "Unlikely_Factor_54",
                    "id": "irfcbus",
                    "parent_id": "t1_irezm32",
                    "score": 5,
                    "created_utc": 1665163412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because they do something stupid first, then look on Reddit for advice.",
            "author": "UseTheForceRey",
            "id": "ireshq3",
            "parent_id": "t3_xy12zn",
            "score": 16,
            "created_utc": 1665154506.0,
            "replies": [
                {
                    "body": "Yesterday I read a SB’s post that started with “Ive been reading the SLF, but..” then the post proceeded to be a situation that gets posted often (slept with POT with no allowance & got ghosted). So I don’t think they always do the stupid thing first then come to Reddit.. I think they’re just ignoring us.",
                    "author": null,
                    "id": "iretdlo",
                    "parent_id": "t1_ireshq3",
                    "score": 15,
                    "created_utc": 1665154907.0,
                    "replies": [
                        {
                            "body": "everybody thinks the bad stuff always happens to someone else. They think they are astute enough to avoid it. It is a cognitive bias. And you have to think of what is motivating SB - the dream of money. People do questionable things with the lure of money.",
                            "author": "Fabulous_Storm2437",
                            "id": "irewqou",
                            "parent_id": "t1_iretdlo",
                            "score": 14,
                            "created_utc": 1665156435.0,
                            "replies": [
                                {
                                    "body": "C'mon \"cognitive bias\". \n\n&#x200B;\n\nThe most interesting thing is that they truly believe there's no such thing as setting **themselves** up for unwanted situations.\n\n&#x200B;\n\n\"No\" **does** mean no, however; don't put yourself in a situation to need to say \"no\" to begin with.  A lot of these young SB's do, anyhow, and don't have the critical thinking skills to discern between a john and an SD.",
                                    "author": "Unlikely_Factor_54",
                                    "id": "irfc8a2",
                                    "parent_id": "t1_irewqou",
                                    "score": 5,
                                    "created_utc": 1665163367.0,
                                    "replies": [
                                        {
                                            "body": "But also, many of these girls are escorts without actually realizing it.",
                                            "author": null,
                                            "id": "irfquk0",
                                            "parent_id": "t1_irfc8a2",
                                            "score": 2,
                                            "created_utc": 1665170058.0,
                                            "replies": [
                                                {
                                                    "body": "..honey, you're being kind.  they aren't even qualified to be Escorts.  these girls standards and attributes aren't high enough for that.  you have to make mid-six figures, have no tattoos, and come from a stable two-parent home, with a graduated degree to qualify to be an Escort... hahaha!",
                                                    "author": "Unlikely_Factor_54",
                                                    "id": "irpihus",
                                                    "parent_id": "t1_irfquk0",
                                                    "score": 1,
                                                    "created_utc": 1665364769.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Agreed",
                            "author": "Chill_SD1974",
                            "id": "ireykop",
                            "parent_id": "t1_iretdlo",
                            "score": 1,
                            "created_utc": 1665157266.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Experience is a good teacher for sure😩😩😩",
            "author": "Goodies4U82",
            "id": "iret8nq",
            "parent_id": "t3_xy12zn",
            "score": 8,
            "created_utc": 1665154844.0,
            "replies": []
        },
        {
            "body": "I don’t think anyone on this sub wants to see a SB get hurt or taken advantage of.",
            "author": "NVOkie9018",
            "id": "irf4gqk",
            "parent_id": "t3_xy12zn",
            "score": 8,
            "created_utc": 1665159903.0,
            "replies": []
        },
        {
            "body": "I wouldn’t even send my bank info to my mama",
            "author": "SailorSlay",
            "id": "irfc7hq",
            "parent_id": "t3_xy12zn",
            "score": 4,
            "created_utc": 1665163358.0,
            "replies": [
                {
                    "body": "🤣🤣🤣🤣",
                    "author": "JustAsk4Alice",
                    "id": "irffurx",
                    "parent_id": "t1_irfc7hq",
                    "score": 2,
                    "created_utc": 1665164994.0,
                    "replies": []
                },
                {
                    "body": "What about my mama?  That's different, right?",
                    "author": "Bflat2012",
                    "id": "irfgofu",
                    "parent_id": "t1_irfc7hq",
                    "score": 2,
                    "created_utc": 1665165360.0,
                    "replies": [
                        {
                            "body": "Yo mama is so old... her bank account number is 000 0000 0001!",
                            "author": "BinghamtonSD",
                            "id": "irfpj31",
                            "parent_id": "t1_irfgofu",
                            "score": 6,
                            "created_utc": 1665169437.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But how do you ask for money, if you can’t do an online transfer?",
                    "author": "ThatCardiologist78",
                    "id": "irkpywd",
                    "parent_id": "t1_irfc7hq",
                    "score": 1,
                    "created_utc": 1665274861.0,
                    "replies": [
                        {
                            "body": "There’s always cash app",
                            "author": "SailorSlay",
                            "id": "irl5dn8",
                            "parent_id": "t1_irkpywd",
                            "score": 1,
                            "created_utc": 1665282444.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The desire to believe is also strong. \n\nThis subreddit often talks about the lives that sbs live and make it sound like it’s one party to the next always surrounded by other young and beautiful friends. But, there are a lot of lonely people in the world. And loneliness, plus a tough financial situation, plus inexperience along with a strong desire to believe it’s true is a very potent cocktail.",
            "author": null,
            "id": "irg7m73",
            "parent_id": "t3_xy12zn",
            "score": 5,
            "created_utc": 1665177869.0,
            "replies": []
        },
        {
            "body": "\\*stands, in ovation\\*",
            "author": "Unlikely_Factor_54",
            "id": "irfbo4z",
            "parent_id": "t3_xy12zn",
            "score": 3,
            "created_utc": 1665163114.0,
            "replies": []
        },
        {
            "body": "I've seen this with SDs too. I've had a few offer to pay for something for me before we even met and it was nice, and I did meet them later, but I know most SBs would not",
            "author": "Charming-Eye-1309",
            "id": "irevtxi",
            "parent_id": "t3_xy12zn",
            "score": 4,
            "created_utc": 1665156024.0,
            "replies": [
                {
                    "body": "That's bc THOSE SBs don't know what the hell they are even doing.\n\nSometimes faking the funk, don't play out well...this is one of those situations.",
                    "author": "JustAsk4Alice",
                    "id": "irfftg3",
                    "parent_id": "t1_irevtxi",
                    "score": 1,
                    "created_utc": 1665164977.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How DARE you give advice when they are already getting best in class advice from “experts” and “mentors” on YouTube and TikTok.",
            "author": null,
            "id": "irezs37",
            "parent_id": "t3_xy12zn",
            "score": 5,
            "created_utc": 1665157798.0,
            "replies": [
                {
                    "body": "Whenever someone mentions getting advice from a sugar baby on YouTube or tiktok I die a little inside. Their job is to sell you the idea that they are a trustworthy source on sugaring, not to give you an accurate representation of their life. Their job is to make you want to listen to them! They are not your mentor!",
                    "author": "Tribonal",
                    "id": "iri7rwe",
                    "parent_id": "t1_irezs37",
                    "score": 2,
                    "created_utc": 1665228428.0,
                    "replies": []
                },
                {
                    "body": "Who are these experts that keep getting cited?",
                    "author": null,
                    "id": "irfr0qj",
                    "parent_id": "t1_irezs37",
                    "score": 1,
                    "created_utc": 1665170137.0,
                    "replies": [
                        {
                            "body": "Mostly current full time escorts who moonlight as SBs and experts!",
                            "author": null,
                            "id": "irfs7k3",
                            "parent_id": "t1_irfr0qj",
                            "score": 2,
                            "created_utc": 1665170688.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because all these situations are far more nuanced than one thinks. It’s easy in the moment to overlook and overthink and have benefit of the doubt.",
            "author": "GlitterAndSugar",
            "id": "irf16o1",
            "parent_id": "t3_xy12zn",
            "score": 2,
            "created_utc": 1665158426.0,
            "replies": []
        },
        {
            "body": "Also good if new SBs could avoid issues such as trying to do online or platonic or ask for dinner fees.",
            "author": "Mainlyharmless",
            "id": "irez9bc",
            "parent_id": "t3_xy12zn",
            "score": 2,
            "created_utc": 1665157569.0,
            "replies": [
                {
                    "body": "That's not EVER gonna stop happening hun.",
                    "author": "JustAsk4Alice",
                    "id": "irffyyj",
                    "parent_id": "t1_irez9bc",
                    "score": 2,
                    "created_utc": 1665165045.0,
                    "replies": [
                        {
                            "body": "Well the OP was asking for new SBs to read all the advice here before stepping into the bowl.  If they do, they will also read about those issues as well. \n\nOne can only hope.  At the very least if they read everything first we would get a lot fewer posts about newbies asking how they can get an online or platonic SD.",
                            "author": "Mainlyharmless",
                            "id": "irfgmap",
                            "parent_id": "t1_irffyyj",
                            "score": 2,
                            "created_utc": 1665165334.0,
                            "replies": [
                                {
                                    "body": "I'll light a candle for the hope of it, but I don't suggest that either of us hold our breath on it.",
                                    "author": "JustAsk4Alice",
                                    "id": "irft0xo",
                                    "parent_id": "t1_irfgmap",
                                    "score": 1,
                                    "created_utc": 1665171069.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good for you, girl. You'll do just fine here 🙂",
            "author": "HailToTheQuinn",
            "id": "irfn74l",
            "parent_id": "t3_xy12zn",
            "score": 0,
            "created_utc": 1665168357.0,
            "replies": []
        },
        {
            "body": "Wait a minute. Where are these sb's? I've never come across one in my city that's not asked for some financial compensation straight off the bat before sleeping with someone. Maybe if ypu look like George Clooney or Brad Pitt...",
            "author": "WanderLustandBeyond",
            "id": "irg264l",
            "parent_id": "t3_xy12zn",
            "score": 0,
            "created_utc": 1665175290.0,
            "replies": []
        },
        {
            "body": "I've been fascinated with the thought of becoming a SB. Any advice yall seasoned SBs would give me just starting out?",
            "author": "musitanow",
            "id": "is43ppx",
            "parent_id": "t3_xy12zn",
            "score": 1,
            "created_utc": 1665632909.0,
            "replies": [
                {
                    "body": "Yes.. Read the forum and learn from other peoples mistakes. Always money before honey, no exceptions.",
                    "author": null,
                    "id": "is4eqwx",
                    "parent_id": "t1_is43ppx",
                    "score": 1,
                    "created_utc": 1665639957.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The fucking moment when the bank info and nudes are you 🤦🏻‍♀️",
            "author": "Winter-is-comingg",
            "id": "isjz20v",
            "parent_id": "t3_xy12zn",
            "score": 1,
            "created_utc": 1665935116.0,
            "replies": []
        },
        {
            "body": "Same for us SDs when we hear the ladies raving about “previous SD” who gave them truckloads of cash for platonic!!!",
            "author": null,
            "id": "irfppx3",
            "parent_id": "t1_iresjac",
            "score": 6,
            "created_utc": 1665169525.0,
            "replies": []
        },
        {
            "body": "These girls are too desperate. Go get a job and be able to pay your own bills! Become self sufficient. Take care of yourself and stop getting into this so a man can take care of you and you become financially dependent on him. Stop looking for the \"easy\" way out. Sugaring should serve as a supplement / bonus, not something you're doing because you feel you have no other option. A desperate mind will always override a logical one.",
            "author": "candygirlcj",
            "id": "irffl9b",
            "parent_id": "t1_irfdaxo",
            "score": 21,
            "created_utc": 1665164875.0,
            "replies": [
                {
                    "body": "I've started letting them know right away that if they're looking for a savior - they need to keep looking.",
                    "author": "rodeopete3281",
                    "id": "irg4x9u",
                    "parent_id": "t1_irffl9b",
                    "score": 2,
                    "created_utc": 1665176587.0,
                    "replies": []
                },
                {
                    "body": "Amén candy! Perfectly said.",
                    "author": "starsdesires",
                    "id": "irhp8yw",
                    "parent_id": "t1_irffl9b",
                    "score": 2,
                    "created_utc": 1665210655.0,
                    "replies": []
                },
                {
                    "body": ">These women are too desperate.\n\nSums up almost every single \"woe is me\" post from SBs on this sub.",
                    "author": null,
                    "id": "irfqo7f",
                    "parent_id": "t1_irffl9b",
                    "score": 1,
                    "created_utc": 1665169973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is really important. I’ve also felt that recently there have been too many posts, from both sides, seeming to say that the sd is paying for everything an sb may need. This is highly unlikely. It must be a supplement to your life or else it’s desperation and that leads to negative outcomes.",
            "author": null,
            "id": "irg6x9j",
            "parent_id": "t1_irfdaxo",
            "score": 4,
            "created_utc": 1665177540.0,
            "replies": []
        },
        {
            "body": "The DESIRE to believe can outweigh any written word or spoken advice.  It’s the same impulse that encourages people to believe that the dice will come up, that the ball will land on their number, that the cards they’re being dealt will be a winning hand.\n\nI told multiple young soldiers ‘the stripper doesn’t love you’, and damned few listened.",
            "author": "NVOkie9018",
            "id": "irgpi9n",
            "parent_id": "t1_irfdaxo",
            "score": 3,
            "created_utc": 1665187304.0,
            "replies": []
        },
        {
            "body": "I think it's a human thing to unconsciously not want to apply basic rules. I see it every day in life when I explain things and then my staff go and do entirely something else. Or when we do trainings and they say, \"oh, it's common sense\" and the next moment they completely do something else.\n\nI wonder if putting too much wording into an advice might be a hindrance. I see some basic rules here about scamming and I would sum it up as such:\n\n\"You (SB) are supposed to be paid. If anyone wants you to pay you for something, you are doing it wrong.\"\n\nI was given this advice in high school about human trafficking and looking for jobs abroad. If someone wants YOU to pay to work abroad, then they don't have good intentions. While I can't vouch for possible honest job offers among those, I have certainly never been trafficked.\n\nHowever, you just have to make your peace with the fact that people will always believe stories that are too good to be true.",
            "author": "AnSteall",
            "id": "iri5fps",
            "parent_id": "t1_irfdaxo",
            "score": 3,
            "created_utc": 1665226370.0,
            "replies": []
        },
        {
            "body": "*Now you tell me?!* 🤣",
            "author": "Chill_SD1974",
            "id": "ireyqek",
            "parent_id": "t1_iresai5",
            "score": 16,
            "created_utc": 1665157337.0,
            "replies": [
                {
                    "body": "\\* Rapidly posting Chill\\_SD's nudes on every questionable site on the interwebs... \\*",
                    "author": "BinghamtonSD",
                    "id": "irfowbd",
                    "parent_id": "t1_ireyqek",
                    "score": 5,
                    "created_utc": 1665169145.0,
                    "replies": [
                        {
                            "body": "If you would please avoid the SPH websites. I already have enough trauma just from my SB. \n\nThanks 😊",
                            "author": "Chill_SD1974",
                            "id": "irfv0xu",
                            "parent_id": "t1_irfowbd",
                            "score": 3,
                            "created_utc": 1665171984.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "llamf!",
                    "author": "Unlikely_Factor_54",
                    "id": "irfbrdn",
                    "parent_id": "t1_ireyqek",
                    "score": 3,
                    "created_utc": 1665163156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "irewlcr",
            "parent_id": "t1_iresai5",
            "score": 7,
            "created_utc": 1665156368.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iu4pkmr",
                    "parent_id": "t1_irewlcr",
                    "score": 1,
                    "created_utc": 1666969874.0,
                    "replies": [
                        {
                            "body": "you obviously do in your pfp",
                            "author": null,
                            "id": "ivjmel4",
                            "parent_id": "t1_iu4pkmr",
                            "score": 1,
                            "created_utc": 1667914412.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But my face is my best asset 😭😭😭",
            "author": "llama_luff",
            "id": "irft3qn",
            "parent_id": "t1_iresai5",
            "score": 3,
            "created_utc": 1665171104.0,
            "replies": [
                {
                    "body": "I send nudes with only my face in it.",
                    "author": "SeekingInToronto",
                    "id": "irgabxc",
                    "parent_id": "t1_irft3qn",
                    "score": 11,
                    "created_utc": 1665179213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "7 billion people on the planet and you think it's not anonymous enough?  I wouldn't give out a real name or phone number anyway so......",
            "author": "Independent_Soil_256",
            "id": "irgj5q0",
            "parent_id": "t1_iresai5",
            "score": 1,
            "created_utc": 1665183787.0,
            "replies": [
                {
                    "body": "okay???",
                    "author": null,
                    "id": "irgqwa7",
                    "parent_id": "t1_irgj5q0",
                    "score": 1,
                    "created_utc": 1665188085.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s interesting to read an actual explanation and the psychology behind it. But imo, either reason means they shouldn’t be in the sugar bowl at all! The inability to set boundaries, or sugaring while financially desperate can be extremely dangerous.",
            "author": null,
            "id": "irfc6ki",
            "parent_id": "t1_irfbl01",
            "score": 7,
            "created_utc": 1665163346.0,
            "replies": [
                {
                    "body": "I definitely agree they shouldn't be here, at least not yet. Technically, these are also two things warned about in this sub, so it doesn't really answer the question of why it still seems to happen so often.",
                    "author": "lardlovrr22",
                    "id": "irfcw1q",
                    "parent_id": "t1_irfc6ki",
                    "score": 2,
                    "created_utc": 1665163664.0,
                    "replies": [
                        {
                            "body": "It happens so often because people want to sugar coat sugar relationships giving the impression that you will build a relationship with the other person. Using terms like ppm or allowance does not help either. If anyone would have told me right from the beginning that a SB is a sex worker, and you should expect to be paid for the services provided I do not think that I would had tried so hard to first stablish a relationship and never mention money because I did not want to sound like a prostitute. \n\nI am not saying that a SB is a prostitute either, but certainly the only relationship I was able to stablish with my SDs was sexual. I tried so hard to send messages during the week etc., but they would contact me only when they were horny. Now, I heard so many times people saying, \"this is not a real SD\" and blablabla. Really? Then, what is the guy paying for if not sex? Stop sugar coating things and these girls will have more realistic expectations.",
                            "author": null,
                            "id": "irgl2gz",
                            "parent_id": "t1_irfcw1q",
                            "score": 6,
                            "created_utc": 1665184823.0,
                            "replies": [
                                {
                                    "body": "I couldn’t disagree more with this comment, and it’s sad. If your SD only cares about you in the bedroom or hits you up when he’s horny.. that’s not normal and please don’t try to pass that as “being realistic”. My main SD is my friend and his mood doesn’t shift if we have sex or not. We check in often, he calls when I need advice or is a shoulder to cry on when I had a bad day. We’re all free to define a SD/SB relationship as whatever we want, but your experiences sound toxic.",
                                    "author": null,
                                    "id": "irgno9c",
                                    "parent_id": "t1_irgl2gz",
                                    "score": 7,
                                    "created_utc": 1665186284.0,
                                    "replies": [
                                        {
                                            "body": "I find great that you have a good relationship with your SD, that what I was looking for at the beginning. But you are an exception, otherwise there were not so many SBs in this site complaining about their SRs.",
                                            "author": null,
                                            "id": "irgozkc",
                                            "parent_id": "t1_irgno9c",
                                            "score": 2,
                                            "created_utc": 1665187016.0,
                                            "replies": [
                                                {
                                                    "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
                                                    "author": "iknowwhatiwantbroski",
                                                    "id": "irhu4ip",
                                                    "parent_id": "t1_irgozkc",
                                                    "score": 1,
                                                    "created_utc": 1665215079.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                                                            "author": null,
                                                            "id": "iri7vj9",
                                                            "parent_id": "t1_irhu4ip",
                                                            "score": 1,
                                                            "created_utc": 1665228511.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "if your “SD” has a bad day and wants to cry on your shoulder would you let him without any payment ?",
                                            "author": "cen-x",
                                            "id": "iri67v8",
                                            "parent_id": "t1_irgno9c",
                                            "score": 1,
                                            "created_utc": 1665227075.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And, good information in a toxic mind is still bad information, sadly.",
            "author": "Unlikely_Factor_54",
            "id": "irfcbus",
            "parent_id": "t1_irezm32",
            "score": 5,
            "created_utc": 1665163412.0,
            "replies": []
        },
        {
            "body": "Yesterday I read a SB’s post that started with “Ive been reading the SLF, but..” then the post proceeded to be a situation that gets posted often (slept with POT with no allowance & got ghosted). So I don’t think they always do the stupid thing first then come to Reddit.. I think they’re just ignoring us.",
            "author": null,
            "id": "iretdlo",
            "parent_id": "t1_ireshq3",
            "score": 15,
            "created_utc": 1665154907.0,
            "replies": [
                {
                    "body": "everybody thinks the bad stuff always happens to someone else. They think they are astute enough to avoid it. It is a cognitive bias. And you have to think of what is motivating SB - the dream of money. People do questionable things with the lure of money.",
                    "author": "Fabulous_Storm2437",
                    "id": "irewqou",
                    "parent_id": "t1_iretdlo",
                    "score": 14,
                    "created_utc": 1665156435.0,
                    "replies": [
                        {
                            "body": "C'mon \"cognitive bias\". \n\n&#x200B;\n\nThe most interesting thing is that they truly believe there's no such thing as setting **themselves** up for unwanted situations.\n\n&#x200B;\n\n\"No\" **does** mean no, however; don't put yourself in a situation to need to say \"no\" to begin with.  A lot of these young SB's do, anyhow, and don't have the critical thinking skills to discern between a john and an SD.",
                            "author": "Unlikely_Factor_54",
                            "id": "irfc8a2",
                            "parent_id": "t1_irewqou",
                            "score": 5,
                            "created_utc": 1665163367.0,
                            "replies": [
                                {
                                    "body": "But also, many of these girls are escorts without actually realizing it.",
                                    "author": null,
                                    "id": "irfquk0",
                                    "parent_id": "t1_irfc8a2",
                                    "score": 2,
                                    "created_utc": 1665170058.0,
                                    "replies": [
                                        {
                                            "body": "..honey, you're being kind.  they aren't even qualified to be Escorts.  these girls standards and attributes aren't high enough for that.  you have to make mid-six figures, have no tattoos, and come from a stable two-parent home, with a graduated degree to qualify to be an Escort... hahaha!",
                                            "author": "Unlikely_Factor_54",
                                            "id": "irpihus",
                                            "parent_id": "t1_irfquk0",
                                            "score": 1,
                                            "created_utc": 1665364769.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed",
                    "author": "Chill_SD1974",
                    "id": "ireykop",
                    "parent_id": "t1_iretdlo",
                    "score": 1,
                    "created_utc": 1665157266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤣🤣🤣🤣",
            "author": "JustAsk4Alice",
            "id": "irffurx",
            "parent_id": "t1_irfc7hq",
            "score": 2,
            "created_utc": 1665164994.0,
            "replies": []
        },
        {
            "body": "What about my mama?  That's different, right?",
            "author": "Bflat2012",
            "id": "irfgofu",
            "parent_id": "t1_irfc7hq",
            "score": 2,
            "created_utc": 1665165360.0,
            "replies": [
                {
                    "body": "Yo mama is so old... her bank account number is 000 0000 0001!",
                    "author": "BinghamtonSD",
                    "id": "irfpj31",
                    "parent_id": "t1_irfgofu",
                    "score": 6,
                    "created_utc": 1665169437.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But how do you ask for money, if you can’t do an online transfer?",
            "author": "ThatCardiologist78",
            "id": "irkpywd",
            "parent_id": "t1_irfc7hq",
            "score": 1,
            "created_utc": 1665274861.0,
            "replies": [
                {
                    "body": "There’s always cash app",
                    "author": "SailorSlay",
                    "id": "irl5dn8",
                    "parent_id": "t1_irkpywd",
                    "score": 1,
                    "created_utc": 1665282444.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's bc THOSE SBs don't know what the hell they are even doing.\n\nSometimes faking the funk, don't play out well...this is one of those situations.",
            "author": "JustAsk4Alice",
            "id": "irfftg3",
            "parent_id": "t1_irevtxi",
            "score": 1,
            "created_utc": 1665164977.0,
            "replies": []
        },
        {
            "body": "Whenever someone mentions getting advice from a sugar baby on YouTube or tiktok I die a little inside. Their job is to sell you the idea that they are a trustworthy source on sugaring, not to give you an accurate representation of their life. Their job is to make you want to listen to them! They are not your mentor!",
            "author": "Tribonal",
            "id": "iri7rwe",
            "parent_id": "t1_irezs37",
            "score": 2,
            "created_utc": 1665228428.0,
            "replies": []
        },
        {
            "body": "Who are these experts that keep getting cited?",
            "author": null,
            "id": "irfr0qj",
            "parent_id": "t1_irezs37",
            "score": 1,
            "created_utc": 1665170137.0,
            "replies": [
                {
                    "body": "Mostly current full time escorts who moonlight as SBs and experts!",
                    "author": null,
                    "id": "irfs7k3",
                    "parent_id": "t1_irfr0qj",
                    "score": 2,
                    "created_utc": 1665170688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's not EVER gonna stop happening hun.",
            "author": "JustAsk4Alice",
            "id": "irffyyj",
            "parent_id": "t1_irez9bc",
            "score": 2,
            "created_utc": 1665165045.0,
            "replies": [
                {
                    "body": "Well the OP was asking for new SBs to read all the advice here before stepping into the bowl.  If they do, they will also read about those issues as well. \n\nOne can only hope.  At the very least if they read everything first we would get a lot fewer posts about newbies asking how they can get an online or platonic SD.",
                    "author": "Mainlyharmless",
                    "id": "irfgmap",
                    "parent_id": "t1_irffyyj",
                    "score": 2,
                    "created_utc": 1665165334.0,
                    "replies": [
                        {
                            "body": "I'll light a candle for the hope of it, but I don't suggest that either of us hold our breath on it.",
                            "author": "JustAsk4Alice",
                            "id": "irft0xo",
                            "parent_id": "t1_irfgmap",
                            "score": 1,
                            "created_utc": 1665171069.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes.. Read the forum and learn from other peoples mistakes. Always money before honey, no exceptions.",
            "author": null,
            "id": "is4eqwx",
            "parent_id": "t1_is43ppx",
            "score": 1,
            "created_utc": 1665639957.0,
            "replies": []
        },
        {
            "body": "I've started letting them know right away that if they're looking for a savior - they need to keep looking.",
            "author": "rodeopete3281",
            "id": "irg4x9u",
            "parent_id": "t1_irffl9b",
            "score": 2,
            "created_utc": 1665176587.0,
            "replies": []
        },
        {
            "body": "Amén candy! Perfectly said.",
            "author": "starsdesires",
            "id": "irhp8yw",
            "parent_id": "t1_irffl9b",
            "score": 2,
            "created_utc": 1665210655.0,
            "replies": []
        },
        {
            "body": ">These women are too desperate.\n\nSums up almost every single \"woe is me\" post from SBs on this sub.",
            "author": null,
            "id": "irfqo7f",
            "parent_id": "t1_irffl9b",
            "score": 1,
            "created_utc": 1665169973.0,
            "replies": []
        },
        {
            "body": "\\* Rapidly posting Chill\\_SD's nudes on every questionable site on the interwebs... \\*",
            "author": "BinghamtonSD",
            "id": "irfowbd",
            "parent_id": "t1_ireyqek",
            "score": 5,
            "created_utc": 1665169145.0,
            "replies": [
                {
                    "body": "If you would please avoid the SPH websites. I already have enough trauma just from my SB. \n\nThanks 😊",
                    "author": "Chill_SD1974",
                    "id": "irfv0xu",
                    "parent_id": "t1_irfowbd",
                    "score": 3,
                    "created_utc": 1665171984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "llamf!",
            "author": "Unlikely_Factor_54",
            "id": "irfbrdn",
            "parent_id": "t1_ireyqek",
            "score": 3,
            "created_utc": 1665163156.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iu4pkmr",
            "parent_id": "t1_irewlcr",
            "score": 1,
            "created_utc": 1666969874.0,
            "replies": [
                {
                    "body": "you obviously do in your pfp",
                    "author": null,
                    "id": "ivjmel4",
                    "parent_id": "t1_iu4pkmr",
                    "score": 1,
                    "created_utc": 1667914412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I send nudes with only my face in it.",
            "author": "SeekingInToronto",
            "id": "irgabxc",
            "parent_id": "t1_irft3qn",
            "score": 11,
            "created_utc": 1665179213.0,
            "replies": []
        },
        {
            "body": "okay???",
            "author": null,
            "id": "irgqwa7",
            "parent_id": "t1_irgj5q0",
            "score": 1,
            "created_utc": 1665188085.0,
            "replies": []
        },
        {
            "body": "I definitely agree they shouldn't be here, at least not yet. Technically, these are also two things warned about in this sub, so it doesn't really answer the question of why it still seems to happen so often.",
            "author": "lardlovrr22",
            "id": "irfcw1q",
            "parent_id": "t1_irfc6ki",
            "score": 2,
            "created_utc": 1665163664.0,
            "replies": [
                {
                    "body": "It happens so often because people want to sugar coat sugar relationships giving the impression that you will build a relationship with the other person. Using terms like ppm or allowance does not help either. If anyone would have told me right from the beginning that a SB is a sex worker, and you should expect to be paid for the services provided I do not think that I would had tried so hard to first stablish a relationship and never mention money because I did not want to sound like a prostitute. \n\nI am not saying that a SB is a prostitute either, but certainly the only relationship I was able to stablish with my SDs was sexual. I tried so hard to send messages during the week etc., but they would contact me only when they were horny. Now, I heard so many times people saying, \"this is not a real SD\" and blablabla. Really? Then, what is the guy paying for if not sex? Stop sugar coating things and these girls will have more realistic expectations.",
                    "author": null,
                    "id": "irgl2gz",
                    "parent_id": "t1_irfcw1q",
                    "score": 6,
                    "created_utc": 1665184823.0,
                    "replies": [
                        {
                            "body": "I couldn’t disagree more with this comment, and it’s sad. If your SD only cares about you in the bedroom or hits you up when he’s horny.. that’s not normal and please don’t try to pass that as “being realistic”. My main SD is my friend and his mood doesn’t shift if we have sex or not. We check in often, he calls when I need advice or is a shoulder to cry on when I had a bad day. We’re all free to define a SD/SB relationship as whatever we want, but your experiences sound toxic.",
                            "author": null,
                            "id": "irgno9c",
                            "parent_id": "t1_irgl2gz",
                            "score": 7,
                            "created_utc": 1665186284.0,
                            "replies": [
                                {
                                    "body": "I find great that you have a good relationship with your SD, that what I was looking for at the beginning. But you are an exception, otherwise there were not so many SBs in this site complaining about their SRs.",
                                    "author": null,
                                    "id": "irgozkc",
                                    "parent_id": "t1_irgno9c",
                                    "score": 2,
                                    "created_utc": 1665187016.0,
                                    "replies": [
                                        {
                                            "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
                                            "author": "iknowwhatiwantbroski",
                                            "id": "irhu4ip",
                                            "parent_id": "t1_irgozkc",
                                            "score": 1,
                                            "created_utc": 1665215079.0,
                                            "replies": [
                                                {
                                                    "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                                                    "author": null,
                                                    "id": "iri7vj9",
                                                    "parent_id": "t1_irhu4ip",
                                                    "score": 1,
                                                    "created_utc": 1665228511.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "if your “SD” has a bad day and wants to cry on your shoulder would you let him without any payment ?",
                                    "author": "cen-x",
                                    "id": "iri67v8",
                                    "parent_id": "t1_irgno9c",
                                    "score": 1,
                                    "created_utc": 1665227075.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "everybody thinks the bad stuff always happens to someone else. They think they are astute enough to avoid it. It is a cognitive bias. And you have to think of what is motivating SB - the dream of money. People do questionable things with the lure of money.",
            "author": "Fabulous_Storm2437",
            "id": "irewqou",
            "parent_id": "t1_iretdlo",
            "score": 14,
            "created_utc": 1665156435.0,
            "replies": [
                {
                    "body": "C'mon \"cognitive bias\". \n\n&#x200B;\n\nThe most interesting thing is that they truly believe there's no such thing as setting **themselves** up for unwanted situations.\n\n&#x200B;\n\n\"No\" **does** mean no, however; don't put yourself in a situation to need to say \"no\" to begin with.  A lot of these young SB's do, anyhow, and don't have the critical thinking skills to discern between a john and an SD.",
                    "author": "Unlikely_Factor_54",
                    "id": "irfc8a2",
                    "parent_id": "t1_irewqou",
                    "score": 5,
                    "created_utc": 1665163367.0,
                    "replies": [
                        {
                            "body": "But also, many of these girls are escorts without actually realizing it.",
                            "author": null,
                            "id": "irfquk0",
                            "parent_id": "t1_irfc8a2",
                            "score": 2,
                            "created_utc": 1665170058.0,
                            "replies": [
                                {
                                    "body": "..honey, you're being kind.  they aren't even qualified to be Escorts.  these girls standards and attributes aren't high enough for that.  you have to make mid-six figures, have no tattoos, and come from a stable two-parent home, with a graduated degree to qualify to be an Escort... hahaha!",
                                    "author": "Unlikely_Factor_54",
                                    "id": "irpihus",
                                    "parent_id": "t1_irfquk0",
                                    "score": 1,
                                    "created_utc": 1665364769.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed",
            "author": "Chill_SD1974",
            "id": "ireykop",
            "parent_id": "t1_iretdlo",
            "score": 1,
            "created_utc": 1665157266.0,
            "replies": []
        },
        {
            "body": "Yo mama is so old... her bank account number is 000 0000 0001!",
            "author": "BinghamtonSD",
            "id": "irfpj31",
            "parent_id": "t1_irfgofu",
            "score": 6,
            "created_utc": 1665169437.0,
            "replies": []
        },
        {
            "body": "There’s always cash app",
            "author": "SailorSlay",
            "id": "irl5dn8",
            "parent_id": "t1_irkpywd",
            "score": 1,
            "created_utc": 1665282444.0,
            "replies": []
        },
        {
            "body": "Mostly current full time escorts who moonlight as SBs and experts!",
            "author": null,
            "id": "irfs7k3",
            "parent_id": "t1_irfr0qj",
            "score": 2,
            "created_utc": 1665170688.0,
            "replies": []
        },
        {
            "body": "Well the OP was asking for new SBs to read all the advice here before stepping into the bowl.  If they do, they will also read about those issues as well. \n\nOne can only hope.  At the very least if they read everything first we would get a lot fewer posts about newbies asking how they can get an online or platonic SD.",
            "author": "Mainlyharmless",
            "id": "irfgmap",
            "parent_id": "t1_irffyyj",
            "score": 2,
            "created_utc": 1665165334.0,
            "replies": [
                {
                    "body": "I'll light a candle for the hope of it, but I don't suggest that either of us hold our breath on it.",
                    "author": "JustAsk4Alice",
                    "id": "irft0xo",
                    "parent_id": "t1_irfgmap",
                    "score": 1,
                    "created_utc": 1665171069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you would please avoid the SPH websites. I already have enough trauma just from my SB. \n\nThanks 😊",
            "author": "Chill_SD1974",
            "id": "irfv0xu",
            "parent_id": "t1_irfowbd",
            "score": 3,
            "created_utc": 1665171984.0,
            "replies": []
        },
        {
            "body": "you obviously do in your pfp",
            "author": null,
            "id": "ivjmel4",
            "parent_id": "t1_iu4pkmr",
            "score": 1,
            "created_utc": 1667914412.0,
            "replies": []
        },
        {
            "body": "It happens so often because people want to sugar coat sugar relationships giving the impression that you will build a relationship with the other person. Using terms like ppm or allowance does not help either. If anyone would have told me right from the beginning that a SB is a sex worker, and you should expect to be paid for the services provided I do not think that I would had tried so hard to first stablish a relationship and never mention money because I did not want to sound like a prostitute. \n\nI am not saying that a SB is a prostitute either, but certainly the only relationship I was able to stablish with my SDs was sexual. I tried so hard to send messages during the week etc., but they would contact me only when they were horny. Now, I heard so many times people saying, \"this is not a real SD\" and blablabla. Really? Then, what is the guy paying for if not sex? Stop sugar coating things and these girls will have more realistic expectations.",
            "author": null,
            "id": "irgl2gz",
            "parent_id": "t1_irfcw1q",
            "score": 6,
            "created_utc": 1665184823.0,
            "replies": [
                {
                    "body": "I couldn’t disagree more with this comment, and it’s sad. If your SD only cares about you in the bedroom or hits you up when he’s horny.. that’s not normal and please don’t try to pass that as “being realistic”. My main SD is my friend and his mood doesn’t shift if we have sex or not. We check in often, he calls when I need advice or is a shoulder to cry on when I had a bad day. We’re all free to define a SD/SB relationship as whatever we want, but your experiences sound toxic.",
                    "author": null,
                    "id": "irgno9c",
                    "parent_id": "t1_irgl2gz",
                    "score": 7,
                    "created_utc": 1665186284.0,
                    "replies": [
                        {
                            "body": "I find great that you have a good relationship with your SD, that what I was looking for at the beginning. But you are an exception, otherwise there were not so many SBs in this site complaining about their SRs.",
                            "author": null,
                            "id": "irgozkc",
                            "parent_id": "t1_irgno9c",
                            "score": 2,
                            "created_utc": 1665187016.0,
                            "replies": [
                                {
                                    "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
                                    "author": "iknowwhatiwantbroski",
                                    "id": "irhu4ip",
                                    "parent_id": "t1_irgozkc",
                                    "score": 1,
                                    "created_utc": 1665215079.0,
                                    "replies": [
                                        {
                                            "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                                            "author": null,
                                            "id": "iri7vj9",
                                            "parent_id": "t1_irhu4ip",
                                            "score": 1,
                                            "created_utc": 1665228511.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "if your “SD” has a bad day and wants to cry on your shoulder would you let him without any payment ?",
                            "author": "cen-x",
                            "id": "iri67v8",
                            "parent_id": "t1_irgno9c",
                            "score": 1,
                            "created_utc": 1665227075.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "C'mon \"cognitive bias\". \n\n&#x200B;\n\nThe most interesting thing is that they truly believe there's no such thing as setting **themselves** up for unwanted situations.\n\n&#x200B;\n\n\"No\" **does** mean no, however; don't put yourself in a situation to need to say \"no\" to begin with.  A lot of these young SB's do, anyhow, and don't have the critical thinking skills to discern between a john and an SD.",
            "author": "Unlikely_Factor_54",
            "id": "irfc8a2",
            "parent_id": "t1_irewqou",
            "score": 5,
            "created_utc": 1665163367.0,
            "replies": [
                {
                    "body": "But also, many of these girls are escorts without actually realizing it.",
                    "author": null,
                    "id": "irfquk0",
                    "parent_id": "t1_irfc8a2",
                    "score": 2,
                    "created_utc": 1665170058.0,
                    "replies": [
                        {
                            "body": "..honey, you're being kind.  they aren't even qualified to be Escorts.  these girls standards and attributes aren't high enough for that.  you have to make mid-six figures, have no tattoos, and come from a stable two-parent home, with a graduated degree to qualify to be an Escort... hahaha!",
                            "author": "Unlikely_Factor_54",
                            "id": "irpihus",
                            "parent_id": "t1_irfquk0",
                            "score": 1,
                            "created_utc": 1665364769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'll light a candle for the hope of it, but I don't suggest that either of us hold our breath on it.",
            "author": "JustAsk4Alice",
            "id": "irft0xo",
            "parent_id": "t1_irfgmap",
            "score": 1,
            "created_utc": 1665171069.0,
            "replies": []
        },
        {
            "body": "I couldn’t disagree more with this comment, and it’s sad. If your SD only cares about you in the bedroom or hits you up when he’s horny.. that’s not normal and please don’t try to pass that as “being realistic”. My main SD is my friend and his mood doesn’t shift if we have sex or not. We check in often, he calls when I need advice or is a shoulder to cry on when I had a bad day. We’re all free to define a SD/SB relationship as whatever we want, but your experiences sound toxic.",
            "author": null,
            "id": "irgno9c",
            "parent_id": "t1_irgl2gz",
            "score": 7,
            "created_utc": 1665186284.0,
            "replies": [
                {
                    "body": "I find great that you have a good relationship with your SD, that what I was looking for at the beginning. But you are an exception, otherwise there were not so many SBs in this site complaining about their SRs.",
                    "author": null,
                    "id": "irgozkc",
                    "parent_id": "t1_irgno9c",
                    "score": 2,
                    "created_utc": 1665187016.0,
                    "replies": [
                        {
                            "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
                            "author": "iknowwhatiwantbroski",
                            "id": "irhu4ip",
                            "parent_id": "t1_irgozkc",
                            "score": 1,
                            "created_utc": 1665215079.0,
                            "replies": [
                                {
                                    "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                                    "author": null,
                                    "id": "iri7vj9",
                                    "parent_id": "t1_irhu4ip",
                                    "score": 1,
                                    "created_utc": 1665228511.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "if your “SD” has a bad day and wants to cry on your shoulder would you let him without any payment ?",
                    "author": "cen-x",
                    "id": "iri67v8",
                    "parent_id": "t1_irgno9c",
                    "score": 1,
                    "created_utc": 1665227075.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But also, many of these girls are escorts without actually realizing it.",
            "author": null,
            "id": "irfquk0",
            "parent_id": "t1_irfc8a2",
            "score": 2,
            "created_utc": 1665170058.0,
            "replies": [
                {
                    "body": "..honey, you're being kind.  they aren't even qualified to be Escorts.  these girls standards and attributes aren't high enough for that.  you have to make mid-six figures, have no tattoos, and come from a stable two-parent home, with a graduated degree to qualify to be an Escort... hahaha!",
                    "author": "Unlikely_Factor_54",
                    "id": "irpihus",
                    "parent_id": "t1_irfquk0",
                    "score": 1,
                    "created_utc": 1665364769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I find great that you have a good relationship with your SD, that what I was looking for at the beginning. But you are an exception, otherwise there were not so many SBs in this site complaining about their SRs.",
            "author": null,
            "id": "irgozkc",
            "parent_id": "t1_irgno9c",
            "score": 2,
            "created_utc": 1665187016.0,
            "replies": [
                {
                    "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
                    "author": "iknowwhatiwantbroski",
                    "id": "irhu4ip",
                    "parent_id": "t1_irgozkc",
                    "score": 1,
                    "created_utc": 1665215079.0,
                    "replies": [
                        {
                            "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                            "author": null,
                            "id": "iri7vj9",
                            "parent_id": "t1_irhu4ip",
                            "score": 1,
                            "created_utc": 1665228511.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "if your “SD” has a bad day and wants to cry on your shoulder would you let him without any payment ?",
            "author": "cen-x",
            "id": "iri67v8",
            "parent_id": "t1_irgno9c",
            "score": 1,
            "created_utc": 1665227075.0,
            "replies": []
        },
        {
            "body": "..honey, you're being kind.  they aren't even qualified to be Escorts.  these girls standards and attributes aren't high enough for that.  you have to make mid-six figures, have no tattoos, and come from a stable two-parent home, with a graduated degree to qualify to be an Escort... hahaha!",
            "author": "Unlikely_Factor_54",
            "id": "irpihus",
            "parent_id": "t1_irfquk0",
            "score": 1,
            "created_utc": 1665364769.0,
            "replies": []
        },
        {
            "body": "Happy people generally dont feel the need to post. And the people who take the time to search for a sugar forum are usually the types looking for advice. Though we do get gushing posts now and then.\n\nSo yeah, dont go around telling women that they should 'expect' shitty behavior just because that's what you settled for. \n\nGet your money before your clothes come off yes, but dont tolerate john behavior if that's not what you want.",
            "author": "iknowwhatiwantbroski",
            "id": "irhu4ip",
            "parent_id": "t1_irgozkc",
            "score": 1,
            "created_utc": 1665215079.0,
            "replies": [
                {
                    "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
                    "author": null,
                    "id": "iri7vj9",
                    "parent_id": "t1_irhu4ip",
                    "score": 1,
                    "created_utc": 1665228511.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not telling anybody that they should expect shitty behavior, I am saying that shitty behavior is the norm not the exception, from both sides, SBs and SDs. Otherwise, you would not see so many posts from both about being used and scammed, and I have never settled down for shitty behavior either. The SR environment is extremely toxic, you learn that from the first minute you open an account at SA.",
            "author": null,
            "id": "iri7vj9",
            "parent_id": "t1_irhu4ip",
            "score": 1,
            "created_utc": 1665228511.0,
            "replies": []
        }
    ]
}