{
    "title": "SB’s save yourself the trouble and go for men 40+",
    "post_id": "m88nzm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m88nzm/sbs_save_yourself_the_trouble_and_go_for_men_40/",
    "author": "IngenuityAdept5380",
    "body": "Small rant but whatever...\n\nEven though my screening process is pretty straight forward it seems that every time I’ve come across a POT who’s younger then say 38, in the end they never fail to disappoint me. Yes even the ones with VERY high potential. Either they treat SA or these other sugar sites like it’s tinder/bumble to find their next girlfriend or they think they can get away with saying basically anything to you. I’ve had enough, literally. From now on I’m sticking with my 40+ rule. (The older the better)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m88nzm/sbs_save_yourself_the_trouble_and_go_for_men_40/",
    "score": 140,
    "upvote_ratio": 0.88,
    "created_utc": 1616126203.0,
    "num_comments": 138,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m all for men in the 40+ range but even some of them can be complete weirdos or entitled assholes. It’s less about age and more about maturity, often the two go hand in hand but not always. 🤷🏽‍♀️",
            "author": "curly_spice",
            "id": "grg2ex8",
            "parent_id": "t3_m88nzm",
            "score": 47,
            "created_utc": 1616126982.0,
            "replies": [
                {
                    "body": "> It’s less about age and more about maturity\n\nThis is true with so much in life.",
                    "author": "Y_4Z44",
                    "id": "grg2ol5",
                    "parent_id": "t1_grg2ex8",
                    "score": 19,
                    "created_utc": 1616127155.0,
                    "replies": []
                },
                {
                    "body": "That's the truth just because they are older doesn't mean they are mature.",
                    "author": "CombinationThin",
                    "id": "grgv5um",
                    "parent_id": "t1_grg2ex8",
                    "score": 7,
                    "created_utc": 1616152486.0,
                    "replies": []
                },
                {
                    "body": "This. Partially why I keep my options open still but I’ve had the most success with 40 and up lol",
                    "author": "IngenuityAdept5380",
                    "id": "grg7is3",
                    "parent_id": "t1_grg2ex8",
                    "score": 9,
                    "created_utc": 1616130438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Before I always thought older men, married men, men with daughters, etc. would at least treat women with some respect and wouldn’t stiff me since they’d not want the same thing happen to the important women in their lives. Turns out that was not the case at all. My philosophy has now become: a piece of shit is a piece of shit, and being 40+ something years old or having daughters doesn’t magically change that. So I keep an open minded, and cautious to everyone (as it should be in the bowl!)",
            "author": "Cornycorgichick",
            "id": "grg5864",
            "parent_id": "t3_m88nzm",
            "score": 107,
            "created_utc": 1616128806.0,
            "replies": [
                {
                    "body": ">as it should be in the bowl!).\n\n...as it should be in DATING!, especially online dating!).\n\nYes, there are bad actors in Sugar Dating, but there are bad actors in all forms of dating (especially online dating).  I'm not sure the % of bad actors is higher on Seeking than on Tinder, Hinge, Bumble, etc.  Many women Sugar Date because they want to avoid the toxic / abusive relationships they've found very common with younger vanilla boyfriends.",
                    "author": "willfromvb",
                    "id": "grgyq8h",
                    "parent_id": "t1_grg5864",
                    "score": 9,
                    "created_utc": 1616155165.0,
                    "replies": []
                },
                {
                    "body": "Yep. If they’re a piece of shit human, it doesn’t matter what age they are. \n\nExhibit 1,871,283 the ex president\n\nA 65 yo piece of shit is still a piece of shit. And so is a 35yo piece of shit.",
                    "author": "ExExpectations",
                    "id": "grg67bi",
                    "parent_id": "t1_grg5864",
                    "score": 34,
                    "created_utc": 1616129479.0,
                    "replies": []
                },
                {
                    "body": ">married men......would at least treat women with some respect \n\nIt should be obvious but just to be clear you're talking about married men whose wives know about the situation, correct? Because if not, he's made his lack of respect for her 100% clear.",
                    "author": null,
                    "id": "grh1aqz",
                    "parent_id": "t1_grg5864",
                    "score": 12,
                    "created_utc": 1616156904.0,
                    "replies": [
                        {
                            "body": "Yes",
                            "author": "Cornycorgichick",
                            "id": "grh1ggf",
                            "parent_id": "t1_grh1aqz",
                            "score": 2,
                            "created_utc": 1616157005.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "dimg dingg",
                    "author": "bookworm010101",
                    "id": "grgsg7s",
                    "parent_id": "t1_grg5864",
                    "score": 4,
                    "created_utc": 1616150085.0,
                    "replies": []
                },
                {
                    "body": "This is completely true, but it's a little hard to see why a relatively normal, decent guy in his 30s would engage in this lifestyle. Sure there are going to be the exceptions to that, but generally I suspect the POS percentage is going to be higher in the younger crowd because the incentives for a under 40s guy who is well off, professionally successful, relatively attractive and well-mannered, and respectful to women to engage in sugaring are just a lot less than for the 50+ crowd.",
                    "author": "ChapterRelative",
                    "id": "grgrxb8",
                    "parent_id": "t1_grg5864",
                    "score": 2,
                    "created_utc": 1616149587.0,
                    "replies": [
                        {
                            "body": "It’s pretty simple.  If you are 35 and a man of means you simple won’t have the opportunity to date an extremely hot 20 year old college cheerleader or and extremely hot 20 year old college sorority girl through vanilla dating, I’m talking the hottest women in the world.  But totally possible through sugar dating.",
                            "author": "pussy_impaler337",
                            "id": "grgt33e",
                            "parent_id": "t1_grgrxb8",
                            "score": 7,
                            "created_utc": 1616150682.0,
                            "replies": [
                                {
                                    "body": "This is very true as a 35 year old SD. I do ok with vanilla dating and using tinder, but it’s almost impossible for me to get that college cheerleader/sorority girl without offering sugar.",
                                    "author": "Fun_Focus8159",
                                    "id": "grhedxl",
                                    "parent_id": "t1_grgt33e",
                                    "score": 3,
                                    "created_utc": 1616164039.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thanks pussy_impaler, I stand corrected. 🙄",
                                    "author": "ChapterRelative",
                                    "id": "grgu44v",
                                    "parent_id": "t1_grgt33e",
                                    "score": 4,
                                    "created_utc": 1616151593.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well dressed, nice car, nice home, job description in place on my tinder and my bumble, account promoted, still get mostly interest from single mothers who barely graduated highschool, 40 lbs overweight, with kids by multiple fathers, who are unemployed and don't drive. On SA I'm meeting up and having dinner and seeing shows with tall athletic graduate students. Women who maintained academic scholarships while they were D1 athletes. If I want to go spend the weekend hiking in the mountains or charter a boat and sail around the bay that's way easier with the women I meet on SA than the women I don't meet through vanilla dating.",
                            "author": "Sugarbeggar",
                            "id": "gri3cpv",
                            "parent_id": "t1_grgrxb8",
                            "score": 3,
                            "created_utc": 1616175161.0,
                            "replies": [
                                {
                                    "body": "Ditto. Mid-30s here, same experience in vanilla. But every now and then, a decent vanilla match happens. Still remarkable how a piss poor the dating market is. Swiping is a flawed mechanism, in my opinion. How so many women who are obviously 50+ lbs heavier than me think I’d be interested in them is beyond me.",
                                    "author": "sdthrowaway006",
                                    "id": "griu2py",
                                    "parent_id": "t1_gri3cpv",
                                    "score": 4,
                                    "created_utc": 1616187276.0,
                                    "replies": []
                                },
                                {
                                    "body": "I still don't get it, but at least your comment didn't prove my point.",
                                    "author": "ChapterRelative",
                                    "id": "gri4f97",
                                    "parent_id": "t1_gri3cpv",
                                    "score": 0,
                                    "created_utc": 1616175611.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If you're a regular, attractive woman you wouldn't have to be in the bowl. You could find a rich boyfriend who would spoil you.",
                            "author": null,
                            "id": "grh1gk3",
                            "parent_id": "t1_grgrxb8",
                            "score": 5,
                            "created_utc": 1616157007.0,
                            "replies": [
                                {
                                    "body": "Lol good reverse analogy.",
                                    "author": "Fun_Focus8159",
                                    "id": "grhe7r7",
                                    "parent_id": "t1_grh1gk3",
                                    "score": 4,
                                    "created_utc": 1616163956.0,
                                    "replies": [
                                        {
                                            "body": "I think SB's need to take a long, good hard look in the mirror.",
                                            "author": null,
                                            "id": "grhf38s",
                                            "parent_id": "t1_grhe7r7",
                                            "score": 5,
                                            "created_utc": 1616164381.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "But how does this work with trying to find older men? It’s not like older men just walk right up to you in public because of the fear of being judged, also not many want to be on Tinder, Bumble, etc.... \n\nI’ve met plenty of older men and casually flirted with good conversations but that’s because my parents own a business in a rich, upper class community. Lol can’t be asking if I could be their SB while there. \n\nPlus every relationship is different; you can’t assume that just because you’re attractive you’ll find a spoiling boyfriend. Depends on where you live and your lifestyle for the chance to meet that person. \n\nI feel like I’m a regular, attractive woman (lol), I’m not into partying, I enjoy a quiet lifestyle (that already gives me a disadvantage since I’m not a socialite), I don’t live in a urban city, and Im attracted to older men so the odds are never in my favor lol.",
                                    "author": null,
                                    "id": "grhn4xt",
                                    "parent_id": "t1_grh1gk3",
                                    "score": 0,
                                    "created_utc": 1616168118.0,
                                    "replies": [
                                        {
                                            "body": "The same could be said about a younger SD. Maybe he's a busy executive and doesn't have time to pursue other vanilla dating options.  Maybe he just wants to cut through the chase and avoid all the emotional bullshit that comes with finding someone. The point is that you can't say there's anything wrong with a younger SD.",
                                            "author": null,
                                            "id": "gric6rg",
                                            "parent_id": "t1_grhn4xt",
                                            "score": 3,
                                            "created_utc": 1616178971.0,
                                            "replies": [
                                                {
                                                    "body": "There isn’t anything wrong with a younger SD lol I’m just saying I look for older men so that’s my situation.",
                                                    "author": null,
                                                    "id": "gricosr",
                                                    "parent_id": "t1_gric6rg",
                                                    "score": 1,
                                                    "created_utc": 1616179193.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Some of us enjoy the kink aspect. I have the spoiling lovers, but still enjoy the fun of sugaring. \n\nBut I was never accused of being \"regular.\" 😎",
                                    "author": "LadyMorgan2018",
                                    "id": "grhu7tz",
                                    "parent_id": "t1_grh1gk3",
                                    "score": 0,
                                    "created_utc": 1616171191.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Counterpoint (long time lurker, been outta the bowl a while). Im 30, my best SD was 31 at the time (I was 28). Busy busy busy with his business but wanted a pretty girl to hang out with once in a while, low strings but wanted a connection which worked for me. Took me to the pub to watch baseball (my fave activity), ate good pub food, drank craft beer and then would fuck me silly in the boardroom. He was handsome and charming but I think his luck in the bowl was low because *he wasn't white*. I genuinely miss him. Ladies, stop discounting south Asian men, and Asian men in general, they're some of the best lovers and so generous if you give them a chance. And that myth about their bottom half couldn't be farther from the truth. A lot of the younger SDs aren't white and I think they get an unfair deal.\n\nScratch everything i just said, im headed back to the bowl and don't want the competition, I'll take all those handsome men for myself",
            "author": "Catezero",
            "id": "grgcfeu",
            "parent_id": "t3_m88nzm",
            "score": 57,
            "created_utc": 1616134413.0,
            "replies": [
                {
                    "body": "Haha get em girl! 😆",
                    "author": "ddknows",
                    "id": "grhndk7",
                    "parent_id": "t1_grgcfeu",
                    "score": 4,
                    "created_utc": 1616168224.0,
                    "replies": []
                },
                {
                    "body": "age and generosity don't go hand in hand. the amount of money vs. generosity are also not exactly the same thing.  my ability to give more money at a younger age might be inhibited, but it doesn't mean i'm less generous.  Ability to give MORE money when you're older definitely plays a huge role in why an older SD seems more generous.\n\nwhat i can say is, certain cultures value giving more than other cultures.  white people in america and most of europe are highly selfish cultures.  think about family style meals vs. individualized portions being a good indicator. so i think dating certain cultures and finding SDs from cultures that are more generous might be a good idea for all",
                    "author": null,
                    "id": "griibey",
                    "parent_id": "t1_grgcfeu",
                    "score": 3,
                    "created_utc": 1616181784.0,
                    "replies": []
                },
                {
                    "body": "I actually PREFER Asian men! They are attractive, driven, energetic, have a stronger sense of values.",
                    "author": "Jimmychoo_Loubou",
                    "id": "grirbr2",
                    "parent_id": "t1_grgcfeu",
                    "score": 4,
                    "created_utc": 1616185938.0,
                    "replies": [
                        {
                            "body": "I dont want to come across as fetishizing because it's not that, but ive dated enough men of all ethnicities and have generally had a better time with not white guys, that it's *almost* a preference",
                            "author": "Catezero",
                            "id": "grjw5y7",
                            "parent_id": "t1_grirbr2",
                            "score": 2,
                            "created_utc": 1616207854.0,
                            "replies": [
                                {
                                    "body": "I understand what you mean!",
                                    "author": "Jimmychoo_Loubou",
                                    "id": "grkzume",
                                    "parent_id": "t1_grjw5y7",
                                    "score": 2,
                                    "created_utc": 1616242902.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thank you for bringing this up. I've always wondered what the distribution of SD's are by race and whether it plays a part in how many minority race SD's find success in SR's. Things for me to consider when life returns to normal (as much as it can post-pandemic).",
                    "author": "dunbar65",
                    "id": "gri0tyu",
                    "parent_id": "t1_grgcfeu",
                    "score": 1,
                    "created_utc": 1616174057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve had met a few really nice men below 40. Small portion were very generous. Majority were average-generous. \n\nBut IME none are sustainable or capable or willing to do long term.",
            "author": "ExExpectations",
            "id": "grg6jya",
            "parent_id": "t3_m88nzm",
            "score": 13,
            "created_utc": 1616129729.0,
            "replies": []
        },
        {
            "body": "Yeah. I agree with this wholeheartedly .",
            "author": "XCLawandRealEstate",
            "id": "grguf4g",
            "parent_id": "t3_m88nzm",
            "score": 7,
            "created_utc": 1616151853.0,
            "replies": []
        },
        {
            "body": ">From now on I’m sticking with my 40+ rule. (The older the better)\n\nHow many DMs did you get from the 70+ crew here? 🤣🤣",
            "author": "non_giant_panda",
            "id": "grg57zb",
            "parent_id": "t3_m88nzm",
            "score": 11,
            "created_utc": 1616128803.0,
            "replies": []
        },
        {
            "body": "Can someone please tell me what it is like with a man in his 60’s?  Trying to do some research before I meet this guy.  Thanks.",
            "author": "Greenapplehoneybun",
            "id": "grgfzia",
            "parent_id": "t3_m88nzm",
            "score": 4,
            "created_utc": 1616137576.0,
            "replies": [
                {
                    "body": "It's impossible to say. Everyone is so different. Could have ED. Could have a boner that last for days. Could be a scumbag. Could be the nicest human you have ever met.",
                    "author": "Abbyisafantasy",
                    "id": "grggrlr",
                    "parent_id": "t1_grgfzia",
                    "score": 9,
                    "created_utc": 1616138302.0,
                    "replies": [
                        {
                            "body": "I hope he does have Ed rather than a boner that lasts for days!  🤣",
                            "author": "Greenapplehoneybun",
                            "id": "grkka9x",
                            "parent_id": "t1_grggrlr",
                            "score": 1,
                            "created_utc": 1616226942.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Super sweet but he reminded me too much of hanging out with my grandpa (not kidding). He was very polite, respectful & very smart. Wasn’t worth my time or money though, because I was genuinely bored out of mind most of the time. He lied about his age at first? Said he was 50.  But other than that he was very nice & caring, in an innocent way.",
                    "author": "SilverStateNative",
                    "id": "grggvml",
                    "parent_id": "t1_grgfzia",
                    "score": 8,
                    "created_utc": 1616138406.0,
                    "replies": []
                },
                {
                    "body": "Men in their 60s are really no different than men in their 50s, who aren’t really different from men in their 40s. \n\nYes, their skin is softer and their hair is lighter, but for the most part he’s still going to be the same man in bed that he’s always been, probably better. \n\nSome guys are active, some guys are lazy. I dated a 64 year old who ran 3 miles almost everyday. I’ll let you imagine his stamina. 😂😏",
                    "author": "cleanevergreen",
                    "id": "grhkms1",
                    "parent_id": "t1_grgfzia",
                    "score": 3,
                    "created_utc": 1616166989.0,
                    "replies": [
                        {
                            "body": "3 miles is 4.83 km",
                            "author": "converter-bot",
                            "id": "grhknvm",
                            "parent_id": "t1_grhkms1",
                            "score": 1,
                            "created_utc": 1616167003.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I went with one SD who was 62. It was a HUGE break for me from the norm (this cougar prefers them upper 30s-younger 40s). I was shocked at hearing the viagra bottle (not used to that), but I still wore out the poor dear. Then we watched golf. 🤦🏻‍♀️🤷🏻‍♀️😂\n\nI'm not going down that old road again...I'll leave it to the young ones who have the patience for that.",
                    "author": "LadyMorgan2018",
                    "id": "grjup61",
                    "parent_id": "t1_grgfzia",
                    "score": 1,
                    "created_utc": 1616206986.0,
                    "replies": []
                },
                {
                    "body": "Well for me it was boring fun. The guy I was with (65) aim to please but lack the edge and aggression in the bedroom like 40-50 year olds. He was small and wrinkled down there. So I wasn’t thrilled about giving BJs. Body was soft and squishy not solid and muscular.  Overall, good for Sunday but not Friday night/Saturday morning. \n\nHe iced my desire to be with a 70 year old. I’m back to 47-57.",
                    "author": null,
                    "id": "grm87uv",
                    "parent_id": "t1_grgfzia",
                    "score": 1,
                    "created_utc": 1616267107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve been saying this.😭 \nSA is like a Tinder full of rich but cheap men. \nI knew a guy who was so handsome and came from old money. He was raised Jewish in Bexley, Ohio but his parents were raised in Manhattan, NY. He was quite short but had a beautiful face. He was super respectful in front of his friends but alone with me? He was very cheap & super perverted. 80% of our conversations were of him asking me about his penis, his penis size, if I could make him c*** quickly again, if I wanted to see a picture before school, if I could take a picture with his penis, etc. I was very attracted to him physically but he was 36 & acting like he was 16.",
            "author": "SilverStateNative",
            "id": "grg9ld0",
            "parent_id": "t3_m88nzm",
            "score": 13,
            "created_utc": 1616132047.0,
            "replies": [
                {
                    "body": "Ugh. The adult guys with the teenager brain/personality. So frustrating.",
                    "author": "Abbyisafantasy",
                    "id": "grggo33",
                    "parent_id": "t1_grg9ld0",
                    "score": 11,
                    "created_utc": 1616138211.0,
                    "replies": []
                },
                {
                    "body": "I used to talk to a guy on SA and then moved to texting who was extremely similar. He was ALWAYS asking if I wanted to see pictures of him from his bodybuilding days or pictures of him when he was 20. Referring to himself in the third person - that was the absolute worst. But every day it was like, \"I'M EXTREMELY FIT AND I'M GETTING READY FOR ANOTHER COMPETITION WOULD YOU LIKE TO SEE A PICTURE?!\" No. Please no. Please make this stop.",
                    "author": "CodiKo",
                    "id": "grjmi7g",
                    "parent_id": "t1_grg9ld0",
                    "score": 2,
                    "created_utc": 1616202351.0,
                    "replies": [
                        {
                            "body": "I feel your pain. 😂 But luckily I’ve never had a guy refer to himself in 3rd person? That sounds somewhat egotistical, doesn’t it? My guy was just ALWAYS horny, 24/7. Sometimes his random pervy comments were just annoying. He’d say\n “Don’t your lips look nice around my c***?” or “Do you know you’re making my c***throb?” or he’d say “I want to f*** your tits”. It’s like please stop, we’re in public. You’re too grown to be misbehaving like this.😭",
                            "author": "SilverStateNative",
                            "id": "grjzeak",
                            "parent_id": "t1_grjmi7g",
                            "score": 2,
                            "created_utc": 1616209855.0,
                            "replies": [
                                {
                                    "body": "I've stopped talking to vanilla people that talk like that. Like good lord, we're trying to eat breakfast! Hahaha. Maybe not at the dinner table, I don't know. But yeah. I can't remember, but I think he always started texts like, good morning from the professor, and this professor says hey. Etc etc. IN TEXT MESSAGES. it was just so awkward. I wouldn't mind a somewhat needy text every now and then, but I can't imagine hearing it in public. HAHA",
                                    "author": "CodiKo",
                                    "id": "grjzv4j",
                                    "parent_id": "t1_grjzeak",
                                    "score": 2,
                                    "created_utc": 1616210149.0,
                                    "replies": [
                                        {
                                            "body": "I mean I don’t mind stroking someone’s ego a bit? But I agree, sometimes it’s just feels so awkward.\nI think my guy was just trying overcompensate though? He was short but very well endowed; it was huge. He was basically 36 but acting like he was 16. Lol",
                                            "author": "SilverStateNative",
                                            "id": "grk1e3o",
                                            "parent_id": "t1_grjzv4j",
                                            "score": 1,
                                            "created_utc": 1616211106.0,
                                            "replies": [
                                                {
                                                    "body": "Oh yeah, that's different. The 3rd person guy, according to himself anyway, had no problem getting people's attention. He sent more mirror selfies and myspace-quality pictures than anyone I've ever seen. The vanilla guy was just gross. Every text was explicit. He couldn't even say hi without sending something cringe-worthy. I'd stroke an ego though! :)",
                                                    "author": "CodiKo",
                                                    "id": "grk23e1",
                                                    "parent_id": "t1_grk1e3o",
                                                    "score": 1,
                                                    "created_utc": 1616211559.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "grhnjfz",
                    "parent_id": "t1_grg9ld0",
                    "score": 0,
                    "created_utc": 1616168298.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gridu2j",
                            "parent_id": "t1_grhnjfz",
                            "score": 2,
                            "created_utc": 1616179710.0,
                            "replies": [
                                {
                                    "body": "😂😂😂",
                                    "author": "SilverStateNative",
                                    "id": "grixexh",
                                    "parent_id": "t1_gridu2j",
                                    "score": 1,
                                    "created_utc": 1616188932.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He was very religious and acted very “conservative” in front of religious Jewish friends.   \nIn other words: He actions contradicted his words, especially when he talked about Trump.",
                            "author": "SilverStateNative",
                            "id": "grixbno",
                            "parent_id": "t1_grhnjfz",
                            "score": 0,
                            "created_utc": 1616188889.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "grj20eb",
                                    "parent_id": "t1_grixbno",
                                    "score": 0,
                                    "created_utc": 1616191254.0,
                                    "replies": [
                                        {
                                            "body": "Thank you, dealing with certain people can be exhausting. He wasn’t a bad guy? Just very horny/immature, most of the time. And what stereotype are you talking about?",
                                            "author": "SilverStateNative",
                                            "id": "grj3ay7",
                                            "parent_id": "t1_grj20eb",
                                            "score": 1,
                                            "created_utc": 1616191922.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "grja8pu",
                                                    "parent_id": "t1_grj3ay7",
                                                    "score": 1,
                                                    "created_utc": 1616195597.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
                                                            "author": "SilverStateNative",
                                                            "id": "grjccnj",
                                                            "parent_id": "t1_grja8pu",
                                                            "score": 1,
                                                            "created_utc": 1616196728.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "grjcyh2",
                                                                    "parent_id": "t1_grjccnj",
                                                                    "score": 1,
                                                                    "created_utc": 1616197062.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                                                                            "author": "SilverStateNative",
                                                                            "id": "grjeraz",
                                                                            "parent_id": "t1_grjcyh2",
                                                                            "score": 1,
                                                                            "created_utc": 1616198054.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can only go after guys who are late 30s or early 40s, I’m 18 so I feel like anything older, I do not have stuff to talk to them about.",
            "author": "babyymelodyy",
            "id": "grhrusq",
            "parent_id": "t3_m88nzm",
            "score": 4,
            "created_utc": 1616170162.0,
            "replies": []
        },
        {
            "body": "I’m 35 and we aren’t all bad! Ive heard horror stories of older guys as well. I think the younger guys are less likely to be complete creeps or weirdos.",
            "author": "Fun_Focus8159",
            "id": "grg2sx6",
            "parent_id": "t3_m88nzm",
            "score": 11,
            "created_utc": 1616127234.0,
            "replies": [
                {
                    "body": "That's great news then!",
                    "author": "liveloverockenroll",
                    "id": "grg7ct6",
                    "parent_id": "t1_grg2sx6",
                    "score": 4,
                    "created_utc": 1616130313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I couldn’t agree with this post more. I don’t know what it is about men born in the 80s",
            "author": "LuluvioletSB",
            "id": "grgwtnf",
            "parent_id": "t3_m88nzm",
            "score": 6,
            "created_utc": 1616153777.0,
            "replies": [
                {
                    "body": "Their mothers ingested too much lead lmfao jkjk",
                    "author": "jonny2771",
                    "id": "grj2bn5",
                    "parent_id": "t1_grgwtnf",
                    "score": 1,
                    "created_utc": 1616191415.0,
                    "replies": []
                },
                {
                    "body": "Hey now I think we're lovely",
                    "author": "Ididitall4thegnocchi",
                    "id": "grldjsf",
                    "parent_id": "t1_grgwtnf",
                    "score": 1,
                    "created_utc": 1616251743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grg2w2t",
            "parent_id": "t3_m88nzm",
            "score": 10,
            "created_utc": 1616127291.0,
            "replies": [
                {
                    "body": "This is absolutely true. People try to make it a false dichotomy between a young guy at no allowance and a 70 year old whale with a huge allowance. In my experience, most non-professonal SBs go for the middle ground. Its not even always about hot or not. It often about nice or not. Its one of the ways I think SLF doesn't represent the true bowl. I know for sure that I have been outbid several times and still ended up getting the SB.",
                    "author": "OldschoolSD",
                    "id": "grg8hsp",
                    "parent_id": "t1_grg2w2t",
                    "score": 11,
                    "created_utc": 1616131179.0,
                    "replies": [
                        {
                            "body": "I think this is specially true among “non-professional SBs” like you mentioned. \n\nYoung women who are curious about the bowl, and would appreciate some extra cash but don’t need the 100% certainty that an older SD provides. They don’t plan their bills and lifestyle around receiving an allowance.",
                            "author": "techsd00",
                            "id": "grg9dak",
                            "parent_id": "t1_grg8hsp",
                            "score": 4,
                            "created_utc": 1616131870.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is very true. Happens to me all the time as a mid 30’s SD.",
                    "author": "Fun_Focus8159",
                    "id": "grhfh7a",
                    "parent_id": "t1_grg2w2t",
                    "score": 3,
                    "created_utc": 1616164567.0,
                    "replies": []
                },
                {
                    "body": "Yeah, same here. I feel like if you say this here though you get destroyed like you tricked or scammed the SB.",
                    "author": "us3rname9",
                    "id": "grg3rdu",
                    "parent_id": "t1_grg2w2t",
                    "score": 4,
                    "created_utc": 1616127845.0,
                    "replies": [
                        {
                            "body": "we're all scum for bringing more to table than money and less saggy balls. /s\n\nSLF is an echo chamber of old men and young women who want to maximize how money is exchanged for fucking.\n\nreality of SA and other sugardaddy sites is that most of the women want something that feels as normal as possible but with added incentives.  Money is an incentive, but that alone would not make an intimate relationship work for them.  Sitting in public with a guy 40 years older for them is awkward and puts them on edge at all times.  Fucking a guy with a wife is not morally sound.  Being a homewrecker is not ok.  Sucking old dick isn't something they can stomach.  These are all realities of your typical \"non professional SB\"\n\nThe younger SDs offer normalcy and that matters a lot.",
                            "author": null,
                            "id": "grifoqp",
                            "parent_id": "t1_grg3rdu",
                            "score": 2,
                            "created_utc": 1616180560.0,
                            "replies": []
                        },
                        {
                            "body": "Don't forget groomed. Lol",
                            "author": "OldschoolSD",
                            "id": "grg8m9e",
                            "parent_id": "t1_grg3rdu",
                            "score": -1,
                            "created_utc": 1616131274.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve yet to meet a SB under 40 who’s primary interest isn’t the money? \n\nWhere do the SD get the idea that well accept lower If he’s cute?",
            "author": "whatwouldjunedo",
            "id": "grgajml",
            "parent_id": "t3_m88nzm",
            "score": 2,
            "created_utc": 1616132822.0,
            "replies": [
                {
                    "body": "🙋🏻‍♀️🙋🏻‍♀️ over 40 here and my primary interest is still the money. 😂",
                    "author": "ExExpectations",
                    "id": "grgg1r6",
                    "parent_id": "t1_grgajml",
                    "score": 8,
                    "created_utc": 1616137634.0,
                    "replies": [
                        {
                            "body": "Right? 39 here but I know my motivation won't change as I get older. If I wanted a relationship not revolving around $$$, I could find a guy in the real world. Not on SA.",
                            "author": "Abbyisafantasy",
                            "id": "grggujj",
                            "parent_id": "t1_grgg1r6",
                            "score": 5,
                            "created_utc": 1616138378.0,
                            "replies": [
                                {
                                    "body": "Exactly. SA relationships don’t last. The men will want the next shiny thing.",
                                    "author": "ExExpectations",
                                    "id": "grgh5fk",
                                    "parent_id": "t1_grggujj",
                                    "score": 3,
                                    "created_utc": 1616138662.0,
                                    "replies": []
                                },
                                {
                                    "body": "I always tell guys that seem to be trying to feel out the chances of a vanilla relationship \"If I wanted to fuck for free I'd go to Tinder; it's one of the few advantages of being a woman.\" That usually shuts them down quick.",
                                    "author": "clashingtaco",
                                    "id": "gri5qve",
                                    "parent_id": "t1_grggujj",
                                    "score": 1,
                                    "created_utc": 1616176171.0,
                                    "replies": [
                                        {
                                            "body": "“But we have amazing chemistry! Like once in a lifetime kind of connection! How could you just give it up / walk away...!” \n\n🙄🙄\n\nProvide financial support. I’ll happily stay.",
                                            "author": "ExExpectations",
                                            "id": "grjrprj",
                                            "parent_id": "t1_gri5qve",
                                            "score": 0,
                                            "created_utc": 1616205246.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I will submit that you simply have not met or had frank discussions with many sugar babies under 40. You can’t speak for them. You’re on the same side of the aisle and you’re blinded to most of the conversations",
                    "author": "224quickmaths",
                    "id": "grj7jx5",
                    "parent_id": "t1_grgajml",
                    "score": 2,
                    "created_utc": 1616194150.0,
                    "replies": [
                        {
                            "body": "I will submit that you simply have not done any statistically significant research. You can’t make statements based on your flimsy anecdotal evidence. \n\nYou’re on the opposite side of the aisle (both age and gender) and you’re proposing to speak for SB? 😂",
                            "author": "whatwouldjunedo",
                            "id": "grjji0x",
                            "parent_id": "t1_grj7jx5",
                            "score": 0,
                            "created_utc": 1616200668.0,
                            "replies": [
                                {
                                    "body": "I’m not speaking for anyone. I simply know for a fact that I have entered into and have had infinitely more arrangements with sugar babies than you ever have in the past or will have in the future. Your n=1. Your experience on the subject of what sugar babies will and won’t accept is extremely small.",
                                    "author": "224quickmaths",
                                    "id": "grjjwp8",
                                    "parent_id": "t1_grjji0x",
                                    "score": 2,
                                    "created_utc": 1616200895.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Im a mid 30’s SD, decent looking and in shape. I’ve had so many POT’s tell me their normal PPM, I tell them sorry that’s too high best of luck. Then they start negotiating against themselves and cut their PPM in half. Most of my SB’s have accepted a lower PPM from me than they could’ve gotten elsewhere, because they said they were attracted to me. I’m not trying to screw anyone over, I just say I’m sorry our financial expectations aren’t aligned, but they almost always come back and cut their PPM ask significantly. \n\nA lot of SB’s main motivation isn’t money, they just need some extra money here and there and want to have fun with an older guy.",
                    "author": "Fun_Focus8159",
                    "id": "grhfbh2",
                    "parent_id": "t1_grgajml",
                    "score": 3,
                    "created_utc": 1616164490.0,
                    "replies": [
                        {
                            "body": "this is correct.  those SBs also don't come to these forums because it's not a job to them.  it's a relationship that helps them out.",
                            "author": null,
                            "id": "grig0nz",
                            "parent_id": "t1_grhfbh2",
                            "score": 3,
                            "created_utc": 1616180717.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How many SBs have you talked to outside of Reddit or other Internet forums?",
                    "author": "us3rname9",
                    "id": "grkcuws",
                    "parent_id": "t1_grgajml",
                    "score": 1,
                    "created_utc": 1616219624.0,
                    "replies": [
                        {
                            "body": "6. \n\nHow many have you talked to outside of the internet that weren’t trying to sleep with you so they could get your money?",
                            "author": "whatwouldjunedo",
                            "id": "grobaoo",
                            "parent_id": "t1_grkcuws",
                            "score": 1,
                            "created_utc": 1616306315.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m younger than 30 and I’ve had a lot of short term success with SA. I think some SB’s want to try out the lifestyle for a bit and don’t want to necessarily jump into it with an older man. A lot of the girls I met with still keep in contact with me even after the “arrangements”. Though I will say, it is always awkward when either of us mention what we had done LOL but other than that they’ve been sweet friends.\n\nMy long term relationships have been DISASTERS but that’s just life.",
            "author": "Late_Ad_6293",
            "id": "grge53j",
            "parent_id": "t3_m88nzm",
            "score": 2,
            "created_utc": 1616135907.0,
            "replies": [
                {
                    "body": "I've had many turn into friends.  they've moved onto other SDs, in relationships, married.  Just this week i had one ask me out to dinner and she specified she wanted to treat me since i had always treated her in the past.  She wanted to celebrate a big deal she closed.  \n\nAnother ex-SB wanted to grab dinner a couple weeks ago for business advice since we work in the same field.\n\n*gasp* that we younger SDs treat people like people.  The older SDs or professional SBs on SLF won't understand because the bowl to them is only about exchanging sex for money.",
                    "author": null,
                    "id": "grige5f",
                    "parent_id": "t1_grge53j",
                    "score": 1,
                    "created_utc": 1616180892.0,
                    "replies": [
                        {
                            "body": "And then the SBs on here say to go for the older men but then complain about them daily.\n\nWhy not just treat everyone as individuals 🤦🏻‍♂️",
                            "author": "Late_Ad_6293",
                            "id": "grign1d",
                            "parent_id": "t1_grige5f",
                            "score": 1,
                            "created_utc": 1616181007.0,
                            "replies": [
                                {
                                    "body": "i actually think it makes sense.\nthe SBs likely want it to work more with a younger guy, so when it doesn't pan out...it hurts more.  With an old guy, they probably don't give a shit and move onto the next saggy balled guy. So psychologically, they're more frustrated with the young SDs that don't pan out.",
                                    "author": null,
                                    "id": "grihp80",
                                    "parent_id": "t1_grign1d",
                                    "score": 1,
                                    "created_utc": 1616181500.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wrote on another post, I don’t think men under 42 are real SDs.\n\nIf you are young and rich- why would you sugar ?!?!\n\nYoung SDs are very rare almost impossible",
            "author": "Zealousideal_Map8100",
            "id": "grinhy9",
            "parent_id": "t3_m88nzm",
            "score": 2,
            "created_utc": 1616184162.0,
            "replies": [
                {
                    "body": "You’ve literally never been young, rich, and male. How can you possibly say that it’s realistic or not? And where did the number 42 come from? \n\nDisposable income is disposable income. I can buy a watch I don’t need or really want or I can have a fun time relaxing with a pretty 20something while helping her out with an allowance. It’s really extremely simple. What’s not to understand?",
                    "author": "224quickmaths",
                    "id": "grj6eiw",
                    "parent_id": "t1_grinhy9",
                    "score": 2,
                    "created_utc": 1616193538.0,
                    "replies": [
                        {
                            "body": "You can be all those things (young and rich) \n\nBUT WHY WOULD YOU BE A SD. WHEN YOU COULD VANILLA DATE FOR FREE\n\nTHATS MY POINT",
                            "author": "Zealousideal_Map8100",
                            "id": "grkuqw9",
                            "parent_id": "t1_grj6eiw",
                            "score": 1,
                            "created_utc": 1616238325.0,
                            "replies": [
                                {
                                    "body": "\nVanilla dating is NOT free. It costs time. I can easily make more money. I cannot make more time. \n\nAlso, don’t all caps me. I’m not the one being dense and disingenuous here.",
                                    "author": "224quickmaths",
                                    "id": "grkvao5",
                                    "parent_id": "t1_grkuqw9",
                                    "score": 0,
                                    "created_utc": 1616238877.0,
                                    "replies": [
                                        {
                                            "body": "Obviously it’s not free but you don’t have to pay X amount every week or month.\n\nAnd you know the girl is most likely with you because she likes you,  not because of your money. \n\n\nWith sugaring when the money stops, the SB 9/10 will move on....\n\n(Soz for the caps)",
                                            "author": "Zealousideal_Map8100",
                                            "id": "grkvi1j",
                                            "parent_id": "t1_grkvao5",
                                            "score": 1,
                                            "created_utc": 1616239079.0,
                                            "replies": [
                                                {
                                                    "body": "You’re saying obviously it’s not free when in your previous post you say that I can vanilla date for free.\n\nAt some point time and convenience becomes more important than the money. That’s the reason I’m at Starbucks right now rather than making a flat white at home even though Starbucks costs money.\n\nThe cost of a sugar arrangement to me is negligible. I don’t value and honor money the same way you do. That mentality is difficult to understand if you’re not in the same financial situation.",
                                                    "author": "224quickmaths",
                                                    "id": "grkvty5",
                                                    "parent_id": "t1_grkvi1j",
                                                    "score": 1,
                                                    "created_utc": 1616239397.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yay! I turn 41 soon. I guess I’m safe.",
            "author": "CryptoAustinSD",
            "id": "grgfeqr",
            "parent_id": "t3_m88nzm",
            "score": 2,
            "created_utc": 1616137055.0,
            "replies": [
                {
                    "body": "Frogs/toads come in all ages.",
                    "author": "ExExpectations",
                    "id": "grgfmqp",
                    "parent_id": "t1_grgfeqr",
                    "score": 7,
                    "created_utc": 1616137257.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t understand how anyone younger than 42 is a SD.\n\nLike it’s just not realistic........\n\nEDIT:\nI’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense......",
            "author": "Zealousideal_Map8100",
            "id": "grgmdmq",
            "parent_id": "t3_m88nzm",
            "score": 2,
            "created_utc": 1616143875.0,
            "replies": [
                {
                    "body": "You’re kidding right?\n\nThey may work in tech.  They could come from old money \n\nThey could be a small biz owner who works all day but zero free time for vanilla dating.",
                    "author": "pussy_impaler337",
                    "id": "grh92ew",
                    "parent_id": "t1_grgmdmq",
                    "score": 4,
                    "created_utc": 1616161380.0,
                    "replies": []
                },
                {
                    "body": "There’s a big difference between dating a decent looking woman around your age and dating a beautiful woman 10 years younger. \n\nNo 35 year old dude (unless he is a supermodel) is routinely matching with hot 22 year olds on Bumble. Sugar makes it so easy.",
                    "author": "us3rname9",
                    "id": "grip11t",
                    "parent_id": "t1_grgmdmq",
                    "score": 2,
                    "created_utc": 1616184859.0,
                    "replies": []
                },
                {
                    "body": "How is it not realistic? I’m mid 30’s and worth close to a million. Make decent money with my corporate job. I have plenty of disposable income to provide an allowance for 3-4 SB’s at the same time.",
                    "author": "Fun_Focus8159",
                    "id": "grheu03",
                    "parent_id": "t1_grgmdmq",
                    "score": 1,
                    "created_utc": 1616164257.0,
                    "replies": [
                        {
                            "body": "I’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense",
                            "author": "Zealousideal_Map8100",
                            "id": "grilf0c",
                            "parent_id": "t1_grheu03",
                            "score": 1,
                            "created_utc": 1616183233.0,
                            "replies": [
                                {
                                    "body": "Don’t need to but it is much much much easier. Less bullshit. The line is already drawn and both parties know what they’re getting into. Have you ever truly dated a very attractive woman? It can be annoying in the best of scenarios. If you’re busy with your own business, hobbies, friends, it’s much better to simplify that part of your life.",
                                    "author": "224quickmaths",
                                    "id": "grj728b",
                                    "parent_id": "t1_grilf0c",
                                    "score": 2,
                                    "created_utc": 1616193889.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s been said before but I’ll say it again. As a mid 30’s guy, it’s very hard to get that smoking hot 18-21 year old college cheerleader/sorority girl with vanilla dating. It almost always requires sugar. All of my SB’s have been 18-22 and extremely beautiful. Most likely couldn’t have gotten these girls without paying.",
                                    "author": "Fun_Focus8159",
                                    "id": "griltx3",
                                    "parent_id": "t1_grilf0c",
                                    "score": 1,
                                    "created_utc": 1616183423.0,
                                    "replies": [
                                        {
                                            "body": "You aren’t using your wealth correctly.\n\nIf you have money, the women will come if you know how to.....",
                                            "author": "Zealousideal_Map8100",
                                            "id": "grimu9g",
                                            "parent_id": "t1_griltx3",
                                            "score": 1,
                                            "created_utc": 1616183881.0,
                                            "replies": [
                                                {
                                                    "body": "Lol ok. Im not saying its impossible to get these girls. I’m vanilla dating a 19 yo I met from hinge. I’m saying sugar makes it 10000 times easier.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "grimxp4",
                                                    "parent_id": "t1_grimu9g",
                                                    "score": 1,
                                                    "created_utc": 1616183924.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Also again the 18-22 year old cheerleaders/sorority girls aren’t going to consider vanilla dating a 35 year old man in the United States.  Sugar date?  Sure but not vanilla date.  \n\nThe younger sds likely put a max age range of 23 or 24 so you probably aren’t competing with these girls anyways",
                                    "author": "pussy_impaler337",
                                    "id": "grmtucc",
                                    "parent_id": "t1_grilf0c",
                                    "score": 1,
                                    "created_utc": 1616276532.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Close to a million, but you balk and say you’re short on cash when an SB asks for you to pay for a gym membership? 👀",
                            "author": null,
                            "id": "griaub4",
                            "parent_id": "t1_grheu03",
                            "score": 0,
                            "created_utc": 1616178374.0,
                            "replies": [
                                {
                                    "body": "LOL 🤣🤣🤣",
                                    "author": "Ghanaiantoffee",
                                    "id": "griescl",
                                    "parent_id": "t1_griaub4",
                                    "score": 1,
                                    "created_utc": 1616180144.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lol when did I ever say that? I don’t mind paying for a gym membership, but if I’m paying for extra things outside of the PPM/Allowance, then I expect something extra in return from the SB. More attention, more dates, more affection, something. \n\nThat’s reasonable right?",
                                    "author": "Fun_Focus8159",
                                    "id": "griifnp",
                                    "parent_id": "t1_griaub4",
                                    "score": 1,
                                    "created_utc": 1616181841.0,
                                    "replies": [
                                        {
                                            "body": "For reference: https://www.reddit.com/r/sugarlifestyleforum/comments/lpamf3/my_sd_is_broke/goag9lo/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nAnyway, if that’s the term of your arrangement that you two laid out, it’s reasonable. Most certainly that ex(?)SB was asking for a more expensive gym, like Equinox, that could put a little dent in a quasi-millionaire’s wallet. Not a much cheaper one like 24hr/LA/Planet Fitness/Crunch.",
                                            "author": null,
                                            "id": "grikx4y",
                                            "parent_id": "t1_griifnp",
                                            "score": 0,
                                            "created_utc": 1616183002.0,
                                            "replies": [
                                                {
                                                    "body": "Lol you mad?",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gril2lx",
                                                    "parent_id": "t1_grikx4y",
                                                    "score": 2,
                                                    "created_utc": 1616183074.0,
                                                    "replies": [
                                                        {
                                                            "body": "🥱",
                                                            "author": null,
                                                            "id": "gritesw",
                                                            "parent_id": "t1_gril2lx",
                                                            "score": 0,
                                                            "created_utc": 1616186953.0,
                                                            "replies": [
                                                                {
                                                                    "body": "😘",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "griwx6r",
                                                                    "parent_id": "t1_gritesw",
                                                                    "score": 2,
                                                                    "created_utc": 1616188692.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It’s his money. Stop watching his pockets and worry about yourself and your own arrangements. Everybody gets to pick what they want and do not want to pay for.",
                                                    "author": "224quickmaths",
                                                    "id": "grj6p36",
                                                    "parent_id": "t1_grikx4y",
                                                    "score": 0,
                                                    "created_utc": 1616193695.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I got married and divorced young.  Then I was in a long term vanilla relationship that failed because she wanted more of my time than I was willing to give to her.  I grew up poor and have made everything myself and wanted to grow my company as quickly as possible so that I would never be anything like how I grew up.  She wanted all of the perks me working created (wealth, vacations, paying for her grad school) but also wanted every spare moment I had.\n\nOnce that ended I tried the dating pool for a while but never saw myself getting married or having children and that's just what is expected in the vanilla world.  In arrangements I give the same expectations as I did before but with the allowance aspect apparently it's taken more seriously on the female's side.",
                    "author": "the-other-horcrux",
                    "id": "grhatg4",
                    "parent_id": "t1_grgmdmq",
                    "score": 1,
                    "created_utc": 1616162264.0,
                    "replies": []
                },
                {
                    "body": "I'm 35 and have a net worth of just under 1.5 million with cashflows from rental properties that fueled most of my sugar budget.\n\nIt's easy, we worked harder than everyone else, got lucky, or already rich.",
                    "author": null,
                    "id": "griehyi",
                    "parent_id": "t1_grgmdmq",
                    "score": 1,
                    "created_utc": 1616180014.0,
                    "replies": [
                        {
                            "body": "I’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense",
                            "author": "Zealousideal_Map8100",
                            "id": "grilbxh",
                            "parent_id": "t1_griehyi",
                            "score": 3,
                            "created_utc": 1616183193.0,
                            "replies": [
                                {
                                    "body": "for me, it's cause i needed to grind and focus on work. There's also the aspect of not wanting to be emotionally tied to anyone so that you can focus on your primary objective...make money. Work involved almost weekly travel, making relationships hard.  So sugar dating allowed for very easy upfront understandings of expectations without feelings getting in the way.  i also traveled to multiple cities often, so i'd pretty much have a SB in each frequently traveled city.  \n\non a more personal note, i'm an asian male who's short. If you read anything online about online dating for asian males, we have the roughest time in online dating for any male. you add short to that and you're in for a tough time. \n\nSo for someone with no time, issues with online dating (less issues when meeting in person), a pool of money that can't be spent because you're always working, i'd direct this back to you...why wouldn't i sugar date?",
                                    "author": null,
                                    "id": "grimrsi",
                                    "parent_id": "t1_grilbxh",
                                    "score": 1,
                                    "created_utc": 1616183850.0,
                                    "replies": [
                                        {
                                            "body": "I get that, black women and Asian men are statistically the least liked on Internet dating. So I feel your pain. \n\nBut I promise you. If you have wealth and money, the women will come....\n\nYeah you might have to be a bit arrogant and “Brag” about it, but the women will come!!!",
                                            "author": "Zealousideal_Map8100",
                                            "id": "grin7bz",
                                            "parent_id": "t1_grimrsi",
                                            "score": 1,
                                            "created_utc": 1616184039.0,
                                            "replies": [
                                                {
                                                    "body": "The type of money you need to vanilla date girls who are 7-10 on the looks scale,and are 18-25 without offering marriage or LTR far exceeds the money you need to sugar date. You can sugar date with a minimum half a million liquid(alot of SDshave less) and low to mid six figure salary(assuming no kids). In order to casually vanilla date gorgeous girls,you need to be making a million annually,and have about a minimum 5 million in the bank/liquid in most major cities. The majority of SDs young or old probably dont have that. You need to enough money where she can live the millionaire lifestyle,without having her having to work. Even if you are offering marriage or LTR,you still need to make probably closer to half a million a year\n\n&#x200B;\n\nGirls who are Instagram hott have alot of options from pretty people jobs that pay well(high end bar waitress/hostess/PR marketing gigs corporate assistant) plus they can date long terms guys who make low to just below six figures who are age-appropriate but will pay for all the extra curriculars like drinks dinner and partying. They would rather do a combination of these two things than hang out with a 30 plus with a couple of million in the bank.",
                                                    "author": "Secret_Diet7053",
                                                    "id": "grk4u1p",
                                                    "parent_id": "t1_grin7bz",
                                                    "score": 2,
                                                    "created_utc": 1616213388.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I was actually going to mention black women but didn't want to open up that can of worms!  \n\nI've been out of the bowl for a long while now. Still find my past life entertaining. have promising long term prospect vanilla relationdhips brewing right now. To be clear, I've never had any issue dating. But the change of society to online dating presented problems I didn't have in the past \n\nAlso may jump back in the bowl while I live in South Florida for a bit. Haven't decided yet.",
                                                    "author": null,
                                                    "id": "grinshw",
                                                    "parent_id": "t1_grin7bz",
                                                    "score": 0,
                                                    "created_utc": 1616184292.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I better stop lieing about my age on sa saying I'm 38 then",
            "author": "wb19081908",
            "id": "grg5ujw",
            "parent_id": "t3_m88nzm",
            "score": 0,
            "created_utc": 1616129232.0,
            "replies": [
                {
                    "body": "Are you one of those who subtract 25 years??",
                    "author": "ExExpectations",
                    "id": "grgg3fm",
                    "parent_id": "t1_grg5ujw",
                    "score": 3,
                    "created_utc": 1616137676.0,
                    "replies": [
                        {
                            "body": "I will when I'm 63",
                            "author": "wb19081908",
                            "id": "grgg5a9",
                            "parent_id": "t1_grgg3fm",
                            "score": 0,
                            "created_utc": 1616137722.0,
                            "replies": [
                                {
                                    "body": "It’s past midnight. Don’t make me do math.",
                                    "author": "ExExpectations",
                                    "id": "grggkh0",
                                    "parent_id": "t1_grgg5a9",
                                    "score": 3,
                                    "created_utc": 1616138113.0,
                                    "replies": [
                                        {
                                            "body": "Im.49.  Lols.  I look early to mid 30s.  Especially when I was a bit lighter.",
                                            "author": "wb19081908",
                                            "id": "grghqwx",
                                            "parent_id": "t1_grggkh0",
                                            "score": 1,
                                            "created_utc": 1616139222.0,
                                            "replies": [
                                                {
                                                    "body": "Hmm 🤔",
                                                    "author": "ExExpectations",
                                                    "id": "grjqiha",
                                                    "parent_id": "t1_grghqwx",
                                                    "score": 1,
                                                    "created_utc": 1616204571.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SD’s just go for SB’s under 22. Periodt.",
            "author": "Limitlesspappy",
            "id": "grgxivu",
            "parent_id": "t3_m88nzm",
            "score": 0,
            "created_utc": 1616154302.0,
            "replies": [
                {
                    "body": "I am 22. 😘",
                    "author": "IngenuityAdept5380",
                    "id": "grhf27n",
                    "parent_id": "t1_grgxivu",
                    "score": 3,
                    "created_utc": 1616164367.0,
                    "replies": []
                },
                {
                    "body": "Not really, but okay. \n\nI'm a 51yo Cougar BDSM switch. I do fairly well in the Mrs. Robinson/Stifler's Mom fantasy niche. 😉",
                    "author": "LadyMorgan2018",
                    "id": "grhtl1e",
                    "parent_id": "t1_grgxivu",
                    "score": 1,
                    "created_utc": 1616170915.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "griksez",
                            "parent_id": "t1_grhtl1e",
                            "score": 2,
                            "created_utc": 1616182940.0,
                            "replies": [
                                {
                                    "body": "Brilliant!!! (I've heard the cucumber come on before...now I have a reference for it! Lolol). I tend towards Stifler's mom with a touch of Mrs. Robinson for the shy ones. 😈",
                                    "author": "LadyMorgan2018",
                                    "id": "grizduc",
                                    "parent_id": "t1_griksez",
                                    "score": 2,
                                    "created_utc": 1616189925.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Score one for the 40+ crew....",
            "author": "BigDayvi",
            "id": "grju7p9",
            "parent_id": "t3_m88nzm",
            "score": 0,
            "created_utc": 1616206700.0,
            "replies": []
        },
        {
            "body": "Age preference is a personal issue. That’s ok. \n\nI’m in mid fifties and my initial preference was for about a 20 year gap. I met someone who actually added 8 years to her age and we got along splendidly. Age isn’t really important to me except that it predicts the dynamic.",
            "author": "daddoms",
            "id": "grhbueo",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616162784.0,
            "replies": []
        },
        {
            "body": "More power to you! I'm glad you found your niche. I'm a die hard Cougar and will stick to the younger ones. I have unique ways of taming a SD cub's smart mouth! 🤣😎",
            "author": "LadyMorgan2018",
            "id": "grhtdv9",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616170830.0,
            "replies": [
                {
                    "body": "I didnt realize Stifler's mom hard a rough side! 😆",
                    "author": "Life_b_beautiful",
                    "id": "gritrsi",
                    "parent_id": "t1_grhtdv9",
                    "score": 1,
                    "created_utc": 1616187128.0,
                    "replies": [
                        {
                            "body": "Awww...bless your heart. I did mention the BDSM part...didn't I? \n\nI may not be everyone's cuppa tea, but I'm someone's double shot of whisky and I'll bite if you beg for it.",
                            "author": "LadyMorgan2018",
                            "id": "grizrs9",
                            "parent_id": "t1_gritrsi",
                            "score": 1,
                            "created_utc": 1616190121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess that puts me out at 36 😬",
            "author": null,
            "id": "grhxat6",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616172509.0,
            "replies": []
        },
        {
            "body": "I haven't found that to be true in the long run. I've had mostly men 40+ and found that they're more likely to pull the \"I'm older and more mature\" argument out which in itself is actually very immature lol. Younger guys do tend to treat this like fancy Tinder more often which is a bit odd but that's easy enough to weed out. I ask younger SDs up front about their expectations and living arrangements to make sure they're somewhat legit. Older guys I feel out now full of themselves they are first.",
            "author": "clashingtaco",
            "id": "gri5fbo",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616176035.0,
            "replies": []
        },
        {
            "body": "I agree 100%",
            "author": "Affectionate_Water00",
            "id": "gri760d",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616176772.0,
            "replies": []
        },
        {
            "body": "I've had one great SD who was 28 with very little experience with dating, but otherwise my favorite age is 50s. They've gotten time to figure out who they are since their most recent divorce, they know how hard dating is and they value a woman who can give them what they want. And they aren't old enough to remind me of my grandpa.",
            "author": "khaoticneutralzone",
            "id": "gribzao",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616178882.0,
            "replies": []
        },
        {
            "body": "I've recently decided to take a break from the bowl because of everything going on rn. That being said I do agree about sugar dating in the 40+ age range, BUT I have connected with amazing SD's around the same age as me (I'm 26) about the 26-30 range recently. That is mostly due to the fact of energy matching, and the lack of bitterness. It was so refreshing. That being said, I've had nightmare experiences with SD's in their 30's that have previously compelled me to nix anyone younger than 45.",
            "author": "Jimmychoo_Loubou",
            "id": "gricwtc",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616179293.0,
            "replies": []
        },
        {
            "body": "Im a young SD under 40,and I agree with this post. If you want to maximize your time in the bowl than 40 and up is probably better use of time. You can find some gems(like me) under 40 but its going to require more work. There are certain demographics of SB's I avoid as well so this post doesn't offend me.\n\nThere are people due to financial or time constraints that need to filter with more prejudice, even if it leads to them missing out on some gems.",
            "author": "Secret_Diet7053",
            "id": "grk83kg",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616215749.0,
            "replies": []
        },
        {
            "body": "Good thing I just turn 40",
            "author": "DoNotPullOut",
            "id": "gskpdhf",
            "parent_id": "t3_m88nzm",
            "score": 1,
            "created_utc": 1616933291.0,
            "replies": []
        },
        {
            "body": "> It’s less about age and more about maturity\n\nThis is true with so much in life.",
            "author": "Y_4Z44",
            "id": "grg2ol5",
            "parent_id": "t1_grg2ex8",
            "score": 19,
            "created_utc": 1616127155.0,
            "replies": []
        },
        {
            "body": "That's the truth just because they are older doesn't mean they are mature.",
            "author": "CombinationThin",
            "id": "grgv5um",
            "parent_id": "t1_grg2ex8",
            "score": 7,
            "created_utc": 1616152486.0,
            "replies": []
        },
        {
            "body": "This. Partially why I keep my options open still but I’ve had the most success with 40 and up lol",
            "author": "IngenuityAdept5380",
            "id": "grg7is3",
            "parent_id": "t1_grg2ex8",
            "score": 9,
            "created_utc": 1616130438.0,
            "replies": []
        },
        {
            "body": ">as it should be in the bowl!).\n\n...as it should be in DATING!, especially online dating!).\n\nYes, there are bad actors in Sugar Dating, but there are bad actors in all forms of dating (especially online dating).  I'm not sure the % of bad actors is higher on Seeking than on Tinder, Hinge, Bumble, etc.  Many women Sugar Date because they want to avoid the toxic / abusive relationships they've found very common with younger vanilla boyfriends.",
            "author": "willfromvb",
            "id": "grgyq8h",
            "parent_id": "t1_grg5864",
            "score": 9,
            "created_utc": 1616155165.0,
            "replies": []
        },
        {
            "body": "Yep. If they’re a piece of shit human, it doesn’t matter what age they are. \n\nExhibit 1,871,283 the ex president\n\nA 65 yo piece of shit is still a piece of shit. And so is a 35yo piece of shit.",
            "author": "ExExpectations",
            "id": "grg67bi",
            "parent_id": "t1_grg5864",
            "score": 34,
            "created_utc": 1616129479.0,
            "replies": []
        },
        {
            "body": ">married men......would at least treat women with some respect \n\nIt should be obvious but just to be clear you're talking about married men whose wives know about the situation, correct? Because if not, he's made his lack of respect for her 100% clear.",
            "author": null,
            "id": "grh1aqz",
            "parent_id": "t1_grg5864",
            "score": 12,
            "created_utc": 1616156904.0,
            "replies": [
                {
                    "body": "Yes",
                    "author": "Cornycorgichick",
                    "id": "grh1ggf",
                    "parent_id": "t1_grh1aqz",
                    "score": 2,
                    "created_utc": 1616157005.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "dimg dingg",
            "author": "bookworm010101",
            "id": "grgsg7s",
            "parent_id": "t1_grg5864",
            "score": 4,
            "created_utc": 1616150085.0,
            "replies": []
        },
        {
            "body": "This is completely true, but it's a little hard to see why a relatively normal, decent guy in his 30s would engage in this lifestyle. Sure there are going to be the exceptions to that, but generally I suspect the POS percentage is going to be higher in the younger crowd because the incentives for a under 40s guy who is well off, professionally successful, relatively attractive and well-mannered, and respectful to women to engage in sugaring are just a lot less than for the 50+ crowd.",
            "author": "ChapterRelative",
            "id": "grgrxb8",
            "parent_id": "t1_grg5864",
            "score": 2,
            "created_utc": 1616149587.0,
            "replies": [
                {
                    "body": "It’s pretty simple.  If you are 35 and a man of means you simple won’t have the opportunity to date an extremely hot 20 year old college cheerleader or and extremely hot 20 year old college sorority girl through vanilla dating, I’m talking the hottest women in the world.  But totally possible through sugar dating.",
                    "author": "pussy_impaler337",
                    "id": "grgt33e",
                    "parent_id": "t1_grgrxb8",
                    "score": 7,
                    "created_utc": 1616150682.0,
                    "replies": [
                        {
                            "body": "This is very true as a 35 year old SD. I do ok with vanilla dating and using tinder, but it’s almost impossible for me to get that college cheerleader/sorority girl without offering sugar.",
                            "author": "Fun_Focus8159",
                            "id": "grhedxl",
                            "parent_id": "t1_grgt33e",
                            "score": 3,
                            "created_utc": 1616164039.0,
                            "replies": []
                        },
                        {
                            "body": "Thanks pussy_impaler, I stand corrected. 🙄",
                            "author": "ChapterRelative",
                            "id": "grgu44v",
                            "parent_id": "t1_grgt33e",
                            "score": 4,
                            "created_utc": 1616151593.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well dressed, nice car, nice home, job description in place on my tinder and my bumble, account promoted, still get mostly interest from single mothers who barely graduated highschool, 40 lbs overweight, with kids by multiple fathers, who are unemployed and don't drive. On SA I'm meeting up and having dinner and seeing shows with tall athletic graduate students. Women who maintained academic scholarships while they were D1 athletes. If I want to go spend the weekend hiking in the mountains or charter a boat and sail around the bay that's way easier with the women I meet on SA than the women I don't meet through vanilla dating.",
                    "author": "Sugarbeggar",
                    "id": "gri3cpv",
                    "parent_id": "t1_grgrxb8",
                    "score": 3,
                    "created_utc": 1616175161.0,
                    "replies": [
                        {
                            "body": "Ditto. Mid-30s here, same experience in vanilla. But every now and then, a decent vanilla match happens. Still remarkable how a piss poor the dating market is. Swiping is a flawed mechanism, in my opinion. How so many women who are obviously 50+ lbs heavier than me think I’d be interested in them is beyond me.",
                            "author": "sdthrowaway006",
                            "id": "griu2py",
                            "parent_id": "t1_gri3cpv",
                            "score": 4,
                            "created_utc": 1616187276.0,
                            "replies": []
                        },
                        {
                            "body": "I still don't get it, but at least your comment didn't prove my point.",
                            "author": "ChapterRelative",
                            "id": "gri4f97",
                            "parent_id": "t1_gri3cpv",
                            "score": 0,
                            "created_utc": 1616175611.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If you're a regular, attractive woman you wouldn't have to be in the bowl. You could find a rich boyfriend who would spoil you.",
                    "author": null,
                    "id": "grh1gk3",
                    "parent_id": "t1_grgrxb8",
                    "score": 5,
                    "created_utc": 1616157007.0,
                    "replies": [
                        {
                            "body": "Lol good reverse analogy.",
                            "author": "Fun_Focus8159",
                            "id": "grhe7r7",
                            "parent_id": "t1_grh1gk3",
                            "score": 4,
                            "created_utc": 1616163956.0,
                            "replies": [
                                {
                                    "body": "I think SB's need to take a long, good hard look in the mirror.",
                                    "author": null,
                                    "id": "grhf38s",
                                    "parent_id": "t1_grhe7r7",
                                    "score": 5,
                                    "created_utc": 1616164381.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But how does this work with trying to find older men? It’s not like older men just walk right up to you in public because of the fear of being judged, also not many want to be on Tinder, Bumble, etc.... \n\nI’ve met plenty of older men and casually flirted with good conversations but that’s because my parents own a business in a rich, upper class community. Lol can’t be asking if I could be their SB while there. \n\nPlus every relationship is different; you can’t assume that just because you’re attractive you’ll find a spoiling boyfriend. Depends on where you live and your lifestyle for the chance to meet that person. \n\nI feel like I’m a regular, attractive woman (lol), I’m not into partying, I enjoy a quiet lifestyle (that already gives me a disadvantage since I’m not a socialite), I don’t live in a urban city, and Im attracted to older men so the odds are never in my favor lol.",
                            "author": null,
                            "id": "grhn4xt",
                            "parent_id": "t1_grh1gk3",
                            "score": 0,
                            "created_utc": 1616168118.0,
                            "replies": [
                                {
                                    "body": "The same could be said about a younger SD. Maybe he's a busy executive and doesn't have time to pursue other vanilla dating options.  Maybe he just wants to cut through the chase and avoid all the emotional bullshit that comes with finding someone. The point is that you can't say there's anything wrong with a younger SD.",
                                    "author": null,
                                    "id": "gric6rg",
                                    "parent_id": "t1_grhn4xt",
                                    "score": 3,
                                    "created_utc": 1616178971.0,
                                    "replies": [
                                        {
                                            "body": "There isn’t anything wrong with a younger SD lol I’m just saying I look for older men so that’s my situation.",
                                            "author": null,
                                            "id": "gricosr",
                                            "parent_id": "t1_gric6rg",
                                            "score": 1,
                                            "created_utc": 1616179193.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Some of us enjoy the kink aspect. I have the spoiling lovers, but still enjoy the fun of sugaring. \n\nBut I was never accused of being \"regular.\" 😎",
                            "author": "LadyMorgan2018",
                            "id": "grhu7tz",
                            "parent_id": "t1_grh1gk3",
                            "score": 0,
                            "created_utc": 1616171191.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha get em girl! 😆",
            "author": "ddknows",
            "id": "grhndk7",
            "parent_id": "t1_grgcfeu",
            "score": 4,
            "created_utc": 1616168224.0,
            "replies": []
        },
        {
            "body": "age and generosity don't go hand in hand. the amount of money vs. generosity are also not exactly the same thing.  my ability to give more money at a younger age might be inhibited, but it doesn't mean i'm less generous.  Ability to give MORE money when you're older definitely plays a huge role in why an older SD seems more generous.\n\nwhat i can say is, certain cultures value giving more than other cultures.  white people in america and most of europe are highly selfish cultures.  think about family style meals vs. individualized portions being a good indicator. so i think dating certain cultures and finding SDs from cultures that are more generous might be a good idea for all",
            "author": null,
            "id": "griibey",
            "parent_id": "t1_grgcfeu",
            "score": 3,
            "created_utc": 1616181784.0,
            "replies": []
        },
        {
            "body": "I actually PREFER Asian men! They are attractive, driven, energetic, have a stronger sense of values.",
            "author": "Jimmychoo_Loubou",
            "id": "grirbr2",
            "parent_id": "t1_grgcfeu",
            "score": 4,
            "created_utc": 1616185938.0,
            "replies": [
                {
                    "body": "I dont want to come across as fetishizing because it's not that, but ive dated enough men of all ethnicities and have generally had a better time with not white guys, that it's *almost* a preference",
                    "author": "Catezero",
                    "id": "grjw5y7",
                    "parent_id": "t1_grirbr2",
                    "score": 2,
                    "created_utc": 1616207854.0,
                    "replies": [
                        {
                            "body": "I understand what you mean!",
                            "author": "Jimmychoo_Loubou",
                            "id": "grkzume",
                            "parent_id": "t1_grjw5y7",
                            "score": 2,
                            "created_utc": 1616242902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for bringing this up. I've always wondered what the distribution of SD's are by race and whether it plays a part in how many minority race SD's find success in SR's. Things for me to consider when life returns to normal (as much as it can post-pandemic).",
            "author": "dunbar65",
            "id": "gri0tyu",
            "parent_id": "t1_grgcfeu",
            "score": 1,
            "created_utc": 1616174057.0,
            "replies": []
        },
        {
            "body": "It's impossible to say. Everyone is so different. Could have ED. Could have a boner that last for days. Could be a scumbag. Could be the nicest human you have ever met.",
            "author": "Abbyisafantasy",
            "id": "grggrlr",
            "parent_id": "t1_grgfzia",
            "score": 9,
            "created_utc": 1616138302.0,
            "replies": [
                {
                    "body": "I hope he does have Ed rather than a boner that lasts for days!  🤣",
                    "author": "Greenapplehoneybun",
                    "id": "grkka9x",
                    "parent_id": "t1_grggrlr",
                    "score": 1,
                    "created_utc": 1616226942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Super sweet but he reminded me too much of hanging out with my grandpa (not kidding). He was very polite, respectful & very smart. Wasn’t worth my time or money though, because I was genuinely bored out of mind most of the time. He lied about his age at first? Said he was 50.  But other than that he was very nice & caring, in an innocent way.",
            "author": "SilverStateNative",
            "id": "grggvml",
            "parent_id": "t1_grgfzia",
            "score": 8,
            "created_utc": 1616138406.0,
            "replies": []
        },
        {
            "body": "Men in their 60s are really no different than men in their 50s, who aren’t really different from men in their 40s. \n\nYes, their skin is softer and their hair is lighter, but for the most part he’s still going to be the same man in bed that he’s always been, probably better. \n\nSome guys are active, some guys are lazy. I dated a 64 year old who ran 3 miles almost everyday. I’ll let you imagine his stamina. 😂😏",
            "author": "cleanevergreen",
            "id": "grhkms1",
            "parent_id": "t1_grgfzia",
            "score": 3,
            "created_utc": 1616166989.0,
            "replies": [
                {
                    "body": "3 miles is 4.83 km",
                    "author": "converter-bot",
                    "id": "grhknvm",
                    "parent_id": "t1_grhkms1",
                    "score": 1,
                    "created_utc": 1616167003.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I went with one SD who was 62. It was a HUGE break for me from the norm (this cougar prefers them upper 30s-younger 40s). I was shocked at hearing the viagra bottle (not used to that), but I still wore out the poor dear. Then we watched golf. 🤦🏻‍♀️🤷🏻‍♀️😂\n\nI'm not going down that old road again...I'll leave it to the young ones who have the patience for that.",
            "author": "LadyMorgan2018",
            "id": "grjup61",
            "parent_id": "t1_grgfzia",
            "score": 1,
            "created_utc": 1616206986.0,
            "replies": []
        },
        {
            "body": "Well for me it was boring fun. The guy I was with (65) aim to please but lack the edge and aggression in the bedroom like 40-50 year olds. He was small and wrinkled down there. So I wasn’t thrilled about giving BJs. Body was soft and squishy not solid and muscular.  Overall, good for Sunday but not Friday night/Saturday morning. \n\nHe iced my desire to be with a 70 year old. I’m back to 47-57.",
            "author": null,
            "id": "grm87uv",
            "parent_id": "t1_grgfzia",
            "score": 1,
            "created_utc": 1616267107.0,
            "replies": []
        },
        {
            "body": "Ugh. The adult guys with the teenager brain/personality. So frustrating.",
            "author": "Abbyisafantasy",
            "id": "grggo33",
            "parent_id": "t1_grg9ld0",
            "score": 11,
            "created_utc": 1616138211.0,
            "replies": []
        },
        {
            "body": "I used to talk to a guy on SA and then moved to texting who was extremely similar. He was ALWAYS asking if I wanted to see pictures of him from his bodybuilding days or pictures of him when he was 20. Referring to himself in the third person - that was the absolute worst. But every day it was like, \"I'M EXTREMELY FIT AND I'M GETTING READY FOR ANOTHER COMPETITION WOULD YOU LIKE TO SEE A PICTURE?!\" No. Please no. Please make this stop.",
            "author": "CodiKo",
            "id": "grjmi7g",
            "parent_id": "t1_grg9ld0",
            "score": 2,
            "created_utc": 1616202351.0,
            "replies": [
                {
                    "body": "I feel your pain. 😂 But luckily I’ve never had a guy refer to himself in 3rd person? That sounds somewhat egotistical, doesn’t it? My guy was just ALWAYS horny, 24/7. Sometimes his random pervy comments were just annoying. He’d say\n “Don’t your lips look nice around my c***?” or “Do you know you’re making my c***throb?” or he’d say “I want to f*** your tits”. It’s like please stop, we’re in public. You’re too grown to be misbehaving like this.😭",
                    "author": "SilverStateNative",
                    "id": "grjzeak",
                    "parent_id": "t1_grjmi7g",
                    "score": 2,
                    "created_utc": 1616209855.0,
                    "replies": [
                        {
                            "body": "I've stopped talking to vanilla people that talk like that. Like good lord, we're trying to eat breakfast! Hahaha. Maybe not at the dinner table, I don't know. But yeah. I can't remember, but I think he always started texts like, good morning from the professor, and this professor says hey. Etc etc. IN TEXT MESSAGES. it was just so awkward. I wouldn't mind a somewhat needy text every now and then, but I can't imagine hearing it in public. HAHA",
                            "author": "CodiKo",
                            "id": "grjzv4j",
                            "parent_id": "t1_grjzeak",
                            "score": 2,
                            "created_utc": 1616210149.0,
                            "replies": [
                                {
                                    "body": "I mean I don’t mind stroking someone’s ego a bit? But I agree, sometimes it’s just feels so awkward.\nI think my guy was just trying overcompensate though? He was short but very well endowed; it was huge. He was basically 36 but acting like he was 16. Lol",
                                    "author": "SilverStateNative",
                                    "id": "grk1e3o",
                                    "parent_id": "t1_grjzv4j",
                                    "score": 1,
                                    "created_utc": 1616211106.0,
                                    "replies": [
                                        {
                                            "body": "Oh yeah, that's different. The 3rd person guy, according to himself anyway, had no problem getting people's attention. He sent more mirror selfies and myspace-quality pictures than anyone I've ever seen. The vanilla guy was just gross. Every text was explicit. He couldn't even say hi without sending something cringe-worthy. I'd stroke an ego though! :)",
                                            "author": "CodiKo",
                                            "id": "grk23e1",
                                            "parent_id": "t1_grk1e3o",
                                            "score": 1,
                                            "created_utc": 1616211559.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grhnjfz",
            "parent_id": "t1_grg9ld0",
            "score": 0,
            "created_utc": 1616168298.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gridu2j",
                    "parent_id": "t1_grhnjfz",
                    "score": 2,
                    "created_utc": 1616179710.0,
                    "replies": [
                        {
                            "body": "😂😂😂",
                            "author": "SilverStateNative",
                            "id": "grixexh",
                            "parent_id": "t1_gridu2j",
                            "score": 1,
                            "created_utc": 1616188932.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He was very religious and acted very “conservative” in front of religious Jewish friends.   \nIn other words: He actions contradicted his words, especially when he talked about Trump.",
                    "author": "SilverStateNative",
                    "id": "grixbno",
                    "parent_id": "t1_grhnjfz",
                    "score": 0,
                    "created_utc": 1616188889.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "grj20eb",
                            "parent_id": "t1_grixbno",
                            "score": 0,
                            "created_utc": 1616191254.0,
                            "replies": [
                                {
                                    "body": "Thank you, dealing with certain people can be exhausting. He wasn’t a bad guy? Just very horny/immature, most of the time. And what stereotype are you talking about?",
                                    "author": "SilverStateNative",
                                    "id": "grj3ay7",
                                    "parent_id": "t1_grj20eb",
                                    "score": 1,
                                    "created_utc": 1616191922.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "grja8pu",
                                            "parent_id": "t1_grj3ay7",
                                            "score": 1,
                                            "created_utc": 1616195597.0,
                                            "replies": [
                                                {
                                                    "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
                                                    "author": "SilverStateNative",
                                                    "id": "grjccnj",
                                                    "parent_id": "t1_grja8pu",
                                                    "score": 1,
                                                    "created_utc": 1616196728.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "grjcyh2",
                                                            "parent_id": "t1_grjccnj",
                                                            "score": 1,
                                                            "created_utc": 1616197062.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                                                                    "author": "SilverStateNative",
                                                                    "id": "grjeraz",
                                                                    "parent_id": "t1_grjcyh2",
                                                                    "score": 1,
                                                                    "created_utc": 1616198054.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's great news then!",
            "author": "liveloverockenroll",
            "id": "grg7ct6",
            "parent_id": "t1_grg2sx6",
            "score": 4,
            "created_utc": 1616130313.0,
            "replies": []
        },
        {
            "body": "Their mothers ingested too much lead lmfao jkjk",
            "author": "jonny2771",
            "id": "grj2bn5",
            "parent_id": "t1_grgwtnf",
            "score": 1,
            "created_utc": 1616191415.0,
            "replies": []
        },
        {
            "body": "Hey now I think we're lovely",
            "author": "Ididitall4thegnocchi",
            "id": "grldjsf",
            "parent_id": "t1_grgwtnf",
            "score": 1,
            "created_utc": 1616251743.0,
            "replies": []
        },
        {
            "body": "This is absolutely true. People try to make it a false dichotomy between a young guy at no allowance and a 70 year old whale with a huge allowance. In my experience, most non-professonal SBs go for the middle ground. Its not even always about hot or not. It often about nice or not. Its one of the ways I think SLF doesn't represent the true bowl. I know for sure that I have been outbid several times and still ended up getting the SB.",
            "author": "OldschoolSD",
            "id": "grg8hsp",
            "parent_id": "t1_grg2w2t",
            "score": 11,
            "created_utc": 1616131179.0,
            "replies": [
                {
                    "body": "I think this is specially true among “non-professional SBs” like you mentioned. \n\nYoung women who are curious about the bowl, and would appreciate some extra cash but don’t need the 100% certainty that an older SD provides. They don’t plan their bills and lifestyle around receiving an allowance.",
                    "author": "techsd00",
                    "id": "grg9dak",
                    "parent_id": "t1_grg8hsp",
                    "score": 4,
                    "created_utc": 1616131870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is very true. Happens to me all the time as a mid 30’s SD.",
            "author": "Fun_Focus8159",
            "id": "grhfh7a",
            "parent_id": "t1_grg2w2t",
            "score": 3,
            "created_utc": 1616164567.0,
            "replies": []
        },
        {
            "body": "Yeah, same here. I feel like if you say this here though you get destroyed like you tricked or scammed the SB.",
            "author": "us3rname9",
            "id": "grg3rdu",
            "parent_id": "t1_grg2w2t",
            "score": 4,
            "created_utc": 1616127845.0,
            "replies": [
                {
                    "body": "we're all scum for bringing more to table than money and less saggy balls. /s\n\nSLF is an echo chamber of old men and young women who want to maximize how money is exchanged for fucking.\n\nreality of SA and other sugardaddy sites is that most of the women want something that feels as normal as possible but with added incentives.  Money is an incentive, but that alone would not make an intimate relationship work for them.  Sitting in public with a guy 40 years older for them is awkward and puts them on edge at all times.  Fucking a guy with a wife is not morally sound.  Being a homewrecker is not ok.  Sucking old dick isn't something they can stomach.  These are all realities of your typical \"non professional SB\"\n\nThe younger SDs offer normalcy and that matters a lot.",
                    "author": null,
                    "id": "grifoqp",
                    "parent_id": "t1_grg3rdu",
                    "score": 2,
                    "created_utc": 1616180560.0,
                    "replies": []
                },
                {
                    "body": "Don't forget groomed. Lol",
                    "author": "OldschoolSD",
                    "id": "grg8m9e",
                    "parent_id": "t1_grg3rdu",
                    "score": -1,
                    "created_utc": 1616131274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🙋🏻‍♀️🙋🏻‍♀️ over 40 here and my primary interest is still the money. 😂",
            "author": "ExExpectations",
            "id": "grgg1r6",
            "parent_id": "t1_grgajml",
            "score": 8,
            "created_utc": 1616137634.0,
            "replies": [
                {
                    "body": "Right? 39 here but I know my motivation won't change as I get older. If I wanted a relationship not revolving around $$$, I could find a guy in the real world. Not on SA.",
                    "author": "Abbyisafantasy",
                    "id": "grggujj",
                    "parent_id": "t1_grgg1r6",
                    "score": 5,
                    "created_utc": 1616138378.0,
                    "replies": [
                        {
                            "body": "Exactly. SA relationships don’t last. The men will want the next shiny thing.",
                            "author": "ExExpectations",
                            "id": "grgh5fk",
                            "parent_id": "t1_grggujj",
                            "score": 3,
                            "created_utc": 1616138662.0,
                            "replies": []
                        },
                        {
                            "body": "I always tell guys that seem to be trying to feel out the chances of a vanilla relationship \"If I wanted to fuck for free I'd go to Tinder; it's one of the few advantages of being a woman.\" That usually shuts them down quick.",
                            "author": "clashingtaco",
                            "id": "gri5qve",
                            "parent_id": "t1_grggujj",
                            "score": 1,
                            "created_utc": 1616176171.0,
                            "replies": [
                                {
                                    "body": "“But we have amazing chemistry! Like once in a lifetime kind of connection! How could you just give it up / walk away...!” \n\n🙄🙄\n\nProvide financial support. I’ll happily stay.",
                                    "author": "ExExpectations",
                                    "id": "grjrprj",
                                    "parent_id": "t1_gri5qve",
                                    "score": 0,
                                    "created_utc": 1616205246.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will submit that you simply have not met or had frank discussions with many sugar babies under 40. You can’t speak for them. You’re on the same side of the aisle and you’re blinded to most of the conversations",
            "author": "224quickmaths",
            "id": "grj7jx5",
            "parent_id": "t1_grgajml",
            "score": 2,
            "created_utc": 1616194150.0,
            "replies": [
                {
                    "body": "I will submit that you simply have not done any statistically significant research. You can’t make statements based on your flimsy anecdotal evidence. \n\nYou’re on the opposite side of the aisle (both age and gender) and you’re proposing to speak for SB? 😂",
                    "author": "whatwouldjunedo",
                    "id": "grjji0x",
                    "parent_id": "t1_grj7jx5",
                    "score": 0,
                    "created_utc": 1616200668.0,
                    "replies": [
                        {
                            "body": "I’m not speaking for anyone. I simply know for a fact that I have entered into and have had infinitely more arrangements with sugar babies than you ever have in the past or will have in the future. Your n=1. Your experience on the subject of what sugar babies will and won’t accept is extremely small.",
                            "author": "224quickmaths",
                            "id": "grjjwp8",
                            "parent_id": "t1_grjji0x",
                            "score": 2,
                            "created_utc": 1616200895.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im a mid 30’s SD, decent looking and in shape. I’ve had so many POT’s tell me their normal PPM, I tell them sorry that’s too high best of luck. Then they start negotiating against themselves and cut their PPM in half. Most of my SB’s have accepted a lower PPM from me than they could’ve gotten elsewhere, because they said they were attracted to me. I’m not trying to screw anyone over, I just say I’m sorry our financial expectations aren’t aligned, but they almost always come back and cut their PPM ask significantly. \n\nA lot of SB’s main motivation isn’t money, they just need some extra money here and there and want to have fun with an older guy.",
            "author": "Fun_Focus8159",
            "id": "grhfbh2",
            "parent_id": "t1_grgajml",
            "score": 3,
            "created_utc": 1616164490.0,
            "replies": [
                {
                    "body": "this is correct.  those SBs also don't come to these forums because it's not a job to them.  it's a relationship that helps them out.",
                    "author": null,
                    "id": "grig0nz",
                    "parent_id": "t1_grhfbh2",
                    "score": 3,
                    "created_utc": 1616180717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How many SBs have you talked to outside of Reddit or other Internet forums?",
            "author": "us3rname9",
            "id": "grkcuws",
            "parent_id": "t1_grgajml",
            "score": 1,
            "created_utc": 1616219624.0,
            "replies": [
                {
                    "body": "6. \n\nHow many have you talked to outside of the internet that weren’t trying to sleep with you so they could get your money?",
                    "author": "whatwouldjunedo",
                    "id": "grobaoo",
                    "parent_id": "t1_grkcuws",
                    "score": 1,
                    "created_utc": 1616306315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've had many turn into friends.  they've moved onto other SDs, in relationships, married.  Just this week i had one ask me out to dinner and she specified she wanted to treat me since i had always treated her in the past.  She wanted to celebrate a big deal she closed.  \n\nAnother ex-SB wanted to grab dinner a couple weeks ago for business advice since we work in the same field.\n\n*gasp* that we younger SDs treat people like people.  The older SDs or professional SBs on SLF won't understand because the bowl to them is only about exchanging sex for money.",
            "author": null,
            "id": "grige5f",
            "parent_id": "t1_grge53j",
            "score": 1,
            "created_utc": 1616180892.0,
            "replies": [
                {
                    "body": "And then the SBs on here say to go for the older men but then complain about them daily.\n\nWhy not just treat everyone as individuals 🤦🏻‍♂️",
                    "author": "Late_Ad_6293",
                    "id": "grign1d",
                    "parent_id": "t1_grige5f",
                    "score": 1,
                    "created_utc": 1616181007.0,
                    "replies": [
                        {
                            "body": "i actually think it makes sense.\nthe SBs likely want it to work more with a younger guy, so when it doesn't pan out...it hurts more.  With an old guy, they probably don't give a shit and move onto the next saggy balled guy. So psychologically, they're more frustrated with the young SDs that don't pan out.",
                            "author": null,
                            "id": "grihp80",
                            "parent_id": "t1_grign1d",
                            "score": 1,
                            "created_utc": 1616181500.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’ve literally never been young, rich, and male. How can you possibly say that it’s realistic or not? And where did the number 42 come from? \n\nDisposable income is disposable income. I can buy a watch I don’t need or really want or I can have a fun time relaxing with a pretty 20something while helping her out with an allowance. It’s really extremely simple. What’s not to understand?",
            "author": "224quickmaths",
            "id": "grj6eiw",
            "parent_id": "t1_grinhy9",
            "score": 2,
            "created_utc": 1616193538.0,
            "replies": [
                {
                    "body": "You can be all those things (young and rich) \n\nBUT WHY WOULD YOU BE A SD. WHEN YOU COULD VANILLA DATE FOR FREE\n\nTHATS MY POINT",
                    "author": "Zealousideal_Map8100",
                    "id": "grkuqw9",
                    "parent_id": "t1_grj6eiw",
                    "score": 1,
                    "created_utc": 1616238325.0,
                    "replies": [
                        {
                            "body": "\nVanilla dating is NOT free. It costs time. I can easily make more money. I cannot make more time. \n\nAlso, don’t all caps me. I’m not the one being dense and disingenuous here.",
                            "author": "224quickmaths",
                            "id": "grkvao5",
                            "parent_id": "t1_grkuqw9",
                            "score": 0,
                            "created_utc": 1616238877.0,
                            "replies": [
                                {
                                    "body": "Obviously it’s not free but you don’t have to pay X amount every week or month.\n\nAnd you know the girl is most likely with you because she likes you,  not because of your money. \n\n\nWith sugaring when the money stops, the SB 9/10 will move on....\n\n(Soz for the caps)",
                                    "author": "Zealousideal_Map8100",
                                    "id": "grkvi1j",
                                    "parent_id": "t1_grkvao5",
                                    "score": 1,
                                    "created_utc": 1616239079.0,
                                    "replies": [
                                        {
                                            "body": "You’re saying obviously it’s not free when in your previous post you say that I can vanilla date for free.\n\nAt some point time and convenience becomes more important than the money. That’s the reason I’m at Starbucks right now rather than making a flat white at home even though Starbucks costs money.\n\nThe cost of a sugar arrangement to me is negligible. I don’t value and honor money the same way you do. That mentality is difficult to understand if you’re not in the same financial situation.",
                                            "author": "224quickmaths",
                                            "id": "grkvty5",
                                            "parent_id": "t1_grkvi1j",
                                            "score": 1,
                                            "created_utc": 1616239397.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Frogs/toads come in all ages.",
            "author": "ExExpectations",
            "id": "grgfmqp",
            "parent_id": "t1_grgfeqr",
            "score": 7,
            "created_utc": 1616137257.0,
            "replies": []
        },
        {
            "body": "You’re kidding right?\n\nThey may work in tech.  They could come from old money \n\nThey could be a small biz owner who works all day but zero free time for vanilla dating.",
            "author": "pussy_impaler337",
            "id": "grh92ew",
            "parent_id": "t1_grgmdmq",
            "score": 4,
            "created_utc": 1616161380.0,
            "replies": []
        },
        {
            "body": "There’s a big difference between dating a decent looking woman around your age and dating a beautiful woman 10 years younger. \n\nNo 35 year old dude (unless he is a supermodel) is routinely matching with hot 22 year olds on Bumble. Sugar makes it so easy.",
            "author": "us3rname9",
            "id": "grip11t",
            "parent_id": "t1_grgmdmq",
            "score": 2,
            "created_utc": 1616184859.0,
            "replies": []
        },
        {
            "body": "How is it not realistic? I’m mid 30’s and worth close to a million. Make decent money with my corporate job. I have plenty of disposable income to provide an allowance for 3-4 SB’s at the same time.",
            "author": "Fun_Focus8159",
            "id": "grheu03",
            "parent_id": "t1_grgmdmq",
            "score": 1,
            "created_utc": 1616164257.0,
            "replies": [
                {
                    "body": "I’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense",
                    "author": "Zealousideal_Map8100",
                    "id": "grilf0c",
                    "parent_id": "t1_grheu03",
                    "score": 1,
                    "created_utc": 1616183233.0,
                    "replies": [
                        {
                            "body": "Don’t need to but it is much much much easier. Less bullshit. The line is already drawn and both parties know what they’re getting into. Have you ever truly dated a very attractive woman? It can be annoying in the best of scenarios. If you’re busy with your own business, hobbies, friends, it’s much better to simplify that part of your life.",
                            "author": "224quickmaths",
                            "id": "grj728b",
                            "parent_id": "t1_grilf0c",
                            "score": 2,
                            "created_utc": 1616193889.0,
                            "replies": []
                        },
                        {
                            "body": "It’s been said before but I’ll say it again. As a mid 30’s guy, it’s very hard to get that smoking hot 18-21 year old college cheerleader/sorority girl with vanilla dating. It almost always requires sugar. All of my SB’s have been 18-22 and extremely beautiful. Most likely couldn’t have gotten these girls without paying.",
                            "author": "Fun_Focus8159",
                            "id": "griltx3",
                            "parent_id": "t1_grilf0c",
                            "score": 1,
                            "created_utc": 1616183423.0,
                            "replies": [
                                {
                                    "body": "You aren’t using your wealth correctly.\n\nIf you have money, the women will come if you know how to.....",
                                    "author": "Zealousideal_Map8100",
                                    "id": "grimu9g",
                                    "parent_id": "t1_griltx3",
                                    "score": 1,
                                    "created_utc": 1616183881.0,
                                    "replies": [
                                        {
                                            "body": "Lol ok. Im not saying its impossible to get these girls. I’m vanilla dating a 19 yo I met from hinge. I’m saying sugar makes it 10000 times easier.",
                                            "author": "Fun_Focus8159",
                                            "id": "grimxp4",
                                            "parent_id": "t1_grimu9g",
                                            "score": 1,
                                            "created_utc": 1616183924.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Also again the 18-22 year old cheerleaders/sorority girls aren’t going to consider vanilla dating a 35 year old man in the United States.  Sugar date?  Sure but not vanilla date.  \n\nThe younger sds likely put a max age range of 23 or 24 so you probably aren’t competing with these girls anyways",
                            "author": "pussy_impaler337",
                            "id": "grmtucc",
                            "parent_id": "t1_grilf0c",
                            "score": 1,
                            "created_utc": 1616276532.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Close to a million, but you balk and say you’re short on cash when an SB asks for you to pay for a gym membership? 👀",
                    "author": null,
                    "id": "griaub4",
                    "parent_id": "t1_grheu03",
                    "score": 0,
                    "created_utc": 1616178374.0,
                    "replies": [
                        {
                            "body": "LOL 🤣🤣🤣",
                            "author": "Ghanaiantoffee",
                            "id": "griescl",
                            "parent_id": "t1_griaub4",
                            "score": 1,
                            "created_utc": 1616180144.0,
                            "replies": []
                        },
                        {
                            "body": "Lol when did I ever say that? I don’t mind paying for a gym membership, but if I’m paying for extra things outside of the PPM/Allowance, then I expect something extra in return from the SB. More attention, more dates, more affection, something. \n\nThat’s reasonable right?",
                            "author": "Fun_Focus8159",
                            "id": "griifnp",
                            "parent_id": "t1_griaub4",
                            "score": 1,
                            "created_utc": 1616181841.0,
                            "replies": [
                                {
                                    "body": "For reference: https://www.reddit.com/r/sugarlifestyleforum/comments/lpamf3/my_sd_is_broke/goag9lo/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nAnyway, if that’s the term of your arrangement that you two laid out, it’s reasonable. Most certainly that ex(?)SB was asking for a more expensive gym, like Equinox, that could put a little dent in a quasi-millionaire’s wallet. Not a much cheaper one like 24hr/LA/Planet Fitness/Crunch.",
                                    "author": null,
                                    "id": "grikx4y",
                                    "parent_id": "t1_griifnp",
                                    "score": 0,
                                    "created_utc": 1616183002.0,
                                    "replies": [
                                        {
                                            "body": "Lol you mad?",
                                            "author": "Fun_Focus8159",
                                            "id": "gril2lx",
                                            "parent_id": "t1_grikx4y",
                                            "score": 2,
                                            "created_utc": 1616183074.0,
                                            "replies": [
                                                {
                                                    "body": "🥱",
                                                    "author": null,
                                                    "id": "gritesw",
                                                    "parent_id": "t1_gril2lx",
                                                    "score": 0,
                                                    "created_utc": 1616186953.0,
                                                    "replies": [
                                                        {
                                                            "body": "😘",
                                                            "author": "Fun_Focus8159",
                                                            "id": "griwx6r",
                                                            "parent_id": "t1_gritesw",
                                                            "score": 2,
                                                            "created_utc": 1616188692.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It’s his money. Stop watching his pockets and worry about yourself and your own arrangements. Everybody gets to pick what they want and do not want to pay for.",
                                            "author": "224quickmaths",
                                            "id": "grj6p36",
                                            "parent_id": "t1_grikx4y",
                                            "score": 0,
                                            "created_utc": 1616193695.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I got married and divorced young.  Then I was in a long term vanilla relationship that failed because she wanted more of my time than I was willing to give to her.  I grew up poor and have made everything myself and wanted to grow my company as quickly as possible so that I would never be anything like how I grew up.  She wanted all of the perks me working created (wealth, vacations, paying for her grad school) but also wanted every spare moment I had.\n\nOnce that ended I tried the dating pool for a while but never saw myself getting married or having children and that's just what is expected in the vanilla world.  In arrangements I give the same expectations as I did before but with the allowance aspect apparently it's taken more seriously on the female's side.",
            "author": "the-other-horcrux",
            "id": "grhatg4",
            "parent_id": "t1_grgmdmq",
            "score": 1,
            "created_utc": 1616162264.0,
            "replies": []
        },
        {
            "body": "I'm 35 and have a net worth of just under 1.5 million with cashflows from rental properties that fueled most of my sugar budget.\n\nIt's easy, we worked harder than everyone else, got lucky, or already rich.",
            "author": null,
            "id": "griehyi",
            "parent_id": "t1_grgmdmq",
            "score": 1,
            "created_utc": 1616180014.0,
            "replies": [
                {
                    "body": "I’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense",
                    "author": "Zealousideal_Map8100",
                    "id": "grilbxh",
                    "parent_id": "t1_griehyi",
                    "score": 3,
                    "created_utc": 1616183193.0,
                    "replies": [
                        {
                            "body": "for me, it's cause i needed to grind and focus on work. There's also the aspect of not wanting to be emotionally tied to anyone so that you can focus on your primary objective...make money. Work involved almost weekly travel, making relationships hard.  So sugar dating allowed for very easy upfront understandings of expectations without feelings getting in the way.  i also traveled to multiple cities often, so i'd pretty much have a SB in each frequently traveled city.  \n\non a more personal note, i'm an asian male who's short. If you read anything online about online dating for asian males, we have the roughest time in online dating for any male. you add short to that and you're in for a tough time. \n\nSo for someone with no time, issues with online dating (less issues when meeting in person), a pool of money that can't be spent because you're always working, i'd direct this back to you...why wouldn't i sugar date?",
                            "author": null,
                            "id": "grimrsi",
                            "parent_id": "t1_grilbxh",
                            "score": 1,
                            "created_utc": 1616183850.0,
                            "replies": [
                                {
                                    "body": "I get that, black women and Asian men are statistically the least liked on Internet dating. So I feel your pain. \n\nBut I promise you. If you have wealth and money, the women will come....\n\nYeah you might have to be a bit arrogant and “Brag” about it, but the women will come!!!",
                                    "author": "Zealousideal_Map8100",
                                    "id": "grin7bz",
                                    "parent_id": "t1_grimrsi",
                                    "score": 1,
                                    "created_utc": 1616184039.0,
                                    "replies": [
                                        {
                                            "body": "The type of money you need to vanilla date girls who are 7-10 on the looks scale,and are 18-25 without offering marriage or LTR far exceeds the money you need to sugar date. You can sugar date with a minimum half a million liquid(alot of SDshave less) and low to mid six figure salary(assuming no kids). In order to casually vanilla date gorgeous girls,you need to be making a million annually,and have about a minimum 5 million in the bank/liquid in most major cities. The majority of SDs young or old probably dont have that. You need to enough money where she can live the millionaire lifestyle,without having her having to work. Even if you are offering marriage or LTR,you still need to make probably closer to half a million a year\n\n&#x200B;\n\nGirls who are Instagram hott have alot of options from pretty people jobs that pay well(high end bar waitress/hostess/PR marketing gigs corporate assistant) plus they can date long terms guys who make low to just below six figures who are age-appropriate but will pay for all the extra curriculars like drinks dinner and partying. They would rather do a combination of these two things than hang out with a 30 plus with a couple of million in the bank.",
                                            "author": "Secret_Diet7053",
                                            "id": "grk4u1p",
                                            "parent_id": "t1_grin7bz",
                                            "score": 2,
                                            "created_utc": 1616213388.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I was actually going to mention black women but didn't want to open up that can of worms!  \n\nI've been out of the bowl for a long while now. Still find my past life entertaining. have promising long term prospect vanilla relationdhips brewing right now. To be clear, I've never had any issue dating. But the change of society to online dating presented problems I didn't have in the past \n\nAlso may jump back in the bowl while I live in South Florida for a bit. Haven't decided yet.",
                                            "author": null,
                                            "id": "grinshw",
                                            "parent_id": "t1_grin7bz",
                                            "score": 0,
                                            "created_utc": 1616184292.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you one of those who subtract 25 years??",
            "author": "ExExpectations",
            "id": "grgg3fm",
            "parent_id": "t1_grg5ujw",
            "score": 3,
            "created_utc": 1616137676.0,
            "replies": [
                {
                    "body": "I will when I'm 63",
                    "author": "wb19081908",
                    "id": "grgg5a9",
                    "parent_id": "t1_grgg3fm",
                    "score": 0,
                    "created_utc": 1616137722.0,
                    "replies": [
                        {
                            "body": "It’s past midnight. Don’t make me do math.",
                            "author": "ExExpectations",
                            "id": "grggkh0",
                            "parent_id": "t1_grgg5a9",
                            "score": 3,
                            "created_utc": 1616138113.0,
                            "replies": [
                                {
                                    "body": "Im.49.  Lols.  I look early to mid 30s.  Especially when I was a bit lighter.",
                                    "author": "wb19081908",
                                    "id": "grghqwx",
                                    "parent_id": "t1_grggkh0",
                                    "score": 1,
                                    "created_utc": 1616139222.0,
                                    "replies": [
                                        {
                                            "body": "Hmm 🤔",
                                            "author": "ExExpectations",
                                            "id": "grjqiha",
                                            "parent_id": "t1_grghqwx",
                                            "score": 1,
                                            "created_utc": 1616204571.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am 22. 😘",
            "author": "IngenuityAdept5380",
            "id": "grhf27n",
            "parent_id": "t1_grgxivu",
            "score": 3,
            "created_utc": 1616164367.0,
            "replies": []
        },
        {
            "body": "Not really, but okay. \n\nI'm a 51yo Cougar BDSM switch. I do fairly well in the Mrs. Robinson/Stifler's Mom fantasy niche. 😉",
            "author": "LadyMorgan2018",
            "id": "grhtl1e",
            "parent_id": "t1_grgxivu",
            "score": 1,
            "created_utc": 1616170915.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "griksez",
                    "parent_id": "t1_grhtl1e",
                    "score": 2,
                    "created_utc": 1616182940.0,
                    "replies": [
                        {
                            "body": "Brilliant!!! (I've heard the cucumber come on before...now I have a reference for it! Lolol). I tend towards Stifler's mom with a touch of Mrs. Robinson for the shy ones. 😈",
                            "author": "LadyMorgan2018",
                            "id": "grizduc",
                            "parent_id": "t1_griksez",
                            "score": 2,
                            "created_utc": 1616189925.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didnt realize Stifler's mom hard a rough side! 😆",
            "author": "Life_b_beautiful",
            "id": "gritrsi",
            "parent_id": "t1_grhtdv9",
            "score": 1,
            "created_utc": 1616187128.0,
            "replies": [
                {
                    "body": "Awww...bless your heart. I did mention the BDSM part...didn't I? \n\nI may not be everyone's cuppa tea, but I'm someone's double shot of whisky and I'll bite if you beg for it.",
                    "author": "LadyMorgan2018",
                    "id": "grizrs9",
                    "parent_id": "t1_gritrsi",
                    "score": 1,
                    "created_utc": 1616190121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes",
            "author": "Cornycorgichick",
            "id": "grh1ggf",
            "parent_id": "t1_grh1aqz",
            "score": 2,
            "created_utc": 1616157005.0,
            "replies": []
        },
        {
            "body": "It’s pretty simple.  If you are 35 and a man of means you simple won’t have the opportunity to date an extremely hot 20 year old college cheerleader or and extremely hot 20 year old college sorority girl through vanilla dating, I’m talking the hottest women in the world.  But totally possible through sugar dating.",
            "author": "pussy_impaler337",
            "id": "grgt33e",
            "parent_id": "t1_grgrxb8",
            "score": 7,
            "created_utc": 1616150682.0,
            "replies": [
                {
                    "body": "This is very true as a 35 year old SD. I do ok with vanilla dating and using tinder, but it’s almost impossible for me to get that college cheerleader/sorority girl without offering sugar.",
                    "author": "Fun_Focus8159",
                    "id": "grhedxl",
                    "parent_id": "t1_grgt33e",
                    "score": 3,
                    "created_utc": 1616164039.0,
                    "replies": []
                },
                {
                    "body": "Thanks pussy_impaler, I stand corrected. 🙄",
                    "author": "ChapterRelative",
                    "id": "grgu44v",
                    "parent_id": "t1_grgt33e",
                    "score": 4,
                    "created_utc": 1616151593.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well dressed, nice car, nice home, job description in place on my tinder and my bumble, account promoted, still get mostly interest from single mothers who barely graduated highschool, 40 lbs overweight, with kids by multiple fathers, who are unemployed and don't drive. On SA I'm meeting up and having dinner and seeing shows with tall athletic graduate students. Women who maintained academic scholarships while they were D1 athletes. If I want to go spend the weekend hiking in the mountains or charter a boat and sail around the bay that's way easier with the women I meet on SA than the women I don't meet through vanilla dating.",
            "author": "Sugarbeggar",
            "id": "gri3cpv",
            "parent_id": "t1_grgrxb8",
            "score": 3,
            "created_utc": 1616175161.0,
            "replies": [
                {
                    "body": "Ditto. Mid-30s here, same experience in vanilla. But every now and then, a decent vanilla match happens. Still remarkable how a piss poor the dating market is. Swiping is a flawed mechanism, in my opinion. How so many women who are obviously 50+ lbs heavier than me think I’d be interested in them is beyond me.",
                    "author": "sdthrowaway006",
                    "id": "griu2py",
                    "parent_id": "t1_gri3cpv",
                    "score": 4,
                    "created_utc": 1616187276.0,
                    "replies": []
                },
                {
                    "body": "I still don't get it, but at least your comment didn't prove my point.",
                    "author": "ChapterRelative",
                    "id": "gri4f97",
                    "parent_id": "t1_gri3cpv",
                    "score": 0,
                    "created_utc": 1616175611.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you're a regular, attractive woman you wouldn't have to be in the bowl. You could find a rich boyfriend who would spoil you.",
            "author": null,
            "id": "grh1gk3",
            "parent_id": "t1_grgrxb8",
            "score": 5,
            "created_utc": 1616157007.0,
            "replies": [
                {
                    "body": "Lol good reverse analogy.",
                    "author": "Fun_Focus8159",
                    "id": "grhe7r7",
                    "parent_id": "t1_grh1gk3",
                    "score": 4,
                    "created_utc": 1616163956.0,
                    "replies": [
                        {
                            "body": "I think SB's need to take a long, good hard look in the mirror.",
                            "author": null,
                            "id": "grhf38s",
                            "parent_id": "t1_grhe7r7",
                            "score": 5,
                            "created_utc": 1616164381.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But how does this work with trying to find older men? It’s not like older men just walk right up to you in public because of the fear of being judged, also not many want to be on Tinder, Bumble, etc.... \n\nI’ve met plenty of older men and casually flirted with good conversations but that’s because my parents own a business in a rich, upper class community. Lol can’t be asking if I could be their SB while there. \n\nPlus every relationship is different; you can’t assume that just because you’re attractive you’ll find a spoiling boyfriend. Depends on where you live and your lifestyle for the chance to meet that person. \n\nI feel like I’m a regular, attractive woman (lol), I’m not into partying, I enjoy a quiet lifestyle (that already gives me a disadvantage since I’m not a socialite), I don’t live in a urban city, and Im attracted to older men so the odds are never in my favor lol.",
                    "author": null,
                    "id": "grhn4xt",
                    "parent_id": "t1_grh1gk3",
                    "score": 0,
                    "created_utc": 1616168118.0,
                    "replies": [
                        {
                            "body": "The same could be said about a younger SD. Maybe he's a busy executive and doesn't have time to pursue other vanilla dating options.  Maybe he just wants to cut through the chase and avoid all the emotional bullshit that comes with finding someone. The point is that you can't say there's anything wrong with a younger SD.",
                            "author": null,
                            "id": "gric6rg",
                            "parent_id": "t1_grhn4xt",
                            "score": 3,
                            "created_utc": 1616178971.0,
                            "replies": [
                                {
                                    "body": "There isn’t anything wrong with a younger SD lol I’m just saying I look for older men so that’s my situation.",
                                    "author": null,
                                    "id": "gricosr",
                                    "parent_id": "t1_gric6rg",
                                    "score": 1,
                                    "created_utc": 1616179193.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Some of us enjoy the kink aspect. I have the spoiling lovers, but still enjoy the fun of sugaring. \n\nBut I was never accused of being \"regular.\" 😎",
                    "author": "LadyMorgan2018",
                    "id": "grhu7tz",
                    "parent_id": "t1_grh1gk3",
                    "score": 0,
                    "created_utc": 1616171191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I dont want to come across as fetishizing because it's not that, but ive dated enough men of all ethnicities and have generally had a better time with not white guys, that it's *almost* a preference",
            "author": "Catezero",
            "id": "grjw5y7",
            "parent_id": "t1_grirbr2",
            "score": 2,
            "created_utc": 1616207854.0,
            "replies": [
                {
                    "body": "I understand what you mean!",
                    "author": "Jimmychoo_Loubou",
                    "id": "grkzume",
                    "parent_id": "t1_grjw5y7",
                    "score": 2,
                    "created_utc": 1616242902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope he does have Ed rather than a boner that lasts for days!  🤣",
            "author": "Greenapplehoneybun",
            "id": "grkka9x",
            "parent_id": "t1_grggrlr",
            "score": 1,
            "created_utc": 1616226942.0,
            "replies": []
        },
        {
            "body": "3 miles is 4.83 km",
            "author": "converter-bot",
            "id": "grhknvm",
            "parent_id": "t1_grhkms1",
            "score": 1,
            "created_utc": 1616167003.0,
            "replies": []
        },
        {
            "body": "I feel your pain. 😂 But luckily I’ve never had a guy refer to himself in 3rd person? That sounds somewhat egotistical, doesn’t it? My guy was just ALWAYS horny, 24/7. Sometimes his random pervy comments were just annoying. He’d say\n “Don’t your lips look nice around my c***?” or “Do you know you’re making my c***throb?” or he’d say “I want to f*** your tits”. It’s like please stop, we’re in public. You’re too grown to be misbehaving like this.😭",
            "author": "SilverStateNative",
            "id": "grjzeak",
            "parent_id": "t1_grjmi7g",
            "score": 2,
            "created_utc": 1616209855.0,
            "replies": [
                {
                    "body": "I've stopped talking to vanilla people that talk like that. Like good lord, we're trying to eat breakfast! Hahaha. Maybe not at the dinner table, I don't know. But yeah. I can't remember, but I think he always started texts like, good morning from the professor, and this professor says hey. Etc etc. IN TEXT MESSAGES. it was just so awkward. I wouldn't mind a somewhat needy text every now and then, but I can't imagine hearing it in public. HAHA",
                    "author": "CodiKo",
                    "id": "grjzv4j",
                    "parent_id": "t1_grjzeak",
                    "score": 2,
                    "created_utc": 1616210149.0,
                    "replies": [
                        {
                            "body": "I mean I don’t mind stroking someone’s ego a bit? But I agree, sometimes it’s just feels so awkward.\nI think my guy was just trying overcompensate though? He was short but very well endowed; it was huge. He was basically 36 but acting like he was 16. Lol",
                            "author": "SilverStateNative",
                            "id": "grk1e3o",
                            "parent_id": "t1_grjzv4j",
                            "score": 1,
                            "created_utc": 1616211106.0,
                            "replies": [
                                {
                                    "body": "Oh yeah, that's different. The 3rd person guy, according to himself anyway, had no problem getting people's attention. He sent more mirror selfies and myspace-quality pictures than anyone I've ever seen. The vanilla guy was just gross. Every text was explicit. He couldn't even say hi without sending something cringe-worthy. I'd stroke an ego though! :)",
                                    "author": "CodiKo",
                                    "id": "grk23e1",
                                    "parent_id": "t1_grk1e3o",
                                    "score": 1,
                                    "created_utc": 1616211559.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gridu2j",
            "parent_id": "t1_grhnjfz",
            "score": 2,
            "created_utc": 1616179710.0,
            "replies": [
                {
                    "body": "😂😂😂",
                    "author": "SilverStateNative",
                    "id": "grixexh",
                    "parent_id": "t1_gridu2j",
                    "score": 1,
                    "created_utc": 1616188932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He was very religious and acted very “conservative” in front of religious Jewish friends.   \nIn other words: He actions contradicted his words, especially when he talked about Trump.",
            "author": "SilverStateNative",
            "id": "grixbno",
            "parent_id": "t1_grhnjfz",
            "score": 0,
            "created_utc": 1616188889.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "grj20eb",
                    "parent_id": "t1_grixbno",
                    "score": 0,
                    "created_utc": 1616191254.0,
                    "replies": [
                        {
                            "body": "Thank you, dealing with certain people can be exhausting. He wasn’t a bad guy? Just very horny/immature, most of the time. And what stereotype are you talking about?",
                            "author": "SilverStateNative",
                            "id": "grj3ay7",
                            "parent_id": "t1_grj20eb",
                            "score": 1,
                            "created_utc": 1616191922.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "grja8pu",
                                    "parent_id": "t1_grj3ay7",
                                    "score": 1,
                                    "created_utc": 1616195597.0,
                                    "replies": [
                                        {
                                            "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
                                            "author": "SilverStateNative",
                                            "id": "grjccnj",
                                            "parent_id": "t1_grja8pu",
                                            "score": 1,
                                            "created_utc": 1616196728.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "grjcyh2",
                                                    "parent_id": "t1_grjccnj",
                                                    "score": 1,
                                                    "created_utc": 1616197062.0,
                                                    "replies": [
                                                        {
                                                            "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                                                            "author": "SilverStateNative",
                                                            "id": "grjeraz",
                                                            "parent_id": "t1_grjcyh2",
                                                            "score": 1,
                                                            "created_utc": 1616198054.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is specially true among “non-professional SBs” like you mentioned. \n\nYoung women who are curious about the bowl, and would appreciate some extra cash but don’t need the 100% certainty that an older SD provides. They don’t plan their bills and lifestyle around receiving an allowance.",
            "author": "techsd00",
            "id": "grg9dak",
            "parent_id": "t1_grg8hsp",
            "score": 4,
            "created_utc": 1616131870.0,
            "replies": []
        },
        {
            "body": "we're all scum for bringing more to table than money and less saggy balls. /s\n\nSLF is an echo chamber of old men and young women who want to maximize how money is exchanged for fucking.\n\nreality of SA and other sugardaddy sites is that most of the women want something that feels as normal as possible but with added incentives.  Money is an incentive, but that alone would not make an intimate relationship work for them.  Sitting in public with a guy 40 years older for them is awkward and puts them on edge at all times.  Fucking a guy with a wife is not morally sound.  Being a homewrecker is not ok.  Sucking old dick isn't something they can stomach.  These are all realities of your typical \"non professional SB\"\n\nThe younger SDs offer normalcy and that matters a lot.",
            "author": null,
            "id": "grifoqp",
            "parent_id": "t1_grg3rdu",
            "score": 2,
            "created_utc": 1616180560.0,
            "replies": []
        },
        {
            "body": "Don't forget groomed. Lol",
            "author": "OldschoolSD",
            "id": "grg8m9e",
            "parent_id": "t1_grg3rdu",
            "score": -1,
            "created_utc": 1616131274.0,
            "replies": []
        },
        {
            "body": "Right? 39 here but I know my motivation won't change as I get older. If I wanted a relationship not revolving around $$$, I could find a guy in the real world. Not on SA.",
            "author": "Abbyisafantasy",
            "id": "grggujj",
            "parent_id": "t1_grgg1r6",
            "score": 5,
            "created_utc": 1616138378.0,
            "replies": [
                {
                    "body": "Exactly. SA relationships don’t last. The men will want the next shiny thing.",
                    "author": "ExExpectations",
                    "id": "grgh5fk",
                    "parent_id": "t1_grggujj",
                    "score": 3,
                    "created_utc": 1616138662.0,
                    "replies": []
                },
                {
                    "body": "I always tell guys that seem to be trying to feel out the chances of a vanilla relationship \"If I wanted to fuck for free I'd go to Tinder; it's one of the few advantages of being a woman.\" That usually shuts them down quick.",
                    "author": "clashingtaco",
                    "id": "gri5qve",
                    "parent_id": "t1_grggujj",
                    "score": 1,
                    "created_utc": 1616176171.0,
                    "replies": [
                        {
                            "body": "“But we have amazing chemistry! Like once in a lifetime kind of connection! How could you just give it up / walk away...!” \n\n🙄🙄\n\nProvide financial support. I’ll happily stay.",
                            "author": "ExExpectations",
                            "id": "grjrprj",
                            "parent_id": "t1_gri5qve",
                            "score": 0,
                            "created_utc": 1616205246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will submit that you simply have not done any statistically significant research. You can’t make statements based on your flimsy anecdotal evidence. \n\nYou’re on the opposite side of the aisle (both age and gender) and you’re proposing to speak for SB? 😂",
            "author": "whatwouldjunedo",
            "id": "grjji0x",
            "parent_id": "t1_grj7jx5",
            "score": 0,
            "created_utc": 1616200668.0,
            "replies": [
                {
                    "body": "I’m not speaking for anyone. I simply know for a fact that I have entered into and have had infinitely more arrangements with sugar babies than you ever have in the past or will have in the future. Your n=1. Your experience on the subject of what sugar babies will and won’t accept is extremely small.",
                    "author": "224quickmaths",
                    "id": "grjjwp8",
                    "parent_id": "t1_grjji0x",
                    "score": 2,
                    "created_utc": 1616200895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this is correct.  those SBs also don't come to these forums because it's not a job to them.  it's a relationship that helps them out.",
            "author": null,
            "id": "grig0nz",
            "parent_id": "t1_grhfbh2",
            "score": 3,
            "created_utc": 1616180717.0,
            "replies": []
        },
        {
            "body": "6. \n\nHow many have you talked to outside of the internet that weren’t trying to sleep with you so they could get your money?",
            "author": "whatwouldjunedo",
            "id": "grobaoo",
            "parent_id": "t1_grkcuws",
            "score": 1,
            "created_utc": 1616306315.0,
            "replies": []
        },
        {
            "body": "And then the SBs on here say to go for the older men but then complain about them daily.\n\nWhy not just treat everyone as individuals 🤦🏻‍♂️",
            "author": "Late_Ad_6293",
            "id": "grign1d",
            "parent_id": "t1_grige5f",
            "score": 1,
            "created_utc": 1616181007.0,
            "replies": [
                {
                    "body": "i actually think it makes sense.\nthe SBs likely want it to work more with a younger guy, so when it doesn't pan out...it hurts more.  With an old guy, they probably don't give a shit and move onto the next saggy balled guy. So psychologically, they're more frustrated with the young SDs that don't pan out.",
                    "author": null,
                    "id": "grihp80",
                    "parent_id": "t1_grign1d",
                    "score": 1,
                    "created_utc": 1616181500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can be all those things (young and rich) \n\nBUT WHY WOULD YOU BE A SD. WHEN YOU COULD VANILLA DATE FOR FREE\n\nTHATS MY POINT",
            "author": "Zealousideal_Map8100",
            "id": "grkuqw9",
            "parent_id": "t1_grj6eiw",
            "score": 1,
            "created_utc": 1616238325.0,
            "replies": [
                {
                    "body": "\nVanilla dating is NOT free. It costs time. I can easily make more money. I cannot make more time. \n\nAlso, don’t all caps me. I’m not the one being dense and disingenuous here.",
                    "author": "224quickmaths",
                    "id": "grkvao5",
                    "parent_id": "t1_grkuqw9",
                    "score": 0,
                    "created_utc": 1616238877.0,
                    "replies": [
                        {
                            "body": "Obviously it’s not free but you don’t have to pay X amount every week or month.\n\nAnd you know the girl is most likely with you because she likes you,  not because of your money. \n\n\nWith sugaring when the money stops, the SB 9/10 will move on....\n\n(Soz for the caps)",
                            "author": "Zealousideal_Map8100",
                            "id": "grkvi1j",
                            "parent_id": "t1_grkvao5",
                            "score": 1,
                            "created_utc": 1616239079.0,
                            "replies": [
                                {
                                    "body": "You’re saying obviously it’s not free when in your previous post you say that I can vanilla date for free.\n\nAt some point time and convenience becomes more important than the money. That’s the reason I’m at Starbucks right now rather than making a flat white at home even though Starbucks costs money.\n\nThe cost of a sugar arrangement to me is negligible. I don’t value and honor money the same way you do. That mentality is difficult to understand if you’re not in the same financial situation.",
                                    "author": "224quickmaths",
                                    "id": "grkvty5",
                                    "parent_id": "t1_grkvi1j",
                                    "score": 1,
                                    "created_utc": 1616239397.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense",
            "author": "Zealousideal_Map8100",
            "id": "grilf0c",
            "parent_id": "t1_grheu03",
            "score": 1,
            "created_utc": 1616183233.0,
            "replies": [
                {
                    "body": "Don’t need to but it is much much much easier. Less bullshit. The line is already drawn and both parties know what they’re getting into. Have you ever truly dated a very attractive woman? It can be annoying in the best of scenarios. If you’re busy with your own business, hobbies, friends, it’s much better to simplify that part of your life.",
                    "author": "224quickmaths",
                    "id": "grj728b",
                    "parent_id": "t1_grilf0c",
                    "score": 2,
                    "created_utc": 1616193889.0,
                    "replies": []
                },
                {
                    "body": "It’s been said before but I’ll say it again. As a mid 30’s guy, it’s very hard to get that smoking hot 18-21 year old college cheerleader/sorority girl with vanilla dating. It almost always requires sugar. All of my SB’s have been 18-22 and extremely beautiful. Most likely couldn’t have gotten these girls without paying.",
                    "author": "Fun_Focus8159",
                    "id": "griltx3",
                    "parent_id": "t1_grilf0c",
                    "score": 1,
                    "created_utc": 1616183423.0,
                    "replies": [
                        {
                            "body": "You aren’t using your wealth correctly.\n\nIf you have money, the women will come if you know how to.....",
                            "author": "Zealousideal_Map8100",
                            "id": "grimu9g",
                            "parent_id": "t1_griltx3",
                            "score": 1,
                            "created_utc": 1616183881.0,
                            "replies": [
                                {
                                    "body": "Lol ok. Im not saying its impossible to get these girls. I’m vanilla dating a 19 yo I met from hinge. I’m saying sugar makes it 10000 times easier.",
                                    "author": "Fun_Focus8159",
                                    "id": "grimxp4",
                                    "parent_id": "t1_grimu9g",
                                    "score": 1,
                                    "created_utc": 1616183924.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Also again the 18-22 year old cheerleaders/sorority girls aren’t going to consider vanilla dating a 35 year old man in the United States.  Sugar date?  Sure but not vanilla date.  \n\nThe younger sds likely put a max age range of 23 or 24 so you probably aren’t competing with these girls anyways",
                    "author": "pussy_impaler337",
                    "id": "grmtucc",
                    "parent_id": "t1_grilf0c",
                    "score": 1,
                    "created_utc": 1616276532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Close to a million, but you balk and say you’re short on cash when an SB asks for you to pay for a gym membership? 👀",
            "author": null,
            "id": "griaub4",
            "parent_id": "t1_grheu03",
            "score": 0,
            "created_utc": 1616178374.0,
            "replies": [
                {
                    "body": "LOL 🤣🤣🤣",
                    "author": "Ghanaiantoffee",
                    "id": "griescl",
                    "parent_id": "t1_griaub4",
                    "score": 1,
                    "created_utc": 1616180144.0,
                    "replies": []
                },
                {
                    "body": "Lol when did I ever say that? I don’t mind paying for a gym membership, but if I’m paying for extra things outside of the PPM/Allowance, then I expect something extra in return from the SB. More attention, more dates, more affection, something. \n\nThat’s reasonable right?",
                    "author": "Fun_Focus8159",
                    "id": "griifnp",
                    "parent_id": "t1_griaub4",
                    "score": 1,
                    "created_utc": 1616181841.0,
                    "replies": [
                        {
                            "body": "For reference: https://www.reddit.com/r/sugarlifestyleforum/comments/lpamf3/my_sd_is_broke/goag9lo/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nAnyway, if that’s the term of your arrangement that you two laid out, it’s reasonable. Most certainly that ex(?)SB was asking for a more expensive gym, like Equinox, that could put a little dent in a quasi-millionaire’s wallet. Not a much cheaper one like 24hr/LA/Planet Fitness/Crunch.",
                            "author": null,
                            "id": "grikx4y",
                            "parent_id": "t1_griifnp",
                            "score": 0,
                            "created_utc": 1616183002.0,
                            "replies": [
                                {
                                    "body": "Lol you mad?",
                                    "author": "Fun_Focus8159",
                                    "id": "gril2lx",
                                    "parent_id": "t1_grikx4y",
                                    "score": 2,
                                    "created_utc": 1616183074.0,
                                    "replies": [
                                        {
                                            "body": "🥱",
                                            "author": null,
                                            "id": "gritesw",
                                            "parent_id": "t1_gril2lx",
                                            "score": 0,
                                            "created_utc": 1616186953.0,
                                            "replies": [
                                                {
                                                    "body": "😘",
                                                    "author": "Fun_Focus8159",
                                                    "id": "griwx6r",
                                                    "parent_id": "t1_gritesw",
                                                    "score": 2,
                                                    "created_utc": 1616188692.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It’s his money. Stop watching his pockets and worry about yourself and your own arrangements. Everybody gets to pick what they want and do not want to pay for.",
                                    "author": "224quickmaths",
                                    "id": "grj6p36",
                                    "parent_id": "t1_grikx4y",
                                    "score": 0,
                                    "created_utc": 1616193695.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not talking about the wealth to be a SD.\n\n\nIf you are YOUNG and RICH why do you need to pay for dates ?!?!\n\n\nMake it make sense",
            "author": "Zealousideal_Map8100",
            "id": "grilbxh",
            "parent_id": "t1_griehyi",
            "score": 3,
            "created_utc": 1616183193.0,
            "replies": [
                {
                    "body": "for me, it's cause i needed to grind and focus on work. There's also the aspect of not wanting to be emotionally tied to anyone so that you can focus on your primary objective...make money. Work involved almost weekly travel, making relationships hard.  So sugar dating allowed for very easy upfront understandings of expectations without feelings getting in the way.  i also traveled to multiple cities often, so i'd pretty much have a SB in each frequently traveled city.  \n\non a more personal note, i'm an asian male who's short. If you read anything online about online dating for asian males, we have the roughest time in online dating for any male. you add short to that and you're in for a tough time. \n\nSo for someone with no time, issues with online dating (less issues when meeting in person), a pool of money that can't be spent because you're always working, i'd direct this back to you...why wouldn't i sugar date?",
                    "author": null,
                    "id": "grimrsi",
                    "parent_id": "t1_grilbxh",
                    "score": 1,
                    "created_utc": 1616183850.0,
                    "replies": [
                        {
                            "body": "I get that, black women and Asian men are statistically the least liked on Internet dating. So I feel your pain. \n\nBut I promise you. If you have wealth and money, the women will come....\n\nYeah you might have to be a bit arrogant and “Brag” about it, but the women will come!!!",
                            "author": "Zealousideal_Map8100",
                            "id": "grin7bz",
                            "parent_id": "t1_grimrsi",
                            "score": 1,
                            "created_utc": 1616184039.0,
                            "replies": [
                                {
                                    "body": "The type of money you need to vanilla date girls who are 7-10 on the looks scale,and are 18-25 without offering marriage or LTR far exceeds the money you need to sugar date. You can sugar date with a minimum half a million liquid(alot of SDshave less) and low to mid six figure salary(assuming no kids). In order to casually vanilla date gorgeous girls,you need to be making a million annually,and have about a minimum 5 million in the bank/liquid in most major cities. The majority of SDs young or old probably dont have that. You need to enough money where she can live the millionaire lifestyle,without having her having to work. Even if you are offering marriage or LTR,you still need to make probably closer to half a million a year\n\n&#x200B;\n\nGirls who are Instagram hott have alot of options from pretty people jobs that pay well(high end bar waitress/hostess/PR marketing gigs corporate assistant) plus they can date long terms guys who make low to just below six figures who are age-appropriate but will pay for all the extra curriculars like drinks dinner and partying. They would rather do a combination of these two things than hang out with a 30 plus with a couple of million in the bank.",
                                    "author": "Secret_Diet7053",
                                    "id": "grk4u1p",
                                    "parent_id": "t1_grin7bz",
                                    "score": 2,
                                    "created_utc": 1616213388.0,
                                    "replies": []
                                },
                                {
                                    "body": "I was actually going to mention black women but didn't want to open up that can of worms!  \n\nI've been out of the bowl for a long while now. Still find my past life entertaining. have promising long term prospect vanilla relationdhips brewing right now. To be clear, I've never had any issue dating. But the change of society to online dating presented problems I didn't have in the past \n\nAlso may jump back in the bowl while I live in South Florida for a bit. Haven't decided yet.",
                                    "author": null,
                                    "id": "grinshw",
                                    "parent_id": "t1_grin7bz",
                                    "score": 0,
                                    "created_utc": 1616184292.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will when I'm 63",
            "author": "wb19081908",
            "id": "grgg5a9",
            "parent_id": "t1_grgg3fm",
            "score": 0,
            "created_utc": 1616137722.0,
            "replies": [
                {
                    "body": "It’s past midnight. Don’t make me do math.",
                    "author": "ExExpectations",
                    "id": "grggkh0",
                    "parent_id": "t1_grgg5a9",
                    "score": 3,
                    "created_utc": 1616138113.0,
                    "replies": [
                        {
                            "body": "Im.49.  Lols.  I look early to mid 30s.  Especially when I was a bit lighter.",
                            "author": "wb19081908",
                            "id": "grghqwx",
                            "parent_id": "t1_grggkh0",
                            "score": 1,
                            "created_utc": 1616139222.0,
                            "replies": [
                                {
                                    "body": "Hmm 🤔",
                                    "author": "ExExpectations",
                                    "id": "grjqiha",
                                    "parent_id": "t1_grghqwx",
                                    "score": 1,
                                    "created_utc": 1616204571.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "griksez",
            "parent_id": "t1_grhtl1e",
            "score": 2,
            "created_utc": 1616182940.0,
            "replies": [
                {
                    "body": "Brilliant!!! (I've heard the cucumber come on before...now I have a reference for it! Lolol). I tend towards Stifler's mom with a touch of Mrs. Robinson for the shy ones. 😈",
                    "author": "LadyMorgan2018",
                    "id": "grizduc",
                    "parent_id": "t1_griksez",
                    "score": 2,
                    "created_utc": 1616189925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awww...bless your heart. I did mention the BDSM part...didn't I? \n\nI may not be everyone's cuppa tea, but I'm someone's double shot of whisky and I'll bite if you beg for it.",
            "author": "LadyMorgan2018",
            "id": "grizrs9",
            "parent_id": "t1_gritrsi",
            "score": 1,
            "created_utc": 1616190121.0,
            "replies": []
        },
        {
            "body": "This is very true as a 35 year old SD. I do ok with vanilla dating and using tinder, but it’s almost impossible for me to get that college cheerleader/sorority girl without offering sugar.",
            "author": "Fun_Focus8159",
            "id": "grhedxl",
            "parent_id": "t1_grgt33e",
            "score": 3,
            "created_utc": 1616164039.0,
            "replies": []
        },
        {
            "body": "Thanks pussy_impaler, I stand corrected. 🙄",
            "author": "ChapterRelative",
            "id": "grgu44v",
            "parent_id": "t1_grgt33e",
            "score": 4,
            "created_utc": 1616151593.0,
            "replies": []
        },
        {
            "body": "Ditto. Mid-30s here, same experience in vanilla. But every now and then, a decent vanilla match happens. Still remarkable how a piss poor the dating market is. Swiping is a flawed mechanism, in my opinion. How so many women who are obviously 50+ lbs heavier than me think I’d be interested in them is beyond me.",
            "author": "sdthrowaway006",
            "id": "griu2py",
            "parent_id": "t1_gri3cpv",
            "score": 4,
            "created_utc": 1616187276.0,
            "replies": []
        },
        {
            "body": "I still don't get it, but at least your comment didn't prove my point.",
            "author": "ChapterRelative",
            "id": "gri4f97",
            "parent_id": "t1_gri3cpv",
            "score": 0,
            "created_utc": 1616175611.0,
            "replies": []
        },
        {
            "body": "Lol good reverse analogy.",
            "author": "Fun_Focus8159",
            "id": "grhe7r7",
            "parent_id": "t1_grh1gk3",
            "score": 4,
            "created_utc": 1616163956.0,
            "replies": [
                {
                    "body": "I think SB's need to take a long, good hard look in the mirror.",
                    "author": null,
                    "id": "grhf38s",
                    "parent_id": "t1_grhe7r7",
                    "score": 5,
                    "created_utc": 1616164381.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But how does this work with trying to find older men? It’s not like older men just walk right up to you in public because of the fear of being judged, also not many want to be on Tinder, Bumble, etc.... \n\nI’ve met plenty of older men and casually flirted with good conversations but that’s because my parents own a business in a rich, upper class community. Lol can’t be asking if I could be their SB while there. \n\nPlus every relationship is different; you can’t assume that just because you’re attractive you’ll find a spoiling boyfriend. Depends on where you live and your lifestyle for the chance to meet that person. \n\nI feel like I’m a regular, attractive woman (lol), I’m not into partying, I enjoy a quiet lifestyle (that already gives me a disadvantage since I’m not a socialite), I don’t live in a urban city, and Im attracted to older men so the odds are never in my favor lol.",
            "author": null,
            "id": "grhn4xt",
            "parent_id": "t1_grh1gk3",
            "score": 0,
            "created_utc": 1616168118.0,
            "replies": [
                {
                    "body": "The same could be said about a younger SD. Maybe he's a busy executive and doesn't have time to pursue other vanilla dating options.  Maybe he just wants to cut through the chase and avoid all the emotional bullshit that comes with finding someone. The point is that you can't say there's anything wrong with a younger SD.",
                    "author": null,
                    "id": "gric6rg",
                    "parent_id": "t1_grhn4xt",
                    "score": 3,
                    "created_utc": 1616178971.0,
                    "replies": [
                        {
                            "body": "There isn’t anything wrong with a younger SD lol I’m just saying I look for older men so that’s my situation.",
                            "author": null,
                            "id": "gricosr",
                            "parent_id": "t1_gric6rg",
                            "score": 1,
                            "created_utc": 1616179193.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some of us enjoy the kink aspect. I have the spoiling lovers, but still enjoy the fun of sugaring. \n\nBut I was never accused of being \"regular.\" 😎",
            "author": "LadyMorgan2018",
            "id": "grhu7tz",
            "parent_id": "t1_grh1gk3",
            "score": 0,
            "created_utc": 1616171191.0,
            "replies": []
        },
        {
            "body": "I understand what you mean!",
            "author": "Jimmychoo_Loubou",
            "id": "grkzume",
            "parent_id": "t1_grjw5y7",
            "score": 2,
            "created_utc": 1616242902.0,
            "replies": []
        },
        {
            "body": "I've stopped talking to vanilla people that talk like that. Like good lord, we're trying to eat breakfast! Hahaha. Maybe not at the dinner table, I don't know. But yeah. I can't remember, but I think he always started texts like, good morning from the professor, and this professor says hey. Etc etc. IN TEXT MESSAGES. it was just so awkward. I wouldn't mind a somewhat needy text every now and then, but I can't imagine hearing it in public. HAHA",
            "author": "CodiKo",
            "id": "grjzv4j",
            "parent_id": "t1_grjzeak",
            "score": 2,
            "created_utc": 1616210149.0,
            "replies": [
                {
                    "body": "I mean I don’t mind stroking someone’s ego a bit? But I agree, sometimes it’s just feels so awkward.\nI think my guy was just trying overcompensate though? He was short but very well endowed; it was huge. He was basically 36 but acting like he was 16. Lol",
                    "author": "SilverStateNative",
                    "id": "grk1e3o",
                    "parent_id": "t1_grjzv4j",
                    "score": 1,
                    "created_utc": 1616211106.0,
                    "replies": [
                        {
                            "body": "Oh yeah, that's different. The 3rd person guy, according to himself anyway, had no problem getting people's attention. He sent more mirror selfies and myspace-quality pictures than anyone I've ever seen. The vanilla guy was just gross. Every text was explicit. He couldn't even say hi without sending something cringe-worthy. I'd stroke an ego though! :)",
                            "author": "CodiKo",
                            "id": "grk23e1",
                            "parent_id": "t1_grk1e3o",
                            "score": 1,
                            "created_utc": 1616211559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂😂😂",
            "author": "SilverStateNative",
            "id": "grixexh",
            "parent_id": "t1_gridu2j",
            "score": 1,
            "created_utc": 1616188932.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grj20eb",
            "parent_id": "t1_grixbno",
            "score": 0,
            "created_utc": 1616191254.0,
            "replies": [
                {
                    "body": "Thank you, dealing with certain people can be exhausting. He wasn’t a bad guy? Just very horny/immature, most of the time. And what stereotype are you talking about?",
                    "author": "SilverStateNative",
                    "id": "grj3ay7",
                    "parent_id": "t1_grj20eb",
                    "score": 1,
                    "created_utc": 1616191922.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "grja8pu",
                            "parent_id": "t1_grj3ay7",
                            "score": 1,
                            "created_utc": 1616195597.0,
                            "replies": [
                                {
                                    "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
                                    "author": "SilverStateNative",
                                    "id": "grjccnj",
                                    "parent_id": "t1_grja8pu",
                                    "score": 1,
                                    "created_utc": 1616196728.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "grjcyh2",
                                            "parent_id": "t1_grjccnj",
                                            "score": 1,
                                            "created_utc": 1616197062.0,
                                            "replies": [
                                                {
                                                    "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                                                    "author": "SilverStateNative",
                                                    "id": "grjeraz",
                                                    "parent_id": "t1_grjcyh2",
                                                    "score": 1,
                                                    "created_utc": 1616198054.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. SA relationships don’t last. The men will want the next shiny thing.",
            "author": "ExExpectations",
            "id": "grgh5fk",
            "parent_id": "t1_grggujj",
            "score": 3,
            "created_utc": 1616138662.0,
            "replies": []
        },
        {
            "body": "I always tell guys that seem to be trying to feel out the chances of a vanilla relationship \"If I wanted to fuck for free I'd go to Tinder; it's one of the few advantages of being a woman.\" That usually shuts them down quick.",
            "author": "clashingtaco",
            "id": "gri5qve",
            "parent_id": "t1_grggujj",
            "score": 1,
            "created_utc": 1616176171.0,
            "replies": [
                {
                    "body": "“But we have amazing chemistry! Like once in a lifetime kind of connection! How could you just give it up / walk away...!” \n\n🙄🙄\n\nProvide financial support. I’ll happily stay.",
                    "author": "ExExpectations",
                    "id": "grjrprj",
                    "parent_id": "t1_gri5qve",
                    "score": 0,
                    "created_utc": 1616205246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not speaking for anyone. I simply know for a fact that I have entered into and have had infinitely more arrangements with sugar babies than you ever have in the past or will have in the future. Your n=1. Your experience on the subject of what sugar babies will and won’t accept is extremely small.",
            "author": "224quickmaths",
            "id": "grjjwp8",
            "parent_id": "t1_grjji0x",
            "score": 2,
            "created_utc": 1616200895.0,
            "replies": []
        },
        {
            "body": "i actually think it makes sense.\nthe SBs likely want it to work more with a younger guy, so when it doesn't pan out...it hurts more.  With an old guy, they probably don't give a shit and move onto the next saggy balled guy. So psychologically, they're more frustrated with the young SDs that don't pan out.",
            "author": null,
            "id": "grihp80",
            "parent_id": "t1_grign1d",
            "score": 1,
            "created_utc": 1616181500.0,
            "replies": []
        },
        {
            "body": "\nVanilla dating is NOT free. It costs time. I can easily make more money. I cannot make more time. \n\nAlso, don’t all caps me. I’m not the one being dense and disingenuous here.",
            "author": "224quickmaths",
            "id": "grkvao5",
            "parent_id": "t1_grkuqw9",
            "score": 0,
            "created_utc": 1616238877.0,
            "replies": [
                {
                    "body": "Obviously it’s not free but you don’t have to pay X amount every week or month.\n\nAnd you know the girl is most likely with you because she likes you,  not because of your money. \n\n\nWith sugaring when the money stops, the SB 9/10 will move on....\n\n(Soz for the caps)",
                    "author": "Zealousideal_Map8100",
                    "id": "grkvi1j",
                    "parent_id": "t1_grkvao5",
                    "score": 1,
                    "created_utc": 1616239079.0,
                    "replies": [
                        {
                            "body": "You’re saying obviously it’s not free when in your previous post you say that I can vanilla date for free.\n\nAt some point time and convenience becomes more important than the money. That’s the reason I’m at Starbucks right now rather than making a flat white at home even though Starbucks costs money.\n\nThe cost of a sugar arrangement to me is negligible. I don’t value and honor money the same way you do. That mentality is difficult to understand if you’re not in the same financial situation.",
                            "author": "224quickmaths",
                            "id": "grkvty5",
                            "parent_id": "t1_grkvi1j",
                            "score": 1,
                            "created_utc": 1616239397.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t need to but it is much much much easier. Less bullshit. The line is already drawn and both parties know what they’re getting into. Have you ever truly dated a very attractive woman? It can be annoying in the best of scenarios. If you’re busy with your own business, hobbies, friends, it’s much better to simplify that part of your life.",
            "author": "224quickmaths",
            "id": "grj728b",
            "parent_id": "t1_grilf0c",
            "score": 2,
            "created_utc": 1616193889.0,
            "replies": []
        },
        {
            "body": "It’s been said before but I’ll say it again. As a mid 30’s guy, it’s very hard to get that smoking hot 18-21 year old college cheerleader/sorority girl with vanilla dating. It almost always requires sugar. All of my SB’s have been 18-22 and extremely beautiful. Most likely couldn’t have gotten these girls without paying.",
            "author": "Fun_Focus8159",
            "id": "griltx3",
            "parent_id": "t1_grilf0c",
            "score": 1,
            "created_utc": 1616183423.0,
            "replies": [
                {
                    "body": "You aren’t using your wealth correctly.\n\nIf you have money, the women will come if you know how to.....",
                    "author": "Zealousideal_Map8100",
                    "id": "grimu9g",
                    "parent_id": "t1_griltx3",
                    "score": 1,
                    "created_utc": 1616183881.0,
                    "replies": [
                        {
                            "body": "Lol ok. Im not saying its impossible to get these girls. I’m vanilla dating a 19 yo I met from hinge. I’m saying sugar makes it 10000 times easier.",
                            "author": "Fun_Focus8159",
                            "id": "grimxp4",
                            "parent_id": "t1_grimu9g",
                            "score": 1,
                            "created_utc": 1616183924.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also again the 18-22 year old cheerleaders/sorority girls aren’t going to consider vanilla dating a 35 year old man in the United States.  Sugar date?  Sure but not vanilla date.  \n\nThe younger sds likely put a max age range of 23 or 24 so you probably aren’t competing with these girls anyways",
            "author": "pussy_impaler337",
            "id": "grmtucc",
            "parent_id": "t1_grilf0c",
            "score": 1,
            "created_utc": 1616276532.0,
            "replies": []
        },
        {
            "body": "LOL 🤣🤣🤣",
            "author": "Ghanaiantoffee",
            "id": "griescl",
            "parent_id": "t1_griaub4",
            "score": 1,
            "created_utc": 1616180144.0,
            "replies": []
        },
        {
            "body": "Lol when did I ever say that? I don’t mind paying for a gym membership, but if I’m paying for extra things outside of the PPM/Allowance, then I expect something extra in return from the SB. More attention, more dates, more affection, something. \n\nThat’s reasonable right?",
            "author": "Fun_Focus8159",
            "id": "griifnp",
            "parent_id": "t1_griaub4",
            "score": 1,
            "created_utc": 1616181841.0,
            "replies": [
                {
                    "body": "For reference: https://www.reddit.com/r/sugarlifestyleforum/comments/lpamf3/my_sd_is_broke/goag9lo/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nAnyway, if that’s the term of your arrangement that you two laid out, it’s reasonable. Most certainly that ex(?)SB was asking for a more expensive gym, like Equinox, that could put a little dent in a quasi-millionaire’s wallet. Not a much cheaper one like 24hr/LA/Planet Fitness/Crunch.",
                    "author": null,
                    "id": "grikx4y",
                    "parent_id": "t1_griifnp",
                    "score": 0,
                    "created_utc": 1616183002.0,
                    "replies": [
                        {
                            "body": "Lol you mad?",
                            "author": "Fun_Focus8159",
                            "id": "gril2lx",
                            "parent_id": "t1_grikx4y",
                            "score": 2,
                            "created_utc": 1616183074.0,
                            "replies": [
                                {
                                    "body": "🥱",
                                    "author": null,
                                    "id": "gritesw",
                                    "parent_id": "t1_gril2lx",
                                    "score": 0,
                                    "created_utc": 1616186953.0,
                                    "replies": [
                                        {
                                            "body": "😘",
                                            "author": "Fun_Focus8159",
                                            "id": "griwx6r",
                                            "parent_id": "t1_gritesw",
                                            "score": 2,
                                            "created_utc": 1616188692.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It’s his money. Stop watching his pockets and worry about yourself and your own arrangements. Everybody gets to pick what they want and do not want to pay for.",
                            "author": "224quickmaths",
                            "id": "grj6p36",
                            "parent_id": "t1_grikx4y",
                            "score": 0,
                            "created_utc": 1616193695.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "for me, it's cause i needed to grind and focus on work. There's also the aspect of not wanting to be emotionally tied to anyone so that you can focus on your primary objective...make money. Work involved almost weekly travel, making relationships hard.  So sugar dating allowed for very easy upfront understandings of expectations without feelings getting in the way.  i also traveled to multiple cities often, so i'd pretty much have a SB in each frequently traveled city.  \n\non a more personal note, i'm an asian male who's short. If you read anything online about online dating for asian males, we have the roughest time in online dating for any male. you add short to that and you're in for a tough time. \n\nSo for someone with no time, issues with online dating (less issues when meeting in person), a pool of money that can't be spent because you're always working, i'd direct this back to you...why wouldn't i sugar date?",
            "author": null,
            "id": "grimrsi",
            "parent_id": "t1_grilbxh",
            "score": 1,
            "created_utc": 1616183850.0,
            "replies": [
                {
                    "body": "I get that, black women and Asian men are statistically the least liked on Internet dating. So I feel your pain. \n\nBut I promise you. If you have wealth and money, the women will come....\n\nYeah you might have to be a bit arrogant and “Brag” about it, but the women will come!!!",
                    "author": "Zealousideal_Map8100",
                    "id": "grin7bz",
                    "parent_id": "t1_grimrsi",
                    "score": 1,
                    "created_utc": 1616184039.0,
                    "replies": [
                        {
                            "body": "The type of money you need to vanilla date girls who are 7-10 on the looks scale,and are 18-25 without offering marriage or LTR far exceeds the money you need to sugar date. You can sugar date with a minimum half a million liquid(alot of SDshave less) and low to mid six figure salary(assuming no kids). In order to casually vanilla date gorgeous girls,you need to be making a million annually,and have about a minimum 5 million in the bank/liquid in most major cities. The majority of SDs young or old probably dont have that. You need to enough money where she can live the millionaire lifestyle,without having her having to work. Even if you are offering marriage or LTR,you still need to make probably closer to half a million a year\n\n&#x200B;\n\nGirls who are Instagram hott have alot of options from pretty people jobs that pay well(high end bar waitress/hostess/PR marketing gigs corporate assistant) plus they can date long terms guys who make low to just below six figures who are age-appropriate but will pay for all the extra curriculars like drinks dinner and partying. They would rather do a combination of these two things than hang out with a 30 plus with a couple of million in the bank.",
                            "author": "Secret_Diet7053",
                            "id": "grk4u1p",
                            "parent_id": "t1_grin7bz",
                            "score": 2,
                            "created_utc": 1616213388.0,
                            "replies": []
                        },
                        {
                            "body": "I was actually going to mention black women but didn't want to open up that can of worms!  \n\nI've been out of the bowl for a long while now. Still find my past life entertaining. have promising long term prospect vanilla relationdhips brewing right now. To be clear, I've never had any issue dating. But the change of society to online dating presented problems I didn't have in the past \n\nAlso may jump back in the bowl while I live in South Florida for a bit. Haven't decided yet.",
                            "author": null,
                            "id": "grinshw",
                            "parent_id": "t1_grin7bz",
                            "score": 0,
                            "created_utc": 1616184292.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s past midnight. Don’t make me do math.",
            "author": "ExExpectations",
            "id": "grggkh0",
            "parent_id": "t1_grgg5a9",
            "score": 3,
            "created_utc": 1616138113.0,
            "replies": [
                {
                    "body": "Im.49.  Lols.  I look early to mid 30s.  Especially when I was a bit lighter.",
                    "author": "wb19081908",
                    "id": "grghqwx",
                    "parent_id": "t1_grggkh0",
                    "score": 1,
                    "created_utc": 1616139222.0,
                    "replies": [
                        {
                            "body": "Hmm 🤔",
                            "author": "ExExpectations",
                            "id": "grjqiha",
                            "parent_id": "t1_grghqwx",
                            "score": 1,
                            "created_utc": 1616204571.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Brilliant!!! (I've heard the cucumber come on before...now I have a reference for it! Lolol). I tend towards Stifler's mom with a touch of Mrs. Robinson for the shy ones. 😈",
            "author": "LadyMorgan2018",
            "id": "grizduc",
            "parent_id": "t1_griksez",
            "score": 2,
            "created_utc": 1616189925.0,
            "replies": []
        },
        {
            "body": "I think SB's need to take a long, good hard look in the mirror.",
            "author": null,
            "id": "grhf38s",
            "parent_id": "t1_grhe7r7",
            "score": 5,
            "created_utc": 1616164381.0,
            "replies": []
        },
        {
            "body": "The same could be said about a younger SD. Maybe he's a busy executive and doesn't have time to pursue other vanilla dating options.  Maybe he just wants to cut through the chase and avoid all the emotional bullshit that comes with finding someone. The point is that you can't say there's anything wrong with a younger SD.",
            "author": null,
            "id": "gric6rg",
            "parent_id": "t1_grhn4xt",
            "score": 3,
            "created_utc": 1616178971.0,
            "replies": [
                {
                    "body": "There isn’t anything wrong with a younger SD lol I’m just saying I look for older men so that’s my situation.",
                    "author": null,
                    "id": "gricosr",
                    "parent_id": "t1_gric6rg",
                    "score": 1,
                    "created_utc": 1616179193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean I don’t mind stroking someone’s ego a bit? But I agree, sometimes it’s just feels so awkward.\nI think my guy was just trying overcompensate though? He was short but very well endowed; it was huge. He was basically 36 but acting like he was 16. Lol",
            "author": "SilverStateNative",
            "id": "grk1e3o",
            "parent_id": "t1_grjzv4j",
            "score": 1,
            "created_utc": 1616211106.0,
            "replies": [
                {
                    "body": "Oh yeah, that's different. The 3rd person guy, according to himself anyway, had no problem getting people's attention. He sent more mirror selfies and myspace-quality pictures than anyone I've ever seen. The vanilla guy was just gross. Every text was explicit. He couldn't even say hi without sending something cringe-worthy. I'd stroke an ego though! :)",
                    "author": "CodiKo",
                    "id": "grk23e1",
                    "parent_id": "t1_grk1e3o",
                    "score": 1,
                    "created_utc": 1616211559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you, dealing with certain people can be exhausting. He wasn’t a bad guy? Just very horny/immature, most of the time. And what stereotype are you talking about?",
            "author": "SilverStateNative",
            "id": "grj3ay7",
            "parent_id": "t1_grj20eb",
            "score": 1,
            "created_utc": 1616191922.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "grja8pu",
                    "parent_id": "t1_grj3ay7",
                    "score": 1,
                    "created_utc": 1616195597.0,
                    "replies": [
                        {
                            "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
                            "author": "SilverStateNative",
                            "id": "grjccnj",
                            "parent_id": "t1_grja8pu",
                            "score": 1,
                            "created_utc": 1616196728.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "grjcyh2",
                                    "parent_id": "t1_grjccnj",
                                    "score": 1,
                                    "created_utc": 1616197062.0,
                                    "replies": [
                                        {
                                            "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                                            "author": "SilverStateNative",
                                            "id": "grjeraz",
                                            "parent_id": "t1_grjcyh2",
                                            "score": 1,
                                            "created_utc": 1616198054.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“But we have amazing chemistry! Like once in a lifetime kind of connection! How could you just give it up / walk away...!” \n\n🙄🙄\n\nProvide financial support. I’ll happily stay.",
            "author": "ExExpectations",
            "id": "grjrprj",
            "parent_id": "t1_gri5qve",
            "score": 0,
            "created_utc": 1616205246.0,
            "replies": []
        },
        {
            "body": "Obviously it’s not free but you don’t have to pay X amount every week or month.\n\nAnd you know the girl is most likely with you because she likes you,  not because of your money. \n\n\nWith sugaring when the money stops, the SB 9/10 will move on....\n\n(Soz for the caps)",
            "author": "Zealousideal_Map8100",
            "id": "grkvi1j",
            "parent_id": "t1_grkvao5",
            "score": 1,
            "created_utc": 1616239079.0,
            "replies": [
                {
                    "body": "You’re saying obviously it’s not free when in your previous post you say that I can vanilla date for free.\n\nAt some point time and convenience becomes more important than the money. That’s the reason I’m at Starbucks right now rather than making a flat white at home even though Starbucks costs money.\n\nThe cost of a sugar arrangement to me is negligible. I don’t value and honor money the same way you do. That mentality is difficult to understand if you’re not in the same financial situation.",
                    "author": "224quickmaths",
                    "id": "grkvty5",
                    "parent_id": "t1_grkvi1j",
                    "score": 1,
                    "created_utc": 1616239397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You aren’t using your wealth correctly.\n\nIf you have money, the women will come if you know how to.....",
            "author": "Zealousideal_Map8100",
            "id": "grimu9g",
            "parent_id": "t1_griltx3",
            "score": 1,
            "created_utc": 1616183881.0,
            "replies": [
                {
                    "body": "Lol ok. Im not saying its impossible to get these girls. I’m vanilla dating a 19 yo I met from hinge. I’m saying sugar makes it 10000 times easier.",
                    "author": "Fun_Focus8159",
                    "id": "grimxp4",
                    "parent_id": "t1_grimu9g",
                    "score": 1,
                    "created_utc": 1616183924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For reference: https://www.reddit.com/r/sugarlifestyleforum/comments/lpamf3/my_sd_is_broke/goag9lo/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nAnyway, if that’s the term of your arrangement that you two laid out, it’s reasonable. Most certainly that ex(?)SB was asking for a more expensive gym, like Equinox, that could put a little dent in a quasi-millionaire’s wallet. Not a much cheaper one like 24hr/LA/Planet Fitness/Crunch.",
            "author": null,
            "id": "grikx4y",
            "parent_id": "t1_griifnp",
            "score": 0,
            "created_utc": 1616183002.0,
            "replies": [
                {
                    "body": "Lol you mad?",
                    "author": "Fun_Focus8159",
                    "id": "gril2lx",
                    "parent_id": "t1_grikx4y",
                    "score": 2,
                    "created_utc": 1616183074.0,
                    "replies": [
                        {
                            "body": "🥱",
                            "author": null,
                            "id": "gritesw",
                            "parent_id": "t1_gril2lx",
                            "score": 0,
                            "created_utc": 1616186953.0,
                            "replies": [
                                {
                                    "body": "😘",
                                    "author": "Fun_Focus8159",
                                    "id": "griwx6r",
                                    "parent_id": "t1_gritesw",
                                    "score": 2,
                                    "created_utc": 1616188692.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s his money. Stop watching his pockets and worry about yourself and your own arrangements. Everybody gets to pick what they want and do not want to pay for.",
                    "author": "224quickmaths",
                    "id": "grj6p36",
                    "parent_id": "t1_grikx4y",
                    "score": 0,
                    "created_utc": 1616193695.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get that, black women and Asian men are statistically the least liked on Internet dating. So I feel your pain. \n\nBut I promise you. If you have wealth and money, the women will come....\n\nYeah you might have to be a bit arrogant and “Brag” about it, but the women will come!!!",
            "author": "Zealousideal_Map8100",
            "id": "grin7bz",
            "parent_id": "t1_grimrsi",
            "score": 1,
            "created_utc": 1616184039.0,
            "replies": [
                {
                    "body": "The type of money you need to vanilla date girls who are 7-10 on the looks scale,and are 18-25 without offering marriage or LTR far exceeds the money you need to sugar date. You can sugar date with a minimum half a million liquid(alot of SDshave less) and low to mid six figure salary(assuming no kids). In order to casually vanilla date gorgeous girls,you need to be making a million annually,and have about a minimum 5 million in the bank/liquid in most major cities. The majority of SDs young or old probably dont have that. You need to enough money where she can live the millionaire lifestyle,without having her having to work. Even if you are offering marriage or LTR,you still need to make probably closer to half a million a year\n\n&#x200B;\n\nGirls who are Instagram hott have alot of options from pretty people jobs that pay well(high end bar waitress/hostess/PR marketing gigs corporate assistant) plus they can date long terms guys who make low to just below six figures who are age-appropriate but will pay for all the extra curriculars like drinks dinner and partying. They would rather do a combination of these two things than hang out with a 30 plus with a couple of million in the bank.",
                    "author": "Secret_Diet7053",
                    "id": "grk4u1p",
                    "parent_id": "t1_grin7bz",
                    "score": 2,
                    "created_utc": 1616213388.0,
                    "replies": []
                },
                {
                    "body": "I was actually going to mention black women but didn't want to open up that can of worms!  \n\nI've been out of the bowl for a long while now. Still find my past life entertaining. have promising long term prospect vanilla relationdhips brewing right now. To be clear, I've never had any issue dating. But the change of society to online dating presented problems I didn't have in the past \n\nAlso may jump back in the bowl while I live in South Florida for a bit. Haven't decided yet.",
                    "author": null,
                    "id": "grinshw",
                    "parent_id": "t1_grin7bz",
                    "score": 0,
                    "created_utc": 1616184292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im.49.  Lols.  I look early to mid 30s.  Especially when I was a bit lighter.",
            "author": "wb19081908",
            "id": "grghqwx",
            "parent_id": "t1_grggkh0",
            "score": 1,
            "created_utc": 1616139222.0,
            "replies": [
                {
                    "body": "Hmm 🤔",
                    "author": "ExExpectations",
                    "id": "grjqiha",
                    "parent_id": "t1_grghqwx",
                    "score": 1,
                    "created_utc": 1616204571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There isn’t anything wrong with a younger SD lol I’m just saying I look for older men so that’s my situation.",
            "author": null,
            "id": "gricosr",
            "parent_id": "t1_gric6rg",
            "score": 1,
            "created_utc": 1616179193.0,
            "replies": []
        },
        {
            "body": "Oh yeah, that's different. The 3rd person guy, according to himself anyway, had no problem getting people's attention. He sent more mirror selfies and myspace-quality pictures than anyone I've ever seen. The vanilla guy was just gross. Every text was explicit. He couldn't even say hi without sending something cringe-worthy. I'd stroke an ego though! :)",
            "author": "CodiKo",
            "id": "grk23e1",
            "parent_id": "t1_grk1e3o",
            "score": 1,
            "created_utc": 1616211559.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grja8pu",
            "parent_id": "t1_grj3ay7",
            "score": 1,
            "created_utc": 1616195597.0,
            "replies": [
                {
                    "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
                    "author": "SilverStateNative",
                    "id": "grjccnj",
                    "parent_id": "t1_grja8pu",
                    "score": 1,
                    "created_utc": 1616196728.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "grjcyh2",
                            "parent_id": "t1_grjccnj",
                            "score": 1,
                            "created_utc": 1616197062.0,
                            "replies": [
                                {
                                    "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                                    "author": "SilverStateNative",
                                    "id": "grjeraz",
                                    "parent_id": "t1_grjcyh2",
                                    "score": 1,
                                    "created_utc": 1616198054.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re saying obviously it’s not free when in your previous post you say that I can vanilla date for free.\n\nAt some point time and convenience becomes more important than the money. That’s the reason I’m at Starbucks right now rather than making a flat white at home even though Starbucks costs money.\n\nThe cost of a sugar arrangement to me is negligible. I don’t value and honor money the same way you do. That mentality is difficult to understand if you’re not in the same financial situation.",
            "author": "224quickmaths",
            "id": "grkvty5",
            "parent_id": "t1_grkvi1j",
            "score": 1,
            "created_utc": 1616239397.0,
            "replies": []
        },
        {
            "body": "Lol ok. Im not saying its impossible to get these girls. I’m vanilla dating a 19 yo I met from hinge. I’m saying sugar makes it 10000 times easier.",
            "author": "Fun_Focus8159",
            "id": "grimxp4",
            "parent_id": "t1_grimu9g",
            "score": 1,
            "created_utc": 1616183924.0,
            "replies": []
        },
        {
            "body": "Lol you mad?",
            "author": "Fun_Focus8159",
            "id": "gril2lx",
            "parent_id": "t1_grikx4y",
            "score": 2,
            "created_utc": 1616183074.0,
            "replies": [
                {
                    "body": "🥱",
                    "author": null,
                    "id": "gritesw",
                    "parent_id": "t1_gril2lx",
                    "score": 0,
                    "created_utc": 1616186953.0,
                    "replies": [
                        {
                            "body": "😘",
                            "author": "Fun_Focus8159",
                            "id": "griwx6r",
                            "parent_id": "t1_gritesw",
                            "score": 2,
                            "created_utc": 1616188692.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s his money. Stop watching his pockets and worry about yourself and your own arrangements. Everybody gets to pick what they want and do not want to pay for.",
            "author": "224quickmaths",
            "id": "grj6p36",
            "parent_id": "t1_grikx4y",
            "score": 0,
            "created_utc": 1616193695.0,
            "replies": []
        },
        {
            "body": "The type of money you need to vanilla date girls who are 7-10 on the looks scale,and are 18-25 without offering marriage or LTR far exceeds the money you need to sugar date. You can sugar date with a minimum half a million liquid(alot of SDshave less) and low to mid six figure salary(assuming no kids). In order to casually vanilla date gorgeous girls,you need to be making a million annually,and have about a minimum 5 million in the bank/liquid in most major cities. The majority of SDs young or old probably dont have that. You need to enough money where she can live the millionaire lifestyle,without having her having to work. Even if you are offering marriage or LTR,you still need to make probably closer to half a million a year\n\n&#x200B;\n\nGirls who are Instagram hott have alot of options from pretty people jobs that pay well(high end bar waitress/hostess/PR marketing gigs corporate assistant) plus they can date long terms guys who make low to just below six figures who are age-appropriate but will pay for all the extra curriculars like drinks dinner and partying. They would rather do a combination of these two things than hang out with a 30 plus with a couple of million in the bank.",
            "author": "Secret_Diet7053",
            "id": "grk4u1p",
            "parent_id": "t1_grin7bz",
            "score": 2,
            "created_utc": 1616213388.0,
            "replies": []
        },
        {
            "body": "I was actually going to mention black women but didn't want to open up that can of worms!  \n\nI've been out of the bowl for a long while now. Still find my past life entertaining. have promising long term prospect vanilla relationdhips brewing right now. To be clear, I've never had any issue dating. But the change of society to online dating presented problems I didn't have in the past \n\nAlso may jump back in the bowl while I live in South Florida for a bit. Haven't decided yet.",
            "author": null,
            "id": "grinshw",
            "parent_id": "t1_grin7bz",
            "score": 0,
            "created_utc": 1616184292.0,
            "replies": []
        },
        {
            "body": "Hmm 🤔",
            "author": "ExExpectations",
            "id": "grjqiha",
            "parent_id": "t1_grghqwx",
            "score": 1,
            "created_utc": 1616204571.0,
            "replies": []
        },
        {
            "body": "I’m Cuban so it would be hard for me to stereotype, but I see your (skeptical) point. And that’s how I found out he was Jewish? He literally said “I’m Jewish, so I’m cheap. We’re not staying at that hotel, sorry.” \nI didn’t even know he Jewish, till he brought it up to me a few months into our arrangement.",
            "author": "SilverStateNative",
            "id": "grjccnj",
            "parent_id": "t1_grja8pu",
            "score": 1,
            "created_utc": 1616196728.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "grjcyh2",
                    "parent_id": "t1_grjccnj",
                    "score": 1,
                    "created_utc": 1616197062.0,
                    "replies": [
                        {
                            "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                            "author": "SilverStateNative",
                            "id": "grjeraz",
                            "parent_id": "t1_grjcyh2",
                            "score": 1,
                            "created_utc": 1616198054.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🥱",
            "author": null,
            "id": "gritesw",
            "parent_id": "t1_gril2lx",
            "score": 0,
            "created_utc": 1616186953.0,
            "replies": [
                {
                    "body": "😘",
                    "author": "Fun_Focus8159",
                    "id": "griwx6r",
                    "parent_id": "t1_gritesw",
                    "score": 2,
                    "created_utc": 1616188692.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grjcyh2",
            "parent_id": "t1_grjccnj",
            "score": 1,
            "created_utc": 1616197062.0,
            "replies": [
                {
                    "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
                    "author": "SilverStateNative",
                    "id": "grjeraz",
                    "parent_id": "t1_grjcyh2",
                    "score": 1,
                    "created_utc": 1616198054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😘",
            "author": "Fun_Focus8159",
            "id": "griwx6r",
            "parent_id": "t1_gritesw",
            "score": 2,
            "created_utc": 1616188692.0,
            "replies": []
        },
        {
            "body": "What about being intelligent? \nHe was super smart too; he knew English, German, Hebrew & Spanish. Sometimes we’d speak in Spanish just for fun. Tu hablas Espanol? Ojala tu tienes suerte con tu cinismo porque nadie esta pa eso. Tu suena frustado y pasmao, con tremendo complejo. Wish you all the best though, from Las Vegas, NV🎰🏜",
            "author": "SilverStateNative",
            "id": "grjeraz",
            "parent_id": "t1_grjcyh2",
            "score": 1,
            "created_utc": 1616198054.0,
            "replies": []
        }
    ]
}