{
    "title": "SB's, Don't Give Up",
    "post_id": "hx1icl",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hx1icl/sbs_dont_give_up/",
    "author": "AFSMSgt",
    "body": "I another thread, I told a POT SB complaining about the lack of quality SD's \"There are many supportive, caring, mentoring, appreciative, and generous SD's out there. We are just not easy to spot. Look for the ones a little older. Us granddaddies can be great sugar daddies.\"\n\nThe comment got me thinking about my interaction with my SB's over the last 15 or so years. After my own children and grandchildren, my sugar babies are the best thing to ever happen to me. They have brought such joy into my life. Made my senior years the best of my life.\n\nI love seeing the world through their eyes. Their excitement at the things that are old hat to me. You ladies have made me appreciate my world and my life in ways I could not have imagined. So ladies, don't give up. Know that us SD's need you at least as much as you need us. Keep looking. We are out there.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hx1icl/sbs_dont_give_up/",
    "score": 323,
    "upvote_ratio": 0.99,
    "created_utc": 1595596233.0,
    "num_comments": 137,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "We appreciate the SDs like you 🖤",
            "author": null,
            "id": "fz3dmr1",
            "parent_id": "t3_hx1icl",
            "score": 40,
            "created_utc": 1595601010.0,
            "replies": []
        },
        {
            "body": "Sis, let me know how that goes. Almost all of the SD’s that hit me up are on the “I don’t want this to be transactional” or they will hit me up and start dirty talking and call me a money crazed b*tch when I politely express that I’m not comfortable talking about those things unless we have some form of arrangement or understanding laid out. They say that they don’t want PPM’s but then say that they can’t “trust me enough” yet to give an allowance -__-. And then they say I am also not the “ideal” SB, and tell me that I’m not worthy enough to be an SB because I’m AA :/... so yeah, these SD’s have all been wack and I hope our hard work pays off.",
            "author": null,
            "id": "fz45mo3",
            "parent_id": "t3_hx1icl",
            "score": 37,
            "created_utc": 1595614434.0,
            "replies": [
                {
                    "body": "I agree with you totally. All they want to do is use SBs. Not sure why they are registered on a sugar dating site yet disagree with everything associated with sugar dating. They are time wasters with zero to offer in benefits. I've interacted with many idiots. Also they have no photo yet quick to want to see our private images and disappear when you challenge them. I believe lots of them are time wasters enjoying paying a membership fee to pass time. I can think of better things to do!",
                    "author": "Starflower8888",
                    "id": "fz664v5",
                    "parent_id": "t1_fz45mo3",
                    "score": 8,
                    "created_utc": 1595655221.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fz6omyd",
                            "parent_id": "t1_fz664v5",
                            "score": 1,
                            "created_utc": 1595673336.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz4d4a9",
                    "parent_id": "t1_fz45mo3",
                    "score": 12,
                    "created_utc": 1595617972.0,
                    "replies": [
                        {
                            "body": "I feel the same :-(",
                            "author": "Starflower8888",
                            "id": "fz668w2",
                            "parent_id": "t1_fz4d4a9",
                            "score": 2,
                            "created_utc": 1595655313.0,
                            "replies": []
                        },
                        {
                            "body": "To be fair, the girls on SA are just bad. \n\nVery few who are actually serious about an arrangement . Lots of timewasters who just want attention / ego boost \n\nTrash begets trash lol.",
                            "author": "Xivious47",
                            "id": "fz6o1h0",
                            "parent_id": "t1_fz4d4a9",
                            "score": 0,
                            "created_utc": 1595672727.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Amen!",
                    "author": null,
                    "id": "fz5967r",
                    "parent_id": "t1_fz45mo3",
                    "score": 2,
                    "created_utc": 1595634349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz5h0u2",
            "parent_id": "t3_hx1icl",
            "score": 9,
            "created_utc": 1595638851.0,
            "replies": [
                {
                    "body": "I call the scammers turds right off the bat and they block me themselves 😂",
                    "author": "zummazu",
                    "id": "fz6hawo",
                    "parent_id": "t1_fz5h0u2",
                    "score": 3,
                    "created_utc": 1595665681.0,
                    "replies": [
                        {
                            "body": "This is what I send when a rude SD requests sight of my private images without a message. I block then they block me. So hilarious 😂🤣\n\n\"Yet again another ugly, ignorant, idiot who cannot read who thinks instantly requesting images is acceptable. In the bin you go and where you know you belong. I want to vomit looking at your face\" 🤢🤮",
                            "author": "Starflower8888",
                            "id": "fza6ess",
                            "parent_id": "t1_fz6hawo",
                            "score": 3,
                            "created_utc": 1595749012.0,
                            "replies": [
                                {
                                    "body": "Gonna copy that hahahaha🤣",
                                    "author": "makafakafo",
                                    "id": "g1mm04z",
                                    "parent_id": "t1_fza6ess",
                                    "score": 2,
                                    "created_utc": 1597514645.0,
                                    "replies": [
                                        {
                                            "body": "Haha I don't blame you it's too funny 😅",
                                            "author": "Starflower8888",
                                            "id": "g1o0uqf",
                                            "parent_id": "t1_g1mm04z",
                                            "score": 1,
                                            "created_utc": 1597530826.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's right, unfortunately there are very many SD's that are a POS that kind of wrecks the whole SR thing.",
            "author": "thefigishere",
            "id": "fz3685y",
            "parent_id": "t3_hx1icl",
            "score": 25,
            "created_utc": 1595596865.0,
            "replies": [
                {
                    "body": "What does POS mean? This site is very new to me and sometimes I don't understand the jargon :-)",
                    "author": "Starflower8888",
                    "id": "fz66c51",
                    "parent_id": "t1_fz3685y",
                    "score": 1,
                    "created_utc": 1595655388.0,
                    "replies": [
                        {
                            "body": "Piece of shit",
                            "author": "RebelInDisguise01",
                            "id": "fz6e59q",
                            "parent_id": "t1_fz66c51",
                            "score": 1,
                            "created_utc": 1595662478.0,
                            "replies": [
                                {
                                    "body": "Haha oh gosh I didn't realise. Thanks for that",
                                    "author": "Starflower8888",
                                    "id": "fz6jczl",
                                    "parent_id": "t1_fz6e59q",
                                    "score": 1,
                                    "created_utc": 1595667792.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Probably a minimum of 3 times as many scammer, druggie, fake, and rinser SB",
                    "author": null,
                    "id": "fz3zzit",
                    "parent_id": "t1_fz3685y",
                    "score": -4,
                    "created_utc": 1595611811.0,
                    "replies": [
                        {
                            "body": "Yup, out of 100 or so SB messages, maybe 3 are true SBs.",
                            "author": "unlovablemonster2",
                            "id": "fz4zk2h",
                            "parent_id": "t1_fz3zzit",
                            "score": 0,
                            "created_utc": 1595629104.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve been needing to read this. I haven’t been able to find a legit SD, on SA or SB. Like where are they???",
            "author": null,
            "id": "fz3u7q5",
            "parent_id": "t3_hx1icl",
            "score": 9,
            "created_utc": 1595609126.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz44ikl",
                    "parent_id": "t1_fz3u7q5",
                    "score": 6,
                    "created_utc": 1595613914.0,
                    "replies": [
                        {
                            "body": "If you are not catching the fish you are after the wise person changes the lure.......   Perhaps rewrite your profile to be more attractive to the SD you want and include pix that match and are carefully inspected.",
                            "author": "pinotandsugar",
                            "id": "fz4rb5f",
                            "parent_id": "t1_fz44ikl",
                            "score": 4,
                            "created_utc": 1595624843.0,
                            "replies": [
                                {
                                    "body": "Have you considered that genuine SDs are simply not to be found on these websites anymore? SA is nothing like it used to be. After sifting through 60+ messages, I have scheduled exactly one date with a POT.\n\nDoesn't sound like she's suffering from a lack of interest. There aren't many fish in the sea, simply put. Instead it's a cesspool of men seeking free sex or sex in exchange for \"mentorship\" when they're barely thirty years old.",
                                    "author": "lara-xo",
                                    "id": "fz561gl",
                                    "parent_id": "t1_fz4rb5f",
                                    "score": 9,
                                    "created_utc": 1595632614.0,
                                    "replies": [
                                        {
                                            "body": "Go back to the original poster.    Why do you even look at 30 year olds.   \n\nYes there are a lot of time waters - sb’s and sd’s.   But I found two great sb’s recently.    One doesn’t want money (but lots of gifts and holidays).   The other more about the money as she’s saving for a masters.   Both get lots of sugar.    So there are people out there.   Persevere and be focused on what you are looking for.",
                                            "author": "brit-sd",
                                            "id": "fz6ahm1",
                                            "parent_id": "t1_fz561gl",
                                            "score": 2,
                                            "created_utc": 1595658970.0,
                                            "replies": [
                                                {
                                                    "body": "I'm not. They're messaging me... I think until you're wading through 25 messages a day, you can't quite comprehend. Some of you have never been a beautiful women before, and it really shows. (Joke.)",
                                                    "author": "lara-xo",
                                                    "id": "fz9rd6s",
                                                    "parent_id": "t1_fz6ahm1",
                                                    "score": 2,
                                                    "created_utc": 1595736523.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "What is POT?",
                                            "author": "Starflower8888",
                                            "id": "fz6v0tk",
                                            "parent_id": "t1_fz561gl",
                                            "score": 1,
                                            "created_utc": 1595679428.0,
                                            "replies": [
                                                {
                                                    "body": "Potential sugarbaby or daddy.",
                                                    "author": "lara-xo",
                                                    "id": "fz9rk33",
                                                    "parent_id": "t1_fz6v0tk",
                                                    "score": 1,
                                                    "created_utc": 1595736658.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you",
                                                            "author": "Starflower8888",
                                                            "id": "fza5j6q",
                                                            "parent_id": "t1_fz9rk33",
                                                            "score": 1,
                                                            "created_utc": 1595748155.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Ding ding ding. Hit the nail on the head.\nAnd its pretty damn demoralizing:(",
                                            "author": "clair-cummings",
                                            "id": "g2sh49s",
                                            "parent_id": "t1_fz561gl",
                                            "score": 1,
                                            "created_utc": 1598356142.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This is funny lol. I would love a regular guy, as in not connected to SA, to treat me as a SB. Too many men with their hands in their pockets and not being generous. I met a guy who is far away from an SD you can get although he wrote in his profile he likes to make a woman feel happy, wanted, special and that he's generous. Unfortunately I have not seen any evidence of such benefits. I pay for my own things and he only drives me to locations I'm unable to get to. Not very good at all. I do have my options open so if I do meet somone else it will be by by to this man who is more interested in his pet cat than in me :-(",
                            "author": "Starflower8888",
                            "id": "fz61jcq",
                            "parent_id": "t1_fz44ikl",
                            "score": 2,
                            "created_utc": 1595651724.0,
                            "replies": [
                                {
                                    "body": "Girl don't even bother w men like that. Like the movie title says \"I can do bad all by myself\".\n\nMy mantra in dating is that if a man isn't making my life better/less stressful, then why is he in it?? A man like that will just lower your energy and make it that much harder/more challenging to make room for the right one.\n\nI'd rather be single than settle for a dead weight.",
                                    "author": "clair-cummings",
                                    "id": "g2shg0a",
                                    "parent_id": "t1_fz61jcq",
                                    "score": 1,
                                    "created_utc": 1598356406.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "it hasn't been so easy for real SD's either tbh  \nbut hang in there",
                            "author": "mtriad",
                            "id": "fz5w3i1",
                            "parent_id": "t1_fz44ikl",
                            "score": 0,
                            "created_utc": 1595648006.0,
                            "replies": [
                                {
                                    "body": "What issues have you suffered as an SD? My profile online stands out in terms of intellect and I've been complimented upon such many times but when it boils down to it SDs tend to go for woman as young as their own daughters or woman with zero conversation skills. There's only one thing they are interested in yet use mentoring as a disguise. It's very frustrating. I've noticed SA seem to be having much younger members with rather inflated financial stats. It's comical but off-putting. The site has gone downhill over the years",
                                    "author": "Starflower8888",
                                    "id": "fz65nmk",
                                    "parent_id": "t1_fz5w3i1",
                                    "score": 3,
                                    "created_utc": 1595654831.0,
                                    "replies": [
                                        {
                                            "body": "not sure why I got a downvote for that but real authentic SD's have a lot to lose when there are so many fake SD's. and yes there are a lot of fake profiles of \"hot students\" trying to scam us.\n\nBTW I'm a younger member, not all of us are like that, I have had a couple of very successful mutually beneficial relationships :)",
                                            "author": "mtriad",
                                            "id": "fz6a144",
                                            "parent_id": "t1_fz65nmk",
                                            "score": 1,
                                            "created_utc": 1595658562.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fz6pfef",
                                            "parent_id": "t1_fz65nmk",
                                            "score": -1,
                                            "created_utc": 1595674141.0,
                                            "replies": [
                                                {
                                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                                    "author": "AutoModerator",
                                                    "id": "fz6pffd",
                                                    "parent_id": "t1_fz6pfef",
                                                    "score": 1,
                                                    "created_utc": 1595674141.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "If you change the number in reference to PPM in your first bullet, to something like $XXX, and reply to this message, I can come back and approve this",
                                                    "author": "Azurecole",
                                                    "id": "fz6q23s",
                                                    "parent_id": "t1_fz6pfef",
                                                    "score": 0,
                                                    "created_utc": 1595674783.0,
                                                    "replies": [
                                                        {
                                                            "body": "Done.",
                                                            "author": "Xivious47",
                                                            "id": "fz70dnr",
                                                            "parent_id": "t1_fz6q23s",
                                                            "score": 1,
                                                            "created_utc": 1595683651.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My SD is 71. We met four years ago and grew super super tight. He looks and acts 30 years younger and I think he's mega hot! I do love him with all my heart, we always have such an amazing time together.",
            "author": null,
            "id": "fz59iys",
            "parent_id": "t3_hx1icl",
            "score": 6,
            "created_utc": 1595634547.0,
            "replies": [
                {
                    "body": "As long as he's looking after you age shouldn't matter, good on you girl 😎",
                    "author": "Starflower8888",
                    "id": "fza6l9l",
                    "parent_id": "t1_fz59iys",
                    "score": 2,
                    "created_utc": 1595749189.0,
                    "replies": []
                },
                {
                    "body": "👍",
                    "author": "AFSMSgt",
                    "id": "fz5n3gp",
                    "parent_id": "t1_fz59iys",
                    "score": 2,
                    "created_utc": 1595642406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What about SD's?   My last 3 meet and greets (and I do compensate the girl) have been 2 no shows and a girl who took her pictures probably a year and -30 pounds ago.  Almost all of the women are asking for cashapp or venmo deposits before even committing to a meet and greet.  The few that genuinely seem interested just seem to drop off responding.  Now granted, I am in my 60's so that does immediately turn off half the women who want someone from their generation, but it bothers me that I can't even get a decent meet and greet setup.",
            "author": "SanJoseBob",
            "id": "fz4dx20",
            "parent_id": "t3_hx1icl",
            "score": 4,
            "created_utc": 1595618342.0,
            "replies": [
                {
                    "body": "You should video call before meeting up or else you’ll end up with a catfish. The “SBs” who ask for $$ upfront before even meeting should get reported ASAP.",
                    "author": "unlovablemonster2",
                    "id": "fz50zgk",
                    "parent_id": "t1_fz4dx20",
                    "score": 3,
                    "created_utc": 1595629869.0,
                    "replies": []
                },
                {
                    "body": "The SDs are just as bad. I've been on SA 3 weeks.  I've met \n\n1 John \n\n1 whose pictures were 50 lbs and 15 years ago, \n\n1 who, because  I said I didn't want transactional thought that meant I didn't want anything and in the end wanted a 3sum with his wife that he was supposedly in the middle of a divorce from.  \n\n1 decided (day of) that, because I can't host (which he knew when we set up the m&g and the delay was because of his schedule) we weren't a match. \n\n1 who waited until the scheduled time was past to tell me he had went out of town for work and then ghosted.  \nAnd those are just the ones that got to the m&g stage.  I could write a novella about the conversations that I didn't agree to meet with.",
                    "author": "tamenwild",
                    "id": "fz4gxmx",
                    "parent_id": "t1_fz4dx20",
                    "score": 5,
                    "created_utc": 1595619774.0,
                    "replies": []
                },
                {
                    "body": "lots of women are like that which makes it hard for the genuine ones to have a chance , super frustrating , I hate the ghosting side of things .... or the not showing up , it’s seems like with both men and women on SA they think they have a right to be rude , no one obligated anyone to do anything but being honest or telling someone you’re not interested is just decency",
                    "author": "Comfortable_Cupcake9",
                    "id": "fzetrek",
                    "parent_id": "t1_fz4dx20",
                    "score": 1,
                    "created_utc": 1595863312.0,
                    "replies": []
                },
                {
                    "body": "I have had remarkably similar experiences recently. I never attributed it to my age, but perhaps.......",
                    "author": "AFSMSgt",
                    "id": "fz4n9g1",
                    "parent_id": "t1_fz4dx20",
                    "score": 1,
                    "created_utc": 1595622843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💯 agree.  My sugar babies bring joy and fun to my senior years. Just turned 59 and expect to sugar well into my 60’s.  Tucson Az based - now looking for my next bright eyed adventurous and wonderful SB.",
            "author": "jloaz",
            "id": "fz46x8i",
            "parent_id": "t3_hx1icl",
            "score": 4,
            "created_utc": 1595615038.0,
            "replies": [
                {
                    "body": "Well beyond. I didnt start until I was 59 and I am almost 74 and see no end.",
                    "author": "AFSMSgt",
                    "id": "fz4mxk2",
                    "parent_id": "t1_fz46x8i",
                    "score": 7,
                    "created_utc": 1595622683.0,
                    "replies": []
                },
                {
                    "body": "Also AZ based here. It’s quite a lot of work to wade through scammers and individuals with no real want for depth. 🤷🏻‍♀️",
                    "author": "girlatbar",
                    "id": "fz7nn6c",
                    "parent_id": "t1_fz46x8i",
                    "score": 1,
                    "created_utc": 1595697420.0,
                    "replies": [
                        {
                            "body": "Yes things are all over the map these days. Ironically I have had 3 back to back sugar relationships over the past 5 yrs with each lasting more than a year.  The most recent being 2.5 years.  Seemed easy to connect with a quality sugar babe.  \n\nUnfortunately I have Been struggling a bit  to lock down with a 4th long term sugar relationship .   So many rinsers and escorts on SA these days.   \n\nI’m Being patient and wading thru the muck.  Im partial to fit to moderately curvy brunettes and Latinas which may be limiting my chances.  \n\nBeen considering opening it up a bit.",
                            "author": "jloaz",
                            "id": "fza23rz",
                            "parent_id": "t1_fz7nn6c",
                            "score": 2,
                            "created_utc": 1595744962.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think I have to give a chance guys after 55 then. One gentleman ( I hope) texted me for the second time.  I am gonna cha twith him to find out what person he is",
                    "author": "makafakafo",
                    "id": "g1mnw0m",
                    "parent_id": "t1_fz46x8i",
                    "score": 1,
                    "created_utc": 1597515174.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so discouraged after my first attempt and first scam. 🤦🏻‍♀️",
            "author": "scorchedsaoirse",
            "id": "fz4c62v",
            "parent_id": "t3_hx1icl",
            "score": 3,
            "created_utc": 1595617524.0,
            "replies": []
        },
        {
            "body": "I have been very fortunate. I find that most of my SR’s end because we live too far away from each other (same city just different parts of the city) and it just adds difficulty In scheduling",
            "author": "Wallytrollman95",
            "id": "fz5gfq3",
            "parent_id": "t3_hx1icl",
            "score": 3,
            "created_utc": 1595638518.0,
            "replies": []
        },
        {
            "body": "The men who are in the comments suggesting that women revise their profile: Please stop mansplaining. The dearth of POTs has everything to do with the influx of bored, quarantined men in their twenties and early thirties who are now using SA as they would Tinder. \n\nThe number men that want to take advantage of young, beautiful women will always outnumber the men who care genuinely about the quality of connection. We live in a society that devalues women apart from their sex appeal, and that is exactly what you see reflected on SA.",
            "author": "lara-xo",
            "id": "fz57q1m",
            "parent_id": "t3_hx1icl",
            "score": 7,
            "created_utc": 1595633541.0,
            "replies": [
                {
                    "body": "This exactly",
                    "author": "AFSMSgt",
                    "id": "fz5myd0",
                    "parent_id": "t1_fz57q1m",
                    "score": 2,
                    "created_utc": 1595642322.0,
                    "replies": []
                },
                {
                    "body": "Hmm.  So filter over 40.   Let those of us with the money and time be more visible.    If you are reading profiles of 30 year olds then I think that’s part of the problem.",
                    "author": "brit-sd",
                    "id": "fz6az5g",
                    "parent_id": "t1_fz57q1m",
                    "score": 1,
                    "created_utc": 1595659418.0,
                    "replies": [
                        {
                            "body": "I'm not. They're messaging ME.",
                            "author": "lara-xo",
                            "id": "fz9r8s9",
                            "parent_id": "t1_fz6az5g",
                            "score": 2,
                            "created_utc": 1595736436.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve been looking for a SD forever. The only ones I get are the ones on Instagram looking for a scam. I’m an empath with a good heart and I just want to be there for someone is that too much for someone to ask",
            "author": "Lovelymelanin",
            "id": "fz4l2ki",
            "parent_id": "t3_hx1icl",
            "score": 4,
            "created_utc": 1595621781.0,
            "replies": [
                {
                    "body": "No. Of course not. I want the same. I live alone, have for years. But I am never so lonely as when there is no one who needs me.",
                    "author": "AFSMSgt",
                    "id": "fz4pbij",
                    "parent_id": "t1_fz4l2ki",
                    "score": 4,
                    "created_utc": 1595623858.0,
                    "replies": []
                },
                {
                    "body": "Are you sure it's an SD you are seeking? May be a regular site may help as many SDs do not have good hearts. I've come across so many who are rude, cold and heartless and they think their money gives them the right to behave badly",
                    "author": "Starflower8888",
                    "id": "fz66khd",
                    "parent_id": "t1_fz4l2ki",
                    "score": 2,
                    "created_utc": 1595655579.0,
                    "replies": [
                        {
                            "body": "My goodness girl. I’m so sorry you haven’t met good hearted SDs. They are out there I assure you!",
                            "author": "Layla_Fox2",
                            "id": "fz6mc6x",
                            "parent_id": "t1_fz66khd",
                            "score": 1,
                            "created_utc": 1595670928.0,
                            "replies": [
                                {
                                    "body": "I've had 2 SDs who were great. I used to travel to see one in Europe, he was British like me and we skyped for many months before we met. I met him in London. My second lived in the next town from me. I've had great times with those guys but not been close to anything like that in years. Most SDs on SA now want is sex as that's what they ask or to live out fantasies. They think it's better hooking up on SA as escort sites are cold and expensive!",
                                    "author": "Starflower8888",
                                    "id": "fza6x4m",
                                    "parent_id": "t1_fz6mc6x",
                                    "score": 1,
                                    "created_utc": 1595749511.0,
                                    "replies": [
                                        {
                                            "body": "That might be why I have not encountered the problem so many of you seem to. I’ve never used SA.",
                                            "author": "Layla_Fox2",
                                            "id": "fzajuhb",
                                            "parent_id": "t1_fza6x4m",
                                            "score": 1,
                                            "created_utc": 1595763006.0,
                                            "replies": [
                                                {
                                                    "body": "What do you use?",
                                                    "author": "Starflower8888",
                                                    "id": "fzcfh08",
                                                    "parent_id": "t1_fzajuhb",
                                                    "score": 1,
                                                    "created_utc": 1595801598.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
                                                            "author": "Layla_Fox2",
                                                            "id": "fzcjqkh",
                                                            "parent_id": "t1_fzcfh08",
                                                            "score": 2,
                                                            "created_utc": 1595803970.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you for that much appreciated",
                                                                    "author": "Starflower8888",
                                                                    "id": "fzdn7dn",
                                                                    "parent_id": "t1_fzcjqkh",
                                                                    "score": 2,
                                                                    "created_utc": 1595829690.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                                                                    "author": "Starflower8888",
                                                                    "id": "fzdnh75",
                                                                    "parent_id": "t1_fzcjqkh",
                                                                    "score": 2,
                                                                    "created_utc": 1595829924.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                                                                            "author": "Layla_Fox2",
                                                                            "id": "fze6mth",
                                                                            "parent_id": "t1_fzdnh75",
                                                                            "score": 2,
                                                                            "created_utc": 1595848833.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Thank you for this information much appreciated 😊",
                                                                                    "author": "Starflower8888",
                                                                                    "id": "fzhnfhi",
                                                                                    "parent_id": "t1_fze6mth",
                                                                                    "score": 2,
                                                                                    "created_utc": 1595919481.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Try a rewrite of your profile.",
                    "author": "pinotandsugar",
                    "id": "fz4rsj3",
                    "parent_id": "t1_fz4l2ki",
                    "score": 1,
                    "created_utc": 1595625082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz3ltzt",
            "parent_id": "t3_hx1icl",
            "score": 9,
            "created_utc": 1595605145.0,
            "replies": [
                {
                    "body": "A full day of activities for a fist meet ? That’s a hard pass",
                    "author": "Driftwould92",
                    "id": "fz3rqu8",
                    "parent_id": "t1_fz3ltzt",
                    "score": 14,
                    "created_utc": 1595607961.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz4752s",
                            "parent_id": "t1_fz3rqu8",
                            "score": 2,
                            "created_utc": 1595615141.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz51ks6",
                                    "parent_id": "t1_fz4752s",
                                    "score": 14,
                                    "created_utc": 1595630187.0,
                                    "replies": [
                                        {
                                            "body": "I would never agree to a day with no sugar. Hell No",
                                            "author": "Starflower8888",
                                            "id": "fza72f9",
                                            "parent_id": "t1_fz51ks6",
                                            "score": 2,
                                            "created_utc": 1595749656.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Speakkk🗣 because oh no",
                                            "author": null,
                                            "id": "fz6hh0b",
                                            "parent_id": "t1_fz51ks6",
                                            "score": 1,
                                            "created_utc": 1595665855.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz51vs3",
                                            "parent_id": "t1_fz51ks6",
                                            "score": -2,
                                            "created_utc": 1595630348.0,
                                            "replies": [
                                                {
                                                    "body": "Lol. But you should seriously reconsider asking a woman to give up her whole day to walk away w nothing. That's pretty terrible. She could spend that time working or maybe she's a student and could have spent it studying. A whole day is really asking too much if you are giving nothing.",
                                                    "author": "clair-cummings",
                                                    "id": "g2sibbp",
                                                    "parent_id": "t1_fz51vs3",
                                                    "score": 2,
                                                    "created_utc": 1598357086.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "g2sjva6",
                                                            "parent_id": "t1_g2sibbp",
                                                            "score": 1,
                                                            "created_utc": 1598358256.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                                                                    "author": "clair-cummings",
                                                                    "id": "g2skp73",
                                                                    "parent_id": "t1_g2sjva6",
                                                                    "score": 1,
                                                                    "created_utc": 1598358852.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz45okd",
                    "parent_id": "t1_fz3ltzt",
                    "score": 12,
                    "created_utc": 1595614459.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz46vdm",
                            "parent_id": "t1_fz45okd",
                            "score": 1,
                            "created_utc": 1595615013.0,
                            "replies": [
                                {
                                    "body": "I think this is great! I feel like SB putting down a long fun day are just looking for money and not interested in enjoying your company.",
                                    "author": "Miss-Chinaski",
                                    "id": "fz4f3v4",
                                    "parent_id": "t1_fz46vdm",
                                    "score": 0,
                                    "created_utc": 1595618888.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "authentic perspective, thank you much",
            "author": "sweetheatnicefeet",
            "id": "fz3gh73",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595602469.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz3npyq",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595606052.0,
            "replies": [
                {
                    "body": "The reason it doesn't is because of all the bullshit people that clutter it all up.",
                    "author": "Jdn345",
                    "id": "fz3ow8v",
                    "parent_id": "t1_fz3npyq",
                    "score": 4,
                    "created_utc": 1595606610.0,
                    "replies": [
                        {
                            "body": "Yep. Frustrating",
                            "author": null,
                            "id": "fz3tndc",
                            "parent_id": "t1_fz3ow8v",
                            "score": 3,
                            "created_utc": 1595608863.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve definitely had a hard time finding a SD, I know they are around but finding someone who is consistent, understanding and trustworthy is a bust😩I’ve ran into some creeps but being that I’m still a newbie as a SB I’ve been approached by absolute clowns and I know my worth( not $$$ wise) in general and they try and take a newbie for a fool, so where on my side of the world can I find a SD?",
            "author": "KandiRenee",
            "id": "fz3u0jb",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595609033.0,
            "replies": []
        },
        {
            "body": "I’m looking for a sugar daddy but haven’t had any kind of luck (yet!) but I still have high hopes about it",
            "author": "thatcoralgirl",
            "id": "fz5hykc",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595639400.0,
            "replies": []
        },
        {
            "body": "I see so many negative comments here and while I am aware that my situation was likely pure luck, I do think that there are some things you can do to better your chances in the bowl. \nThis is my first official SR. My last SR was platonic (again, pure luck). I’m nearly 30, POC, indicated “curvy” on my profile and have private photos which were simply full face photos. I prefer discretion. With that being said, I found a legit SD that I am attracted to, had a m&g, and had a successful first date within 3weeks. Again, I KNOW THIS IS NOT THE NORM in the bowl. My point in stating this is to remind SBs to stay positive and don’t be discouraged. I see so many of you counting yourself out because you don’t fit the 20 year old skinny Barbie looking girl and you shouldn’t. Sometimes we are our own biggest enemy. \nFor every quality that you think is putting you at a disadvantage, there is someone that is into it. Confidence is key. Know what you want and be able to verbalize it. Create a profile that truly reflects YOU. Being genuine, confident and firm in your requirements will weed out a lot of scammers. I know that it’s easier said than done but defining your wants and needs and standing firm in that will take you far. Good luck to all you beautiful ladies!",
            "author": "832htxSB",
            "id": "fz9ys2p",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595742109.0,
            "replies": [
                {
                    "body": "Omg! When i read your comment i felt again with hope! Thanks so much, you're true we need to be patients. i just started looking for a SD, but I'm newbie, in fact when someone texted me i really didn't know what to say, i was wondering how do i have to do this??? and i started to be like i was but..  It doesn't works, they were kind of aggressive. So i stop using SA. 😞",
                    "author": "Rabiaamore",
                    "id": "g2j9caj",
                    "parent_id": "t1_fz9ys2p",
                    "score": 1,
                    "created_utc": 1598141743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am turning 40 and have been enjoying the sugar lifestyle for years,  very loving caring generous person for sure and I can say the same about some of the SBs that I've been with.",
            "author": "jundoima",
            "id": "fz4e2ex",
            "parent_id": "t3_hx1icl",
            "score": 3,
            "created_utc": 1595618411.0,
            "replies": [
                {
                    "body": "Awww so glad you’ve had so many happy years .",
                    "author": "lynnislove",
                    "id": "fz64lhy",
                    "parent_id": "t1_fz4e2ex",
                    "score": 2,
                    "created_utc": 1595653996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz55hp9",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595632316.0,
            "replies": [
                {
                    "body": "I recently went on a date with a man in his late 60s, and he refused to give an allowance. It was also the worst, least respectful date I’ve ever been on in my life. He lied about his age, was rude to waiters and threw money at them, kissed me on the mouth as a greeting(predatory as fuck), and then followed me back to my apartment and had the most invasive and uncomfortable sexual experience of my entire life. Some lessons in life are learned the hard way, this one made me want to give up on trying all together.",
                    "author": "ImAGoonYoureAGoon",
                    "id": "fz6fc2x",
                    "parent_id": "t1_fz55hp9",
                    "score": 1,
                    "created_utc": 1595663685.0,
                    "replies": [
                        {
                            "body": "Why on earth did you sleep with him? I don't get it? That guy sounds like a classic bastard ans treating people like shit. Th e fact he behaved like an asshole on your first meet should have been a huge red flag. If he refused an allowance you should have ended the date. Oh dear :-(",
                            "author": "Starflower8888",
                            "id": "fza7x02",
                            "parent_id": "t1_fz6fc2x",
                            "score": 2,
                            "created_utc": 1595750511.0,
                            "replies": [
                                {
                                    "body": "Thats a horrible story and I don't understand why she would sleep w him either.",
                                    "author": "clair-cummings",
                                    "id": "g2sinxp",
                                    "parent_id": "t1_fza7x02",
                                    "score": 1,
                                    "created_utc": 1598357358.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree with you there. The older ones cut so many corners and avoid the subject of allowance like the plague!",
                    "author": "Starflower8888",
                    "id": "fza7qsl",
                    "parent_id": "t1_fz55hp9",
                    "score": 1,
                    "created_utc": 1595750334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For SBs who don't seem to be able to meet good men, take a long look at the men you're meeting and the men you're rejecting.  Maybe you're rejecting the wrong men.",
            "author": "hal99514",
            "id": "fz38ay4",
            "parent_id": "t3_hx1icl",
            "score": 3,
            "created_utc": 1595598106.0,
            "replies": [
                {
                    "body": "I don’t think they are rejecting real ones. That’s the problem. Too many fake and fraudulent ones on SA since the shelter in place. All they want is to pump and dump. It’s a disgusting game to those kind of men. They want pictures and they string the young ladies along with lies and BS! I wish that there was a way to vet these con men out. They are very dangerous to naive SB’s and eventually women will walk away from the bowl completely after interacting with sexual deviant predators!",
                    "author": "RebelInDisguise01",
                    "id": "fz3adov",
                    "parent_id": "t1_fz38ay4",
                    "score": 22,
                    "created_utc": 1595599278.0,
                    "replies": [
                        {
                            "body": "Some suggestions\n\nNo private pix in profile -   that cuts out the 22 yo  guys living in mom's basement with freshly laundered towels at the ready. \n\nPut more quality into your profile \n\nMiddle of the day or early evening M&G  with NO further expectations for the night \n\nBenjamins before Buttons   (especially in the initial intimacy) \n\nIf is sounds too good to be true (you know the rest) \n\nScreen sequentially    on the site,  off the site including call,  M&G  and followup if necessary BEFORE  intimacy.  \n\n\nAlso understand that these are tough times. Sadly a lot of would be SB are cutting corners on screening and making it more difficult for others.",
                            "author": "pinotandsugar",
                            "id": "fz4smun",
                            "parent_id": "t1_fz3adov",
                            "score": 3,
                            "created_utc": 1595625501.0,
                            "replies": []
                        },
                        {
                            "body": "What do you mean by pump and dump? Do you mean men want to just have sex then leave?",
                            "author": "a1bells",
                            "id": "fz3c6tu",
                            "parent_id": "t1_fz3adov",
                            "score": 2,
                            "created_utc": 1595600252.0,
                            "replies": [
                                {
                                    "body": "Yes that’s what pump and dump mean. They are even clever enough to tell the girl they’ll pay her later and never do. This was the plan all along. Straight up lame and deceitful.",
                                    "author": "RebelInDisguise01",
                                    "id": "fz3u78d",
                                    "parent_id": "t1_fz3c6tu",
                                    "score": 4,
                                    "created_utc": 1595609120.0,
                                    "replies": [
                                        {
                                            "body": "I think pump pump-n-dump mostly describes SDs who do actually pay. But only once, and then they bail. So they make the SB believe they are starting an arrangement when really they are being used like an escort.",
                                            "author": "SouthernGentSD",
                                            "id": "fz3z36b",
                                            "parent_id": "t1_fz3u78d",
                                            "score": 8,
                                            "created_utc": 1595611394.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz40dx2",
                                            "parent_id": "t1_fz3u78d",
                                            "score": 5,
                                            "created_utc": 1595611998.0,
                                            "replies": [
                                                {
                                                    "body": "Ok it’s still seems too transactional for my liking but to each their own.",
                                                    "author": "RebelInDisguise01",
                                                    "id": "fz4234h",
                                                    "parent_id": "t1_fz40dx2",
                                                    "score": 5,
                                                    "created_utc": 1595612783.0,
                                                    "replies": [
                                                        {
                                                            "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
                                                            "author": "Starflower8888",
                                                            "id": "fza7mdz",
                                                            "parent_id": "t1_fz4234h",
                                                            "score": 1,
                                                            "created_utc": 1595750209.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Point taken, but I feel like there are just as many con girls out there trying to get men to pay up front when the girls have no intention of ever meeting.  Proper vetting involves conversation to draw out the other's personality and intentions.",
                            "author": "hal99514",
                            "id": "fz3dcej",
                            "parent_id": "t1_fz3adov",
                            "score": 5,
                            "created_utc": 1595600859.0,
                            "replies": [
                                {
                                    "body": "Yeah but when you add in maturity, experience, trickery and deceit a couple of dollars versus free sex don’t match.",
                                    "author": "RebelInDisguise01",
                                    "id": "fz3diy8",
                                    "parent_id": "t1_fz3dcej",
                                    "score": 7,
                                    "created_utc": 1595600955.0,
                                    "replies": [
                                        {
                                            "body": "Looks like I'm getting down voted here, but it's an emotional topic.  Be honest, be cautious.  Make sure your expectations are reasonable.  OP's original topic was the great people he's met and I agree.  If you don't want a physical relationship with an older man, use your message filters so you aren't tempted.",
                                            "author": "hal99514",
                                            "id": "fz3f0p0",
                                            "parent_id": "t1_fz3diy8",
                                            "score": 1,
                                            "created_utc": 1595601729.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This made my day 😘",
            "author": null,
            "id": "fz43yg8",
            "parent_id": "t3_hx1icl",
            "score": 2,
            "created_utc": 1595613654.0,
            "replies": []
        },
        {
            "body": "Want to be my daddy lol",
            "author": "zspacetrucker",
            "id": "fz60grk",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595650953.0,
            "replies": [
                {
                    "body": "I wish I could. Lol",
                    "author": "AFSMSgt",
                    "id": "fz6ov6f",
                    "parent_id": "t1_fz60grk",
                    "score": 1,
                    "created_utc": 1595673569.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So much hope . So much positivity, it’s not like the good things come overnight 😊",
            "author": "lynnislove",
            "id": "fz62th6",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595652653.0,
            "replies": []
        },
        {
            "body": "Lol seriously still looking but thanks for this tip 💯💯💯 and hope",
            "author": null,
            "id": "fz6gvl1",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595665255.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fz6o3b0",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595672780.0,
            "replies": [
                {
                    "body": "Please see [How should new SBs and SDs get started?](https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_how_should_new_sbs_and_sds_get_started.3F) on the wiki.\n\nRule #2: Read the wiki/Use search feature before posting\n\nRead the [wiki](/r/sugarlifestyleforum/wiki/index) and use the search feature before creating a new post to ensure that the question hasn't already been asked and answered. The answers to many common questions will be found in either the wiki or in prior posts. If after using these resources, you have a specific question you are more than welcome to ask the community. Redundant post such as \"I'm new any tips\" or \"How to find a sugar momma\" will be removed.",
                    "author": "Azurecole",
                    "id": "fz6q3uu",
                    "parent_id": "t1_fz6o3b0",
                    "score": 1,
                    "created_utc": 1595674833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe it’s true that the best relationships come at the most unexpected times.\n\nMost days I’m so grateful and thankful for my SD, but some days... haha some days I could kill him. It’s a continuous work in progress. \n\nWe have both agreed that we were both “unexpected” and weren’t really looking for what our relationship has blossomed into. \n\nHe has given me so many experiences that I never would have had if it weren’t for him, as well as making me a better person. We both have a lot of the same qualities that aren’t typically favorable, so it has most definitely opened my eyes and made me want to change.\n\nCheers to not typical relationships!",
            "author": "GLA-2020",
            "id": "fz7rt0j",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595699627.0,
            "replies": []
        },
        {
            "body": "It was my first time ever going on a date with an SD, and he said some pretty terrifying things to me. Some lessons are learned the hard way. I guess this is just one of those scenarios.",
            "author": "ImAGoonYoureAGoon",
            "id": "fza862v",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595750769.0,
            "replies": []
        },
        {
            "body": "Can you recommend a SD site that is reliable, have not had any success on secret benefits so far.  Have been trying for over a year. All I get is initial message and then once I respond to that message, nothing happens.  Makes me wonder  if any of these profiles are of a real individual.",
            "author": "beenkiwi1",
            "id": "fzifn3h",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595943986.0,
            "replies": [
                {
                    "body": "Secret benefits is terrible. The good daddies avoid it like the plague.\nAlthough also bad but the best of a sorry lot is Seeking Arrangements seeking.com. You might also try What's Your Price for dating that might lead to sugar.",
                    "author": "AFSMSgt",
                    "id": "fzj1un2",
                    "parent_id": "t1_fzifn3h",
                    "score": 1,
                    "created_utc": 1595955310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any advice for a somewhat newer sugar baby? I’m really scared about getting back in the bowl. My first m&ms went really well and things seemed to go nice so we decided to meet at his house for the second or well I guess first date since m&g is like an interview. Well at the m&g we discussed allowances and things we were and weren’t comfortable. The man was extremely handsome and I was attracted to him. I told him that sex wasn’t off the table but I wanted to wait a few dates and us both be tested for std’s and I even said I don’t expect an allowance or anything for just going on dates. But he insisted and said at our first date (the one at his house) he would give me 100. Well I came over for dinner and a movie and he ended up sexually assaulting me and stealing my wallet. So I don’t know if I should continue in this world or not anymore",
            "author": "Sugarbabeee498",
            "id": "fzp8s4p",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1596086334.0,
            "replies": [
                {
                    "body": "You learned a valuable lesson. Be more careful next time, and have a next time. Don't give up if being an SB is something you want.\n\nDo not go to a stranger's (because that is what your pot SD is) house until you can trust him completely. Use hotels. Platonic dates should be in public. Go to a restaurant, walk in the park (but not after dark), hit the beach. Intimate dates should be in a hotel for the first few months until he proves he is trustworthy. And get your allowance in cash preferably and before being intimate.\n\nDon't be discouraged. This kind of crap happens to all of us SBs and SDs alike.",
                    "author": "AFSMSgt",
                    "id": "fzpt35v",
                    "parent_id": "t1_fzp8s4p",
                    "score": 1,
                    "created_utc": 1596105603.0,
                    "replies": []
                },
                {
                    "body": "This needs to be reported to the police. A crime happened and you did nothing wrong.\n\nIn the escorting world, escorts first screen clients to see if they've been blacklisted. Chances are this dudes on blacklists and thats why he goes to seeking instead of escort sites.\n\nFor your sake, PLEASE do not do this again.",
                    "author": "clair-cummings",
                    "id": "g2sj84b",
                    "parent_id": "t1_fzp8s4p",
                    "score": 1,
                    "created_utc": 1598357786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remember that comment you made! It totally stood out to me and gave me a nice, fuzzy feeling inside 🥺💘",
            "author": "moonjuicediet",
            "id": "g0cb8hw",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1596558319.0,
            "replies": [
                {
                    "body": "I am pleased. I have been equally effected by some of the things I read from SBs on here.",
                    "author": "AFSMSgt",
                    "id": "g0cmym1",
                    "parent_id": "t1_g0cb8hw",
                    "score": 1,
                    "created_utc": 1596562703.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post! I certainly have been questioning the reality of any sugar lifestyle opportunities. Not throwing in the towel, just mopping up the sweat from all the Seeking workout! 😆",
            "author": "BeautyGr8ce",
            "id": "fz3t4i2",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595608616.0,
            "replies": []
        },
        {
            "body": "Awww this raised my spirits!",
            "author": null,
            "id": "fz56t5d",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595633038.0,
            "replies": []
        },
        {
            "body": "I only wish I could find a genuine older SD. It's been such hard work with the constant nonsense messages back and forth and their reluctance to talk of any benefits and sugar. Too much talk of mentoring and not enough talk of fun activities with SBs. Twice I've come across scam artists who seem to be using SA and copy and paste messages which is disturbing. Thank goodness I'm not silly but most woman I've read about and watched on documentaries have been scammed out of life savings and they are educated? How does this happen.",
            "author": "Starflower8888",
            "id": "fz604xd",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1595650724.0,
            "replies": [
                {
                    "body": "It happens to SD's too. Our (SD's) problem is we think with little helmet head. Not enough blood left for our brain.",
                    "author": "AFSMSgt",
                    "id": "fz6ots8",
                    "parent_id": "t1_fz604xd",
                    "score": 1,
                    "created_utc": 1595673528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz3c6k9",
            "parent_id": "t3_hx1icl",
            "score": -15,
            "created_utc": 1595600249.0,
            "replies": [
                {
                    "body": "Pedophiles are attracted to pre pubescent children. Women over the legal age can make their own choices and it has nothing to do with you. It's people like you that don't allow huge age gaps to be normalized. \n\nMy sugar daddy is 26 years older than me and he's got a wealth of knowledge, understanding and different way of looking at the world than any man near my age has. Plus he's fantastic in bed.",
                    "author": "galexa6",
                    "id": "fz3eve6",
                    "parent_id": "t1_fz3c6k9",
                    "score": 10,
                    "created_utc": 1595601653.0,
                    "replies": [
                        {
                            "body": "Very well said! Many older men rock your world in the bedroom and keep you with your needs met. I prefer 50+. They don’t play games, keep it real and lay it all out because time is essential and too precious to waste. Money can be replaced but time cannot.",
                            "author": "RebelInDisguise01",
                            "id": "fz3fx9z",
                            "parent_id": "t1_fz3eve6",
                            "score": 7,
                            "created_utc": 1595602191.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That’s a bit rude, disrespectful and uncalled for. There are very nice seasoned gentlemen in the bowl.  They shouldn’t be discarded because of their age. To each their own but to insinuate prostitution and pedophile behaviors are synonymous with older gentlemen is disgusting, inappropriate and downright degrading because it’s not true. People age both men and women and that doesn’t mean they expire or aren’t worthy of love, attention and affection.",
                    "author": "RebelInDisguise01",
                    "id": "fz3cvt2",
                    "parent_id": "t1_fz3c6k9",
                    "score": 13,
                    "created_utc": 1595600617.0,
                    "replies": [
                        {
                            "body": "Nicely said. I like \"seasoned gentlemen\". Much better than old fart.",
                            "author": "AFSMSgt",
                            "id": "fz3eb9h",
                            "parent_id": "t1_fz3cvt2",
                            "score": 9,
                            "created_utc": 1595601363.0,
                            "replies": [
                                {
                                    "body": "Yeah! I'm definitely not an old fart. Most of my farts come from the day before so only one day old",
                                    "author": "Jdn345",
                                    "id": "fz3plmh",
                                    "parent_id": "t1_fz3eb9h",
                                    "score": 0,
                                    "created_utc": 1595606947.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz3dl0u",
                            "parent_id": "t1_fz3cvt2",
                            "score": -8,
                            "created_utc": 1595600985.0,
                            "replies": [
                                {
                                    "body": "You come across as a very judgmental person. Maybe it’s because you’re young and inexperienced and I’ll give you that but you aren’t the oracle on life and human behavior or human relationships. People like what they like and that’s just that. It’s nothing wrong with wanting someone older or younger. As long as there are two consenting adults it’s none of our business what they do in their private time.",
                                    "author": "RebelInDisguise01",
                                    "id": "fz3e88h",
                                    "parent_id": "t1_fz3dl0u",
                                    "score": 8,
                                    "created_utc": 1595601320.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz3eirp",
                                            "parent_id": "t1_fz3e88h",
                                            "score": -3,
                                            "created_utc": 1595601471.0,
                                            "replies": [
                                                {
                                                    "body": "I must have missed what that even means",
                                                    "author": "Jdn345",
                                                    "id": "fz3rj1x",
                                                    "parent_id": "t1_fz3eirp",
                                                    "score": 1,
                                                    "created_utc": 1595607859.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You are more than welcome to share your opinion and it is appreciated. Please tell me who gets the \"weird vibes\"? That has not been my experience. Yes, people look, and some even comment. But 99% of the people we meet when out and about are very friendly and understanding.\n\nBut you miss the bigger point. SB's and SD's contribute to each other in different, unique, and hopefully exciting ways. We should appreciate each other. The differences, age, color, ect. are what make us exciting together.",
                                    "author": "AFSMSgt",
                                    "id": "fz3fcmo",
                                    "parent_id": "t1_fz3dl0u",
                                    "score": 7,
                                    "created_utc": 1595601897.0,
                                    "replies": []
                                },
                                {
                                    "body": "The pedo vibe is only in your head. Hence you would not make a good sugar baby. I'm assuming your female anyway. And I myself don't care much what other people think. My SB and myself don't notice an age Gap when we're together and don't even think about it. We get along and understand each other so well that it's uncanny. 3 years and never had an argument about anything. Can't say that about any vanilla relationship I've ever had.",
                                    "author": "Jdn345",
                                    "id": "fz3r5d7",
                                    "parent_id": "t1_fz3dl0u",
                                    "score": 2,
                                    "created_utc": 1595607682.0,
                                    "replies": [
                                        {
                                            "body": "Just because they don’t wanna fuck a self professed “granddaddy” doesn’t mean they won’t be a good sugar baby .",
                                            "author": "Driftwould92",
                                            "id": "fz44e3h",
                                            "parent_id": "t1_fz3r5d7",
                                            "score": 0,
                                            "created_utc": 1595613856.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You mean the whole concept of sugaring doesn't already give you prostitution vibes? LOL. Time to wake up and smell the coffee.\n\nAs others said, you (like most people) don't know the definition of pedophilia.",
                    "author": null,
                    "id": "fz4a6ls",
                    "parent_id": "t1_fz3c6k9",
                    "score": 2,
                    "created_utc": 1595616585.0,
                    "replies": []
                },
                {
                    "body": "Yeah I’m not having sex with a man who is 70+",
                    "author": "Driftwould92",
                    "id": "fz3rvpq",
                    "parent_id": "t1_fz3c6k9",
                    "score": -1,
                    "created_utc": 1595608025.0,
                    "replies": [
                        {
                            "body": "That's your choice",
                            "author": "pinotandsugar",
                            "id": "fz4tsrq",
                            "parent_id": "t1_fz3rvpq",
                            "score": 1,
                            "created_utc": 1595626083.0,
                            "replies": [
                                {
                                    "body": "I’m not the one bloviating about how old grandpas are the best . Lmao a lot of young women won’t have sex with men that old . Just saying .",
                                    "author": "Driftwould92",
                                    "id": "fz56sdx",
                                    "parent_id": "t1_fz4tsrq",
                                    "score": 2,
                                    "created_utc": 1595633027.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Neither am I.",
                            "author": "LoftDaddy",
                            "id": "fz4239h",
                            "parent_id": "t1_fz3rvpq",
                            "score": 0,
                            "created_utc": 1595612785.0,
                            "replies": [
                                {
                                    "body": "Well you’re not gay I assume",
                                    "author": "Driftwould92",
                                    "id": "fz43bsx",
                                    "parent_id": "t1_fz4239h",
                                    "score": 1,
                                    "created_utc": 1595613363.0,
                                    "replies": [
                                        {
                                            "body": "So serious. You feel the need to downvote anytime someone makes a quip?",
                                            "author": "LoftDaddy",
                                            "id": "fz43t6k",
                                            "parent_id": "t1_fz43bsx",
                                            "score": 1,
                                            "created_utc": 1595613587.0,
                                            "replies": [
                                                {
                                                    "body": "It wasn’t that funny? And I’m not the only person online right now .",
                                                    "author": "Driftwould92",
                                                    "id": "fz444dn",
                                                    "parent_id": "t1_fz43t6k",
                                                    "score": 0,
                                                    "created_utc": 1595613731.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do grandaddies wish to date someone older. Like a woman in her 30s?",
            "author": "Loud-Bookkeeper4973",
            "id": "i98uclb",
            "parent_id": "t3_hx1icl",
            "score": 1,
            "created_utc": 1652991359.0,
            "replies": [
                {
                    "body": "Mid 30's to mid 40's is the sweet spot for SBs. Mature, experienced women, not pampered 20, something princesses. \n\nThe younger SDs want the college girls that wouldn't date them when they were in college. No so with us older guys. We want and appreciate an SB we can have a real adult conversation with.\n\nIf I tell you my children are big pain in the ass and I wouldn't want to be alive without them, you understand. A 21 yo college princess does not.",
                    "author": "AFSMSgt",
                    "id": "i99n31j",
                    "parent_id": "t1_i98uclb",
                    "score": 2,
                    "created_utc": 1653005597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with you totally. All they want to do is use SBs. Not sure why they are registered on a sugar dating site yet disagree with everything associated with sugar dating. They are time wasters with zero to offer in benefits. I've interacted with many idiots. Also they have no photo yet quick to want to see our private images and disappear when you challenge them. I believe lots of them are time wasters enjoying paying a membership fee to pass time. I can think of better things to do!",
            "author": "Starflower8888",
            "id": "fz664v5",
            "parent_id": "t1_fz45mo3",
            "score": 8,
            "created_utc": 1595655221.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fz6omyd",
                    "parent_id": "t1_fz664v5",
                    "score": 1,
                    "created_utc": 1595673336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz4d4a9",
            "parent_id": "t1_fz45mo3",
            "score": 12,
            "created_utc": 1595617972.0,
            "replies": [
                {
                    "body": "I feel the same :-(",
                    "author": "Starflower8888",
                    "id": "fz668w2",
                    "parent_id": "t1_fz4d4a9",
                    "score": 2,
                    "created_utc": 1595655313.0,
                    "replies": []
                },
                {
                    "body": "To be fair, the girls on SA are just bad. \n\nVery few who are actually serious about an arrangement . Lots of timewasters who just want attention / ego boost \n\nTrash begets trash lol.",
                    "author": "Xivious47",
                    "id": "fz6o1h0",
                    "parent_id": "t1_fz4d4a9",
                    "score": 0,
                    "created_utc": 1595672727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Amen!",
            "author": null,
            "id": "fz5967r",
            "parent_id": "t1_fz45mo3",
            "score": 2,
            "created_utc": 1595634349.0,
            "replies": []
        },
        {
            "body": "I call the scammers turds right off the bat and they block me themselves 😂",
            "author": "zummazu",
            "id": "fz6hawo",
            "parent_id": "t1_fz5h0u2",
            "score": 3,
            "created_utc": 1595665681.0,
            "replies": [
                {
                    "body": "This is what I send when a rude SD requests sight of my private images without a message. I block then they block me. So hilarious 😂🤣\n\n\"Yet again another ugly, ignorant, idiot who cannot read who thinks instantly requesting images is acceptable. In the bin you go and where you know you belong. I want to vomit looking at your face\" 🤢🤮",
                    "author": "Starflower8888",
                    "id": "fza6ess",
                    "parent_id": "t1_fz6hawo",
                    "score": 3,
                    "created_utc": 1595749012.0,
                    "replies": [
                        {
                            "body": "Gonna copy that hahahaha🤣",
                            "author": "makafakafo",
                            "id": "g1mm04z",
                            "parent_id": "t1_fza6ess",
                            "score": 2,
                            "created_utc": 1597514645.0,
                            "replies": [
                                {
                                    "body": "Haha I don't blame you it's too funny 😅",
                                    "author": "Starflower8888",
                                    "id": "g1o0uqf",
                                    "parent_id": "t1_g1mm04z",
                                    "score": 1,
                                    "created_utc": 1597530826.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What does POS mean? This site is very new to me and sometimes I don't understand the jargon :-)",
            "author": "Starflower8888",
            "id": "fz66c51",
            "parent_id": "t1_fz3685y",
            "score": 1,
            "created_utc": 1595655388.0,
            "replies": [
                {
                    "body": "Piece of shit",
                    "author": "RebelInDisguise01",
                    "id": "fz6e59q",
                    "parent_id": "t1_fz66c51",
                    "score": 1,
                    "created_utc": 1595662478.0,
                    "replies": [
                        {
                            "body": "Haha oh gosh I didn't realise. Thanks for that",
                            "author": "Starflower8888",
                            "id": "fz6jczl",
                            "parent_id": "t1_fz6e59q",
                            "score": 1,
                            "created_utc": 1595667792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Probably a minimum of 3 times as many scammer, druggie, fake, and rinser SB",
            "author": null,
            "id": "fz3zzit",
            "parent_id": "t1_fz3685y",
            "score": -4,
            "created_utc": 1595611811.0,
            "replies": [
                {
                    "body": "Yup, out of 100 or so SB messages, maybe 3 are true SBs.",
                    "author": "unlovablemonster2",
                    "id": "fz4zk2h",
                    "parent_id": "t1_fz3zzit",
                    "score": 0,
                    "created_utc": 1595629104.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz44ikl",
            "parent_id": "t1_fz3u7q5",
            "score": 6,
            "created_utc": 1595613914.0,
            "replies": [
                {
                    "body": "If you are not catching the fish you are after the wise person changes the lure.......   Perhaps rewrite your profile to be more attractive to the SD you want and include pix that match and are carefully inspected.",
                    "author": "pinotandsugar",
                    "id": "fz4rb5f",
                    "parent_id": "t1_fz44ikl",
                    "score": 4,
                    "created_utc": 1595624843.0,
                    "replies": [
                        {
                            "body": "Have you considered that genuine SDs are simply not to be found on these websites anymore? SA is nothing like it used to be. After sifting through 60+ messages, I have scheduled exactly one date with a POT.\n\nDoesn't sound like she's suffering from a lack of interest. There aren't many fish in the sea, simply put. Instead it's a cesspool of men seeking free sex or sex in exchange for \"mentorship\" when they're barely thirty years old.",
                            "author": "lara-xo",
                            "id": "fz561gl",
                            "parent_id": "t1_fz4rb5f",
                            "score": 9,
                            "created_utc": 1595632614.0,
                            "replies": [
                                {
                                    "body": "Go back to the original poster.    Why do you even look at 30 year olds.   \n\nYes there are a lot of time waters - sb’s and sd’s.   But I found two great sb’s recently.    One doesn’t want money (but lots of gifts and holidays).   The other more about the money as she’s saving for a masters.   Both get lots of sugar.    So there are people out there.   Persevere and be focused on what you are looking for.",
                                    "author": "brit-sd",
                                    "id": "fz6ahm1",
                                    "parent_id": "t1_fz561gl",
                                    "score": 2,
                                    "created_utc": 1595658970.0,
                                    "replies": [
                                        {
                                            "body": "I'm not. They're messaging me... I think until you're wading through 25 messages a day, you can't quite comprehend. Some of you have never been a beautiful women before, and it really shows. (Joke.)",
                                            "author": "lara-xo",
                                            "id": "fz9rd6s",
                                            "parent_id": "t1_fz6ahm1",
                                            "score": 2,
                                            "created_utc": 1595736523.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "What is POT?",
                                    "author": "Starflower8888",
                                    "id": "fz6v0tk",
                                    "parent_id": "t1_fz561gl",
                                    "score": 1,
                                    "created_utc": 1595679428.0,
                                    "replies": [
                                        {
                                            "body": "Potential sugarbaby or daddy.",
                                            "author": "lara-xo",
                                            "id": "fz9rk33",
                                            "parent_id": "t1_fz6v0tk",
                                            "score": 1,
                                            "created_utc": 1595736658.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you",
                                                    "author": "Starflower8888",
                                                    "id": "fza5j6q",
                                                    "parent_id": "t1_fz9rk33",
                                                    "score": 1,
                                                    "created_utc": 1595748155.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Ding ding ding. Hit the nail on the head.\nAnd its pretty damn demoralizing:(",
                                    "author": "clair-cummings",
                                    "id": "g2sh49s",
                                    "parent_id": "t1_fz561gl",
                                    "score": 1,
                                    "created_utc": 1598356142.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is funny lol. I would love a regular guy, as in not connected to SA, to treat me as a SB. Too many men with their hands in their pockets and not being generous. I met a guy who is far away from an SD you can get although he wrote in his profile he likes to make a woman feel happy, wanted, special and that he's generous. Unfortunately I have not seen any evidence of such benefits. I pay for my own things and he only drives me to locations I'm unable to get to. Not very good at all. I do have my options open so if I do meet somone else it will be by by to this man who is more interested in his pet cat than in me :-(",
                    "author": "Starflower8888",
                    "id": "fz61jcq",
                    "parent_id": "t1_fz44ikl",
                    "score": 2,
                    "created_utc": 1595651724.0,
                    "replies": [
                        {
                            "body": "Girl don't even bother w men like that. Like the movie title says \"I can do bad all by myself\".\n\nMy mantra in dating is that if a man isn't making my life better/less stressful, then why is he in it?? A man like that will just lower your energy and make it that much harder/more challenging to make room for the right one.\n\nI'd rather be single than settle for a dead weight.",
                            "author": "clair-cummings",
                            "id": "g2shg0a",
                            "parent_id": "t1_fz61jcq",
                            "score": 1,
                            "created_utc": 1598356406.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "it hasn't been so easy for real SD's either tbh  \nbut hang in there",
                    "author": "mtriad",
                    "id": "fz5w3i1",
                    "parent_id": "t1_fz44ikl",
                    "score": 0,
                    "created_utc": 1595648006.0,
                    "replies": [
                        {
                            "body": "What issues have you suffered as an SD? My profile online stands out in terms of intellect and I've been complimented upon such many times but when it boils down to it SDs tend to go for woman as young as their own daughters or woman with zero conversation skills. There's only one thing they are interested in yet use mentoring as a disguise. It's very frustrating. I've noticed SA seem to be having much younger members with rather inflated financial stats. It's comical but off-putting. The site has gone downhill over the years",
                            "author": "Starflower8888",
                            "id": "fz65nmk",
                            "parent_id": "t1_fz5w3i1",
                            "score": 3,
                            "created_utc": 1595654831.0,
                            "replies": [
                                {
                                    "body": "not sure why I got a downvote for that but real authentic SD's have a lot to lose when there are so many fake SD's. and yes there are a lot of fake profiles of \"hot students\" trying to scam us.\n\nBTW I'm a younger member, not all of us are like that, I have had a couple of very successful mutually beneficial relationships :)",
                                    "author": "mtriad",
                                    "id": "fz6a144",
                                    "parent_id": "t1_fz65nmk",
                                    "score": 1,
                                    "created_utc": 1595658562.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fz6pfef",
                                    "parent_id": "t1_fz65nmk",
                                    "score": -1,
                                    "created_utc": 1595674141.0,
                                    "replies": [
                                        {
                                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                            "author": "AutoModerator",
                                            "id": "fz6pffd",
                                            "parent_id": "t1_fz6pfef",
                                            "score": 1,
                                            "created_utc": 1595674141.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If you change the number in reference to PPM in your first bullet, to something like $XXX, and reply to this message, I can come back and approve this",
                                            "author": "Azurecole",
                                            "id": "fz6q23s",
                                            "parent_id": "t1_fz6pfef",
                                            "score": 0,
                                            "created_utc": 1595674783.0,
                                            "replies": [
                                                {
                                                    "body": "Done.",
                                                    "author": "Xivious47",
                                                    "id": "fz70dnr",
                                                    "parent_id": "t1_fz6q23s",
                                                    "score": 1,
                                                    "created_utc": 1595683651.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As long as he's looking after you age shouldn't matter, good on you girl 😎",
            "author": "Starflower8888",
            "id": "fza6l9l",
            "parent_id": "t1_fz59iys",
            "score": 2,
            "created_utc": 1595749189.0,
            "replies": []
        },
        {
            "body": "👍",
            "author": "AFSMSgt",
            "id": "fz5n3gp",
            "parent_id": "t1_fz59iys",
            "score": 2,
            "created_utc": 1595642406.0,
            "replies": []
        },
        {
            "body": "You should video call before meeting up or else you’ll end up with a catfish. The “SBs” who ask for $$ upfront before even meeting should get reported ASAP.",
            "author": "unlovablemonster2",
            "id": "fz50zgk",
            "parent_id": "t1_fz4dx20",
            "score": 3,
            "created_utc": 1595629869.0,
            "replies": []
        },
        {
            "body": "The SDs are just as bad. I've been on SA 3 weeks.  I've met \n\n1 John \n\n1 whose pictures were 50 lbs and 15 years ago, \n\n1 who, because  I said I didn't want transactional thought that meant I didn't want anything and in the end wanted a 3sum with his wife that he was supposedly in the middle of a divorce from.  \n\n1 decided (day of) that, because I can't host (which he knew when we set up the m&g and the delay was because of his schedule) we weren't a match. \n\n1 who waited until the scheduled time was past to tell me he had went out of town for work and then ghosted.  \nAnd those are just the ones that got to the m&g stage.  I could write a novella about the conversations that I didn't agree to meet with.",
            "author": "tamenwild",
            "id": "fz4gxmx",
            "parent_id": "t1_fz4dx20",
            "score": 5,
            "created_utc": 1595619774.0,
            "replies": []
        },
        {
            "body": "lots of women are like that which makes it hard for the genuine ones to have a chance , super frustrating , I hate the ghosting side of things .... or the not showing up , it’s seems like with both men and women on SA they think they have a right to be rude , no one obligated anyone to do anything but being honest or telling someone you’re not interested is just decency",
            "author": "Comfortable_Cupcake9",
            "id": "fzetrek",
            "parent_id": "t1_fz4dx20",
            "score": 1,
            "created_utc": 1595863312.0,
            "replies": []
        },
        {
            "body": "I have had remarkably similar experiences recently. I never attributed it to my age, but perhaps.......",
            "author": "AFSMSgt",
            "id": "fz4n9g1",
            "parent_id": "t1_fz4dx20",
            "score": 1,
            "created_utc": 1595622843.0,
            "replies": []
        },
        {
            "body": "Well beyond. I didnt start until I was 59 and I am almost 74 and see no end.",
            "author": "AFSMSgt",
            "id": "fz4mxk2",
            "parent_id": "t1_fz46x8i",
            "score": 7,
            "created_utc": 1595622683.0,
            "replies": []
        },
        {
            "body": "Also AZ based here. It’s quite a lot of work to wade through scammers and individuals with no real want for depth. 🤷🏻‍♀️",
            "author": "girlatbar",
            "id": "fz7nn6c",
            "parent_id": "t1_fz46x8i",
            "score": 1,
            "created_utc": 1595697420.0,
            "replies": [
                {
                    "body": "Yes things are all over the map these days. Ironically I have had 3 back to back sugar relationships over the past 5 yrs with each lasting more than a year.  The most recent being 2.5 years.  Seemed easy to connect with a quality sugar babe.  \n\nUnfortunately I have Been struggling a bit  to lock down with a 4th long term sugar relationship .   So many rinsers and escorts on SA these days.   \n\nI’m Being patient and wading thru the muck.  Im partial to fit to moderately curvy brunettes and Latinas which may be limiting my chances.  \n\nBeen considering opening it up a bit.",
                    "author": "jloaz",
                    "id": "fza23rz",
                    "parent_id": "t1_fz7nn6c",
                    "score": 2,
                    "created_utc": 1595744962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think I have to give a chance guys after 55 then. One gentleman ( I hope) texted me for the second time.  I am gonna cha twith him to find out what person he is",
            "author": "makafakafo",
            "id": "g1mnw0m",
            "parent_id": "t1_fz46x8i",
            "score": 1,
            "created_utc": 1597515174.0,
            "replies": []
        },
        {
            "body": "This exactly",
            "author": "AFSMSgt",
            "id": "fz5myd0",
            "parent_id": "t1_fz57q1m",
            "score": 2,
            "created_utc": 1595642322.0,
            "replies": []
        },
        {
            "body": "Hmm.  So filter over 40.   Let those of us with the money and time be more visible.    If you are reading profiles of 30 year olds then I think that’s part of the problem.",
            "author": "brit-sd",
            "id": "fz6az5g",
            "parent_id": "t1_fz57q1m",
            "score": 1,
            "created_utc": 1595659418.0,
            "replies": [
                {
                    "body": "I'm not. They're messaging ME.",
                    "author": "lara-xo",
                    "id": "fz9r8s9",
                    "parent_id": "t1_fz6az5g",
                    "score": 2,
                    "created_utc": 1595736436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No. Of course not. I want the same. I live alone, have for years. But I am never so lonely as when there is no one who needs me.",
            "author": "AFSMSgt",
            "id": "fz4pbij",
            "parent_id": "t1_fz4l2ki",
            "score": 4,
            "created_utc": 1595623858.0,
            "replies": []
        },
        {
            "body": "Are you sure it's an SD you are seeking? May be a regular site may help as many SDs do not have good hearts. I've come across so many who are rude, cold and heartless and they think their money gives them the right to behave badly",
            "author": "Starflower8888",
            "id": "fz66khd",
            "parent_id": "t1_fz4l2ki",
            "score": 2,
            "created_utc": 1595655579.0,
            "replies": [
                {
                    "body": "My goodness girl. I’m so sorry you haven’t met good hearted SDs. They are out there I assure you!",
                    "author": "Layla_Fox2",
                    "id": "fz6mc6x",
                    "parent_id": "t1_fz66khd",
                    "score": 1,
                    "created_utc": 1595670928.0,
                    "replies": [
                        {
                            "body": "I've had 2 SDs who were great. I used to travel to see one in Europe, he was British like me and we skyped for many months before we met. I met him in London. My second lived in the next town from me. I've had great times with those guys but not been close to anything like that in years. Most SDs on SA now want is sex as that's what they ask or to live out fantasies. They think it's better hooking up on SA as escort sites are cold and expensive!",
                            "author": "Starflower8888",
                            "id": "fza6x4m",
                            "parent_id": "t1_fz6mc6x",
                            "score": 1,
                            "created_utc": 1595749511.0,
                            "replies": [
                                {
                                    "body": "That might be why I have not encountered the problem so many of you seem to. I’ve never used SA.",
                                    "author": "Layla_Fox2",
                                    "id": "fzajuhb",
                                    "parent_id": "t1_fza6x4m",
                                    "score": 1,
                                    "created_utc": 1595763006.0,
                                    "replies": [
                                        {
                                            "body": "What do you use?",
                                            "author": "Starflower8888",
                                            "id": "fzcfh08",
                                            "parent_id": "t1_fzajuhb",
                                            "score": 1,
                                            "created_utc": 1595801598.0,
                                            "replies": [
                                                {
                                                    "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
                                                    "author": "Layla_Fox2",
                                                    "id": "fzcjqkh",
                                                    "parent_id": "t1_fzcfh08",
                                                    "score": 2,
                                                    "created_utc": 1595803970.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you for that much appreciated",
                                                            "author": "Starflower8888",
                                                            "id": "fzdn7dn",
                                                            "parent_id": "t1_fzcjqkh",
                                                            "score": 2,
                                                            "created_utc": 1595829690.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                                                            "author": "Starflower8888",
                                                            "id": "fzdnh75",
                                                            "parent_id": "t1_fzcjqkh",
                                                            "score": 2,
                                                            "created_utc": 1595829924.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                                                                    "author": "Layla_Fox2",
                                                                    "id": "fze6mth",
                                                                    "parent_id": "t1_fzdnh75",
                                                                    "score": 2,
                                                                    "created_utc": 1595848833.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thank you for this information much appreciated 😊",
                                                                            "author": "Starflower8888",
                                                                            "id": "fzhnfhi",
                                                                            "parent_id": "t1_fze6mth",
                                                                            "score": 2,
                                                                            "created_utc": 1595919481.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Try a rewrite of your profile.",
            "author": "pinotandsugar",
            "id": "fz4rsj3",
            "parent_id": "t1_fz4l2ki",
            "score": 1,
            "created_utc": 1595625082.0,
            "replies": []
        },
        {
            "body": "A full day of activities for a fist meet ? That’s a hard pass",
            "author": "Driftwould92",
            "id": "fz3rqu8",
            "parent_id": "t1_fz3ltzt",
            "score": 14,
            "created_utc": 1595607961.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz4752s",
                    "parent_id": "t1_fz3rqu8",
                    "score": 2,
                    "created_utc": 1595615141.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz51ks6",
                            "parent_id": "t1_fz4752s",
                            "score": 14,
                            "created_utc": 1595630187.0,
                            "replies": [
                                {
                                    "body": "I would never agree to a day with no sugar. Hell No",
                                    "author": "Starflower8888",
                                    "id": "fza72f9",
                                    "parent_id": "t1_fz51ks6",
                                    "score": 2,
                                    "created_utc": 1595749656.0,
                                    "replies": []
                                },
                                {
                                    "body": "Speakkk🗣 because oh no",
                                    "author": null,
                                    "id": "fz6hh0b",
                                    "parent_id": "t1_fz51ks6",
                                    "score": 1,
                                    "created_utc": 1595665855.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz51vs3",
                                    "parent_id": "t1_fz51ks6",
                                    "score": -2,
                                    "created_utc": 1595630348.0,
                                    "replies": [
                                        {
                                            "body": "Lol. But you should seriously reconsider asking a woman to give up her whole day to walk away w nothing. That's pretty terrible. She could spend that time working or maybe she's a student and could have spent it studying. A whole day is really asking too much if you are giving nothing.",
                                            "author": "clair-cummings",
                                            "id": "g2sibbp",
                                            "parent_id": "t1_fz51vs3",
                                            "score": 2,
                                            "created_utc": 1598357086.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g2sjva6",
                                                    "parent_id": "t1_g2sibbp",
                                                    "score": 1,
                                                    "created_utc": 1598358256.0,
                                                    "replies": [
                                                        {
                                                            "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                                                            "author": "clair-cummings",
                                                            "id": "g2skp73",
                                                            "parent_id": "t1_g2sjva6",
                                                            "score": 1,
                                                            "created_utc": 1598358852.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz45okd",
            "parent_id": "t1_fz3ltzt",
            "score": 12,
            "created_utc": 1595614459.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz46vdm",
                    "parent_id": "t1_fz45okd",
                    "score": 1,
                    "created_utc": 1595615013.0,
                    "replies": [
                        {
                            "body": "I think this is great! I feel like SB putting down a long fun day are just looking for money and not interested in enjoying your company.",
                            "author": "Miss-Chinaski",
                            "id": "fz4f3v4",
                            "parent_id": "t1_fz46vdm",
                            "score": 0,
                            "created_utc": 1595618888.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The reason it doesn't is because of all the bullshit people that clutter it all up.",
            "author": "Jdn345",
            "id": "fz3ow8v",
            "parent_id": "t1_fz3npyq",
            "score": 4,
            "created_utc": 1595606610.0,
            "replies": [
                {
                    "body": "Yep. Frustrating",
                    "author": null,
                    "id": "fz3tndc",
                    "parent_id": "t1_fz3ow8v",
                    "score": 3,
                    "created_utc": 1595608863.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg! When i read your comment i felt again with hope! Thanks so much, you're true we need to be patients. i just started looking for a SD, but I'm newbie, in fact when someone texted me i really didn't know what to say, i was wondering how do i have to do this??? and i started to be like i was but..  It doesn't works, they were kind of aggressive. So i stop using SA. 😞",
            "author": "Rabiaamore",
            "id": "g2j9caj",
            "parent_id": "t1_fz9ys2p",
            "score": 1,
            "created_utc": 1598141743.0,
            "replies": []
        },
        {
            "body": "Awww so glad you’ve had so many happy years .",
            "author": "lynnislove",
            "id": "fz64lhy",
            "parent_id": "t1_fz4e2ex",
            "score": 2,
            "created_utc": 1595653996.0,
            "replies": []
        },
        {
            "body": "I recently went on a date with a man in his late 60s, and he refused to give an allowance. It was also the worst, least respectful date I’ve ever been on in my life. He lied about his age, was rude to waiters and threw money at them, kissed me on the mouth as a greeting(predatory as fuck), and then followed me back to my apartment and had the most invasive and uncomfortable sexual experience of my entire life. Some lessons in life are learned the hard way, this one made me want to give up on trying all together.",
            "author": "ImAGoonYoureAGoon",
            "id": "fz6fc2x",
            "parent_id": "t1_fz55hp9",
            "score": 1,
            "created_utc": 1595663685.0,
            "replies": [
                {
                    "body": "Why on earth did you sleep with him? I don't get it? That guy sounds like a classic bastard ans treating people like shit. Th e fact he behaved like an asshole on your first meet should have been a huge red flag. If he refused an allowance you should have ended the date. Oh dear :-(",
                    "author": "Starflower8888",
                    "id": "fza7x02",
                    "parent_id": "t1_fz6fc2x",
                    "score": 2,
                    "created_utc": 1595750511.0,
                    "replies": [
                        {
                            "body": "Thats a horrible story and I don't understand why she would sleep w him either.",
                            "author": "clair-cummings",
                            "id": "g2sinxp",
                            "parent_id": "t1_fza7x02",
                            "score": 1,
                            "created_utc": 1598357358.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with you there. The older ones cut so many corners and avoid the subject of allowance like the plague!",
            "author": "Starflower8888",
            "id": "fza7qsl",
            "parent_id": "t1_fz55hp9",
            "score": 1,
            "created_utc": 1595750334.0,
            "replies": []
        },
        {
            "body": "I don’t think they are rejecting real ones. That’s the problem. Too many fake and fraudulent ones on SA since the shelter in place. All they want is to pump and dump. It’s a disgusting game to those kind of men. They want pictures and they string the young ladies along with lies and BS! I wish that there was a way to vet these con men out. They are very dangerous to naive SB’s and eventually women will walk away from the bowl completely after interacting with sexual deviant predators!",
            "author": "RebelInDisguise01",
            "id": "fz3adov",
            "parent_id": "t1_fz38ay4",
            "score": 22,
            "created_utc": 1595599278.0,
            "replies": [
                {
                    "body": "Some suggestions\n\nNo private pix in profile -   that cuts out the 22 yo  guys living in mom's basement with freshly laundered towels at the ready. \n\nPut more quality into your profile \n\nMiddle of the day or early evening M&G  with NO further expectations for the night \n\nBenjamins before Buttons   (especially in the initial intimacy) \n\nIf is sounds too good to be true (you know the rest) \n\nScreen sequentially    on the site,  off the site including call,  M&G  and followup if necessary BEFORE  intimacy.  \n\n\nAlso understand that these are tough times. Sadly a lot of would be SB are cutting corners on screening and making it more difficult for others.",
                    "author": "pinotandsugar",
                    "id": "fz4smun",
                    "parent_id": "t1_fz3adov",
                    "score": 3,
                    "created_utc": 1595625501.0,
                    "replies": []
                },
                {
                    "body": "What do you mean by pump and dump? Do you mean men want to just have sex then leave?",
                    "author": "a1bells",
                    "id": "fz3c6tu",
                    "parent_id": "t1_fz3adov",
                    "score": 2,
                    "created_utc": 1595600252.0,
                    "replies": [
                        {
                            "body": "Yes that’s what pump and dump mean. They are even clever enough to tell the girl they’ll pay her later and never do. This was the plan all along. Straight up lame and deceitful.",
                            "author": "RebelInDisguise01",
                            "id": "fz3u78d",
                            "parent_id": "t1_fz3c6tu",
                            "score": 4,
                            "created_utc": 1595609120.0,
                            "replies": [
                                {
                                    "body": "I think pump pump-n-dump mostly describes SDs who do actually pay. But only once, and then they bail. So they make the SB believe they are starting an arrangement when really they are being used like an escort.",
                                    "author": "SouthernGentSD",
                                    "id": "fz3z36b",
                                    "parent_id": "t1_fz3u78d",
                                    "score": 8,
                                    "created_utc": 1595611394.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz40dx2",
                                    "parent_id": "t1_fz3u78d",
                                    "score": 5,
                                    "created_utc": 1595611998.0,
                                    "replies": [
                                        {
                                            "body": "Ok it’s still seems too transactional for my liking but to each their own.",
                                            "author": "RebelInDisguise01",
                                            "id": "fz4234h",
                                            "parent_id": "t1_fz40dx2",
                                            "score": 5,
                                            "created_utc": 1595612783.0,
                                            "replies": [
                                                {
                                                    "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
                                                    "author": "Starflower8888",
                                                    "id": "fza7mdz",
                                                    "parent_id": "t1_fz4234h",
                                                    "score": 1,
                                                    "created_utc": 1595750209.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Point taken, but I feel like there are just as many con girls out there trying to get men to pay up front when the girls have no intention of ever meeting.  Proper vetting involves conversation to draw out the other's personality and intentions.",
                    "author": "hal99514",
                    "id": "fz3dcej",
                    "parent_id": "t1_fz3adov",
                    "score": 5,
                    "created_utc": 1595600859.0,
                    "replies": [
                        {
                            "body": "Yeah but when you add in maturity, experience, trickery and deceit a couple of dollars versus free sex don’t match.",
                            "author": "RebelInDisguise01",
                            "id": "fz3diy8",
                            "parent_id": "t1_fz3dcej",
                            "score": 7,
                            "created_utc": 1595600955.0,
                            "replies": [
                                {
                                    "body": "Looks like I'm getting down voted here, but it's an emotional topic.  Be honest, be cautious.  Make sure your expectations are reasonable.  OP's original topic was the great people he's met and I agree.  If you don't want a physical relationship with an older man, use your message filters so you aren't tempted.",
                                    "author": "hal99514",
                                    "id": "fz3f0p0",
                                    "parent_id": "t1_fz3diy8",
                                    "score": 1,
                                    "created_utc": 1595601729.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish I could. Lol",
            "author": "AFSMSgt",
            "id": "fz6ov6f",
            "parent_id": "t1_fz60grk",
            "score": 1,
            "created_utc": 1595673569.0,
            "replies": []
        },
        {
            "body": "Please see [How should new SBs and SDs get started?](https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_how_should_new_sbs_and_sds_get_started.3F) on the wiki.\n\nRule #2: Read the wiki/Use search feature before posting\n\nRead the [wiki](/r/sugarlifestyleforum/wiki/index) and use the search feature before creating a new post to ensure that the question hasn't already been asked and answered. The answers to many common questions will be found in either the wiki or in prior posts. If after using these resources, you have a specific question you are more than welcome to ask the community. Redundant post such as \"I'm new any tips\" or \"How to find a sugar momma\" will be removed.",
            "author": "Azurecole",
            "id": "fz6q3uu",
            "parent_id": "t1_fz6o3b0",
            "score": 1,
            "created_utc": 1595674833.0,
            "replies": []
        },
        {
            "body": "Secret benefits is terrible. The good daddies avoid it like the plague.\nAlthough also bad but the best of a sorry lot is Seeking Arrangements seeking.com. You might also try What's Your Price for dating that might lead to sugar.",
            "author": "AFSMSgt",
            "id": "fzj1un2",
            "parent_id": "t1_fzifn3h",
            "score": 1,
            "created_utc": 1595955310.0,
            "replies": []
        },
        {
            "body": "You learned a valuable lesson. Be more careful next time, and have a next time. Don't give up if being an SB is something you want.\n\nDo not go to a stranger's (because that is what your pot SD is) house until you can trust him completely. Use hotels. Platonic dates should be in public. Go to a restaurant, walk in the park (but not after dark), hit the beach. Intimate dates should be in a hotel for the first few months until he proves he is trustworthy. And get your allowance in cash preferably and before being intimate.\n\nDon't be discouraged. This kind of crap happens to all of us SBs and SDs alike.",
            "author": "AFSMSgt",
            "id": "fzpt35v",
            "parent_id": "t1_fzp8s4p",
            "score": 1,
            "created_utc": 1596105603.0,
            "replies": []
        },
        {
            "body": "This needs to be reported to the police. A crime happened and you did nothing wrong.\n\nIn the escorting world, escorts first screen clients to see if they've been blacklisted. Chances are this dudes on blacklists and thats why he goes to seeking instead of escort sites.\n\nFor your sake, PLEASE do not do this again.",
            "author": "clair-cummings",
            "id": "g2sj84b",
            "parent_id": "t1_fzp8s4p",
            "score": 1,
            "created_utc": 1598357786.0,
            "replies": []
        },
        {
            "body": "I am pleased. I have been equally effected by some of the things I read from SBs on here.",
            "author": "AFSMSgt",
            "id": "g0cmym1",
            "parent_id": "t1_g0cb8hw",
            "score": 1,
            "created_utc": 1596562703.0,
            "replies": []
        },
        {
            "body": "It happens to SD's too. Our (SD's) problem is we think with little helmet head. Not enough blood left for our brain.",
            "author": "AFSMSgt",
            "id": "fz6ots8",
            "parent_id": "t1_fz604xd",
            "score": 1,
            "created_utc": 1595673528.0,
            "replies": []
        },
        {
            "body": "Pedophiles are attracted to pre pubescent children. Women over the legal age can make their own choices and it has nothing to do with you. It's people like you that don't allow huge age gaps to be normalized. \n\nMy sugar daddy is 26 years older than me and he's got a wealth of knowledge, understanding and different way of looking at the world than any man near my age has. Plus he's fantastic in bed.",
            "author": "galexa6",
            "id": "fz3eve6",
            "parent_id": "t1_fz3c6k9",
            "score": 10,
            "created_utc": 1595601653.0,
            "replies": [
                {
                    "body": "Very well said! Many older men rock your world in the bedroom and keep you with your needs met. I prefer 50+. They don’t play games, keep it real and lay it all out because time is essential and too precious to waste. Money can be replaced but time cannot.",
                    "author": "RebelInDisguise01",
                    "id": "fz3fx9z",
                    "parent_id": "t1_fz3eve6",
                    "score": 7,
                    "created_utc": 1595602191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s a bit rude, disrespectful and uncalled for. There are very nice seasoned gentlemen in the bowl.  They shouldn’t be discarded because of their age. To each their own but to insinuate prostitution and pedophile behaviors are synonymous with older gentlemen is disgusting, inappropriate and downright degrading because it’s not true. People age both men and women and that doesn’t mean they expire or aren’t worthy of love, attention and affection.",
            "author": "RebelInDisguise01",
            "id": "fz3cvt2",
            "parent_id": "t1_fz3c6k9",
            "score": 13,
            "created_utc": 1595600617.0,
            "replies": [
                {
                    "body": "Nicely said. I like \"seasoned gentlemen\". Much better than old fart.",
                    "author": "AFSMSgt",
                    "id": "fz3eb9h",
                    "parent_id": "t1_fz3cvt2",
                    "score": 9,
                    "created_utc": 1595601363.0,
                    "replies": [
                        {
                            "body": "Yeah! I'm definitely not an old fart. Most of my farts come from the day before so only one day old",
                            "author": "Jdn345",
                            "id": "fz3plmh",
                            "parent_id": "t1_fz3eb9h",
                            "score": 0,
                            "created_utc": 1595606947.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz3dl0u",
                    "parent_id": "t1_fz3cvt2",
                    "score": -8,
                    "created_utc": 1595600985.0,
                    "replies": [
                        {
                            "body": "You come across as a very judgmental person. Maybe it’s because you’re young and inexperienced and I’ll give you that but you aren’t the oracle on life and human behavior or human relationships. People like what they like and that’s just that. It’s nothing wrong with wanting someone older or younger. As long as there are two consenting adults it’s none of our business what they do in their private time.",
                            "author": "RebelInDisguise01",
                            "id": "fz3e88h",
                            "parent_id": "t1_fz3dl0u",
                            "score": 8,
                            "created_utc": 1595601320.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz3eirp",
                                    "parent_id": "t1_fz3e88h",
                                    "score": -3,
                                    "created_utc": 1595601471.0,
                                    "replies": [
                                        {
                                            "body": "I must have missed what that even means",
                                            "author": "Jdn345",
                                            "id": "fz3rj1x",
                                            "parent_id": "t1_fz3eirp",
                                            "score": 1,
                                            "created_utc": 1595607859.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You are more than welcome to share your opinion and it is appreciated. Please tell me who gets the \"weird vibes\"? That has not been my experience. Yes, people look, and some even comment. But 99% of the people we meet when out and about are very friendly and understanding.\n\nBut you miss the bigger point. SB's and SD's contribute to each other in different, unique, and hopefully exciting ways. We should appreciate each other. The differences, age, color, ect. are what make us exciting together.",
                            "author": "AFSMSgt",
                            "id": "fz3fcmo",
                            "parent_id": "t1_fz3dl0u",
                            "score": 7,
                            "created_utc": 1595601897.0,
                            "replies": []
                        },
                        {
                            "body": "The pedo vibe is only in your head. Hence you would not make a good sugar baby. I'm assuming your female anyway. And I myself don't care much what other people think. My SB and myself don't notice an age Gap when we're together and don't even think about it. We get along and understand each other so well that it's uncanny. 3 years and never had an argument about anything. Can't say that about any vanilla relationship I've ever had.",
                            "author": "Jdn345",
                            "id": "fz3r5d7",
                            "parent_id": "t1_fz3dl0u",
                            "score": 2,
                            "created_utc": 1595607682.0,
                            "replies": [
                                {
                                    "body": "Just because they don’t wanna fuck a self professed “granddaddy” doesn’t mean they won’t be a good sugar baby .",
                                    "author": "Driftwould92",
                                    "id": "fz44e3h",
                                    "parent_id": "t1_fz3r5d7",
                                    "score": 0,
                                    "created_utc": 1595613856.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You mean the whole concept of sugaring doesn't already give you prostitution vibes? LOL. Time to wake up and smell the coffee.\n\nAs others said, you (like most people) don't know the definition of pedophilia.",
            "author": null,
            "id": "fz4a6ls",
            "parent_id": "t1_fz3c6k9",
            "score": 2,
            "created_utc": 1595616585.0,
            "replies": []
        },
        {
            "body": "Yeah I’m not having sex with a man who is 70+",
            "author": "Driftwould92",
            "id": "fz3rvpq",
            "parent_id": "t1_fz3c6k9",
            "score": -1,
            "created_utc": 1595608025.0,
            "replies": [
                {
                    "body": "That's your choice",
                    "author": "pinotandsugar",
                    "id": "fz4tsrq",
                    "parent_id": "t1_fz3rvpq",
                    "score": 1,
                    "created_utc": 1595626083.0,
                    "replies": [
                        {
                            "body": "I’m not the one bloviating about how old grandpas are the best . Lmao a lot of young women won’t have sex with men that old . Just saying .",
                            "author": "Driftwould92",
                            "id": "fz56sdx",
                            "parent_id": "t1_fz4tsrq",
                            "score": 2,
                            "created_utc": 1595633027.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Neither am I.",
                    "author": "LoftDaddy",
                    "id": "fz4239h",
                    "parent_id": "t1_fz3rvpq",
                    "score": 0,
                    "created_utc": 1595612785.0,
                    "replies": [
                        {
                            "body": "Well you’re not gay I assume",
                            "author": "Driftwould92",
                            "id": "fz43bsx",
                            "parent_id": "t1_fz4239h",
                            "score": 1,
                            "created_utc": 1595613363.0,
                            "replies": [
                                {
                                    "body": "So serious. You feel the need to downvote anytime someone makes a quip?",
                                    "author": "LoftDaddy",
                                    "id": "fz43t6k",
                                    "parent_id": "t1_fz43bsx",
                                    "score": 1,
                                    "created_utc": 1595613587.0,
                                    "replies": [
                                        {
                                            "body": "It wasn’t that funny? And I’m not the only person online right now .",
                                            "author": "Driftwould92",
                                            "id": "fz444dn",
                                            "parent_id": "t1_fz43t6k",
                                            "score": 0,
                                            "created_utc": 1595613731.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mid 30's to mid 40's is the sweet spot for SBs. Mature, experienced women, not pampered 20, something princesses. \n\nThe younger SDs want the college girls that wouldn't date them when they were in college. No so with us older guys. We want and appreciate an SB we can have a real adult conversation with.\n\nIf I tell you my children are big pain in the ass and I wouldn't want to be alive without them, you understand. A 21 yo college princess does not.",
            "author": "AFSMSgt",
            "id": "i99n31j",
            "parent_id": "t1_i98uclb",
            "score": 2,
            "created_utc": 1653005597.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fz6omyd",
            "parent_id": "t1_fz664v5",
            "score": 1,
            "created_utc": 1595673336.0,
            "replies": []
        },
        {
            "body": "I feel the same :-(",
            "author": "Starflower8888",
            "id": "fz668w2",
            "parent_id": "t1_fz4d4a9",
            "score": 2,
            "created_utc": 1595655313.0,
            "replies": []
        },
        {
            "body": "To be fair, the girls on SA are just bad. \n\nVery few who are actually serious about an arrangement . Lots of timewasters who just want attention / ego boost \n\nTrash begets trash lol.",
            "author": "Xivious47",
            "id": "fz6o1h0",
            "parent_id": "t1_fz4d4a9",
            "score": 0,
            "created_utc": 1595672727.0,
            "replies": []
        },
        {
            "body": "This is what I send when a rude SD requests sight of my private images without a message. I block then they block me. So hilarious 😂🤣\n\n\"Yet again another ugly, ignorant, idiot who cannot read who thinks instantly requesting images is acceptable. In the bin you go and where you know you belong. I want to vomit looking at your face\" 🤢🤮",
            "author": "Starflower8888",
            "id": "fza6ess",
            "parent_id": "t1_fz6hawo",
            "score": 3,
            "created_utc": 1595749012.0,
            "replies": [
                {
                    "body": "Gonna copy that hahahaha🤣",
                    "author": "makafakafo",
                    "id": "g1mm04z",
                    "parent_id": "t1_fza6ess",
                    "score": 2,
                    "created_utc": 1597514645.0,
                    "replies": [
                        {
                            "body": "Haha I don't blame you it's too funny 😅",
                            "author": "Starflower8888",
                            "id": "g1o0uqf",
                            "parent_id": "t1_g1mm04z",
                            "score": 1,
                            "created_utc": 1597530826.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Piece of shit",
            "author": "RebelInDisguise01",
            "id": "fz6e59q",
            "parent_id": "t1_fz66c51",
            "score": 1,
            "created_utc": 1595662478.0,
            "replies": [
                {
                    "body": "Haha oh gosh I didn't realise. Thanks for that",
                    "author": "Starflower8888",
                    "id": "fz6jczl",
                    "parent_id": "t1_fz6e59q",
                    "score": 1,
                    "created_utc": 1595667792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup, out of 100 or so SB messages, maybe 3 are true SBs.",
            "author": "unlovablemonster2",
            "id": "fz4zk2h",
            "parent_id": "t1_fz3zzit",
            "score": 0,
            "created_utc": 1595629104.0,
            "replies": []
        },
        {
            "body": "If you are not catching the fish you are after the wise person changes the lure.......   Perhaps rewrite your profile to be more attractive to the SD you want and include pix that match and are carefully inspected.",
            "author": "pinotandsugar",
            "id": "fz4rb5f",
            "parent_id": "t1_fz44ikl",
            "score": 4,
            "created_utc": 1595624843.0,
            "replies": [
                {
                    "body": "Have you considered that genuine SDs are simply not to be found on these websites anymore? SA is nothing like it used to be. After sifting through 60+ messages, I have scheduled exactly one date with a POT.\n\nDoesn't sound like she's suffering from a lack of interest. There aren't many fish in the sea, simply put. Instead it's a cesspool of men seeking free sex or sex in exchange for \"mentorship\" when they're barely thirty years old.",
                    "author": "lara-xo",
                    "id": "fz561gl",
                    "parent_id": "t1_fz4rb5f",
                    "score": 9,
                    "created_utc": 1595632614.0,
                    "replies": [
                        {
                            "body": "Go back to the original poster.    Why do you even look at 30 year olds.   \n\nYes there are a lot of time waters - sb’s and sd’s.   But I found two great sb’s recently.    One doesn’t want money (but lots of gifts and holidays).   The other more about the money as she’s saving for a masters.   Both get lots of sugar.    So there are people out there.   Persevere and be focused on what you are looking for.",
                            "author": "brit-sd",
                            "id": "fz6ahm1",
                            "parent_id": "t1_fz561gl",
                            "score": 2,
                            "created_utc": 1595658970.0,
                            "replies": [
                                {
                                    "body": "I'm not. They're messaging me... I think until you're wading through 25 messages a day, you can't quite comprehend. Some of you have never been a beautiful women before, and it really shows. (Joke.)",
                                    "author": "lara-xo",
                                    "id": "fz9rd6s",
                                    "parent_id": "t1_fz6ahm1",
                                    "score": 2,
                                    "created_utc": 1595736523.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What is POT?",
                            "author": "Starflower8888",
                            "id": "fz6v0tk",
                            "parent_id": "t1_fz561gl",
                            "score": 1,
                            "created_utc": 1595679428.0,
                            "replies": [
                                {
                                    "body": "Potential sugarbaby or daddy.",
                                    "author": "lara-xo",
                                    "id": "fz9rk33",
                                    "parent_id": "t1_fz6v0tk",
                                    "score": 1,
                                    "created_utc": 1595736658.0,
                                    "replies": [
                                        {
                                            "body": "Thank you",
                                            "author": "Starflower8888",
                                            "id": "fza5j6q",
                                            "parent_id": "t1_fz9rk33",
                                            "score": 1,
                                            "created_utc": 1595748155.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ding ding ding. Hit the nail on the head.\nAnd its pretty damn demoralizing:(",
                            "author": "clair-cummings",
                            "id": "g2sh49s",
                            "parent_id": "t1_fz561gl",
                            "score": 1,
                            "created_utc": 1598356142.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is funny lol. I would love a regular guy, as in not connected to SA, to treat me as a SB. Too many men with their hands in their pockets and not being generous. I met a guy who is far away from an SD you can get although he wrote in his profile he likes to make a woman feel happy, wanted, special and that he's generous. Unfortunately I have not seen any evidence of such benefits. I pay for my own things and he only drives me to locations I'm unable to get to. Not very good at all. I do have my options open so if I do meet somone else it will be by by to this man who is more interested in his pet cat than in me :-(",
            "author": "Starflower8888",
            "id": "fz61jcq",
            "parent_id": "t1_fz44ikl",
            "score": 2,
            "created_utc": 1595651724.0,
            "replies": [
                {
                    "body": "Girl don't even bother w men like that. Like the movie title says \"I can do bad all by myself\".\n\nMy mantra in dating is that if a man isn't making my life better/less stressful, then why is he in it?? A man like that will just lower your energy and make it that much harder/more challenging to make room for the right one.\n\nI'd rather be single than settle for a dead weight.",
                    "author": "clair-cummings",
                    "id": "g2shg0a",
                    "parent_id": "t1_fz61jcq",
                    "score": 1,
                    "created_utc": 1598356406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it hasn't been so easy for real SD's either tbh  \nbut hang in there",
            "author": "mtriad",
            "id": "fz5w3i1",
            "parent_id": "t1_fz44ikl",
            "score": 0,
            "created_utc": 1595648006.0,
            "replies": [
                {
                    "body": "What issues have you suffered as an SD? My profile online stands out in terms of intellect and I've been complimented upon such many times but when it boils down to it SDs tend to go for woman as young as their own daughters or woman with zero conversation skills. There's only one thing they are interested in yet use mentoring as a disguise. It's very frustrating. I've noticed SA seem to be having much younger members with rather inflated financial stats. It's comical but off-putting. The site has gone downhill over the years",
                    "author": "Starflower8888",
                    "id": "fz65nmk",
                    "parent_id": "t1_fz5w3i1",
                    "score": 3,
                    "created_utc": 1595654831.0,
                    "replies": [
                        {
                            "body": "not sure why I got a downvote for that but real authentic SD's have a lot to lose when there are so many fake SD's. and yes there are a lot of fake profiles of \"hot students\" trying to scam us.\n\nBTW I'm a younger member, not all of us are like that, I have had a couple of very successful mutually beneficial relationships :)",
                            "author": "mtriad",
                            "id": "fz6a144",
                            "parent_id": "t1_fz65nmk",
                            "score": 1,
                            "created_utc": 1595658562.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fz6pfef",
                            "parent_id": "t1_fz65nmk",
                            "score": -1,
                            "created_utc": 1595674141.0,
                            "replies": [
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "fz6pffd",
                                    "parent_id": "t1_fz6pfef",
                                    "score": 1,
                                    "created_utc": 1595674141.0,
                                    "replies": []
                                },
                                {
                                    "body": "If you change the number in reference to PPM in your first bullet, to something like $XXX, and reply to this message, I can come back and approve this",
                                    "author": "Azurecole",
                                    "id": "fz6q23s",
                                    "parent_id": "t1_fz6pfef",
                                    "score": 0,
                                    "created_utc": 1595674783.0,
                                    "replies": [
                                        {
                                            "body": "Done.",
                                            "author": "Xivious47",
                                            "id": "fz70dnr",
                                            "parent_id": "t1_fz6q23s",
                                            "score": 1,
                                            "created_utc": 1595683651.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes things are all over the map these days. Ironically I have had 3 back to back sugar relationships over the past 5 yrs with each lasting more than a year.  The most recent being 2.5 years.  Seemed easy to connect with a quality sugar babe.  \n\nUnfortunately I have Been struggling a bit  to lock down with a 4th long term sugar relationship .   So many rinsers and escorts on SA these days.   \n\nI’m Being patient and wading thru the muck.  Im partial to fit to moderately curvy brunettes and Latinas which may be limiting my chances.  \n\nBeen considering opening it up a bit.",
            "author": "jloaz",
            "id": "fza23rz",
            "parent_id": "t1_fz7nn6c",
            "score": 2,
            "created_utc": 1595744962.0,
            "replies": []
        },
        {
            "body": "I'm not. They're messaging ME.",
            "author": "lara-xo",
            "id": "fz9r8s9",
            "parent_id": "t1_fz6az5g",
            "score": 2,
            "created_utc": 1595736436.0,
            "replies": []
        },
        {
            "body": "My goodness girl. I’m so sorry you haven’t met good hearted SDs. They are out there I assure you!",
            "author": "Layla_Fox2",
            "id": "fz6mc6x",
            "parent_id": "t1_fz66khd",
            "score": 1,
            "created_utc": 1595670928.0,
            "replies": [
                {
                    "body": "I've had 2 SDs who were great. I used to travel to see one in Europe, he was British like me and we skyped for many months before we met. I met him in London. My second lived in the next town from me. I've had great times with those guys but not been close to anything like that in years. Most SDs on SA now want is sex as that's what they ask or to live out fantasies. They think it's better hooking up on SA as escort sites are cold and expensive!",
                    "author": "Starflower8888",
                    "id": "fza6x4m",
                    "parent_id": "t1_fz6mc6x",
                    "score": 1,
                    "created_utc": 1595749511.0,
                    "replies": [
                        {
                            "body": "That might be why I have not encountered the problem so many of you seem to. I’ve never used SA.",
                            "author": "Layla_Fox2",
                            "id": "fzajuhb",
                            "parent_id": "t1_fza6x4m",
                            "score": 1,
                            "created_utc": 1595763006.0,
                            "replies": [
                                {
                                    "body": "What do you use?",
                                    "author": "Starflower8888",
                                    "id": "fzcfh08",
                                    "parent_id": "t1_fzajuhb",
                                    "score": 1,
                                    "created_utc": 1595801598.0,
                                    "replies": [
                                        {
                                            "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
                                            "author": "Layla_Fox2",
                                            "id": "fzcjqkh",
                                            "parent_id": "t1_fzcfh08",
                                            "score": 2,
                                            "created_utc": 1595803970.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for that much appreciated",
                                                    "author": "Starflower8888",
                                                    "id": "fzdn7dn",
                                                    "parent_id": "t1_fzcjqkh",
                                                    "score": 2,
                                                    "created_utc": 1595829690.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                                                    "author": "Starflower8888",
                                                    "id": "fzdnh75",
                                                    "parent_id": "t1_fzcjqkh",
                                                    "score": 2,
                                                    "created_utc": 1595829924.0,
                                                    "replies": [
                                                        {
                                                            "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                                                            "author": "Layla_Fox2",
                                                            "id": "fze6mth",
                                                            "parent_id": "t1_fzdnh75",
                                                            "score": 2,
                                                            "created_utc": 1595848833.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you for this information much appreciated 😊",
                                                                    "author": "Starflower8888",
                                                                    "id": "fzhnfhi",
                                                                    "parent_id": "t1_fze6mth",
                                                                    "score": 2,
                                                                    "created_utc": 1595919481.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz4752s",
            "parent_id": "t1_fz3rqu8",
            "score": 2,
            "created_utc": 1595615141.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz51ks6",
                    "parent_id": "t1_fz4752s",
                    "score": 14,
                    "created_utc": 1595630187.0,
                    "replies": [
                        {
                            "body": "I would never agree to a day with no sugar. Hell No",
                            "author": "Starflower8888",
                            "id": "fza72f9",
                            "parent_id": "t1_fz51ks6",
                            "score": 2,
                            "created_utc": 1595749656.0,
                            "replies": []
                        },
                        {
                            "body": "Speakkk🗣 because oh no",
                            "author": null,
                            "id": "fz6hh0b",
                            "parent_id": "t1_fz51ks6",
                            "score": 1,
                            "created_utc": 1595665855.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz51vs3",
                            "parent_id": "t1_fz51ks6",
                            "score": -2,
                            "created_utc": 1595630348.0,
                            "replies": [
                                {
                                    "body": "Lol. But you should seriously reconsider asking a woman to give up her whole day to walk away w nothing. That's pretty terrible. She could spend that time working or maybe she's a student and could have spent it studying. A whole day is really asking too much if you are giving nothing.",
                                    "author": "clair-cummings",
                                    "id": "g2sibbp",
                                    "parent_id": "t1_fz51vs3",
                                    "score": 2,
                                    "created_utc": 1598357086.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g2sjva6",
                                            "parent_id": "t1_g2sibbp",
                                            "score": 1,
                                            "created_utc": 1598358256.0,
                                            "replies": [
                                                {
                                                    "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                                                    "author": "clair-cummings",
                                                    "id": "g2skp73",
                                                    "parent_id": "t1_g2sjva6",
                                                    "score": 1,
                                                    "created_utc": 1598358852.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz46vdm",
            "parent_id": "t1_fz45okd",
            "score": 1,
            "created_utc": 1595615013.0,
            "replies": [
                {
                    "body": "I think this is great! I feel like SB putting down a long fun day are just looking for money and not interested in enjoying your company.",
                    "author": "Miss-Chinaski",
                    "id": "fz4f3v4",
                    "parent_id": "t1_fz46vdm",
                    "score": 0,
                    "created_utc": 1595618888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep. Frustrating",
            "author": null,
            "id": "fz3tndc",
            "parent_id": "t1_fz3ow8v",
            "score": 3,
            "created_utc": 1595608863.0,
            "replies": []
        },
        {
            "body": "Why on earth did you sleep with him? I don't get it? That guy sounds like a classic bastard ans treating people like shit. Th e fact he behaved like an asshole on your first meet should have been a huge red flag. If he refused an allowance you should have ended the date. Oh dear :-(",
            "author": "Starflower8888",
            "id": "fza7x02",
            "parent_id": "t1_fz6fc2x",
            "score": 2,
            "created_utc": 1595750511.0,
            "replies": [
                {
                    "body": "Thats a horrible story and I don't understand why she would sleep w him either.",
                    "author": "clair-cummings",
                    "id": "g2sinxp",
                    "parent_id": "t1_fza7x02",
                    "score": 1,
                    "created_utc": 1598357358.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some suggestions\n\nNo private pix in profile -   that cuts out the 22 yo  guys living in mom's basement with freshly laundered towels at the ready. \n\nPut more quality into your profile \n\nMiddle of the day or early evening M&G  with NO further expectations for the night \n\nBenjamins before Buttons   (especially in the initial intimacy) \n\nIf is sounds too good to be true (you know the rest) \n\nScreen sequentially    on the site,  off the site including call,  M&G  and followup if necessary BEFORE  intimacy.  \n\n\nAlso understand that these are tough times. Sadly a lot of would be SB are cutting corners on screening and making it more difficult for others.",
            "author": "pinotandsugar",
            "id": "fz4smun",
            "parent_id": "t1_fz3adov",
            "score": 3,
            "created_utc": 1595625501.0,
            "replies": []
        },
        {
            "body": "What do you mean by pump and dump? Do you mean men want to just have sex then leave?",
            "author": "a1bells",
            "id": "fz3c6tu",
            "parent_id": "t1_fz3adov",
            "score": 2,
            "created_utc": 1595600252.0,
            "replies": [
                {
                    "body": "Yes that’s what pump and dump mean. They are even clever enough to tell the girl they’ll pay her later and never do. This was the plan all along. Straight up lame and deceitful.",
                    "author": "RebelInDisguise01",
                    "id": "fz3u78d",
                    "parent_id": "t1_fz3c6tu",
                    "score": 4,
                    "created_utc": 1595609120.0,
                    "replies": [
                        {
                            "body": "I think pump pump-n-dump mostly describes SDs who do actually pay. But only once, and then they bail. So they make the SB believe they are starting an arrangement when really they are being used like an escort.",
                            "author": "SouthernGentSD",
                            "id": "fz3z36b",
                            "parent_id": "t1_fz3u78d",
                            "score": 8,
                            "created_utc": 1595611394.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz40dx2",
                            "parent_id": "t1_fz3u78d",
                            "score": 5,
                            "created_utc": 1595611998.0,
                            "replies": [
                                {
                                    "body": "Ok it’s still seems too transactional for my liking but to each their own.",
                                    "author": "RebelInDisguise01",
                                    "id": "fz4234h",
                                    "parent_id": "t1_fz40dx2",
                                    "score": 5,
                                    "created_utc": 1595612783.0,
                                    "replies": [
                                        {
                                            "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
                                            "author": "Starflower8888",
                                            "id": "fza7mdz",
                                            "parent_id": "t1_fz4234h",
                                            "score": 1,
                                            "created_utc": 1595750209.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Point taken, but I feel like there are just as many con girls out there trying to get men to pay up front when the girls have no intention of ever meeting.  Proper vetting involves conversation to draw out the other's personality and intentions.",
            "author": "hal99514",
            "id": "fz3dcej",
            "parent_id": "t1_fz3adov",
            "score": 5,
            "created_utc": 1595600859.0,
            "replies": [
                {
                    "body": "Yeah but when you add in maturity, experience, trickery and deceit a couple of dollars versus free sex don’t match.",
                    "author": "RebelInDisguise01",
                    "id": "fz3diy8",
                    "parent_id": "t1_fz3dcej",
                    "score": 7,
                    "created_utc": 1595600955.0,
                    "replies": [
                        {
                            "body": "Looks like I'm getting down voted here, but it's an emotional topic.  Be honest, be cautious.  Make sure your expectations are reasonable.  OP's original topic was the great people he's met and I agree.  If you don't want a physical relationship with an older man, use your message filters so you aren't tempted.",
                            "author": "hal99514",
                            "id": "fz3f0p0",
                            "parent_id": "t1_fz3diy8",
                            "score": 1,
                            "created_utc": 1595601729.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very well said! Many older men rock your world in the bedroom and keep you with your needs met. I prefer 50+. They don’t play games, keep it real and lay it all out because time is essential and too precious to waste. Money can be replaced but time cannot.",
            "author": "RebelInDisguise01",
            "id": "fz3fx9z",
            "parent_id": "t1_fz3eve6",
            "score": 7,
            "created_utc": 1595602191.0,
            "replies": []
        },
        {
            "body": "Nicely said. I like \"seasoned gentlemen\". Much better than old fart.",
            "author": "AFSMSgt",
            "id": "fz3eb9h",
            "parent_id": "t1_fz3cvt2",
            "score": 9,
            "created_utc": 1595601363.0,
            "replies": [
                {
                    "body": "Yeah! I'm definitely not an old fart. Most of my farts come from the day before so only one day old",
                    "author": "Jdn345",
                    "id": "fz3plmh",
                    "parent_id": "t1_fz3eb9h",
                    "score": 0,
                    "created_utc": 1595606947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz3dl0u",
            "parent_id": "t1_fz3cvt2",
            "score": -8,
            "created_utc": 1595600985.0,
            "replies": [
                {
                    "body": "You come across as a very judgmental person. Maybe it’s because you’re young and inexperienced and I’ll give you that but you aren’t the oracle on life and human behavior or human relationships. People like what they like and that’s just that. It’s nothing wrong with wanting someone older or younger. As long as there are two consenting adults it’s none of our business what they do in their private time.",
                    "author": "RebelInDisguise01",
                    "id": "fz3e88h",
                    "parent_id": "t1_fz3dl0u",
                    "score": 8,
                    "created_utc": 1595601320.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz3eirp",
                            "parent_id": "t1_fz3e88h",
                            "score": -3,
                            "created_utc": 1595601471.0,
                            "replies": [
                                {
                                    "body": "I must have missed what that even means",
                                    "author": "Jdn345",
                                    "id": "fz3rj1x",
                                    "parent_id": "t1_fz3eirp",
                                    "score": 1,
                                    "created_utc": 1595607859.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are more than welcome to share your opinion and it is appreciated. Please tell me who gets the \"weird vibes\"? That has not been my experience. Yes, people look, and some even comment. But 99% of the people we meet when out and about are very friendly and understanding.\n\nBut you miss the bigger point. SB's and SD's contribute to each other in different, unique, and hopefully exciting ways. We should appreciate each other. The differences, age, color, ect. are what make us exciting together.",
                    "author": "AFSMSgt",
                    "id": "fz3fcmo",
                    "parent_id": "t1_fz3dl0u",
                    "score": 7,
                    "created_utc": 1595601897.0,
                    "replies": []
                },
                {
                    "body": "The pedo vibe is only in your head. Hence you would not make a good sugar baby. I'm assuming your female anyway. And I myself don't care much what other people think. My SB and myself don't notice an age Gap when we're together and don't even think about it. We get along and understand each other so well that it's uncanny. 3 years and never had an argument about anything. Can't say that about any vanilla relationship I've ever had.",
                    "author": "Jdn345",
                    "id": "fz3r5d7",
                    "parent_id": "t1_fz3dl0u",
                    "score": 2,
                    "created_utc": 1595607682.0,
                    "replies": [
                        {
                            "body": "Just because they don’t wanna fuck a self professed “granddaddy” doesn’t mean they won’t be a good sugar baby .",
                            "author": "Driftwould92",
                            "id": "fz44e3h",
                            "parent_id": "t1_fz3r5d7",
                            "score": 0,
                            "created_utc": 1595613856.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's your choice",
            "author": "pinotandsugar",
            "id": "fz4tsrq",
            "parent_id": "t1_fz3rvpq",
            "score": 1,
            "created_utc": 1595626083.0,
            "replies": [
                {
                    "body": "I’m not the one bloviating about how old grandpas are the best . Lmao a lot of young women won’t have sex with men that old . Just saying .",
                    "author": "Driftwould92",
                    "id": "fz56sdx",
                    "parent_id": "t1_fz4tsrq",
                    "score": 2,
                    "created_utc": 1595633027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Neither am I.",
            "author": "LoftDaddy",
            "id": "fz4239h",
            "parent_id": "t1_fz3rvpq",
            "score": 0,
            "created_utc": 1595612785.0,
            "replies": [
                {
                    "body": "Well you’re not gay I assume",
                    "author": "Driftwould92",
                    "id": "fz43bsx",
                    "parent_id": "t1_fz4239h",
                    "score": 1,
                    "created_utc": 1595613363.0,
                    "replies": [
                        {
                            "body": "So serious. You feel the need to downvote anytime someone makes a quip?",
                            "author": "LoftDaddy",
                            "id": "fz43t6k",
                            "parent_id": "t1_fz43bsx",
                            "score": 1,
                            "created_utc": 1595613587.0,
                            "replies": [
                                {
                                    "body": "It wasn’t that funny? And I’m not the only person online right now .",
                                    "author": "Driftwould92",
                                    "id": "fz444dn",
                                    "parent_id": "t1_fz43t6k",
                                    "score": 0,
                                    "created_utc": 1595613731.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gonna copy that hahahaha🤣",
            "author": "makafakafo",
            "id": "g1mm04z",
            "parent_id": "t1_fza6ess",
            "score": 2,
            "created_utc": 1597514645.0,
            "replies": [
                {
                    "body": "Haha I don't blame you it's too funny 😅",
                    "author": "Starflower8888",
                    "id": "g1o0uqf",
                    "parent_id": "t1_g1mm04z",
                    "score": 1,
                    "created_utc": 1597530826.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha oh gosh I didn't realise. Thanks for that",
            "author": "Starflower8888",
            "id": "fz6jczl",
            "parent_id": "t1_fz6e59q",
            "score": 1,
            "created_utc": 1595667792.0,
            "replies": []
        },
        {
            "body": "Have you considered that genuine SDs are simply not to be found on these websites anymore? SA is nothing like it used to be. After sifting through 60+ messages, I have scheduled exactly one date with a POT.\n\nDoesn't sound like she's suffering from a lack of interest. There aren't many fish in the sea, simply put. Instead it's a cesspool of men seeking free sex or sex in exchange for \"mentorship\" when they're barely thirty years old.",
            "author": "lara-xo",
            "id": "fz561gl",
            "parent_id": "t1_fz4rb5f",
            "score": 9,
            "created_utc": 1595632614.0,
            "replies": [
                {
                    "body": "Go back to the original poster.    Why do you even look at 30 year olds.   \n\nYes there are a lot of time waters - sb’s and sd’s.   But I found two great sb’s recently.    One doesn’t want money (but lots of gifts and holidays).   The other more about the money as she’s saving for a masters.   Both get lots of sugar.    So there are people out there.   Persevere and be focused on what you are looking for.",
                    "author": "brit-sd",
                    "id": "fz6ahm1",
                    "parent_id": "t1_fz561gl",
                    "score": 2,
                    "created_utc": 1595658970.0,
                    "replies": [
                        {
                            "body": "I'm not. They're messaging me... I think until you're wading through 25 messages a day, you can't quite comprehend. Some of you have never been a beautiful women before, and it really shows. (Joke.)",
                            "author": "lara-xo",
                            "id": "fz9rd6s",
                            "parent_id": "t1_fz6ahm1",
                            "score": 2,
                            "created_utc": 1595736523.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What is POT?",
                    "author": "Starflower8888",
                    "id": "fz6v0tk",
                    "parent_id": "t1_fz561gl",
                    "score": 1,
                    "created_utc": 1595679428.0,
                    "replies": [
                        {
                            "body": "Potential sugarbaby or daddy.",
                            "author": "lara-xo",
                            "id": "fz9rk33",
                            "parent_id": "t1_fz6v0tk",
                            "score": 1,
                            "created_utc": 1595736658.0,
                            "replies": [
                                {
                                    "body": "Thank you",
                                    "author": "Starflower8888",
                                    "id": "fza5j6q",
                                    "parent_id": "t1_fz9rk33",
                                    "score": 1,
                                    "created_utc": 1595748155.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ding ding ding. Hit the nail on the head.\nAnd its pretty damn demoralizing:(",
                    "author": "clair-cummings",
                    "id": "g2sh49s",
                    "parent_id": "t1_fz561gl",
                    "score": 1,
                    "created_utc": 1598356142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl don't even bother w men like that. Like the movie title says \"I can do bad all by myself\".\n\nMy mantra in dating is that if a man isn't making my life better/less stressful, then why is he in it?? A man like that will just lower your energy and make it that much harder/more challenging to make room for the right one.\n\nI'd rather be single than settle for a dead weight.",
            "author": "clair-cummings",
            "id": "g2shg0a",
            "parent_id": "t1_fz61jcq",
            "score": 1,
            "created_utc": 1598356406.0,
            "replies": []
        },
        {
            "body": "What issues have you suffered as an SD? My profile online stands out in terms of intellect and I've been complimented upon such many times but when it boils down to it SDs tend to go for woman as young as their own daughters or woman with zero conversation skills. There's only one thing they are interested in yet use mentoring as a disguise. It's very frustrating. I've noticed SA seem to be having much younger members with rather inflated financial stats. It's comical but off-putting. The site has gone downhill over the years",
            "author": "Starflower8888",
            "id": "fz65nmk",
            "parent_id": "t1_fz5w3i1",
            "score": 3,
            "created_utc": 1595654831.0,
            "replies": [
                {
                    "body": "not sure why I got a downvote for that but real authentic SD's have a lot to lose when there are so many fake SD's. and yes there are a lot of fake profiles of \"hot students\" trying to scam us.\n\nBTW I'm a younger member, not all of us are like that, I have had a couple of very successful mutually beneficial relationships :)",
                    "author": "mtriad",
                    "id": "fz6a144",
                    "parent_id": "t1_fz65nmk",
                    "score": 1,
                    "created_utc": 1595658562.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fz6pfef",
                    "parent_id": "t1_fz65nmk",
                    "score": -1,
                    "created_utc": 1595674141.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "fz6pffd",
                            "parent_id": "t1_fz6pfef",
                            "score": 1,
                            "created_utc": 1595674141.0,
                            "replies": []
                        },
                        {
                            "body": "If you change the number in reference to PPM in your first bullet, to something like $XXX, and reply to this message, I can come back and approve this",
                            "author": "Azurecole",
                            "id": "fz6q23s",
                            "parent_id": "t1_fz6pfef",
                            "score": 0,
                            "created_utc": 1595674783.0,
                            "replies": [
                                {
                                    "body": "Done.",
                                    "author": "Xivious47",
                                    "id": "fz70dnr",
                                    "parent_id": "t1_fz6q23s",
                                    "score": 1,
                                    "created_utc": 1595683651.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've had 2 SDs who were great. I used to travel to see one in Europe, he was British like me and we skyped for many months before we met. I met him in London. My second lived in the next town from me. I've had great times with those guys but not been close to anything like that in years. Most SDs on SA now want is sex as that's what they ask or to live out fantasies. They think it's better hooking up on SA as escort sites are cold and expensive!",
            "author": "Starflower8888",
            "id": "fza6x4m",
            "parent_id": "t1_fz6mc6x",
            "score": 1,
            "created_utc": 1595749511.0,
            "replies": [
                {
                    "body": "That might be why I have not encountered the problem so many of you seem to. I’ve never used SA.",
                    "author": "Layla_Fox2",
                    "id": "fzajuhb",
                    "parent_id": "t1_fza6x4m",
                    "score": 1,
                    "created_utc": 1595763006.0,
                    "replies": [
                        {
                            "body": "What do you use?",
                            "author": "Starflower8888",
                            "id": "fzcfh08",
                            "parent_id": "t1_fzajuhb",
                            "score": 1,
                            "created_utc": 1595801598.0,
                            "replies": [
                                {
                                    "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
                                    "author": "Layla_Fox2",
                                    "id": "fzcjqkh",
                                    "parent_id": "t1_fzcfh08",
                                    "score": 2,
                                    "created_utc": 1595803970.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for that much appreciated",
                                            "author": "Starflower8888",
                                            "id": "fzdn7dn",
                                            "parent_id": "t1_fzcjqkh",
                                            "score": 2,
                                            "created_utc": 1595829690.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                                            "author": "Starflower8888",
                                            "id": "fzdnh75",
                                            "parent_id": "t1_fzcjqkh",
                                            "score": 2,
                                            "created_utc": 1595829924.0,
                                            "replies": [
                                                {
                                                    "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                                                    "author": "Layla_Fox2",
                                                    "id": "fze6mth",
                                                    "parent_id": "t1_fzdnh75",
                                                    "score": 2,
                                                    "created_utc": 1595848833.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you for this information much appreciated 😊",
                                                            "author": "Starflower8888",
                                                            "id": "fzhnfhi",
                                                            "parent_id": "t1_fze6mth",
                                                            "score": 2,
                                                            "created_utc": 1595919481.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz51ks6",
            "parent_id": "t1_fz4752s",
            "score": 14,
            "created_utc": 1595630187.0,
            "replies": [
                {
                    "body": "I would never agree to a day with no sugar. Hell No",
                    "author": "Starflower8888",
                    "id": "fza72f9",
                    "parent_id": "t1_fz51ks6",
                    "score": 2,
                    "created_utc": 1595749656.0,
                    "replies": []
                },
                {
                    "body": "Speakkk🗣 because oh no",
                    "author": null,
                    "id": "fz6hh0b",
                    "parent_id": "t1_fz51ks6",
                    "score": 1,
                    "created_utc": 1595665855.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz51vs3",
                    "parent_id": "t1_fz51ks6",
                    "score": -2,
                    "created_utc": 1595630348.0,
                    "replies": [
                        {
                            "body": "Lol. But you should seriously reconsider asking a woman to give up her whole day to walk away w nothing. That's pretty terrible. She could spend that time working or maybe she's a student and could have spent it studying. A whole day is really asking too much if you are giving nothing.",
                            "author": "clair-cummings",
                            "id": "g2sibbp",
                            "parent_id": "t1_fz51vs3",
                            "score": 2,
                            "created_utc": 1598357086.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g2sjva6",
                                    "parent_id": "t1_g2sibbp",
                                    "score": 1,
                                    "created_utc": 1598358256.0,
                                    "replies": [
                                        {
                                            "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                                            "author": "clair-cummings",
                                            "id": "g2skp73",
                                            "parent_id": "t1_g2sjva6",
                                            "score": 1,
                                            "created_utc": 1598358852.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is great! I feel like SB putting down a long fun day are just looking for money and not interested in enjoying your company.",
            "author": "Miss-Chinaski",
            "id": "fz4f3v4",
            "parent_id": "t1_fz46vdm",
            "score": 0,
            "created_utc": 1595618888.0,
            "replies": []
        },
        {
            "body": "Thats a horrible story and I don't understand why she would sleep w him either.",
            "author": "clair-cummings",
            "id": "g2sinxp",
            "parent_id": "t1_fza7x02",
            "score": 1,
            "created_utc": 1598357358.0,
            "replies": []
        },
        {
            "body": "Yes that’s what pump and dump mean. They are even clever enough to tell the girl they’ll pay her later and never do. This was the plan all along. Straight up lame and deceitful.",
            "author": "RebelInDisguise01",
            "id": "fz3u78d",
            "parent_id": "t1_fz3c6tu",
            "score": 4,
            "created_utc": 1595609120.0,
            "replies": [
                {
                    "body": "I think pump pump-n-dump mostly describes SDs who do actually pay. But only once, and then they bail. So they make the SB believe they are starting an arrangement when really they are being used like an escort.",
                    "author": "SouthernGentSD",
                    "id": "fz3z36b",
                    "parent_id": "t1_fz3u78d",
                    "score": 8,
                    "created_utc": 1595611394.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz40dx2",
                    "parent_id": "t1_fz3u78d",
                    "score": 5,
                    "created_utc": 1595611998.0,
                    "replies": [
                        {
                            "body": "Ok it’s still seems too transactional for my liking but to each their own.",
                            "author": "RebelInDisguise01",
                            "id": "fz4234h",
                            "parent_id": "t1_fz40dx2",
                            "score": 5,
                            "created_utc": 1595612783.0,
                            "replies": [
                                {
                                    "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
                                    "author": "Starflower8888",
                                    "id": "fza7mdz",
                                    "parent_id": "t1_fz4234h",
                                    "score": 1,
                                    "created_utc": 1595750209.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah but when you add in maturity, experience, trickery and deceit a couple of dollars versus free sex don’t match.",
            "author": "RebelInDisguise01",
            "id": "fz3diy8",
            "parent_id": "t1_fz3dcej",
            "score": 7,
            "created_utc": 1595600955.0,
            "replies": [
                {
                    "body": "Looks like I'm getting down voted here, but it's an emotional topic.  Be honest, be cautious.  Make sure your expectations are reasonable.  OP's original topic was the great people he's met and I agree.  If you don't want a physical relationship with an older man, use your message filters so you aren't tempted.",
                    "author": "hal99514",
                    "id": "fz3f0p0",
                    "parent_id": "t1_fz3diy8",
                    "score": 1,
                    "created_utc": 1595601729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah! I'm definitely not an old fart. Most of my farts come from the day before so only one day old",
            "author": "Jdn345",
            "id": "fz3plmh",
            "parent_id": "t1_fz3eb9h",
            "score": 0,
            "created_utc": 1595606947.0,
            "replies": []
        },
        {
            "body": "You come across as a very judgmental person. Maybe it’s because you’re young and inexperienced and I’ll give you that but you aren’t the oracle on life and human behavior or human relationships. People like what they like and that’s just that. It’s nothing wrong with wanting someone older or younger. As long as there are two consenting adults it’s none of our business what they do in their private time.",
            "author": "RebelInDisguise01",
            "id": "fz3e88h",
            "parent_id": "t1_fz3dl0u",
            "score": 8,
            "created_utc": 1595601320.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz3eirp",
                    "parent_id": "t1_fz3e88h",
                    "score": -3,
                    "created_utc": 1595601471.0,
                    "replies": [
                        {
                            "body": "I must have missed what that even means",
                            "author": "Jdn345",
                            "id": "fz3rj1x",
                            "parent_id": "t1_fz3eirp",
                            "score": 1,
                            "created_utc": 1595607859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are more than welcome to share your opinion and it is appreciated. Please tell me who gets the \"weird vibes\"? That has not been my experience. Yes, people look, and some even comment. But 99% of the people we meet when out and about are very friendly and understanding.\n\nBut you miss the bigger point. SB's and SD's contribute to each other in different, unique, and hopefully exciting ways. We should appreciate each other. The differences, age, color, ect. are what make us exciting together.",
            "author": "AFSMSgt",
            "id": "fz3fcmo",
            "parent_id": "t1_fz3dl0u",
            "score": 7,
            "created_utc": 1595601897.0,
            "replies": []
        },
        {
            "body": "The pedo vibe is only in your head. Hence you would not make a good sugar baby. I'm assuming your female anyway. And I myself don't care much what other people think. My SB and myself don't notice an age Gap when we're together and don't even think about it. We get along and understand each other so well that it's uncanny. 3 years and never had an argument about anything. Can't say that about any vanilla relationship I've ever had.",
            "author": "Jdn345",
            "id": "fz3r5d7",
            "parent_id": "t1_fz3dl0u",
            "score": 2,
            "created_utc": 1595607682.0,
            "replies": [
                {
                    "body": "Just because they don’t wanna fuck a self professed “granddaddy” doesn’t mean they won’t be a good sugar baby .",
                    "author": "Driftwould92",
                    "id": "fz44e3h",
                    "parent_id": "t1_fz3r5d7",
                    "score": 0,
                    "created_utc": 1595613856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not the one bloviating about how old grandpas are the best . Lmao a lot of young women won’t have sex with men that old . Just saying .",
            "author": "Driftwould92",
            "id": "fz56sdx",
            "parent_id": "t1_fz4tsrq",
            "score": 2,
            "created_utc": 1595633027.0,
            "replies": []
        },
        {
            "body": "Well you’re not gay I assume",
            "author": "Driftwould92",
            "id": "fz43bsx",
            "parent_id": "t1_fz4239h",
            "score": 1,
            "created_utc": 1595613363.0,
            "replies": [
                {
                    "body": "So serious. You feel the need to downvote anytime someone makes a quip?",
                    "author": "LoftDaddy",
                    "id": "fz43t6k",
                    "parent_id": "t1_fz43bsx",
                    "score": 1,
                    "created_utc": 1595613587.0,
                    "replies": [
                        {
                            "body": "It wasn’t that funny? And I’m not the only person online right now .",
                            "author": "Driftwould92",
                            "id": "fz444dn",
                            "parent_id": "t1_fz43t6k",
                            "score": 0,
                            "created_utc": 1595613731.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha I don't blame you it's too funny 😅",
            "author": "Starflower8888",
            "id": "g1o0uqf",
            "parent_id": "t1_g1mm04z",
            "score": 1,
            "created_utc": 1597530826.0,
            "replies": []
        },
        {
            "body": "Go back to the original poster.    Why do you even look at 30 year olds.   \n\nYes there are a lot of time waters - sb’s and sd’s.   But I found two great sb’s recently.    One doesn’t want money (but lots of gifts and holidays).   The other more about the money as she’s saving for a masters.   Both get lots of sugar.    So there are people out there.   Persevere and be focused on what you are looking for.",
            "author": "brit-sd",
            "id": "fz6ahm1",
            "parent_id": "t1_fz561gl",
            "score": 2,
            "created_utc": 1595658970.0,
            "replies": [
                {
                    "body": "I'm not. They're messaging me... I think until you're wading through 25 messages a day, you can't quite comprehend. Some of you have never been a beautiful women before, and it really shows. (Joke.)",
                    "author": "lara-xo",
                    "id": "fz9rd6s",
                    "parent_id": "t1_fz6ahm1",
                    "score": 2,
                    "created_utc": 1595736523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is POT?",
            "author": "Starflower8888",
            "id": "fz6v0tk",
            "parent_id": "t1_fz561gl",
            "score": 1,
            "created_utc": 1595679428.0,
            "replies": [
                {
                    "body": "Potential sugarbaby or daddy.",
                    "author": "lara-xo",
                    "id": "fz9rk33",
                    "parent_id": "t1_fz6v0tk",
                    "score": 1,
                    "created_utc": 1595736658.0,
                    "replies": [
                        {
                            "body": "Thank you",
                            "author": "Starflower8888",
                            "id": "fza5j6q",
                            "parent_id": "t1_fz9rk33",
                            "score": 1,
                            "created_utc": 1595748155.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ding ding ding. Hit the nail on the head.\nAnd its pretty damn demoralizing:(",
            "author": "clair-cummings",
            "id": "g2sh49s",
            "parent_id": "t1_fz561gl",
            "score": 1,
            "created_utc": 1598356142.0,
            "replies": []
        },
        {
            "body": "not sure why I got a downvote for that but real authentic SD's have a lot to lose when there are so many fake SD's. and yes there are a lot of fake profiles of \"hot students\" trying to scam us.\n\nBTW I'm a younger member, not all of us are like that, I have had a couple of very successful mutually beneficial relationships :)",
            "author": "mtriad",
            "id": "fz6a144",
            "parent_id": "t1_fz65nmk",
            "score": 1,
            "created_utc": 1595658562.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fz6pfef",
            "parent_id": "t1_fz65nmk",
            "score": -1,
            "created_utc": 1595674141.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "fz6pffd",
                    "parent_id": "t1_fz6pfef",
                    "score": 1,
                    "created_utc": 1595674141.0,
                    "replies": []
                },
                {
                    "body": "If you change the number in reference to PPM in your first bullet, to something like $XXX, and reply to this message, I can come back and approve this",
                    "author": "Azurecole",
                    "id": "fz6q23s",
                    "parent_id": "t1_fz6pfef",
                    "score": 0,
                    "created_utc": 1595674783.0,
                    "replies": [
                        {
                            "body": "Done.",
                            "author": "Xivious47",
                            "id": "fz70dnr",
                            "parent_id": "t1_fz6q23s",
                            "score": 1,
                            "created_utc": 1595683651.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That might be why I have not encountered the problem so many of you seem to. I’ve never used SA.",
            "author": "Layla_Fox2",
            "id": "fzajuhb",
            "parent_id": "t1_fza6x4m",
            "score": 1,
            "created_utc": 1595763006.0,
            "replies": [
                {
                    "body": "What do you use?",
                    "author": "Starflower8888",
                    "id": "fzcfh08",
                    "parent_id": "t1_fzajuhb",
                    "score": 1,
                    "created_utc": 1595801598.0,
                    "replies": [
                        {
                            "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
                            "author": "Layla_Fox2",
                            "id": "fzcjqkh",
                            "parent_id": "t1_fzcfh08",
                            "score": 2,
                            "created_utc": 1595803970.0,
                            "replies": [
                                {
                                    "body": "Thank you for that much appreciated",
                                    "author": "Starflower8888",
                                    "id": "fzdn7dn",
                                    "parent_id": "t1_fzcjqkh",
                                    "score": 2,
                                    "created_utc": 1595829690.0,
                                    "replies": []
                                },
                                {
                                    "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                                    "author": "Starflower8888",
                                    "id": "fzdnh75",
                                    "parent_id": "t1_fzcjqkh",
                                    "score": 2,
                                    "created_utc": 1595829924.0,
                                    "replies": [
                                        {
                                            "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                                            "author": "Layla_Fox2",
                                            "id": "fze6mth",
                                            "parent_id": "t1_fzdnh75",
                                            "score": 2,
                                            "created_utc": 1595848833.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for this information much appreciated 😊",
                                                    "author": "Starflower8888",
                                                    "id": "fzhnfhi",
                                                    "parent_id": "t1_fze6mth",
                                                    "score": 2,
                                                    "created_utc": 1595919481.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would never agree to a day with no sugar. Hell No",
            "author": "Starflower8888",
            "id": "fza72f9",
            "parent_id": "t1_fz51ks6",
            "score": 2,
            "created_utc": 1595749656.0,
            "replies": []
        },
        {
            "body": "Speakkk🗣 because oh no",
            "author": null,
            "id": "fz6hh0b",
            "parent_id": "t1_fz51ks6",
            "score": 1,
            "created_utc": 1595665855.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz51vs3",
            "parent_id": "t1_fz51ks6",
            "score": -2,
            "created_utc": 1595630348.0,
            "replies": [
                {
                    "body": "Lol. But you should seriously reconsider asking a woman to give up her whole day to walk away w nothing. That's pretty terrible. She could spend that time working or maybe she's a student and could have spent it studying. A whole day is really asking too much if you are giving nothing.",
                    "author": "clair-cummings",
                    "id": "g2sibbp",
                    "parent_id": "t1_fz51vs3",
                    "score": 2,
                    "created_utc": 1598357086.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g2sjva6",
                            "parent_id": "t1_g2sibbp",
                            "score": 1,
                            "created_utc": 1598358256.0,
                            "replies": [
                                {
                                    "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                                    "author": "clair-cummings",
                                    "id": "g2skp73",
                                    "parent_id": "t1_g2sjva6",
                                    "score": 1,
                                    "created_utc": 1598358852.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think pump pump-n-dump mostly describes SDs who do actually pay. But only once, and then they bail. So they make the SB believe they are starting an arrangement when really they are being used like an escort.",
            "author": "SouthernGentSD",
            "id": "fz3z36b",
            "parent_id": "t1_fz3u78d",
            "score": 8,
            "created_utc": 1595611394.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz40dx2",
            "parent_id": "t1_fz3u78d",
            "score": 5,
            "created_utc": 1595611998.0,
            "replies": [
                {
                    "body": "Ok it’s still seems too transactional for my liking but to each their own.",
                    "author": "RebelInDisguise01",
                    "id": "fz4234h",
                    "parent_id": "t1_fz40dx2",
                    "score": 5,
                    "created_utc": 1595612783.0,
                    "replies": [
                        {
                            "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
                            "author": "Starflower8888",
                            "id": "fza7mdz",
                            "parent_id": "t1_fz4234h",
                            "score": 1,
                            "created_utc": 1595750209.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Looks like I'm getting down voted here, but it's an emotional topic.  Be honest, be cautious.  Make sure your expectations are reasonable.  OP's original topic was the great people he's met and I agree.  If you don't want a physical relationship with an older man, use your message filters so you aren't tempted.",
            "author": "hal99514",
            "id": "fz3f0p0",
            "parent_id": "t1_fz3diy8",
            "score": 1,
            "created_utc": 1595601729.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz3eirp",
            "parent_id": "t1_fz3e88h",
            "score": -3,
            "created_utc": 1595601471.0,
            "replies": [
                {
                    "body": "I must have missed what that even means",
                    "author": "Jdn345",
                    "id": "fz3rj1x",
                    "parent_id": "t1_fz3eirp",
                    "score": 1,
                    "created_utc": 1595607859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just because they don’t wanna fuck a self professed “granddaddy” doesn’t mean they won’t be a good sugar baby .",
            "author": "Driftwould92",
            "id": "fz44e3h",
            "parent_id": "t1_fz3r5d7",
            "score": 0,
            "created_utc": 1595613856.0,
            "replies": []
        },
        {
            "body": "So serious. You feel the need to downvote anytime someone makes a quip?",
            "author": "LoftDaddy",
            "id": "fz43t6k",
            "parent_id": "t1_fz43bsx",
            "score": 1,
            "created_utc": 1595613587.0,
            "replies": [
                {
                    "body": "It wasn’t that funny? And I’m not the only person online right now .",
                    "author": "Driftwould92",
                    "id": "fz444dn",
                    "parent_id": "t1_fz43t6k",
                    "score": 0,
                    "created_utc": 1595613731.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm not. They're messaging me... I think until you're wading through 25 messages a day, you can't quite comprehend. Some of you have never been a beautiful women before, and it really shows. (Joke.)",
            "author": "lara-xo",
            "id": "fz9rd6s",
            "parent_id": "t1_fz6ahm1",
            "score": 2,
            "created_utc": 1595736523.0,
            "replies": []
        },
        {
            "body": "Potential sugarbaby or daddy.",
            "author": "lara-xo",
            "id": "fz9rk33",
            "parent_id": "t1_fz6v0tk",
            "score": 1,
            "created_utc": 1595736658.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Starflower8888",
                    "id": "fza5j6q",
                    "parent_id": "t1_fz9rk33",
                    "score": 1,
                    "created_utc": 1595748155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "fz6pffd",
            "parent_id": "t1_fz6pfef",
            "score": 1,
            "created_utc": 1595674141.0,
            "replies": []
        },
        {
            "body": "If you change the number in reference to PPM in your first bullet, to something like $XXX, and reply to this message, I can come back and approve this",
            "author": "Azurecole",
            "id": "fz6q23s",
            "parent_id": "t1_fz6pfef",
            "score": 0,
            "created_utc": 1595674783.0,
            "replies": [
                {
                    "body": "Done.",
                    "author": "Xivious47",
                    "id": "fz70dnr",
                    "parent_id": "t1_fz6q23s",
                    "score": 1,
                    "created_utc": 1595683651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you use?",
            "author": "Starflower8888",
            "id": "fzcfh08",
            "parent_id": "t1_fzajuhb",
            "score": 1,
            "created_utc": 1595801598.0,
            "replies": [
                {
                    "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
                    "author": "Layla_Fox2",
                    "id": "fzcjqkh",
                    "parent_id": "t1_fzcfh08",
                    "score": 2,
                    "created_utc": 1595803970.0,
                    "replies": [
                        {
                            "body": "Thank you for that much appreciated",
                            "author": "Starflower8888",
                            "id": "fzdn7dn",
                            "parent_id": "t1_fzcjqkh",
                            "score": 2,
                            "created_utc": 1595829690.0,
                            "replies": []
                        },
                        {
                            "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                            "author": "Starflower8888",
                            "id": "fzdnh75",
                            "parent_id": "t1_fzcjqkh",
                            "score": 2,
                            "created_utc": 1595829924.0,
                            "replies": [
                                {
                                    "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                                    "author": "Layla_Fox2",
                                    "id": "fze6mth",
                                    "parent_id": "t1_fzdnh75",
                                    "score": 2,
                                    "created_utc": 1595848833.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for this information much appreciated 😊",
                                            "author": "Starflower8888",
                                            "id": "fzhnfhi",
                                            "parent_id": "t1_fze6mth",
                                            "score": 2,
                                            "created_utc": 1595919481.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol. But you should seriously reconsider asking a woman to give up her whole day to walk away w nothing. That's pretty terrible. She could spend that time working or maybe she's a student and could have spent it studying. A whole day is really asking too much if you are giving nothing.",
            "author": "clair-cummings",
            "id": "g2sibbp",
            "parent_id": "t1_fz51vs3",
            "score": 2,
            "created_utc": 1598357086.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g2sjva6",
                    "parent_id": "t1_g2sibbp",
                    "score": 1,
                    "created_utc": 1598358256.0,
                    "replies": [
                        {
                            "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                            "author": "clair-cummings",
                            "id": "g2skp73",
                            "parent_id": "t1_g2sjva6",
                            "score": 1,
                            "created_utc": 1598358852.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok it’s still seems too transactional for my liking but to each their own.",
            "author": "RebelInDisguise01",
            "id": "fz4234h",
            "parent_id": "t1_fz40dx2",
            "score": 5,
            "created_utc": 1595612783.0,
            "replies": [
                {
                    "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
                    "author": "Starflower8888",
                    "id": "fza7mdz",
                    "parent_id": "t1_fz4234h",
                    "score": 1,
                    "created_utc": 1595750209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I must have missed what that even means",
            "author": "Jdn345",
            "id": "fz3rj1x",
            "parent_id": "t1_fz3eirp",
            "score": 1,
            "created_utc": 1595607859.0,
            "replies": []
        },
        {
            "body": "It wasn’t that funny? And I’m not the only person online right now .",
            "author": "Driftwould92",
            "id": "fz444dn",
            "parent_id": "t1_fz43t6k",
            "score": 0,
            "created_utc": 1595613731.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "Starflower8888",
            "id": "fza5j6q",
            "parent_id": "t1_fz9rk33",
            "score": 1,
            "created_utc": 1595748155.0,
            "replies": []
        },
        {
            "body": "Done.",
            "author": "Xivious47",
            "id": "fz70dnr",
            "parent_id": "t1_fz6q23s",
            "score": 1,
            "created_utc": 1595683651.0,
            "replies": []
        },
        {
            "body": "I’ve been blessed that I’ve never advertised myself as a SB. I found my current SD on Craigslist. Men post on there that they are looking for SBs.",
            "author": "Layla_Fox2",
            "id": "fzcjqkh",
            "parent_id": "t1_fzcfh08",
            "score": 2,
            "created_utc": 1595803970.0,
            "replies": [
                {
                    "body": "Thank you for that much appreciated",
                    "author": "Starflower8888",
                    "id": "fzdn7dn",
                    "parent_id": "t1_fzcjqkh",
                    "score": 2,
                    "created_utc": 1595829690.0,
                    "replies": []
                },
                {
                    "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
                    "author": "Starflower8888",
                    "id": "fzdnh75",
                    "parent_id": "t1_fzcjqkh",
                    "score": 2,
                    "created_utc": 1595829924.0,
                    "replies": [
                        {
                            "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                            "author": "Layla_Fox2",
                            "id": "fze6mth",
                            "parent_id": "t1_fzdnh75",
                            "score": 2,
                            "created_utc": 1595848833.0,
                            "replies": [
                                {
                                    "body": "Thank you for this information much appreciated 😊",
                                    "author": "Starflower8888",
                                    "id": "fzhnfhi",
                                    "parent_id": "t1_fze6mth",
                                    "score": 2,
                                    "created_utc": 1595919481.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2sjva6",
            "parent_id": "t1_g2sibbp",
            "score": 1,
            "created_utc": 1598358256.0,
            "replies": [
                {
                    "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
                    "author": "clair-cummings",
                    "id": "g2skp73",
                    "parent_id": "t1_g2sjva6",
                    "score": 1,
                    "created_utc": 1598358852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Transactional? There is an element of that when you are a SD/SM registered on a sugar dating site?",
            "author": "Starflower8888",
            "id": "fza7mdz",
            "parent_id": "t1_fz4234h",
            "score": 1,
            "created_utc": 1595750209.0,
            "replies": []
        },
        {
            "body": "Thank you for that much appreciated",
            "author": "Starflower8888",
            "id": "fzdn7dn",
            "parent_id": "t1_fzcjqkh",
            "score": 2,
            "created_utc": 1595829690.0,
            "replies": []
        },
        {
            "body": "Can you describe what the app symbol looks like for Craigslist and colour please? I'm in the UK and so many listing popped up so I'm unsure. I'm dying to leave SA",
            "author": "Starflower8888",
            "id": "fzdnh75",
            "parent_id": "t1_fzcjqkh",
            "score": 2,
            "created_utc": 1595829924.0,
            "replies": [
                {
                    "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
                    "author": "Layla_Fox2",
                    "id": "fze6mth",
                    "parent_id": "t1_fzdnh75",
                    "score": 2,
                    "created_utc": 1595848833.0,
                    "replies": [
                        {
                            "body": "Thank you for this information much appreciated 😊",
                            "author": "Starflower8888",
                            "id": "fzhnfhi",
                            "parent_id": "t1_fze6mth",
                            "score": 2,
                            "created_utc": 1595919481.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I misread. Someone above (a SB) said they would never give up a day and not get something out of it too. So my assumption was that you were asking for a full day and giving her nothing. That would not feel right to me. I'd end up feeling like my time was wasted and my energy level would be down/depressed. I am really attracted to the generous side of men. Its not JUST about money (genuine connections are important,) but the money is part of it. I'm glad you do inc that in your M&G. Generous thoughtful men are a godsend.",
            "author": "clair-cummings",
            "id": "g2skp73",
            "parent_id": "t1_g2sjva6",
            "score": 1,
            "created_utc": 1598358852.0,
            "replies": []
        },
        {
            "body": "I use an app called C Plus for Craigslist. It’s purple with a white peace sign. I’ve used that app for everything on Craigslist for many years. There might be a better one out there though. Hope that helps!",
            "author": "Layla_Fox2",
            "id": "fze6mth",
            "parent_id": "t1_fzdnh75",
            "score": 2,
            "created_utc": 1595848833.0,
            "replies": [
                {
                    "body": "Thank you for this information much appreciated 😊",
                    "author": "Starflower8888",
                    "id": "fzhnfhi",
                    "parent_id": "t1_fze6mth",
                    "score": 2,
                    "created_utc": 1595919481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this information much appreciated 😊",
            "author": "Starflower8888",
            "id": "fzhnfhi",
            "parent_id": "t1_fze6mth",
            "score": 2,
            "created_utc": 1595919481.0,
            "replies": []
        }
    ]
}