{
    "title": "What would I say for this length on the sides?",
    "post_id": "cswu2x",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/cswu2x/what_would_i_say_for_this_length_on_the_sides/",
    "author": "IdealisticParrot",
    "body": "",
    "url": "https://i.imgur.com/puDS7Ff.jpg",
    "score": 318,
    "upvote_ratio": 0.96,
    "created_utc": 1566299310.0,
    "num_comments": 39,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It’s a good idea to show pics when getting a new style.",
            "author": "samquamnch",
            "id": "exhayb7",
            "parent_id": "t3_cswu2x",
            "score": 155,
            "created_utc": 1566299397.0,
            "replies": []
        },
        {
            "body": "I don't know where you live but in Germany we do lengths in millimeter and I would guess it's a fade (bottom shortest, gets longer to the top) from maybe 2-3mm at the bottom to maybe 6-9mm at the top of that side. Can't say for sure. Just take the picture to your hair stylist if you wanna be safe.",
            "author": "moahnie",
            "id": "exhh8i5",
            "parent_id": "t3_cswu2x",
            "score": 51,
            "created_utc": 1566305069.0,
            "replies": [
                {
                    "body": "In the US we typically use 1/8\" increments on clippers. Normally the barber attaches a guard to the clippers that ranges from 1/8\" (a #1) to 1\" or more. \n\nTo my eye it looks like a #3 or #4 tapered down to a #1 on the bottom. For most barbers in the US this would be fairly unambiguous language, but it's still best to bring in the picture.",
                    "author": "Tofon",
                    "id": "exhw9oq",
                    "parent_id": "t1_exhh8i5",
                    "score": 26,
                    "created_utc": 1566315627.0,
                    "replies": [
                        {
                            "body": "Agreed, looks like #1 up to maybe a #3 or #4. I'm European but we also use the American clipper sizes generally.",
                            "author": "BluesGuitarMart",
                            "id": "exi6mlh",
                            "parent_id": "t1_exhw9oq",
                            "score": 5,
                            "created_utc": 1566322119.0,
                            "replies": []
                        },
                        {
                            "body": "Oh okay! I think we do have those guards on our clippers. I'm definitely not an expert on the english words for hairstylist language, but we do put things onto the clipper for different lengths, just in millimeter. Without this guard, I can go down to 0.8mm on my clipper I have at home. My guards are doublesided, which makes it easy to go back and forth with lengths. Like one side being a 3mm, other a 4mm and so on. Same process but different measurements I guess? That's nice to know",
                            "author": "moahnie",
                            "id": "exi6ufg",
                            "parent_id": "t1_exhw9oq",
                            "score": 3,
                            "created_utc": 1566322241.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "exhhaej",
                    "parent_id": "t1_exhh8i5",
                    "score": 1,
                    "created_utc": 1566305114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "if the barber is any good, he will be doing these sides with cutter AND scissors. so you don't really need to know anything about the lengths. just show him this picture.\n\nFirst thing the proper barber would do is cut your hair to similar lengths and then ask you if you like it or do you prefer shorter and shorter overall or just shorter at the top or at the bottom or etc.\n\nbut you need to know those good barbers; so go ask around for recommendations. if must, go to the women's barber, but be beware, some of them are not good with the cutter in terms of getting the fade etc. but i think generally some good female only barbers could cut this style easily.",
            "author": "jarojajan",
            "id": "exhz959",
            "parent_id": "t3_cswu2x",
            "score": 7,
            "created_utc": 1566317598.0,
            "replies": [
                {
                    "body": "My (female) turkish colleague back then was AMAZING at these kind of haircuts and she was a \"simple\" hairdresser. Barbers do great jobs, but a common hairdresser can do just fine as well. In Germany, it's often the turkish hairdressers that do an amazing job with cuts and beards. Maybe OP can look for turkish hairsalons but I can only talk about my own experience in the country I worked in as a hairdresser.  \n\n\nNowadays, with the barber trend, there are a lot of barbershops to choose from which makes it difficult to find a proper one sometimes.",
                    "author": "moahnie",
                    "id": "exi7f5c",
                    "parent_id": "t1_exhz959",
                    "score": 2,
                    "created_utc": 1566322568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "exhl948",
            "parent_id": "t3_cswu2x",
            "score": 247,
            "created_utc": 1566308068.0,
            "replies": [
                {
                    "body": "calm down big mod man, he's just asking for what number it would be",
                    "author": "AyeAye_Kane",
                    "id": "exi9pjd",
                    "parent_id": "t1_exhl948",
                    "score": 16,
                    "created_utc": 1566323883.0,
                    "replies": []
                },
                {
                    "body": "However much I do appreciate the reply, I've shown barbers a picture before and they seem to have just ignored it and asked what I want instead, hence the post. \n\nApologies if asking for advice about male hair is against the rules or somewhat offends your pomposity in a subreddit dedicated to giving males advice about their hair, but all that was needed was a reply stating what number to ask for. \n\nIf these posts asking what to say irritate you that much then I suggest you leave the moderator position and give it to\nu/moahnie, which took the time and effort to reply not only with civility, but also give an actual answer to my question.",
                    "author": "IdealisticParrot",
                    "id": "exhn5r5",
                    "parent_id": "t1_exhl948",
                    "score": 91,
                    "created_utc": 1566309437.0,
                    "replies": [
                        {
                            "body": "Hey thanks! I don't wanna be a moderator though :P \n\nI find it weird that barbers ignore pictures, as a hairdresser myself, I love when people bring in photos so I can immediately see and think about what I have to do. I guess barbers work differently. I did cut a fair amount of male hair, most of them were regular customers who gave me their usual \"6mm sides, top longer\" talk but new customers either brought in photos or had a consultation about the haircut. Every hair salon/barbershop is different, it's always good to find and keep a regular barber that knows what to do with your hair whenever you come in :)",
                            "author": "moahnie",
                            "id": "exhond8",
                            "parent_id": "t1_exhn5r5",
                            "score": 35,
                            "created_utc": 1566310488.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah it legit pisses me off when people say \"just show the picture or get a new barber\". \n\nLike some of the people on here don't understand how fucking difficult it can be to find a barber that can actually go off a picture, or wants to. Especially if you're in a smaller area with limited barbers. I've been to a number of different barber shops around me, and been through like 10 or 11 barbers. And a few of them have been cutting hair for around 20 years. Guess how many actually went even remotely close to the picture? Fucking 1. And when I asked that guy to shorten the top up a bit to be closer to the picture, the fucker all but buzzed the rest of the hair on the top of my head off.\n\nThe rest don't even do an interpretation of the picture. They just do what they think would \"look better\" than what I showed them.\n\nWith that said, I got extremely lucky that a guy I work with went to barbering school and beauty school and actually has done exactly what I wanted with my hair for the last 6 months. He's the only one I trust to cut my hair now and I will drive however long it takes to get to him so I don't have to go through this bullshit process again. \n\nSorry for the rant. It just frustrates me beyond belief.",
                            "author": "MykkyM",
                            "id": "exi9g7k",
                            "parent_id": "t1_exhn5r5",
                            "score": 12,
                            "created_utc": 1566323731.0,
                            "replies": [
                                {
                                    "body": "I'm so sorry this happened to you :( I always try to listen carefully about what the client wants, I know that hairstylist language is more technical than a normal client using their own words to describe what they want, but being technical doesn't mean you just do whatever the hell you think is correct and ignoring the client's wishes. I wish hairdressers/barbers would just do what the client wants or at least make it look the closest to their idea as possible.   \n\n\nI was AFRAID of hairdressers because whenever I said \"just 1-2cm off the split ends\", I ended up with shoulder length hair. Then I became a hairdresser and realized how difficult it can be to understand what a person wants. But people just need to listen and stop doing what their hair/beauty school taught them is \"correct\". I learned in a hair salon that wasn't very up to date with modern cuts and I learned the \"most commonly asked\" haircuts from regular customers. But these haircuts do not apply to every single person. That's how mistakes happen as well.  \n\n\nI'm glad you found someone you can trust now! Once you have someone, never let them go :P",
                                    "author": "moahnie",
                                    "id": "exkeg8c",
                                    "parent_id": "t1_exi9g7k",
                                    "score": 1,
                                    "created_utc": 1566386601.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "exhnpml",
                            "parent_id": "t1_exhn5r5",
                            "score": -59,
                            "created_utc": 1566309831.0,
                            "replies": [
                                {
                                    "body": "Fully agree with OP on this one. I like the ole timey voice but it did come off as condescending. It is a male hair advice sub and all that.",
                                    "author": null,
                                    "id": "exhq6ae",
                                    "parent_id": "t1_exhnpml",
                                    "score": 52,
                                    "created_utc": 1566311524.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "exhrvqu",
                                            "parent_id": "t1_exhq6ae",
                                            "score": -29,
                                            "created_utc": 1566312667.0,
                                            "replies": [
                                                {
                                                    "body": "The fact that you had to tell OP that you weren't intending to be insulting should be enough of a hint as to how him and at least me read your comment.\n\nOP asked what to ask for the length on the sides. He didn't ask should he show the picture to the barber, so if you don't know the length of the sides because you're not an expert then just leave it at that. \n\nYou might not have directly said anything negative about OP but by being Captain obvious you patronised him like he didn't think of showing the picture himself. It wasn't what he was asking!",
                                                    "author": null,
                                                    "id": "exht8kq",
                                                    "parent_id": "t1_exhrvqu",
                                                    "score": 31,
                                                    "created_utc": 1566313577.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "No you’re just condescending. How stupid do you think OP is, I think if someone gave him the measurements he’d be able to look up and understand what he’s talking about. Obviously you’re not an expert, so don’t comment if you’re going to be a dipshit. Also I agree with OP, your job as a moderator isn’t to fuck with people and role play.",
                                                    "author": "_Radds_",
                                                    "id": "exhy2dx",
                                                    "parent_id": "t1_exhrvqu",
                                                    "score": 18,
                                                    "created_utc": 1566316819.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah no you totally intended it. You just didn’t expect backlash so you’re walking it back. Oof",
                                    "author": "EATING--GARBAGE",
                                    "id": "exijenw",
                                    "parent_id": "t1_exhnpml",
                                    "score": 8,
                                    "created_utc": 1566329541.0,
                                    "replies": []
                                },
                                {
                                    "body": "Reddit admins are usually socially inept losers but you’re particularly bad. dude just had a question lol",
                                    "author": "hk47isreadytoserve",
                                    "id": "exi9ku2",
                                    "parent_id": "t1_exhnpml",
                                    "score": 9,
                                    "created_utc": 1566323806.0,
                                    "replies": []
                                },
                                {
                                    "body": "You totally came off like a jerk. OP 💯 got it right. Whether you meant to or not, you did. I'd look inward and figure it out.",
                                    "author": "FaulknerGently",
                                    "id": "exi1i64",
                                    "parent_id": "t1_exhnpml",
                                    "score": 11,
                                    "created_utc": 1566319046.0,
                                    "replies": []
                                },
                                {
                                    "body": "I thought it was hilarious. Enjoyed it from beginning to end.",
                                    "author": "rafaelescalona",
                                    "id": "exida4f",
                                    "parent_id": "t1_exhnpml",
                                    "score": -5,
                                    "created_utc": 1566325965.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sounds like you're not going to a barber.",
                            "author": "BlatantVandalism",
                            "id": "exhsqs5",
                            "parent_id": "t1_exhn5r5",
                            "score": -9,
                            "created_utc": 1566313243.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's big brain time",
                    "author": "osrsthief",
                    "id": "exhxeri",
                    "parent_id": "t1_exhl948",
                    "score": 8,
                    "created_utc": 1566316389.0,
                    "replies": []
                },
                {
                    "body": "You have a good point.\nHowever, you could have probably worded that in a less aggressive way and gotten better responses, I think.",
                    "author": "uhh-frost",
                    "id": "exi4h1p",
                    "parent_id": "t1_exhl948",
                    "score": 3,
                    "created_utc": 1566320886.0,
                    "replies": []
                },
                {
                    "body": "Why you being a dick in a sub you are supposed to help?",
                    "author": "Bigmachingon",
                    "id": "exjdj18",
                    "parent_id": "t1_exhl948",
                    "score": 2,
                    "created_utc": 1566347721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also,how would slick that top part back?  Don't want it to look wet though,I was looking for a matte finish",
            "author": "TheCaptainUnderwear",
            "id": "exifrp8",
            "parent_id": "t3_cswu2x",
            "score": 4,
            "created_utc": 1566327413.0,
            "replies": [
                {
                    "body": "You kinda answered your own question there, anything with a matte finish :) Gels often look wet/shiny, I've worked with matte waxes that gave it a good hold.",
                    "author": "moahnie",
                    "id": "exkepje",
                    "parent_id": "t1_exifrp8",
                    "score": 1,
                    "created_utc": 1566386879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How do you get your hair like that? I’ve been trying to shape mine like that but it just does do it exactly like that.",
            "author": "8TheKingPin8",
            "id": "exhzh4h",
            "parent_id": "t3_cswu2x",
            "score": 5,
            "created_utc": 1566317743.0,
            "replies": [
                {
                    "body": "The top hair might actually be blowdried and fixated with hairspray or wax but it's hard to tell. Judging from the photo, it looks like a professional photoshoot kind of thing so that's why I thought of it being blowdried.",
                    "author": "moahnie",
                    "id": "exi7lce",
                    "parent_id": "t1_exhzh4h",
                    "score": 3,
                    "created_utc": 1566322668.0,
                    "replies": []
                },
                {
                    "body": "if you want spiked hair, go for styling clay. if you have curly hair and want it flattened, go for styling strong gels and foams. you have also lots of products just for certain look, to\nget volume from thin hair etc.\nagain, consult your barber or hairdresser.\n\nalso, there lots of youtube channels for men grooming, Beardbrand and Slikhaar TV so watch those the see the styles you like and the products they use",
                    "author": "jarojajan",
                    "id": "exil0hi",
                    "parent_id": "t1_exhzh4h",
                    "score": 1,
                    "created_utc": 1566330468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I suspect alot of us have this style.😅\nI just tell my guy to do a mid-fade, and keep the top.",
            "author": "ZeroGravityBurnsRed",
            "id": "exi01wp",
            "parent_id": "t3_cswu2x",
            "score": 3,
            "created_utc": 1566318113.0,
            "replies": []
        },
        {
            "body": "Its a undercut with a 1 to 3 fade on the sides, just show them the picture and say you want a fade like that, now you could get an undercut or a combover",
            "author": "titaniumsack",
            "id": "exhstq0",
            "parent_id": "t3_cswu2x",
            "score": 2,
            "created_utc": 1566313299.0,
            "replies": []
        },
        {
            "body": "That’s a bad blend but that is a one blended into a two or a three",
            "author": null,
            "id": "exj2tq5",
            "parent_id": "t3_cswu2x",
            "score": 2,
            "created_utc": 1566340766.0,
            "replies": []
        },
        {
            "body": "I wouldn't try to describe it, I would show them the picture and get the stylist's opinion on what they can do with your hair.",
            "author": "ANAXA-XXVII",
            "id": "exjjlu8",
            "parent_id": "t3_cswu2x",
            "score": 2,
            "created_utc": 1566352093.0,
            "replies": []
        },
        {
            "body": "That length is what I get when I ask for 2 on the sides.",
            "author": "HuffinJBW",
            "id": "exhpk5b",
            "parent_id": "t3_cswu2x",
            "score": 3,
            "created_utc": 1566311108.0,
            "replies": []
        },
        {
            "body": "The real question is how the fuck you achieve this type of messy side comb? Lol",
            "author": "maximilious",
            "id": "exhyx7s",
            "parent_id": "t3_cswu2x",
            "score": 1,
            "created_utc": 1566317380.0,
            "replies": []
        },
        {
            "body": "I have to say this is a hard cut to maintain.",
            "author": "guitardude_04",
            "id": "exi6md8",
            "parent_id": "t3_cswu2x",
            "score": 1,
            "created_utc": 1566322115.0,
            "replies": []
        },
        {
            "body": "Fade from a 1 to a 3",
            "author": "Obi-WanPierogi",
            "id": "exjumte",
            "parent_id": "t3_cswu2x",
            "score": 1,
            "created_utc": 1566361015.0,
            "replies": []
        },
        {
            "body": "just fucking show them the damn picture",
            "author": "Justify_87",
            "id": "exi8ia4",
            "parent_id": "t3_cswu2x",
            "score": -8,
            "created_utc": 1566323188.0,
            "replies": [
                {
                    "body": "What's the point of this subreddit if every time someone asks a question they get a bunch of angry-ass \"JUST SHOW EM!\" comments? I get it, \"show them the picture\" is a golden nugget when it comes to hair advice, especially here, but some folks like to ask questions and research BEFORE heading to their barber so when the barber eventually asks questions they are at least somewhat knowledgeable about what they want. It's an advice subreddit, if you're going to bother commenting then stop being pissy about having to give people advice.",
                    "author": "Wolf5090",
                    "id": "exikkhq",
                    "parent_id": "t1_exi8ia4",
                    "score": 3,
                    "created_utc": 1566330215.0,
                    "replies": [
                        {
                            "body": "Just fucking show them the damn picture",
                            "author": "Justify_87",
                            "id": "exiqwvb",
                            "parent_id": "t1_exikkhq",
                            "score": -3,
                            "created_utc": 1566333803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In the US we typically use 1/8\" increments on clippers. Normally the barber attaches a guard to the clippers that ranges from 1/8\" (a #1) to 1\" or more. \n\nTo my eye it looks like a #3 or #4 tapered down to a #1 on the bottom. For most barbers in the US this would be fairly unambiguous language, but it's still best to bring in the picture.",
            "author": "Tofon",
            "id": "exhw9oq",
            "parent_id": "t1_exhh8i5",
            "score": 26,
            "created_utc": 1566315627.0,
            "replies": [
                {
                    "body": "Agreed, looks like #1 up to maybe a #3 or #4. I'm European but we also use the American clipper sizes generally.",
                    "author": "BluesGuitarMart",
                    "id": "exi6mlh",
                    "parent_id": "t1_exhw9oq",
                    "score": 5,
                    "created_utc": 1566322119.0,
                    "replies": []
                },
                {
                    "body": "Oh okay! I think we do have those guards on our clippers. I'm definitely not an expert on the english words for hairstylist language, but we do put things onto the clipper for different lengths, just in millimeter. Without this guard, I can go down to 0.8mm on my clipper I have at home. My guards are doublesided, which makes it easy to go back and forth with lengths. Like one side being a 3mm, other a 4mm and so on. Same process but different measurements I guess? That's nice to know",
                    "author": "moahnie",
                    "id": "exi6ufg",
                    "parent_id": "t1_exhw9oq",
                    "score": 3,
                    "created_utc": 1566322241.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "exhhaej",
            "parent_id": "t1_exhh8i5",
            "score": 1,
            "created_utc": 1566305114.0,
            "replies": []
        },
        {
            "body": "My (female) turkish colleague back then was AMAZING at these kind of haircuts and she was a \"simple\" hairdresser. Barbers do great jobs, but a common hairdresser can do just fine as well. In Germany, it's often the turkish hairdressers that do an amazing job with cuts and beards. Maybe OP can look for turkish hairsalons but I can only talk about my own experience in the country I worked in as a hairdresser.  \n\n\nNowadays, with the barber trend, there are a lot of barbershops to choose from which makes it difficult to find a proper one sometimes.",
            "author": "moahnie",
            "id": "exi7f5c",
            "parent_id": "t1_exhz959",
            "score": 2,
            "created_utc": 1566322568.0,
            "replies": []
        },
        {
            "body": "calm down big mod man, he's just asking for what number it would be",
            "author": "AyeAye_Kane",
            "id": "exi9pjd",
            "parent_id": "t1_exhl948",
            "score": 16,
            "created_utc": 1566323883.0,
            "replies": []
        },
        {
            "body": "However much I do appreciate the reply, I've shown barbers a picture before and they seem to have just ignored it and asked what I want instead, hence the post. \n\nApologies if asking for advice about male hair is against the rules or somewhat offends your pomposity in a subreddit dedicated to giving males advice about their hair, but all that was needed was a reply stating what number to ask for. \n\nIf these posts asking what to say irritate you that much then I suggest you leave the moderator position and give it to\nu/moahnie, which took the time and effort to reply not only with civility, but also give an actual answer to my question.",
            "author": "IdealisticParrot",
            "id": "exhn5r5",
            "parent_id": "t1_exhl948",
            "score": 91,
            "created_utc": 1566309437.0,
            "replies": [
                {
                    "body": "Hey thanks! I don't wanna be a moderator though :P \n\nI find it weird that barbers ignore pictures, as a hairdresser myself, I love when people bring in photos so I can immediately see and think about what I have to do. I guess barbers work differently. I did cut a fair amount of male hair, most of them were regular customers who gave me their usual \"6mm sides, top longer\" talk but new customers either brought in photos or had a consultation about the haircut. Every hair salon/barbershop is different, it's always good to find and keep a regular barber that knows what to do with your hair whenever you come in :)",
                    "author": "moahnie",
                    "id": "exhond8",
                    "parent_id": "t1_exhn5r5",
                    "score": 35,
                    "created_utc": 1566310488.0,
                    "replies": []
                },
                {
                    "body": "Yeah it legit pisses me off when people say \"just show the picture or get a new barber\". \n\nLike some of the people on here don't understand how fucking difficult it can be to find a barber that can actually go off a picture, or wants to. Especially if you're in a smaller area with limited barbers. I've been to a number of different barber shops around me, and been through like 10 or 11 barbers. And a few of them have been cutting hair for around 20 years. Guess how many actually went even remotely close to the picture? Fucking 1. And when I asked that guy to shorten the top up a bit to be closer to the picture, the fucker all but buzzed the rest of the hair on the top of my head off.\n\nThe rest don't even do an interpretation of the picture. They just do what they think would \"look better\" than what I showed them.\n\nWith that said, I got extremely lucky that a guy I work with went to barbering school and beauty school and actually has done exactly what I wanted with my hair for the last 6 months. He's the only one I trust to cut my hair now and I will drive however long it takes to get to him so I don't have to go through this bullshit process again. \n\nSorry for the rant. It just frustrates me beyond belief.",
                    "author": "MykkyM",
                    "id": "exi9g7k",
                    "parent_id": "t1_exhn5r5",
                    "score": 12,
                    "created_utc": 1566323731.0,
                    "replies": [
                        {
                            "body": "I'm so sorry this happened to you :( I always try to listen carefully about what the client wants, I know that hairstylist language is more technical than a normal client using their own words to describe what they want, but being technical doesn't mean you just do whatever the hell you think is correct and ignoring the client's wishes. I wish hairdressers/barbers would just do what the client wants or at least make it look the closest to their idea as possible.   \n\n\nI was AFRAID of hairdressers because whenever I said \"just 1-2cm off the split ends\", I ended up with shoulder length hair. Then I became a hairdresser and realized how difficult it can be to understand what a person wants. But people just need to listen and stop doing what their hair/beauty school taught them is \"correct\". I learned in a hair salon that wasn't very up to date with modern cuts and I learned the \"most commonly asked\" haircuts from regular customers. But these haircuts do not apply to every single person. That's how mistakes happen as well.  \n\n\nI'm glad you found someone you can trust now! Once you have someone, never let them go :P",
                            "author": "moahnie",
                            "id": "exkeg8c",
                            "parent_id": "t1_exi9g7k",
                            "score": 1,
                            "created_utc": 1566386601.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "exhnpml",
                    "parent_id": "t1_exhn5r5",
                    "score": -59,
                    "created_utc": 1566309831.0,
                    "replies": [
                        {
                            "body": "Fully agree with OP on this one. I like the ole timey voice but it did come off as condescending. It is a male hair advice sub and all that.",
                            "author": null,
                            "id": "exhq6ae",
                            "parent_id": "t1_exhnpml",
                            "score": 52,
                            "created_utc": 1566311524.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "exhrvqu",
                                    "parent_id": "t1_exhq6ae",
                                    "score": -29,
                                    "created_utc": 1566312667.0,
                                    "replies": [
                                        {
                                            "body": "The fact that you had to tell OP that you weren't intending to be insulting should be enough of a hint as to how him and at least me read your comment.\n\nOP asked what to ask for the length on the sides. He didn't ask should he show the picture to the barber, so if you don't know the length of the sides because you're not an expert then just leave it at that. \n\nYou might not have directly said anything negative about OP but by being Captain obvious you patronised him like he didn't think of showing the picture himself. It wasn't what he was asking!",
                                            "author": null,
                                            "id": "exht8kq",
                                            "parent_id": "t1_exhrvqu",
                                            "score": 31,
                                            "created_utc": 1566313577.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "No you’re just condescending. How stupid do you think OP is, I think if someone gave him the measurements he’d be able to look up and understand what he’s talking about. Obviously you’re not an expert, so don’t comment if you’re going to be a dipshit. Also I agree with OP, your job as a moderator isn’t to fuck with people and role play.",
                                            "author": "_Radds_",
                                            "id": "exhy2dx",
                                            "parent_id": "t1_exhrvqu",
                                            "score": 18,
                                            "created_utc": 1566316819.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah no you totally intended it. You just didn’t expect backlash so you’re walking it back. Oof",
                            "author": "EATING--GARBAGE",
                            "id": "exijenw",
                            "parent_id": "t1_exhnpml",
                            "score": 8,
                            "created_utc": 1566329541.0,
                            "replies": []
                        },
                        {
                            "body": "Reddit admins are usually socially inept losers but you’re particularly bad. dude just had a question lol",
                            "author": "hk47isreadytoserve",
                            "id": "exi9ku2",
                            "parent_id": "t1_exhnpml",
                            "score": 9,
                            "created_utc": 1566323806.0,
                            "replies": []
                        },
                        {
                            "body": "You totally came off like a jerk. OP 💯 got it right. Whether you meant to or not, you did. I'd look inward and figure it out.",
                            "author": "FaulknerGently",
                            "id": "exi1i64",
                            "parent_id": "t1_exhnpml",
                            "score": 11,
                            "created_utc": 1566319046.0,
                            "replies": []
                        },
                        {
                            "body": "I thought it was hilarious. Enjoyed it from beginning to end.",
                            "author": "rafaelescalona",
                            "id": "exida4f",
                            "parent_id": "t1_exhnpml",
                            "score": -5,
                            "created_utc": 1566325965.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sounds like you're not going to a barber.",
                    "author": "BlatantVandalism",
                    "id": "exhsqs5",
                    "parent_id": "t1_exhn5r5",
                    "score": -9,
                    "created_utc": 1566313243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's big brain time",
            "author": "osrsthief",
            "id": "exhxeri",
            "parent_id": "t1_exhl948",
            "score": 8,
            "created_utc": 1566316389.0,
            "replies": []
        },
        {
            "body": "You have a good point.\nHowever, you could have probably worded that in a less aggressive way and gotten better responses, I think.",
            "author": "uhh-frost",
            "id": "exi4h1p",
            "parent_id": "t1_exhl948",
            "score": 3,
            "created_utc": 1566320886.0,
            "replies": []
        },
        {
            "body": "Why you being a dick in a sub you are supposed to help?",
            "author": "Bigmachingon",
            "id": "exjdj18",
            "parent_id": "t1_exhl948",
            "score": 2,
            "created_utc": 1566347721.0,
            "replies": []
        },
        {
            "body": "You kinda answered your own question there, anything with a matte finish :) Gels often look wet/shiny, I've worked with matte waxes that gave it a good hold.",
            "author": "moahnie",
            "id": "exkepje",
            "parent_id": "t1_exifrp8",
            "score": 1,
            "created_utc": 1566386879.0,
            "replies": []
        },
        {
            "body": "The top hair might actually be blowdried and fixated with hairspray or wax but it's hard to tell. Judging from the photo, it looks like a professional photoshoot kind of thing so that's why I thought of it being blowdried.",
            "author": "moahnie",
            "id": "exi7lce",
            "parent_id": "t1_exhzh4h",
            "score": 3,
            "created_utc": 1566322668.0,
            "replies": []
        },
        {
            "body": "if you want spiked hair, go for styling clay. if you have curly hair and want it flattened, go for styling strong gels and foams. you have also lots of products just for certain look, to\nget volume from thin hair etc.\nagain, consult your barber or hairdresser.\n\nalso, there lots of youtube channels for men grooming, Beardbrand and Slikhaar TV so watch those the see the styles you like and the products they use",
            "author": "jarojajan",
            "id": "exil0hi",
            "parent_id": "t1_exhzh4h",
            "score": 1,
            "created_utc": 1566330468.0,
            "replies": []
        },
        {
            "body": "What's the point of this subreddit if every time someone asks a question they get a bunch of angry-ass \"JUST SHOW EM!\" comments? I get it, \"show them the picture\" is a golden nugget when it comes to hair advice, especially here, but some folks like to ask questions and research BEFORE heading to their barber so when the barber eventually asks questions they are at least somewhat knowledgeable about what they want. It's an advice subreddit, if you're going to bother commenting then stop being pissy about having to give people advice.",
            "author": "Wolf5090",
            "id": "exikkhq",
            "parent_id": "t1_exi8ia4",
            "score": 3,
            "created_utc": 1566330215.0,
            "replies": [
                {
                    "body": "Just fucking show them the damn picture",
                    "author": "Justify_87",
                    "id": "exiqwvb",
                    "parent_id": "t1_exikkhq",
                    "score": -3,
                    "created_utc": 1566333803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed, looks like #1 up to maybe a #3 or #4. I'm European but we also use the American clipper sizes generally.",
            "author": "BluesGuitarMart",
            "id": "exi6mlh",
            "parent_id": "t1_exhw9oq",
            "score": 5,
            "created_utc": 1566322119.0,
            "replies": []
        },
        {
            "body": "Oh okay! I think we do have those guards on our clippers. I'm definitely not an expert on the english words for hairstylist language, but we do put things onto the clipper for different lengths, just in millimeter. Without this guard, I can go down to 0.8mm on my clipper I have at home. My guards are doublesided, which makes it easy to go back and forth with lengths. Like one side being a 3mm, other a 4mm and so on. Same process but different measurements I guess? That's nice to know",
            "author": "moahnie",
            "id": "exi6ufg",
            "parent_id": "t1_exhw9oq",
            "score": 3,
            "created_utc": 1566322241.0,
            "replies": []
        },
        {
            "body": "Hey thanks! I don't wanna be a moderator though :P \n\nI find it weird that barbers ignore pictures, as a hairdresser myself, I love when people bring in photos so I can immediately see and think about what I have to do. I guess barbers work differently. I did cut a fair amount of male hair, most of them were regular customers who gave me their usual \"6mm sides, top longer\" talk but new customers either brought in photos or had a consultation about the haircut. Every hair salon/barbershop is different, it's always good to find and keep a regular barber that knows what to do with your hair whenever you come in :)",
            "author": "moahnie",
            "id": "exhond8",
            "parent_id": "t1_exhn5r5",
            "score": 35,
            "created_utc": 1566310488.0,
            "replies": []
        },
        {
            "body": "Yeah it legit pisses me off when people say \"just show the picture or get a new barber\". \n\nLike some of the people on here don't understand how fucking difficult it can be to find a barber that can actually go off a picture, or wants to. Especially if you're in a smaller area with limited barbers. I've been to a number of different barber shops around me, and been through like 10 or 11 barbers. And a few of them have been cutting hair for around 20 years. Guess how many actually went even remotely close to the picture? Fucking 1. And when I asked that guy to shorten the top up a bit to be closer to the picture, the fucker all but buzzed the rest of the hair on the top of my head off.\n\nThe rest don't even do an interpretation of the picture. They just do what they think would \"look better\" than what I showed them.\n\nWith that said, I got extremely lucky that a guy I work with went to barbering school and beauty school and actually has done exactly what I wanted with my hair for the last 6 months. He's the only one I trust to cut my hair now and I will drive however long it takes to get to him so I don't have to go through this bullshit process again. \n\nSorry for the rant. It just frustrates me beyond belief.",
            "author": "MykkyM",
            "id": "exi9g7k",
            "parent_id": "t1_exhn5r5",
            "score": 12,
            "created_utc": 1566323731.0,
            "replies": [
                {
                    "body": "I'm so sorry this happened to you :( I always try to listen carefully about what the client wants, I know that hairstylist language is more technical than a normal client using their own words to describe what they want, but being technical doesn't mean you just do whatever the hell you think is correct and ignoring the client's wishes. I wish hairdressers/barbers would just do what the client wants or at least make it look the closest to their idea as possible.   \n\n\nI was AFRAID of hairdressers because whenever I said \"just 1-2cm off the split ends\", I ended up with shoulder length hair. Then I became a hairdresser and realized how difficult it can be to understand what a person wants. But people just need to listen and stop doing what their hair/beauty school taught them is \"correct\". I learned in a hair salon that wasn't very up to date with modern cuts and I learned the \"most commonly asked\" haircuts from regular customers. But these haircuts do not apply to every single person. That's how mistakes happen as well.  \n\n\nI'm glad you found someone you can trust now! Once you have someone, never let them go :P",
                    "author": "moahnie",
                    "id": "exkeg8c",
                    "parent_id": "t1_exi9g7k",
                    "score": 1,
                    "created_utc": 1566386601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "exhnpml",
            "parent_id": "t1_exhn5r5",
            "score": -59,
            "created_utc": 1566309831.0,
            "replies": [
                {
                    "body": "Fully agree with OP on this one. I like the ole timey voice but it did come off as condescending. It is a male hair advice sub and all that.",
                    "author": null,
                    "id": "exhq6ae",
                    "parent_id": "t1_exhnpml",
                    "score": 52,
                    "created_utc": 1566311524.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "exhrvqu",
                            "parent_id": "t1_exhq6ae",
                            "score": -29,
                            "created_utc": 1566312667.0,
                            "replies": [
                                {
                                    "body": "The fact that you had to tell OP that you weren't intending to be insulting should be enough of a hint as to how him and at least me read your comment.\n\nOP asked what to ask for the length on the sides. He didn't ask should he show the picture to the barber, so if you don't know the length of the sides because you're not an expert then just leave it at that. \n\nYou might not have directly said anything negative about OP but by being Captain obvious you patronised him like he didn't think of showing the picture himself. It wasn't what he was asking!",
                                    "author": null,
                                    "id": "exht8kq",
                                    "parent_id": "t1_exhrvqu",
                                    "score": 31,
                                    "created_utc": 1566313577.0,
                                    "replies": []
                                },
                                {
                                    "body": "No you’re just condescending. How stupid do you think OP is, I think if someone gave him the measurements he’d be able to look up and understand what he’s talking about. Obviously you’re not an expert, so don’t comment if you’re going to be a dipshit. Also I agree with OP, your job as a moderator isn’t to fuck with people and role play.",
                                    "author": "_Radds_",
                                    "id": "exhy2dx",
                                    "parent_id": "t1_exhrvqu",
                                    "score": 18,
                                    "created_utc": 1566316819.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah no you totally intended it. You just didn’t expect backlash so you’re walking it back. Oof",
                    "author": "EATING--GARBAGE",
                    "id": "exijenw",
                    "parent_id": "t1_exhnpml",
                    "score": 8,
                    "created_utc": 1566329541.0,
                    "replies": []
                },
                {
                    "body": "Reddit admins are usually socially inept losers but you’re particularly bad. dude just had a question lol",
                    "author": "hk47isreadytoserve",
                    "id": "exi9ku2",
                    "parent_id": "t1_exhnpml",
                    "score": 9,
                    "created_utc": 1566323806.0,
                    "replies": []
                },
                {
                    "body": "You totally came off like a jerk. OP 💯 got it right. Whether you meant to or not, you did. I'd look inward and figure it out.",
                    "author": "FaulknerGently",
                    "id": "exi1i64",
                    "parent_id": "t1_exhnpml",
                    "score": 11,
                    "created_utc": 1566319046.0,
                    "replies": []
                },
                {
                    "body": "I thought it was hilarious. Enjoyed it from beginning to end.",
                    "author": "rafaelescalona",
                    "id": "exida4f",
                    "parent_id": "t1_exhnpml",
                    "score": -5,
                    "created_utc": 1566325965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you're not going to a barber.",
            "author": "BlatantVandalism",
            "id": "exhsqs5",
            "parent_id": "t1_exhn5r5",
            "score": -9,
            "created_utc": 1566313243.0,
            "replies": []
        },
        {
            "body": "Just fucking show them the damn picture",
            "author": "Justify_87",
            "id": "exiqwvb",
            "parent_id": "t1_exikkhq",
            "score": -3,
            "created_utc": 1566333803.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you :( I always try to listen carefully about what the client wants, I know that hairstylist language is more technical than a normal client using their own words to describe what they want, but being technical doesn't mean you just do whatever the hell you think is correct and ignoring the client's wishes. I wish hairdressers/barbers would just do what the client wants or at least make it look the closest to their idea as possible.   \n\n\nI was AFRAID of hairdressers because whenever I said \"just 1-2cm off the split ends\", I ended up with shoulder length hair. Then I became a hairdresser and realized how difficult it can be to understand what a person wants. But people just need to listen and stop doing what their hair/beauty school taught them is \"correct\". I learned in a hair salon that wasn't very up to date with modern cuts and I learned the \"most commonly asked\" haircuts from regular customers. But these haircuts do not apply to every single person. That's how mistakes happen as well.  \n\n\nI'm glad you found someone you can trust now! Once you have someone, never let them go :P",
            "author": "moahnie",
            "id": "exkeg8c",
            "parent_id": "t1_exi9g7k",
            "score": 1,
            "created_utc": 1566386601.0,
            "replies": []
        },
        {
            "body": "Fully agree with OP on this one. I like the ole timey voice but it did come off as condescending. It is a male hair advice sub and all that.",
            "author": null,
            "id": "exhq6ae",
            "parent_id": "t1_exhnpml",
            "score": 52,
            "created_utc": 1566311524.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "exhrvqu",
                    "parent_id": "t1_exhq6ae",
                    "score": -29,
                    "created_utc": 1566312667.0,
                    "replies": [
                        {
                            "body": "The fact that you had to tell OP that you weren't intending to be insulting should be enough of a hint as to how him and at least me read your comment.\n\nOP asked what to ask for the length on the sides. He didn't ask should he show the picture to the barber, so if you don't know the length of the sides because you're not an expert then just leave it at that. \n\nYou might not have directly said anything negative about OP but by being Captain obvious you patronised him like he didn't think of showing the picture himself. It wasn't what he was asking!",
                            "author": null,
                            "id": "exht8kq",
                            "parent_id": "t1_exhrvqu",
                            "score": 31,
                            "created_utc": 1566313577.0,
                            "replies": []
                        },
                        {
                            "body": "No you’re just condescending. How stupid do you think OP is, I think if someone gave him the measurements he’d be able to look up and understand what he’s talking about. Obviously you’re not an expert, so don’t comment if you’re going to be a dipshit. Also I agree with OP, your job as a moderator isn’t to fuck with people and role play.",
                            "author": "_Radds_",
                            "id": "exhy2dx",
                            "parent_id": "t1_exhrvqu",
                            "score": 18,
                            "created_utc": 1566316819.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah no you totally intended it. You just didn’t expect backlash so you’re walking it back. Oof",
            "author": "EATING--GARBAGE",
            "id": "exijenw",
            "parent_id": "t1_exhnpml",
            "score": 8,
            "created_utc": 1566329541.0,
            "replies": []
        },
        {
            "body": "Reddit admins are usually socially inept losers but you’re particularly bad. dude just had a question lol",
            "author": "hk47isreadytoserve",
            "id": "exi9ku2",
            "parent_id": "t1_exhnpml",
            "score": 9,
            "created_utc": 1566323806.0,
            "replies": []
        },
        {
            "body": "You totally came off like a jerk. OP 💯 got it right. Whether you meant to or not, you did. I'd look inward and figure it out.",
            "author": "FaulknerGently",
            "id": "exi1i64",
            "parent_id": "t1_exhnpml",
            "score": 11,
            "created_utc": 1566319046.0,
            "replies": []
        },
        {
            "body": "I thought it was hilarious. Enjoyed it from beginning to end.",
            "author": "rafaelescalona",
            "id": "exida4f",
            "parent_id": "t1_exhnpml",
            "score": -5,
            "created_utc": 1566325965.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "exhrvqu",
            "parent_id": "t1_exhq6ae",
            "score": -29,
            "created_utc": 1566312667.0,
            "replies": [
                {
                    "body": "The fact that you had to tell OP that you weren't intending to be insulting should be enough of a hint as to how him and at least me read your comment.\n\nOP asked what to ask for the length on the sides. He didn't ask should he show the picture to the barber, so if you don't know the length of the sides because you're not an expert then just leave it at that. \n\nYou might not have directly said anything negative about OP but by being Captain obvious you patronised him like he didn't think of showing the picture himself. It wasn't what he was asking!",
                    "author": null,
                    "id": "exht8kq",
                    "parent_id": "t1_exhrvqu",
                    "score": 31,
                    "created_utc": 1566313577.0,
                    "replies": []
                },
                {
                    "body": "No you’re just condescending. How stupid do you think OP is, I think if someone gave him the measurements he’d be able to look up and understand what he’s talking about. Obviously you’re not an expert, so don’t comment if you’re going to be a dipshit. Also I agree with OP, your job as a moderator isn’t to fuck with people and role play.",
                    "author": "_Radds_",
                    "id": "exhy2dx",
                    "parent_id": "t1_exhrvqu",
                    "score": 18,
                    "created_utc": 1566316819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The fact that you had to tell OP that you weren't intending to be insulting should be enough of a hint as to how him and at least me read your comment.\n\nOP asked what to ask for the length on the sides. He didn't ask should he show the picture to the barber, so if you don't know the length of the sides because you're not an expert then just leave it at that. \n\nYou might not have directly said anything negative about OP but by being Captain obvious you patronised him like he didn't think of showing the picture himself. It wasn't what he was asking!",
            "author": null,
            "id": "exht8kq",
            "parent_id": "t1_exhrvqu",
            "score": 31,
            "created_utc": 1566313577.0,
            "replies": []
        },
        {
            "body": "No you’re just condescending. How stupid do you think OP is, I think if someone gave him the measurements he’d be able to look up and understand what he’s talking about. Obviously you’re not an expert, so don’t comment if you’re going to be a dipshit. Also I agree with OP, your job as a moderator isn’t to fuck with people and role play.",
            "author": "_Radds_",
            "id": "exhy2dx",
            "parent_id": "t1_exhrvqu",
            "score": 18,
            "created_utc": 1566316819.0,
            "replies": []
        }
    ]
}