{
    "title": "Dear plus sized / fat sugar babies",
    "post_id": "e92tin",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e92tin/dear_plus_sized_fat_sugar_babies/",
    "author": "creamypeaches2",
    "body": "Hello,\nIt’s me. I’m one of you. In fact, I’m probably larger than you.\n\nBut, contrary to beliefs. I score. I score often, and I am typically drooled over. And truth be told you probably could too. \n\nHere’s my list of recommendations.\n\n1. Be fucking confident. It drives the boat.\n2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang. \n3. Flaunt what you have. I mean, if you have great tits, show them. Same for your ass. And wear clothes that flatter your body. \n4. Don’t be afraid of your body, and you know what I mean. Get comfortable in the sheets.\nThrow those hips around and drive the fucking boat. \n5. Invest in yourself. Makeup, clothes, gym membership, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.\n6. AGILITY... google the word. DM if you have questions. \n7. Unleash your inner freak. BOUNCE ON THE DICK.\n8. Stop whining about not being able to find someone and be proactive.\n\n\nI have been doing this for 7 years and have always had an SD and an allowance.\n\nYES YOU CAN FIND IT IN THE BOWL.\nBut not if you don’t think you can.\n\nThank you for listening to my drunken TED TALK.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e92tin/dear_plus_sized_fat_sugar_babies/",
    "score": 368,
    "upvote_ratio": 0.91,
    "created_utc": 1576042046.0,
    "num_comments": 121,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "👌🏻 from a fat ex sugar baby, yes queen! all of these are great tips i lived by when i was working in sex work.",
            "author": "kawaiidi",
            "id": "fahnw67",
            "parent_id": "t3_e92tin",
            "score": 18,
            "created_utc": 1576089773.0,
            "replies": []
        },
        {
            "body": "Is this Rebel Wilson?",
            "author": "SDforreal",
            "id": "fag70v5",
            "parent_id": "t3_e92tin",
            "score": 79,
            "created_utc": 1576042200.0,
            "replies": [
                {
                    "body": "You wish, daddy-o.",
                    "author": "creamypeaches2",
                    "id": "fag727d",
                    "parent_id": "t1_fag70v5",
                    "score": 70,
                    "created_utc": 1576042236.0,
                    "replies": []
                },
                {
                    "body": "She's pretty hot!",
                    "author": "SubBaby",
                    "id": "fagvw9w",
                    "parent_id": "t1_fag70v5",
                    "score": 3,
                    "created_utc": 1576072823.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> YES YOU CAN FIND IT IN THE BOWL. But not if you don’t think you can.\n\nLiterally 100% this. SB, SD, SGF, SBF, SMF (Sugar Mother Fucker, not literally, but metaphorically), shit even, non sugar whatever. If you don't fucking believe in yourself to begin with, why should anyone else??? Million dollar question right there!\n\nThat being said, fucking LOL @ this \"TED Talk\" lol!",
            "author": "sdaddy305",
            "id": "fag7crg",
            "parent_id": "t3_e92tin",
            "score": 63,
            "created_utc": 1576042515.0,
            "replies": [
                {
                    "body": "I literally read SMF as sugar mother fucker automatically 😂",
                    "author": "xolaura5",
                    "id": "fag7ilu",
                    "parent_id": "t1_fag7crg",
                    "score": 11,
                    "created_utc": 1576042672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Find the unique things about yourself and dial them up.\n\nSpeak multiple languages?\n\nKinky?\n\nGreat at oral?\n\nBe proud of what makes you stand out.\n\nI lean into the fact that I'm strong and kinky for sure.",
            "author": "Sweettooth_dragon",
            "id": "fail9zh",
            "parent_id": "t3_e92tin",
            "score": 12,
            "created_utc": 1576110592.0,
            "replies": [
                {
                    "body": "Love it",
                    "author": "creamypeaches2",
                    "id": "failhpc",
                    "parent_id": "t1_fail9zh",
                    "score": 2,
                    "created_utc": 1576110741.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You weren't kidding when you said you were drunk when you posted that.",
            "author": "god_sized_cock",
            "id": "fahml7f",
            "parent_id": "t3_e92tin",
            "score": 11,
            "created_utc": 1576088981.0,
            "replies": [
                {
                    "body": "I was lit.",
                    "author": "creamypeaches2",
                    "id": "fahthnz",
                    "parent_id": "t1_fahml7f",
                    "score": 13,
                    "created_utc": 1576093160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "faga887",
            "parent_id": "t3_e92tin",
            "score": 27,
            "created_utc": 1576045520.0,
            "replies": [
                {
                    "body": "I haven't had the money to until recently. My new job, I'm spending my second big paycheck on makeup and a couple nice outfits.",
                    "author": "Sweettooth_dragon",
                    "id": "faikk53",
                    "parent_id": "t1_faga887",
                    "score": 3,
                    "created_utc": 1576110090.0,
                    "replies": []
                },
                {
                    "body": "True",
                    "author": "creamypeaches2",
                    "id": "fagbiq6",
                    "parent_id": "t1_faga887",
                    "score": 5,
                    "created_utc": 1576047009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Extremely low amount of carbohydrates in a day (less than 20g, as close to 0g as possible), eating about one meal a day, eat less, keep caffeine intake at a high, walk and maybe pick up smoking... that's how i've lost well over 100lbs in less than year!",
            "author": "BigBearSD",
            "id": "fakacj7",
            "parent_id": "t3_e92tin",
            "score": 6,
            "created_utc": 1576163723.0,
            "replies": []
        },
        {
            "body": "OP, did you specify this anywhere on your profile?? I haven’t had any luck but I’m about a size 16 sometimes 14. I’ve thought about changing my username or profile “header” to say something with BBW in it but I wasn’t sure. I’m not sure if it’s just the city I live in but when I allow them to view my photos I rarely get responses back. Or if I go on a first date I don’t hear back from them. I must be doing something wrong? I’ve been told I’m pretty so I really don’t know",
            "author": "SangriaDreams",
            "id": "faiq4o9",
            "parent_id": "t3_e92tin",
            "score": 6,
            "created_utc": 1576113948.0,
            "replies": [
                {
                    "body": "You aren’t a BBW baby girl, you’re just plump. Feel free to DM me profile pics and I’ll help!",
                    "author": "creamypeaches2",
                    "id": "faiw78q",
                    "parent_id": "t1_faiq4o9",
                    "score": 8,
                    "created_utc": 1576118075.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As someone who struggles with my body image constantly, she's right. I feel more beautiful and get more attention when I just accept myself for the person I am. I have physical flaws but no one notices if I dont draw attention to them by being self-conscious. You're already gorgeous okay? You're already perfectly you.",
            "author": "Mopsydoll",
            "id": "fahj3t9",
            "parent_id": "t3_e92tin",
            "score": 11,
            "created_utc": 1576086836.0,
            "replies": [
                {
                    "body": "Damn straight sister, my booty gets more looks than a gay fashion show.",
                    "author": "creamypeaches2",
                    "id": "fahtkci",
                    "parent_id": "t1_fahj3t9",
                    "score": 8,
                    "created_utc": 1576093205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Super great advice! Kiddos to you! Idk how I stumbled on this post ... I love me some tiny spinners ... but YES confidence is Sexy! I have been w some plus sized girls that just oozed w sex appeal. And if your confidence is down get out there and get a little experience. Everyone is sexy in there own way! Also bigger girls generally give great head ... and guys love that!",
            "author": "Atlanta-SD",
            "id": "faj3vi7",
            "parent_id": "t3_e92tin",
            "score": 6,
            "created_utc": 1576123739.0,
            "replies": []
        },
        {
            "body": "As a south east asian plus sized SB, i second this. Competing among the petites, ‘ideal’ asian size girls within the limited pool of SD in SEA region (atleast in my city) i thought i will not shine, but i was wrong! Theres somebody for everyone, indeed. \nHowever, having the conversation skills and confidence does give one more advantage, apart from good upkeep of appearance.",
            "author": "itstartswith_m",
            "id": "fagg2db",
            "parent_id": "t3_e92tin",
            "score": 24,
            "created_utc": 1576052985.0,
            "replies": []
        },
        {
            "body": "My fiance and I are particularly fond of chubby sugar babies",
            "author": null,
            "id": "faglw3a",
            "parent_id": "t3_e92tin",
            "score": 15,
            "created_utc": 1576062145.0,
            "replies": [
                {
                    "body": "Well if you need one :)",
                    "author": "skye11299",
                    "id": "faoatho",
                    "parent_id": "t1_faglw3a",
                    "score": 1,
                    "created_utc": 1576260562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly I agree with you 100%, I found mine by not worrying or stressing over shit and just being my confident flirty self, he noticed my personality and didn't give a damn that I am bigger. So being bigger does not stop you, it may make it harder because some people are bias and don't even give you a chance as soon as they see big, but you gotta strut your stuff and let your true self shine.",
            "author": null,
            "id": "fag9t9c",
            "parent_id": "t3_e92tin",
            "score": 16,
            "created_utc": 1576045059.0,
            "replies": []
        },
        {
            "body": "> In fact, I’m probably larger than you. \n\nI doubt that!!!!\n\nFat man here, 46% body fat. Obesity is a problem, and shouldn't be celebrated. Do what you can to lose weight and be healthy, but don't give into this body positive shit. And it is shit. I am fat because of my poor life choices. Yes, down vote me; feed me down votes like cheeseburgers and Twinkies!!! NOM NOM NOM!!!!!!!!!!!!!!",
            "author": "OneMOARPlz",
            "id": "fam2vfk",
            "parent_id": "t3_e92tin",
            "score": 4,
            "created_utc": 1576194837.0,
            "replies": [
                {
                    "body": "Love your honesty!",
                    "author": "Delicious-Emotion966",
                    "id": "i4jtvzq",
                    "parent_id": "t1_fam2vfk",
                    "score": 1,
                    "created_utc": 1649848033.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">if you have great tits, show them. Same for your ass. \n\n&#x200B;\n\nI feel like what you're saying is a woman with an hourglass figure shouldn't let the fact that she's overweight discourage her. That's obvious. Most men like curvy women.  What is your advice to the overweight woman with small boobs, no ass, and an apron belly?",
            "author": null,
            "id": "fah9wm6",
            "parent_id": "t3_e92tin",
            "score": 9,
            "created_utc": 1576082193.0,
            "replies": [
                {
                    "body": "Be extremely good at specific kinks tbh. 😘 that's worked for me.",
                    "author": "Sweettooth_dragon",
                    "id": "faikowe",
                    "parent_id": "t1_fah9wm6",
                    "score": 2,
                    "created_utc": 1576110183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Total yes to this. I am in a similar boat (size 14, tall hourglass), and confidence is key in getting an SD. Though my relationship is essentially vanilla at this point, I’ve had more luck in the sugar world than most of the women posting on this forum. \n\nBeing thin doesn’t mean you’re guaranteed an SD, and being fat doesn’t mean you won’t meet an SD.  Don’t kill yourself at the gym if you think that it’ll get you a man, but if you do want to lose weight, do it for you. The results will end in more confidence.",
            "author": "vulgarlydebonair",
            "id": "fah8frn",
            "parent_id": "t3_e92tin",
            "score": 9,
            "created_utc": 1576081417.0,
            "replies": []
        },
        {
            "body": "Hey just curious, how do actually find Glucose Guardians? I have yet to figure out how to find them.",
            "author": "WasteYard5",
            "id": "fnl84tn",
            "parent_id": "t3_e92tin",
            "score": 2,
            "created_utc": 1587048818.0,
            "replies": []
        },
        {
            "body": "This was a beautiful drunk post. Thanks for the help!",
            "author": "scorpionattitude",
            "id": "hnrz0tl",
            "parent_id": "t3_e92tin",
            "score": 2,
            "created_utc": 1639002328.0,
            "replies": []
        },
        {
            "body": "On one level, I totally get what you're saying. Good on you for having success, and here we go....but\n\nA lot of what you said is great in principle. However, the practicality and reality of many people's situations can make some of what you said somewhat destructive.\n\nFor example  \"Be fucking confident\". To someone who isn't confident, this can come across as patronizing and lacking empathy. Someone who internally has zero confidence is fully aware they are not confident. Saying just \"be confident\" is not news to them. Saying this can have the opposite effect and further highlight more to them that they not confident.\n\n\" Don’t be afraid of your body \" Body image is a major issue across all of society. Like the confidence issue above, saying that statement is unhelpful. I've seen many examples of stunning women who will constantly point out all the flaws in their body and also not think that they are attractive in their own minds. This kind of statement \"Don’t be afraid of your body\" will raise body issues in many people as it doesn't do much on the \"how\". All it does is point out to them that they are afraid of it, and they still don't know how to change that. Likewise \"Flaunt what you have.\" Well if someone doesn't think they have a part of their body worth flaunting (even though to the outside world they do), how does this help them?\n\nYour point number 5, on the other hand, shows some ideas about how things can be done, unlike 1 and 2.\n\nI understand you are trying to be helpful, but time again I've seen people think they are being helpful, but in reality it has the opposite effect because it doesn't address the underlying issue.",
            "author": "schmeeSD",
            "id": "fagdr23",
            "parent_id": "t3_e92tin",
            "score": 13,
            "created_utc": 1576049806.0,
            "replies": [
                {
                    "body": "Not all good advice is packaged as actionable and digestible self help. Telling someone their advice has to be better or they might be counter-productive seems pretty ironic to me.",
                    "author": "tra24602",
                    "id": "fagfz71",
                    "parent_id": "t1_fagdr23",
                    "score": 27,
                    "created_utc": 1576052853.0,
                    "replies": [
                        {
                            "body": "Agreed.",
                            "author": "aherdofdustyturtles",
                            "id": "fah511j",
                            "parent_id": "t1_fagfz71",
                            "score": 2,
                            "created_utc": 1576079307.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It seems like you’re searching for negative things. Obviously, everybody has their issues. Obviously, it’s not that simple to just say “be confident” but that’s definitely not what she was trying to say. Her message is all around good and not negative what so ever. I think she’s aware that it takes more than just saying be confident for someone to actually be confident. \n\nI think her point is to work on being confident. When anybody says something like that they *know* it’s not that simple. They mean; work on loving yourself, because you’re beautiful no matter what. \n\nIt goes the same way for “don’t be afraid of your body.” \nWork on it. Work on loving yourself. You’re searching for negative things in an all around positive message.\n\nEdit:  btw, not all helpful messages will be something you want to hear.",
                    "author": "mamphylilley",
                    "id": "fagqhvh",
                    "parent_id": "t1_fagdr23",
                    "score": 13,
                    "created_utc": 1576067889.0,
                    "replies": [
                        {
                            "body": "Exactly 🥳",
                            "author": "creamypeaches2",
                            "id": "fakxbs0",
                            "parent_id": "t1_fagqhvh",
                            "score": 1,
                            "created_utc": 1576174701.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If someone is so triggered by so many things that are basic essentials of sugaring, it’s clearly not for them. \n\nIf you’re afraid of dogs, don’t apply for dog catcher positions.",
                    "author": "whatshouldIdonow8907",
                    "id": "fagno49",
                    "parent_id": "t1_fagdr23",
                    "score": 15,
                    "created_utc": 1576064617.0,
                    "replies": [
                        {
                            "body": "> If you’re afraid of dogs, don’t apply for dog catcher positions.\n\nI like this. Jeeze the cool mental tidbits ya find on SLF. I could start my own bumper-sticker business :-)",
                            "author": "SDRippington",
                            "id": "fahbzq3",
                            "parent_id": "t1_fagno49",
                            "score": 2,
                            "created_utc": 1576083233.0,
                            "replies": []
                        },
                        {
                            "body": "absolutely. you probably are not in a healthy place to handle being a sb safely if you are not confident or actively working hard and making headway.",
                            "author": "kawaiidi",
                            "id": "faho5eh",
                            "parent_id": "t1_fagno49",
                            "score": 1,
                            "created_utc": 1576089927.0,
                            "replies": []
                        },
                        {
                            "body": "This!! 👏🏼",
                            "author": "mraspencer",
                            "id": "fags5s4",
                            "parent_id": "t1_fagno49",
                            "score": 0,
                            "created_utc": 1576069554.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you",
                    "author": "Pepperspray24",
                    "id": "fah7qlb",
                    "parent_id": "t1_fagdr23",
                    "score": 2,
                    "created_utc": 1576081024.0,
                    "replies": []
                },
                {
                    "body": "With that kind of attitude...",
                    "author": "BlissfulSB",
                    "id": "fahiei0",
                    "parent_id": "t1_fagdr23",
                    "score": 1,
                    "created_utc": 1576086461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This same advice also applies to broke “SDs”. It doesn’t matter if you are old, unattractive and broke, just be confident and you will find gorgeous SBs. \n\n/s",
            "author": "geekxp",
            "id": "fagtayd",
            "parent_id": "t3_e92tin",
            "score": 12,
            "created_utc": 1576070616.0,
            "replies": [
                {
                    "body": "🎪 🤸🏾‍♂️🤡",
                    "author": "brownbaby21",
                    "id": "fah34iq",
                    "parent_id": "t1_fagtayd",
                    "score": 7,
                    "created_utc": 1576078067.0,
                    "replies": []
                },
                {
                    "body": "Be gone with your negativity. Are you a SB ? No ? Then it doesn't apply to you , does it ?",
                    "author": "nellybelle1984",
                    "id": "fahktv0",
                    "parent_id": "t1_fagtayd",
                    "score": -1,
                    "created_utc": 1576087896.0,
                    "replies": [
                        {
                            "body": "🙄🙄🙄🙄",
                            "author": null,
                            "id": "faho8ej",
                            "parent_id": "t1_fahktv0",
                            "score": 0,
                            "created_utc": 1576089978.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "oh this is supposed to be funny",
                    "author": "vulgarlydebonair",
                    "id": "fai4cfk",
                    "parent_id": "t1_fagtayd",
                    "score": 1,
                    "created_utc": 1576099576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not so sure if I agree with the message behind this but I definitely agree confidence and being able to carry a conversation are helpful for anyone to do",
            "author": "Ass-Catchem",
            "id": "fag74fm",
            "parent_id": "t3_e92tin",
            "score": 2,
            "created_utc": 1576042294.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fah8emq",
            "parent_id": "t3_e92tin",
            "score": 4,
            "created_utc": 1576081399.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fahybf5",
                    "parent_id": "t1_fah8emq",
                    "score": 10,
                    "created_utc": 1576096027.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fai3065",
                            "parent_id": "t1_fahybf5",
                            "score": 2,
                            "created_utc": 1576098787.0,
                            "replies": [
                                {
                                    "body": "Right, which is why OP's comment on getting a gym membership is really good advice! I agree, complacency is unhealthy in and of itself, but again, I don't think anyone stated or implied anything about normalizing obesity. I only saw ways to better yourself and to love and accept yourself, which is a very positive message.\nI think it's fantastic that you take such great care of yourself! It takes a lot of self love to get into that mindset, and the above tips are great ways to get started on the road to loving oneself and treating one's body better. :)",
                                    "author": "fcandiax",
                                    "id": "fai475p",
                                    "parent_id": "t1_fai3065",
                                    "score": 3,
                                    "created_utc": 1576099489.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Absolutely !!!",
                            "author": "creamypeaches2",
                            "id": "fakxhjs",
                            "parent_id": "t1_fahybf5",
                            "score": 1,
                            "created_utc": 1576174778.0,
                            "replies": []
                        },
                        {
                            "body": "Not to mention that some women already have medical issues that might have caused their weight gain.",
                            "author": "cjkit",
                            "id": "fahyzgc",
                            "parent_id": "t1_fahybf5",
                            "score": 1,
                            "created_utc": 1576096425.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How is telling someone to be happy and confident despite their weight \"normalizing\" obesity? OP literally said, \"Invest in yourself. Makeup, clothes, **gym membership**, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out. \"\n\n>gym membership\n\nSome people are overweight despite proper diet and exercise (e.g., hypothyroidism).\n\nThis is simply a post saying to be confident despite weight, leave it at that.\n\nWe're exercising, we're eating healthy, we're going to the doctor, and we're trying to be as healthy as possible. We're bettering ourselves. SO, we do NOT need someone to keep spewing the same bologna that everyone else spews. You don't tell someone with depression that being depressed isn't healthy--lady, WE KNOW it's not healthy.\n\nLmfao, next.",
                    "author": "SmittenKittencat",
                    "id": "fahvruo",
                    "parent_id": "t1_fah8emq",
                    "score": 4,
                    "created_utc": 1576094514.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fai30td",
                            "parent_id": "t1_fahvruo",
                            "score": 2,
                            "created_utc": 1576098798.0,
                            "replies": [
                                {
                                    "body": "My bad! Thanks for the correction",
                                    "author": "SmittenKittencat",
                                    "id": "faih71z",
                                    "parent_id": "t1_fai30td",
                                    "score": 1,
                                    "created_utc": 1576107744.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i fuckin love you <3 lol",
            "author": null,
            "id": "fah5hvh",
            "parent_id": "t3_e92tin",
            "score": 2,
            "created_utc": 1576079603.0,
            "replies": [
                {
                    "body": "I fucking love you 💋",
                    "author": "creamypeaches2",
                    "id": "fah6f78",
                    "parent_id": "t1_fah5hvh",
                    "score": 4,
                    "created_utc": 1576080193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fagfqd3",
            "parent_id": "t3_e92tin",
            "score": -2,
            "created_utc": 1576052502.0,
            "replies": [
                {
                    "body": "[https://www.thoughtco.com/regime-regimen-and-regiment-1689480](https://www.thoughtco.com/regime-regimen-and-regiment-1689480)",
                    "author": "highfructoseSD",
                    "id": "fagkbof",
                    "parent_id": "t1_fagfqd3",
                    "score": 14,
                    "created_utc": 1576059705.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fagl2b7",
                            "parent_id": "t1_fagkbof",
                            "score": 1,
                            "created_utc": 1576060866.0,
                            "replies": [
                                {
                                    "body": "[you're welcome](https://collection.nam.ac.uk//images/960/228000-228999/228969.jpg)",
                                    "author": "highfructoseSD",
                                    "id": "fagndgp",
                                    "parent_id": "t1_fagl2b7",
                                    "score": 4,
                                    "created_utc": 1576064229.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did you read number 5?",
                    "author": "SmittenKittencat",
                    "id": "faisjju",
                    "parent_id": "t1_fagfqd3",
                    "score": 1,
                    "created_utc": 1576115607.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honest question..over 7 years have you kept the same body size or have you lost weight (in reference to #5)",
            "author": "tenmillionplus",
            "id": "fag7d6a",
            "parent_id": "t3_e92tin",
            "score": 0,
            "created_utc": 1576042526.0,
            "replies": [
                {
                    "body": "No, I haven’t lost weight but I focus a lot of energy on keeping my body in a very nice place. IE: Coke bottle/ hour glass.",
                    "author": "creamypeaches2",
                    "id": "fag7k9t",
                    "parent_id": "t1_fag7d6a",
                    "score": 13,
                    "created_utc": 1576042719.0,
                    "replies": [
                        {
                            "body": "> Coke bottle/ hour glass.\n\n\nYou won the genetic lottery and have a body type that is desirable for a wide range of weights. That's what is really driving the fucking boat. The same cannot be said for many plus-size SBs commenting here. Honestly, I feel it's a bit reckless of you. You are encouraging them, but they will only find scammers and trolls.",
                            "author": null,
                            "id": "fahwxn8",
                            "parent_id": "t1_fag7k9t",
                            "score": 5,
                            "created_utc": 1576095206.0,
                            "replies": []
                        },
                        {
                            "body": "Do you have a goal to? If someone else were overweight, male or female would you encourage them to do so?",
                            "author": "tenmillionplus",
                            "id": "fag82mw",
                            "parent_id": "t1_fag7k9t",
                            "score": -17,
                            "created_utc": 1576043221.0,
                            "replies": [
                                {
                                    "body": "Please stop",
                                    "author": "brown_bi_babe",
                                    "id": "fagbu3c",
                                    "parent_id": "t1_fag82mw",
                                    "score": 17,
                                    "created_utc": 1576047392.0,
                                    "replies": []
                                },
                                {
                                    "body": "She told you she doesn’t want to lose weight, just move on!",
                                    "author": "Lilipuss25",
                                    "id": "fagqric",
                                    "parent_id": "t1_fag82mw",
                                    "score": 5,
                                    "created_utc": 1576068167.0,
                                    "replies": []
                                },
                                {
                                    "body": "OP: Be happy and confident in your body!\nReply: Have you thought about changing your body?\n🙄ffs",
                                    "author": "jaguarsharkSD",
                                    "id": "fah1s5x",
                                    "parent_id": "t1_fag82mw",
                                    "score": 1,
                                    "created_utc": 1576077163.0,
                                    "replies": [
                                        {
                                            "body": "Appreciate you white knighting here, and it's perfectly fine to accept yourself as who you are, just don't push others into thinking an unhealthy lifestyle into it either. \n\nIf you're overweight, that is a health risk, in the same way if you're an alcoholic or abuser of drugs. Would there be any acceptance to \"I drink all the time and I'm fine you can do it too\".",
                                            "author": "tenmillionplus",
                                            "id": "fah4l5y",
                                            "parent_id": "t1_fah1s5x",
                                            "score": 5,
                                            "created_utc": 1576079026.0,
                                            "replies": [
                                                {
                                                    "body": "So decided to take OPs post and make it about SBs with alcoholism rather than weight issues....\n\n>  \n>  \n>Dear alcoholic sugar babies  \n  \n>  \n>Hello, It’s me. I’m one of you. In fact, I’m probably deeper into my addiction battle than you.  \n>  \n>But, contrary to beliefs. It doesn't impact my SRs. My SDs don't even realize, and I am typically drooled over. And truth be told you probably could too.  \n>  \n>Here’s my list of recommendations.  \n>  \n>1. Be fucking confident. It drives the boat.  \n>  \n>2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang.  \n>  \n>3. Flaunt what you have. I mean, if you have a sense of humour, let it shine. Be a fun person. There's something interesting about you, play it up as best you can.  \n>  \n>4. Don’t be afraid to decline drinks on a date, and you know why. Show them that you don't need to drink for them to have fun with you and drive the fucking boat.  \n>  \n>5. Invest in yourself. Makeup, clothes, therapy, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.  \n>  \n>6. SEDUCTION... google the word. DM if you have questions.  \n>  \n>7. Unleash your inner freak. BOUNCE ON THE DICK.  \n>  \n>Thank you for listening to my drunken TED TALK.\n\n&#x200B;\n\n...\n\nYet, nowhere in this post is it normalizing alcoholism/addiction or pushing it onto others...\n\nJust like how the original post isn't normalizing obesity or pushing it onto others.\n\n&#x200B;\n\nIt's a post telling SBs to be confident about themselves regardless of what they or others may perceive is wrong with them -- **leave it at that**.",
                                                    "author": "SmittenKittencat",
                                                    "id": "faiixps",
                                                    "parent_id": "t1_fah4l5y",
                                                    "score": 6,
                                                    "created_utc": 1576108947.0,
                                                    "replies": [
                                                        {
                                                            "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
                                                            "author": "tenmillionplus",
                                                            "id": "faik09j",
                                                            "parent_id": "t1_faiixps",
                                                            "score": 2,
                                                            "created_utc": 1576109702.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                                                                    "author": "SmittenKittencat",
                                                                    "id": "fairgc1",
                                                                    "parent_id": "t1_faik09j",
                                                                    "score": 1,
                                                                    "created_utc": 1576114865.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                                                                            "author": "tenmillionplus",
                                                                            "id": "faivseo",
                                                                            "parent_id": "t1_fairgc1",
                                                                            "score": 0,
                                                                            "created_utc": 1576117794.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                                                                    "author": "SmittenKittencat",
                                                                                    "id": "faiw97g",
                                                                                    "parent_id": "t1_faivseo",
                                                                                    "score": 2,
                                                                                    "created_utc": 1576118112.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                                                                            "author": "tenmillionplus",
                                                                                            "id": "faiwfh7",
                                                                                            "parent_id": "t1_faiw97g",
                                                                                            "score": 0,
                                                                                            "created_utc": 1576118233.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Yep, definitely missed the point.",
                                                                                                    "author": "SmittenKittencat",
                                                                                                    "id": "faizc1l",
                                                                                                    "parent_id": "t1_faiwfh7",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1576120284.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                                                                            "author": "tenmillionplus",
                                                                                                            "id": "faj2oob",
                                                                                                            "parent_id": "t1_faizc1l",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1576122800.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                                                                    "author": "SmittenKittencat",
                                                                                                                    "id": "faj3f25",
                                                                                                                    "parent_id": "t1_faj2oob",
                                                                                                                    "score": 3,
                                                                                                                    "created_utc": 1576123372.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                                                                            "author": "Strange_Duckling",
                                                                                                                            "id": "faj455c",
                                                                                                                            "parent_id": "t1_faj3f25",
                                                                                                                            "score": 3,
                                                                                                                            "created_utc": 1576123951.0,
                                                                                                                            "replies": []
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                                                                            "author": "tenmillionplus",
                                                                                                                            "id": "faj50y8",
                                                                                                                            "parent_id": "t1_faj3f25",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1576124668.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                                                                    "author": "SmittenKittencat",
                                                                                                                                    "id": "faj5myl",
                                                                                                                                    "parent_id": "t1_faj50y8",
                                                                                                                                    "score": 3,
                                                                                                                                    "created_utc": 1576125182.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "body positive SB here. i agree. love your body. strive to be healthy. if you're overweight, there are associated health risks. period. doesnt  mean you're not attractive if youre a bit overweight!",
                                                    "author": null,
                                                    "id": "fah5z0g",
                                                    "parent_id": "t1_fah4l5y",
                                                    "score": 3,
                                                    "created_utc": 1576079903.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "https://goodmenproject.com/ethics-values/are-you-concerned-or-just-concern-trolling-hesaid/",
                                                    "author": "jaguarsharkSD",
                                                    "id": "fahcd60",
                                                    "parent_id": "t1_fah4l5y",
                                                    "score": 2,
                                                    "created_utc": 1576083418.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
                                                            "author": "ZealPrincess",
                                                            "id": "fahgpcx",
                                                            "parent_id": "t1_fahcd60",
                                                            "score": 3,
                                                            "created_utc": 1576085591.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fah1xg3",
            "parent_id": "t3_e92tin",
            "score": 2,
            "created_utc": 1576077262.0,
            "replies": [
                {
                    "body": "Hmm... this peaked my curiosity what are these things she's presumably doing?",
                    "author": null,
                    "id": "fah4zs2",
                    "parent_id": "t1_fah1xg3",
                    "score": 3,
                    "created_utc": 1576079284.0,
                    "replies": [
                        {
                            "body": "Minor nit: it's \"piqued\" not \"peaked\"",
                            "author": null,
                            "id": "fah73nn",
                            "parent_id": "t1_fah4zs2",
                            "score": 7,
                            "created_utc": 1576080629.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "faheod3",
                            "parent_id": "t1_fah4zs2",
                            "score": 3,
                            "created_utc": 1576084575.0,
                            "replies": [
                                {
                                    "body": "This is a weird thing to say.  Why would you assume that she wouldn't be sexually adventurous/kinky with a vanilla partner?  Or that she should do things she's \"not otherwise comfortable with\" to land an arrangement?   There are plenty of women who LOVE uncomfortable, degrading sex - we don't need to start telling women to \"compromise\" and do it anyway if they don't, Jesus Christ.",
                                    "author": "BluebelleBaby",
                                    "id": "fajwzql",
                                    "parent_id": "t1_faheod3",
                                    "score": 0,
                                    "created_utc": 1576156474.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fajzut7",
                                            "parent_id": "t1_fajwzql",
                                            "score": 1,
                                            "created_utc": 1576158164.0,
                                            "replies": [
                                                {
                                                    "body": "Did you read what you wrote?  I'm willing to believe that you just didn't convey your meaning well, but why the repeated reference to \"things she wouldn't otherwise do\"?  That's a pretty clear implication that these \"things\" aren't something she enjoys in general, she would only be tolerating them to make herself more appealing.  People who genuinely enjoy rough, degrading sex do it with their vanilla partners, they do it \"otherwise\".",
                                                    "author": "BluebelleBaby",
                                                    "id": "fak23aa",
                                                    "parent_id": "t1_fajzut7",
                                                    "score": 0,
                                                    "created_utc": 1576159422.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fakcft7",
                                                            "parent_id": "t1_fak23aa",
                                                            "score": 1,
                                                            "created_utc": 1576164746.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                                                                    "author": "BluebelleBaby",
                                                                    "id": "fakh906",
                                                                    "parent_id": "t1_fakcft7",
                                                                    "score": 1,
                                                                    "created_utc": 1576167103.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best drunken ted talk. Keep on with your bada** self 💜💜💜",
            "author": "Lolsmileyfacexo",
            "id": "fagizaj",
            "parent_id": "t3_e92tin",
            "score": 1,
            "created_utc": 1576057525.0,
            "replies": [
                {
                    "body": "Tysm 😛",
                    "author": "creamypeaches2",
                    "id": "fakxktu",
                    "parent_id": "t1_fagizaj",
                    "score": 1,
                    "created_utc": 1576174822.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Alllllll of this!!!!!!! I feel like i say this every day.",
            "author": "OliviaWildflower2332",
            "id": "fagrkfw",
            "parent_id": "t3_e92tin",
            "score": 0,
            "created_utc": 1576068985.0,
            "replies": []
        },
        {
            "body": "Or just lose weight? Lose weight and in the US you'll be in the minority...making you stand out",
            "author": null,
            "id": "fagxux4",
            "parent_id": "t3_e92tin",
            "score": -6,
            "created_utc": 1576074348.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fagjdzm",
            "parent_id": "t3_e92tin",
            "score": -23,
            "created_utc": 1576058183.0,
            "replies": [
                {
                    "body": "That’s not feedback that’s just bashing bigger people.",
                    "author": "cjkit",
                    "id": "fagqfu7",
                    "parent_id": "t1_fagjdzm",
                    "score": 15,
                    "created_utc": 1576067828.0,
                    "replies": [
                        {
                            "body": "Not bashing. Just stating the truth, at least the fat people I've met.",
                            "author": null,
                            "id": "fai3vcr",
                            "parent_id": "t1_fagqfu7",
                            "score": -1,
                            "created_utc": 1576099298.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fagkdce",
                    "parent_id": "t1_fagjdzm",
                    "score": 16,
                    "created_utc": 1576059779.0,
                    "replies": [
                        {
                            "body": "Nah - he hates himself and can’t stand to see anyone else happy.",
                            "author": null,
                            "id": "fagz4hk",
                            "parent_id": "t1_fagkdce",
                            "score": 13,
                            "created_utc": 1576075273.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don’t know about you other thick girls, but I smell like the Tom Ford Tobacco Vanille perfume my SBF bought me.",
                    "author": "vulgarlydebonair",
                    "id": "fah8nby",
                    "parent_id": "t1_fagjdzm",
                    "score": 9,
                    "created_utc": 1576081532.0,
                    "replies": []
                },
                {
                    "body": "I’m so glad you speak for the entirety of the male gender. You sound like you’re the life of the party. Go away, asshole",
                    "author": null,
                    "id": "fagr9ag",
                    "parent_id": "t1_fagjdzm",
                    "score": 14,
                    "created_utc": 1576068674.0,
                    "replies": [
                        {
                            "body": "Exactly! How does he know what *all* men like? Who died and made you king of the fucking jungle?\nI hope this guy never gets laid.",
                            "author": "SubBaby",
                            "id": "fagunq4",
                            "parent_id": "t1_fagr9ag",
                            "score": 13,
                            "created_utc": 1576071805.0,
                            "replies": [
                                {
                                    "body": "> Who died and made you king of the fucking jungle?\n\nOh he's welcome to it. Jungles suck. Hot. Damp. Bugs. Itchy. Many things in it are poison or give you a rash. Kidnapped by cartels. Fuck that.",
                                    "author": "SDRippington",
                                    "id": "fahcd5j",
                                    "parent_id": "t1_fagunq4",
                                    "score": 6,
                                    "created_utc": 1576083418.0,
                                    "replies": [
                                        {
                                            "body": "🤣🤣🤣",
                                            "author": "OliviaWildflower2332",
                                            "id": "faj0je6",
                                            "parent_id": "t1_fahcd5j",
                                            "score": 3,
                                            "created_utc": 1576121167.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Honestly, I am. Just being honest.",
                            "author": null,
                            "id": "fai1cab",
                            "parent_id": "t1_fagr9ag",
                            "score": -2,
                            "created_utc": 1576097810.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I love how you assume all fat people smell. Yes, there are fat people who don't clean themselves properly, but that is not all of us. And not all men are turned off by fat women. There is so much hate in this world, why not spread encouragement???  You also never know why someone has become fat. There is a lot of reasons. And FYI food is an addiction just like heroin and many people struggle more so because your body needs food for fuel, so before you judge, do some damn research on the obesity epidemic and try approaching all humans with understanding.",
                    "author": "sxyhtslky2",
                    "id": "faglc6a",
                    "parent_id": "t1_fagjdzm",
                    "score": 12,
                    "created_utc": 1576061289.0,
                    "replies": [
                        {
                            "body": "stankiest dude i ever worked with was 110 pounds. 🤷🏻‍♂️",
                            "author": "menominom",
                            "id": "fagzszw",
                            "parent_id": "t1_faglc6a",
                            "score": 10,
                            "created_utc": 1576075762.0,
                            "replies": [
                                {
                                    "body": "Right?? Cleanliness isn't about body size.",
                                    "author": "sxyhtslky2",
                                    "id": "fah01u4",
                                    "parent_id": "t1_fagzszw",
                                    "score": 7,
                                    "created_utc": 1576075936.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Obviously you're not very good at reading. I said the fat people I met smelled. I didn't assume anything. It's all facts.",
                            "author": null,
                            "id": "falbkp4",
                            "parent_id": "t1_faglc6a",
                            "score": 1,
                            "created_utc": 1576181639.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thats a lot of words for i am fat phobic. Gtfoh",
                    "author": "OliviaWildflower2332",
                    "id": "fagrc1y",
                    "parent_id": "t1_fagjdzm",
                    "score": 13,
                    "created_utc": 1576068753.0,
                    "replies": []
                },
                {
                    "body": "First off, bones are for dogs and meat is for men. \n\nBut seriously bro - how unhappy are you?  Why do the most unhappy people try to have everyone else share your misery?  Do yourself (and the world) a favor and focus on what makes you happy rather than shitting on other people.",
                    "author": null,
                    "id": "fagz2h3",
                    "parent_id": "t1_fagjdzm",
                    "score": 5,
                    "created_utc": 1576075233.0,
                    "replies": [
                        {
                            "body": "Haha I definitely have used the bones for doggies statement before! Very freaking true.",
                            "author": "macaroonqueen",
                            "id": "fah4yfm",
                            "parent_id": "t1_fagz2h3",
                            "score": 3,
                            "created_utc": 1576079260.0,
                            "replies": [
                                {
                                    "body": "Have you seen the meme?  It might be the hottest picture I’ve ever seen.",
                                    "author": null,
                                    "id": "fahctqs",
                                    "parent_id": "t1_fah4yfm",
                                    "score": 1,
                                    "created_utc": 1576083646.0,
                                    "replies": [
                                        {
                                            "body": "No I haven't! Now I want to",
                                            "author": "macaroonqueen",
                                            "id": "fahln99",
                                            "parent_id": "t1_fahctqs",
                                            "score": 4,
                                            "created_utc": 1576088405.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "When you make a statement about not shitting on people but just called skinny people bones. Okay",
                            "author": "ZealPrincess",
                            "id": "fahhbkd",
                            "parent_id": "t1_fagz2h3",
                            "score": 3,
                            "created_utc": 1576085913.0,
                            "replies": [
                                {
                                    "body": "Fair point, though I bristle at the notion that my reply was tonally equivalent to the OP",
                                    "author": null,
                                    "id": "fahikm4",
                                    "parent_id": "t1_fahhbkd",
                                    "score": 4,
                                    "created_utc": 1576086548.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get that your being positive but why do you assume a bigger girl isn’t already confident? I don’t like someone assuming a curvy girl does or would feel less than",
            "author": null,
            "id": "fagb5az",
            "parent_id": "t3_e92tin",
            "score": -8,
            "created_utc": 1576046569.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fagdbd7",
                    "parent_id": "t1_fagb5az",
                    "score": 22,
                    "created_utc": 1576049230.0,
                    "replies": [
                        {
                            "body": "But does that encompass everyone of a certain body type? Wouldn’t a post around self promotion or sayings how proud you are of yourself be better than pointing to a body type, assuming the OPs past feelings/experiences are what they feel too, and then telling them “how to be better”",
                            "author": null,
                            "id": "fagdfev",
                            "parent_id": "t1_fagdbd7",
                            "score": -2,
                            "created_utc": 1576049376.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Irrelevant to the entire post.",
                    "author": "creamypeaches2",
                    "id": "fagbjcd",
                    "parent_id": "t1_fagb5az",
                    "score": 14,
                    "created_utc": 1576047030.0,
                    "replies": [
                        {
                            "body": "Absolutely not..",
                            "author": null,
                            "id": "fagbk0c",
                            "parent_id": "t1_fagbjcd",
                            "score": -1,
                            "created_utc": 1576047053.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "because society is a trap lmfaoo",
                    "author": "shazzzaa",
                    "id": "fagbuuf",
                    "parent_id": "t1_fagb5az",
                    "score": 0,
                    "created_utc": 1576047416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a good heart and you mean well but to the most part most men and women prefer fit.  I've been on a site called seekingarrangement, and the majority of the ladies who contact me do so because of my height and my looks and my body.  I don't think fat guys get as much work on that site lol.  Confidence IS very important however and being healthy and fit helps a great deal in the process.  Many of my friends are dancers and fitness models and from their experience they've told me that they've always gotten more attention when they look their best.\nIt's one of the reasons why I also train them.  So with that said if u DO have any questions about diet fitness and nutrition or things like the candida or Redmond salt flush, comment below or hit me up.  My advice is free but my training isn't  :)",
            "author": "SpanishIntuition",
            "id": "faigqwo",
            "parent_id": "t3_e92tin",
            "score": 0,
            "created_utc": 1576107437.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fag9jrs",
            "parent_id": "t3_e92tin",
            "score": -16,
            "created_utc": 1576044774.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fagbo26",
            "parent_id": "t3_e92tin",
            "score": -13,
            "created_utc": 1576047190.0,
            "replies": [
                {
                    "body": "Bro even if you were ripped with Christian Ronaldo looks you would struggle to get a SM let alone being overweight",
                    "author": "flylittleman",
                    "id": "faggzzl",
                    "parent_id": "t1_fagbo26",
                    "score": 20,
                    "created_utc": 1576054394.0,
                    "replies": [
                        {
                            "body": "And even then it just means he'd get to bang more for _free_. Turning that into a viable business model?\n\nNot likely.",
                            "author": "SDRippington",
                            "id": "fahh24q",
                            "parent_id": "t1_faggzzl",
                            "score": 5,
                            "created_utc": 1576085775.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeeeeah... unfortunately none of this is really applicable (in an IRL SR pursuit, its always good advice IMO) if you're a dude, particularly one looking for an SM.\n\nQuite unfortunately for us penis-holders,Dick is quite gratis my man...",
                    "author": "sdaddy305",
                    "id": "fageeb0",
                    "parent_id": "t1_fagbo26",
                    "score": 11,
                    "created_utc": 1576050662.0,
                    "replies": []
                },
                {
                    "body": "They’re easier in organic settings.",
                    "author": "creamypeaches2",
                    "id": "fagcbs4",
                    "parent_id": "t1_fagbo26",
                    "score": 4,
                    "created_utc": 1576047978.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "where did you find yours? i’m struggling so hard haha",
            "author": "Quick_Orange_4404",
            "id": "hxe0zgn",
            "parent_id": "t3_e92tin",
            "score": 1,
            "created_utc": 1645148016.0,
            "replies": []
        },
        {
            "body": "You wish, daddy-o.",
            "author": "creamypeaches2",
            "id": "fag727d",
            "parent_id": "t1_fag70v5",
            "score": 70,
            "created_utc": 1576042236.0,
            "replies": []
        },
        {
            "body": "She's pretty hot!",
            "author": "SubBaby",
            "id": "fagvw9w",
            "parent_id": "t1_fag70v5",
            "score": 3,
            "created_utc": 1576072823.0,
            "replies": []
        },
        {
            "body": "I literally read SMF as sugar mother fucker automatically 😂",
            "author": "xolaura5",
            "id": "fag7ilu",
            "parent_id": "t1_fag7crg",
            "score": 11,
            "created_utc": 1576042672.0,
            "replies": []
        },
        {
            "body": "Love it",
            "author": "creamypeaches2",
            "id": "failhpc",
            "parent_id": "t1_fail9zh",
            "score": 2,
            "created_utc": 1576110741.0,
            "replies": []
        },
        {
            "body": "I was lit.",
            "author": "creamypeaches2",
            "id": "fahthnz",
            "parent_id": "t1_fahml7f",
            "score": 13,
            "created_utc": 1576093160.0,
            "replies": []
        },
        {
            "body": "I haven't had the money to until recently. My new job, I'm spending my second big paycheck on makeup and a couple nice outfits.",
            "author": "Sweettooth_dragon",
            "id": "faikk53",
            "parent_id": "t1_faga887",
            "score": 3,
            "created_utc": 1576110090.0,
            "replies": []
        },
        {
            "body": "True",
            "author": "creamypeaches2",
            "id": "fagbiq6",
            "parent_id": "t1_faga887",
            "score": 5,
            "created_utc": 1576047009.0,
            "replies": []
        },
        {
            "body": "You aren’t a BBW baby girl, you’re just plump. Feel free to DM me profile pics and I’ll help!",
            "author": "creamypeaches2",
            "id": "faiw78q",
            "parent_id": "t1_faiq4o9",
            "score": 8,
            "created_utc": 1576118075.0,
            "replies": []
        },
        {
            "body": "Damn straight sister, my booty gets more looks than a gay fashion show.",
            "author": "creamypeaches2",
            "id": "fahtkci",
            "parent_id": "t1_fahj3t9",
            "score": 8,
            "created_utc": 1576093205.0,
            "replies": []
        },
        {
            "body": "Well if you need one :)",
            "author": "skye11299",
            "id": "faoatho",
            "parent_id": "t1_faglw3a",
            "score": 1,
            "created_utc": 1576260562.0,
            "replies": []
        },
        {
            "body": "Love your honesty!",
            "author": "Delicious-Emotion966",
            "id": "i4jtvzq",
            "parent_id": "t1_fam2vfk",
            "score": 1,
            "created_utc": 1649848033.0,
            "replies": []
        },
        {
            "body": "Be extremely good at specific kinks tbh. 😘 that's worked for me.",
            "author": "Sweettooth_dragon",
            "id": "faikowe",
            "parent_id": "t1_fah9wm6",
            "score": 2,
            "created_utc": 1576110183.0,
            "replies": []
        },
        {
            "body": "Not all good advice is packaged as actionable and digestible self help. Telling someone their advice has to be better or they might be counter-productive seems pretty ironic to me.",
            "author": "tra24602",
            "id": "fagfz71",
            "parent_id": "t1_fagdr23",
            "score": 27,
            "created_utc": 1576052853.0,
            "replies": [
                {
                    "body": "Agreed.",
                    "author": "aherdofdustyturtles",
                    "id": "fah511j",
                    "parent_id": "t1_fagfz71",
                    "score": 2,
                    "created_utc": 1576079307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems like you’re searching for negative things. Obviously, everybody has their issues. Obviously, it’s not that simple to just say “be confident” but that’s definitely not what she was trying to say. Her message is all around good and not negative what so ever. I think she’s aware that it takes more than just saying be confident for someone to actually be confident. \n\nI think her point is to work on being confident. When anybody says something like that they *know* it’s not that simple. They mean; work on loving yourself, because you’re beautiful no matter what. \n\nIt goes the same way for “don’t be afraid of your body.” \nWork on it. Work on loving yourself. You’re searching for negative things in an all around positive message.\n\nEdit:  btw, not all helpful messages will be something you want to hear.",
            "author": "mamphylilley",
            "id": "fagqhvh",
            "parent_id": "t1_fagdr23",
            "score": 13,
            "created_utc": 1576067889.0,
            "replies": [
                {
                    "body": "Exactly 🥳",
                    "author": "creamypeaches2",
                    "id": "fakxbs0",
                    "parent_id": "t1_fagqhvh",
                    "score": 1,
                    "created_utc": 1576174701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If someone is so triggered by so many things that are basic essentials of sugaring, it’s clearly not for them. \n\nIf you’re afraid of dogs, don’t apply for dog catcher positions.",
            "author": "whatshouldIdonow8907",
            "id": "fagno49",
            "parent_id": "t1_fagdr23",
            "score": 15,
            "created_utc": 1576064617.0,
            "replies": [
                {
                    "body": "> If you’re afraid of dogs, don’t apply for dog catcher positions.\n\nI like this. Jeeze the cool mental tidbits ya find on SLF. I could start my own bumper-sticker business :-)",
                    "author": "SDRippington",
                    "id": "fahbzq3",
                    "parent_id": "t1_fagno49",
                    "score": 2,
                    "created_utc": 1576083233.0,
                    "replies": []
                },
                {
                    "body": "absolutely. you probably are not in a healthy place to handle being a sb safely if you are not confident or actively working hard and making headway.",
                    "author": "kawaiidi",
                    "id": "faho5eh",
                    "parent_id": "t1_fagno49",
                    "score": 1,
                    "created_utc": 1576089927.0,
                    "replies": []
                },
                {
                    "body": "This!! 👏🏼",
                    "author": "mraspencer",
                    "id": "fags5s4",
                    "parent_id": "t1_fagno49",
                    "score": 0,
                    "created_utc": 1576069554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "Pepperspray24",
            "id": "fah7qlb",
            "parent_id": "t1_fagdr23",
            "score": 2,
            "created_utc": 1576081024.0,
            "replies": []
        },
        {
            "body": "With that kind of attitude...",
            "author": "BlissfulSB",
            "id": "fahiei0",
            "parent_id": "t1_fagdr23",
            "score": 1,
            "created_utc": 1576086461.0,
            "replies": []
        },
        {
            "body": "🎪 🤸🏾‍♂️🤡",
            "author": "brownbaby21",
            "id": "fah34iq",
            "parent_id": "t1_fagtayd",
            "score": 7,
            "created_utc": 1576078067.0,
            "replies": []
        },
        {
            "body": "Be gone with your negativity. Are you a SB ? No ? Then it doesn't apply to you , does it ?",
            "author": "nellybelle1984",
            "id": "fahktv0",
            "parent_id": "t1_fagtayd",
            "score": -1,
            "created_utc": 1576087896.0,
            "replies": [
                {
                    "body": "🙄🙄🙄🙄",
                    "author": null,
                    "id": "faho8ej",
                    "parent_id": "t1_fahktv0",
                    "score": 0,
                    "created_utc": 1576089978.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oh this is supposed to be funny",
            "author": "vulgarlydebonair",
            "id": "fai4cfk",
            "parent_id": "t1_fagtayd",
            "score": 1,
            "created_utc": 1576099576.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fahybf5",
            "parent_id": "t1_fah8emq",
            "score": 10,
            "created_utc": 1576096027.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fai3065",
                    "parent_id": "t1_fahybf5",
                    "score": 2,
                    "created_utc": 1576098787.0,
                    "replies": [
                        {
                            "body": "Right, which is why OP's comment on getting a gym membership is really good advice! I agree, complacency is unhealthy in and of itself, but again, I don't think anyone stated or implied anything about normalizing obesity. I only saw ways to better yourself and to love and accept yourself, which is a very positive message.\nI think it's fantastic that you take such great care of yourself! It takes a lot of self love to get into that mindset, and the above tips are great ways to get started on the road to loving oneself and treating one's body better. :)",
                            "author": "fcandiax",
                            "id": "fai475p",
                            "parent_id": "t1_fai3065",
                            "score": 3,
                            "created_utc": 1576099489.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Absolutely !!!",
                    "author": "creamypeaches2",
                    "id": "fakxhjs",
                    "parent_id": "t1_fahybf5",
                    "score": 1,
                    "created_utc": 1576174778.0,
                    "replies": []
                },
                {
                    "body": "Not to mention that some women already have medical issues that might have caused their weight gain.",
                    "author": "cjkit",
                    "id": "fahyzgc",
                    "parent_id": "t1_fahybf5",
                    "score": 1,
                    "created_utc": 1576096425.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is telling someone to be happy and confident despite their weight \"normalizing\" obesity? OP literally said, \"Invest in yourself. Makeup, clothes, **gym membership**, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out. \"\n\n>gym membership\n\nSome people are overweight despite proper diet and exercise (e.g., hypothyroidism).\n\nThis is simply a post saying to be confident despite weight, leave it at that.\n\nWe're exercising, we're eating healthy, we're going to the doctor, and we're trying to be as healthy as possible. We're bettering ourselves. SO, we do NOT need someone to keep spewing the same bologna that everyone else spews. You don't tell someone with depression that being depressed isn't healthy--lady, WE KNOW it's not healthy.\n\nLmfao, next.",
            "author": "SmittenKittencat",
            "id": "fahvruo",
            "parent_id": "t1_fah8emq",
            "score": 4,
            "created_utc": 1576094514.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fai30td",
                    "parent_id": "t1_fahvruo",
                    "score": 2,
                    "created_utc": 1576098798.0,
                    "replies": [
                        {
                            "body": "My bad! Thanks for the correction",
                            "author": "SmittenKittencat",
                            "id": "faih71z",
                            "parent_id": "t1_fai30td",
                            "score": 1,
                            "created_utc": 1576107744.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I fucking love you 💋",
            "author": "creamypeaches2",
            "id": "fah6f78",
            "parent_id": "t1_fah5hvh",
            "score": 4,
            "created_utc": 1576080193.0,
            "replies": []
        },
        {
            "body": "[https://www.thoughtco.com/regime-regimen-and-regiment-1689480](https://www.thoughtco.com/regime-regimen-and-regiment-1689480)",
            "author": "highfructoseSD",
            "id": "fagkbof",
            "parent_id": "t1_fagfqd3",
            "score": 14,
            "created_utc": 1576059705.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fagl2b7",
                    "parent_id": "t1_fagkbof",
                    "score": 1,
                    "created_utc": 1576060866.0,
                    "replies": [
                        {
                            "body": "[you're welcome](https://collection.nam.ac.uk//images/960/228000-228999/228969.jpg)",
                            "author": "highfructoseSD",
                            "id": "fagndgp",
                            "parent_id": "t1_fagl2b7",
                            "score": 4,
                            "created_utc": 1576064229.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you read number 5?",
            "author": "SmittenKittencat",
            "id": "faisjju",
            "parent_id": "t1_fagfqd3",
            "score": 1,
            "created_utc": 1576115607.0,
            "replies": []
        },
        {
            "body": "No, I haven’t lost weight but I focus a lot of energy on keeping my body in a very nice place. IE: Coke bottle/ hour glass.",
            "author": "creamypeaches2",
            "id": "fag7k9t",
            "parent_id": "t1_fag7d6a",
            "score": 13,
            "created_utc": 1576042719.0,
            "replies": [
                {
                    "body": "> Coke bottle/ hour glass.\n\n\nYou won the genetic lottery and have a body type that is desirable for a wide range of weights. That's what is really driving the fucking boat. The same cannot be said for many plus-size SBs commenting here. Honestly, I feel it's a bit reckless of you. You are encouraging them, but they will only find scammers and trolls.",
                    "author": null,
                    "id": "fahwxn8",
                    "parent_id": "t1_fag7k9t",
                    "score": 5,
                    "created_utc": 1576095206.0,
                    "replies": []
                },
                {
                    "body": "Do you have a goal to? If someone else were overweight, male or female would you encourage them to do so?",
                    "author": "tenmillionplus",
                    "id": "fag82mw",
                    "parent_id": "t1_fag7k9t",
                    "score": -17,
                    "created_utc": 1576043221.0,
                    "replies": [
                        {
                            "body": "Please stop",
                            "author": "brown_bi_babe",
                            "id": "fagbu3c",
                            "parent_id": "t1_fag82mw",
                            "score": 17,
                            "created_utc": 1576047392.0,
                            "replies": []
                        },
                        {
                            "body": "She told you she doesn’t want to lose weight, just move on!",
                            "author": "Lilipuss25",
                            "id": "fagqric",
                            "parent_id": "t1_fag82mw",
                            "score": 5,
                            "created_utc": 1576068167.0,
                            "replies": []
                        },
                        {
                            "body": "OP: Be happy and confident in your body!\nReply: Have you thought about changing your body?\n🙄ffs",
                            "author": "jaguarsharkSD",
                            "id": "fah1s5x",
                            "parent_id": "t1_fag82mw",
                            "score": 1,
                            "created_utc": 1576077163.0,
                            "replies": [
                                {
                                    "body": "Appreciate you white knighting here, and it's perfectly fine to accept yourself as who you are, just don't push others into thinking an unhealthy lifestyle into it either. \n\nIf you're overweight, that is a health risk, in the same way if you're an alcoholic or abuser of drugs. Would there be any acceptance to \"I drink all the time and I'm fine you can do it too\".",
                                    "author": "tenmillionplus",
                                    "id": "fah4l5y",
                                    "parent_id": "t1_fah1s5x",
                                    "score": 5,
                                    "created_utc": 1576079026.0,
                                    "replies": [
                                        {
                                            "body": "So decided to take OPs post and make it about SBs with alcoholism rather than weight issues....\n\n>  \n>  \n>Dear alcoholic sugar babies  \n  \n>  \n>Hello, It’s me. I’m one of you. In fact, I’m probably deeper into my addiction battle than you.  \n>  \n>But, contrary to beliefs. It doesn't impact my SRs. My SDs don't even realize, and I am typically drooled over. And truth be told you probably could too.  \n>  \n>Here’s my list of recommendations.  \n>  \n>1. Be fucking confident. It drives the boat.  \n>  \n>2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang.  \n>  \n>3. Flaunt what you have. I mean, if you have a sense of humour, let it shine. Be a fun person. There's something interesting about you, play it up as best you can.  \n>  \n>4. Don’t be afraid to decline drinks on a date, and you know why. Show them that you don't need to drink for them to have fun with you and drive the fucking boat.  \n>  \n>5. Invest in yourself. Makeup, clothes, therapy, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.  \n>  \n>6. SEDUCTION... google the word. DM if you have questions.  \n>  \n>7. Unleash your inner freak. BOUNCE ON THE DICK.  \n>  \n>Thank you for listening to my drunken TED TALK.\n\n&#x200B;\n\n...\n\nYet, nowhere in this post is it normalizing alcoholism/addiction or pushing it onto others...\n\nJust like how the original post isn't normalizing obesity or pushing it onto others.\n\n&#x200B;\n\nIt's a post telling SBs to be confident about themselves regardless of what they or others may perceive is wrong with them -- **leave it at that**.",
                                            "author": "SmittenKittencat",
                                            "id": "faiixps",
                                            "parent_id": "t1_fah4l5y",
                                            "score": 6,
                                            "created_utc": 1576108947.0,
                                            "replies": [
                                                {
                                                    "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
                                                    "author": "tenmillionplus",
                                                    "id": "faik09j",
                                                    "parent_id": "t1_faiixps",
                                                    "score": 2,
                                                    "created_utc": 1576109702.0,
                                                    "replies": [
                                                        {
                                                            "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                                                            "author": "SmittenKittencat",
                                                            "id": "fairgc1",
                                                            "parent_id": "t1_faik09j",
                                                            "score": 1,
                                                            "created_utc": 1576114865.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                                                                    "author": "tenmillionplus",
                                                                    "id": "faivseo",
                                                                    "parent_id": "t1_fairgc1",
                                                                    "score": 0,
                                                                    "created_utc": 1576117794.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                                                            "author": "SmittenKittencat",
                                                                            "id": "faiw97g",
                                                                            "parent_id": "t1_faivseo",
                                                                            "score": 2,
                                                                            "created_utc": 1576118112.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                                                                    "author": "tenmillionplus",
                                                                                    "id": "faiwfh7",
                                                                                    "parent_id": "t1_faiw97g",
                                                                                    "score": 0,
                                                                                    "created_utc": 1576118233.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Yep, definitely missed the point.",
                                                                                            "author": "SmittenKittencat",
                                                                                            "id": "faizc1l",
                                                                                            "parent_id": "t1_faiwfh7",
                                                                                            "score": 2,
                                                                                            "created_utc": 1576120284.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                                                                    "author": "tenmillionplus",
                                                                                                    "id": "faj2oob",
                                                                                                    "parent_id": "t1_faizc1l",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1576122800.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                                                            "author": "SmittenKittencat",
                                                                                                            "id": "faj3f25",
                                                                                                            "parent_id": "t1_faj2oob",
                                                                                                            "score": 3,
                                                                                                            "created_utc": 1576123372.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                                                                    "author": "Strange_Duckling",
                                                                                                                    "id": "faj455c",
                                                                                                                    "parent_id": "t1_faj3f25",
                                                                                                                    "score": 3,
                                                                                                                    "created_utc": 1576123951.0,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                                                                    "author": "tenmillionplus",
                                                                                                                    "id": "faj50y8",
                                                                                                                    "parent_id": "t1_faj3f25",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1576124668.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                                                            "author": "SmittenKittencat",
                                                                                                                            "id": "faj5myl",
                                                                                                                            "parent_id": "t1_faj50y8",
                                                                                                                            "score": 3,
                                                                                                                            "created_utc": 1576125182.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "body positive SB here. i agree. love your body. strive to be healthy. if you're overweight, there are associated health risks. period. doesnt  mean you're not attractive if youre a bit overweight!",
                                            "author": null,
                                            "id": "fah5z0g",
                                            "parent_id": "t1_fah4l5y",
                                            "score": 3,
                                            "created_utc": 1576079903.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "https://goodmenproject.com/ethics-values/are-you-concerned-or-just-concern-trolling-hesaid/",
                                            "author": "jaguarsharkSD",
                                            "id": "fahcd60",
                                            "parent_id": "t1_fah4l5y",
                                            "score": 2,
                                            "created_utc": 1576083418.0,
                                            "replies": [
                                                {
                                                    "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
                                                    "author": "ZealPrincess",
                                                    "id": "fahgpcx",
                                                    "parent_id": "t1_fahcd60",
                                                    "score": 3,
                                                    "created_utc": 1576085591.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmm... this peaked my curiosity what are these things she's presumably doing?",
            "author": null,
            "id": "fah4zs2",
            "parent_id": "t1_fah1xg3",
            "score": 3,
            "created_utc": 1576079284.0,
            "replies": [
                {
                    "body": "Minor nit: it's \"piqued\" not \"peaked\"",
                    "author": null,
                    "id": "fah73nn",
                    "parent_id": "t1_fah4zs2",
                    "score": 7,
                    "created_utc": 1576080629.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "faheod3",
                    "parent_id": "t1_fah4zs2",
                    "score": 3,
                    "created_utc": 1576084575.0,
                    "replies": [
                        {
                            "body": "This is a weird thing to say.  Why would you assume that she wouldn't be sexually adventurous/kinky with a vanilla partner?  Or that she should do things she's \"not otherwise comfortable with\" to land an arrangement?   There are plenty of women who LOVE uncomfortable, degrading sex - we don't need to start telling women to \"compromise\" and do it anyway if they don't, Jesus Christ.",
                            "author": "BluebelleBaby",
                            "id": "fajwzql",
                            "parent_id": "t1_faheod3",
                            "score": 0,
                            "created_utc": 1576156474.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fajzut7",
                                    "parent_id": "t1_fajwzql",
                                    "score": 1,
                                    "created_utc": 1576158164.0,
                                    "replies": [
                                        {
                                            "body": "Did you read what you wrote?  I'm willing to believe that you just didn't convey your meaning well, but why the repeated reference to \"things she wouldn't otherwise do\"?  That's a pretty clear implication that these \"things\" aren't something she enjoys in general, she would only be tolerating them to make herself more appealing.  People who genuinely enjoy rough, degrading sex do it with their vanilla partners, they do it \"otherwise\".",
                                            "author": "BluebelleBaby",
                                            "id": "fak23aa",
                                            "parent_id": "t1_fajzut7",
                                            "score": 0,
                                            "created_utc": 1576159422.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fakcft7",
                                                    "parent_id": "t1_fak23aa",
                                                    "score": 1,
                                                    "created_utc": 1576164746.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                                                            "author": "BluebelleBaby",
                                                            "id": "fakh906",
                                                            "parent_id": "t1_fakcft7",
                                                            "score": 1,
                                                            "created_utc": 1576167103.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tysm 😛",
            "author": "creamypeaches2",
            "id": "fakxktu",
            "parent_id": "t1_fagizaj",
            "score": 1,
            "created_utc": 1576174822.0,
            "replies": []
        },
        {
            "body": "That’s not feedback that’s just bashing bigger people.",
            "author": "cjkit",
            "id": "fagqfu7",
            "parent_id": "t1_fagjdzm",
            "score": 15,
            "created_utc": 1576067828.0,
            "replies": [
                {
                    "body": "Not bashing. Just stating the truth, at least the fat people I've met.",
                    "author": null,
                    "id": "fai3vcr",
                    "parent_id": "t1_fagqfu7",
                    "score": -1,
                    "created_utc": 1576099298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fagkdce",
            "parent_id": "t1_fagjdzm",
            "score": 16,
            "created_utc": 1576059779.0,
            "replies": [
                {
                    "body": "Nah - he hates himself and can’t stand to see anyone else happy.",
                    "author": null,
                    "id": "fagz4hk",
                    "parent_id": "t1_fagkdce",
                    "score": 13,
                    "created_utc": 1576075273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t know about you other thick girls, but I smell like the Tom Ford Tobacco Vanille perfume my SBF bought me.",
            "author": "vulgarlydebonair",
            "id": "fah8nby",
            "parent_id": "t1_fagjdzm",
            "score": 9,
            "created_utc": 1576081532.0,
            "replies": []
        },
        {
            "body": "I’m so glad you speak for the entirety of the male gender. You sound like you’re the life of the party. Go away, asshole",
            "author": null,
            "id": "fagr9ag",
            "parent_id": "t1_fagjdzm",
            "score": 14,
            "created_utc": 1576068674.0,
            "replies": [
                {
                    "body": "Exactly! How does he know what *all* men like? Who died and made you king of the fucking jungle?\nI hope this guy never gets laid.",
                    "author": "SubBaby",
                    "id": "fagunq4",
                    "parent_id": "t1_fagr9ag",
                    "score": 13,
                    "created_utc": 1576071805.0,
                    "replies": [
                        {
                            "body": "> Who died and made you king of the fucking jungle?\n\nOh he's welcome to it. Jungles suck. Hot. Damp. Bugs. Itchy. Many things in it are poison or give you a rash. Kidnapped by cartels. Fuck that.",
                            "author": "SDRippington",
                            "id": "fahcd5j",
                            "parent_id": "t1_fagunq4",
                            "score": 6,
                            "created_utc": 1576083418.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣",
                                    "author": "OliviaWildflower2332",
                                    "id": "faj0je6",
                                    "parent_id": "t1_fahcd5j",
                                    "score": 3,
                                    "created_utc": 1576121167.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Honestly, I am. Just being honest.",
                    "author": null,
                    "id": "fai1cab",
                    "parent_id": "t1_fagr9ag",
                    "score": -2,
                    "created_utc": 1576097810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love how you assume all fat people smell. Yes, there are fat people who don't clean themselves properly, but that is not all of us. And not all men are turned off by fat women. There is so much hate in this world, why not spread encouragement???  You also never know why someone has become fat. There is a lot of reasons. And FYI food is an addiction just like heroin and many people struggle more so because your body needs food for fuel, so before you judge, do some damn research on the obesity epidemic and try approaching all humans with understanding.",
            "author": "sxyhtslky2",
            "id": "faglc6a",
            "parent_id": "t1_fagjdzm",
            "score": 12,
            "created_utc": 1576061289.0,
            "replies": [
                {
                    "body": "stankiest dude i ever worked with was 110 pounds. 🤷🏻‍♂️",
                    "author": "menominom",
                    "id": "fagzszw",
                    "parent_id": "t1_faglc6a",
                    "score": 10,
                    "created_utc": 1576075762.0,
                    "replies": [
                        {
                            "body": "Right?? Cleanliness isn't about body size.",
                            "author": "sxyhtslky2",
                            "id": "fah01u4",
                            "parent_id": "t1_fagzszw",
                            "score": 7,
                            "created_utc": 1576075936.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Obviously you're not very good at reading. I said the fat people I met smelled. I didn't assume anything. It's all facts.",
                    "author": null,
                    "id": "falbkp4",
                    "parent_id": "t1_faglc6a",
                    "score": 1,
                    "created_utc": 1576181639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thats a lot of words for i am fat phobic. Gtfoh",
            "author": "OliviaWildflower2332",
            "id": "fagrc1y",
            "parent_id": "t1_fagjdzm",
            "score": 13,
            "created_utc": 1576068753.0,
            "replies": []
        },
        {
            "body": "First off, bones are for dogs and meat is for men. \n\nBut seriously bro - how unhappy are you?  Why do the most unhappy people try to have everyone else share your misery?  Do yourself (and the world) a favor and focus on what makes you happy rather than shitting on other people.",
            "author": null,
            "id": "fagz2h3",
            "parent_id": "t1_fagjdzm",
            "score": 5,
            "created_utc": 1576075233.0,
            "replies": [
                {
                    "body": "Haha I definitely have used the bones for doggies statement before! Very freaking true.",
                    "author": "macaroonqueen",
                    "id": "fah4yfm",
                    "parent_id": "t1_fagz2h3",
                    "score": 3,
                    "created_utc": 1576079260.0,
                    "replies": [
                        {
                            "body": "Have you seen the meme?  It might be the hottest picture I’ve ever seen.",
                            "author": null,
                            "id": "fahctqs",
                            "parent_id": "t1_fah4yfm",
                            "score": 1,
                            "created_utc": 1576083646.0,
                            "replies": [
                                {
                                    "body": "No I haven't! Now I want to",
                                    "author": "macaroonqueen",
                                    "id": "fahln99",
                                    "parent_id": "t1_fahctqs",
                                    "score": 4,
                                    "created_utc": 1576088405.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "When you make a statement about not shitting on people but just called skinny people bones. Okay",
                    "author": "ZealPrincess",
                    "id": "fahhbkd",
                    "parent_id": "t1_fagz2h3",
                    "score": 3,
                    "created_utc": 1576085913.0,
                    "replies": [
                        {
                            "body": "Fair point, though I bristle at the notion that my reply was tonally equivalent to the OP",
                            "author": null,
                            "id": "fahikm4",
                            "parent_id": "t1_fahhbkd",
                            "score": 4,
                            "created_utc": 1576086548.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fagdbd7",
            "parent_id": "t1_fagb5az",
            "score": 22,
            "created_utc": 1576049230.0,
            "replies": [
                {
                    "body": "But does that encompass everyone of a certain body type? Wouldn’t a post around self promotion or sayings how proud you are of yourself be better than pointing to a body type, assuming the OPs past feelings/experiences are what they feel too, and then telling them “how to be better”",
                    "author": null,
                    "id": "fagdfev",
                    "parent_id": "t1_fagdbd7",
                    "score": -2,
                    "created_utc": 1576049376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Irrelevant to the entire post.",
            "author": "creamypeaches2",
            "id": "fagbjcd",
            "parent_id": "t1_fagb5az",
            "score": 14,
            "created_utc": 1576047030.0,
            "replies": [
                {
                    "body": "Absolutely not..",
                    "author": null,
                    "id": "fagbk0c",
                    "parent_id": "t1_fagbjcd",
                    "score": -1,
                    "created_utc": 1576047053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "because society is a trap lmfaoo",
            "author": "shazzzaa",
            "id": "fagbuuf",
            "parent_id": "t1_fagb5az",
            "score": 0,
            "created_utc": 1576047416.0,
            "replies": []
        },
        {
            "body": "Bro even if you were ripped with Christian Ronaldo looks you would struggle to get a SM let alone being overweight",
            "author": "flylittleman",
            "id": "faggzzl",
            "parent_id": "t1_fagbo26",
            "score": 20,
            "created_utc": 1576054394.0,
            "replies": [
                {
                    "body": "And even then it just means he'd get to bang more for _free_. Turning that into a viable business model?\n\nNot likely.",
                    "author": "SDRippington",
                    "id": "fahh24q",
                    "parent_id": "t1_faggzzl",
                    "score": 5,
                    "created_utc": 1576085775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeeeeah... unfortunately none of this is really applicable (in an IRL SR pursuit, its always good advice IMO) if you're a dude, particularly one looking for an SM.\n\nQuite unfortunately for us penis-holders,Dick is quite gratis my man...",
            "author": "sdaddy305",
            "id": "fageeb0",
            "parent_id": "t1_fagbo26",
            "score": 11,
            "created_utc": 1576050662.0,
            "replies": []
        },
        {
            "body": "They’re easier in organic settings.",
            "author": "creamypeaches2",
            "id": "fagcbs4",
            "parent_id": "t1_fagbo26",
            "score": 4,
            "created_utc": 1576047978.0,
            "replies": []
        },
        {
            "body": "Agreed.",
            "author": "aherdofdustyturtles",
            "id": "fah511j",
            "parent_id": "t1_fagfz71",
            "score": 2,
            "created_utc": 1576079307.0,
            "replies": []
        },
        {
            "body": "Exactly 🥳",
            "author": "creamypeaches2",
            "id": "fakxbs0",
            "parent_id": "t1_fagqhvh",
            "score": 1,
            "created_utc": 1576174701.0,
            "replies": []
        },
        {
            "body": "> If you’re afraid of dogs, don’t apply for dog catcher positions.\n\nI like this. Jeeze the cool mental tidbits ya find on SLF. I could start my own bumper-sticker business :-)",
            "author": "SDRippington",
            "id": "fahbzq3",
            "parent_id": "t1_fagno49",
            "score": 2,
            "created_utc": 1576083233.0,
            "replies": []
        },
        {
            "body": "absolutely. you probably are not in a healthy place to handle being a sb safely if you are not confident or actively working hard and making headway.",
            "author": "kawaiidi",
            "id": "faho5eh",
            "parent_id": "t1_fagno49",
            "score": 1,
            "created_utc": 1576089927.0,
            "replies": []
        },
        {
            "body": "This!! 👏🏼",
            "author": "mraspencer",
            "id": "fags5s4",
            "parent_id": "t1_fagno49",
            "score": 0,
            "created_utc": 1576069554.0,
            "replies": []
        },
        {
            "body": "🙄🙄🙄🙄",
            "author": null,
            "id": "faho8ej",
            "parent_id": "t1_fahktv0",
            "score": 0,
            "created_utc": 1576089978.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fai3065",
            "parent_id": "t1_fahybf5",
            "score": 2,
            "created_utc": 1576098787.0,
            "replies": [
                {
                    "body": "Right, which is why OP's comment on getting a gym membership is really good advice! I agree, complacency is unhealthy in and of itself, but again, I don't think anyone stated or implied anything about normalizing obesity. I only saw ways to better yourself and to love and accept yourself, which is a very positive message.\nI think it's fantastic that you take such great care of yourself! It takes a lot of self love to get into that mindset, and the above tips are great ways to get started on the road to loving oneself and treating one's body better. :)",
                    "author": "fcandiax",
                    "id": "fai475p",
                    "parent_id": "t1_fai3065",
                    "score": 3,
                    "created_utc": 1576099489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely !!!",
            "author": "creamypeaches2",
            "id": "fakxhjs",
            "parent_id": "t1_fahybf5",
            "score": 1,
            "created_utc": 1576174778.0,
            "replies": []
        },
        {
            "body": "Not to mention that some women already have medical issues that might have caused their weight gain.",
            "author": "cjkit",
            "id": "fahyzgc",
            "parent_id": "t1_fahybf5",
            "score": 1,
            "created_utc": 1576096425.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fai30td",
            "parent_id": "t1_fahvruo",
            "score": 2,
            "created_utc": 1576098798.0,
            "replies": [
                {
                    "body": "My bad! Thanks for the correction",
                    "author": "SmittenKittencat",
                    "id": "faih71z",
                    "parent_id": "t1_fai30td",
                    "score": 1,
                    "created_utc": 1576107744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fagl2b7",
            "parent_id": "t1_fagkbof",
            "score": 1,
            "created_utc": 1576060866.0,
            "replies": [
                {
                    "body": "[you're welcome](https://collection.nam.ac.uk//images/960/228000-228999/228969.jpg)",
                    "author": "highfructoseSD",
                    "id": "fagndgp",
                    "parent_id": "t1_fagl2b7",
                    "score": 4,
                    "created_utc": 1576064229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Coke bottle/ hour glass.\n\n\nYou won the genetic lottery and have a body type that is desirable for a wide range of weights. That's what is really driving the fucking boat. The same cannot be said for many plus-size SBs commenting here. Honestly, I feel it's a bit reckless of you. You are encouraging them, but they will only find scammers and trolls.",
            "author": null,
            "id": "fahwxn8",
            "parent_id": "t1_fag7k9t",
            "score": 5,
            "created_utc": 1576095206.0,
            "replies": []
        },
        {
            "body": "Do you have a goal to? If someone else were overweight, male or female would you encourage them to do so?",
            "author": "tenmillionplus",
            "id": "fag82mw",
            "parent_id": "t1_fag7k9t",
            "score": -17,
            "created_utc": 1576043221.0,
            "replies": [
                {
                    "body": "Please stop",
                    "author": "brown_bi_babe",
                    "id": "fagbu3c",
                    "parent_id": "t1_fag82mw",
                    "score": 17,
                    "created_utc": 1576047392.0,
                    "replies": []
                },
                {
                    "body": "She told you she doesn’t want to lose weight, just move on!",
                    "author": "Lilipuss25",
                    "id": "fagqric",
                    "parent_id": "t1_fag82mw",
                    "score": 5,
                    "created_utc": 1576068167.0,
                    "replies": []
                },
                {
                    "body": "OP: Be happy and confident in your body!\nReply: Have you thought about changing your body?\n🙄ffs",
                    "author": "jaguarsharkSD",
                    "id": "fah1s5x",
                    "parent_id": "t1_fag82mw",
                    "score": 1,
                    "created_utc": 1576077163.0,
                    "replies": [
                        {
                            "body": "Appreciate you white knighting here, and it's perfectly fine to accept yourself as who you are, just don't push others into thinking an unhealthy lifestyle into it either. \n\nIf you're overweight, that is a health risk, in the same way if you're an alcoholic or abuser of drugs. Would there be any acceptance to \"I drink all the time and I'm fine you can do it too\".",
                            "author": "tenmillionplus",
                            "id": "fah4l5y",
                            "parent_id": "t1_fah1s5x",
                            "score": 5,
                            "created_utc": 1576079026.0,
                            "replies": [
                                {
                                    "body": "So decided to take OPs post and make it about SBs with alcoholism rather than weight issues....\n\n>  \n>  \n>Dear alcoholic sugar babies  \n  \n>  \n>Hello, It’s me. I’m one of you. In fact, I’m probably deeper into my addiction battle than you.  \n>  \n>But, contrary to beliefs. It doesn't impact my SRs. My SDs don't even realize, and I am typically drooled over. And truth be told you probably could too.  \n>  \n>Here’s my list of recommendations.  \n>  \n>1. Be fucking confident. It drives the boat.  \n>  \n>2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang.  \n>  \n>3. Flaunt what you have. I mean, if you have a sense of humour, let it shine. Be a fun person. There's something interesting about you, play it up as best you can.  \n>  \n>4. Don’t be afraid to decline drinks on a date, and you know why. Show them that you don't need to drink for them to have fun with you and drive the fucking boat.  \n>  \n>5. Invest in yourself. Makeup, clothes, therapy, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.  \n>  \n>6. SEDUCTION... google the word. DM if you have questions.  \n>  \n>7. Unleash your inner freak. BOUNCE ON THE DICK.  \n>  \n>Thank you for listening to my drunken TED TALK.\n\n&#x200B;\n\n...\n\nYet, nowhere in this post is it normalizing alcoholism/addiction or pushing it onto others...\n\nJust like how the original post isn't normalizing obesity or pushing it onto others.\n\n&#x200B;\n\nIt's a post telling SBs to be confident about themselves regardless of what they or others may perceive is wrong with them -- **leave it at that**.",
                                    "author": "SmittenKittencat",
                                    "id": "faiixps",
                                    "parent_id": "t1_fah4l5y",
                                    "score": 6,
                                    "created_utc": 1576108947.0,
                                    "replies": [
                                        {
                                            "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
                                            "author": "tenmillionplus",
                                            "id": "faik09j",
                                            "parent_id": "t1_faiixps",
                                            "score": 2,
                                            "created_utc": 1576109702.0,
                                            "replies": [
                                                {
                                                    "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                                                    "author": "SmittenKittencat",
                                                    "id": "fairgc1",
                                                    "parent_id": "t1_faik09j",
                                                    "score": 1,
                                                    "created_utc": 1576114865.0,
                                                    "replies": [
                                                        {
                                                            "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                                                            "author": "tenmillionplus",
                                                            "id": "faivseo",
                                                            "parent_id": "t1_fairgc1",
                                                            "score": 0,
                                                            "created_utc": 1576117794.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                                                    "author": "SmittenKittencat",
                                                                    "id": "faiw97g",
                                                                    "parent_id": "t1_faivseo",
                                                                    "score": 2,
                                                                    "created_utc": 1576118112.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                                                            "author": "tenmillionplus",
                                                                            "id": "faiwfh7",
                                                                            "parent_id": "t1_faiw97g",
                                                                            "score": 0,
                                                                            "created_utc": 1576118233.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yep, definitely missed the point.",
                                                                                    "author": "SmittenKittencat",
                                                                                    "id": "faizc1l",
                                                                                    "parent_id": "t1_faiwfh7",
                                                                                    "score": 2,
                                                                                    "created_utc": 1576120284.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                                                            "author": "tenmillionplus",
                                                                                            "id": "faj2oob",
                                                                                            "parent_id": "t1_faizc1l",
                                                                                            "score": 0,
                                                                                            "created_utc": 1576122800.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                                                    "author": "SmittenKittencat",
                                                                                                    "id": "faj3f25",
                                                                                                    "parent_id": "t1_faj2oob",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1576123372.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                                                            "author": "Strange_Duckling",
                                                                                                            "id": "faj455c",
                                                                                                            "parent_id": "t1_faj3f25",
                                                                                                            "score": 3,
                                                                                                            "created_utc": 1576123951.0,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                                                            "author": "tenmillionplus",
                                                                                                            "id": "faj50y8",
                                                                                                            "parent_id": "t1_faj3f25",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1576124668.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                                                    "author": "SmittenKittencat",
                                                                                                                    "id": "faj5myl",
                                                                                                                    "parent_id": "t1_faj50y8",
                                                                                                                    "score": 3,
                                                                                                                    "created_utc": 1576125182.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "body positive SB here. i agree. love your body. strive to be healthy. if you're overweight, there are associated health risks. period. doesnt  mean you're not attractive if youre a bit overweight!",
                                    "author": null,
                                    "id": "fah5z0g",
                                    "parent_id": "t1_fah4l5y",
                                    "score": 3,
                                    "created_utc": 1576079903.0,
                                    "replies": []
                                },
                                {
                                    "body": "https://goodmenproject.com/ethics-values/are-you-concerned-or-just-concern-trolling-hesaid/",
                                    "author": "jaguarsharkSD",
                                    "id": "fahcd60",
                                    "parent_id": "t1_fah4l5y",
                                    "score": 2,
                                    "created_utc": 1576083418.0,
                                    "replies": [
                                        {
                                            "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
                                            "author": "ZealPrincess",
                                            "id": "fahgpcx",
                                            "parent_id": "t1_fahcd60",
                                            "score": 3,
                                            "created_utc": 1576085591.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Minor nit: it's \"piqued\" not \"peaked\"",
            "author": null,
            "id": "fah73nn",
            "parent_id": "t1_fah4zs2",
            "score": 7,
            "created_utc": 1576080629.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "faheod3",
            "parent_id": "t1_fah4zs2",
            "score": 3,
            "created_utc": 1576084575.0,
            "replies": [
                {
                    "body": "This is a weird thing to say.  Why would you assume that she wouldn't be sexually adventurous/kinky with a vanilla partner?  Or that she should do things she's \"not otherwise comfortable with\" to land an arrangement?   There are plenty of women who LOVE uncomfortable, degrading sex - we don't need to start telling women to \"compromise\" and do it anyway if they don't, Jesus Christ.",
                    "author": "BluebelleBaby",
                    "id": "fajwzql",
                    "parent_id": "t1_faheod3",
                    "score": 0,
                    "created_utc": 1576156474.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fajzut7",
                            "parent_id": "t1_fajwzql",
                            "score": 1,
                            "created_utc": 1576158164.0,
                            "replies": [
                                {
                                    "body": "Did you read what you wrote?  I'm willing to believe that you just didn't convey your meaning well, but why the repeated reference to \"things she wouldn't otherwise do\"?  That's a pretty clear implication that these \"things\" aren't something she enjoys in general, she would only be tolerating them to make herself more appealing.  People who genuinely enjoy rough, degrading sex do it with their vanilla partners, they do it \"otherwise\".",
                                    "author": "BluebelleBaby",
                                    "id": "fak23aa",
                                    "parent_id": "t1_fajzut7",
                                    "score": 0,
                                    "created_utc": 1576159422.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fakcft7",
                                            "parent_id": "t1_fak23aa",
                                            "score": 1,
                                            "created_utc": 1576164746.0,
                                            "replies": [
                                                {
                                                    "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                                                    "author": "BluebelleBaby",
                                                    "id": "fakh906",
                                                    "parent_id": "t1_fakcft7",
                                                    "score": 1,
                                                    "created_utc": 1576167103.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not bashing. Just stating the truth, at least the fat people I've met.",
            "author": null,
            "id": "fai3vcr",
            "parent_id": "t1_fagqfu7",
            "score": -1,
            "created_utc": 1576099298.0,
            "replies": []
        },
        {
            "body": "Nah - he hates himself and can’t stand to see anyone else happy.",
            "author": null,
            "id": "fagz4hk",
            "parent_id": "t1_fagkdce",
            "score": 13,
            "created_utc": 1576075273.0,
            "replies": []
        },
        {
            "body": "Exactly! How does he know what *all* men like? Who died and made you king of the fucking jungle?\nI hope this guy never gets laid.",
            "author": "SubBaby",
            "id": "fagunq4",
            "parent_id": "t1_fagr9ag",
            "score": 13,
            "created_utc": 1576071805.0,
            "replies": [
                {
                    "body": "> Who died and made you king of the fucking jungle?\n\nOh he's welcome to it. Jungles suck. Hot. Damp. Bugs. Itchy. Many things in it are poison or give you a rash. Kidnapped by cartels. Fuck that.",
                    "author": "SDRippington",
                    "id": "fahcd5j",
                    "parent_id": "t1_fagunq4",
                    "score": 6,
                    "created_utc": 1576083418.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣",
                            "author": "OliviaWildflower2332",
                            "id": "faj0je6",
                            "parent_id": "t1_fahcd5j",
                            "score": 3,
                            "created_utc": 1576121167.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, I am. Just being honest.",
            "author": null,
            "id": "fai1cab",
            "parent_id": "t1_fagr9ag",
            "score": -2,
            "created_utc": 1576097810.0,
            "replies": []
        },
        {
            "body": "stankiest dude i ever worked with was 110 pounds. 🤷🏻‍♂️",
            "author": "menominom",
            "id": "fagzszw",
            "parent_id": "t1_faglc6a",
            "score": 10,
            "created_utc": 1576075762.0,
            "replies": [
                {
                    "body": "Right?? Cleanliness isn't about body size.",
                    "author": "sxyhtslky2",
                    "id": "fah01u4",
                    "parent_id": "t1_fagzszw",
                    "score": 7,
                    "created_utc": 1576075936.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Obviously you're not very good at reading. I said the fat people I met smelled. I didn't assume anything. It's all facts.",
            "author": null,
            "id": "falbkp4",
            "parent_id": "t1_faglc6a",
            "score": 1,
            "created_utc": 1576181639.0,
            "replies": []
        },
        {
            "body": "Haha I definitely have used the bones for doggies statement before! Very freaking true.",
            "author": "macaroonqueen",
            "id": "fah4yfm",
            "parent_id": "t1_fagz2h3",
            "score": 3,
            "created_utc": 1576079260.0,
            "replies": [
                {
                    "body": "Have you seen the meme?  It might be the hottest picture I’ve ever seen.",
                    "author": null,
                    "id": "fahctqs",
                    "parent_id": "t1_fah4yfm",
                    "score": 1,
                    "created_utc": 1576083646.0,
                    "replies": [
                        {
                            "body": "No I haven't! Now I want to",
                            "author": "macaroonqueen",
                            "id": "fahln99",
                            "parent_id": "t1_fahctqs",
                            "score": 4,
                            "created_utc": 1576088405.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When you make a statement about not shitting on people but just called skinny people bones. Okay",
            "author": "ZealPrincess",
            "id": "fahhbkd",
            "parent_id": "t1_fagz2h3",
            "score": 3,
            "created_utc": 1576085913.0,
            "replies": [
                {
                    "body": "Fair point, though I bristle at the notion that my reply was tonally equivalent to the OP",
                    "author": null,
                    "id": "fahikm4",
                    "parent_id": "t1_fahhbkd",
                    "score": 4,
                    "created_utc": 1576086548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But does that encompass everyone of a certain body type? Wouldn’t a post around self promotion or sayings how proud you are of yourself be better than pointing to a body type, assuming the OPs past feelings/experiences are what they feel too, and then telling them “how to be better”",
            "author": null,
            "id": "fagdfev",
            "parent_id": "t1_fagdbd7",
            "score": -2,
            "created_utc": 1576049376.0,
            "replies": []
        },
        {
            "body": "Absolutely not..",
            "author": null,
            "id": "fagbk0c",
            "parent_id": "t1_fagbjcd",
            "score": -1,
            "created_utc": 1576047053.0,
            "replies": []
        },
        {
            "body": "And even then it just means he'd get to bang more for _free_. Turning that into a viable business model?\n\nNot likely.",
            "author": "SDRippington",
            "id": "fahh24q",
            "parent_id": "t1_faggzzl",
            "score": 5,
            "created_utc": 1576085775.0,
            "replies": []
        },
        {
            "body": "Right, which is why OP's comment on getting a gym membership is really good advice! I agree, complacency is unhealthy in and of itself, but again, I don't think anyone stated or implied anything about normalizing obesity. I only saw ways to better yourself and to love and accept yourself, which is a very positive message.\nI think it's fantastic that you take such great care of yourself! It takes a lot of self love to get into that mindset, and the above tips are great ways to get started on the road to loving oneself and treating one's body better. :)",
            "author": "fcandiax",
            "id": "fai475p",
            "parent_id": "t1_fai3065",
            "score": 3,
            "created_utc": 1576099489.0,
            "replies": []
        },
        {
            "body": "My bad! Thanks for the correction",
            "author": "SmittenKittencat",
            "id": "faih71z",
            "parent_id": "t1_fai30td",
            "score": 1,
            "created_utc": 1576107744.0,
            "replies": []
        },
        {
            "body": "[you're welcome](https://collection.nam.ac.uk//images/960/228000-228999/228969.jpg)",
            "author": "highfructoseSD",
            "id": "fagndgp",
            "parent_id": "t1_fagl2b7",
            "score": 4,
            "created_utc": 1576064229.0,
            "replies": []
        },
        {
            "body": "Please stop",
            "author": "brown_bi_babe",
            "id": "fagbu3c",
            "parent_id": "t1_fag82mw",
            "score": 17,
            "created_utc": 1576047392.0,
            "replies": []
        },
        {
            "body": "She told you she doesn’t want to lose weight, just move on!",
            "author": "Lilipuss25",
            "id": "fagqric",
            "parent_id": "t1_fag82mw",
            "score": 5,
            "created_utc": 1576068167.0,
            "replies": []
        },
        {
            "body": "OP: Be happy and confident in your body!\nReply: Have you thought about changing your body?\n🙄ffs",
            "author": "jaguarsharkSD",
            "id": "fah1s5x",
            "parent_id": "t1_fag82mw",
            "score": 1,
            "created_utc": 1576077163.0,
            "replies": [
                {
                    "body": "Appreciate you white knighting here, and it's perfectly fine to accept yourself as who you are, just don't push others into thinking an unhealthy lifestyle into it either. \n\nIf you're overweight, that is a health risk, in the same way if you're an alcoholic or abuser of drugs. Would there be any acceptance to \"I drink all the time and I'm fine you can do it too\".",
                    "author": "tenmillionplus",
                    "id": "fah4l5y",
                    "parent_id": "t1_fah1s5x",
                    "score": 5,
                    "created_utc": 1576079026.0,
                    "replies": [
                        {
                            "body": "So decided to take OPs post and make it about SBs with alcoholism rather than weight issues....\n\n>  \n>  \n>Dear alcoholic sugar babies  \n  \n>  \n>Hello, It’s me. I’m one of you. In fact, I’m probably deeper into my addiction battle than you.  \n>  \n>But, contrary to beliefs. It doesn't impact my SRs. My SDs don't even realize, and I am typically drooled over. And truth be told you probably could too.  \n>  \n>Here’s my list of recommendations.  \n>  \n>1. Be fucking confident. It drives the boat.  \n>  \n>2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang.  \n>  \n>3. Flaunt what you have. I mean, if you have a sense of humour, let it shine. Be a fun person. There's something interesting about you, play it up as best you can.  \n>  \n>4. Don’t be afraid to decline drinks on a date, and you know why. Show them that you don't need to drink for them to have fun with you and drive the fucking boat.  \n>  \n>5. Invest in yourself. Makeup, clothes, therapy, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.  \n>  \n>6. SEDUCTION... google the word. DM if you have questions.  \n>  \n>7. Unleash your inner freak. BOUNCE ON THE DICK.  \n>  \n>Thank you for listening to my drunken TED TALK.\n\n&#x200B;\n\n...\n\nYet, nowhere in this post is it normalizing alcoholism/addiction or pushing it onto others...\n\nJust like how the original post isn't normalizing obesity or pushing it onto others.\n\n&#x200B;\n\nIt's a post telling SBs to be confident about themselves regardless of what they or others may perceive is wrong with them -- **leave it at that**.",
                            "author": "SmittenKittencat",
                            "id": "faiixps",
                            "parent_id": "t1_fah4l5y",
                            "score": 6,
                            "created_utc": 1576108947.0,
                            "replies": [
                                {
                                    "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
                                    "author": "tenmillionplus",
                                    "id": "faik09j",
                                    "parent_id": "t1_faiixps",
                                    "score": 2,
                                    "created_utc": 1576109702.0,
                                    "replies": [
                                        {
                                            "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                                            "author": "SmittenKittencat",
                                            "id": "fairgc1",
                                            "parent_id": "t1_faik09j",
                                            "score": 1,
                                            "created_utc": 1576114865.0,
                                            "replies": [
                                                {
                                                    "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                                                    "author": "tenmillionplus",
                                                    "id": "faivseo",
                                                    "parent_id": "t1_fairgc1",
                                                    "score": 0,
                                                    "created_utc": 1576117794.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                                            "author": "SmittenKittencat",
                                                            "id": "faiw97g",
                                                            "parent_id": "t1_faivseo",
                                                            "score": 2,
                                                            "created_utc": 1576118112.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                                                    "author": "tenmillionplus",
                                                                    "id": "faiwfh7",
                                                                    "parent_id": "t1_faiw97g",
                                                                    "score": 0,
                                                                    "created_utc": 1576118233.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yep, definitely missed the point.",
                                                                            "author": "SmittenKittencat",
                                                                            "id": "faizc1l",
                                                                            "parent_id": "t1_faiwfh7",
                                                                            "score": 2,
                                                                            "created_utc": 1576120284.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                                                    "author": "tenmillionplus",
                                                                                    "id": "faj2oob",
                                                                                    "parent_id": "t1_faizc1l",
                                                                                    "score": 0,
                                                                                    "created_utc": 1576122800.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                                            "author": "SmittenKittencat",
                                                                                            "id": "faj3f25",
                                                                                            "parent_id": "t1_faj2oob",
                                                                                            "score": 3,
                                                                                            "created_utc": 1576123372.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                                                    "author": "Strange_Duckling",
                                                                                                    "id": "faj455c",
                                                                                                    "parent_id": "t1_faj3f25",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1576123951.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                                                    "author": "tenmillionplus",
                                                                                                    "id": "faj50y8",
                                                                                                    "parent_id": "t1_faj3f25",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1576124668.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                                            "author": "SmittenKittencat",
                                                                                                            "id": "faj5myl",
                                                                                                            "parent_id": "t1_faj50y8",
                                                                                                            "score": 3,
                                                                                                            "created_utc": 1576125182.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "body positive SB here. i agree. love your body. strive to be healthy. if you're overweight, there are associated health risks. period. doesnt  mean you're not attractive if youre a bit overweight!",
                            "author": null,
                            "id": "fah5z0g",
                            "parent_id": "t1_fah4l5y",
                            "score": 3,
                            "created_utc": 1576079903.0,
                            "replies": []
                        },
                        {
                            "body": "https://goodmenproject.com/ethics-values/are-you-concerned-or-just-concern-trolling-hesaid/",
                            "author": "jaguarsharkSD",
                            "id": "fahcd60",
                            "parent_id": "t1_fah4l5y",
                            "score": 2,
                            "created_utc": 1576083418.0,
                            "replies": [
                                {
                                    "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
                                    "author": "ZealPrincess",
                                    "id": "fahgpcx",
                                    "parent_id": "t1_fahcd60",
                                    "score": 3,
                                    "created_utc": 1576085591.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a weird thing to say.  Why would you assume that she wouldn't be sexually adventurous/kinky with a vanilla partner?  Or that she should do things she's \"not otherwise comfortable with\" to land an arrangement?   There are plenty of women who LOVE uncomfortable, degrading sex - we don't need to start telling women to \"compromise\" and do it anyway if they don't, Jesus Christ.",
            "author": "BluebelleBaby",
            "id": "fajwzql",
            "parent_id": "t1_faheod3",
            "score": 0,
            "created_utc": 1576156474.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fajzut7",
                    "parent_id": "t1_fajwzql",
                    "score": 1,
                    "created_utc": 1576158164.0,
                    "replies": [
                        {
                            "body": "Did you read what you wrote?  I'm willing to believe that you just didn't convey your meaning well, but why the repeated reference to \"things she wouldn't otherwise do\"?  That's a pretty clear implication that these \"things\" aren't something she enjoys in general, she would only be tolerating them to make herself more appealing.  People who genuinely enjoy rough, degrading sex do it with their vanilla partners, they do it \"otherwise\".",
                            "author": "BluebelleBaby",
                            "id": "fak23aa",
                            "parent_id": "t1_fajzut7",
                            "score": 0,
                            "created_utc": 1576159422.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fakcft7",
                                    "parent_id": "t1_fak23aa",
                                    "score": 1,
                                    "created_utc": 1576164746.0,
                                    "replies": [
                                        {
                                            "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                                            "author": "BluebelleBaby",
                                            "id": "fakh906",
                                            "parent_id": "t1_fakcft7",
                                            "score": 1,
                                            "created_utc": 1576167103.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Who died and made you king of the fucking jungle?\n\nOh he's welcome to it. Jungles suck. Hot. Damp. Bugs. Itchy. Many things in it are poison or give you a rash. Kidnapped by cartels. Fuck that.",
            "author": "SDRippington",
            "id": "fahcd5j",
            "parent_id": "t1_fagunq4",
            "score": 6,
            "created_utc": 1576083418.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "OliviaWildflower2332",
                    "id": "faj0je6",
                    "parent_id": "t1_fahcd5j",
                    "score": 3,
                    "created_utc": 1576121167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right?? Cleanliness isn't about body size.",
            "author": "sxyhtslky2",
            "id": "fah01u4",
            "parent_id": "t1_fagzszw",
            "score": 7,
            "created_utc": 1576075936.0,
            "replies": []
        },
        {
            "body": "Have you seen the meme?  It might be the hottest picture I’ve ever seen.",
            "author": null,
            "id": "fahctqs",
            "parent_id": "t1_fah4yfm",
            "score": 1,
            "created_utc": 1576083646.0,
            "replies": [
                {
                    "body": "No I haven't! Now I want to",
                    "author": "macaroonqueen",
                    "id": "fahln99",
                    "parent_id": "t1_fahctqs",
                    "score": 4,
                    "created_utc": 1576088405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair point, though I bristle at the notion that my reply was tonally equivalent to the OP",
            "author": null,
            "id": "fahikm4",
            "parent_id": "t1_fahhbkd",
            "score": 4,
            "created_utc": 1576086548.0,
            "replies": []
        },
        {
            "body": "Appreciate you white knighting here, and it's perfectly fine to accept yourself as who you are, just don't push others into thinking an unhealthy lifestyle into it either. \n\nIf you're overweight, that is a health risk, in the same way if you're an alcoholic or abuser of drugs. Would there be any acceptance to \"I drink all the time and I'm fine you can do it too\".",
            "author": "tenmillionplus",
            "id": "fah4l5y",
            "parent_id": "t1_fah1s5x",
            "score": 5,
            "created_utc": 1576079026.0,
            "replies": [
                {
                    "body": "So decided to take OPs post and make it about SBs with alcoholism rather than weight issues....\n\n>  \n>  \n>Dear alcoholic sugar babies  \n  \n>  \n>Hello, It’s me. I’m one of you. In fact, I’m probably deeper into my addiction battle than you.  \n>  \n>But, contrary to beliefs. It doesn't impact my SRs. My SDs don't even realize, and I am typically drooled over. And truth be told you probably could too.  \n>  \n>Here’s my list of recommendations.  \n>  \n>1. Be fucking confident. It drives the boat.  \n>  \n>2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang.  \n>  \n>3. Flaunt what you have. I mean, if you have a sense of humour, let it shine. Be a fun person. There's something interesting about you, play it up as best you can.  \n>  \n>4. Don’t be afraid to decline drinks on a date, and you know why. Show them that you don't need to drink for them to have fun with you and drive the fucking boat.  \n>  \n>5. Invest in yourself. Makeup, clothes, therapy, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.  \n>  \n>6. SEDUCTION... google the word. DM if you have questions.  \n>  \n>7. Unleash your inner freak. BOUNCE ON THE DICK.  \n>  \n>Thank you for listening to my drunken TED TALK.\n\n&#x200B;\n\n...\n\nYet, nowhere in this post is it normalizing alcoholism/addiction or pushing it onto others...\n\nJust like how the original post isn't normalizing obesity or pushing it onto others.\n\n&#x200B;\n\nIt's a post telling SBs to be confident about themselves regardless of what they or others may perceive is wrong with them -- **leave it at that**.",
                    "author": "SmittenKittencat",
                    "id": "faiixps",
                    "parent_id": "t1_fah4l5y",
                    "score": 6,
                    "created_utc": 1576108947.0,
                    "replies": [
                        {
                            "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
                            "author": "tenmillionplus",
                            "id": "faik09j",
                            "parent_id": "t1_faiixps",
                            "score": 2,
                            "created_utc": 1576109702.0,
                            "replies": [
                                {
                                    "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                                    "author": "SmittenKittencat",
                                    "id": "fairgc1",
                                    "parent_id": "t1_faik09j",
                                    "score": 1,
                                    "created_utc": 1576114865.0,
                                    "replies": [
                                        {
                                            "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                                            "author": "tenmillionplus",
                                            "id": "faivseo",
                                            "parent_id": "t1_fairgc1",
                                            "score": 0,
                                            "created_utc": 1576117794.0,
                                            "replies": [
                                                {
                                                    "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                                    "author": "SmittenKittencat",
                                                    "id": "faiw97g",
                                                    "parent_id": "t1_faivseo",
                                                    "score": 2,
                                                    "created_utc": 1576118112.0,
                                                    "replies": [
                                                        {
                                                            "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                                            "author": "tenmillionplus",
                                                            "id": "faiwfh7",
                                                            "parent_id": "t1_faiw97g",
                                                            "score": 0,
                                                            "created_utc": 1576118233.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yep, definitely missed the point.",
                                                                    "author": "SmittenKittencat",
                                                                    "id": "faizc1l",
                                                                    "parent_id": "t1_faiwfh7",
                                                                    "score": 2,
                                                                    "created_utc": 1576120284.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                                            "author": "tenmillionplus",
                                                                            "id": "faj2oob",
                                                                            "parent_id": "t1_faizc1l",
                                                                            "score": 0,
                                                                            "created_utc": 1576122800.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                                    "author": "SmittenKittencat",
                                                                                    "id": "faj3f25",
                                                                                    "parent_id": "t1_faj2oob",
                                                                                    "score": 3,
                                                                                    "created_utc": 1576123372.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                                            "author": "Strange_Duckling",
                                                                                            "id": "faj455c",
                                                                                            "parent_id": "t1_faj3f25",
                                                                                            "score": 3,
                                                                                            "created_utc": 1576123951.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                                            "author": "tenmillionplus",
                                                                                            "id": "faj50y8",
                                                                                            "parent_id": "t1_faj3f25",
                                                                                            "score": 1,
                                                                                            "created_utc": 1576124668.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                                    "author": "SmittenKittencat",
                                                                                                    "id": "faj5myl",
                                                                                                    "parent_id": "t1_faj50y8",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1576125182.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "body positive SB here. i agree. love your body. strive to be healthy. if you're overweight, there are associated health risks. period. doesnt  mean you're not attractive if youre a bit overweight!",
                    "author": null,
                    "id": "fah5z0g",
                    "parent_id": "t1_fah4l5y",
                    "score": 3,
                    "created_utc": 1576079903.0,
                    "replies": []
                },
                {
                    "body": "https://goodmenproject.com/ethics-values/are-you-concerned-or-just-concern-trolling-hesaid/",
                    "author": "jaguarsharkSD",
                    "id": "fahcd60",
                    "parent_id": "t1_fah4l5y",
                    "score": 2,
                    "created_utc": 1576083418.0,
                    "replies": [
                        {
                            "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
                            "author": "ZealPrincess",
                            "id": "fahgpcx",
                            "parent_id": "t1_fahcd60",
                            "score": 3,
                            "created_utc": 1576085591.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fajzut7",
            "parent_id": "t1_fajwzql",
            "score": 1,
            "created_utc": 1576158164.0,
            "replies": [
                {
                    "body": "Did you read what you wrote?  I'm willing to believe that you just didn't convey your meaning well, but why the repeated reference to \"things she wouldn't otherwise do\"?  That's a pretty clear implication that these \"things\" aren't something she enjoys in general, she would only be tolerating them to make herself more appealing.  People who genuinely enjoy rough, degrading sex do it with their vanilla partners, they do it \"otherwise\".",
                    "author": "BluebelleBaby",
                    "id": "fak23aa",
                    "parent_id": "t1_fajzut7",
                    "score": 0,
                    "created_utc": 1576159422.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fakcft7",
                            "parent_id": "t1_fak23aa",
                            "score": 1,
                            "created_utc": 1576164746.0,
                            "replies": [
                                {
                                    "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                                    "author": "BluebelleBaby",
                                    "id": "fakh906",
                                    "parent_id": "t1_fakcft7",
                                    "score": 1,
                                    "created_utc": 1576167103.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣🤣🤣",
            "author": "OliviaWildflower2332",
            "id": "faj0je6",
            "parent_id": "t1_fahcd5j",
            "score": 3,
            "created_utc": 1576121167.0,
            "replies": []
        },
        {
            "body": "No I haven't! Now I want to",
            "author": "macaroonqueen",
            "id": "fahln99",
            "parent_id": "t1_fahctqs",
            "score": 4,
            "created_utc": 1576088405.0,
            "replies": []
        },
        {
            "body": "So decided to take OPs post and make it about SBs with alcoholism rather than weight issues....\n\n>  \n>  \n>Dear alcoholic sugar babies  \n  \n>  \n>Hello, It’s me. I’m one of you. In fact, I’m probably deeper into my addiction battle than you.  \n>  \n>But, contrary to beliefs. It doesn't impact my SRs. My SDs don't even realize, and I am typically drooled over. And truth be told you probably could too.  \n>  \n>Here’s my list of recommendations.  \n>  \n>1. Be fucking confident. It drives the boat.  \n>  \n>2. Be smart. If you don’t know things, research them. Bring a dope conversation to the table and be able to hang.  \n>  \n>3. Flaunt what you have. I mean, if you have a sense of humour, let it shine. Be a fun person. There's something interesting about you, play it up as best you can.  \n>  \n>4. Don’t be afraid to decline drinks on a date, and you know why. Show them that you don't need to drink for them to have fun with you and drive the fucking boat.  \n>  \n>5. Invest in yourself. Makeup, clothes, therapy, drink your water, get your sleep, do your skin care routines. Invest in your beauty inside and out.  \n>  \n>6. SEDUCTION... google the word. DM if you have questions.  \n>  \n>7. Unleash your inner freak. BOUNCE ON THE DICK.  \n>  \n>Thank you for listening to my drunken TED TALK.\n\n&#x200B;\n\n...\n\nYet, nowhere in this post is it normalizing alcoholism/addiction or pushing it onto others...\n\nJust like how the original post isn't normalizing obesity or pushing it onto others.\n\n&#x200B;\n\nIt's a post telling SBs to be confident about themselves regardless of what they or others may perceive is wrong with them -- **leave it at that**.",
            "author": "SmittenKittencat",
            "id": "faiixps",
            "parent_id": "t1_fah4l5y",
            "score": 6,
            "created_utc": 1576108947.0,
            "replies": [
                {
                    "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
                    "author": "tenmillionplus",
                    "id": "faik09j",
                    "parent_id": "t1_faiixps",
                    "score": 2,
                    "created_utc": 1576109702.0,
                    "replies": [
                        {
                            "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                            "author": "SmittenKittencat",
                            "id": "fairgc1",
                            "parent_id": "t1_faik09j",
                            "score": 1,
                            "created_utc": 1576114865.0,
                            "replies": [
                                {
                                    "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                                    "author": "tenmillionplus",
                                    "id": "faivseo",
                                    "parent_id": "t1_fairgc1",
                                    "score": 0,
                                    "created_utc": 1576117794.0,
                                    "replies": [
                                        {
                                            "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                            "author": "SmittenKittencat",
                                            "id": "faiw97g",
                                            "parent_id": "t1_faivseo",
                                            "score": 2,
                                            "created_utc": 1576118112.0,
                                            "replies": [
                                                {
                                                    "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                                    "author": "tenmillionplus",
                                                    "id": "faiwfh7",
                                                    "parent_id": "t1_faiw97g",
                                                    "score": 0,
                                                    "created_utc": 1576118233.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yep, definitely missed the point.",
                                                            "author": "SmittenKittencat",
                                                            "id": "faizc1l",
                                                            "parent_id": "t1_faiwfh7",
                                                            "score": 2,
                                                            "created_utc": 1576120284.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                                    "author": "tenmillionplus",
                                                                    "id": "faj2oob",
                                                                    "parent_id": "t1_faizc1l",
                                                                    "score": 0,
                                                                    "created_utc": 1576122800.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                            "author": "SmittenKittencat",
                                                                            "id": "faj3f25",
                                                                            "parent_id": "t1_faj2oob",
                                                                            "score": 3,
                                                                            "created_utc": 1576123372.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                                    "author": "Strange_Duckling",
                                                                                    "id": "faj455c",
                                                                                    "parent_id": "t1_faj3f25",
                                                                                    "score": 3,
                                                                                    "created_utc": 1576123951.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                                    "author": "tenmillionplus",
                                                                                    "id": "faj50y8",
                                                                                    "parent_id": "t1_faj3f25",
                                                                                    "score": 1,
                                                                                    "created_utc": 1576124668.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                            "author": "SmittenKittencat",
                                                                                            "id": "faj5myl",
                                                                                            "parent_id": "t1_faj50y8",
                                                                                            "score": 3,
                                                                                            "created_utc": 1576125182.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "body positive SB here. i agree. love your body. strive to be healthy. if you're overweight, there are associated health risks. period. doesnt  mean you're not attractive if youre a bit overweight!",
            "author": null,
            "id": "fah5z0g",
            "parent_id": "t1_fah4l5y",
            "score": 3,
            "created_utc": 1576079903.0,
            "replies": []
        },
        {
            "body": "https://goodmenproject.com/ethics-values/are-you-concerned-or-just-concern-trolling-hesaid/",
            "author": "jaguarsharkSD",
            "id": "fahcd60",
            "parent_id": "t1_fah4l5y",
            "score": 2,
            "created_utc": 1576083418.0,
            "replies": [
                {
                    "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
                    "author": "ZealPrincess",
                    "id": "fahgpcx",
                    "parent_id": "t1_fahcd60",
                    "score": 3,
                    "created_utc": 1576085591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you read what you wrote?  I'm willing to believe that you just didn't convey your meaning well, but why the repeated reference to \"things she wouldn't otherwise do\"?  That's a pretty clear implication that these \"things\" aren't something she enjoys in general, she would only be tolerating them to make herself more appealing.  People who genuinely enjoy rough, degrading sex do it with their vanilla partners, they do it \"otherwise\".",
            "author": "BluebelleBaby",
            "id": "fak23aa",
            "parent_id": "t1_fajzut7",
            "score": 0,
            "created_utc": 1576159422.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fakcft7",
                    "parent_id": "t1_fak23aa",
                    "score": 1,
                    "created_utc": 1576164746.0,
                    "replies": [
                        {
                            "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                            "author": "BluebelleBaby",
                            "id": "fakh906",
                            "parent_id": "t1_fakcft7",
                            "score": 1,
                            "created_utc": 1576167103.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had no problem with the original post. \n\nIf you want to compare the two..my follow up question would be \"in the past 7 years have you lowered your drinking/would you encourage others to do so\" and if the answer is no, then that is a problem.",
            "author": "tenmillionplus",
            "id": "faik09j",
            "parent_id": "t1_faiixps",
            "score": 2,
            "created_utc": 1576109702.0,
            "replies": [
                {
                    "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
                    "author": "SmittenKittencat",
                    "id": "fairgc1",
                    "parent_id": "t1_faik09j",
                    "score": 1,
                    "created_utc": 1576114865.0,
                    "replies": [
                        {
                            "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                            "author": "tenmillionplus",
                            "id": "faivseo",
                            "parent_id": "t1_fairgc1",
                            "score": 0,
                            "created_utc": 1576117794.0,
                            "replies": [
                                {
                                    "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                                    "author": "SmittenKittencat",
                                    "id": "faiw97g",
                                    "parent_id": "t1_faivseo",
                                    "score": 2,
                                    "created_utc": 1576118112.0,
                                    "replies": [
                                        {
                                            "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                            "author": "tenmillionplus",
                                            "id": "faiwfh7",
                                            "parent_id": "t1_faiw97g",
                                            "score": 0,
                                            "created_utc": 1576118233.0,
                                            "replies": [
                                                {
                                                    "body": "Yep, definitely missed the point.",
                                                    "author": "SmittenKittencat",
                                                    "id": "faizc1l",
                                                    "parent_id": "t1_faiwfh7",
                                                    "score": 2,
                                                    "created_utc": 1576120284.0,
                                                    "replies": [
                                                        {
                                                            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                            "author": "tenmillionplus",
                                                            "id": "faj2oob",
                                                            "parent_id": "t1_faizc1l",
                                                            "score": 0,
                                                            "created_utc": 1576122800.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                                    "author": "SmittenKittencat",
                                                                    "id": "faj3f25",
                                                                    "parent_id": "t1_faj2oob",
                                                                    "score": 3,
                                                                    "created_utc": 1576123372.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                            "author": "Strange_Duckling",
                                                                            "id": "faj455c",
                                                                            "parent_id": "t1_faj3f25",
                                                                            "score": 3,
                                                                            "created_utc": 1576123951.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                            "author": "tenmillionplus",
                                                                            "id": "faj50y8",
                                                                            "parent_id": "t1_faj3f25",
                                                                            "score": 1,
                                                                            "created_utc": 1576124668.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                                    "author": "SmittenKittencat",
                                                                                    "id": "faj5myl",
                                                                                    "parent_id": "t1_faj50y8",
                                                                                    "score": 3,
                                                                                    "created_utc": 1576125182.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't see how hes being a troll. Theres too many women that want to call themselves curvy and I can fit 3 of me in their clothing. \n\nWe are at a point where people normalize unhealthy and want to put glittery labels on it.  This also applies to being underweight too.",
            "author": "ZealPrincess",
            "id": "fahgpcx",
            "parent_id": "t1_fahcd60",
            "score": 3,
            "created_utc": 1576085591.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fakcft7",
            "parent_id": "t1_fak23aa",
            "score": 1,
            "created_utc": 1576164746.0,
            "replies": [
                {
                    "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
                    "author": "BluebelleBaby",
                    "id": "fakh906",
                    "parent_id": "t1_fakcft7",
                    "score": 1,
                    "created_utc": 1576167103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Except that has nothing to do with the post, so asking it in response is inappropriate and out of place. Again, leave it alone.",
            "author": "SmittenKittencat",
            "id": "fairgc1",
            "parent_id": "t1_faik09j",
            "score": 1,
            "created_utc": 1576114865.0,
            "replies": [
                {
                    "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
                    "author": "tenmillionplus",
                    "id": "faivseo",
                    "parent_id": "t1_fairgc1",
                    "score": 0,
                    "created_utc": 1576117794.0,
                    "replies": [
                        {
                            "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                            "author": "SmittenKittencat",
                            "id": "faiw97g",
                            "parent_id": "t1_faivseo",
                            "score": 2,
                            "created_utc": 1576118112.0,
                            "replies": [
                                {
                                    "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                                    "author": "tenmillionplus",
                                    "id": "faiwfh7",
                                    "parent_id": "t1_faiw97g",
                                    "score": 0,
                                    "created_utc": 1576118233.0,
                                    "replies": [
                                        {
                                            "body": "Yep, definitely missed the point.",
                                            "author": "SmittenKittencat",
                                            "id": "faizc1l",
                                            "parent_id": "t1_faiwfh7",
                                            "score": 2,
                                            "created_utc": 1576120284.0,
                                            "replies": [
                                                {
                                                    "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                                    "author": "tenmillionplus",
                                                    "id": "faj2oob",
                                                    "parent_id": "t1_faizc1l",
                                                    "score": 0,
                                                    "created_utc": 1576122800.0,
                                                    "replies": [
                                                        {
                                                            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                            "author": "SmittenKittencat",
                                                            "id": "faj3f25",
                                                            "parent_id": "t1_faj2oob",
                                                            "score": 3,
                                                            "created_utc": 1576123372.0,
                                                            "replies": [
                                                                {
                                                                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                                    "author": "Strange_Duckling",
                                                                    "id": "faj455c",
                                                                    "parent_id": "t1_faj3f25",
                                                                    "score": 3,
                                                                    "created_utc": 1576123951.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                                    "author": "tenmillionplus",
                                                                    "id": "faj50y8",
                                                                    "parent_id": "t1_faj3f25",
                                                                    "score": 1,
                                                                    "created_utc": 1576124668.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                            "author": "SmittenKittencat",
                                                                            "id": "faj5myl",
                                                                            "parent_id": "t1_faj50y8",
                                                                            "score": 3,
                                                                            "created_utc": 1576125182.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think I see why we're misunderstanding each other - I didn't (and still don't) see the OP as advocating for that.  It very much reads like you putting those words in her mouth.  But glad that we're on the same page about respecting everyone's sexual comfort.",
            "author": "BluebelleBaby",
            "id": "fakh906",
            "parent_id": "t1_fakcft7",
            "score": 1,
            "created_utc": 1576167103.0,
            "replies": []
        },
        {
            "body": "If someone was an alcoholic and posted about it, and someone asked after 7 years if they had reduced their drinking intake, you're saying that wouldn't be relevant?",
            "author": "tenmillionplus",
            "id": "faivseo",
            "parent_id": "t1_fairgc1",
            "score": 0,
            "created_utc": 1576117794.0,
            "replies": [
                {
                    "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
                    "author": "SmittenKittencat",
                    "id": "faiw97g",
                    "parent_id": "t1_faivseo",
                    "score": 2,
                    "created_utc": 1576118112.0,
                    "replies": [
                        {
                            "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                            "author": "tenmillionplus",
                            "id": "faiwfh7",
                            "parent_id": "t1_faiw97g",
                            "score": 0,
                            "created_utc": 1576118233.0,
                            "replies": [
                                {
                                    "body": "Yep, definitely missed the point.",
                                    "author": "SmittenKittencat",
                                    "id": "faizc1l",
                                    "parent_id": "t1_faiwfh7",
                                    "score": 2,
                                    "created_utc": 1576120284.0,
                                    "replies": [
                                        {
                                            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                            "author": "tenmillionplus",
                                            "id": "faj2oob",
                                            "parent_id": "t1_faizc1l",
                                            "score": 0,
                                            "created_utc": 1576122800.0,
                                            "replies": [
                                                {
                                                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                                    "author": "SmittenKittencat",
                                                    "id": "faj3f25",
                                                    "parent_id": "t1_faj2oob",
                                                    "score": 3,
                                                    "created_utc": 1576123372.0,
                                                    "replies": [
                                                        {
                                                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                            "author": "Strange_Duckling",
                                                            "id": "faj455c",
                                                            "parent_id": "t1_faj3f25",
                                                            "score": 3,
                                                            "created_utc": 1576123951.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                            "author": "tenmillionplus",
                                                            "id": "faj50y8",
                                                            "parent_id": "t1_faj3f25",
                                                            "score": 1,
                                                            "created_utc": 1576124668.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                                    "author": "SmittenKittencat",
                                                                    "id": "faj5myl",
                                                                    "parent_id": "t1_faj50y8",
                                                                    "score": 3,
                                                                    "created_utc": 1576125182.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, it's not relevant. The post is first and foremost about sugar babying, followed by being about self-confidence; alcoholism/weight isn't even the main point of the topic. If you can't even comprehend that, then you REALLY need to move on and let it go.",
            "author": "SmittenKittencat",
            "id": "faiw97g",
            "parent_id": "t1_faivseo",
            "score": 2,
            "created_utc": 1576118112.0,
            "replies": [
                {
                    "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
                    "author": "tenmillionplus",
                    "id": "faiwfh7",
                    "parent_id": "t1_faiw97g",
                    "score": 0,
                    "created_utc": 1576118233.0,
                    "replies": [
                        {
                            "body": "Yep, definitely missed the point.",
                            "author": "SmittenKittencat",
                            "id": "faizc1l",
                            "parent_id": "t1_faiwfh7",
                            "score": 2,
                            "created_utc": 1576120284.0,
                            "replies": [
                                {
                                    "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                                    "author": "tenmillionplus",
                                    "id": "faj2oob",
                                    "parent_id": "t1_faizc1l",
                                    "score": 0,
                                    "created_utc": 1576122800.0,
                                    "replies": [
                                        {
                                            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                            "author": "SmittenKittencat",
                                            "id": "faj3f25",
                                            "parent_id": "t1_faj2oob",
                                            "score": 3,
                                            "created_utc": 1576123372.0,
                                            "replies": [
                                                {
                                                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                                    "author": "Strange_Duckling",
                                                    "id": "faj455c",
                                                    "parent_id": "t1_faj3f25",
                                                    "score": 3,
                                                    "created_utc": 1576123951.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                                    "author": "tenmillionplus",
                                                    "id": "faj50y8",
                                                    "parent_id": "t1_faj3f25",
                                                    "score": 1,
                                                    "created_utc": 1576124668.0,
                                                    "replies": [
                                                        {
                                                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                            "author": "SmittenKittencat",
                                                            "id": "faj5myl",
                                                            "parent_id": "t1_faj50y8",
                                                            "score": 3,
                                                            "created_utc": 1576125182.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> weight isn't even the main point of the topic.\n\nLol it literally is the subject of the post.",
            "author": "tenmillionplus",
            "id": "faiwfh7",
            "parent_id": "t1_faiw97g",
            "score": 0,
            "created_utc": 1576118233.0,
            "replies": [
                {
                    "body": "Yep, definitely missed the point.",
                    "author": "SmittenKittencat",
                    "id": "faizc1l",
                    "parent_id": "t1_faiwfh7",
                    "score": 2,
                    "created_utc": 1576120284.0,
                    "replies": [
                        {
                            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                            "author": "tenmillionplus",
                            "id": "faj2oob",
                            "parent_id": "t1_faizc1l",
                            "score": 0,
                            "created_utc": 1576122800.0,
                            "replies": [
                                {
                                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                                    "author": "SmittenKittencat",
                                    "id": "faj3f25",
                                    "parent_id": "t1_faj2oob",
                                    "score": 3,
                                    "created_utc": 1576123372.0,
                                    "replies": [
                                        {
                                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                            "author": "Strange_Duckling",
                                            "id": "faj455c",
                                            "parent_id": "t1_faj3f25",
                                            "score": 3,
                                            "created_utc": 1576123951.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                            "author": "tenmillionplus",
                                            "id": "faj50y8",
                                            "parent_id": "t1_faj3f25",
                                            "score": 1,
                                            "created_utc": 1576124668.0,
                                            "replies": [
                                                {
                                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                                    "author": "SmittenKittencat",
                                                    "id": "faj5myl",
                                                    "parent_id": "t1_faj50y8",
                                                    "score": 3,
                                                    "created_utc": 1576125182.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep, definitely missed the point.",
            "author": "SmittenKittencat",
            "id": "faizc1l",
            "parent_id": "t1_faiwfh7",
            "score": 2,
            "created_utc": 1576120284.0,
            "replies": [
                {
                    "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
                    "author": "tenmillionplus",
                    "id": "faj2oob",
                    "parent_id": "t1_faizc1l",
                    "score": 0,
                    "created_utc": 1576122800.0,
                    "replies": [
                        {
                            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                            "author": "SmittenKittencat",
                            "id": "faj3f25",
                            "parent_id": "t1_faj2oob",
                            "score": 3,
                            "created_utc": 1576123372.0,
                            "replies": [
                                {
                                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                                    "author": "Strange_Duckling",
                                    "id": "faj455c",
                                    "parent_id": "t1_faj3f25",
                                    "score": 3,
                                    "created_utc": 1576123951.0,
                                    "replies": []
                                },
                                {
                                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                                    "author": "tenmillionplus",
                                    "id": "faj50y8",
                                    "parent_id": "t1_faj3f25",
                                    "score": 1,
                                    "created_utc": 1576124668.0,
                                    "replies": [
                                        {
                                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                            "author": "SmittenKittencat",
                                            "id": "faj5myl",
                                            "parent_id": "t1_faj50y8",
                                            "score": 3,
                                            "created_utc": 1576125182.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Serious question for you: if someone (male or female) was overweight due to poor diet choices and lack of physical activity and asked you if they should change their lifestyle to lose weight, what would be your response?\n\nOr if someone said they drink two bottles of wine every night, and asked you if they should cut back, what would be your response be?\n\nAlso, do you find any irony in you telling me to let it go at least 3 times now while still responding to me? (including to this post?)",
            "author": "tenmillionplus",
            "id": "faj2oob",
            "parent_id": "t1_faizc1l",
            "score": 0,
            "created_utc": 1576122800.0,
            "replies": [
                {
                    "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
                    "author": "SmittenKittencat",
                    "id": "faj3f25",
                    "parent_id": "t1_faj2oob",
                    "score": 3,
                    "created_utc": 1576123372.0,
                    "replies": [
                        {
                            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                            "author": "Strange_Duckling",
                            "id": "faj455c",
                            "parent_id": "t1_faj3f25",
                            "score": 3,
                            "created_utc": 1576123951.0,
                            "replies": []
                        },
                        {
                            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                            "author": "tenmillionplus",
                            "id": "faj50y8",
                            "parent_id": "t1_faj3f25",
                            "score": 1,
                            "created_utc": 1576124668.0,
                            "replies": [
                                {
                                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                                    "author": "SmittenKittencat",
                                    "id": "faj5myl",
                                    "parent_id": "t1_faj50y8",
                                    "score": 3,
                                    "created_utc": 1576125182.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Again, that has nothing to do with the post, so I'm not going to grace you with my answer. Go ask it on an appropriate thread or subreddit.\n\nI'm telling you to let it go as in to stop thinking further into it and drawing conclusions that don't need drawn. But, surprise, you couldn't comprehend that either, huh?",
            "author": "SmittenKittencat",
            "id": "faj3f25",
            "parent_id": "t1_faj2oob",
            "score": 3,
            "created_utc": 1576123372.0,
            "replies": [
                {
                    "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
                    "author": "Strange_Duckling",
                    "id": "faj455c",
                    "parent_id": "t1_faj3f25",
                    "score": 3,
                    "created_utc": 1576123951.0,
                    "replies": []
                },
                {
                    "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
                    "author": "tenmillionplus",
                    "id": "faj50y8",
                    "parent_id": "t1_faj3f25",
                    "score": 1,
                    "created_utc": 1576124668.0,
                    "replies": [
                        {
                            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                            "author": "SmittenKittencat",
                            "id": "faj5myl",
                            "parent_id": "t1_faj50y8",
                            "score": 3,
                            "created_utc": 1576125182.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "this guy really doesn't get it, does he? this is neither the thread nor the subreddit for this line of off-topic questioning, but he has to keep pushing, huh? wouldn't waste my time on him, seems a bit, uh, \"stubborn.\"",
            "author": "Strange_Duckling",
            "id": "faj455c",
            "parent_id": "t1_faj3f25",
            "score": 3,
            "created_utc": 1576123951.0,
            "replies": []
        },
        {
            "body": "I don't understand why you keep responding if you won't answer simple questions? \n\nYou'd likely save a lot of mental anguish by moving on yourself but I'm quite certain you it'll involve a response about me missing the point and how I should let it go. (I have $20 on the line for this)",
            "author": "tenmillionplus",
            "id": "faj50y8",
            "parent_id": "t1_faj3f25",
            "score": 1,
            "created_utc": 1576124668.0,
            "replies": [
                {
                    "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
                    "author": "SmittenKittencat",
                    "id": "faj5myl",
                    "parent_id": "t1_faj50y8",
                    "score": 3,
                    "created_utc": 1576125182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems to be causing you some light distress that someone isn't giving into you, are you alright? Perhaps we should talk about it, or perhaps you should see someone more qualified? \nInternet debates and interactions like this are fun, it's funny seeing how people react when they're called out and don't get their way. \nIt's no extra effort on my part to keep responding, honestly. Do some studying, take a break to browse and respond to comments, go back to studying. No skin off my nose ;)",
            "author": "SmittenKittencat",
            "id": "faj5myl",
            "parent_id": "t1_faj50y8",
            "score": 3,
            "created_utc": 1576125182.0,
            "replies": []
        }
    ]
}