{
    "title": "Married SDs funeral tomorrow",
    "post_id": "rb18va",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rb18va/married_sds_funeral_tomorrow/",
    "author": "Lovehopes23",
    "body": "I posted about a month ago that my SD was dying of cancer. Well he sadly passed away 2 weeks ago, unfortunately we never got to have a last conversation to say goodbye etc. His sister let me know of his passing and explained how he was in denial that he was at the end\n\nIt's his funeral tomorrow and obviously I am not going as he was married and it would look too suspicious. I discussed this with his sister and she thinks the same. I'm totally devastated, heartbroken and lost. People keep telling me to get on with things, and life goes on but right now it's seems impossible. I don't have motivation to do anything or enjoy anything. Please say a nice comment, I'm in need of them right now xx",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rb18va/married_sds_funeral_tomorrow/",
    "score": 132,
    "upvote_ratio": 0.96,
    "created_utc": 1638889752.0,
    "num_comments": 52,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Funerals are for us to say a last farewell. You need to have your own private ceremony, maybe with his sister to say farewell. Place flowers on his grave… raise a glass... Perhaps again on his birthday or in a year’s time. No one can take that away from you. Hopefully this will go some way to moving on.",
            "author": "chairman212121",
            "id": "hnlx2rp",
            "parent_id": "t3_rb18va",
            "score": 64,
            "created_utc": 1638894292.0,
            "replies": [
                {
                    "body": "I'm going to second have a private ritual. Especially if you think you'll get emotional at the funeral (more than a young coworker).  If the wife had any suspicion it would look odd.  She probably did vaguely know about you and had a don't ask/don't tell policy. I wouldn't want to taint her day, and it's sweet that you and the sister are in touch.  \n\n\nRegardless if you were in love, it's obvious you had a genuine connection and affection for each other.  Grieving a close friend who passed too soon is valid.  Personally, I honour my passed loved ones annually. I look forward to it, it's common in many cultures. Make their favourite meal, go to their favourite place, do something they'd approve of.  Write them a letter and burn it so it reaches them.  Even if you're more on the atheist side, his pain is gone now and it sounds like he had a lovely life with you in it.",
                    "author": "bluebell_flames18",
                    "id": "hnm0qjr",
                    "parent_id": "t1_hnlx2rp",
                    "score": 29,
                    "created_utc": 1638895921.0,
                    "replies": [
                        {
                            "body": "Yeah, and it might be better to have something separate of the funeral just for the sake of actually being able to grieve rather than stressing about the wife taking up your energy",
                            "author": "Avery-H-Sinclair",
                            "id": "hnn9adr",
                            "parent_id": "t1_hnm0qjr",
                            "score": 3,
                            "created_utc": 1638915000.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I want all my former SBs to show up at my funeral.  For real!  I have all contact details in a safe discoverable place.",
            "author": "sdphilly",
            "id": "hnlp4yd",
            "parent_id": "t3_rb18va",
            "score": 50,
            "created_utc": 1638890780.0,
            "replies": [
                {
                    "body": "I can imagine it, there will be a sign directing ex-SBs to the left and a large group of chairs. Then, another sign pointing to the right, saying Family and Friends, which will have a much smaller group of chairs...lol\n\nCan you add me to that list? I literally can't imagine a more target rich environment for a SD. As a fellow SD, I am sure that you would swell with pride in playing SR matchmaker in death. Just got this mental image of me as Will Farrell in Wedding Crashers, when he is at the funerals. Dare to dream...",
                    "author": "patienceisavirtue5",
                    "id": "hnm2s2u",
                    "parent_id": "t1_hnlp4yd",
                    "score": 28,
                    "created_utc": 1638896820.0,
                    "replies": [
                        {
                            "body": "He was cleaning up!",
                            "author": "sdphilly",
                            "id": "hnm8ubf",
                            "parent_id": "t1_hnm2s2u",
                            "score": 1,
                            "created_utc": 1638899506.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She's asking for comfort , not jokes.",
                    "author": "dallas-explorer",
                    "id": "hnm4evi",
                    "parent_id": "t1_hnlp4yd",
                    "score": 3,
                    "created_utc": 1638897562.0,
                    "replies": [
                        {
                            "body": "Just lost my Mom after a long bout with dementia.   Remembering her as she was gave me great joy.  Op can take comfort that she not only knew her guy before cancer stole his being...she was probably the last great pleasure of his life.\n\nTo all SBs out there....It's a noble thing that you do for us!  Remember us for the twisted steel and sex appeal that we used to be...not the rusty old pistols that we become down the road.",
                            "author": "sdphilly",
                            "id": "hnmaonm",
                            "parent_id": "t1_hnm4evi",
                            "score": 23,
                            "created_utc": 1638900299.0,
                            "replies": [
                                {
                                    "body": "Haha this made me smile! Thankyou",
                                    "author": "Lovehopes23",
                                    "id": "hnmbfc3",
                                    "parent_id": "t1_hnmaonm",
                                    "score": 4,
                                    "created_utc": 1638900612.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's a baller move XD",
                    "author": "bluebell_flames18",
                    "id": "hnm3rmk",
                    "parent_id": "t1_hnlp4yd",
                    "score": 0,
                    "created_utc": 1638897269.0,
                    "replies": []
                },
                {
                    "body": "Lmfao",
                    "author": "Stablegeniousatwork",
                    "id": "hnluo8x",
                    "parent_id": "t1_hnlp4yd",
                    "score": -1,
                    "created_utc": 1638893217.0,
                    "replies": []
                },
                {
                    "body": "Like episode on 2 and half men when charlie dreams about his Funeral.  100 hot crazy girls lined up then spit on the coffin ;-)",
                    "author": "Buckeyechamp21",
                    "id": "hnmsuzo",
                    "parent_id": "t1_hnlp4yd",
                    "score": 1,
                    "created_utc": 1638908168.0,
                    "replies": []
                },
                {
                    "body": "I really love this!!!",
                    "author": "StarNerd920",
                    "id": "hnmtuqp",
                    "parent_id": "t1_hnlp4yd",
                    "score": 1,
                    "created_utc": 1638908566.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so very sorry, this must be a difficult time. You were obviously very special to him, enough that his sister knows about you and is keeping you informed. I hope there’s some comfort in that. \n\nHugs and prayers",
            "author": "mraspencer",
            "id": "hnln39y",
            "parent_id": "t3_rb18va",
            "score": 9,
            "created_utc": 1638889909.0,
            "replies": []
        },
        {
            "body": "So sorry this happened. There are no words to take away the pain and the loss.\n\nMy wife of thirty years passed away four years ago.\n\nIt took me a year before I could face the world.\n\nI still think about her every day, every hour, every minute. She was the love of my life and made me who I am today.\n\nThis too shall pass.  Just let time do its work.",
            "author": "LuckyINTJ",
            "id": "hnlzpwo",
            "parent_id": "t3_rb18va",
            "score": 9,
            "created_utc": 1638895472.0,
            "replies": [
                {
                    "body": "Funerals are for the living. The dead could care less at this point. The 2nd death is upon him and that’s where the real funeral takes place. Repent!",
                    "author": "Upstairs-Hold-5330",
                    "id": "ho4kbla",
                    "parent_id": "t1_hnlzpwo",
                    "score": 1,
                    "created_utc": 1639234636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Funerals aren't for the recently departed, they are for the people that loved them.  Unless the funeral is family only, you should go.  Dress appropriately and if anyone asks just say you knew him from work or that he was a mentor to you.",
            "author": "js2066",
            "id": "hnlvklb",
            "parent_id": "t3_rb18va",
            "score": 21,
            "created_utc": 1638893620.0,
            "replies": [
                {
                    "body": "I would do this. Just say that you knew him from work or something , and he was a nice guy.",
                    "author": "peterharris100",
                    "id": "hnlxa9i",
                    "parent_id": "t1_hnlvklb",
                    "score": 5,
                    "created_utc": 1638894384.0,
                    "replies": [
                        {
                            "body": "Or just say her dad knew him. 🤪",
                            "author": "garret6758",
                            "id": "hnm1gn5",
                            "parent_id": "t1_hnlxa9i",
                            "score": 8,
                            "created_utc": 1638896239.0,
                            "replies": [
                                {
                                    "body": "Yup, it is for you to say goodbye, no one else",
                                    "author": "peterharris100",
                                    "id": "hnm6roc",
                                    "parent_id": "t1_hnm1gn5",
                                    "score": -1,
                                    "created_utc": 1638898597.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm so sorry for your loss. If you can bring yourself to make a little ritual for yourself, light a candle for him and try writing him a letter. Tell him what he meant to you, how he helped, and how you feel. Take the time to grieve. You're allowed to be sad and unmotivated right now, this is the correct time to feel this way. Make sure you take care of yourself, eat meals even when you don't feel like it. A hot shower is good for your mental state. Take care.",
            "author": "throwaway16696",
            "id": "hnm3vy6",
            "parent_id": "t3_rb18va",
            "score": 5,
            "created_utc": 1638897323.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss. It is an honorable move for you to pass on attending ,allowing the widow a shred of respect. Hopefully she did not suspect your presence in her husband's life.",
            "author": "GSSD",
            "id": "hnmqito",
            "parent_id": "t3_rb18va",
            "score": 6,
            "created_utc": 1638907140.0,
            "replies": []
        },
        {
            "body": "I am in an age-gap relationship that is larger than yours.  I can say with 100% confidence, that you lit up and brought joy to his life, that would be impossible to put into words.  He certainly treasured that through the entire process he had to endure.  Hopefully you can find some comfort in that knowledge.",
            "author": "MrBuzzard",
            "id": "hnlpaid",
            "parent_id": "t3_rb18va",
            "score": 6,
            "created_utc": 1638890847.0,
            "replies": []
        },
        {
            "body": "I am really sorry for your loss",
            "author": "DrZenRoot",
            "id": "hnmsmzs",
            "parent_id": "t3_rb18va",
            "score": 3,
            "created_utc": 1638908076.0,
            "replies": []
        },
        {
            "body": "I wish my SBs can read this and be like you..",
            "author": "rect1977",
            "id": "hnmtgub",
            "parent_id": "t3_rb18va",
            "score": 3,
            "created_utc": 1638908410.0,
            "replies": []
        },
        {
            "body": "I’m so sorry you’re hurting. While the wife may have known of your existence and dealt with it, it may be a sore spot for his family or children. And  by you showing up could make them feel like it is rubbing the relationship it in their faces.",
            "author": "diamondinthemough",
            "id": "hnnaafz",
            "parent_id": "t3_rb18va",
            "score": 3,
            "created_utc": 1638915437.0,
            "replies": []
        },
        {
            "body": "He is very lucky to have you.  Clearly you do had a great relationship.",
            "author": "LotBuilder",
            "id": "hnlz5o4",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638895217.0,
            "replies": []
        },
        {
            "body": "You are a very good, gold star Sugar Babe.",
            "author": null,
            "id": "hnm005u",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638895598.0,
            "replies": []
        },
        {
            "body": "Condolences huni",
            "author": "Silver-heart1",
            "id": "hnmh4ah",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638903029.0,
            "replies": []
        },
        {
            "body": "Grief is no joke, even in situations where you feel like you shouldn't be grieving. For anyone going through any type of loss (a death, a breakup, etc.), I can't recommend a book enough called \"How to Survive the Loss of a Love.\" It's hardly even a book as it's all bullet points and poems, but it is incredibly helpful in that it allows you to better understand what you're going through. Please read it for yourself! When you said \"people keep telling me to get on with things...\" that reminded me of a part of the book where it explains that grief is not linear and never has a set timeline. You are allowed to feel what you're feeling, and you shouldn't feel badly about it. Best of luck. This too shall pass.",
            "author": "billbar",
            "id": "hnmn1dl",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638905581.0,
            "replies": []
        },
        {
            "body": "I am deeply sympathetic for your situation and I am so sorry for your loss. My partner (not a SR) passed away a few years ago and I can understand this type of pain. There is no finite amount of time allotted to a grieving process, and fuck anyone that tries to make you think you should 'just get over it'. \n\nI urge you to take the time you need to adequately grieve, whether that means to have a private ceremony, talk to someone (perhaps his sister or a therapist), take time off from previously set plans/engagements, start writing/journaling about everything you're experiencing, and take time out of the day to do things for you and your wellbeing (drink plenty of water, eat, go for walks, listen to your favorite playlist, call a person you can trust, visit your favorite spot, watch a movie you like, etc.) Trying to enjoy things under these circumstances is not selfish, even though I'm sure it feels like it. \n\nThis is an incredibly difficult situation to live through and there's no easy way to go through it. You're doing amazing and I hope you take care of yourself. <3",
            "author": "Individual-Sleep-715",
            "id": "hnne9kc",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638917228.0,
            "replies": []
        },
        {
            "body": "I have lost several close to me over the years, both relatives and friends. What helped me the most was  to let myself experience grief. I agree with those who have said that you need to get some closure through a private viewing or graveside visit. I think that you are likely very young so you need to recognize that you have a lot of life ahead of you. You will learn to live with the loss and at some point the memories will slowly replace the emptiness. You owe it to him, but more importantly to yourself to make your relationship a part of your life experience and take the good from it to move forward towards more future success. It may help to join a grief counseling group or confide in a good friend. This is not going to be easy, but you will get through it and better days are ahead.",
            "author": "Teejaynj",
            "id": "hnnrkm4",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638923437.0,
            "replies": []
        },
        {
            "body": "Pippin: I didn't think it would end this way.\n\nGandalf: End? No, the journey doesn't end here. Death is just another path, one that we all must take. The grey rain-curtain of this world rolls back, and all turns to silver glass, and then you see it.\n\nPippin: What? Gandalf? See what?\n\nGandalf: White shores, and beyond, a far green country under a swift sunrise.\n\nPippin: Well, that isn't so bad.\n\nGandalf: No. No, it isn't.",
            "author": "sd24601",
            "id": "hnowgto",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638946661.0,
            "replies": []
        },
        {
            "body": "I am sorry you are going through this. Death sucks ass and dealing with it is hard.\n\nGrieve how you want too, do what you want too. When you are ready to move along you will. And trust me not sure how many funerals you have been to. They pretty much all suck, sitting there seeing the despair on loved ones faces.. I am done with them. I went a good friend of mines funeral on my birthday this year. He died a few months after a bad car wreck.\n\ngiving you a virtual (((((hugs)))))",
            "author": "CenTexFunGuy",
            "id": "hnlnasv",
            "parent_id": "t3_rb18va",
            "score": 2,
            "created_utc": 1638890000.0,
            "replies": []
        },
        {
            "body": "I am sorry for your loss! And yes, it's also your loss. I understand that you don't want to attend the funeral, it's probably best, but funerals are not for the dead but for the living. You are entitled to 'a funeral'. So maybe go there after the official funeral or on the next day and have your own little funeral. Just visit his grave and stay there for some time. Say goodbye. It feels weird at the moment, but you will probably feel better after it. It's really a good idea to do it as soon as possible.\n\nThe fact that he has now passed away just makes it even more awesome that he had you in his final years.",
            "author": "Inner_Examination_38",
            "id": "hnltv33",
            "parent_id": "t3_rb18va",
            "score": 0,
            "created_utc": 1638892853.0,
            "replies": []
        },
        {
            "body": "I'm so sorry. Please be kind to yourself right now. Do things that will give you some peace, whatever those would be for you. I agree with some other commenters about maybe going to the funeral and being discreet, saying that you knew him from work or something along those lines. If you don't feel comfortable with going a little ceremony by yourself would be fine as well. Maybe going to his grave and visiting. If you would like someone to talk to please don't hesitate to reach out! I'm always open to friends ❤",
            "author": "AudreyCloud",
            "id": "hnm7acz",
            "parent_id": "t3_rb18va",
            "score": 0,
            "created_utc": 1638898825.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss. It is devastating, and I'm sure it will take time to heal. Don't be afraid to express your sadness and grief for as long as you need to. It is only normal. \n\nSending hugs xx",
            "author": "Littlebabyzee",
            "id": "hnlokm2",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638890540.0,
            "replies": []
        },
        {
            "body": "So sorry for your loss. Although you can't see it now, there *is* light at the end of the tunnel of grief. Be kind to yourself.",
            "author": "Cledaddy23",
            "id": "hnltj5q",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638892705.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss, I can't imagine how it must feel.",
            "author": "YakiMe",
            "id": "hnlvck0",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638893520.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss and so happy you cared for him so deeply.   I'm sure you need closure too.   Obviously you can visit the grave site another time, perhaps on your own or with friends or his sister?   and get some closure for yourself too.",
            "author": "gam9147",
            "id": "hnm0vrl",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638895984.0,
            "replies": []
        },
        {
            "body": "Walk by and say a prayer if that applies",
            "author": "JosephJohnPEEPS",
            "id": "hnm69gb",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638898378.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss.  Give yourself time to grieve and cry.  Take a couple of days then get back to your routine.  I recently had a close relative die so it was probably similar feeling.  As much as it was crushing, you have to keep moving forward in your life.",
            "author": "throwawayrdu71",
            "id": "hnm9lif",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638899829.0,
            "replies": []
        },
        {
            "body": "Funerals are for everyone that misses someone who has passed away.   Usually all are welcome - including any neighbors, friends, acquaintances, etc.  No one is really concerned how you knew him - usually many folks at funerals do not know each other or not very well.   You can discretely be toward the back or side of the room, and you can always leave at any moment.   Your chance to grieve at this time is quite important, while the chance of your disturbing others is very minor.   I would consider going to say goodbye, maybe a last chance for viewing.   - Sorry for your loss.",
            "author": "HappyBear1952",
            "id": "hnn2mxg",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638912209.0,
            "replies": []
        },
        {
            "body": "It is okay to grieve and in your own way. Be thankful for the good times you shared and how he impacted your life. Move on when you are ready. That time will come. No need to rush.",
            "author": "AFSMSgt",
            "id": "hnn2wdu",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638912318.0,
            "replies": []
        },
        {
            "body": "Very sorry for your loss.  It’s up to you when you are done grieving, sometimes it takes years.  It speaks volumes about you that you feel deeply about your departed SD.  I’m sure you made his life better.",
            "author": "RedHeavyG603",
            "id": "hnn4r16",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638913079.0,
            "replies": []
        },
        {
            "body": "I have asked my SB of one year if she will remember me when she is 30+ with a bunch of kids and when she is 60+ with a whole bunch of grandkids. So, remember him always, as I am sure you will. That is the greatest tribute to him and your relationship. I have heard from people who lost loved ones that it always hurts. But it hurts less with time.",
            "author": "Monte_Sailor",
            "id": "hnn53qa",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638913225.0,
            "replies": []
        },
        {
            "body": "The simple fact that you cared enough about your SD to mention his death with such reverence pretty much proves that he loved you too.  I am certain that you were one of the highest points in his life.  It is a very great honor for a man to have the company of a decent woman.  And a younger woman, who through her comportment and sincere companionship deserves all the best that he can muster for her, even if in reality it is only the cash he provides that brings her security, since he will not be around long enough to take care of her in older age, as you have discovered.  God bless you child, may peace be upon you.",
            "author": "Major-Editor-2016",
            "id": "hnnmlnp",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638921070.0,
            "replies": []
        },
        {
            "body": "You lost your lover.  That loss is real. As other posters have said: have your final moment whether privately with friends and sister or alone as you choose.  Give time to heal and to mourn and remember the good times.  When you are feeling better ... you will resume your life.",
            "author": "Darkside0127",
            "id": "hnnpmzt",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638922512.0,
            "replies": []
        },
        {
            "body": "I’m so sorry for your loss.",
            "author": "Letmehearyourhaikus",
            "id": "hnnyftp",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638926818.0,
            "replies": []
        },
        {
            "body": "If you feel the need to go you should Imho\n\nAs a married man i would be happy if my SB showed up to my funeral (and not just to spit on my coffin)",
            "author": "KnocDown",
            "id": "hno9a1f",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638932276.0,
            "replies": []
        },
        {
            "body": "I am very sorry for your loss. He was very lucky to have you 💜",
            "author": "ufmon",
            "id": "hnodfrg",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638934430.0,
            "replies": []
        },
        {
            "body": "I would go to the funeral. Wife would not even notice you are there.",
            "author": "Ronconcocacola333",
            "id": "hnq2kau",
            "parent_id": "t3_rb18va",
            "score": 1,
            "created_utc": 1638975746.0,
            "replies": []
        },
        {
            "body": "I'm going to second have a private ritual. Especially if you think you'll get emotional at the funeral (more than a young coworker).  If the wife had any suspicion it would look odd.  She probably did vaguely know about you and had a don't ask/don't tell policy. I wouldn't want to taint her day, and it's sweet that you and the sister are in touch.  \n\n\nRegardless if you were in love, it's obvious you had a genuine connection and affection for each other.  Grieving a close friend who passed too soon is valid.  Personally, I honour my passed loved ones annually. I look forward to it, it's common in many cultures. Make their favourite meal, go to their favourite place, do something they'd approve of.  Write them a letter and burn it so it reaches them.  Even if you're more on the atheist side, his pain is gone now and it sounds like he had a lovely life with you in it.",
            "author": "bluebell_flames18",
            "id": "hnm0qjr",
            "parent_id": "t1_hnlx2rp",
            "score": 29,
            "created_utc": 1638895921.0,
            "replies": [
                {
                    "body": "Yeah, and it might be better to have something separate of the funeral just for the sake of actually being able to grieve rather than stressing about the wife taking up your energy",
                    "author": "Avery-H-Sinclair",
                    "id": "hnn9adr",
                    "parent_id": "t1_hnm0qjr",
                    "score": 3,
                    "created_utc": 1638915000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can imagine it, there will be a sign directing ex-SBs to the left and a large group of chairs. Then, another sign pointing to the right, saying Family and Friends, which will have a much smaller group of chairs...lol\n\nCan you add me to that list? I literally can't imagine a more target rich environment for a SD. As a fellow SD, I am sure that you would swell with pride in playing SR matchmaker in death. Just got this mental image of me as Will Farrell in Wedding Crashers, when he is at the funerals. Dare to dream...",
            "author": "patienceisavirtue5",
            "id": "hnm2s2u",
            "parent_id": "t1_hnlp4yd",
            "score": 28,
            "created_utc": 1638896820.0,
            "replies": [
                {
                    "body": "He was cleaning up!",
                    "author": "sdphilly",
                    "id": "hnm8ubf",
                    "parent_id": "t1_hnm2s2u",
                    "score": 1,
                    "created_utc": 1638899506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She's asking for comfort , not jokes.",
            "author": "dallas-explorer",
            "id": "hnm4evi",
            "parent_id": "t1_hnlp4yd",
            "score": 3,
            "created_utc": 1638897562.0,
            "replies": [
                {
                    "body": "Just lost my Mom after a long bout with dementia.   Remembering her as she was gave me great joy.  Op can take comfort that she not only knew her guy before cancer stole his being...she was probably the last great pleasure of his life.\n\nTo all SBs out there....It's a noble thing that you do for us!  Remember us for the twisted steel and sex appeal that we used to be...not the rusty old pistols that we become down the road.",
                    "author": "sdphilly",
                    "id": "hnmaonm",
                    "parent_id": "t1_hnm4evi",
                    "score": 23,
                    "created_utc": 1638900299.0,
                    "replies": [
                        {
                            "body": "Haha this made me smile! Thankyou",
                            "author": "Lovehopes23",
                            "id": "hnmbfc3",
                            "parent_id": "t1_hnmaonm",
                            "score": 4,
                            "created_utc": 1638900612.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's a baller move XD",
            "author": "bluebell_flames18",
            "id": "hnm3rmk",
            "parent_id": "t1_hnlp4yd",
            "score": 0,
            "created_utc": 1638897269.0,
            "replies": []
        },
        {
            "body": "Lmfao",
            "author": "Stablegeniousatwork",
            "id": "hnluo8x",
            "parent_id": "t1_hnlp4yd",
            "score": -1,
            "created_utc": 1638893217.0,
            "replies": []
        },
        {
            "body": "Like episode on 2 and half men when charlie dreams about his Funeral.  100 hot crazy girls lined up then spit on the coffin ;-)",
            "author": "Buckeyechamp21",
            "id": "hnmsuzo",
            "parent_id": "t1_hnlp4yd",
            "score": 1,
            "created_utc": 1638908168.0,
            "replies": []
        },
        {
            "body": "I really love this!!!",
            "author": "StarNerd920",
            "id": "hnmtuqp",
            "parent_id": "t1_hnlp4yd",
            "score": 1,
            "created_utc": 1638908566.0,
            "replies": []
        },
        {
            "body": "Funerals are for the living. The dead could care less at this point. The 2nd death is upon him and that’s where the real funeral takes place. Repent!",
            "author": "Upstairs-Hold-5330",
            "id": "ho4kbla",
            "parent_id": "t1_hnlzpwo",
            "score": 1,
            "created_utc": 1639234636.0,
            "replies": []
        },
        {
            "body": "I would do this. Just say that you knew him from work or something , and he was a nice guy.",
            "author": "peterharris100",
            "id": "hnlxa9i",
            "parent_id": "t1_hnlvklb",
            "score": 5,
            "created_utc": 1638894384.0,
            "replies": [
                {
                    "body": "Or just say her dad knew him. 🤪",
                    "author": "garret6758",
                    "id": "hnm1gn5",
                    "parent_id": "t1_hnlxa9i",
                    "score": 8,
                    "created_utc": 1638896239.0,
                    "replies": [
                        {
                            "body": "Yup, it is for you to say goodbye, no one else",
                            "author": "peterharris100",
                            "id": "hnm6roc",
                            "parent_id": "t1_hnm1gn5",
                            "score": -1,
                            "created_utc": 1638898597.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, and it might be better to have something separate of the funeral just for the sake of actually being able to grieve rather than stressing about the wife taking up your energy",
            "author": "Avery-H-Sinclair",
            "id": "hnn9adr",
            "parent_id": "t1_hnm0qjr",
            "score": 3,
            "created_utc": 1638915000.0,
            "replies": []
        },
        {
            "body": "He was cleaning up!",
            "author": "sdphilly",
            "id": "hnm8ubf",
            "parent_id": "t1_hnm2s2u",
            "score": 1,
            "created_utc": 1638899506.0,
            "replies": []
        },
        {
            "body": "Just lost my Mom after a long bout with dementia.   Remembering her as she was gave me great joy.  Op can take comfort that she not only knew her guy before cancer stole his being...she was probably the last great pleasure of his life.\n\nTo all SBs out there....It's a noble thing that you do for us!  Remember us for the twisted steel and sex appeal that we used to be...not the rusty old pistols that we become down the road.",
            "author": "sdphilly",
            "id": "hnmaonm",
            "parent_id": "t1_hnm4evi",
            "score": 23,
            "created_utc": 1638900299.0,
            "replies": [
                {
                    "body": "Haha this made me smile! Thankyou",
                    "author": "Lovehopes23",
                    "id": "hnmbfc3",
                    "parent_id": "t1_hnmaonm",
                    "score": 4,
                    "created_utc": 1638900612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or just say her dad knew him. 🤪",
            "author": "garret6758",
            "id": "hnm1gn5",
            "parent_id": "t1_hnlxa9i",
            "score": 8,
            "created_utc": 1638896239.0,
            "replies": [
                {
                    "body": "Yup, it is for you to say goodbye, no one else",
                    "author": "peterharris100",
                    "id": "hnm6roc",
                    "parent_id": "t1_hnm1gn5",
                    "score": -1,
                    "created_utc": 1638898597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha this made me smile! Thankyou",
            "author": "Lovehopes23",
            "id": "hnmbfc3",
            "parent_id": "t1_hnmaonm",
            "score": 4,
            "created_utc": 1638900612.0,
            "replies": []
        },
        {
            "body": "Yup, it is for you to say goodbye, no one else",
            "author": "peterharris100",
            "id": "hnm6roc",
            "parent_id": "t1_hnm1gn5",
            "score": -1,
            "created_utc": 1638898597.0,
            "replies": []
        }
    ]
}