{
    "title": "Married SD follow up post",
    "post_id": "w5acp3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/w5acp3/married_sd_follow_up_post/",
    "author": "londonbebe",
    "body": "Sigh! Following on from my last post it seemed a lot of people were upset by the fact I had an SD that was married. So much so I've been getting a lot of hate in my dm's. Heck I even got follows from people from r/cheaters forums and such like. I can't get back to all of you hence this post 😘\n\n1. I'm not going to stop seeing him lol he may be an awful husband, but a fantastic SD . Your moral standing is not going to affect me, thanks though \n2. Yes I've accepted the reality of what it is. I'll leave when it runs its course and ends (as do all SR's) \n3. Many SDs that offer my desired allowance are married. If you are not ok with that go for the single ones (though many lie about their marital status)\n4. Thanks everyone else for your advice ♥️",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/w5acp3/married_sd_follow_up_post/",
    "score": 98,
    "upvote_ratio": 0.91,
    "created_utc": 1658495659.0,
    "num_comments": 74,
    "links": [
        [
            "/r/cheaters"
        ]
    ],
    "comments": [
        {
            "body": "I don't understand the sudden wave of judgement around this, given that we've all known and accepted that many (most?) SDs are married, and it's never been an issue.  I especially enjoyed the hypocrisy of the fury at that SB who was married -- evidently some think married SD is fine but for some reason not SB?\n\nIt may be the case that we're under a little mini invasion -- we've had previous episodes with what seemed to be coordinated entry of people from infidelity subs, and I suspect that's happening right now, based on some patterns we're seeing as mods the past few days.  Just FYI, I didn't see your earlier thread, but it might not be the slf community at work here",
            "author": "Azurecole",
            "id": "ih6wwnp",
            "parent_id": "t3_w5acp3",
            "score": 69,
            "created_utc": 1658499311.0,
            "replies": [
                {
                    "body": "Yeah I really don’t get it - why all the morality policing all of a sudden ? \n\nWho the f cares what two consenting adults do in their bedrooms - it is their choice, and nobody else’s business\n\nAnd spare me the bs about “but what about the families “ — as if people blasting the said couple ever care about the affected families anyways",
                    "author": "OCbird22",
                    "id": "ih7112v",
                    "parent_id": "t1_ih6wwnp",
                    "score": 21,
                    "created_utc": 1658500977.0,
                    "replies": [
                        {
                            "body": "I'm thinking more and more it's one or other of the various infidelity subs, doing their every-few-years mini-invasion.",
                            "author": "Azurecole",
                            "id": "ih71sh7",
                            "parent_id": "t1_ih7112v",
                            "score": 5,
                            "created_utc": 1658501280.0,
                            "replies": [
                                {
                                    "body": "Shit they do that?",
                                    "author": "JosephJohnPEEPS",
                                    "id": "ihagj7j",
                                    "parent_id": "t1_ih71sh7",
                                    "score": 0,
                                    "created_utc": 1658555121.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "My take is that we no longer HAVE to choose the married SD, we now have the option to choose a single SD because of just how many men have entered the bowl from all different scenes. Those of us who were never super comfortable with dating married men in the first place are now able to express that discomfort without being a hypocrite. Maybe.\n\nETA- to be clear, I don’t personally *judge*, I just won’t ever do it again.",
                    "author": "Azucarbabby",
                    "id": "ih7ut2t",
                    "parent_id": "t1_ih6wwnp",
                    "score": 10,
                    "created_utc": 1658512461.0,
                    "replies": []
                },
                {
                    "body": "This is not true. I've met many guys that are not. Most have not been married.",
                    "author": "WhisperingPetals",
                    "id": "ih8stwe",
                    "parent_id": "t1_ih6wwnp",
                    "score": 3,
                    "created_utc": 1658525854.0,
                    "replies": []
                },
                {
                    "body": "> it might not be the slf community at work here\n\nInvasion of the sugar snatchers-also from the escort,johns, red pills, scammers ,etc. Why not the moralists?",
                    "author": "GSSD",
                    "id": "ih84fgf",
                    "parent_id": "t1_ih6wwnp",
                    "score": 2,
                    "created_utc": 1658516224.0,
                    "replies": [
                        {
                            "body": "Right.  Although looking through those subs and the post histories of those who came  here, it's a bit more of \"been cheated on, now very hurt and lashing out to make myself feel better, but framing it as morality\".   Which is understandable, getting cheated on can be very traumatizing",
                            "author": "Azurecole",
                            "id": "ih86rbe",
                            "parent_id": "t1_ih84fgf",
                            "score": 2,
                            "created_utc": 1658517140.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If she's who I'm thinking of her post got crossposted to r/amithedevil",
                    "author": "Catezero",
                    "id": "ih8h3kv",
                    "parent_id": "t1_ih6wwnp",
                    "score": 1,
                    "created_utc": 1658521230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I prefer married SDs. If people are talking sh*t send them my way. I have the time today 😂",
            "author": "Fast_Entertainment71",
            "id": "ih6w06h",
            "parent_id": "t3_w5acp3",
            "score": 41,
            "created_utc": 1658498936.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih7nphd",
                    "parent_id": "t1_ih6w06h",
                    "score": 2,
                    "created_utc": 1658509747.0,
                    "replies": [
                        {
                            "body": "Did I say anything to you",
                            "author": "althaf7788",
                            "id": "ih7wz51",
                            "parent_id": "t1_ih7nphd",
                            "score": 3,
                            "created_utc": 1658513310.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Me too lol. Idc what no one thinks. Most of the time the wife cheating in the first place people fail to realize that too.",
                    "author": "Classic-Ad5342",
                    "id": "ihb68kq",
                    "parent_id": "t1_ih6w06h",
                    "score": 1,
                    "created_utc": 1658574993.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very few people actively involved in Sugar Dating would judge you for having a married SD.   Even, most SBs that would not date a married SD don't judge other people for doing so.  They recognize it as a personal choice.  \n\nThere are a lot of people, not actually involved in Sugar Dating, that follow this forum just to harass people. I constantly remind myself that this forum is for people actively involved in the lifestyle to share experiences and to discuss best practices.  It is not for debating the merits and morality of Sugar Dating.  You have to have thick skin and don't let the haters and trolls bother you. It's Reddit, and the anonymity of the internet emboldens people to behave in ways they rarely would in person.",
            "author": "willfromvb",
            "id": "ih6x4vs",
            "parent_id": "t3_w5acp3",
            "score": 27,
            "created_utc": 1658499405.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih6wy2m",
            "parent_id": "t3_w5acp3",
            "score": 23,
            "created_utc": 1658499328.0,
            "replies": []
        },
        {
            "body": "Over 50% of SDs are married, ergo the SBs who date them are in good company. Don't sweat the small stuff.  At least you understand the sugar dynamic. I'd argue that married SDs make longer lasting partners. The single guys are free to be as randy as they want to be. MGs are more appreciative and often don't have the freedom to see multiple and diverse SBs. But as always there are exceptions.",
            "author": "GSSD",
            "id": "ih6v8jy",
            "parent_id": "t3_w5acp3",
            "score": 16,
            "created_utc": 1658498615.0,
            "replies": []
        },
        {
            "body": "Cheating is wrong , no matter how you spin it. However, it happens all the time and it’s stupid to be worried about what other people are doing . I’m fucking a married man because he is hot, genuinely cares about me, he’s a great kisser and he gives me money. Do I feel badly\nwhen I think about how his wife would feel ?\nYep but that’s normal.",
            "author": "West-Fly6407",
            "id": "iha6vcg",
            "parent_id": "t3_w5acp3",
            "score": 5,
            "created_utc": 1658549268.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih7rc79",
            "parent_id": "t3_w5acp3",
            "score": 8,
            "created_utc": 1658511128.0,
            "replies": [
                {
                    "body": ">trying to rekindle their sex life\n\nMy SRs rekindled my sex life with my wife by a lot, but I still do SRs. There is something invigorating about dating girls half my age. Ive paid a lot of dues in my life. Its nice to have this now.",
                    "author": null,
                    "id": "ih9b1a8",
                    "parent_id": "t1_ih7rc79",
                    "score": 1,
                    "created_utc": 1658533743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can imagine people being upset if you would chase after, and seduced, innocent married men, being a homewrecker. \n\nBut those people seem to forget that here we are not talking about innocent married men being the victim of a 'man eater',  but husbands proactively searching for an extramarital affair. Making efforts and paying for a profile and willing to pay their SB for the pleasure isn't like it \"just overcame them and they couldn't resist\", they are actively searching for it! \n\nAnd then it's *YOUR* fault?!\n\nCheaters are going to cheat anyway, so isn't a discreet SB not the safest option vs a vanilla mistress that wants him to leave his wife and have his baby's? (one of the reasons why my married SDs, turned to sugar)",
            "author": "A-touchofreality",
            "id": "ih724bv",
            "parent_id": "t3_w5acp3",
            "score": 8,
            "created_utc": 1658501409.0,
            "replies": [
                {
                    "body": "100%. A married man, good relationship, but sex is painful post menopause... I’d love an open relationship but too traditional, and a “normal” affair is too complex - SD is simple and fab for all involved",
                    "author": null,
                    "id": "ih78zhh",
                    "parent_id": "t1_ih724bv",
                    "score": 5,
                    "created_utc": 1658504099.0,
                    "replies": [
                        {
                            "body": "A good point that doesn't get mentioned often enough . . . about half of women develop vaginal atrophy, post-menopause.  😣",
                            "author": "Her_Gringo_63",
                            "id": "ihlgbcr",
                            "parent_id": "t1_ih78zhh",
                            "score": 2,
                            "created_utc": 1658766507.0,
                            "replies": [
                                {
                                    "body": "Thanks dude. Good point. Traditional values have caused a lot of heartache and pain. Cry freedom 😔",
                                    "author": null,
                                    "id": "ihw2ea9",
                                    "parent_id": "t1_ihlgbcr",
                                    "score": 1,
                                    "created_utc": 1658949110.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I love how people (not the post above me, but the critics of sugaring) say “homewrecker”, but I’m sorry, I’ve been doing this for over a decade, and my home hasn’t ever been “wrecked.” As long as the guy is very careful, there’s no reason for shit to ever make it back home. \n\nPeople need to understand that not everyone has the same morality or the same needs as another person, and no one has the right to tell someone else how to live their life.",
                    "author": "freeewillieee",
                    "id": "ihc9kw3",
                    "parent_id": "t1_ih724bv",
                    "score": 2,
                    "created_utc": 1658594663.0,
                    "replies": [
                        {
                            "body": "Maybe you should have read my comment further than the word 'homewrecker'?",
                            "author": "A-touchofreality",
                            "id": "ihcbn3e",
                            "parent_id": "t1_ihc9kw3",
                            "score": 1,
                            "created_utc": 1658595545.0,
                            "replies": [
                                {
                                    "body": "Sorry I wasn’t speaking to you haha. Just talking about the people who think that way. Not you :)",
                                    "author": "freeewillieee",
                                    "id": "ihccxb9",
                                    "parent_id": "t1_ihcbn3e",
                                    "score": 1,
                                    "created_utc": 1658596095.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear so many people on this forum are hassling you for *none of their damn business*. \n\nThere is a lot of personal ethics being forced onto people here, which personally I find ironic.\n\nGood for you for fighting back with love. I wish I had your tolerance.",
            "author": "Neither-Ad-2833",
            "id": "ih6ulla",
            "parent_id": "t3_w5acp3",
            "score": 10,
            "created_utc": 1658498347.0,
            "replies": [
                {
                    "body": "Well said! And to the OP: It’s your business and no one else’s. Good luck to you!",
                    "author": "Hammerbro10",
                    "id": "ih6wfn1",
                    "parent_id": "t1_ih6ulla",
                    "score": 5,
                    "created_utc": 1658499114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s only your business and his………and then I guess maybe hers….does he have kids? Seriously fuck the noise.",
            "author": "ditchxdiggerson77",
            "id": "ih77fmg",
            "parent_id": "t3_w5acp3",
            "score": 3,
            "created_utc": 1658503500.0,
            "replies": []
        },
        {
            "body": "80% of the SDs are married.",
            "author": null,
            "id": "ih7feye",
            "parent_id": "t3_w5acp3",
            "score": 8,
            "created_utc": 1658506574.0,
            "replies": [
                {
                    "body": "Not in the Bay Area. I’d say it’s more like 40% nowadays. Lots of young, rich tech nerds with no social skills use sugar dating to meet their needs.",
                    "author": "Azucarbabby",
                    "id": "ih7v7vx",
                    "parent_id": "t1_ih7feye",
                    "score": 6,
                    "created_utc": 1658512621.0,
                    "replies": [
                        {
                            "body": "Guess these guys are super skilled in creating Alt identities to show they are single when they are actually married.",
                            "author": null,
                            "id": "ih7y1q9",
                            "parent_id": "t1_ih7v7vx",
                            "score": 0,
                            "created_utc": 1658513731.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8eglr",
                                    "parent_id": "t1_ih7y1q9",
                                    "score": 3,
                                    "created_utc": 1658520178.0,
                                    "replies": [
                                        {
                                            "body": "Is that on the blockchain? Do you also deploy AI and ML?",
                                            "author": null,
                                            "id": "ih8n6yb",
                                            "parent_id": "t1_ih8eglr",
                                            "score": 0,
                                            "created_utc": 1658523606.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ih8nyxr",
                                                    "parent_id": "t1_ih8n6yb",
                                                    "score": 1,
                                                    "created_utc": 1658523907.0,
                                                    "replies": [
                                                        {
                                                            "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
                                                            "author": null,
                                                            "id": "ih8ojlj",
                                                            "parent_id": "t1_ih8nyxr",
                                                            "score": 1,
                                                            "created_utc": 1658524133.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ih8or6n",
                                                                    "parent_id": "t1_ih8ojlj",
                                                                    "score": 1,
                                                                    "created_utc": 1658524218.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Have you not heard of Alt ids and burner phones?",
                                                                            "author": null,
                                                                            "id": "ih8pbf3",
                                                                            "parent_id": "t1_ih8or6n",
                                                                            "score": 2,
                                                                            "created_utc": 1658524441.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "ih8prbw",
                                                                                    "parent_id": "t1_ih8pbf3",
                                                                                    "score": 2,
                                                                                    "created_utc": 1658524617.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                                                                            "author": null,
                                                                                            "id": "ih8r34f",
                                                                                            "parent_id": "t1_ih8prbw",
                                                                                            "score": 0,
                                                                                            "created_utc": 1658525140.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "ih8rjoh",
                                                                                                    "parent_id": "t1_ih8r34f",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1658525328.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                                                                            "author": null,
                                                                                                            "id": "ih8s7a4",
                                                                                                            "parent_id": "t1_ih8rjoh",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1658525597.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "[deleted]",
                                                                                                                    "author": null,
                                                                                                                    "id": "ih8sgs9",
                                                                                                                    "parent_id": "t1_ih8s7a4",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1658525703.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                                                                            "author": null,
                                                                                                                            "id": "ih8u16o",
                                                                                                                            "parent_id": "t1_ih8sgs9",
                                                                                                                            "score": 0,
                                                                                                                            "created_utc": 1658526343.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "[deleted]",
                                                                                                                                    "author": null,
                                                                                                                                    "id": "ih8u77j",
                                                                                                                                    "parent_id": "t1_ih8u16o",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1658526412.0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                                                                            "author": null,
                                                                                                                                            "id": "ih8uhe8",
                                                                                                                                            "parent_id": "t1_ih8u77j",
                                                                                                                                            "score": 1,
                                                                                                                                            "created_utc": 1658526526.0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I’m sure that’s the case for a lot but lots of these men are truly young & single, or bitter and divorced 🤷🏼‍♀️",
                                    "author": "Azucarbabby",
                                    "id": "ih8dysm",
                                    "parent_id": "t1_ih7y1q9",
                                    "score": 3,
                                    "created_utc": 1658519982.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "At least!",
                    "author": "NoBagelNoBagel1",
                    "id": "ih7mwvi",
                    "parent_id": "t1_ih7feye",
                    "score": 0,
                    "created_utc": 1658509438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just remember Mark Twains quote “Never argue with stupid people. They will drag you down to their level and then beat you with experience”",
            "author": "SingleCondition4",
            "id": "ih7g80h",
            "parent_id": "t3_w5acp3",
            "score": 6,
            "created_utc": 1658506883.0,
            "replies": []
        },
        {
            "body": "Wait.  I am so confused.  Aren’t the majority of SD’s married?  At least the few I had over the years when I was sugaring were.",
            "author": "blondeyogi0113",
            "id": "ihrygfm",
            "parent_id": "t3_w5acp3",
            "score": 2,
            "created_utc": 1658874653.0,
            "replies": []
        },
        {
            "body": "I can’t believe people have nothing better to do with themselves than dm you to hate on the fact that you date a married SD. Heck, I imagine the majority of SDs are married or in a vanilla relationship (whether they are upfront about it or not). Sorry you had to experience this.",
            "author": "myusername_77",
            "id": "ih6yzyz",
            "parent_id": "t3_w5acp3",
            "score": 4,
            "created_utc": 1658500162.0,
            "replies": []
        },
        {
            "body": "I have seen weird things on this forum. Ladies who have described themselves as curvy / overweight have ridiculed SDs as fat, old and ugly. Married SBs have hinted they only prefer to date single guys. Ladies who have bragged about having multiple SDs (clients) have criticized others for such relationships. Other SBs who have hinted at being broke themselves have ridiculed SDs for their simple tastes. \n\nIt’s all here!!",
            "author": null,
            "id": "ih7hser",
            "parent_id": "t3_w5acp3",
            "score": 5,
            "created_utc": 1658507483.0,
            "replies": [
                {
                    "body": "And that was just last week 🤣",
                    "author": "Scarlettluxxx72",
                    "id": "ih7npc5",
                    "parent_id": "t1_ih7hser",
                    "score": 1,
                    "created_utc": 1658509745.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it helps.  I’ve been with maybe 25 SB.  All knew my story of being married from Day1.   Perhaps 2/3 of the women I took at M&G passed on me based on their unwillingness to facilitate my DADT status at home.   When I first started I thought it would be harder ( 1 in 100) .  But I think acceptance in our society is much greater than most realize.   People need love and hugs and support.   Trust your instincts.",
            "author": "WhippetQuick1",
            "id": "ih7iqs2",
            "parent_id": "t3_w5acp3",
            "score": 3,
            "created_utc": 1658507848.0,
            "replies": []
        },
        {
            "body": "At some point this place was in agreement that Married SD’s are the best because \n1 - they aren’t clingy\n2- there is never a chance of it developing into something else \n3 - they don’t demand overnights and constant attention. \n\nLooks like the demographics has changed and we have a lot of single lonely SD’s on the forum. \n\nFuck em. You do what’s best for you.",
            "author": "professorxc",
            "id": "ih9aaex",
            "parent_id": "t3_w5acp3",
            "score": 3,
            "created_utc": 1658533398.0,
            "replies": []
        },
        {
            "body": "Some fascinating scientific data shows that men who have more copies of the gene RS3 334 have weaker vasopressin (which creates pair bonding) effects on the brain. Some men are inclined to have and hold a single partner and some are not, due to the amount of copies of this gene (among other factors I’m sure). The science of love and sex isn’t always romantic but it does offer insight as to why we are attracted to certain people. So, it’s highly likely that even if the man did not cheat with you, he would have cheated anyway. Also, I see a lot of women (also men but I don’t interact with them as often) who simply decide to stop having sex with their partner. Is a spouse supposed to just give up sex forever?! I think every person has to make this choice on their own. I’m not blaming anyone. But whoever is attacking you probably needs a better hobby and to start researching why it is a fear they have or what the brain responds to scientifically. (I’m a neuroscience nerd so this stuff is wild to me!)",
            "author": "iamrosieriley",
            "id": "ih81w3h",
            "parent_id": "t3_w5acp3",
            "score": 3,
            "created_utc": 1658515230.0,
            "replies": [
                {
                    "body": ">he may be an awful husband, but a fantastic SD \n\nThis is not may case. My wife and I have a great relationship. She is eleven years younger than me. I did divorce my first wife once I met her. I just use SRs to fill the gaps of what I don't get with my wife and also because I love to have a meaningful relationship with a sexy young girl. I do feel a little guilty for having it so good, but you only live once.",
                    "author": null,
                    "id": "ih9anmk",
                    "parent_id": "t1_ih81w3h",
                    "score": 0,
                    "created_utc": 1658533566.0,
                    "replies": [
                        {
                            "body": "Hi! Out of pure curiosity, do you think your wife also fills in the gaps and would it upset you if she does?",
                            "author": "iamrosieriley",
                            "id": "ihbopu8",
                            "parent_id": "t1_ih9anmk",
                            "score": 0,
                            "created_utc": 1658585530.0,
                            "replies": [
                                {
                                    "body": "No, its not working out that way. My SRs are invigorating and are creating new opportunities for my marriage. My attitude is different and while my SRs are discreet I'm different in a good way. Sex with my wife is better. Our relationship is better. Our communication is better. Id say SRs are creating more opportunity and better outcomes for everyone including my wife. Without the SR this would not have happened.",
                                    "author": null,
                                    "id": "ihcqcni",
                                    "parent_id": "t1_ihbopu8",
                                    "score": 1,
                                    "created_utc": 1658601859.0,
                                    "replies": [
                                        {
                                            "body": "I don’t doubt that! I’m not questioning that the SR’s don’t improve your marriage. I have seen this happen in other relationships. My questions are:\nDoes your wife know? And if not, why wouldn’t you encourage her to seek out the “missing parts” in her own SRs? Or perhaps you do! This isn’t coming from a place of judgement. I am simply curious why a man would need outside sources to fill gaps but a woman would not. It seems that if both are getting unmet needs filled than the relationship as a whole would improve 2x’s over. For example, if your wife is younger, she may wish to connect with a man who can understand her generation/pop culture better. Similar to you wanting to feel alive and desired by a younger woman. If your wife has an SR of her own, than maybe the outcome would be even better than now!",
                                            "author": "iamrosieriley",
                                            "id": "ihcvu3o",
                                            "parent_id": "t1_ihcqcni",
                                            "score": 1,
                                            "created_utc": 1658604273.0,
                                            "replies": [
                                                {
                                                    "body": "My wife does not currently know, but Im always thinking of ways to integrate my SR, just one into my life so its not quite so secret. The “missing parts” aren't really missing they are just new and exciting. Its like having a muse. Sometimes you need someone young or different to expand your own horizons. I think older women need this too, its just different in how they go about it.\n\nCuriously my wife did have a SR of her own before I knew her well and she was quite invigorated by it, but it was not sustained once we got married. Today it would be awkward because I don't really swing that way, but the inverse may not be as true.",
                                                    "author": null,
                                                    "id": "ihdicw6",
                                                    "parent_id": "t1_ihcvu3o",
                                                    "score": 2,
                                                    "created_utc": 1658614119.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
                                                            "author": "iamrosieriley",
                                                            "id": "ihdnbrk",
                                                            "parent_id": "t1_ihdicw6",
                                                            "score": 1,
                                                            "created_utc": 1658616353.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am sorry you are going though this. I am married in a dead bedroom situation. I have had Sugar babies before. They were aware of my situation and had no problems. Its hard to find SB that are ok with married SD in bay area. Anyway, hope you are happy.",
            "author": "Odd-Ferret1784",
            "id": "ih8tuci",
            "parent_id": "t3_w5acp3",
            "score": 2,
            "created_utc": 1658526265.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8vv28",
                    "parent_id": "t1_ih8tuci",
                    "score": 1,
                    "created_utc": 1658527093.0,
                    "replies": [
                        {
                            "body": "Lol sure. Let me just tell my wife \"Hey babe, have an important meeting in London, I will be gone for a week. Byee!\"",
                            "author": "Odd-Ferret1784",
                            "id": "ih8womy",
                            "parent_id": "t1_ih8vv28",
                            "score": 0,
                            "created_utc": 1658527435.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8xpdb",
                                    "parent_id": "t1_ih8womy",
                                    "score": 2,
                                    "created_utc": 1658527866.0,
                                    "replies": [
                                        {
                                            "body": "Yes ma'am will do 😂",
                                            "author": "Odd-Ferret1784",
                                            "id": "ih8yroq",
                                            "parent_id": "t1_ih8xpdb",
                                            "score": 1,
                                            "created_utc": 1658528322.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought this was kind of common 👀",
            "author": null,
            "id": "ih8d9rg",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658519705.0,
            "replies": []
        },
        {
            "body": "I didn’t see your previous post but married men cheating on their wives on sa is probably the most commmon type of sd sb arrangement \n\nDunno why people are hating on something common",
            "author": "wb19081908",
            "id": "ih8mq76",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658523425.0,
            "replies": []
        },
        {
            "body": "No judgement from me girly! Honestly I’d be the same way.. as long as he meets your needs who cares if he’s married?",
            "author": "Express_Librarian210",
            "id": "ih93xy3",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658530554.0,
            "replies": []
        },
        {
            "body": "They don’t all tell you they are married.",
            "author": "Grouchy-Surround5372",
            "id": "ihafsuy",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658554636.0,
            "replies": []
        },
        {
            "body": "Most men on SA are married… I think if they werent they’d be on more traditional websites: tinder, POF… SA offers more privacy and less bs for married dudes",
            "author": "Good_vibes_mee",
            "id": "ihbjx9o",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658583170.0,
            "replies": []
        },
        {
            "body": "You do you and enjoy your SD.\n\nTo the spiteful ones, perhaps they should think about how they’ll keep their future husbands from straying; a small percentage of those deep thinkers will realize open marriages are a good thing.",
            "author": "quietgrey1",
            "id": "ih6uv48",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658498455.0,
            "replies": []
        },
        {
            "body": "Why are these people harassing you? Are they women?",
            "author": "sugardad123",
            "id": "ih7b2zd",
            "parent_id": "t3_w5acp3",
            "score": 0,
            "created_utc": 1658504906.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih7cevt",
                    "parent_id": "t1_ih7b2zd",
                    "score": 3,
                    "created_utc": 1658505422.0,
                    "replies": [
                        {
                            "body": "It’s jealousy. Ignore them x",
                            "author": null,
                            "id": "ih7qcay",
                            "parent_id": "t1_ih7cevt",
                            "score": 0,
                            "created_utc": 1658510751.0,
                            "replies": []
                        },
                        {
                            "body": "Sorry Love. Sometimes I’m not very proud of my fellow sisters 👯‍♀️ You do you boo! His wife, his life.",
                            "author": "BeautyBaby247",
                            "id": "ih8q2v4",
                            "parent_id": "t1_ih7cevt",
                            "score": 0,
                            "created_utc": 1658524743.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed on all counts. I don't get the hate towards SB's who are ok with, or like in my case, prefer married ones.\nIt's not as though we're trying to seduce them away from their wives. They're choosing to make themselves available, and there's plenty of reasons they do so, I'm not gonna judge. Just there to mutually benefit",
            "author": "Additional-Ability99",
            "id": "ih7ptw4",
            "parent_id": "t3_w5acp3",
            "score": 0,
            "created_utc": 1658510556.0,
            "replies": []
        },
        {
            "body": "You said it best, I’m in the same position. Life is good and that’s all that matters.",
            "author": "smileybug25",
            "id": "ih7u5o1",
            "parent_id": "t3_w5acp3",
            "score": 0,
            "created_utc": 1658512211.0,
            "replies": []
        },
        {
            "body": "Ive been with many married men.\nIts a real and big part of the sugar world.\n\nHaving an affair isnt easy nor easy to find a partner. With affair websites the idea is that both have the same benefits\n\nWith sugaring you don't\n\nThe man gets\n\nYoung\nBeautiful\nEasy going\nUnderstanding of his personal life\nWont get attached\nEtc\n\nShe gets\n\nThe dates\nPotential holidays\nGifts\nMoney\nNew experiences\nEtc\n\nWhat kind of man wants the mans list and is willing to gige the womans list for it? Often married men\n\nWe value monogamy very highly in our culture yes I get that. Yet it happens. Yes its disrespectful because presumingly the wife would be most upset and so on but I actually believe that the love and care is there but often in relationships we go unfulfilled. A way to achieve more fulfillness and keep a family unit is an affair\n\nI met a man once and I truly so believe he loved his wife a lot. She was repulsed at a kink he had and sure he could have supressed it for her sake, or she could have got over her judgement for his pleasure. Whats right after all. Yet the solution was that. He saw me, had an amazing time and went back to his love.\n\nWe all make our choices.",
            "author": "New-Operation-9259",
            "id": "ih8gqd3",
            "parent_id": "t3_w5acp3",
            "score": 0,
            "created_utc": 1658521085.0,
            "replies": [
                {
                    "body": "What kink was she repulsed at? 🤷‍♂️",
                    "author": "Zealousideal_Reach31",
                    "id": "ih9tcux",
                    "parent_id": "t1_ih8gqd3",
                    "score": 1,
                    "created_utc": 1658542368.0,
                    "replies": []
                },
                {
                    "body": ">We value monogamy very highly\n\nAs we move through time I think this will become less true. Aldus Huxley predicted this.",
                    "author": null,
                    "id": "ih9b87p",
                    "parent_id": "t1_ih8gqd3",
                    "score": -2,
                    "created_utc": 1658533833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\nThe tiger doesn’t change their stripes, once a cheater always a cheater. He is going to cheat on you too, don’t get too attached londonbabe",
            "author": null,
            "id": "ih6ozl9",
            "parent_id": "t3_w5acp3",
            "score": -10,
            "created_utc": 1658495915.0,
            "replies": [
                {
                    "body": "You do get it is not a relationship but an arrangement right? Doh",
                    "author": "Reasonable_Sir_3158",
                    "id": "ih6zw8o",
                    "parent_id": "t1_ih6ozl9",
                    "score": 7,
                    "created_utc": 1658500521.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The political climate seems to be emboldening some losers to think that they have a right to rule on other peoples’ private lives. Ignore the haters!",
            "author": "LippoLippi1500",
            "id": "ih72187",
            "parent_id": "t3_w5acp3",
            "score": -3,
            "created_utc": 1658501375.0,
            "replies": []
        },
        {
            "body": "Yeah... my response got blasted by those folks.\n\nWe all have different values and definitions of what marriage is supposed to be. They project their ideas onto others and \\*poof\\* they are right, and you are wrong.\n\nThe only true right in the world is being true to yourself.  Think about the costs, try to be a force for what you believe is good, and then be a bad ass you.",
            "author": "GlucoseGuardians",
            "id": "ih7gg5x",
            "parent_id": "t3_w5acp3",
            "score": -1,
            "created_utc": 1658506970.0,
            "replies": []
        },
        {
            "body": "Ha love this. Keep doing you 💕",
            "author": null,
            "id": "ih7q8pd",
            "parent_id": "t3_w5acp3",
            "score": -1,
            "created_utc": 1658510712.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ihg47wg",
            "parent_id": "t3_w5acp3",
            "score": 1,
            "created_utc": 1658670330.0,
            "replies": []
        },
        {
            "body": "Yeah I really don’t get it - why all the morality policing all of a sudden ? \n\nWho the f cares what two consenting adults do in their bedrooms - it is their choice, and nobody else’s business\n\nAnd spare me the bs about “but what about the families “ — as if people blasting the said couple ever care about the affected families anyways",
            "author": "OCbird22",
            "id": "ih7112v",
            "parent_id": "t1_ih6wwnp",
            "score": 21,
            "created_utc": 1658500977.0,
            "replies": [
                {
                    "body": "I'm thinking more and more it's one or other of the various infidelity subs, doing their every-few-years mini-invasion.",
                    "author": "Azurecole",
                    "id": "ih71sh7",
                    "parent_id": "t1_ih7112v",
                    "score": 5,
                    "created_utc": 1658501280.0,
                    "replies": [
                        {
                            "body": "Shit they do that?",
                            "author": "JosephJohnPEEPS",
                            "id": "ihagj7j",
                            "parent_id": "t1_ih71sh7",
                            "score": 0,
                            "created_utc": 1658555121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My take is that we no longer HAVE to choose the married SD, we now have the option to choose a single SD because of just how many men have entered the bowl from all different scenes. Those of us who were never super comfortable with dating married men in the first place are now able to express that discomfort without being a hypocrite. Maybe.\n\nETA- to be clear, I don’t personally *judge*, I just won’t ever do it again.",
            "author": "Azucarbabby",
            "id": "ih7ut2t",
            "parent_id": "t1_ih6wwnp",
            "score": 10,
            "created_utc": 1658512461.0,
            "replies": []
        },
        {
            "body": "This is not true. I've met many guys that are not. Most have not been married.",
            "author": "WhisperingPetals",
            "id": "ih8stwe",
            "parent_id": "t1_ih6wwnp",
            "score": 3,
            "created_utc": 1658525854.0,
            "replies": []
        },
        {
            "body": "> it might not be the slf community at work here\n\nInvasion of the sugar snatchers-also from the escort,johns, red pills, scammers ,etc. Why not the moralists?",
            "author": "GSSD",
            "id": "ih84fgf",
            "parent_id": "t1_ih6wwnp",
            "score": 2,
            "created_utc": 1658516224.0,
            "replies": [
                {
                    "body": "Right.  Although looking through those subs and the post histories of those who came  here, it's a bit more of \"been cheated on, now very hurt and lashing out to make myself feel better, but framing it as morality\".   Which is understandable, getting cheated on can be very traumatizing",
                    "author": "Azurecole",
                    "id": "ih86rbe",
                    "parent_id": "t1_ih84fgf",
                    "score": 2,
                    "created_utc": 1658517140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If she's who I'm thinking of her post got crossposted to r/amithedevil",
            "author": "Catezero",
            "id": "ih8h3kv",
            "parent_id": "t1_ih6wwnp",
            "score": 1,
            "created_utc": 1658521230.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih7nphd",
            "parent_id": "t1_ih6w06h",
            "score": 2,
            "created_utc": 1658509747.0,
            "replies": [
                {
                    "body": "Did I say anything to you",
                    "author": "althaf7788",
                    "id": "ih7wz51",
                    "parent_id": "t1_ih7nphd",
                    "score": 3,
                    "created_utc": 1658513310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Me too lol. Idc what no one thinks. Most of the time the wife cheating in the first place people fail to realize that too.",
            "author": "Classic-Ad5342",
            "id": "ihb68kq",
            "parent_id": "t1_ih6w06h",
            "score": 1,
            "created_utc": 1658574993.0,
            "replies": []
        },
        {
            "body": ">trying to rekindle their sex life\n\nMy SRs rekindled my sex life with my wife by a lot, but I still do SRs. There is something invigorating about dating girls half my age. Ive paid a lot of dues in my life. Its nice to have this now.",
            "author": null,
            "id": "ih9b1a8",
            "parent_id": "t1_ih7rc79",
            "score": 1,
            "created_utc": 1658533743.0,
            "replies": []
        },
        {
            "body": "100%. A married man, good relationship, but sex is painful post menopause... I’d love an open relationship but too traditional, and a “normal” affair is too complex - SD is simple and fab for all involved",
            "author": null,
            "id": "ih78zhh",
            "parent_id": "t1_ih724bv",
            "score": 5,
            "created_utc": 1658504099.0,
            "replies": [
                {
                    "body": "A good point that doesn't get mentioned often enough . . . about half of women develop vaginal atrophy, post-menopause.  😣",
                    "author": "Her_Gringo_63",
                    "id": "ihlgbcr",
                    "parent_id": "t1_ih78zhh",
                    "score": 2,
                    "created_utc": 1658766507.0,
                    "replies": [
                        {
                            "body": "Thanks dude. Good point. Traditional values have caused a lot of heartache and pain. Cry freedom 😔",
                            "author": null,
                            "id": "ihw2ea9",
                            "parent_id": "t1_ihlgbcr",
                            "score": 1,
                            "created_utc": 1658949110.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love how people (not the post above me, but the critics of sugaring) say “homewrecker”, but I’m sorry, I’ve been doing this for over a decade, and my home hasn’t ever been “wrecked.” As long as the guy is very careful, there’s no reason for shit to ever make it back home. \n\nPeople need to understand that not everyone has the same morality or the same needs as another person, and no one has the right to tell someone else how to live their life.",
            "author": "freeewillieee",
            "id": "ihc9kw3",
            "parent_id": "t1_ih724bv",
            "score": 2,
            "created_utc": 1658594663.0,
            "replies": [
                {
                    "body": "Maybe you should have read my comment further than the word 'homewrecker'?",
                    "author": "A-touchofreality",
                    "id": "ihcbn3e",
                    "parent_id": "t1_ihc9kw3",
                    "score": 1,
                    "created_utc": 1658595545.0,
                    "replies": [
                        {
                            "body": "Sorry I wasn’t speaking to you haha. Just talking about the people who think that way. Not you :)",
                            "author": "freeewillieee",
                            "id": "ihccxb9",
                            "parent_id": "t1_ihcbn3e",
                            "score": 1,
                            "created_utc": 1658596095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said! And to the OP: It’s your business and no one else’s. Good luck to you!",
            "author": "Hammerbro10",
            "id": "ih6wfn1",
            "parent_id": "t1_ih6ulla",
            "score": 5,
            "created_utc": 1658499114.0,
            "replies": []
        },
        {
            "body": "Not in the Bay Area. I’d say it’s more like 40% nowadays. Lots of young, rich tech nerds with no social skills use sugar dating to meet their needs.",
            "author": "Azucarbabby",
            "id": "ih7v7vx",
            "parent_id": "t1_ih7feye",
            "score": 6,
            "created_utc": 1658512621.0,
            "replies": [
                {
                    "body": "Guess these guys are super skilled in creating Alt identities to show they are single when they are actually married.",
                    "author": null,
                    "id": "ih7y1q9",
                    "parent_id": "t1_ih7v7vx",
                    "score": 0,
                    "created_utc": 1658513731.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8eglr",
                            "parent_id": "t1_ih7y1q9",
                            "score": 3,
                            "created_utc": 1658520178.0,
                            "replies": [
                                {
                                    "body": "Is that on the blockchain? Do you also deploy AI and ML?",
                                    "author": null,
                                    "id": "ih8n6yb",
                                    "parent_id": "t1_ih8eglr",
                                    "score": 0,
                                    "created_utc": 1658523606.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ih8nyxr",
                                            "parent_id": "t1_ih8n6yb",
                                            "score": 1,
                                            "created_utc": 1658523907.0,
                                            "replies": [
                                                {
                                                    "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
                                                    "author": null,
                                                    "id": "ih8ojlj",
                                                    "parent_id": "t1_ih8nyxr",
                                                    "score": 1,
                                                    "created_utc": 1658524133.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ih8or6n",
                                                            "parent_id": "t1_ih8ojlj",
                                                            "score": 1,
                                                            "created_utc": 1658524218.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Have you not heard of Alt ids and burner phones?",
                                                                    "author": null,
                                                                    "id": "ih8pbf3",
                                                                    "parent_id": "t1_ih8or6n",
                                                                    "score": 2,
                                                                    "created_utc": 1658524441.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "ih8prbw",
                                                                            "parent_id": "t1_ih8pbf3",
                                                                            "score": 2,
                                                                            "created_utc": 1658524617.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                                                                    "author": null,
                                                                                    "id": "ih8r34f",
                                                                                    "parent_id": "t1_ih8prbw",
                                                                                    "score": 0,
                                                                                    "created_utc": 1658525140.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "ih8rjoh",
                                                                                            "parent_id": "t1_ih8r34f",
                                                                                            "score": 1,
                                                                                            "created_utc": 1658525328.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                                                                    "author": null,
                                                                                                    "id": "ih8s7a4",
                                                                                                    "parent_id": "t1_ih8rjoh",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1658525597.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[deleted]",
                                                                                                            "author": null,
                                                                                                            "id": "ih8sgs9",
                                                                                                            "parent_id": "t1_ih8s7a4",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1658525703.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                                                                    "author": null,
                                                                                                                    "id": "ih8u16o",
                                                                                                                    "parent_id": "t1_ih8sgs9",
                                                                                                                    "score": 0,
                                                                                                                    "created_utc": 1658526343.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "[deleted]",
                                                                                                                            "author": null,
                                                                                                                            "id": "ih8u77j",
                                                                                                                            "parent_id": "t1_ih8u16o",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1658526412.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                                                                    "author": null,
                                                                                                                                    "id": "ih8uhe8",
                                                                                                                                    "parent_id": "t1_ih8u77j",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1658526526.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’m sure that’s the case for a lot but lots of these men are truly young & single, or bitter and divorced 🤷🏼‍♀️",
                            "author": "Azucarbabby",
                            "id": "ih8dysm",
                            "parent_id": "t1_ih7y1q9",
                            "score": 3,
                            "created_utc": 1658519982.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At least!",
            "author": "NoBagelNoBagel1",
            "id": "ih7mwvi",
            "parent_id": "t1_ih7feye",
            "score": 0,
            "created_utc": 1658509438.0,
            "replies": []
        },
        {
            "body": "And that was just last week 🤣",
            "author": "Scarlettluxxx72",
            "id": "ih7npc5",
            "parent_id": "t1_ih7hser",
            "score": 1,
            "created_utc": 1658509745.0,
            "replies": []
        },
        {
            "body": ">he may be an awful husband, but a fantastic SD \n\nThis is not may case. My wife and I have a great relationship. She is eleven years younger than me. I did divorce my first wife once I met her. I just use SRs to fill the gaps of what I don't get with my wife and also because I love to have a meaningful relationship with a sexy young girl. I do feel a little guilty for having it so good, but you only live once.",
            "author": null,
            "id": "ih9anmk",
            "parent_id": "t1_ih81w3h",
            "score": 0,
            "created_utc": 1658533566.0,
            "replies": [
                {
                    "body": "Hi! Out of pure curiosity, do you think your wife also fills in the gaps and would it upset you if she does?",
                    "author": "iamrosieriley",
                    "id": "ihbopu8",
                    "parent_id": "t1_ih9anmk",
                    "score": 0,
                    "created_utc": 1658585530.0,
                    "replies": [
                        {
                            "body": "No, its not working out that way. My SRs are invigorating and are creating new opportunities for my marriage. My attitude is different and while my SRs are discreet I'm different in a good way. Sex with my wife is better. Our relationship is better. Our communication is better. Id say SRs are creating more opportunity and better outcomes for everyone including my wife. Without the SR this would not have happened.",
                            "author": null,
                            "id": "ihcqcni",
                            "parent_id": "t1_ihbopu8",
                            "score": 1,
                            "created_utc": 1658601859.0,
                            "replies": [
                                {
                                    "body": "I don’t doubt that! I’m not questioning that the SR’s don’t improve your marriage. I have seen this happen in other relationships. My questions are:\nDoes your wife know? And if not, why wouldn’t you encourage her to seek out the “missing parts” in her own SRs? Or perhaps you do! This isn’t coming from a place of judgement. I am simply curious why a man would need outside sources to fill gaps but a woman would not. It seems that if both are getting unmet needs filled than the relationship as a whole would improve 2x’s over. For example, if your wife is younger, she may wish to connect with a man who can understand her generation/pop culture better. Similar to you wanting to feel alive and desired by a younger woman. If your wife has an SR of her own, than maybe the outcome would be even better than now!",
                                    "author": "iamrosieriley",
                                    "id": "ihcvu3o",
                                    "parent_id": "t1_ihcqcni",
                                    "score": 1,
                                    "created_utc": 1658604273.0,
                                    "replies": [
                                        {
                                            "body": "My wife does not currently know, but Im always thinking of ways to integrate my SR, just one into my life so its not quite so secret. The “missing parts” aren't really missing they are just new and exciting. Its like having a muse. Sometimes you need someone young or different to expand your own horizons. I think older women need this too, its just different in how they go about it.\n\nCuriously my wife did have a SR of her own before I knew her well and she was quite invigorated by it, but it was not sustained once we got married. Today it would be awkward because I don't really swing that way, but the inverse may not be as true.",
                                            "author": null,
                                            "id": "ihdicw6",
                                            "parent_id": "t1_ihcvu3o",
                                            "score": 2,
                                            "created_utc": 1658614119.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
                                                    "author": "iamrosieriley",
                                                    "id": "ihdnbrk",
                                                    "parent_id": "t1_ihdicw6",
                                                    "score": 1,
                                                    "created_utc": 1658616353.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8vv28",
            "parent_id": "t1_ih8tuci",
            "score": 1,
            "created_utc": 1658527093.0,
            "replies": [
                {
                    "body": "Lol sure. Let me just tell my wife \"Hey babe, have an important meeting in London, I will be gone for a week. Byee!\"",
                    "author": "Odd-Ferret1784",
                    "id": "ih8womy",
                    "parent_id": "t1_ih8vv28",
                    "score": 0,
                    "created_utc": 1658527435.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8xpdb",
                            "parent_id": "t1_ih8womy",
                            "score": 2,
                            "created_utc": 1658527866.0,
                            "replies": [
                                {
                                    "body": "Yes ma'am will do 😂",
                                    "author": "Odd-Ferret1784",
                                    "id": "ih8yroq",
                                    "parent_id": "t1_ih8xpdb",
                                    "score": 1,
                                    "created_utc": 1658528322.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih7cevt",
            "parent_id": "t1_ih7b2zd",
            "score": 3,
            "created_utc": 1658505422.0,
            "replies": [
                {
                    "body": "It’s jealousy. Ignore them x",
                    "author": null,
                    "id": "ih7qcay",
                    "parent_id": "t1_ih7cevt",
                    "score": 0,
                    "created_utc": 1658510751.0,
                    "replies": []
                },
                {
                    "body": "Sorry Love. Sometimes I’m not very proud of my fellow sisters 👯‍♀️ You do you boo! His wife, his life.",
                    "author": "BeautyBaby247",
                    "id": "ih8q2v4",
                    "parent_id": "t1_ih7cevt",
                    "score": 0,
                    "created_utc": 1658524743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What kink was she repulsed at? 🤷‍♂️",
            "author": "Zealousideal_Reach31",
            "id": "ih9tcux",
            "parent_id": "t1_ih8gqd3",
            "score": 1,
            "created_utc": 1658542368.0,
            "replies": []
        },
        {
            "body": ">We value monogamy very highly\n\nAs we move through time I think this will become less true. Aldus Huxley predicted this.",
            "author": null,
            "id": "ih9b87p",
            "parent_id": "t1_ih8gqd3",
            "score": -2,
            "created_utc": 1658533833.0,
            "replies": []
        },
        {
            "body": "You do get it is not a relationship but an arrangement right? Doh",
            "author": "Reasonable_Sir_3158",
            "id": "ih6zw8o",
            "parent_id": "t1_ih6ozl9",
            "score": 7,
            "created_utc": 1658500521.0,
            "replies": []
        },
        {
            "body": "I'm thinking more and more it's one or other of the various infidelity subs, doing their every-few-years mini-invasion.",
            "author": "Azurecole",
            "id": "ih71sh7",
            "parent_id": "t1_ih7112v",
            "score": 5,
            "created_utc": 1658501280.0,
            "replies": [
                {
                    "body": "Shit they do that?",
                    "author": "JosephJohnPEEPS",
                    "id": "ihagj7j",
                    "parent_id": "t1_ih71sh7",
                    "score": 0,
                    "created_utc": 1658555121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right.  Although looking through those subs and the post histories of those who came  here, it's a bit more of \"been cheated on, now very hurt and lashing out to make myself feel better, but framing it as morality\".   Which is understandable, getting cheated on can be very traumatizing",
            "author": "Azurecole",
            "id": "ih86rbe",
            "parent_id": "t1_ih84fgf",
            "score": 2,
            "created_utc": 1658517140.0,
            "replies": []
        },
        {
            "body": "Did I say anything to you",
            "author": "althaf7788",
            "id": "ih7wz51",
            "parent_id": "t1_ih7nphd",
            "score": 3,
            "created_utc": 1658513310.0,
            "replies": []
        },
        {
            "body": "A good point that doesn't get mentioned often enough . . . about half of women develop vaginal atrophy, post-menopause.  😣",
            "author": "Her_Gringo_63",
            "id": "ihlgbcr",
            "parent_id": "t1_ih78zhh",
            "score": 2,
            "created_utc": 1658766507.0,
            "replies": [
                {
                    "body": "Thanks dude. Good point. Traditional values have caused a lot of heartache and pain. Cry freedom 😔",
                    "author": null,
                    "id": "ihw2ea9",
                    "parent_id": "t1_ihlgbcr",
                    "score": 1,
                    "created_utc": 1658949110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe you should have read my comment further than the word 'homewrecker'?",
            "author": "A-touchofreality",
            "id": "ihcbn3e",
            "parent_id": "t1_ihc9kw3",
            "score": 1,
            "created_utc": 1658595545.0,
            "replies": [
                {
                    "body": "Sorry I wasn’t speaking to you haha. Just talking about the people who think that way. Not you :)",
                    "author": "freeewillieee",
                    "id": "ihccxb9",
                    "parent_id": "t1_ihcbn3e",
                    "score": 1,
                    "created_utc": 1658596095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guess these guys are super skilled in creating Alt identities to show they are single when they are actually married.",
            "author": null,
            "id": "ih7y1q9",
            "parent_id": "t1_ih7v7vx",
            "score": 0,
            "created_utc": 1658513731.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8eglr",
                    "parent_id": "t1_ih7y1q9",
                    "score": 3,
                    "created_utc": 1658520178.0,
                    "replies": [
                        {
                            "body": "Is that on the blockchain? Do you also deploy AI and ML?",
                            "author": null,
                            "id": "ih8n6yb",
                            "parent_id": "t1_ih8eglr",
                            "score": 0,
                            "created_utc": 1658523606.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8nyxr",
                                    "parent_id": "t1_ih8n6yb",
                                    "score": 1,
                                    "created_utc": 1658523907.0,
                                    "replies": [
                                        {
                                            "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
                                            "author": null,
                                            "id": "ih8ojlj",
                                            "parent_id": "t1_ih8nyxr",
                                            "score": 1,
                                            "created_utc": 1658524133.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ih8or6n",
                                                    "parent_id": "t1_ih8ojlj",
                                                    "score": 1,
                                                    "created_utc": 1658524218.0,
                                                    "replies": [
                                                        {
                                                            "body": "Have you not heard of Alt ids and burner phones?",
                                                            "author": null,
                                                            "id": "ih8pbf3",
                                                            "parent_id": "t1_ih8or6n",
                                                            "score": 2,
                                                            "created_utc": 1658524441.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ih8prbw",
                                                                    "parent_id": "t1_ih8pbf3",
                                                                    "score": 2,
                                                                    "created_utc": 1658524617.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                                                            "author": null,
                                                                            "id": "ih8r34f",
                                                                            "parent_id": "t1_ih8prbw",
                                                                            "score": 0,
                                                                            "created_utc": 1658525140.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "ih8rjoh",
                                                                                    "parent_id": "t1_ih8r34f",
                                                                                    "score": 1,
                                                                                    "created_utc": 1658525328.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                                                            "author": null,
                                                                                            "id": "ih8s7a4",
                                                                                            "parent_id": "t1_ih8rjoh",
                                                                                            "score": 1,
                                                                                            "created_utc": 1658525597.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "ih8sgs9",
                                                                                                    "parent_id": "t1_ih8s7a4",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1658525703.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                                                            "author": null,
                                                                                                            "id": "ih8u16o",
                                                                                                            "parent_id": "t1_ih8sgs9",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1658526343.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "[deleted]",
                                                                                                                    "author": null,
                                                                                                                    "id": "ih8u77j",
                                                                                                                    "parent_id": "t1_ih8u16o",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1658526412.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                                                            "author": null,
                                                                                                                            "id": "ih8uhe8",
                                                                                                                            "parent_id": "t1_ih8u77j",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1658526526.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m sure that’s the case for a lot but lots of these men are truly young & single, or bitter and divorced 🤷🏼‍♀️",
                    "author": "Azucarbabby",
                    "id": "ih8dysm",
                    "parent_id": "t1_ih7y1q9",
                    "score": 3,
                    "created_utc": 1658519982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi! Out of pure curiosity, do you think your wife also fills in the gaps and would it upset you if she does?",
            "author": "iamrosieriley",
            "id": "ihbopu8",
            "parent_id": "t1_ih9anmk",
            "score": 0,
            "created_utc": 1658585530.0,
            "replies": [
                {
                    "body": "No, its not working out that way. My SRs are invigorating and are creating new opportunities for my marriage. My attitude is different and while my SRs are discreet I'm different in a good way. Sex with my wife is better. Our relationship is better. Our communication is better. Id say SRs are creating more opportunity and better outcomes for everyone including my wife. Without the SR this would not have happened.",
                    "author": null,
                    "id": "ihcqcni",
                    "parent_id": "t1_ihbopu8",
                    "score": 1,
                    "created_utc": 1658601859.0,
                    "replies": [
                        {
                            "body": "I don’t doubt that! I’m not questioning that the SR’s don’t improve your marriage. I have seen this happen in other relationships. My questions are:\nDoes your wife know? And if not, why wouldn’t you encourage her to seek out the “missing parts” in her own SRs? Or perhaps you do! This isn’t coming from a place of judgement. I am simply curious why a man would need outside sources to fill gaps but a woman would not. It seems that if both are getting unmet needs filled than the relationship as a whole would improve 2x’s over. For example, if your wife is younger, she may wish to connect with a man who can understand her generation/pop culture better. Similar to you wanting to feel alive and desired by a younger woman. If your wife has an SR of her own, than maybe the outcome would be even better than now!",
                            "author": "iamrosieriley",
                            "id": "ihcvu3o",
                            "parent_id": "t1_ihcqcni",
                            "score": 1,
                            "created_utc": 1658604273.0,
                            "replies": [
                                {
                                    "body": "My wife does not currently know, but Im always thinking of ways to integrate my SR, just one into my life so its not quite so secret. The “missing parts” aren't really missing they are just new and exciting. Its like having a muse. Sometimes you need someone young or different to expand your own horizons. I think older women need this too, its just different in how they go about it.\n\nCuriously my wife did have a SR of her own before I knew her well and she was quite invigorated by it, but it was not sustained once we got married. Today it would be awkward because I don't really swing that way, but the inverse may not be as true.",
                                    "author": null,
                                    "id": "ihdicw6",
                                    "parent_id": "t1_ihcvu3o",
                                    "score": 2,
                                    "created_utc": 1658614119.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
                                            "author": "iamrosieriley",
                                            "id": "ihdnbrk",
                                            "parent_id": "t1_ihdicw6",
                                            "score": 1,
                                            "created_utc": 1658616353.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol sure. Let me just tell my wife \"Hey babe, have an important meeting in London, I will be gone for a week. Byee!\"",
            "author": "Odd-Ferret1784",
            "id": "ih8womy",
            "parent_id": "t1_ih8vv28",
            "score": 0,
            "created_utc": 1658527435.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8xpdb",
                    "parent_id": "t1_ih8womy",
                    "score": 2,
                    "created_utc": 1658527866.0,
                    "replies": [
                        {
                            "body": "Yes ma'am will do 😂",
                            "author": "Odd-Ferret1784",
                            "id": "ih8yroq",
                            "parent_id": "t1_ih8xpdb",
                            "score": 1,
                            "created_utc": 1658528322.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s jealousy. Ignore them x",
            "author": null,
            "id": "ih7qcay",
            "parent_id": "t1_ih7cevt",
            "score": 0,
            "created_utc": 1658510751.0,
            "replies": []
        },
        {
            "body": "Sorry Love. Sometimes I’m not very proud of my fellow sisters 👯‍♀️ You do you boo! His wife, his life.",
            "author": "BeautyBaby247",
            "id": "ih8q2v4",
            "parent_id": "t1_ih7cevt",
            "score": 0,
            "created_utc": 1658524743.0,
            "replies": []
        },
        {
            "body": "Shit they do that?",
            "author": "JosephJohnPEEPS",
            "id": "ihagj7j",
            "parent_id": "t1_ih71sh7",
            "score": 0,
            "created_utc": 1658555121.0,
            "replies": []
        },
        {
            "body": "Thanks dude. Good point. Traditional values have caused a lot of heartache and pain. Cry freedom 😔",
            "author": null,
            "id": "ihw2ea9",
            "parent_id": "t1_ihlgbcr",
            "score": 1,
            "created_utc": 1658949110.0,
            "replies": []
        },
        {
            "body": "Sorry I wasn’t speaking to you haha. Just talking about the people who think that way. Not you :)",
            "author": "freeewillieee",
            "id": "ihccxb9",
            "parent_id": "t1_ihcbn3e",
            "score": 1,
            "created_utc": 1658596095.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8eglr",
            "parent_id": "t1_ih7y1q9",
            "score": 3,
            "created_utc": 1658520178.0,
            "replies": [
                {
                    "body": "Is that on the blockchain? Do you also deploy AI and ML?",
                    "author": null,
                    "id": "ih8n6yb",
                    "parent_id": "t1_ih8eglr",
                    "score": 0,
                    "created_utc": 1658523606.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8nyxr",
                            "parent_id": "t1_ih8n6yb",
                            "score": 1,
                            "created_utc": 1658523907.0,
                            "replies": [
                                {
                                    "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
                                    "author": null,
                                    "id": "ih8ojlj",
                                    "parent_id": "t1_ih8nyxr",
                                    "score": 1,
                                    "created_utc": 1658524133.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ih8or6n",
                                            "parent_id": "t1_ih8ojlj",
                                            "score": 1,
                                            "created_utc": 1658524218.0,
                                            "replies": [
                                                {
                                                    "body": "Have you not heard of Alt ids and burner phones?",
                                                    "author": null,
                                                    "id": "ih8pbf3",
                                                    "parent_id": "t1_ih8or6n",
                                                    "score": 2,
                                                    "created_utc": 1658524441.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ih8prbw",
                                                            "parent_id": "t1_ih8pbf3",
                                                            "score": 2,
                                                            "created_utc": 1658524617.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                                                    "author": null,
                                                                    "id": "ih8r34f",
                                                                    "parent_id": "t1_ih8prbw",
                                                                    "score": 0,
                                                                    "created_utc": 1658525140.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "ih8rjoh",
                                                                            "parent_id": "t1_ih8r34f",
                                                                            "score": 1,
                                                                            "created_utc": 1658525328.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                                                    "author": null,
                                                                                    "id": "ih8s7a4",
                                                                                    "parent_id": "t1_ih8rjoh",
                                                                                    "score": 1,
                                                                                    "created_utc": 1658525597.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "ih8sgs9",
                                                                                            "parent_id": "t1_ih8s7a4",
                                                                                            "score": 1,
                                                                                            "created_utc": 1658525703.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                                                    "author": null,
                                                                                                    "id": "ih8u16o",
                                                                                                    "parent_id": "t1_ih8sgs9",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1658526343.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[deleted]",
                                                                                                            "author": null,
                                                                                                            "id": "ih8u77j",
                                                                                                            "parent_id": "t1_ih8u16o",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1658526412.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                                                    "author": null,
                                                                                                                    "id": "ih8uhe8",
                                                                                                                    "parent_id": "t1_ih8u77j",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1658526526.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sure that’s the case for a lot but lots of these men are truly young & single, or bitter and divorced 🤷🏼‍♀️",
            "author": "Azucarbabby",
            "id": "ih8dysm",
            "parent_id": "t1_ih7y1q9",
            "score": 3,
            "created_utc": 1658519982.0,
            "replies": []
        },
        {
            "body": "No, its not working out that way. My SRs are invigorating and are creating new opportunities for my marriage. My attitude is different and while my SRs are discreet I'm different in a good way. Sex with my wife is better. Our relationship is better. Our communication is better. Id say SRs are creating more opportunity and better outcomes for everyone including my wife. Without the SR this would not have happened.",
            "author": null,
            "id": "ihcqcni",
            "parent_id": "t1_ihbopu8",
            "score": 1,
            "created_utc": 1658601859.0,
            "replies": [
                {
                    "body": "I don’t doubt that! I’m not questioning that the SR’s don’t improve your marriage. I have seen this happen in other relationships. My questions are:\nDoes your wife know? And if not, why wouldn’t you encourage her to seek out the “missing parts” in her own SRs? Or perhaps you do! This isn’t coming from a place of judgement. I am simply curious why a man would need outside sources to fill gaps but a woman would not. It seems that if both are getting unmet needs filled than the relationship as a whole would improve 2x’s over. For example, if your wife is younger, she may wish to connect with a man who can understand her generation/pop culture better. Similar to you wanting to feel alive and desired by a younger woman. If your wife has an SR of her own, than maybe the outcome would be even better than now!",
                    "author": "iamrosieriley",
                    "id": "ihcvu3o",
                    "parent_id": "t1_ihcqcni",
                    "score": 1,
                    "created_utc": 1658604273.0,
                    "replies": [
                        {
                            "body": "My wife does not currently know, but Im always thinking of ways to integrate my SR, just one into my life so its not quite so secret. The “missing parts” aren't really missing they are just new and exciting. Its like having a muse. Sometimes you need someone young or different to expand your own horizons. I think older women need this too, its just different in how they go about it.\n\nCuriously my wife did have a SR of her own before I knew her well and she was quite invigorated by it, but it was not sustained once we got married. Today it would be awkward because I don't really swing that way, but the inverse may not be as true.",
                            "author": null,
                            "id": "ihdicw6",
                            "parent_id": "t1_ihcvu3o",
                            "score": 2,
                            "created_utc": 1658614119.0,
                            "replies": [
                                {
                                    "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
                                    "author": "iamrosieriley",
                                    "id": "ihdnbrk",
                                    "parent_id": "t1_ihdicw6",
                                    "score": 1,
                                    "created_utc": 1658616353.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8xpdb",
            "parent_id": "t1_ih8womy",
            "score": 2,
            "created_utc": 1658527866.0,
            "replies": [
                {
                    "body": "Yes ma'am will do 😂",
                    "author": "Odd-Ferret1784",
                    "id": "ih8yroq",
                    "parent_id": "t1_ih8xpdb",
                    "score": 1,
                    "created_utc": 1658528322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is that on the blockchain? Do you also deploy AI and ML?",
            "author": null,
            "id": "ih8n6yb",
            "parent_id": "t1_ih8eglr",
            "score": 0,
            "created_utc": 1658523606.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8nyxr",
                    "parent_id": "t1_ih8n6yb",
                    "score": 1,
                    "created_utc": 1658523907.0,
                    "replies": [
                        {
                            "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
                            "author": null,
                            "id": "ih8ojlj",
                            "parent_id": "t1_ih8nyxr",
                            "score": 1,
                            "created_utc": 1658524133.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8or6n",
                                    "parent_id": "t1_ih8ojlj",
                                    "score": 1,
                                    "created_utc": 1658524218.0,
                                    "replies": [
                                        {
                                            "body": "Have you not heard of Alt ids and burner phones?",
                                            "author": null,
                                            "id": "ih8pbf3",
                                            "parent_id": "t1_ih8or6n",
                                            "score": 2,
                                            "created_utc": 1658524441.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ih8prbw",
                                                    "parent_id": "t1_ih8pbf3",
                                                    "score": 2,
                                                    "created_utc": 1658524617.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                                            "author": null,
                                                            "id": "ih8r34f",
                                                            "parent_id": "t1_ih8prbw",
                                                            "score": 0,
                                                            "created_utc": 1658525140.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ih8rjoh",
                                                                    "parent_id": "t1_ih8r34f",
                                                                    "score": 1,
                                                                    "created_utc": 1658525328.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                                            "author": null,
                                                                            "id": "ih8s7a4",
                                                                            "parent_id": "t1_ih8rjoh",
                                                                            "score": 1,
                                                                            "created_utc": 1658525597.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "ih8sgs9",
                                                                                    "parent_id": "t1_ih8s7a4",
                                                                                    "score": 1,
                                                                                    "created_utc": 1658525703.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                                            "author": null,
                                                                                            "id": "ih8u16o",
                                                                                            "parent_id": "t1_ih8sgs9",
                                                                                            "score": 0,
                                                                                            "created_utc": 1658526343.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "ih8u77j",
                                                                                                    "parent_id": "t1_ih8u16o",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1658526412.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                                            "author": null,
                                                                                                            "id": "ih8uhe8",
                                                                                                            "parent_id": "t1_ih8u77j",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1658526526.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t doubt that! I’m not questioning that the SR’s don’t improve your marriage. I have seen this happen in other relationships. My questions are:\nDoes your wife know? And if not, why wouldn’t you encourage her to seek out the “missing parts” in her own SRs? Or perhaps you do! This isn’t coming from a place of judgement. I am simply curious why a man would need outside sources to fill gaps but a woman would not. It seems that if both are getting unmet needs filled than the relationship as a whole would improve 2x’s over. For example, if your wife is younger, she may wish to connect with a man who can understand her generation/pop culture better. Similar to you wanting to feel alive and desired by a younger woman. If your wife has an SR of her own, than maybe the outcome would be even better than now!",
            "author": "iamrosieriley",
            "id": "ihcvu3o",
            "parent_id": "t1_ihcqcni",
            "score": 1,
            "created_utc": 1658604273.0,
            "replies": [
                {
                    "body": "My wife does not currently know, but Im always thinking of ways to integrate my SR, just one into my life so its not quite so secret. The “missing parts” aren't really missing they are just new and exciting. Its like having a muse. Sometimes you need someone young or different to expand your own horizons. I think older women need this too, its just different in how they go about it.\n\nCuriously my wife did have a SR of her own before I knew her well and she was quite invigorated by it, but it was not sustained once we got married. Today it would be awkward because I don't really swing that way, but the inverse may not be as true.",
                    "author": null,
                    "id": "ihdicw6",
                    "parent_id": "t1_ihcvu3o",
                    "score": 2,
                    "created_utc": 1658614119.0,
                    "replies": [
                        {
                            "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
                            "author": "iamrosieriley",
                            "id": "ihdnbrk",
                            "parent_id": "t1_ihdicw6",
                            "score": 1,
                            "created_utc": 1658616353.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes ma'am will do 😂",
            "author": "Odd-Ferret1784",
            "id": "ih8yroq",
            "parent_id": "t1_ih8xpdb",
            "score": 1,
            "created_utc": 1658528322.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8nyxr",
            "parent_id": "t1_ih8n6yb",
            "score": 1,
            "created_utc": 1658523907.0,
            "replies": [
                {
                    "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
                    "author": null,
                    "id": "ih8ojlj",
                    "parent_id": "t1_ih8nyxr",
                    "score": 1,
                    "created_utc": 1658524133.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8or6n",
                            "parent_id": "t1_ih8ojlj",
                            "score": 1,
                            "created_utc": 1658524218.0,
                            "replies": [
                                {
                                    "body": "Have you not heard of Alt ids and burner phones?",
                                    "author": null,
                                    "id": "ih8pbf3",
                                    "parent_id": "t1_ih8or6n",
                                    "score": 2,
                                    "created_utc": 1658524441.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ih8prbw",
                                            "parent_id": "t1_ih8pbf3",
                                            "score": 2,
                                            "created_utc": 1658524617.0,
                                            "replies": [
                                                {
                                                    "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                                    "author": null,
                                                    "id": "ih8r34f",
                                                    "parent_id": "t1_ih8prbw",
                                                    "score": 0,
                                                    "created_utc": 1658525140.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ih8rjoh",
                                                            "parent_id": "t1_ih8r34f",
                                                            "score": 1,
                                                            "created_utc": 1658525328.0,
                                                            "replies": [
                                                                {
                                                                    "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                                    "author": null,
                                                                    "id": "ih8s7a4",
                                                                    "parent_id": "t1_ih8rjoh",
                                                                    "score": 1,
                                                                    "created_utc": 1658525597.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "ih8sgs9",
                                                                            "parent_id": "t1_ih8s7a4",
                                                                            "score": 1,
                                                                            "created_utc": 1658525703.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                                    "author": null,
                                                                                    "id": "ih8u16o",
                                                                                    "parent_id": "t1_ih8sgs9",
                                                                                    "score": 0,
                                                                                    "created_utc": 1658526343.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "ih8u77j",
                                                                                            "parent_id": "t1_ih8u16o",
                                                                                            "score": 1,
                                                                                            "created_utc": 1658526412.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                                    "author": null,
                                                                                                    "id": "ih8uhe8",
                                                                                                    "parent_id": "t1_ih8u77j",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1658526526.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My wife does not currently know, but Im always thinking of ways to integrate my SR, just one into my life so its not quite so secret. The “missing parts” aren't really missing they are just new and exciting. Its like having a muse. Sometimes you need someone young or different to expand your own horizons. I think older women need this too, its just different in how they go about it.\n\nCuriously my wife did have a SR of her own before I knew her well and she was quite invigorated by it, but it was not sustained once we got married. Today it would be awkward because I don't really swing that way, but the inverse may not be as true.",
            "author": null,
            "id": "ihdicw6",
            "parent_id": "t1_ihcvu3o",
            "score": 2,
            "created_utc": 1658614119.0,
            "replies": [
                {
                    "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
                    "author": "iamrosieriley",
                    "id": "ihdnbrk",
                    "parent_id": "t1_ihdicw6",
                    "score": 1,
                    "created_utc": 1658616353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they have those credentials why would they allow you to run a background check on them? If someone did that, my attorney will make sure to have their ass handed out to me on a platter.",
            "author": null,
            "id": "ih8ojlj",
            "parent_id": "t1_ih8nyxr",
            "score": 1,
            "created_utc": 1658524133.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8or6n",
                    "parent_id": "t1_ih8ojlj",
                    "score": 1,
                    "created_utc": 1658524218.0,
                    "replies": [
                        {
                            "body": "Have you not heard of Alt ids and burner phones?",
                            "author": null,
                            "id": "ih8pbf3",
                            "parent_id": "t1_ih8or6n",
                            "score": 2,
                            "created_utc": 1658524441.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8prbw",
                                    "parent_id": "t1_ih8pbf3",
                                    "score": 2,
                                    "created_utc": 1658524617.0,
                                    "replies": [
                                        {
                                            "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                            "author": null,
                                            "id": "ih8r34f",
                                            "parent_id": "t1_ih8prbw",
                                            "score": 0,
                                            "created_utc": 1658525140.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ih8rjoh",
                                                    "parent_id": "t1_ih8r34f",
                                                    "score": 1,
                                                    "created_utc": 1658525328.0,
                                                    "replies": [
                                                        {
                                                            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                            "author": null,
                                                            "id": "ih8s7a4",
                                                            "parent_id": "t1_ih8rjoh",
                                                            "score": 1,
                                                            "created_utc": 1658525597.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ih8sgs9",
                                                                    "parent_id": "t1_ih8s7a4",
                                                                    "score": 1,
                                                                    "created_utc": 1658525703.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                            "author": null,
                                                                            "id": "ih8u16o",
                                                                            "parent_id": "t1_ih8sgs9",
                                                                            "score": 0,
                                                                            "created_utc": 1658526343.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "ih8u77j",
                                                                                    "parent_id": "t1_ih8u16o",
                                                                                    "score": 1,
                                                                                    "created_utc": 1658526412.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                            "author": null,
                                                                                            "id": "ih8uhe8",
                                                                                            "parent_id": "t1_ih8u77j",
                                                                                            "score": 1,
                                                                                            "created_utc": 1658526526.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for sharing your experience! As an artist, I absolutely understand the reality of a muse and it’s a fun reason I enjoy being an SB— SD’s can be muses too!",
            "author": "iamrosieriley",
            "id": "ihdnbrk",
            "parent_id": "t1_ihdicw6",
            "score": 1,
            "created_utc": 1658616353.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8or6n",
            "parent_id": "t1_ih8ojlj",
            "score": 1,
            "created_utc": 1658524218.0,
            "replies": [
                {
                    "body": "Have you not heard of Alt ids and burner phones?",
                    "author": null,
                    "id": "ih8pbf3",
                    "parent_id": "t1_ih8or6n",
                    "score": 2,
                    "created_utc": 1658524441.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8prbw",
                            "parent_id": "t1_ih8pbf3",
                            "score": 2,
                            "created_utc": 1658524617.0,
                            "replies": [
                                {
                                    "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                                    "author": null,
                                    "id": "ih8r34f",
                                    "parent_id": "t1_ih8prbw",
                                    "score": 0,
                                    "created_utc": 1658525140.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ih8rjoh",
                                            "parent_id": "t1_ih8r34f",
                                            "score": 1,
                                            "created_utc": 1658525328.0,
                                            "replies": [
                                                {
                                                    "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                                    "author": null,
                                                    "id": "ih8s7a4",
                                                    "parent_id": "t1_ih8rjoh",
                                                    "score": 1,
                                                    "created_utc": 1658525597.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ih8sgs9",
                                                            "parent_id": "t1_ih8s7a4",
                                                            "score": 1,
                                                            "created_utc": 1658525703.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                                    "author": null,
                                                                    "id": "ih8u16o",
                                                                    "parent_id": "t1_ih8sgs9",
                                                                    "score": 0,
                                                                    "created_utc": 1658526343.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "ih8u77j",
                                                                            "parent_id": "t1_ih8u16o",
                                                                            "score": 1,
                                                                            "created_utc": 1658526412.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                                                                    "author": null,
                                                                                    "id": "ih8uhe8",
                                                                                    "parent_id": "t1_ih8u77j",
                                                                                    "score": 1,
                                                                                    "created_utc": 1658526526.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Have you not heard of Alt ids and burner phones?",
            "author": null,
            "id": "ih8pbf3",
            "parent_id": "t1_ih8or6n",
            "score": 2,
            "created_utc": 1658524441.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8prbw",
                    "parent_id": "t1_ih8pbf3",
                    "score": 2,
                    "created_utc": 1658524617.0,
                    "replies": [
                        {
                            "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                            "author": null,
                            "id": "ih8r34f",
                            "parent_id": "t1_ih8prbw",
                            "score": 0,
                            "created_utc": 1658525140.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8rjoh",
                                    "parent_id": "t1_ih8r34f",
                                    "score": 1,
                                    "created_utc": 1658525328.0,
                                    "replies": [
                                        {
                                            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                            "author": null,
                                            "id": "ih8s7a4",
                                            "parent_id": "t1_ih8rjoh",
                                            "score": 1,
                                            "created_utc": 1658525597.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ih8sgs9",
                                                    "parent_id": "t1_ih8s7a4",
                                                    "score": 1,
                                                    "created_utc": 1658525703.0,
                                                    "replies": [
                                                        {
                                                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                            "author": null,
                                                            "id": "ih8u16o",
                                                            "parent_id": "t1_ih8sgs9",
                                                            "score": 0,
                                                            "created_utc": 1658526343.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ih8u77j",
                                                                    "parent_id": "t1_ih8u16o",
                                                                    "score": 1,
                                                                    "created_utc": 1658526412.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                                                            "author": null,
                                                                            "id": "ih8uhe8",
                                                                            "parent_id": "t1_ih8u77j",
                                                                            "score": 1,
                                                                            "created_utc": 1658526526.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8prbw",
            "parent_id": "t1_ih8pbf3",
            "score": 2,
            "created_utc": 1658524617.0,
            "replies": [
                {
                    "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
                    "author": null,
                    "id": "ih8r34f",
                    "parent_id": "t1_ih8prbw",
                    "score": 0,
                    "created_utc": 1658525140.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8rjoh",
                            "parent_id": "t1_ih8r34f",
                            "score": 1,
                            "created_utc": 1658525328.0,
                            "replies": [
                                {
                                    "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                                    "author": null,
                                    "id": "ih8s7a4",
                                    "parent_id": "t1_ih8rjoh",
                                    "score": 1,
                                    "created_utc": 1658525597.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ih8sgs9",
                                            "parent_id": "t1_ih8s7a4",
                                            "score": 1,
                                            "created_utc": 1658525703.0,
                                            "replies": [
                                                {
                                                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                                    "author": null,
                                                    "id": "ih8u16o",
                                                    "parent_id": "t1_ih8sgs9",
                                                    "score": 0,
                                                    "created_utc": 1658526343.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ih8u77j",
                                                            "parent_id": "t1_ih8u16o",
                                                            "score": 1,
                                                            "created_utc": 1658526412.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                                                    "author": null,
                                                                    "id": "ih8uhe8",
                                                                    "parent_id": "t1_ih8u77j",
                                                                    "score": 1,
                                                                    "created_utc": 1658526526.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think what you are trying and trying hard is to display some knowledge power but I am sure most if not all SDs do not appreciate this deep digging and nosy behavior from SBs. No wonder opsec is advised and people are best advised to stay fake in the bowl.\n\nI am super darn sure with the resources that most SDs have they could let lose a PI on SBs but why! Why intrude and do root canal on someone. Respect their space!!!",
            "author": null,
            "id": "ih8r34f",
            "parent_id": "t1_ih8prbw",
            "score": 0,
            "created_utc": 1658525140.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8rjoh",
                    "parent_id": "t1_ih8r34f",
                    "score": 1,
                    "created_utc": 1658525328.0,
                    "replies": [
                        {
                            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                            "author": null,
                            "id": "ih8s7a4",
                            "parent_id": "t1_ih8rjoh",
                            "score": 1,
                            "created_utc": 1658525597.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8sgs9",
                                    "parent_id": "t1_ih8s7a4",
                                    "score": 1,
                                    "created_utc": 1658525703.0,
                                    "replies": [
                                        {
                                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                            "author": null,
                                            "id": "ih8u16o",
                                            "parent_id": "t1_ih8sgs9",
                                            "score": 0,
                                            "created_utc": 1658526343.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ih8u77j",
                                                    "parent_id": "t1_ih8u16o",
                                                    "score": 1,
                                                    "created_utc": 1658526412.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                                            "author": null,
                                                            "id": "ih8uhe8",
                                                            "parent_id": "t1_ih8u77j",
                                                            "score": 1,
                                                            "created_utc": 1658526526.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8rjoh",
            "parent_id": "t1_ih8r34f",
            "score": 1,
            "created_utc": 1658525328.0,
            "replies": [
                {
                    "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
                    "author": null,
                    "id": "ih8s7a4",
                    "parent_id": "t1_ih8rjoh",
                    "score": 1,
                    "created_utc": 1658525597.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8sgs9",
                            "parent_id": "t1_ih8s7a4",
                            "score": 1,
                            "created_utc": 1658525703.0,
                            "replies": [
                                {
                                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                                    "author": null,
                                    "id": "ih8u16o",
                                    "parent_id": "t1_ih8sgs9",
                                    "score": 0,
                                    "created_utc": 1658526343.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ih8u77j",
                                            "parent_id": "t1_ih8u16o",
                                            "score": 1,
                                            "created_utc": 1658526412.0,
                                            "replies": [
                                                {
                                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                                    "author": null,
                                                    "id": "ih8uhe8",
                                                    "parent_id": "t1_ih8u77j",
                                                    "score": 1,
                                                    "created_utc": 1658526526.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So you are dating Elon Musk as your primary and Bezos as your side SD?",
            "author": null,
            "id": "ih8s7a4",
            "parent_id": "t1_ih8rjoh",
            "score": 1,
            "created_utc": 1658525597.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8sgs9",
                    "parent_id": "t1_ih8s7a4",
                    "score": 1,
                    "created_utc": 1658525703.0,
                    "replies": [
                        {
                            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                            "author": null,
                            "id": "ih8u16o",
                            "parent_id": "t1_ih8sgs9",
                            "score": 0,
                            "created_utc": 1658526343.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ih8u77j",
                                    "parent_id": "t1_ih8u16o",
                                    "score": 1,
                                    "created_utc": 1658526412.0,
                                    "replies": [
                                        {
                                            "body": "Lol ok! I wish him good luck and good privacy.",
                                            "author": null,
                                            "id": "ih8uhe8",
                                            "parent_id": "t1_ih8u77j",
                                            "score": 1,
                                            "created_utc": 1658526526.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8sgs9",
            "parent_id": "t1_ih8s7a4",
            "score": 1,
            "created_utc": 1658525703.0,
            "replies": [
                {
                    "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
                    "author": null,
                    "id": "ih8u16o",
                    "parent_id": "t1_ih8sgs9",
                    "score": 0,
                    "created_utc": 1658526343.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ih8u77j",
                            "parent_id": "t1_ih8u16o",
                            "score": 1,
                            "created_utc": 1658526412.0,
                            "replies": [
                                {
                                    "body": "Lol ok! I wish him good luck and good privacy.",
                                    "author": null,
                                    "id": "ih8uhe8",
                                    "parent_id": "t1_ih8u77j",
                                    "score": 1,
                                    "created_utc": 1658526526.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Name dropping! \n\nBluntly this is one of the riskiest types of SBs one would date. The type who on the drop of a hat would pit your name out there and brag and pull your reputation down. Just saying.",
            "author": null,
            "id": "ih8u16o",
            "parent_id": "t1_ih8sgs9",
            "score": 0,
            "created_utc": 1658526343.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ih8u77j",
                    "parent_id": "t1_ih8u16o",
                    "score": 1,
                    "created_utc": 1658526412.0,
                    "replies": [
                        {
                            "body": "Lol ok! I wish him good luck and good privacy.",
                            "author": null,
                            "id": "ih8uhe8",
                            "parent_id": "t1_ih8u77j",
                            "score": 1,
                            "created_utc": 1658526526.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ih8u77j",
            "parent_id": "t1_ih8u16o",
            "score": 1,
            "created_utc": 1658526412.0,
            "replies": [
                {
                    "body": "Lol ok! I wish him good luck and good privacy.",
                    "author": null,
                    "id": "ih8uhe8",
                    "parent_id": "t1_ih8u77j",
                    "score": 1,
                    "created_utc": 1658526526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol ok! I wish him good luck and good privacy.",
            "author": null,
            "id": "ih8uhe8",
            "parent_id": "t1_ih8u77j",
            "score": 1,
            "created_utc": 1658526526.0,
            "replies": []
        }
    ]
}