{
    "title": "It's A No From Me, Dawg",
    "post_id": "iojc0d",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/iojc0d/its_a_no_from_me_dawg/",
    "author": "missmacchiato18",
    "body": "It's been a while... I know I shouldn't have kept y'all waiting, but I'm here now.\n\nThis isn't one of my normal *flowery-singing-my-SD's-praises* posts. (We're still together, though. Fret not, world! The sun still shines in Duloc.)\n\nThis is a post about the importance of safety.\n\nBabies, babies, babies. For the first time in quite some time, I have become afraid for the safety of an entire group of people I do not know, and I'm a teacher, so this is saying a lot.  I've seen an influx of posts about meeting SD's at their houses for meet and greets, strange tales of women inherently trusting men with their bodies because the promise of cash is too much to resist, and overall tomfoolery when it comes to being prepared for the worst yet expecting the best.\n\nI don't know if anyone feels the same way, but I'm going to say it because I want to: If you do not hold yourself, your safety, your sanity, your body in higher regard than a couple of bucks or the promise of a grand life, *you do not belong in the bowl*. I can preach all day about the types of precautions you can take, but I cannot instill a shred of **common-fucking-sense** into your heads about the absolute danger you can put yourself in if you are not wise.\n\nOne rule I stick to is this: If I wouldn't be okay with it when I'm vanilla dating, I'm definitely not going to be okay with it while sugaring. If a man were to approach you in the vanilla world and say, *\"You can never see my face, but I expect you to obey everything I ask you to do\"*, you would normally snatch your purse, politely tell the man to find a toilet to stick his head in and flush it multiple times. Right?! So, what about this section of dating clouds your judgment?\n\nPerhaps there was no discernment or sound judgment there, to begin with.\n\nAnd that, my dears, is the root of the problem. Hop out while you can, and before you get yourself hurt.\n\n\\[End of scene. Lights go down.\\]\n\n&#x200B;\n\nEDIT: for clarity, this is not to victim-blame or shame. This is for those who willingly ignore the advice tabs or go into the bowl without first knowing about the necessity of safety. ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/iojc0d/its_a_no_from_me_dawg/",
    "score": 118,
    "upvote_ratio": 0.86,
    "created_utc": 1599524097.0,
    "num_comments": 39,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I get you. I've said it before, and I am sure I will say it again:\n\n*But then again, what's the worst that could happen?*\n\n*Oh, that's right, RAPED AND MURDERED, or MURDERED AND RAPED!* \n\n*I've heard they are both bad.*\n\n*I know I know, you could get lucky and just be sex trafficked for the next 10 years, then be RAPED AND MURDERED.*",
            "author": null,
            "id": "g4f6l70",
            "parent_id": "t3_iojc0d",
            "score": 19,
            "created_utc": 1599550097.0,
            "replies": []
        },
        {
            "body": "This is a timely post. \n\nSafety is everything. There are some mistakes that lead to situations you can never take back. People who are savvy get hurt while sugaring. \n\nI went hiking with an SD. He kept going on about how harmless he was (he was), and how he didn’t understand how women in the bowl didn’t just GET that about him. I told him that his ego being bruised was not enough of a reason for anyone to risk their safety over....He kept going on about it. Until I said, “you know SBs get raped, sexually assaulted, drugged, beaten and emotionally and physically used right?” So, I say to all the newbies who aren’t hearing the supportive warnings. \n\nSBs get raped. They get sexually assaulted. Drugged. Verbally, physically assaulted. Used physically and emotionally. \n\nDoes all of this happen to everyone. No. Does it happen because sugaring creates a heaven for predators and entitled men. Yes. \n\n...except the being used physically and emotionally, that’s just a given because that’s what it’s all about. \n\nAny SB in the bowl better have her wits about her, and understand the inherent and opportunistic risk that sugaring creates for women. Even if you’re vigilant you can still get hurt. It’s not all dinners, handbags and sweet cuddles.",
            "author": "InnerRadio7",
            "id": "g4fefk1",
            "parent_id": "t3_iojc0d",
            "score": 18,
            "created_utc": 1599558997.0,
            "replies": [
                {
                    "body": "love i'm going to say this since no one else did. \nNEVER go in the woods or any kind of walk away from a high traffic area even if it's a paved path with a man you barley know. \n\nI saw a story on the news about a women from tinder going on a hike with a man turns out he killed 3/4 other woman before he on a hike. \n\nJust something I've learned from toxic relationships - a man that brags or tries to convince you he doesn't do wrong to women probably has and will again.",
                    "author": "CattyChaos",
                    "id": "g4g1s0i",
                    "parent_id": "t1_g4fefk1",
                    "score": 10,
                    "created_utc": 1599576548.0,
                    "replies": [
                        {
                            "body": "He was my SD, so I knew him. I also took a lot of safety precautions despite that. This is important to note because I STILL took safety precautions when he was my SD. \n\n-I installed a tracking app on my phone and had a friend check in. \n-I chose the hike which had cell service and was within 10 minutes of emergency services. \n-I also chose a family friendly hike that already had people from a local hiking group I’m a part of doing the trail the same morning I was, so I knew there would be people there. \n-I insisted on having his full legal name long before that. \n-I gave his licence plate, car make and model to a friend. \n-I had regular text check ins with a friend and a plan for what happens if I miss check in. \n\nTHIS IS AFTER I KNEW AND TRUSTED HIM\n\nI moved on from him quite soon after this. I could not stand that his ego. He was insufferable.",
                            "author": "InnerRadio7",
                            "id": "g4gk28v",
                            "parent_id": "t1_g4g1s0i",
                            "score": 9,
                            "created_utc": 1599585957.0,
                            "replies": [
                                {
                                    "body": "that's good you were so cautious, just be wary of any red flags cause some men can be crazy.",
                                    "author": "CattyChaos",
                                    "id": "g4gxeeb",
                                    "parent_id": "t1_g4gk28v",
                                    "score": 3,
                                    "created_utc": 1599592645.0,
                                    "replies": [
                                        {
                                            "body": "Oh yes they can. I’m a little older than your typical SB so having some extra life experience has taught me the value of safety and trusting my intuition. I’ve narrowly avoided some crazy. \n\nActually, early on there was a POT that I got along with really well so we talked on Snapchat. I ended up declining to meet him because he intimated that he was into rough sex, and that’s not for me. My vagina is a delicate flower lol. He lost his mind. He kept sending me screenshots of my profile, threats to my life, the things he said to me were alarming and abusive. I ghosted him, but he found other ways to get to me. I reported him to SA, and they booted him off. He kept making fake accounts to harass me. [We spoke on the phone 2 times and never met FYI]. \nAnyways, I eventually told him I was talking to the police which I wasn’t, but it was my next step. I’m lucky that he left me alone after that.\n\nIf I ever receive a threat to my life again, the police will be my first step. It was a learning experience.",
                                            "author": "InnerRadio7",
                                            "id": "g4hnfnp",
                                            "parent_id": "t1_g4gxeeb",
                                            "score": 2,
                                            "created_utc": 1599605231.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Can't stand when men suggest \"taking a walk\" as if that's a proper M&G. Its so lame. You usually see this in vanilla dating. Such a turnoff I don't even respond. \n\nFirst dates need to be in public venues. Not cars. Not hikes in the wilderness. Not at his house or at a hotel.",
                            "author": "clair-cummings",
                            "id": "g4gkmjg",
                            "parent_id": "t1_g4g1s0i",
                            "score": 5,
                            "created_utc": 1599586238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4fdtwh",
            "parent_id": "t3_iojc0d",
            "score": 11,
            "created_utc": 1599558317.0,
            "replies": [
                {
                    "body": "Completely. Escorts are more safety conscious than SB and sadly, there's a lot of predators who have been blacklisted by escorts that try places like SA in hopes to find young/naive women that don't know better and are easily misled by promises of money. SB would be smart to understand this.",
                    "author": "clair-cummings",
                    "id": "g4gl7hj",
                    "parent_id": "t1_g4fdtwh",
                    "score": 8,
                    "created_utc": 1599586530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "u/caramelk3269 please read this",
            "author": "sienfiekdsa",
            "id": "g4eqx65",
            "parent_id": "t3_iojc0d",
            "score": 9,
            "created_utc": 1599536670.0,
            "replies": []
        },
        {
            "body": "PREACH \n\nLadies, especially the newbies, your life is more valuable than a quick buck. Don't let this mindset of \"securing a bag\" get you killed or kidnapped. Never meet in private, always meet in a public area where you can run to someone close by if needed. Always carry pepper spray - they sell ones that also have a window breaker & seat belt cutter on amazon.\nIf you have a trusted friend or relative have them sit near by in disguise if you want to be extra safe my friend & I did this in the beginning of our sugar dating it worked well eventually once I was established with my SD I even let my friend meet him. \n\nIf you don't have sugar friends this would be a good place to search for some :)",
            "author": "CattyChaos",
            "id": "g4g1c21",
            "parent_id": "t3_iojc0d",
            "score": 8,
            "created_utc": 1599576307.0,
            "replies": []
        },
        {
            "body": "LONG ISLAND SERIAL KILLER. Read about it ladies.",
            "author": "painfullytoohuman",
            "id": "g4gnj14",
            "parent_id": "t3_iojc0d",
            "score": 7,
            "created_utc": 1599587700.0,
            "replies": [
                {
                    "body": "OMG yes! I saw a documentary on him awhile back. They think he is a cop because the girls would not take their their purses or ID's when with him and it was because he was a previous client that they felt safe with and had paid them before, so they thought he was okay.",
                    "author": null,
                    "id": "g4hlub7",
                    "parent_id": "t1_g4gnj14",
                    "score": 3,
                    "created_utc": 1599604411.0,
                    "replies": [
                        {
                            "body": "Scary part is yes exactly that. He's very methodical and patient. Willing to invest time/money to build trust and rapport. Scariest\\*\\* part is that he hasn't been caught yet. He's estimated to be between 30-45 (prime age for SBs to want in their SDs.",
                            "author": "painfullytoohuman",
                            "id": "g4ij54z",
                            "parent_id": "t1_g4hlub7",
                            "score": 5,
                            "created_utc": 1599623248.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4e87l1",
            "parent_id": "t3_iojc0d",
            "score": 16,
            "created_utc": 1599525083.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4ecikz",
                    "parent_id": "t1_g4e87l1",
                    "score": 13,
                    "created_utc": 1599527695.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should take all the normal precautions the same as vanilla dating, if not a little more. Common sense meeting up the first few times will save you.",
            "author": "dade_murphy1",
            "id": "g4f3ad3",
            "parent_id": "t3_iojc0d",
            "score": 5,
            "created_utc": 1599546814.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4ev5be",
            "parent_id": "t3_iojc0d",
            "score": 17,
            "created_utc": 1599539778.0,
            "replies": [
                {
                    "body": "So you only pay her when she puts out.\nTell me this is any different than prostitution 🙄",
                    "author": "clair-cummings",
                    "id": "g4gk1b4",
                    "parent_id": "t1_g4ev5be",
                    "score": 5,
                    "created_utc": 1599585943.0,
                    "replies": [
                        {
                            "body": "Disgusting how they often feel the need to brag that they “defer” benefits until sex is provided. How shameless, entitled  and self-serving his comment was. . . Not to mention totally unrelated to the OP’s message to SB’s and THEIR SAFETY.\nWell, on second thought he is the type of “SD” girls should avoid like the plague.\n\nExhibit A ^^ girls. . .Be warned - Men who “defer benefits until sex happens, or directly after, said sex act service is performed“ are simply looking for a cheaper alternative to escorts, or they are blacklisted by escorts.",
                            "author": "honey-_bunny",
                            "id": "g4h7fz5",
                            "parent_id": "t1_g4gk1b4",
                            "score": 9,
                            "created_utc": 1599597616.0,
                            "replies": [
                                {
                                    "body": "Right. But at the same time they will argue how its NOT prostitution 🙄 . Like....it IS prostitution, only the poor girl is being compensated $$$ even less and exploited even more for her emotional energy/time/sex/etc. Also, he'll probably ask that she be exclusive...\nAnd let's not forget...he'll also insist on not using a condom 🙄",
                                    "author": "clair-cummings",
                                    "id": "g4hblp3",
                                    "parent_id": "t1_g4h7fz5",
                                    "score": 9,
                                    "created_utc": 1599599741.0,
                                    "replies": [
                                        {
                                            "body": "Delusion, entitlement and denial is the fuel of their engines along with a big dose of emotional energy zapping.",
                                            "author": null,
                                            "id": "g4hl3xv",
                                            "parent_id": "t1_g4hblp3",
                                            "score": 7,
                                            "created_utc": 1599604033.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "💯% agree with u. Like, how is it NOT PROSTITUTION if u only pay her per sex act or “sex services performed” but then say the girl is behaving like ‘an escort’ or shame her, if she wants a generous guy to gift her on platonic dates or activities outside of sex???\n\nI mean, the hypocrisy and manipulation is obvious to us, so hopefully it is to the new girls who come here looking for advice or anyone who can see through the BS they spew .",
                                            "author": "honey-_bunny",
                                            "id": "g4i3ypn",
                                            "parent_id": "t1_g4hblp3",
                                            "score": 6,
                                            "created_utc": 1599614357.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4gkvso",
                            "parent_id": "t1_g4gk1b4",
                            "score": -1,
                            "created_utc": 1599586367.0,
                            "replies": [
                                {
                                    "body": "\"I defer benefits until she's ready\" = \"I only pay her when she puts out\".\nSir, this isn't really any different than hiring an escort. Altho I suspect you give her less than she would earn were she actually an escort and charging by the hour.",
                                    "author": "clair-cummings",
                                    "id": "g4glirq",
                                    "parent_id": "t1_g4gkvso",
                                    "score": 7,
                                    "created_utc": 1599586690.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g4glsbq",
                                            "parent_id": "t1_g4glirq",
                                            "score": -1,
                                            "created_utc": 1599586822.0,
                                            "replies": [
                                                {
                                                    "body": "Lol. You're certainly not paying her for her time. If you were, you would be giving her money regardless of whether she was sleeping w you or not. Facts....not my opinion.",
                                                    "author": "clair-cummings",
                                                    "id": "g4gmjhq",
                                                    "parent_id": "t1_g4glsbq",
                                                    "score": 4,
                                                    "created_utc": 1599587204.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for sharing honest love here. ❤️",
            "author": "MzAmerika01",
            "id": "g4f3zmu",
            "parent_id": "t3_iojc0d",
            "score": 4,
            "created_utc": 1599547470.0,
            "replies": []
        },
        {
            "body": "I agree.  Many of the recent posts have alarm bells ringing.  Safety is important on both sides--that's why we keep saying \"until trust is established\" on so many things.",
            "author": null,
            "id": "g4e9vte",
            "parent_id": "t3_iojc0d",
            "score": 7,
            "created_utc": 1599526091.0,
            "replies": [
                {
                    "body": "Those four words mean so much.",
                    "author": "missmacchiato18",
                    "id": "g4ea1sr",
                    "parent_id": "t1_g4e9vte",
                    "score": 3,
                    "created_utc": 1599526194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup.",
            "author": "macaroonqueen",
            "id": "g4e98v3",
            "parent_id": "t3_iojc0d",
            "score": 4,
            "created_utc": 1599525708.0,
            "replies": []
        },
        {
            "body": "I do hereby decree this to be required reading, and bestow upon you the title of lifeguard of the Bowl.\n\nI've said it before, and I'll say it again:  Cash (or the mere promise of) does not automatically imply ownership and/or consent.\n\nAnd yes, if you wouldn't do it in vanilla, you shouldn't do it here.",
            "author": "Patrucio71",
            "id": "g4fmq82",
            "parent_id": "t3_iojc0d",
            "score": 2,
            "created_utc": 1599566997.0,
            "replies": []
        },
        {
            "body": "“You can’t fix stupid”",
            "author": "FreshLaker",
            "id": "g4h9ya0",
            "parent_id": "t3_iojc0d",
            "score": 1,
            "created_utc": 1599598887.0,
            "replies": []
        },
        {
            "body": "Ok wow... you would think you’d be able to simply disagree with something in this thread geez...",
            "author": null,
            "id": "g4e8agm",
            "parent_id": "t3_iojc0d",
            "score": -16,
            "created_utc": 1599525130.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4e9gvd",
                    "parent_id": "t1_g4e8agm",
                    "score": 15,
                    "created_utc": 1599525840.0,
                    "replies": [
                        {
                            "body": "Agreed! This is tough love right here. OP and many others agree that some of the recent posts are alarmingly frightening. There is a worrisome trend of utter disregard for one’s safety. Sometimes people need a little shake or figurative smack to wake them up and see the real picture.",
                            "author": "SunnyWinter85",
                            "id": "g4eap33",
                            "parent_id": "t1_g4e9gvd",
                            "score": 9,
                            "created_utc": 1599526590.0,
                            "replies": []
                        },
                        {
                            "body": "I agree with you. I did not get a judgmental vibe. This is just someone not mincing their words. It doesn't take a genius to figure out the questionable nature of some of these arrangements. And yet, there are threads about meetings strangers at a hotel room for the first time or essentially being someone's sex slave. At some point, you just need to tell it how it is. If my friends and family saw me putting myself in harms way like some of the women here, they would not be holding my hands, they would be livid.",
                            "author": "GoodyGoobert",
                            "id": "g4ebmx6",
                            "parent_id": "t1_g4e9gvd",
                            "score": 8,
                            "created_utc": 1599527162.0,
                            "replies": []
                        },
                        {
                            "body": "I also did not get that from the post at all. I too feel the  shock and worry when I read the posts that do not use common sense. It is very concerning that there is a large influx of these type of posts recently. I want all women to be safe. I want all the women in the bowl to be safe, but they aren’t and newbies do need to know that mistakes can cost them more than just POT.",
                            "author": "InnerRadio7",
                            "id": "g4fevvv",
                            "parent_id": "t1_g4e9gvd",
                            "score": 3,
                            "created_utc": 1599559495.0,
                            "replies": []
                        },
                        {
                            "body": "Don’t mind Phil, she’s always like this on SLF 😜",
                            "author": "ruphun",
                            "id": "g4ebe1i",
                            "parent_id": "t1_g4e9gvd",
                            "score": -5,
                            "created_utc": 1599527015.0,
                            "replies": [
                                {
                                    "body": "Leave me alone 😂",
                                    "author": null,
                                    "id": "g4ec6yy",
                                    "parent_id": "t1_g4ebe1i",
                                    "score": -2,
                                    "created_utc": 1599527502.0,
                                    "replies": [
                                        {
                                            "body": "No worries Phil, I wasn’t talking to you  anyways 😜",
                                            "author": "ruphun",
                                            "id": "g4fnchf",
                                            "parent_id": "t1_g4ec6yy",
                                            "score": -1,
                                            "created_utc": 1599567480.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"this post comes off overly theatrical, obnoxious, self-indulgent and preachy.\" Definitely not my intention, but I also don't believe in sprinkling powdered sugar on something that is very important. \nHowever, I'm a little confused by your comment. I didn't mean to talk down to someone, but I also don't understand the lack of care people take when engaging in these activities, hence my frustrations being expressed. I apologize if any of my sentiments offended you; I assure you that none of that was intended.",
                    "author": "missmacchiato18",
                    "id": "g4e9asm",
                    "parent_id": "t1_g4e8agm",
                    "score": 8,
                    "created_utc": 1599525740.0,
                    "replies": []
                },
                {
                    "body": "Snowflakes are gonna melt at some point. It might as well be a useful heat melting them in a place where they'll form into a more beautiful snowflake, instead of a puddle of mud. \n\nListen to the message, not the tone.",
                    "author": "thrownawayNEFL",
                    "id": "g4ejshs",
                    "parent_id": "t1_g4e8agm",
                    "score": -4,
                    "created_utc": 1599532082.0,
                    "replies": [
                        {
                            "body": "I’ll listen to whatever aspect of the message I choose. I read this post the way I did and said what I said. You don’t have to agree. Many disagree. OP already replied and edited to clarify her point so I don’t have any issue with it now, I understand her POV and don’t feel the need to discuss this further. \n\nKudos for the corny analogy though.",
                            "author": null,
                            "id": "g4el3g6",
                            "parent_id": "t1_g4ejshs",
                            "score": 2,
                            "created_utc": 1599532882.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I lost brain cells reading this, but I’m not a SD. I also 100% agree !",
            "author": "Freaknastytinkerbell",
            "id": "g4gaeta",
            "parent_id": "t3_iojc0d",
            "score": -1,
            "created_utc": 1599581061.0,
            "replies": [
                {
                    "body": "You lost brain cells reading this 😂 how sway?",
                    "author": "missmacchiato18",
                    "id": "g4gaht1",
                    "parent_id": "t1_g4gaeta",
                    "score": 1,
                    "created_utc": 1599581105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "love i'm going to say this since no one else did. \nNEVER go in the woods or any kind of walk away from a high traffic area even if it's a paved path with a man you barley know. \n\nI saw a story on the news about a women from tinder going on a hike with a man turns out he killed 3/4 other woman before he on a hike. \n\nJust something I've learned from toxic relationships - a man that brags or tries to convince you he doesn't do wrong to women probably has and will again.",
            "author": "CattyChaos",
            "id": "g4g1s0i",
            "parent_id": "t1_g4fefk1",
            "score": 10,
            "created_utc": 1599576548.0,
            "replies": [
                {
                    "body": "He was my SD, so I knew him. I also took a lot of safety precautions despite that. This is important to note because I STILL took safety precautions when he was my SD. \n\n-I installed a tracking app on my phone and had a friend check in. \n-I chose the hike which had cell service and was within 10 minutes of emergency services. \n-I also chose a family friendly hike that already had people from a local hiking group I’m a part of doing the trail the same morning I was, so I knew there would be people there. \n-I insisted on having his full legal name long before that. \n-I gave his licence plate, car make and model to a friend. \n-I had regular text check ins with a friend and a plan for what happens if I miss check in. \n\nTHIS IS AFTER I KNEW AND TRUSTED HIM\n\nI moved on from him quite soon after this. I could not stand that his ego. He was insufferable.",
                    "author": "InnerRadio7",
                    "id": "g4gk28v",
                    "parent_id": "t1_g4g1s0i",
                    "score": 9,
                    "created_utc": 1599585957.0,
                    "replies": [
                        {
                            "body": "that's good you were so cautious, just be wary of any red flags cause some men can be crazy.",
                            "author": "CattyChaos",
                            "id": "g4gxeeb",
                            "parent_id": "t1_g4gk28v",
                            "score": 3,
                            "created_utc": 1599592645.0,
                            "replies": [
                                {
                                    "body": "Oh yes they can. I’m a little older than your typical SB so having some extra life experience has taught me the value of safety and trusting my intuition. I’ve narrowly avoided some crazy. \n\nActually, early on there was a POT that I got along with really well so we talked on Snapchat. I ended up declining to meet him because he intimated that he was into rough sex, and that’s not for me. My vagina is a delicate flower lol. He lost his mind. He kept sending me screenshots of my profile, threats to my life, the things he said to me were alarming and abusive. I ghosted him, but he found other ways to get to me. I reported him to SA, and they booted him off. He kept making fake accounts to harass me. [We spoke on the phone 2 times and never met FYI]. \nAnyways, I eventually told him I was talking to the police which I wasn’t, but it was my next step. I’m lucky that he left me alone after that.\n\nIf I ever receive a threat to my life again, the police will be my first step. It was a learning experience.",
                                    "author": "InnerRadio7",
                                    "id": "g4hnfnp",
                                    "parent_id": "t1_g4gxeeb",
                                    "score": 2,
                                    "created_utc": 1599605231.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Can't stand when men suggest \"taking a walk\" as if that's a proper M&G. Its so lame. You usually see this in vanilla dating. Such a turnoff I don't even respond. \n\nFirst dates need to be in public venues. Not cars. Not hikes in the wilderness. Not at his house or at a hotel.",
                    "author": "clair-cummings",
                    "id": "g4gkmjg",
                    "parent_id": "t1_g4g1s0i",
                    "score": 5,
                    "created_utc": 1599586238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Completely. Escorts are more safety conscious than SB and sadly, there's a lot of predators who have been blacklisted by escorts that try places like SA in hopes to find young/naive women that don't know better and are easily misled by promises of money. SB would be smart to understand this.",
            "author": "clair-cummings",
            "id": "g4gl7hj",
            "parent_id": "t1_g4fdtwh",
            "score": 8,
            "created_utc": 1599586530.0,
            "replies": []
        },
        {
            "body": "OMG yes! I saw a documentary on him awhile back. They think he is a cop because the girls would not take their their purses or ID's when with him and it was because he was a previous client that they felt safe with and had paid them before, so they thought he was okay.",
            "author": null,
            "id": "g4hlub7",
            "parent_id": "t1_g4gnj14",
            "score": 3,
            "created_utc": 1599604411.0,
            "replies": [
                {
                    "body": "Scary part is yes exactly that. He's very methodical and patient. Willing to invest time/money to build trust and rapport. Scariest\\*\\* part is that he hasn't been caught yet. He's estimated to be between 30-45 (prime age for SBs to want in their SDs.",
                    "author": "painfullytoohuman",
                    "id": "g4ij54z",
                    "parent_id": "t1_g4hlub7",
                    "score": 5,
                    "created_utc": 1599623248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4ecikz",
            "parent_id": "t1_g4e87l1",
            "score": 13,
            "created_utc": 1599527695.0,
            "replies": []
        },
        {
            "body": "So you only pay her when she puts out.\nTell me this is any different than prostitution 🙄",
            "author": "clair-cummings",
            "id": "g4gk1b4",
            "parent_id": "t1_g4ev5be",
            "score": 5,
            "created_utc": 1599585943.0,
            "replies": [
                {
                    "body": "Disgusting how they often feel the need to brag that they “defer” benefits until sex is provided. How shameless, entitled  and self-serving his comment was. . . Not to mention totally unrelated to the OP’s message to SB’s and THEIR SAFETY.\nWell, on second thought he is the type of “SD” girls should avoid like the plague.\n\nExhibit A ^^ girls. . .Be warned - Men who “defer benefits until sex happens, or directly after, said sex act service is performed“ are simply looking for a cheaper alternative to escorts, or they are blacklisted by escorts.",
                    "author": "honey-_bunny",
                    "id": "g4h7fz5",
                    "parent_id": "t1_g4gk1b4",
                    "score": 9,
                    "created_utc": 1599597616.0,
                    "replies": [
                        {
                            "body": "Right. But at the same time they will argue how its NOT prostitution 🙄 . Like....it IS prostitution, only the poor girl is being compensated $$$ even less and exploited even more for her emotional energy/time/sex/etc. Also, he'll probably ask that she be exclusive...\nAnd let's not forget...he'll also insist on not using a condom 🙄",
                            "author": "clair-cummings",
                            "id": "g4hblp3",
                            "parent_id": "t1_g4h7fz5",
                            "score": 9,
                            "created_utc": 1599599741.0,
                            "replies": [
                                {
                                    "body": "Delusion, entitlement and denial is the fuel of their engines along with a big dose of emotional energy zapping.",
                                    "author": null,
                                    "id": "g4hl3xv",
                                    "parent_id": "t1_g4hblp3",
                                    "score": 7,
                                    "created_utc": 1599604033.0,
                                    "replies": []
                                },
                                {
                                    "body": "💯% agree with u. Like, how is it NOT PROSTITUTION if u only pay her per sex act or “sex services performed” but then say the girl is behaving like ‘an escort’ or shame her, if she wants a generous guy to gift her on platonic dates or activities outside of sex???\n\nI mean, the hypocrisy and manipulation is obvious to us, so hopefully it is to the new girls who come here looking for advice or anyone who can see through the BS they spew .",
                                    "author": "honey-_bunny",
                                    "id": "g4i3ypn",
                                    "parent_id": "t1_g4hblp3",
                                    "score": 6,
                                    "created_utc": 1599614357.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4gkvso",
                    "parent_id": "t1_g4gk1b4",
                    "score": -1,
                    "created_utc": 1599586367.0,
                    "replies": [
                        {
                            "body": "\"I defer benefits until she's ready\" = \"I only pay her when she puts out\".\nSir, this isn't really any different than hiring an escort. Altho I suspect you give her less than she would earn were she actually an escort and charging by the hour.",
                            "author": "clair-cummings",
                            "id": "g4glirq",
                            "parent_id": "t1_g4gkvso",
                            "score": 7,
                            "created_utc": 1599586690.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g4glsbq",
                                    "parent_id": "t1_g4glirq",
                                    "score": -1,
                                    "created_utc": 1599586822.0,
                                    "replies": [
                                        {
                                            "body": "Lol. You're certainly not paying her for her time. If you were, you would be giving her money regardless of whether she was sleeping w you or not. Facts....not my opinion.",
                                            "author": "clair-cummings",
                                            "id": "g4gmjhq",
                                            "parent_id": "t1_g4glsbq",
                                            "score": 4,
                                            "created_utc": 1599587204.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those four words mean so much.",
            "author": "missmacchiato18",
            "id": "g4ea1sr",
            "parent_id": "t1_g4e9vte",
            "score": 3,
            "created_utc": 1599526194.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4e9gvd",
            "parent_id": "t1_g4e8agm",
            "score": 15,
            "created_utc": 1599525840.0,
            "replies": [
                {
                    "body": "Agreed! This is tough love right here. OP and many others agree that some of the recent posts are alarmingly frightening. There is a worrisome trend of utter disregard for one’s safety. Sometimes people need a little shake or figurative smack to wake them up and see the real picture.",
                    "author": "SunnyWinter85",
                    "id": "g4eap33",
                    "parent_id": "t1_g4e9gvd",
                    "score": 9,
                    "created_utc": 1599526590.0,
                    "replies": []
                },
                {
                    "body": "I agree with you. I did not get a judgmental vibe. This is just someone not mincing their words. It doesn't take a genius to figure out the questionable nature of some of these arrangements. And yet, there are threads about meetings strangers at a hotel room for the first time or essentially being someone's sex slave. At some point, you just need to tell it how it is. If my friends and family saw me putting myself in harms way like some of the women here, they would not be holding my hands, they would be livid.",
                    "author": "GoodyGoobert",
                    "id": "g4ebmx6",
                    "parent_id": "t1_g4e9gvd",
                    "score": 8,
                    "created_utc": 1599527162.0,
                    "replies": []
                },
                {
                    "body": "I also did not get that from the post at all. I too feel the  shock and worry when I read the posts that do not use common sense. It is very concerning that there is a large influx of these type of posts recently. I want all women to be safe. I want all the women in the bowl to be safe, but they aren’t and newbies do need to know that mistakes can cost them more than just POT.",
                    "author": "InnerRadio7",
                    "id": "g4fevvv",
                    "parent_id": "t1_g4e9gvd",
                    "score": 3,
                    "created_utc": 1599559495.0,
                    "replies": []
                },
                {
                    "body": "Don’t mind Phil, she’s always like this on SLF 😜",
                    "author": "ruphun",
                    "id": "g4ebe1i",
                    "parent_id": "t1_g4e9gvd",
                    "score": -5,
                    "created_utc": 1599527015.0,
                    "replies": [
                        {
                            "body": "Leave me alone 😂",
                            "author": null,
                            "id": "g4ec6yy",
                            "parent_id": "t1_g4ebe1i",
                            "score": -2,
                            "created_utc": 1599527502.0,
                            "replies": [
                                {
                                    "body": "No worries Phil, I wasn’t talking to you  anyways 😜",
                                    "author": "ruphun",
                                    "id": "g4fnchf",
                                    "parent_id": "t1_g4ec6yy",
                                    "score": -1,
                                    "created_utc": 1599567480.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"this post comes off overly theatrical, obnoxious, self-indulgent and preachy.\" Definitely not my intention, but I also don't believe in sprinkling powdered sugar on something that is very important. \nHowever, I'm a little confused by your comment. I didn't mean to talk down to someone, but I also don't understand the lack of care people take when engaging in these activities, hence my frustrations being expressed. I apologize if any of my sentiments offended you; I assure you that none of that was intended.",
            "author": "missmacchiato18",
            "id": "g4e9asm",
            "parent_id": "t1_g4e8agm",
            "score": 8,
            "created_utc": 1599525740.0,
            "replies": []
        },
        {
            "body": "Snowflakes are gonna melt at some point. It might as well be a useful heat melting them in a place where they'll form into a more beautiful snowflake, instead of a puddle of mud. \n\nListen to the message, not the tone.",
            "author": "thrownawayNEFL",
            "id": "g4ejshs",
            "parent_id": "t1_g4e8agm",
            "score": -4,
            "created_utc": 1599532082.0,
            "replies": [
                {
                    "body": "I’ll listen to whatever aspect of the message I choose. I read this post the way I did and said what I said. You don’t have to agree. Many disagree. OP already replied and edited to clarify her point so I don’t have any issue with it now, I understand her POV and don’t feel the need to discuss this further. \n\nKudos for the corny analogy though.",
                    "author": null,
                    "id": "g4el3g6",
                    "parent_id": "t1_g4ejshs",
                    "score": 2,
                    "created_utc": 1599532882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You lost brain cells reading this 😂 how sway?",
            "author": "missmacchiato18",
            "id": "g4gaht1",
            "parent_id": "t1_g4gaeta",
            "score": 1,
            "created_utc": 1599581105.0,
            "replies": []
        },
        {
            "body": "He was my SD, so I knew him. I also took a lot of safety precautions despite that. This is important to note because I STILL took safety precautions when he was my SD. \n\n-I installed a tracking app on my phone and had a friend check in. \n-I chose the hike which had cell service and was within 10 minutes of emergency services. \n-I also chose a family friendly hike that already had people from a local hiking group I’m a part of doing the trail the same morning I was, so I knew there would be people there. \n-I insisted on having his full legal name long before that. \n-I gave his licence plate, car make and model to a friend. \n-I had regular text check ins with a friend and a plan for what happens if I miss check in. \n\nTHIS IS AFTER I KNEW AND TRUSTED HIM\n\nI moved on from him quite soon after this. I could not stand that his ego. He was insufferable.",
            "author": "InnerRadio7",
            "id": "g4gk28v",
            "parent_id": "t1_g4g1s0i",
            "score": 9,
            "created_utc": 1599585957.0,
            "replies": [
                {
                    "body": "that's good you were so cautious, just be wary of any red flags cause some men can be crazy.",
                    "author": "CattyChaos",
                    "id": "g4gxeeb",
                    "parent_id": "t1_g4gk28v",
                    "score": 3,
                    "created_utc": 1599592645.0,
                    "replies": [
                        {
                            "body": "Oh yes they can. I’m a little older than your typical SB so having some extra life experience has taught me the value of safety and trusting my intuition. I’ve narrowly avoided some crazy. \n\nActually, early on there was a POT that I got along with really well so we talked on Snapchat. I ended up declining to meet him because he intimated that he was into rough sex, and that’s not for me. My vagina is a delicate flower lol. He lost his mind. He kept sending me screenshots of my profile, threats to my life, the things he said to me were alarming and abusive. I ghosted him, but he found other ways to get to me. I reported him to SA, and they booted him off. He kept making fake accounts to harass me. [We spoke on the phone 2 times and never met FYI]. \nAnyways, I eventually told him I was talking to the police which I wasn’t, but it was my next step. I’m lucky that he left me alone after that.\n\nIf I ever receive a threat to my life again, the police will be my first step. It was a learning experience.",
                            "author": "InnerRadio7",
                            "id": "g4hnfnp",
                            "parent_id": "t1_g4gxeeb",
                            "score": 2,
                            "created_utc": 1599605231.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can't stand when men suggest \"taking a walk\" as if that's a proper M&G. Its so lame. You usually see this in vanilla dating. Such a turnoff I don't even respond. \n\nFirst dates need to be in public venues. Not cars. Not hikes in the wilderness. Not at his house or at a hotel.",
            "author": "clair-cummings",
            "id": "g4gkmjg",
            "parent_id": "t1_g4g1s0i",
            "score": 5,
            "created_utc": 1599586238.0,
            "replies": []
        },
        {
            "body": "Scary part is yes exactly that. He's very methodical and patient. Willing to invest time/money to build trust and rapport. Scariest\\*\\* part is that he hasn't been caught yet. He's estimated to be between 30-45 (prime age for SBs to want in their SDs.",
            "author": "painfullytoohuman",
            "id": "g4ij54z",
            "parent_id": "t1_g4hlub7",
            "score": 5,
            "created_utc": 1599623248.0,
            "replies": []
        },
        {
            "body": "Disgusting how they often feel the need to brag that they “defer” benefits until sex is provided. How shameless, entitled  and self-serving his comment was. . . Not to mention totally unrelated to the OP’s message to SB’s and THEIR SAFETY.\nWell, on second thought he is the type of “SD” girls should avoid like the plague.\n\nExhibit A ^^ girls. . .Be warned - Men who “defer benefits until sex happens, or directly after, said sex act service is performed“ are simply looking for a cheaper alternative to escorts, or they are blacklisted by escorts.",
            "author": "honey-_bunny",
            "id": "g4h7fz5",
            "parent_id": "t1_g4gk1b4",
            "score": 9,
            "created_utc": 1599597616.0,
            "replies": [
                {
                    "body": "Right. But at the same time they will argue how its NOT prostitution 🙄 . Like....it IS prostitution, only the poor girl is being compensated $$$ even less and exploited even more for her emotional energy/time/sex/etc. Also, he'll probably ask that she be exclusive...\nAnd let's not forget...he'll also insist on not using a condom 🙄",
                    "author": "clair-cummings",
                    "id": "g4hblp3",
                    "parent_id": "t1_g4h7fz5",
                    "score": 9,
                    "created_utc": 1599599741.0,
                    "replies": [
                        {
                            "body": "Delusion, entitlement and denial is the fuel of their engines along with a big dose of emotional energy zapping.",
                            "author": null,
                            "id": "g4hl3xv",
                            "parent_id": "t1_g4hblp3",
                            "score": 7,
                            "created_utc": 1599604033.0,
                            "replies": []
                        },
                        {
                            "body": "💯% agree with u. Like, how is it NOT PROSTITUTION if u only pay her per sex act or “sex services performed” but then say the girl is behaving like ‘an escort’ or shame her, if she wants a generous guy to gift her on platonic dates or activities outside of sex???\n\nI mean, the hypocrisy and manipulation is obvious to us, so hopefully it is to the new girls who come here looking for advice or anyone who can see through the BS they spew .",
                            "author": "honey-_bunny",
                            "id": "g4i3ypn",
                            "parent_id": "t1_g4hblp3",
                            "score": 6,
                            "created_utc": 1599614357.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4gkvso",
            "parent_id": "t1_g4gk1b4",
            "score": -1,
            "created_utc": 1599586367.0,
            "replies": [
                {
                    "body": "\"I defer benefits until she's ready\" = \"I only pay her when she puts out\".\nSir, this isn't really any different than hiring an escort. Altho I suspect you give her less than she would earn were she actually an escort and charging by the hour.",
                    "author": "clair-cummings",
                    "id": "g4glirq",
                    "parent_id": "t1_g4gkvso",
                    "score": 7,
                    "created_utc": 1599586690.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g4glsbq",
                            "parent_id": "t1_g4glirq",
                            "score": -1,
                            "created_utc": 1599586822.0,
                            "replies": [
                                {
                                    "body": "Lol. You're certainly not paying her for her time. If you were, you would be giving her money regardless of whether she was sleeping w you or not. Facts....not my opinion.",
                                    "author": "clair-cummings",
                                    "id": "g4gmjhq",
                                    "parent_id": "t1_g4glsbq",
                                    "score": 4,
                                    "created_utc": 1599587204.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed! This is tough love right here. OP and many others agree that some of the recent posts are alarmingly frightening. There is a worrisome trend of utter disregard for one’s safety. Sometimes people need a little shake or figurative smack to wake them up and see the real picture.",
            "author": "SunnyWinter85",
            "id": "g4eap33",
            "parent_id": "t1_g4e9gvd",
            "score": 9,
            "created_utc": 1599526590.0,
            "replies": []
        },
        {
            "body": "I agree with you. I did not get a judgmental vibe. This is just someone not mincing their words. It doesn't take a genius to figure out the questionable nature of some of these arrangements. And yet, there are threads about meetings strangers at a hotel room for the first time or essentially being someone's sex slave. At some point, you just need to tell it how it is. If my friends and family saw me putting myself in harms way like some of the women here, they would not be holding my hands, they would be livid.",
            "author": "GoodyGoobert",
            "id": "g4ebmx6",
            "parent_id": "t1_g4e9gvd",
            "score": 8,
            "created_utc": 1599527162.0,
            "replies": []
        },
        {
            "body": "I also did not get that from the post at all. I too feel the  shock and worry when I read the posts that do not use common sense. It is very concerning that there is a large influx of these type of posts recently. I want all women to be safe. I want all the women in the bowl to be safe, but they aren’t and newbies do need to know that mistakes can cost them more than just POT.",
            "author": "InnerRadio7",
            "id": "g4fevvv",
            "parent_id": "t1_g4e9gvd",
            "score": 3,
            "created_utc": 1599559495.0,
            "replies": []
        },
        {
            "body": "Don’t mind Phil, she’s always like this on SLF 😜",
            "author": "ruphun",
            "id": "g4ebe1i",
            "parent_id": "t1_g4e9gvd",
            "score": -5,
            "created_utc": 1599527015.0,
            "replies": [
                {
                    "body": "Leave me alone 😂",
                    "author": null,
                    "id": "g4ec6yy",
                    "parent_id": "t1_g4ebe1i",
                    "score": -2,
                    "created_utc": 1599527502.0,
                    "replies": [
                        {
                            "body": "No worries Phil, I wasn’t talking to you  anyways 😜",
                            "author": "ruphun",
                            "id": "g4fnchf",
                            "parent_id": "t1_g4ec6yy",
                            "score": -1,
                            "created_utc": 1599567480.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ll listen to whatever aspect of the message I choose. I read this post the way I did and said what I said. You don’t have to agree. Many disagree. OP already replied and edited to clarify her point so I don’t have any issue with it now, I understand her POV and don’t feel the need to discuss this further. \n\nKudos for the corny analogy though.",
            "author": null,
            "id": "g4el3g6",
            "parent_id": "t1_g4ejshs",
            "score": 2,
            "created_utc": 1599532882.0,
            "replies": []
        },
        {
            "body": "that's good you were so cautious, just be wary of any red flags cause some men can be crazy.",
            "author": "CattyChaos",
            "id": "g4gxeeb",
            "parent_id": "t1_g4gk28v",
            "score": 3,
            "created_utc": 1599592645.0,
            "replies": [
                {
                    "body": "Oh yes they can. I’m a little older than your typical SB so having some extra life experience has taught me the value of safety and trusting my intuition. I’ve narrowly avoided some crazy. \n\nActually, early on there was a POT that I got along with really well so we talked on Snapchat. I ended up declining to meet him because he intimated that he was into rough sex, and that’s not for me. My vagina is a delicate flower lol. He lost his mind. He kept sending me screenshots of my profile, threats to my life, the things he said to me were alarming and abusive. I ghosted him, but he found other ways to get to me. I reported him to SA, and they booted him off. He kept making fake accounts to harass me. [We spoke on the phone 2 times and never met FYI]. \nAnyways, I eventually told him I was talking to the police which I wasn’t, but it was my next step. I’m lucky that he left me alone after that.\n\nIf I ever receive a threat to my life again, the police will be my first step. It was a learning experience.",
                    "author": "InnerRadio7",
                    "id": "g4hnfnp",
                    "parent_id": "t1_g4gxeeb",
                    "score": 2,
                    "created_utc": 1599605231.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right. But at the same time they will argue how its NOT prostitution 🙄 . Like....it IS prostitution, only the poor girl is being compensated $$$ even less and exploited even more for her emotional energy/time/sex/etc. Also, he'll probably ask that she be exclusive...\nAnd let's not forget...he'll also insist on not using a condom 🙄",
            "author": "clair-cummings",
            "id": "g4hblp3",
            "parent_id": "t1_g4h7fz5",
            "score": 9,
            "created_utc": 1599599741.0,
            "replies": [
                {
                    "body": "Delusion, entitlement and denial is the fuel of their engines along with a big dose of emotional energy zapping.",
                    "author": null,
                    "id": "g4hl3xv",
                    "parent_id": "t1_g4hblp3",
                    "score": 7,
                    "created_utc": 1599604033.0,
                    "replies": []
                },
                {
                    "body": "💯% agree with u. Like, how is it NOT PROSTITUTION if u only pay her per sex act or “sex services performed” but then say the girl is behaving like ‘an escort’ or shame her, if she wants a generous guy to gift her on platonic dates or activities outside of sex???\n\nI mean, the hypocrisy and manipulation is obvious to us, so hopefully it is to the new girls who come here looking for advice or anyone who can see through the BS they spew .",
                    "author": "honey-_bunny",
                    "id": "g4i3ypn",
                    "parent_id": "t1_g4hblp3",
                    "score": 6,
                    "created_utc": 1599614357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"I defer benefits until she's ready\" = \"I only pay her when she puts out\".\nSir, this isn't really any different than hiring an escort. Altho I suspect you give her less than she would earn were she actually an escort and charging by the hour.",
            "author": "clair-cummings",
            "id": "g4glirq",
            "parent_id": "t1_g4gkvso",
            "score": 7,
            "created_utc": 1599586690.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g4glsbq",
                    "parent_id": "t1_g4glirq",
                    "score": -1,
                    "created_utc": 1599586822.0,
                    "replies": [
                        {
                            "body": "Lol. You're certainly not paying her for her time. If you were, you would be giving her money regardless of whether she was sleeping w you or not. Facts....not my opinion.",
                            "author": "clair-cummings",
                            "id": "g4gmjhq",
                            "parent_id": "t1_g4glsbq",
                            "score": 4,
                            "created_utc": 1599587204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Leave me alone 😂",
            "author": null,
            "id": "g4ec6yy",
            "parent_id": "t1_g4ebe1i",
            "score": -2,
            "created_utc": 1599527502.0,
            "replies": [
                {
                    "body": "No worries Phil, I wasn’t talking to you  anyways 😜",
                    "author": "ruphun",
                    "id": "g4fnchf",
                    "parent_id": "t1_g4ec6yy",
                    "score": -1,
                    "created_utc": 1599567480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh yes they can. I’m a little older than your typical SB so having some extra life experience has taught me the value of safety and trusting my intuition. I’ve narrowly avoided some crazy. \n\nActually, early on there was a POT that I got along with really well so we talked on Snapchat. I ended up declining to meet him because he intimated that he was into rough sex, and that’s not for me. My vagina is a delicate flower lol. He lost his mind. He kept sending me screenshots of my profile, threats to my life, the things he said to me were alarming and abusive. I ghosted him, but he found other ways to get to me. I reported him to SA, and they booted him off. He kept making fake accounts to harass me. [We spoke on the phone 2 times and never met FYI]. \nAnyways, I eventually told him I was talking to the police which I wasn’t, but it was my next step. I’m lucky that he left me alone after that.\n\nIf I ever receive a threat to my life again, the police will be my first step. It was a learning experience.",
            "author": "InnerRadio7",
            "id": "g4hnfnp",
            "parent_id": "t1_g4gxeeb",
            "score": 2,
            "created_utc": 1599605231.0,
            "replies": []
        },
        {
            "body": "Delusion, entitlement and denial is the fuel of their engines along with a big dose of emotional energy zapping.",
            "author": null,
            "id": "g4hl3xv",
            "parent_id": "t1_g4hblp3",
            "score": 7,
            "created_utc": 1599604033.0,
            "replies": []
        },
        {
            "body": "💯% agree with u. Like, how is it NOT PROSTITUTION if u only pay her per sex act or “sex services performed” but then say the girl is behaving like ‘an escort’ or shame her, if she wants a generous guy to gift her on platonic dates or activities outside of sex???\n\nI mean, the hypocrisy and manipulation is obvious to us, so hopefully it is to the new girls who come here looking for advice or anyone who can see through the BS they spew .",
            "author": "honey-_bunny",
            "id": "g4i3ypn",
            "parent_id": "t1_g4hblp3",
            "score": 6,
            "created_utc": 1599614357.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4glsbq",
            "parent_id": "t1_g4glirq",
            "score": -1,
            "created_utc": 1599586822.0,
            "replies": [
                {
                    "body": "Lol. You're certainly not paying her for her time. If you were, you would be giving her money regardless of whether she was sleeping w you or not. Facts....not my opinion.",
                    "author": "clair-cummings",
                    "id": "g4gmjhq",
                    "parent_id": "t1_g4glsbq",
                    "score": 4,
                    "created_utc": 1599587204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No worries Phil, I wasn’t talking to you  anyways 😜",
            "author": "ruphun",
            "id": "g4fnchf",
            "parent_id": "t1_g4ec6yy",
            "score": -1,
            "created_utc": 1599567480.0,
            "replies": []
        },
        {
            "body": "Lol. You're certainly not paying her for her time. If you were, you would be giving her money regardless of whether she was sleeping w you or not. Facts....not my opinion.",
            "author": "clair-cummings",
            "id": "g4gmjhq",
            "parent_id": "t1_g4glsbq",
            "score": 4,
            "created_utc": 1599587204.0,
            "replies": []
        }
    ]
}