{
    "title": "Eau de SD",
    "post_id": "fpy0rt",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fpy0rt/eau_de_sd/",
    "author": null,
    "body": "About two months ago I remember pulling up a website that I'd seen on a local news show. It was a map of the world and there was a concentration of red dots located over China. My SD was leaving for a two week travel trip overseas and I was worried about a virus that I was hearing bits and pieces about on the news. It would be three weeks from our final date before we'd see each other again.\n\nThere is a lot of things I miss about my SD when he is not around, but there is something that I always miss the most. His smell. As someone who doesn't wear perfume, and someone who doesn't really like strong scents, I was surprised when I found that I'd somehow come to attribute his smell to feelings of comfort and tranquility. I notice when he is not wearing it and when he is I have a tendency to place my face into his neck, close my eyes and breathe him in. In the early months of our relationship my SD gave me a cardigan he'd been wearing. It was the best thing he'd ever given me and I wore that cardigan, wrapped in his smell, for weeks. Eventually, the scent faded but it is still one of my favorite gifts.\n\nOn one of our final dates before he was set to depart my SD told me he had a gift for me. He said it was something to help me get through our time apart. I wasn't sure what to expect, and was even more confused when he handed me a bottle of laundry detergent. What SD gets their SB a bottle of laundry detergent? As I'm sitting in his car, staring at this tiny bottle of laundry detergent, he explains that the detergent is special. It is a duplicate of the scent he wears. Whatever I wash with the detergent will smell just like he does. \n\nI have received a lot of gifts over the time that I have been an SB. My current guy alone has given me a lot of great gifts over the 7+ months we have been together, his cardigan included. But this one is by far my favorite. Tears start falling down my cheeks as I sat in the car that day. And, as we said goodbye prior to him leaving for his trip, I promised we'd text every day and that I'd go to sleep wrapped in his scent every night. It's the little things.\n\nAs my SD boarded his plane, I watched the red circles on that map grow and spread. I checked in with him every chance I got, reminded him to sanitize his hands and wear his N95, and curled up to sleep in blankets I'd washed with my new laundry detergent. Every night I'd wrap those blankets around me as tight as I could and bury my face into my pillows. I'd drift off to sleep smelling the one thing that makes me feel totally and utterly calm. \n\nMy SD's trip was cut short due to the virus' spread and I was elated to have him back early. I hadn't yet seen those red circles spreading over my own country but the week after he came back I went out on an impromptu shopping trip with my children for supplies. My oldest questioned my sanity. \"Why are we going back out when we just went grocery shopping?\" she'd asked. When I walked into the grocery store and saw empty aisles where the lysol and packaged meats used to be I knew things were going to get bad fast. I grabbed one of the packages of store brand cleaner as it was the only kind remaining as we headed to the checkout.\n\nI continued to bring up that map every day at work even with my SD back from his trip. And even when those first red dots started to grow, here on my own soil, my coworkers laughed at me and told me I watched the news too much. The SD and I talked about what would happen if we would be apart for awhile. It felt a lot like the conversations we had prior to him leaving for his trip, except this time we'd be just miles apart. His words to me were, 'I'll support you, no matter what.' \n\nWhen I was little my best friend was my grandmother. She was a kind and gentle woman who battled cancer way too young and for way too long. One day when she was sick we were laying in bed and she said to me, \"I'll always be with you. Even if I'm not here I'll send angels to look after and guide you.\" I remember that conversation so clearly and, though it may sound silly, I believe she sent my SD to me. I mean, how else would a girl like me end up meeting a guy like him? \n\nThere are things my SD knows that I cannot explain. I routinely go to him for advice and he is always right. He can somehow foresee how things are going to happen before they do. He gets me in ways no one else ever has. He recommends books that move me. Finds new cuisines that blow my mind. He gives gifts that are things I'd choose for myself. Without knowing we'd be quarantined he gave me a bottle of laundry detergent, enough for months of tranquility and calm. And it was his trip overseas that led me to purchase a package of cleaning supplies I normally wouldn't have bought. It's the little things.\n\nI was furloughed a few weeks ago and my children's school has been moved to online. Instead of getting up and going to work I now get up and clean, make meals, help with school work. I watch those red bubbles grow and grow. I have friends with family members that have COVID-19. My neighbor is in quarantine due to an exposure. I live right next to an epicenter. I get anxious when I have to go to a store because it's not just me I'm protecting anymore. I struggle without my needed free time and I struggle with not seeing my SD. My entire life is now lived by a list of chores and breakfast, lunch, and dinner.\n\nA little under two weeks ago my SD met me at the grocery store for my final shopping trip. I was unable to find many of the things on my list but I was still able to get a majority of it. I felt terrible when the cashier rang up the total of the bill and my SD insisted on paying. I wasn't sure when we'd see each other again. He didn't even blink when he stuck his credit card into the card reader. I'm not sure whether the tears in my eyes were because of his love for me, or from the panic rising in my chest from being out in public. My SD leaned in close to me and said, 'Don't worry. We'll get through this together.'\n\nLife looks different now. We have new struggles: as women and men, as families, as a society. We have to find the good in things. Now more than ever. We have to be strong for each other. I read an article the other day that said: It's okay to be scared. Don't ignore those feelings. Dissect them, feel them and let them pass through you, so you can move onto the other emotions in life, because those good emotions are the ones you want to pass onto others. You cannot pass those on if you are filled with the fear you continue to ignore.\n\nFind the good in the little things. My good is the love and support I have from the man I met just 7 months ago, my angel. My good is the cardigan he gave me off his back the day I had surgery. My good is a little tiny bottle of detergent that smells like tranquility. Yes, I still have fear and I still have sadness, but I do my best to acknowledge those things and let them pass through me. So I can pass the love and support I feel along to others. And when things get really bad, and it's okay that they do, I curl up in my blankets, the ones that smell like comfort, and drift off to sleep pretending my SD is laying next to me. \n\nI took my children for a walk the other day. My oldest broke down crying when we arrived at the park. We sat down on a bench and after some prodding she finally lamented. She was scared. Tears streamed down her face as she said, 'What's going to happen to us?' Up until that moment I hadn't even realized she was struggling. She holds herself together better than I do because just that morning I'd gone back to bed and curled up in my blankets and cried like I'd done countless days before that.  I pulled her in close as we sat next to each other and said, 'Don't worry. We'll get through this together.' She snuggled her face into my neck and after awhile she closed her eyes and whispered, 'You smell good. Like the blankets we cuddle in when I lay with you.'\n\nIt's the little things.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fpy0rt/eau_de_sd/",
    "score": 131,
    "upvote_ratio": 0.92,
    "created_utc": 1585319945.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "The laundry detergent😭😭😭 I did not need to enter my feels this early😭😭",
            "author": "LoverOfTheSea1997",
            "id": "flnmj8k",
            "parent_id": "t3_fpy0rt",
            "score": 19,
            "created_utc": 1585321698.0,
            "replies": [
                {
                    "body": "Her post is the perfect antidote (or exterminator) to an SD  post last evening that there are no feelings in sugar relationships, it's just about the dollars.",
                    "author": "pinotandsugar",
                    "id": "flpgl4g",
                    "parent_id": "t1_flnmj8k",
                    "score": 2,
                    "created_utc": 1585358994.0,
                    "replies": []
                },
                {
                    "body": "I gave mine a thing of tide pods recently. I thought I was out, so I’ll pick some up when I was at the store, then I got home and realized I had completely unopened package.\n\nHope I gave off the right vibes",
                    "author": "SeaDeal",
                    "id": "flpphzy",
                    "parent_id": "t1_flnmj8k",
                    "score": 1,
                    "created_utc": 1585365284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Every time you post something, there is a need for me to push everything I'm currently doing aside, to read it, uninterrupted. For your writings are always beautifully written and deserves everyone's utmost attention.\n\nOne can only hope that they'll find themselves in a relationship like what you have with your SD.\n\nI know I do. And I continue to hope.\n\nBe safe. We'll get through this.",
            "author": "realitytomydreams",
            "id": "flnmt1u",
            "parent_id": "t3_fpy0rt",
            "score": 20,
            "created_utc": 1585321855.0,
            "replies": [
                {
                    "body": "What she said💗",
                    "author": "RealEarthAngel",
                    "id": "flnzs04",
                    "parent_id": "t1_flnmt1u",
                    "score": 7,
                    "created_utc": 1585328969.0,
                    "replies": []
                },
                {
                    "body": "You articulated my feelings.",
                    "author": "PioneerExperience",
                    "id": "flop2er",
                    "parent_id": "t1_flnmt1u",
                    "score": 3,
                    "created_utc": 1585342614.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im like bawling. I cant formulate a response. But yes to all of this. 💗",
            "author": "OliviaWildflower2332",
            "id": "flnlbrk",
            "parent_id": "t3_fpy0rt",
            "score": 14,
            "created_utc": 1585320986.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "flnxy5s",
            "parent_id": "t3_fpy0rt",
            "score": 18,
            "created_utc": 1585327986.0,
            "replies": [
                {
                    "body": "This was a beautiful read. I'm glad you feel her guidance.  (I feel like I've misjudged you based on some of your comments )",
                    "author": "PioneerExperience",
                    "id": "flop90a",
                    "parent_id": "t1_flnxy5s",
                    "score": 5,
                    "created_utc": 1585342715.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "flosyd9",
                            "parent_id": "t1_flop90a",
                            "score": 3,
                            "created_utc": 1585344837.0,
                            "replies": [
                                {
                                    "body": "To be fair, You do seem like an asshole. But I'd try to remember this comment the next time I think that way",
                                    "author": "PioneerExperience",
                                    "id": "flou32x",
                                    "parent_id": "t1_flosyd9",
                                    "score": 3,
                                    "created_utc": 1585345497.0,
                                    "replies": []
                                },
                                {
                                    "body": "Definately not an asshole. :)",
                                    "author": "redditgrl1140",
                                    "id": "flr77wd",
                                    "parent_id": "t1_flosyd9",
                                    "score": 1,
                                    "created_utc": 1585414400.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is beautiful. It’s such a comforting feeling that loved ones who have moved on still guide us through our lives.",
                    "author": "xterrababy",
                    "id": "flopryc",
                    "parent_id": "t1_flnxy5s",
                    "score": 2,
                    "created_utc": 1585343013.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "flot7mv",
                            "parent_id": "t1_flopryc",
                            "score": 1,
                            "created_utc": 1585344989.0,
                            "replies": [
                                {
                                    "body": "You’re right- we can’t say for certain, but if something brings us comfort, what’s the point in questioning it, right? It’s something peaceful for me to hold onto when I need it.",
                                    "author": "xterrababy",
                                    "id": "flou5u1",
                                    "parent_id": "t1_flot7mv",
                                    "score": 2,
                                    "created_utc": 1585345540.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn onions.",
            "author": "LikeHoney99",
            "id": "flno72x",
            "parent_id": "t3_fpy0rt",
            "score": 5,
            "created_utc": 1585322651.0,
            "replies": []
        },
        {
            "body": "So eloquent. Your writing is kind of like prose, and the cadence very nicely delivered.",
            "author": "foggymaria",
            "id": "flnxmpk",
            "parent_id": "t3_fpy0rt",
            "score": 4,
            "created_utc": 1585327816.0,
            "replies": []
        },
        {
            "body": "I am so glad you and intiald are doing well! :)\n\nHere is to hoping you both see eachother sooner rather than later!",
            "author": "BigBearSD",
            "id": "flo9p4u",
            "parent_id": "t3_fpy0rt",
            "score": 4,
            "created_utc": 1585334187.0,
            "replies": []
        },
        {
            "body": "Send her all the detergent.  All of it! 😭",
            "author": "badmonopoly",
            "id": "flnt167",
            "parent_id": "t3_fpy0rt",
            "score": 8,
            "created_utc": 1585325318.0,
            "replies": []
        },
        {
            "body": "Another gem, thanks so much for sharing your thoughts and feelings with us.",
            "author": "mraspencer",
            "id": "flo4pxe",
            "parent_id": "t3_fpy0rt",
            "score": 3,
            "created_utc": 1585331572.0,
            "replies": []
        },
        {
            "body": "I'M not crying. YOU'RE crying.",
            "author": "iamachickenhead",
            "id": "flny0sa",
            "parent_id": "t3_fpy0rt",
            "score": 6,
            "created_utc": 1585328025.0,
            "replies": []
        },
        {
            "body": "You are an extraordinary writer, and your relationship with your SD is exactly the type that I deeply desire.\n\nI belong to a lovely community of women, and when something good happens to one of us, we all rub her head so that that good energy gets on us too.\n\nRubbing your head, OP🤍",
            "author": "RealEarthAngel",
            "id": "flo06cg",
            "parent_id": "t3_fpy0rt",
            "score": 4,
            "created_utc": 1585329184.0,
            "replies": []
        },
        {
            "body": "I always say this, but I don't mind repeating myself. Never stop writing, AB. You have a true gift.",
            "author": "PioneerExperience",
            "id": "flopbuy",
            "parent_id": "t3_fpy0rt",
            "score": 2,
            "created_utc": 1585342759.0,
            "replies": []
        },
        {
            "body": "Oh. my. goodness! I’m in love with y’all’s relationship.  How thoughtful!",
            "author": null,
            "id": "flnv7l3",
            "parent_id": "t3_fpy0rt",
            "score": 2,
            "created_utc": 1585326502.0,
            "replies": []
        },
        {
            "body": "Is he married?",
            "author": null,
            "id": "flnun37",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585326195.0,
            "replies": []
        },
        {
            "body": "That was...😥😥😥💗💗💗💗💗💗\nIn my feels!!!",
            "author": "BellaSucreXXX",
            "id": "flodwed",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585336413.0,
            "replies": []
        },
        {
            "body": "That was so beautiful.",
            "author": null,
            "id": "flofe8z",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585337245.0,
            "replies": []
        },
        {
            "body": "Damn right in the feels. I miss my SD so much 😭.",
            "author": "IslandBreeze22",
            "id": "flojxhc",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585339736.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing your story. I’ve marked and saved it for so many reasons. We are all going through this together yet feel so isolated more than ever. It is really scary out there and I come home everyday riddled with anxiety while others laugh it off and say “the flu kills way more get over it”. While I sit here with a house full of high risk family members and taking care of my great aunt and uncle as well. Hugs and kisses your way, here to hoping we all make it out on the other side!❤️",
            "author": "beentheredonethat80",
            "id": "flosvds",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585344789.0,
            "replies": []
        },
        {
            "body": "such good writing skills!! this is really cute but for some reason it made me sad haha",
            "author": null,
            "id": "flpbfoe",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585355632.0,
            "replies": []
        },
        {
            "body": "This was so sweet to read. It’s honestly the little things. 💜",
            "author": "cjkit",
            "id": "flputiy",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585369453.0,
            "replies": []
        },
        {
            "body": "There are so many beautiful thing about this story. This: \"Don't worry. We'll get through this together\" was so touching. Wishing you both the best, stay well!",
            "author": "Sucraloseoverdosed",
            "id": "flswcot",
            "parent_id": "t3_fpy0rt",
            "score": 1,
            "created_utc": 1585452492.0,
            "replies": []
        },
        {
            "body": "Her post is the perfect antidote (or exterminator) to an SD  post last evening that there are no feelings in sugar relationships, it's just about the dollars.",
            "author": "pinotandsugar",
            "id": "flpgl4g",
            "parent_id": "t1_flnmj8k",
            "score": 2,
            "created_utc": 1585358994.0,
            "replies": []
        },
        {
            "body": "I gave mine a thing of tide pods recently. I thought I was out, so I’ll pick some up when I was at the store, then I got home and realized I had completely unopened package.\n\nHope I gave off the right vibes",
            "author": "SeaDeal",
            "id": "flpphzy",
            "parent_id": "t1_flnmj8k",
            "score": 1,
            "created_utc": 1585365284.0,
            "replies": []
        },
        {
            "body": "What she said💗",
            "author": "RealEarthAngel",
            "id": "flnzs04",
            "parent_id": "t1_flnmt1u",
            "score": 7,
            "created_utc": 1585328969.0,
            "replies": []
        },
        {
            "body": "You articulated my feelings.",
            "author": "PioneerExperience",
            "id": "flop2er",
            "parent_id": "t1_flnmt1u",
            "score": 3,
            "created_utc": 1585342614.0,
            "replies": []
        },
        {
            "body": "This was a beautiful read. I'm glad you feel her guidance.  (I feel like I've misjudged you based on some of your comments )",
            "author": "PioneerExperience",
            "id": "flop90a",
            "parent_id": "t1_flnxy5s",
            "score": 5,
            "created_utc": 1585342715.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "flosyd9",
                    "parent_id": "t1_flop90a",
                    "score": 3,
                    "created_utc": 1585344837.0,
                    "replies": [
                        {
                            "body": "To be fair, You do seem like an asshole. But I'd try to remember this comment the next time I think that way",
                            "author": "PioneerExperience",
                            "id": "flou32x",
                            "parent_id": "t1_flosyd9",
                            "score": 3,
                            "created_utc": 1585345497.0,
                            "replies": []
                        },
                        {
                            "body": "Definately not an asshole. :)",
                            "author": "redditgrl1140",
                            "id": "flr77wd",
                            "parent_id": "t1_flosyd9",
                            "score": 1,
                            "created_utc": 1585414400.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is beautiful. It’s such a comforting feeling that loved ones who have moved on still guide us through our lives.",
            "author": "xterrababy",
            "id": "flopryc",
            "parent_id": "t1_flnxy5s",
            "score": 2,
            "created_utc": 1585343013.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "flot7mv",
                    "parent_id": "t1_flopryc",
                    "score": 1,
                    "created_utc": 1585344989.0,
                    "replies": [
                        {
                            "body": "You’re right- we can’t say for certain, but if something brings us comfort, what’s the point in questioning it, right? It’s something peaceful for me to hold onto when I need it.",
                            "author": "xterrababy",
                            "id": "flou5u1",
                            "parent_id": "t1_flot7mv",
                            "score": 2,
                            "created_utc": 1585345540.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "flosyd9",
            "parent_id": "t1_flop90a",
            "score": 3,
            "created_utc": 1585344837.0,
            "replies": [
                {
                    "body": "To be fair, You do seem like an asshole. But I'd try to remember this comment the next time I think that way",
                    "author": "PioneerExperience",
                    "id": "flou32x",
                    "parent_id": "t1_flosyd9",
                    "score": 3,
                    "created_utc": 1585345497.0,
                    "replies": []
                },
                {
                    "body": "Definately not an asshole. :)",
                    "author": "redditgrl1140",
                    "id": "flr77wd",
                    "parent_id": "t1_flosyd9",
                    "score": 1,
                    "created_utc": 1585414400.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "flot7mv",
            "parent_id": "t1_flopryc",
            "score": 1,
            "created_utc": 1585344989.0,
            "replies": [
                {
                    "body": "You’re right- we can’t say for certain, but if something brings us comfort, what’s the point in questioning it, right? It’s something peaceful for me to hold onto when I need it.",
                    "author": "xterrababy",
                    "id": "flou5u1",
                    "parent_id": "t1_flot7mv",
                    "score": 2,
                    "created_utc": 1585345540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be fair, You do seem like an asshole. But I'd try to remember this comment the next time I think that way",
            "author": "PioneerExperience",
            "id": "flou32x",
            "parent_id": "t1_flosyd9",
            "score": 3,
            "created_utc": 1585345497.0,
            "replies": []
        },
        {
            "body": "Definately not an asshole. :)",
            "author": "redditgrl1140",
            "id": "flr77wd",
            "parent_id": "t1_flosyd9",
            "score": 1,
            "created_utc": 1585414400.0,
            "replies": []
        },
        {
            "body": "You’re right- we can’t say for certain, but if something brings us comfort, what’s the point in questioning it, right? It’s something peaceful for me to hold onto when I need it.",
            "author": "xterrababy",
            "id": "flou5u1",
            "parent_id": "t1_flot7mv",
            "score": 2,
            "created_utc": 1585345540.0,
            "replies": []
        }
    ]
}