{
    "title": "Honestly, I’m just looking for a hairstyle that doesn’t make me look like an egg",
    "post_id": "dzhwpp",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/dzhwpp/honestly_im_just_looking_for_a_hairstyle_that/",
    "author": "PeterP1998",
    "body": "",
    "url": "https://i.redd.it/3dtba2dqx0041.jpg",
    "score": 1125,
    "upvote_ratio": 0.98,
    "created_utc": 1574335339.0,
    "num_comments": 109,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You’re limited by your head shape, maybe grow that beard out a little. I have a big “square” head, so I get my beard cut into a taper; I get to hide all my chins inside it and use the beard’s edges to fake a jawline ;)",
            "author": "kalshassan",
            "id": "f87nsvq",
            "parent_id": "t3_dzhwpp",
            "score": 173,
            "created_utc": 1574338230.0,
            "replies": [
                {
                    "body": "*So tune in next week, for more tips on how to hide those extra pounds instead of doing something about it.*",
                    "author": "motodriveby",
                    "id": "f8844hv",
                    "parent_id": "t1_f87nsvq",
                    "score": -79,
                    "created_utc": 1574348230.0,
                    "replies": [
                        {
                            "body": "Don't be an ass. Looking good while working on your health helps motivate you to keep doing it.",
                            "author": "Kill_the_Acquitted",
                            "id": "f886gre",
                            "parent_id": "t1_f8844hv",
                            "score": 92,
                            "created_utc": 1574349402.0,
                            "replies": []
                        },
                        {
                            "body": "This is a hair styling subreddit, not a weight loss one",
                            "author": "Andyc3_",
                            "id": "f89q3vs",
                            "parent_id": "t1_f8844hv",
                            "score": 15,
                            "created_utc": 1574377545.0,
                            "replies": []
                        },
                        {
                            "body": "lol am i the only one who doesn't hate this response?\n\nalthough---yes, i  get it. not immediately pertinent for hairstyle advice--but also: not wrong\n\n&#x200B;\n\nEDIT: Something more structured--perhaps with some product. OP, you are lacking defining features--as another poster recommended, a beard may be helpful. otherwise  go here:  [https://www.reuzel.com/blogs/lookbook](https://www.reuzel.com/blogs/lookbook)\n\n&#x200B;\n\ni say \"Executive Contour\" with a beard--then you can refine as you go. best of luck, mate!\n\n&#x200B;\n\n&#x200B;\n\nfinal edit---have a laugh at these folks who are doing it all wrong:  [https://www.reddit.com/r/Justfuckmyshitup/](https://www.reddit.com/r/Justfuckmyshitup/)",
                            "author": "DuchessOfQuimm",
                            "id": "f8pkb7c",
                            "parent_id": "t1_f8844hv",
                            "score": 5,
                            "created_utc": 1574702889.0,
                            "replies": []
                        },
                        {
                            "body": "Thanks for that - there’s a subtle difference though. \n\nI’m overweight, I can do something about it (dieting, exercise etc.).\n\nYou, on the other hand, are a judgmental cunt, for which there’s no cure.  \n\nSorry about that, terminal diagnosis, maybe if you’re lucky MakeAWish will pick up your case.",
                            "author": "kalshassan",
                            "id": "faa1qk0",
                            "parent_id": "t1_f8844hv",
                            "score": 1,
                            "created_utc": 1575899741.0,
                            "replies": [
                                {
                                    "body": "You ironically judged their character after one snarky remark. Who’s the “judgmental cunt” now?",
                                    "author": "whycantibelinus",
                                    "id": "fajhdn4",
                                    "parent_id": "t1_faa1qk0",
                                    "score": 2,
                                    "created_utc": 1576137808.0,
                                    "replies": [
                                        {
                                            "body": "Still them, I’m confident in my convictions. :)",
                                            "author": "kalshassan",
                                            "id": "fajhqox",
                                            "parent_id": "t1_fajhdn4",
                                            "score": 1,
                                            "created_utc": 1576138312.0,
                                            "replies": [
                                                {
                                                    "body": "*judgment\n\nFTFY",
                                                    "author": "whycantibelinus",
                                                    "id": "fajhvmo",
                                                    "parent_id": "t1_fajhqox",
                                                    "score": 3,
                                                    "created_utc": 1576138503.0,
                                                    "replies": [
                                                        {
                                                            "body": "Keep going, this is fun :)",
                                                            "author": "kalshassan",
                                                            "id": "faji2rv",
                                                            "parent_id": "t1_fajhvmo",
                                                            "score": 1,
                                                            "created_utc": 1576138786.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f89y4ip",
                            "parent_id": "t1_f8844hv",
                            "score": -1,
                            "created_utc": 1574382858.0,
                            "replies": [
                                {
                                    "body": "It would though. Brining in those cheeks and jowls through weight loss would change this guy’s face from egg shaped to diamond shaped.",
                                    "author": "ZenmasterRob",
                                    "id": "f8a1nnp",
                                    "parent_id": "t1_f89y4ip",
                                    "score": 0,
                                    "created_utc": 1574385345.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's more the shape of your head rather than your hair style imo. Try to lose weight first",
            "author": null,
            "id": "f87l8kg",
            "parent_id": "t3_dzhwpp",
            "score": 398,
            "created_utc": 1574336189.0,
            "replies": [
                {
                    "body": "Yeah, I’m gonna be rejoining the gym next year to work on that, but even then, the “egghead” issue was always a thing, even before I got tubby",
                    "author": "PeterP1998",
                    "id": "f87lgel",
                    "parent_id": "t1_f87l8kg",
                    "score": 150,
                    "created_utc": 1574336366.0,
                    "replies": [
                        {
                            "body": "Planning on going to the gym is a good thing, but you can always start now, exercising is always good but losing weight starts and ends with how much your eating, this is something I didn't realize until I tried intermitted fasting and lost about 50 pounds without going to the gym.",
                            "author": "Reaveren",
                            "id": "f87po17",
                            "parent_id": "t1_f87lgel",
                            "score": 270,
                            "created_utc": 1574339577.0,
                            "replies": [
                                {
                                    "body": "I was going to say this too. The best time to start working on yourself was 5 years ago. The next best time is today. Get on it!",
                                    "author": "jayburd13",
                                    "id": "f87qqfa",
                                    "parent_id": "t1_f87po17",
                                    "score": 77,
                                    "created_utc": 1574340307.0,
                                    "replies": [
                                        {
                                            "body": "Completely agree with this. Work on diet first and foremost. I’m talking simple Calories In, Calories Out. There are a ton of supportive groups on reddit that help people out with this, as well as a bunch of apps you can use. Find one that fits your lifestyle and don’t make you miserable. Like with the gym, consistency is keep. Soon you’ll see those face gains!",
                                            "author": "relationship_padawan",
                                            "id": "f886ac7",
                                            "parent_id": "t1_f87qqfa",
                                            "score": 16,
                                            "created_utc": 1574349311.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Those who plan to start \"tomorrow\" generally fail. Its a lifestyle change that you need to commit to. After a while you wont even notice",
                                    "author": "ToonarmY1987",
                                    "id": "f87tdew",
                                    "parent_id": "t1_f87po17",
                                    "score": 30,
                                    "created_utc": 1574342039.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Go to r/loseit \n\nGreat community.",
                            "author": "Rotjenn",
                            "id": "f87ooh5",
                            "parent_id": "t1_f87lgel",
                            "score": 46,
                            "created_utc": 1574338868.0,
                            "replies": []
                        },
                        {
                            "body": "bro start now",
                            "author": "supmate8",
                            "id": "f87v2wu",
                            "parent_id": "t1_f87lgel",
                            "score": 30,
                            "created_utc": 1574343120.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f87qxa4",
                            "parent_id": "t1_f87lgel",
                            "score": 46,
                            "created_utc": 1574340439.0,
                            "replies": [
                                {
                                    "body": "Exactly, Go hit the gym today! You can do it man.",
                                    "author": "Peakingforever",
                                    "id": "f87r7eq",
                                    "parent_id": "t1_f87qxa4",
                                    "score": 18,
                                    "created_utc": 1574340627.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I'm not just gonna reiterate what everyone else says but a huge benefit of going in now is the gyms are much quieter.  Get to grips with all the machinery and get a program in place before all the New Years resolution people join in January.\n\nAfter years of \"ill do it next month\" I've doubled my strength since joining in Feb.",
                            "author": "powlesy6",
                            "id": "f87s6nh",
                            "parent_id": "t1_f87lgel",
                            "score": 19,
                            "created_utc": 1574341270.0,
                            "replies": []
                        },
                        {
                            "body": "Why wait till January when you have more than a month to do it. You're responsible for how you look at all times, and that means now.",
                            "author": "J4W8",
                            "id": "f883nrg",
                            "parent_id": "t1_f87lgel",
                            "score": 9,
                            "created_utc": 1574347990.0,
                            "replies": []
                        },
                        {
                            "body": "There is no reason not to start now. Leaving something for future you to do is probably going to end up getting postponed again if you haven't changed the way you think about doing shit you don't really want to do. Stop idolising planning and start trying and learning through experience. How?\n\n*Make incremental lifestyle changes.* Choose to be a slightly better version of yourself every day. What exactly should you do?\n\nJoin r/loseit, start counting calories and become aware of your diet. You don't have to start a \"diet\", cut what you eat in half or anything too extreme, or it's not going to last. Changing your body is a marathon, like sculpting a statue, you do it slowly, surely and *consistently.* So for the first week, just learn CICO - track how much you eat, how much you spend. 2nd week, start eating 300-500 calories less than you spend (stop drinking calories and try to minimise sugar as eating sugar makes you crave more sugar and it spirals into eating tons of not-very-nutritious calories - intermittent fasting can help if this is your case). Also start meal by drinking water, soup and eating vegetables and meat first - this will fill you up and make it easier not to eat too much rice/pasta/bread/potatoes etc. You'll make mistakes along the way, cheat days happen, but it's just a stumble in a long run - don't feel too bad or like you've ruined the progress you've made until then - shake it off and *keep going*.\n\nAfter a couple weeks you should be noticing some progress - time to start going to the gym. Hopefully this would be before 1st of January because the gym will be packed and you'll lack the freedom of taking your time. For routines a full body 3-day split would be good combined with cardio. If you struggle going to the gym though, try going *every single day*. You don't have to do anything when you get there, you can just do some stretches and warmup then leave, but you'll probably feel like you might as well do something since you're already there. Try some walking, running, cycling, anything. If you feel up to it, do some resistance training after.\n\nAnd *keep going*, because you *can* do it and it'll all be worth it. I won't spoil the tons of benefits and lifestyle improvements you will notice, guess you'll just have to see for yourself. ^(Also your hair looks great, no reason to change it and not the thing you should be focusing on, imo.)",
                            "author": "markzical",
                            "id": "f88ds42",
                            "parent_id": "t1_f87lgel",
                            "score": 3,
                            "created_utc": 1574352971.0,
                            "replies": []
                        },
                        {
                            "body": ">next year\n\nThat’s the problem",
                            "author": "v12a12",
                            "id": "f89qwv4",
                            "parent_id": "t1_f87lgel",
                            "score": 3,
                            "created_utc": 1574378113.0,
                            "replies": []
                        },
                        {
                            "body": "Try a better diet. Look over at /r/keto /r/fasting /r/intermittentfasting. People lose fat in different regions of their body at different time e.g. my belly fat was the last to go. Face fat was second to last. Gym is good for general fitness but not good for losing fat",
                            "author": "nobitey_",
                            "id": "f88mejq",
                            "parent_id": "t1_f87lgel",
                            "score": 2,
                            "created_utc": 1574357133.0,
                            "replies": []
                        },
                        {
                            "body": "Skip the gym and start eating healthier. You don't need to work out to lose weight",
                            "author": "Noxinator",
                            "id": "f891065",
                            "parent_id": "t1_f87lgel",
                            "score": 2,
                            "created_utc": 1574365063.0,
                            "replies": []
                        },
                        {
                            "body": "prob just had the baby face cheeks",
                            "author": "karuf",
                            "id": "f87yv7s",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574345378.0,
                            "replies": []
                        },
                        {
                            "body": "I see it. Long bangs is the only thing that I think can help, maybe a long undercut?",
                            "author": "Bushwhack92",
                            "id": "f87zzh2",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574346016.0,
                            "replies": []
                        },
                        {
                            "body": "Start now. There's a huge crowd in the beginning of the year. I know it demotivated me from going. I started going to the gym a month or so ago to get into the habit now.",
                            "author": null,
                            "id": "f88bpts",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574351990.0,
                            "replies": []
                        },
                        {
                            "body": "you should get a cut with slightly puffy sides",
                            "author": "shortdicknigga69",
                            "id": "f88c3ck",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574352173.0,
                            "replies": []
                        },
                        {
                            "body": "Fuck that, go now.",
                            "author": "Docktor_V",
                            "id": "f88ib3b",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574355160.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f88iz6l",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574355493.0,
                            "replies": [
                                {
                                    "body": "I spent way too long trying to figure out what twost meant before realizing it's just two stones. I agree completely though. Exercise is not at all necessary to lose weight.",
                                    "author": "dontsuckmydick",
                                    "id": "f89bfoo",
                                    "parent_id": "t1_f88iz6l",
                                    "score": 1,
                                    "created_utc": 1574370269.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Why next year and not like today?",
                            "author": "SirHawrk",
                            "id": "f88nhhe",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574357676.0,
                            "replies": []
                        },
                        {
                            "body": "You look good man. And eggs are delicious",
                            "author": "geekisdead",
                            "id": "f88zkn1",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574364338.0,
                            "replies": []
                        },
                        {
                            "body": "Don’t wait till next year, get to it now!",
                            "author": "Lidz0810",
                            "id": "f89fpuv",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574372302.0,
                            "replies": []
                        },
                        {
                            "body": "Gym is for bodybuilding, just eat less...",
                            "author": null,
                            "id": "f89qdya",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574377741.0,
                            "replies": []
                        },
                        {
                            "body": "Why wait till next year, start now if u actually want results",
                            "author": "jack1424552",
                            "id": "f89rl68",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574378600.0,
                            "replies": []
                        },
                        {
                            "body": "I know everyone is saying to start now and I use to say I would start later but I recommend you take on the mindset of \"If I will really commit to this it doesn't matter when I start. Success will come regardless of start date. Let me prove to myself I can do this by starting tomorrow.\" Goodluck bro",
                            "author": "jesuscrikey",
                            "id": "f8a07s3",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574384212.0,
                            "replies": []
                        },
                        {
                            "body": "why wait til next year if you aren’t happy now w how you look",
                            "author": "Blytpls",
                            "id": "f8a07wc",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574384214.0,
                            "replies": []
                        },
                        {
                            "body": "Losing weight is much more about your diet than going to the gym.",
                            "author": "Radinax",
                            "id": "f8a5avu",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574388121.0,
                            "replies": []
                        },
                        {
                            "body": "The gym won’t make you lose weight man, only thing the gym can do is burn calories (and not that many ultimately) and build muscle. Both supplement weight loss but ultimately it has to do with how much you’re eating. Download myfitnesspal and start tracking your calories. Start at like 2,000 at the most.",
                            "author": "Madhouse221",
                            "id": "f8af6xl",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574395607.0,
                            "replies": []
                        },
                        {
                            "body": "Not that you asked for advice on getting less tubby, but it's worth mentioning that you should ask your primary care doc about pharmacological interventions (like Phentermine) that you can combine with diet and exercise. I sound like a big pharma ad but I just learned about it as a med student and from what I'm seeing in patients + what I'm reading in trials, it generally helps a lot.",
                            "author": "RE90",
                            "id": "f8afg9y",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574395810.0,
                            "replies": []
                        },
                        {
                            "body": "The gym is for building muscles, weight is lost in the kitchen.",
                            "author": "TasteQlimax",
                            "id": "f8anhap",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574403201.0,
                            "replies": []
                        },
                        {
                            "body": "As others said, if you can grow the beard out to elongate your face a bit while you lose weight, do so. \n\nDon’t rejoin the gym next year, join it today. Stop eating like shit, and do little things to increase your calorie burn (park at the back of the parking lot, go for a walk at lunch/after work, etc). \n\nI was ‘uge. 305#, always tired, everything hurt (had a bad haircut, too lol). The Whole 30 made me aware of a lot of the bad food habits I had, and made some permanent change in how I eat. \n\nI got down to 220 with eating right (usually, though tacos are my weakness), cycling like a madman, cutting the drinking down, and sleeping better. Life changed, so I’ve put some pounds back on - 240 today, but I look and feel SO MUCH BETTER than I did when I was a big ol tubbo. \n\nCurrent hair style came after I’d lost weight, suggested by a woman that was once WAY outta my league... she’s long gone, but the better hair cut remains.",
                            "author": "TurboPrius",
                            "id": "f8b6wep",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574428944.0,
                            "replies": []
                        },
                        {
                            "body": "I know a lot of ppl already replied but you don’t need the gym to lose weight. Simply using CICO, and limiting cheat meals to maybe one day a week will help you drop a good amount of weight by January. \n\nYou’ll look better and the you in January will thank the you in November.",
                            "author": "cheezitschrist1",
                            "id": "f8cio5l",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574461072.0,
                            "replies": []
                        },
                        {
                            "body": "join the gym today.",
                            "author": "mouserat_18",
                            "id": "f8wetoz",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574889201.0,
                            "replies": []
                        },
                        {
                            "body": "Theres no such thing as next year or tomorrow when it comes to losing weight.",
                            "author": null,
                            "id": "f8813qw",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574346624.0,
                            "replies": []
                        },
                        {
                            "body": "The gym isn’t that useful for weight loss. It helps. But it’s minimal. It’s for *fitness*. \n\nYou can’t outrun your diet. Get a calorie tracker app and a food scale. Diligently track what you eat before you eat it and ensure you maintain around a 500 calorie per day deficit. \n\nYou cannot cheat thermodynamics. With an energy imbalance you *must* consume fat to survive and thus lose weight. \n\nI lost 130lb (300-170) without extreme dietary changes. Just tracking what I ate and becoming more aware of my choices.",
                            "author": "neanderthalman",
                            "id": "f88ttn2",
                            "parent_id": "t1_f87lgel",
                            "score": 1,
                            "created_utc": 1574361028.0,
                            "replies": []
                        },
                        {
                            "body": "Can't outrun a bad diet no matter how fast you go on the treadmill.\n\nIt is easier to start the new diet now.\n\nCut back on sugar, don't be scared of fat and protein.",
                            "author": "ACrusaderA",
                            "id": "f88uk98",
                            "parent_id": "t1_f87lgel",
                            "score": 0,
                            "created_utc": 1574361481.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is a hairstyle sub not a weight loss one /s\n\nJust saying that because people jumped all over someone else for saying the same thing but a bit more offensively.",
                    "author": "whycantibelinus",
                    "id": "fajhgac",
                    "parent_id": "t1_f87l8kg",
                    "score": 1,
                    "created_utc": 1576137910.0,
                    "replies": []
                },
                {
                    "body": "holy fuck :/",
                    "author": "raginpsycho",
                    "id": "f88jhqx",
                    "parent_id": "t1_f87l8kg",
                    "score": -3,
                    "created_utc": 1574355746.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Grow your sides long, it will balance out the shape of your head",
            "author": "ChowLetsGoBro",
            "id": "f87oq42",
            "parent_id": "t3_dzhwpp",
            "score": 30,
            "created_utc": 1574338903.0,
            "replies": [
                {
                    "body": "This.  Sides long, and hair on top even taller so your face appears symmetrical.  You have the hair for it.",
                    "author": null,
                    "id": "f88n2hg",
                    "parent_id": "t1_f87oq42",
                    "score": 5,
                    "created_utc": 1574357457.0,
                    "replies": [
                        {
                            "body": "Just go for the full out overcut. It’s like an undercut except your leave the side long and buzz the top with a sick fade to zero at the crown.",
                            "author": null,
                            "id": "f891xj6",
                            "parent_id": "t1_f88n2hg",
                            "score": 3,
                            "created_utc": 1574365537.0,
                            "replies": [
                                {
                                    "body": "🤣😂🤣😂🤣😂🤣Brooooo",
                                    "author": "ZenmasterRob",
                                    "id": "f8a1t52",
                                    "parent_id": "t1_f891xj6",
                                    "score": 2,
                                    "created_utc": 1574385462.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Grow your hair out a bit. You have the correct shape going, but it’s too short for the width of your cheeks/jaw.",
            "author": "adh26",
            "id": "f87pq47",
            "parent_id": "t3_dzhwpp",
            "score": 14,
            "created_utc": 1574339617.0,
            "replies": []
        },
        {
            "body": "Chris Pratt! You’re young and good looking. The hair is fine. Shed those extra pounds and eat better and you’ll be golden.",
            "author": "Iitigated",
            "id": "f87www0",
            "parent_id": "t3_dzhwpp",
            "score": 15,
            "created_utc": 1574344220.0,
            "replies": []
        },
        {
            "body": "Ask your barber for advice, maybe grow your longer and then give it a different shape than what you normally do. \n\nThat's the best I can tell you.",
            "author": "nightfury1714",
            "id": "f87ndjk",
            "parent_id": "t3_dzhwpp",
            "score": 15,
            "created_utc": 1574337906.0,
            "replies": [
                {
                    "body": "Leeching off of his post,but does it have to be a decently expensive barbershop to get advice or can it be from a freshly graduated barber?",
                    "author": "Guess_It_Will_Be",
                    "id": "f88squs",
                    "parent_id": "t1_f87ndjk",
                    "score": 2,
                    "created_utc": 1574360435.0,
                    "replies": [
                        {
                            "body": "Well, if your pocket allows, go to an expensive barber  once and talk to him about what would suit you (barbers tend to talk about their niche) then click a photo of the haircut and show it to less expensive ones. Or try young barbers, they tend to have good advice and avail his service.",
                            "author": "nightfury1714",
                            "id": "f88tmxu",
                            "parent_id": "t1_f88squs",
                            "score": 2,
                            "created_utc": 1574360913.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your hair looks pretty cool honestly. Try intermittent fasting, it’s a small but effective change that you will see almost immediately. Especially in the face.",
            "author": "throwawayllpp8899",
            "id": "f87t2hp",
            "parent_id": "t3_dzhwpp",
            "score": 14,
            "created_utc": 1574341845.0,
            "replies": []
        },
        {
            "body": "Honestly, there’s hardly anything wrong with your hair.",
            "author": "fireheart727",
            "id": "f87ubeu",
            "parent_id": "t3_dzhwpp",
            "score": 5,
            "created_utc": 1574342643.0,
            "replies": []
        },
        {
            "body": "Your hair actually makes you look less like an egg.",
            "author": "high_in_school",
            "id": "f886m84",
            "parent_id": "t3_dzhwpp",
            "score": 5,
            "created_utc": 1574349476.0,
            "replies": []
        },
        {
            "body": "Let the sides grow out instead of being tightly clipped. More of a fringe instead of the brushed back style will also help.",
            "author": "PJlong",
            "id": "f87td13",
            "parent_id": "t3_dzhwpp",
            "score": 3,
            "created_utc": 1574342032.0,
            "replies": []
        },
        {
            "body": "Grow your beard out. I think you'd kill it and having a beard really does do a lot to add shape to your face. I feel chinless without one!",
            "author": null,
            "id": "f87wgo5",
            "parent_id": "t3_dzhwpp",
            "score": 5,
            "created_utc": 1574343955.0,
            "replies": []
        },
        {
            "body": "Well if you don’t want to look like an egg id say you shouldn’t do the left hairstyle.",
            "author": "xbbz",
            "id": "f8845ia",
            "parent_id": "t3_dzhwpp",
            "score": 3,
            "created_utc": 1574348245.0,
            "replies": []
        },
        {
            "body": "bro you are funny, thats all that matters. Maybe you could wear you hair longer on the sides and so it gives a bit volume there.",
            "author": "mamaure",
            "id": "f889esb",
            "parent_id": "t3_dzhwpp",
            "score": 3,
            "created_utc": 1574350868.0,
            "replies": []
        },
        {
            "body": "First of all, I don't think you have an egg head.  You have cool eyes and a wide jaw - which is a good thing. Why don't you grow out your hair a bit and have a cool beard that accentuates the jaw?",
            "author": null,
            "id": "f88am97",
            "parent_id": "t3_dzhwpp",
            "score": 3,
            "created_utc": 1574351461.0,
            "replies": []
        },
        {
            "body": "Your hair looks good, but bro if you lose some weight I'm betting you'd be mad hot. Looks like you have good jaw structure, trim the fat and you're set.",
            "author": "nsfwalt707",
            "id": "f89cnth",
            "parent_id": "t3_dzhwpp",
            "score": 3,
            "created_utc": 1574370852.0,
            "replies": []
        },
        {
            "body": "Your hair is too short on the sides. You’re going to want a fuller even medium length hair cut to give the illusion like your head is more square shaped.",
            "author": "Whitejared17",
            "id": "f8847ae",
            "parent_id": "t3_dzhwpp",
            "score": 2,
            "created_utc": 1574348270.0,
            "replies": []
        },
        {
            "body": "Bob Ross hair would balance it out",
            "author": "itbybit",
            "id": "f8936wl",
            "parent_id": "t3_dzhwpp",
            "score": 2,
            "created_utc": 1574366175.0,
            "replies": [
                {
                    "body": "\"There is immense joy in just watching - watching all the little creatures in nature.\" - Bob Ross",
                    "author": "BobRossGod",
                    "id": "f8cni0x",
                    "parent_id": "t1_f8936wl",
                    "score": 1,
                    "created_utc": 1574464285.0,
                    "replies": [
                        {
                            "body": "Hello brethren",
                            "author": "itbybit",
                            "id": "f8cprl7",
                            "parent_id": "t1_f8cni0x",
                            "score": 1,
                            "created_utc": 1574465978.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That would require you to lose weight my friend. Nothing to do with your hair.",
            "author": "RadamanthysWyvern",
            "id": "f887sfp",
            "parent_id": "t3_dzhwpp",
            "score": 3,
            "created_utc": 1574350048.0,
            "replies": [
                {
                    "body": "Why be an ass? Ofcourse he can affect hair - by growing it longer",
                    "author": "Tsobe_RK",
                    "id": "f89a7t3",
                    "parent_id": "t1_f887sfp",
                    "score": -2,
                    "created_utc": 1574369696.0,
                    "replies": [
                        {
                            "body": "What? I'm not even being an ass. His head looks like an egg because he's overweight. I forget stating facts makes you an ass in 2019. Sorry if your feelings were hurt @op.",
                            "author": "RadamanthysWyvern",
                            "id": "f89awq3",
                            "parent_id": "t1_f89a7t3",
                            "score": 3,
                            "created_utc": 1574370021.0,
                            "replies": [
                                {
                                    "body": "Him being overweight doesn't negate the fact that a significant change in his hair can and will have a major impact in his appearance\n\nAlso it isnt always necessary to \"state facts\" if they do not bring any value to the topic. I could say you dont have any clue whatsoever about hair based on your initial comment but it does not help us here.",
                                    "author": "Tsobe_RK",
                                    "id": "f89b1nl",
                                    "parent_id": "t1_f89awq3",
                                    "score": -2,
                                    "created_utc": 1574370089.0,
                                    "replies": [
                                        {
                                            "body": "His hair looks fine. If anything he just needs a fade. Dropping down to the weight he should be will negate any egg shaped head he's got going on.\n\nYour edit doesn't even make sense. My \"fact\" was 100% relevant to the topic. He has an egg head shape because hes overweight. Lose weight = lose egg head shape. Its literally 2+2 pal.",
                                            "author": "RadamanthysWyvern",
                                            "id": "f89bct1",
                                            "parent_id": "t1_f89b1nl",
                                            "score": 2,
                                            "created_utc": 1574370232.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I think it’s more the shape of your head, my guy. But I don’t think it’s a bad thing",
            "author": "FogRaw358",
            "id": "f889ku0",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574350950.0,
            "replies": []
        },
        {
            "body": "\ngrow more hair on the back and sides",
            "author": "gonZAA24",
            "id": "f88hzcq",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574355002.0,
            "replies": []
        },
        {
            "body": "Why limit the egg inside of you?",
            "author": "immunologycls",
            "id": "f88nk4p",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574357712.0,
            "replies": []
        },
        {
            "body": "Go bald and grow a sweet mustache",
            "author": "ODST1556",
            "id": "f88ro64",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574359873.0,
            "replies": []
        },
        {
            "body": "Have you tried combing against the grain and using a stiff gel or concrete to keep it in place? I feel like some asymmetry would go a long way in breaking up the \"egg flow\".",
            "author": "nomnommish",
            "id": "f88s60a",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574360136.0,
            "replies": []
        },
        {
            "body": "I think your current haircut is actually fantastic. Try using some product or changing your product and you’ll be good",
            "author": "Obi-WanPierogi",
            "id": "f88s9zk",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574360195.0,
            "replies": []
        },
        {
            "body": "Hey, I just read that you will try o lose weight next year and here is my advice to you: If you want to really have the body of your dreams and achieve your goals it will take a good amount of time and the most important factor to it is persistence so if you never had a hard gym routine and a hard diet chances are you will get burned out pretty quickly so my suggestion is this: Propose yourself without lying a gym/diet routine you know you can accomplish without failing or procrastinating. Start slow and figure out what you wanna do from there.",
            "author": "josepriro",
            "id": "f88v9jv",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574361909.0,
            "replies": []
        },
        {
            "body": "Losing body fat will help. As for the hair i would let it  grow out. The volume on the sides will offset the shape of your face.",
            "author": "DickCheese_69",
            "id": "f88vmsn",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574362138.0,
            "replies": []
        },
        {
            "body": "Cut the carbs and eliminate added sugar drink lots of water and go for a walk that should do it don't wish to sound mean that literally helped me a while back",
            "author": "ostrieto17",
            "id": "f88ykzr",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574363824.0,
            "replies": []
        },
        {
            "body": "Fellow egg head here, beanies work wonders for me lol hats not so much, but in terms of a hairstyle, you’re guess is as good as mine, have you tried a bald look? After growing my hair out one last time I was gonna try bald",
            "author": null,
            "id": "f88zdt9",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574364240.0,
            "replies": []
        },
        {
            "body": "This is gunna hurt your feelings. But the best advice for the whole egg head thing would be 1 don’t shave your head. 2 grow a beard. 3 start walking 30 mins a day. Cause it looks like the egg thing is just extra weight in your face. Regardless good luck bro.\n\nEdit: when I say grow a beard I mean like a thick beard",
            "author": null,
            "id": "f88zky6",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574364343.0,
            "replies": []
        },
        {
            "body": "Hey bud. I would never think your head looks like egg if you wouldn't tell me. Be confident about it because you have no reason to be not!",
            "author": "Kocibohen",
            "id": "f891sbk",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574365464.0,
            "replies": []
        },
        {
            "body": "I have found my male egg twin!!!!!",
            "author": "rosenicolekey",
            "id": "f89fugo",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574372366.0,
            "replies": []
        },
        {
            "body": "I have a similar head shape. Definitely grow out the sides near the temples. You can still have it clean and short at the sideburns or around the ears and back, just don't get clippers up any further than your eyebrows",
            "author": "Sleambean",
            "id": "f89jwdx",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574374356.0,
            "replies": []
        },
        {
            "body": "r/egg_irl",
            "author": "TheFortyNinthRonin",
            "id": "f89madi",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574375556.0,
            "replies": []
        },
        {
            "body": "You look like Dave Mastiff. Grow a beard like him.",
            "author": "RottenPickle",
            "id": "f89q5z2",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574377585.0,
            "replies": []
        },
        {
            "body": "its just your bodyfat go lose weight now not next year you have potential to be really good looking actually",
            "author": null,
            "id": "f89rnid",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574378646.0,
            "replies": []
        },
        {
            "body": "Keep the smile atleast - a shape is emphasized or distracted but there’s nothing wrong with your face my friend that’s for sure :D",
            "author": "tacglp",
            "id": "f89xfa1",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574382339.0,
            "replies": []
        },
        {
            "body": "Just grow your hair longer I guess and try to reduce the fat on your face by performing facial exercises daily",
            "author": "TheChosenOne_101",
            "id": "f8a3a2q",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574386583.0,
            "replies": []
        },
        {
            "body": "Egg for scale",
            "author": "armchairplane",
            "id": "f8a4jst",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574387546.0,
            "replies": []
        },
        {
            "body": "the ideial hair for you now would be gym, then you can cut it",
            "author": "fabmarques21",
            "id": "f8a7j7v",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574389785.0,
            "replies": []
        },
        {
            "body": "Yeah grow the sides and let the top be longer than this. And the beard too. You actually don't look that bad",
            "author": "T3MP0_HS",
            "id": "f8acikf",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574393530.0,
            "replies": []
        },
        {
            "body": "I think you could pull off the *long surfer dude hair* sort of look.\n\nLet it go for a couple of years and keep your beard maintained.",
            "author": "b-cig",
            "id": "f8af92f",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574395654.0,
            "replies": []
        },
        {
            "body": "Your head is fine! Dont worry about it, try growing a beard if it bothers you, it gives some structure to the face",
            "author": "Loze58",
            "id": "f8ahsbs",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574397692.0,
            "replies": []
        },
        {
            "body": "Imo, you have balance the top half of your head with the bottom half. I would actually thin out your beard or shave it off completely because the bottom half of your head/face is the widest. For your head, I actually recommend growing out the sides. Again, to balance out the mass at the narrowest half of your head/face.",
            "author": "wet_nib811",
            "id": "f8kjudc",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574611898.0,
            "replies": []
        },
        {
            "body": "I would recommend experimenting on different side lengths. You have a square face shape so you need sides that aren't too long nor too short. Also you're doing great with the length on top. Try to go for a voluminous hairstyle like a quiff. Once you find the perfect middle ground you'll be set. Good luck!",
            "author": null,
            "id": "f8uhgs8",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574829574.0,
            "replies": []
        },
        {
            "body": "Well I think you’re a very handsome egg",
            "author": "rochesterjones",
            "id": "f9t6e4r",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1575610319.0,
            "replies": []
        },
        {
            "body": "I am sorry, but all u can do now is to make an attempt to catch a blue hedgehog.",
            "author": "L3onK1ng",
            "id": "f888ux6",
            "parent_id": "t3_dzhwpp",
            "score": 1,
            "created_utc": 1574350594.0,
            "replies": []
        },
        {
            "body": "Grow your beard, grow your hair, lose some weight and stop smiling",
            "author": "dave-house",
            "id": "f89br7m",
            "parent_id": "t3_dzhwpp",
            "score": 0,
            "created_utc": 1574370424.0,
            "replies": []
        },
        {
            "body": "You could go for a Chris Farley look. Kind of like a messy bowl cut.",
            "author": "FlowSoSlow",
            "id": "f87q091",
            "parent_id": "t3_dzhwpp",
            "score": -1,
            "created_utc": 1574339805.0,
            "replies": []
        },
        {
            "body": "Well there only one way to do that and it's not by getting a haircut.",
            "author": "stickydentures",
            "id": "f884jug",
            "parent_id": "t3_dzhwpp",
            "score": -1,
            "created_utc": 1574348447.0,
            "replies": []
        },
        {
            "body": "*So tune in next week, for more tips on how to hide those extra pounds instead of doing something about it.*",
            "author": "motodriveby",
            "id": "f8844hv",
            "parent_id": "t1_f87nsvq",
            "score": -79,
            "created_utc": 1574348230.0,
            "replies": [
                {
                    "body": "Don't be an ass. Looking good while working on your health helps motivate you to keep doing it.",
                    "author": "Kill_the_Acquitted",
                    "id": "f886gre",
                    "parent_id": "t1_f8844hv",
                    "score": 92,
                    "created_utc": 1574349402.0,
                    "replies": []
                },
                {
                    "body": "This is a hair styling subreddit, not a weight loss one",
                    "author": "Andyc3_",
                    "id": "f89q3vs",
                    "parent_id": "t1_f8844hv",
                    "score": 15,
                    "created_utc": 1574377545.0,
                    "replies": []
                },
                {
                    "body": "lol am i the only one who doesn't hate this response?\n\nalthough---yes, i  get it. not immediately pertinent for hairstyle advice--but also: not wrong\n\n&#x200B;\n\nEDIT: Something more structured--perhaps with some product. OP, you are lacking defining features--as another poster recommended, a beard may be helpful. otherwise  go here:  [https://www.reuzel.com/blogs/lookbook](https://www.reuzel.com/blogs/lookbook)\n\n&#x200B;\n\ni say \"Executive Contour\" with a beard--then you can refine as you go. best of luck, mate!\n\n&#x200B;\n\n&#x200B;\n\nfinal edit---have a laugh at these folks who are doing it all wrong:  [https://www.reddit.com/r/Justfuckmyshitup/](https://www.reddit.com/r/Justfuckmyshitup/)",
                    "author": "DuchessOfQuimm",
                    "id": "f8pkb7c",
                    "parent_id": "t1_f8844hv",
                    "score": 5,
                    "created_utc": 1574702889.0,
                    "replies": []
                },
                {
                    "body": "Thanks for that - there’s a subtle difference though. \n\nI’m overweight, I can do something about it (dieting, exercise etc.).\n\nYou, on the other hand, are a judgmental cunt, for which there’s no cure.  \n\nSorry about that, terminal diagnosis, maybe if you’re lucky MakeAWish will pick up your case.",
                    "author": "kalshassan",
                    "id": "faa1qk0",
                    "parent_id": "t1_f8844hv",
                    "score": 1,
                    "created_utc": 1575899741.0,
                    "replies": [
                        {
                            "body": "You ironically judged their character after one snarky remark. Who’s the “judgmental cunt” now?",
                            "author": "whycantibelinus",
                            "id": "fajhdn4",
                            "parent_id": "t1_faa1qk0",
                            "score": 2,
                            "created_utc": 1576137808.0,
                            "replies": [
                                {
                                    "body": "Still them, I’m confident in my convictions. :)",
                                    "author": "kalshassan",
                                    "id": "fajhqox",
                                    "parent_id": "t1_fajhdn4",
                                    "score": 1,
                                    "created_utc": 1576138312.0,
                                    "replies": [
                                        {
                                            "body": "*judgment\n\nFTFY",
                                            "author": "whycantibelinus",
                                            "id": "fajhvmo",
                                            "parent_id": "t1_fajhqox",
                                            "score": 3,
                                            "created_utc": 1576138503.0,
                                            "replies": [
                                                {
                                                    "body": "Keep going, this is fun :)",
                                                    "author": "kalshassan",
                                                    "id": "faji2rv",
                                                    "parent_id": "t1_fajhvmo",
                                                    "score": 1,
                                                    "created_utc": 1576138786.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f89y4ip",
                    "parent_id": "t1_f8844hv",
                    "score": -1,
                    "created_utc": 1574382858.0,
                    "replies": [
                        {
                            "body": "It would though. Brining in those cheeks and jowls through weight loss would change this guy’s face from egg shaped to diamond shaped.",
                            "author": "ZenmasterRob",
                            "id": "f8a1nnp",
                            "parent_id": "t1_f89y4ip",
                            "score": 0,
                            "created_utc": 1574385345.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I’m gonna be rejoining the gym next year to work on that, but even then, the “egghead” issue was always a thing, even before I got tubby",
            "author": "PeterP1998",
            "id": "f87lgel",
            "parent_id": "t1_f87l8kg",
            "score": 150,
            "created_utc": 1574336366.0,
            "replies": [
                {
                    "body": "Planning on going to the gym is a good thing, but you can always start now, exercising is always good but losing weight starts and ends with how much your eating, this is something I didn't realize until I tried intermitted fasting and lost about 50 pounds without going to the gym.",
                    "author": "Reaveren",
                    "id": "f87po17",
                    "parent_id": "t1_f87lgel",
                    "score": 270,
                    "created_utc": 1574339577.0,
                    "replies": [
                        {
                            "body": "I was going to say this too. The best time to start working on yourself was 5 years ago. The next best time is today. Get on it!",
                            "author": "jayburd13",
                            "id": "f87qqfa",
                            "parent_id": "t1_f87po17",
                            "score": 77,
                            "created_utc": 1574340307.0,
                            "replies": [
                                {
                                    "body": "Completely agree with this. Work on diet first and foremost. I’m talking simple Calories In, Calories Out. There are a ton of supportive groups on reddit that help people out with this, as well as a bunch of apps you can use. Find one that fits your lifestyle and don’t make you miserable. Like with the gym, consistency is keep. Soon you’ll see those face gains!",
                                    "author": "relationship_padawan",
                                    "id": "f886ac7",
                                    "parent_id": "t1_f87qqfa",
                                    "score": 16,
                                    "created_utc": 1574349311.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Those who plan to start \"tomorrow\" generally fail. Its a lifestyle change that you need to commit to. After a while you wont even notice",
                            "author": "ToonarmY1987",
                            "id": "f87tdew",
                            "parent_id": "t1_f87po17",
                            "score": 30,
                            "created_utc": 1574342039.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Go to r/loseit \n\nGreat community.",
                    "author": "Rotjenn",
                    "id": "f87ooh5",
                    "parent_id": "t1_f87lgel",
                    "score": 46,
                    "created_utc": 1574338868.0,
                    "replies": []
                },
                {
                    "body": "bro start now",
                    "author": "supmate8",
                    "id": "f87v2wu",
                    "parent_id": "t1_f87lgel",
                    "score": 30,
                    "created_utc": 1574343120.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f87qxa4",
                    "parent_id": "t1_f87lgel",
                    "score": 46,
                    "created_utc": 1574340439.0,
                    "replies": [
                        {
                            "body": "Exactly, Go hit the gym today! You can do it man.",
                            "author": "Peakingforever",
                            "id": "f87r7eq",
                            "parent_id": "t1_f87qxa4",
                            "score": 18,
                            "created_utc": 1574340627.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm not just gonna reiterate what everyone else says but a huge benefit of going in now is the gyms are much quieter.  Get to grips with all the machinery and get a program in place before all the New Years resolution people join in January.\n\nAfter years of \"ill do it next month\" I've doubled my strength since joining in Feb.",
                    "author": "powlesy6",
                    "id": "f87s6nh",
                    "parent_id": "t1_f87lgel",
                    "score": 19,
                    "created_utc": 1574341270.0,
                    "replies": []
                },
                {
                    "body": "Why wait till January when you have more than a month to do it. You're responsible for how you look at all times, and that means now.",
                    "author": "J4W8",
                    "id": "f883nrg",
                    "parent_id": "t1_f87lgel",
                    "score": 9,
                    "created_utc": 1574347990.0,
                    "replies": []
                },
                {
                    "body": "There is no reason not to start now. Leaving something for future you to do is probably going to end up getting postponed again if you haven't changed the way you think about doing shit you don't really want to do. Stop idolising planning and start trying and learning through experience. How?\n\n*Make incremental lifestyle changes.* Choose to be a slightly better version of yourself every day. What exactly should you do?\n\nJoin r/loseit, start counting calories and become aware of your diet. You don't have to start a \"diet\", cut what you eat in half or anything too extreme, or it's not going to last. Changing your body is a marathon, like sculpting a statue, you do it slowly, surely and *consistently.* So for the first week, just learn CICO - track how much you eat, how much you spend. 2nd week, start eating 300-500 calories less than you spend (stop drinking calories and try to minimise sugar as eating sugar makes you crave more sugar and it spirals into eating tons of not-very-nutritious calories - intermittent fasting can help if this is your case). Also start meal by drinking water, soup and eating vegetables and meat first - this will fill you up and make it easier not to eat too much rice/pasta/bread/potatoes etc. You'll make mistakes along the way, cheat days happen, but it's just a stumble in a long run - don't feel too bad or like you've ruined the progress you've made until then - shake it off and *keep going*.\n\nAfter a couple weeks you should be noticing some progress - time to start going to the gym. Hopefully this would be before 1st of January because the gym will be packed and you'll lack the freedom of taking your time. For routines a full body 3-day split would be good combined with cardio. If you struggle going to the gym though, try going *every single day*. You don't have to do anything when you get there, you can just do some stretches and warmup then leave, but you'll probably feel like you might as well do something since you're already there. Try some walking, running, cycling, anything. If you feel up to it, do some resistance training after.\n\nAnd *keep going*, because you *can* do it and it'll all be worth it. I won't spoil the tons of benefits and lifestyle improvements you will notice, guess you'll just have to see for yourself. ^(Also your hair looks great, no reason to change it and not the thing you should be focusing on, imo.)",
                    "author": "markzical",
                    "id": "f88ds42",
                    "parent_id": "t1_f87lgel",
                    "score": 3,
                    "created_utc": 1574352971.0,
                    "replies": []
                },
                {
                    "body": ">next year\n\nThat’s the problem",
                    "author": "v12a12",
                    "id": "f89qwv4",
                    "parent_id": "t1_f87lgel",
                    "score": 3,
                    "created_utc": 1574378113.0,
                    "replies": []
                },
                {
                    "body": "Try a better diet. Look over at /r/keto /r/fasting /r/intermittentfasting. People lose fat in different regions of their body at different time e.g. my belly fat was the last to go. Face fat was second to last. Gym is good for general fitness but not good for losing fat",
                    "author": "nobitey_",
                    "id": "f88mejq",
                    "parent_id": "t1_f87lgel",
                    "score": 2,
                    "created_utc": 1574357133.0,
                    "replies": []
                },
                {
                    "body": "Skip the gym and start eating healthier. You don't need to work out to lose weight",
                    "author": "Noxinator",
                    "id": "f891065",
                    "parent_id": "t1_f87lgel",
                    "score": 2,
                    "created_utc": 1574365063.0,
                    "replies": []
                },
                {
                    "body": "prob just had the baby face cheeks",
                    "author": "karuf",
                    "id": "f87yv7s",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574345378.0,
                    "replies": []
                },
                {
                    "body": "I see it. Long bangs is the only thing that I think can help, maybe a long undercut?",
                    "author": "Bushwhack92",
                    "id": "f87zzh2",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574346016.0,
                    "replies": []
                },
                {
                    "body": "Start now. There's a huge crowd in the beginning of the year. I know it demotivated me from going. I started going to the gym a month or so ago to get into the habit now.",
                    "author": null,
                    "id": "f88bpts",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574351990.0,
                    "replies": []
                },
                {
                    "body": "you should get a cut with slightly puffy sides",
                    "author": "shortdicknigga69",
                    "id": "f88c3ck",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574352173.0,
                    "replies": []
                },
                {
                    "body": "Fuck that, go now.",
                    "author": "Docktor_V",
                    "id": "f88ib3b",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574355160.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f88iz6l",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574355493.0,
                    "replies": [
                        {
                            "body": "I spent way too long trying to figure out what twost meant before realizing it's just two stones. I agree completely though. Exercise is not at all necessary to lose weight.",
                            "author": "dontsuckmydick",
                            "id": "f89bfoo",
                            "parent_id": "t1_f88iz6l",
                            "score": 1,
                            "created_utc": 1574370269.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why next year and not like today?",
                    "author": "SirHawrk",
                    "id": "f88nhhe",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574357676.0,
                    "replies": []
                },
                {
                    "body": "You look good man. And eggs are delicious",
                    "author": "geekisdead",
                    "id": "f88zkn1",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574364338.0,
                    "replies": []
                },
                {
                    "body": "Don’t wait till next year, get to it now!",
                    "author": "Lidz0810",
                    "id": "f89fpuv",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574372302.0,
                    "replies": []
                },
                {
                    "body": "Gym is for bodybuilding, just eat less...",
                    "author": null,
                    "id": "f89qdya",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574377741.0,
                    "replies": []
                },
                {
                    "body": "Why wait till next year, start now if u actually want results",
                    "author": "jack1424552",
                    "id": "f89rl68",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574378600.0,
                    "replies": []
                },
                {
                    "body": "I know everyone is saying to start now and I use to say I would start later but I recommend you take on the mindset of \"If I will really commit to this it doesn't matter when I start. Success will come regardless of start date. Let me prove to myself I can do this by starting tomorrow.\" Goodluck bro",
                    "author": "jesuscrikey",
                    "id": "f8a07s3",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574384212.0,
                    "replies": []
                },
                {
                    "body": "why wait til next year if you aren’t happy now w how you look",
                    "author": "Blytpls",
                    "id": "f8a07wc",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574384214.0,
                    "replies": []
                },
                {
                    "body": "Losing weight is much more about your diet than going to the gym.",
                    "author": "Radinax",
                    "id": "f8a5avu",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574388121.0,
                    "replies": []
                },
                {
                    "body": "The gym won’t make you lose weight man, only thing the gym can do is burn calories (and not that many ultimately) and build muscle. Both supplement weight loss but ultimately it has to do with how much you’re eating. Download myfitnesspal and start tracking your calories. Start at like 2,000 at the most.",
                    "author": "Madhouse221",
                    "id": "f8af6xl",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574395607.0,
                    "replies": []
                },
                {
                    "body": "Not that you asked for advice on getting less tubby, but it's worth mentioning that you should ask your primary care doc about pharmacological interventions (like Phentermine) that you can combine with diet and exercise. I sound like a big pharma ad but I just learned about it as a med student and from what I'm seeing in patients + what I'm reading in trials, it generally helps a lot.",
                    "author": "RE90",
                    "id": "f8afg9y",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574395810.0,
                    "replies": []
                },
                {
                    "body": "The gym is for building muscles, weight is lost in the kitchen.",
                    "author": "TasteQlimax",
                    "id": "f8anhap",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574403201.0,
                    "replies": []
                },
                {
                    "body": "As others said, if you can grow the beard out to elongate your face a bit while you lose weight, do so. \n\nDon’t rejoin the gym next year, join it today. Stop eating like shit, and do little things to increase your calorie burn (park at the back of the parking lot, go for a walk at lunch/after work, etc). \n\nI was ‘uge. 305#, always tired, everything hurt (had a bad haircut, too lol). The Whole 30 made me aware of a lot of the bad food habits I had, and made some permanent change in how I eat. \n\nI got down to 220 with eating right (usually, though tacos are my weakness), cycling like a madman, cutting the drinking down, and sleeping better. Life changed, so I’ve put some pounds back on - 240 today, but I look and feel SO MUCH BETTER than I did when I was a big ol tubbo. \n\nCurrent hair style came after I’d lost weight, suggested by a woman that was once WAY outta my league... she’s long gone, but the better hair cut remains.",
                    "author": "TurboPrius",
                    "id": "f8b6wep",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574428944.0,
                    "replies": []
                },
                {
                    "body": "I know a lot of ppl already replied but you don’t need the gym to lose weight. Simply using CICO, and limiting cheat meals to maybe one day a week will help you drop a good amount of weight by January. \n\nYou’ll look better and the you in January will thank the you in November.",
                    "author": "cheezitschrist1",
                    "id": "f8cio5l",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574461072.0,
                    "replies": []
                },
                {
                    "body": "join the gym today.",
                    "author": "mouserat_18",
                    "id": "f8wetoz",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574889201.0,
                    "replies": []
                },
                {
                    "body": "Theres no such thing as next year or tomorrow when it comes to losing weight.",
                    "author": null,
                    "id": "f8813qw",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574346624.0,
                    "replies": []
                },
                {
                    "body": "The gym isn’t that useful for weight loss. It helps. But it’s minimal. It’s for *fitness*. \n\nYou can’t outrun your diet. Get a calorie tracker app and a food scale. Diligently track what you eat before you eat it and ensure you maintain around a 500 calorie per day deficit. \n\nYou cannot cheat thermodynamics. With an energy imbalance you *must* consume fat to survive and thus lose weight. \n\nI lost 130lb (300-170) without extreme dietary changes. Just tracking what I ate and becoming more aware of my choices.",
                    "author": "neanderthalman",
                    "id": "f88ttn2",
                    "parent_id": "t1_f87lgel",
                    "score": 1,
                    "created_utc": 1574361028.0,
                    "replies": []
                },
                {
                    "body": "Can't outrun a bad diet no matter how fast you go on the treadmill.\n\nIt is easier to start the new diet now.\n\nCut back on sugar, don't be scared of fat and protein.",
                    "author": "ACrusaderA",
                    "id": "f88uk98",
                    "parent_id": "t1_f87lgel",
                    "score": 0,
                    "created_utc": 1574361481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a hairstyle sub not a weight loss one /s\n\nJust saying that because people jumped all over someone else for saying the same thing but a bit more offensively.",
            "author": "whycantibelinus",
            "id": "fajhgac",
            "parent_id": "t1_f87l8kg",
            "score": 1,
            "created_utc": 1576137910.0,
            "replies": []
        },
        {
            "body": "holy fuck :/",
            "author": "raginpsycho",
            "id": "f88jhqx",
            "parent_id": "t1_f87l8kg",
            "score": -3,
            "created_utc": 1574355746.0,
            "replies": []
        },
        {
            "body": "This.  Sides long, and hair on top even taller so your face appears symmetrical.  You have the hair for it.",
            "author": null,
            "id": "f88n2hg",
            "parent_id": "t1_f87oq42",
            "score": 5,
            "created_utc": 1574357457.0,
            "replies": [
                {
                    "body": "Just go for the full out overcut. It’s like an undercut except your leave the side long and buzz the top with a sick fade to zero at the crown.",
                    "author": null,
                    "id": "f891xj6",
                    "parent_id": "t1_f88n2hg",
                    "score": 3,
                    "created_utc": 1574365537.0,
                    "replies": [
                        {
                            "body": "🤣😂🤣😂🤣😂🤣Brooooo",
                            "author": "ZenmasterRob",
                            "id": "f8a1t52",
                            "parent_id": "t1_f891xj6",
                            "score": 2,
                            "created_utc": 1574385462.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Leeching off of his post,but does it have to be a decently expensive barbershop to get advice or can it be from a freshly graduated barber?",
            "author": "Guess_It_Will_Be",
            "id": "f88squs",
            "parent_id": "t1_f87ndjk",
            "score": 2,
            "created_utc": 1574360435.0,
            "replies": [
                {
                    "body": "Well, if your pocket allows, go to an expensive barber  once and talk to him about what would suit you (barbers tend to talk about their niche) then click a photo of the haircut and show it to less expensive ones. Or try young barbers, they tend to have good advice and avail his service.",
                    "author": "nightfury1714",
                    "id": "f88tmxu",
                    "parent_id": "t1_f88squs",
                    "score": 2,
                    "created_utc": 1574360913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"There is immense joy in just watching - watching all the little creatures in nature.\" - Bob Ross",
            "author": "BobRossGod",
            "id": "f8cni0x",
            "parent_id": "t1_f8936wl",
            "score": 1,
            "created_utc": 1574464285.0,
            "replies": [
                {
                    "body": "Hello brethren",
                    "author": "itbybit",
                    "id": "f8cprl7",
                    "parent_id": "t1_f8cni0x",
                    "score": 1,
                    "created_utc": 1574465978.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why be an ass? Ofcourse he can affect hair - by growing it longer",
            "author": "Tsobe_RK",
            "id": "f89a7t3",
            "parent_id": "t1_f887sfp",
            "score": -2,
            "created_utc": 1574369696.0,
            "replies": [
                {
                    "body": "What? I'm not even being an ass. His head looks like an egg because he's overweight. I forget stating facts makes you an ass in 2019. Sorry if your feelings were hurt @op.",
                    "author": "RadamanthysWyvern",
                    "id": "f89awq3",
                    "parent_id": "t1_f89a7t3",
                    "score": 3,
                    "created_utc": 1574370021.0,
                    "replies": [
                        {
                            "body": "Him being overweight doesn't negate the fact that a significant change in his hair can and will have a major impact in his appearance\n\nAlso it isnt always necessary to \"state facts\" if they do not bring any value to the topic. I could say you dont have any clue whatsoever about hair based on your initial comment but it does not help us here.",
                            "author": "Tsobe_RK",
                            "id": "f89b1nl",
                            "parent_id": "t1_f89awq3",
                            "score": -2,
                            "created_utc": 1574370089.0,
                            "replies": [
                                {
                                    "body": "His hair looks fine. If anything he just needs a fade. Dropping down to the weight he should be will negate any egg shaped head he's got going on.\n\nYour edit doesn't even make sense. My \"fact\" was 100% relevant to the topic. He has an egg head shape because hes overweight. Lose weight = lose egg head shape. Its literally 2+2 pal.",
                                    "author": "RadamanthysWyvern",
                                    "id": "f89bct1",
                                    "parent_id": "t1_f89b1nl",
                                    "score": 2,
                                    "created_utc": 1574370232.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't be an ass. Looking good while working on your health helps motivate you to keep doing it.",
            "author": "Kill_the_Acquitted",
            "id": "f886gre",
            "parent_id": "t1_f8844hv",
            "score": 92,
            "created_utc": 1574349402.0,
            "replies": []
        },
        {
            "body": "This is a hair styling subreddit, not a weight loss one",
            "author": "Andyc3_",
            "id": "f89q3vs",
            "parent_id": "t1_f8844hv",
            "score": 15,
            "created_utc": 1574377545.0,
            "replies": []
        },
        {
            "body": "lol am i the only one who doesn't hate this response?\n\nalthough---yes, i  get it. not immediately pertinent for hairstyle advice--but also: not wrong\n\n&#x200B;\n\nEDIT: Something more structured--perhaps with some product. OP, you are lacking defining features--as another poster recommended, a beard may be helpful. otherwise  go here:  [https://www.reuzel.com/blogs/lookbook](https://www.reuzel.com/blogs/lookbook)\n\n&#x200B;\n\ni say \"Executive Contour\" with a beard--then you can refine as you go. best of luck, mate!\n\n&#x200B;\n\n&#x200B;\n\nfinal edit---have a laugh at these folks who are doing it all wrong:  [https://www.reddit.com/r/Justfuckmyshitup/](https://www.reddit.com/r/Justfuckmyshitup/)",
            "author": "DuchessOfQuimm",
            "id": "f8pkb7c",
            "parent_id": "t1_f8844hv",
            "score": 5,
            "created_utc": 1574702889.0,
            "replies": []
        },
        {
            "body": "Thanks for that - there’s a subtle difference though. \n\nI’m overweight, I can do something about it (dieting, exercise etc.).\n\nYou, on the other hand, are a judgmental cunt, for which there’s no cure.  \n\nSorry about that, terminal diagnosis, maybe if you’re lucky MakeAWish will pick up your case.",
            "author": "kalshassan",
            "id": "faa1qk0",
            "parent_id": "t1_f8844hv",
            "score": 1,
            "created_utc": 1575899741.0,
            "replies": [
                {
                    "body": "You ironically judged their character after one snarky remark. Who’s the “judgmental cunt” now?",
                    "author": "whycantibelinus",
                    "id": "fajhdn4",
                    "parent_id": "t1_faa1qk0",
                    "score": 2,
                    "created_utc": 1576137808.0,
                    "replies": [
                        {
                            "body": "Still them, I’m confident in my convictions. :)",
                            "author": "kalshassan",
                            "id": "fajhqox",
                            "parent_id": "t1_fajhdn4",
                            "score": 1,
                            "created_utc": 1576138312.0,
                            "replies": [
                                {
                                    "body": "*judgment\n\nFTFY",
                                    "author": "whycantibelinus",
                                    "id": "fajhvmo",
                                    "parent_id": "t1_fajhqox",
                                    "score": 3,
                                    "created_utc": 1576138503.0,
                                    "replies": [
                                        {
                                            "body": "Keep going, this is fun :)",
                                            "author": "kalshassan",
                                            "id": "faji2rv",
                                            "parent_id": "t1_fajhvmo",
                                            "score": 1,
                                            "created_utc": 1576138786.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f89y4ip",
            "parent_id": "t1_f8844hv",
            "score": -1,
            "created_utc": 1574382858.0,
            "replies": [
                {
                    "body": "It would though. Brining in those cheeks and jowls through weight loss would change this guy’s face from egg shaped to diamond shaped.",
                    "author": "ZenmasterRob",
                    "id": "f8a1nnp",
                    "parent_id": "t1_f89y4ip",
                    "score": 0,
                    "created_utc": 1574385345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Planning on going to the gym is a good thing, but you can always start now, exercising is always good but losing weight starts and ends with how much your eating, this is something I didn't realize until I tried intermitted fasting and lost about 50 pounds without going to the gym.",
            "author": "Reaveren",
            "id": "f87po17",
            "parent_id": "t1_f87lgel",
            "score": 270,
            "created_utc": 1574339577.0,
            "replies": [
                {
                    "body": "I was going to say this too. The best time to start working on yourself was 5 years ago. The next best time is today. Get on it!",
                    "author": "jayburd13",
                    "id": "f87qqfa",
                    "parent_id": "t1_f87po17",
                    "score": 77,
                    "created_utc": 1574340307.0,
                    "replies": [
                        {
                            "body": "Completely agree with this. Work on diet first and foremost. I’m talking simple Calories In, Calories Out. There are a ton of supportive groups on reddit that help people out with this, as well as a bunch of apps you can use. Find one that fits your lifestyle and don’t make you miserable. Like with the gym, consistency is keep. Soon you’ll see those face gains!",
                            "author": "relationship_padawan",
                            "id": "f886ac7",
                            "parent_id": "t1_f87qqfa",
                            "score": 16,
                            "created_utc": 1574349311.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Those who plan to start \"tomorrow\" generally fail. Its a lifestyle change that you need to commit to. After a while you wont even notice",
                    "author": "ToonarmY1987",
                    "id": "f87tdew",
                    "parent_id": "t1_f87po17",
                    "score": 30,
                    "created_utc": 1574342039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go to r/loseit \n\nGreat community.",
            "author": "Rotjenn",
            "id": "f87ooh5",
            "parent_id": "t1_f87lgel",
            "score": 46,
            "created_utc": 1574338868.0,
            "replies": []
        },
        {
            "body": "bro start now",
            "author": "supmate8",
            "id": "f87v2wu",
            "parent_id": "t1_f87lgel",
            "score": 30,
            "created_utc": 1574343120.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f87qxa4",
            "parent_id": "t1_f87lgel",
            "score": 46,
            "created_utc": 1574340439.0,
            "replies": [
                {
                    "body": "Exactly, Go hit the gym today! You can do it man.",
                    "author": "Peakingforever",
                    "id": "f87r7eq",
                    "parent_id": "t1_f87qxa4",
                    "score": 18,
                    "created_utc": 1574340627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm not just gonna reiterate what everyone else says but a huge benefit of going in now is the gyms are much quieter.  Get to grips with all the machinery and get a program in place before all the New Years resolution people join in January.\n\nAfter years of \"ill do it next month\" I've doubled my strength since joining in Feb.",
            "author": "powlesy6",
            "id": "f87s6nh",
            "parent_id": "t1_f87lgel",
            "score": 19,
            "created_utc": 1574341270.0,
            "replies": []
        },
        {
            "body": "Why wait till January when you have more than a month to do it. You're responsible for how you look at all times, and that means now.",
            "author": "J4W8",
            "id": "f883nrg",
            "parent_id": "t1_f87lgel",
            "score": 9,
            "created_utc": 1574347990.0,
            "replies": []
        },
        {
            "body": "There is no reason not to start now. Leaving something for future you to do is probably going to end up getting postponed again if you haven't changed the way you think about doing shit you don't really want to do. Stop idolising planning and start trying and learning through experience. How?\n\n*Make incremental lifestyle changes.* Choose to be a slightly better version of yourself every day. What exactly should you do?\n\nJoin r/loseit, start counting calories and become aware of your diet. You don't have to start a \"diet\", cut what you eat in half or anything too extreme, or it's not going to last. Changing your body is a marathon, like sculpting a statue, you do it slowly, surely and *consistently.* So for the first week, just learn CICO - track how much you eat, how much you spend. 2nd week, start eating 300-500 calories less than you spend (stop drinking calories and try to minimise sugar as eating sugar makes you crave more sugar and it spirals into eating tons of not-very-nutritious calories - intermittent fasting can help if this is your case). Also start meal by drinking water, soup and eating vegetables and meat first - this will fill you up and make it easier not to eat too much rice/pasta/bread/potatoes etc. You'll make mistakes along the way, cheat days happen, but it's just a stumble in a long run - don't feel too bad or like you've ruined the progress you've made until then - shake it off and *keep going*.\n\nAfter a couple weeks you should be noticing some progress - time to start going to the gym. Hopefully this would be before 1st of January because the gym will be packed and you'll lack the freedom of taking your time. For routines a full body 3-day split would be good combined with cardio. If you struggle going to the gym though, try going *every single day*. You don't have to do anything when you get there, you can just do some stretches and warmup then leave, but you'll probably feel like you might as well do something since you're already there. Try some walking, running, cycling, anything. If you feel up to it, do some resistance training after.\n\nAnd *keep going*, because you *can* do it and it'll all be worth it. I won't spoil the tons of benefits and lifestyle improvements you will notice, guess you'll just have to see for yourself. ^(Also your hair looks great, no reason to change it and not the thing you should be focusing on, imo.)",
            "author": "markzical",
            "id": "f88ds42",
            "parent_id": "t1_f87lgel",
            "score": 3,
            "created_utc": 1574352971.0,
            "replies": []
        },
        {
            "body": ">next year\n\nThat’s the problem",
            "author": "v12a12",
            "id": "f89qwv4",
            "parent_id": "t1_f87lgel",
            "score": 3,
            "created_utc": 1574378113.0,
            "replies": []
        },
        {
            "body": "Try a better diet. Look over at /r/keto /r/fasting /r/intermittentfasting. People lose fat in different regions of their body at different time e.g. my belly fat was the last to go. Face fat was second to last. Gym is good for general fitness but not good for losing fat",
            "author": "nobitey_",
            "id": "f88mejq",
            "parent_id": "t1_f87lgel",
            "score": 2,
            "created_utc": 1574357133.0,
            "replies": []
        },
        {
            "body": "Skip the gym and start eating healthier. You don't need to work out to lose weight",
            "author": "Noxinator",
            "id": "f891065",
            "parent_id": "t1_f87lgel",
            "score": 2,
            "created_utc": 1574365063.0,
            "replies": []
        },
        {
            "body": "prob just had the baby face cheeks",
            "author": "karuf",
            "id": "f87yv7s",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574345378.0,
            "replies": []
        },
        {
            "body": "I see it. Long bangs is the only thing that I think can help, maybe a long undercut?",
            "author": "Bushwhack92",
            "id": "f87zzh2",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574346016.0,
            "replies": []
        },
        {
            "body": "Start now. There's a huge crowd in the beginning of the year. I know it demotivated me from going. I started going to the gym a month or so ago to get into the habit now.",
            "author": null,
            "id": "f88bpts",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574351990.0,
            "replies": []
        },
        {
            "body": "you should get a cut with slightly puffy sides",
            "author": "shortdicknigga69",
            "id": "f88c3ck",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574352173.0,
            "replies": []
        },
        {
            "body": "Fuck that, go now.",
            "author": "Docktor_V",
            "id": "f88ib3b",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574355160.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f88iz6l",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574355493.0,
            "replies": [
                {
                    "body": "I spent way too long trying to figure out what twost meant before realizing it's just two stones. I agree completely though. Exercise is not at all necessary to lose weight.",
                    "author": "dontsuckmydick",
                    "id": "f89bfoo",
                    "parent_id": "t1_f88iz6l",
                    "score": 1,
                    "created_utc": 1574370269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why next year and not like today?",
            "author": "SirHawrk",
            "id": "f88nhhe",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574357676.0,
            "replies": []
        },
        {
            "body": "You look good man. And eggs are delicious",
            "author": "geekisdead",
            "id": "f88zkn1",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574364338.0,
            "replies": []
        },
        {
            "body": "Don’t wait till next year, get to it now!",
            "author": "Lidz0810",
            "id": "f89fpuv",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574372302.0,
            "replies": []
        },
        {
            "body": "Gym is for bodybuilding, just eat less...",
            "author": null,
            "id": "f89qdya",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574377741.0,
            "replies": []
        },
        {
            "body": "Why wait till next year, start now if u actually want results",
            "author": "jack1424552",
            "id": "f89rl68",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574378600.0,
            "replies": []
        },
        {
            "body": "I know everyone is saying to start now and I use to say I would start later but I recommend you take on the mindset of \"If I will really commit to this it doesn't matter when I start. Success will come regardless of start date. Let me prove to myself I can do this by starting tomorrow.\" Goodluck bro",
            "author": "jesuscrikey",
            "id": "f8a07s3",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574384212.0,
            "replies": []
        },
        {
            "body": "why wait til next year if you aren’t happy now w how you look",
            "author": "Blytpls",
            "id": "f8a07wc",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574384214.0,
            "replies": []
        },
        {
            "body": "Losing weight is much more about your diet than going to the gym.",
            "author": "Radinax",
            "id": "f8a5avu",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574388121.0,
            "replies": []
        },
        {
            "body": "The gym won’t make you lose weight man, only thing the gym can do is burn calories (and not that many ultimately) and build muscle. Both supplement weight loss but ultimately it has to do with how much you’re eating. Download myfitnesspal and start tracking your calories. Start at like 2,000 at the most.",
            "author": "Madhouse221",
            "id": "f8af6xl",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574395607.0,
            "replies": []
        },
        {
            "body": "Not that you asked for advice on getting less tubby, but it's worth mentioning that you should ask your primary care doc about pharmacological interventions (like Phentermine) that you can combine with diet and exercise. I sound like a big pharma ad but I just learned about it as a med student and from what I'm seeing in patients + what I'm reading in trials, it generally helps a lot.",
            "author": "RE90",
            "id": "f8afg9y",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574395810.0,
            "replies": []
        },
        {
            "body": "The gym is for building muscles, weight is lost in the kitchen.",
            "author": "TasteQlimax",
            "id": "f8anhap",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574403201.0,
            "replies": []
        },
        {
            "body": "As others said, if you can grow the beard out to elongate your face a bit while you lose weight, do so. \n\nDon’t rejoin the gym next year, join it today. Stop eating like shit, and do little things to increase your calorie burn (park at the back of the parking lot, go for a walk at lunch/after work, etc). \n\nI was ‘uge. 305#, always tired, everything hurt (had a bad haircut, too lol). The Whole 30 made me aware of a lot of the bad food habits I had, and made some permanent change in how I eat. \n\nI got down to 220 with eating right (usually, though tacos are my weakness), cycling like a madman, cutting the drinking down, and sleeping better. Life changed, so I’ve put some pounds back on - 240 today, but I look and feel SO MUCH BETTER than I did when I was a big ol tubbo. \n\nCurrent hair style came after I’d lost weight, suggested by a woman that was once WAY outta my league... she’s long gone, but the better hair cut remains.",
            "author": "TurboPrius",
            "id": "f8b6wep",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574428944.0,
            "replies": []
        },
        {
            "body": "I know a lot of ppl already replied but you don’t need the gym to lose weight. Simply using CICO, and limiting cheat meals to maybe one day a week will help you drop a good amount of weight by January. \n\nYou’ll look better and the you in January will thank the you in November.",
            "author": "cheezitschrist1",
            "id": "f8cio5l",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574461072.0,
            "replies": []
        },
        {
            "body": "join the gym today.",
            "author": "mouserat_18",
            "id": "f8wetoz",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574889201.0,
            "replies": []
        },
        {
            "body": "Theres no such thing as next year or tomorrow when it comes to losing weight.",
            "author": null,
            "id": "f8813qw",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574346624.0,
            "replies": []
        },
        {
            "body": "The gym isn’t that useful for weight loss. It helps. But it’s minimal. It’s for *fitness*. \n\nYou can’t outrun your diet. Get a calorie tracker app and a food scale. Diligently track what you eat before you eat it and ensure you maintain around a 500 calorie per day deficit. \n\nYou cannot cheat thermodynamics. With an energy imbalance you *must* consume fat to survive and thus lose weight. \n\nI lost 130lb (300-170) without extreme dietary changes. Just tracking what I ate and becoming more aware of my choices.",
            "author": "neanderthalman",
            "id": "f88ttn2",
            "parent_id": "t1_f87lgel",
            "score": 1,
            "created_utc": 1574361028.0,
            "replies": []
        },
        {
            "body": "Can't outrun a bad diet no matter how fast you go on the treadmill.\n\nIt is easier to start the new diet now.\n\nCut back on sugar, don't be scared of fat and protein.",
            "author": "ACrusaderA",
            "id": "f88uk98",
            "parent_id": "t1_f87lgel",
            "score": 0,
            "created_utc": 1574361481.0,
            "replies": []
        },
        {
            "body": "Just go for the full out overcut. It’s like an undercut except your leave the side long and buzz the top with a sick fade to zero at the crown.",
            "author": null,
            "id": "f891xj6",
            "parent_id": "t1_f88n2hg",
            "score": 3,
            "created_utc": 1574365537.0,
            "replies": [
                {
                    "body": "🤣😂🤣😂🤣😂🤣Brooooo",
                    "author": "ZenmasterRob",
                    "id": "f8a1t52",
                    "parent_id": "t1_f891xj6",
                    "score": 2,
                    "created_utc": 1574385462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, if your pocket allows, go to an expensive barber  once and talk to him about what would suit you (barbers tend to talk about their niche) then click a photo of the haircut and show it to less expensive ones. Or try young barbers, they tend to have good advice and avail his service.",
            "author": "nightfury1714",
            "id": "f88tmxu",
            "parent_id": "t1_f88squs",
            "score": 2,
            "created_utc": 1574360913.0,
            "replies": []
        },
        {
            "body": "Hello brethren",
            "author": "itbybit",
            "id": "f8cprl7",
            "parent_id": "t1_f8cni0x",
            "score": 1,
            "created_utc": 1574465978.0,
            "replies": []
        },
        {
            "body": "What? I'm not even being an ass. His head looks like an egg because he's overweight. I forget stating facts makes you an ass in 2019. Sorry if your feelings were hurt @op.",
            "author": "RadamanthysWyvern",
            "id": "f89awq3",
            "parent_id": "t1_f89a7t3",
            "score": 3,
            "created_utc": 1574370021.0,
            "replies": [
                {
                    "body": "Him being overweight doesn't negate the fact that a significant change in his hair can and will have a major impact in his appearance\n\nAlso it isnt always necessary to \"state facts\" if they do not bring any value to the topic. I could say you dont have any clue whatsoever about hair based on your initial comment but it does not help us here.",
                    "author": "Tsobe_RK",
                    "id": "f89b1nl",
                    "parent_id": "t1_f89awq3",
                    "score": -2,
                    "created_utc": 1574370089.0,
                    "replies": [
                        {
                            "body": "His hair looks fine. If anything he just needs a fade. Dropping down to the weight he should be will negate any egg shaped head he's got going on.\n\nYour edit doesn't even make sense. My \"fact\" was 100% relevant to the topic. He has an egg head shape because hes overweight. Lose weight = lose egg head shape. Its literally 2+2 pal.",
                            "author": "RadamanthysWyvern",
                            "id": "f89bct1",
                            "parent_id": "t1_f89b1nl",
                            "score": 2,
                            "created_utc": 1574370232.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You ironically judged their character after one snarky remark. Who’s the “judgmental cunt” now?",
            "author": "whycantibelinus",
            "id": "fajhdn4",
            "parent_id": "t1_faa1qk0",
            "score": 2,
            "created_utc": 1576137808.0,
            "replies": [
                {
                    "body": "Still them, I’m confident in my convictions. :)",
                    "author": "kalshassan",
                    "id": "fajhqox",
                    "parent_id": "t1_fajhdn4",
                    "score": 1,
                    "created_utc": 1576138312.0,
                    "replies": [
                        {
                            "body": "*judgment\n\nFTFY",
                            "author": "whycantibelinus",
                            "id": "fajhvmo",
                            "parent_id": "t1_fajhqox",
                            "score": 3,
                            "created_utc": 1576138503.0,
                            "replies": [
                                {
                                    "body": "Keep going, this is fun :)",
                                    "author": "kalshassan",
                                    "id": "faji2rv",
                                    "parent_id": "t1_fajhvmo",
                                    "score": 1,
                                    "created_utc": 1576138786.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It would though. Brining in those cheeks and jowls through weight loss would change this guy’s face from egg shaped to diamond shaped.",
            "author": "ZenmasterRob",
            "id": "f8a1nnp",
            "parent_id": "t1_f89y4ip",
            "score": 0,
            "created_utc": 1574385345.0,
            "replies": []
        },
        {
            "body": "I was going to say this too. The best time to start working on yourself was 5 years ago. The next best time is today. Get on it!",
            "author": "jayburd13",
            "id": "f87qqfa",
            "parent_id": "t1_f87po17",
            "score": 77,
            "created_utc": 1574340307.0,
            "replies": [
                {
                    "body": "Completely agree with this. Work on diet first and foremost. I’m talking simple Calories In, Calories Out. There are a ton of supportive groups on reddit that help people out with this, as well as a bunch of apps you can use. Find one that fits your lifestyle and don’t make you miserable. Like with the gym, consistency is keep. Soon you’ll see those face gains!",
                    "author": "relationship_padawan",
                    "id": "f886ac7",
                    "parent_id": "t1_f87qqfa",
                    "score": 16,
                    "created_utc": 1574349311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Those who plan to start \"tomorrow\" generally fail. Its a lifestyle change that you need to commit to. After a while you wont even notice",
            "author": "ToonarmY1987",
            "id": "f87tdew",
            "parent_id": "t1_f87po17",
            "score": 30,
            "created_utc": 1574342039.0,
            "replies": []
        },
        {
            "body": "Exactly, Go hit the gym today! You can do it man.",
            "author": "Peakingforever",
            "id": "f87r7eq",
            "parent_id": "t1_f87qxa4",
            "score": 18,
            "created_utc": 1574340627.0,
            "replies": []
        },
        {
            "body": "I spent way too long trying to figure out what twost meant before realizing it's just two stones. I agree completely though. Exercise is not at all necessary to lose weight.",
            "author": "dontsuckmydick",
            "id": "f89bfoo",
            "parent_id": "t1_f88iz6l",
            "score": 1,
            "created_utc": 1574370269.0,
            "replies": []
        },
        {
            "body": "🤣😂🤣😂🤣😂🤣Brooooo",
            "author": "ZenmasterRob",
            "id": "f8a1t52",
            "parent_id": "t1_f891xj6",
            "score": 2,
            "created_utc": 1574385462.0,
            "replies": []
        },
        {
            "body": "Him being overweight doesn't negate the fact that a significant change in his hair can and will have a major impact in his appearance\n\nAlso it isnt always necessary to \"state facts\" if they do not bring any value to the topic. I could say you dont have any clue whatsoever about hair based on your initial comment but it does not help us here.",
            "author": "Tsobe_RK",
            "id": "f89b1nl",
            "parent_id": "t1_f89awq3",
            "score": -2,
            "created_utc": 1574370089.0,
            "replies": [
                {
                    "body": "His hair looks fine. If anything he just needs a fade. Dropping down to the weight he should be will negate any egg shaped head he's got going on.\n\nYour edit doesn't even make sense. My \"fact\" was 100% relevant to the topic. He has an egg head shape because hes overweight. Lose weight = lose egg head shape. Its literally 2+2 pal.",
                    "author": "RadamanthysWyvern",
                    "id": "f89bct1",
                    "parent_id": "t1_f89b1nl",
                    "score": 2,
                    "created_utc": 1574370232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Still them, I’m confident in my convictions. :)",
            "author": "kalshassan",
            "id": "fajhqox",
            "parent_id": "t1_fajhdn4",
            "score": 1,
            "created_utc": 1576138312.0,
            "replies": [
                {
                    "body": "*judgment\n\nFTFY",
                    "author": "whycantibelinus",
                    "id": "fajhvmo",
                    "parent_id": "t1_fajhqox",
                    "score": 3,
                    "created_utc": 1576138503.0,
                    "replies": [
                        {
                            "body": "Keep going, this is fun :)",
                            "author": "kalshassan",
                            "id": "faji2rv",
                            "parent_id": "t1_fajhvmo",
                            "score": 1,
                            "created_utc": 1576138786.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Completely agree with this. Work on diet first and foremost. I’m talking simple Calories In, Calories Out. There are a ton of supportive groups on reddit that help people out with this, as well as a bunch of apps you can use. Find one that fits your lifestyle and don’t make you miserable. Like with the gym, consistency is keep. Soon you’ll see those face gains!",
            "author": "relationship_padawan",
            "id": "f886ac7",
            "parent_id": "t1_f87qqfa",
            "score": 16,
            "created_utc": 1574349311.0,
            "replies": []
        },
        {
            "body": "His hair looks fine. If anything he just needs a fade. Dropping down to the weight he should be will negate any egg shaped head he's got going on.\n\nYour edit doesn't even make sense. My \"fact\" was 100% relevant to the topic. He has an egg head shape because hes overweight. Lose weight = lose egg head shape. Its literally 2+2 pal.",
            "author": "RadamanthysWyvern",
            "id": "f89bct1",
            "parent_id": "t1_f89b1nl",
            "score": 2,
            "created_utc": 1574370232.0,
            "replies": []
        },
        {
            "body": "*judgment\n\nFTFY",
            "author": "whycantibelinus",
            "id": "fajhvmo",
            "parent_id": "t1_fajhqox",
            "score": 3,
            "created_utc": 1576138503.0,
            "replies": [
                {
                    "body": "Keep going, this is fun :)",
                    "author": "kalshassan",
                    "id": "faji2rv",
                    "parent_id": "t1_fajhvmo",
                    "score": 1,
                    "created_utc": 1576138786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Keep going, this is fun :)",
            "author": "kalshassan",
            "id": "faji2rv",
            "parent_id": "t1_fajhvmo",
            "score": 1,
            "created_utc": 1576138786.0,
            "replies": []
        }
    ]
}