{
    "title": "a small splenda daddy rant.",
    "post_id": "cfu95u",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cfu95u/a_small_splenda_daddy_rant/",
    "author": "sbthrowitawayyy",
    "body": "I was speaking with a POT SD & he offered a $300 weekly allowance but he wanted to see me “a lot” because he also wanted to be friends. He’s kind of old looking, sorta big, and generally not so attractive. \nI imagine girls wouldn’t give him a second to speak to them if he were trying to freestyle. \n\n\nI’m 23, asian, and my typical per meet allowance ranges from $350-$500. My last monthly allowance was $1400. \n\nWith all that being said, I figure if majority of the time it’s platonic and only once per week we actually are intimate, I can live with that as it would be reliable/low maintenance/chill. So that’s what I offered. \n\nThis man straight up tells me - “I want unlimited access to you. No condom, seeing you multiple times per week as a friend with benefits. If you aren’t sexually attracted to me then we shouldn’t be speaking at all. It’s always about money with you people.”\n\nWithout thinking & out of anger I just replied, “There comes a point where it’s just asking for too much. You are asking a young, attractive, college girl to not only enthusiastically sleep with you as many times as you want but also offer a weekly allowance that is lower than my previous per meet arrangements. This is no longer mutually beneficial. I suggest that if you’re looking for true connection minus the financial aspect, you go to match or another form of dating that doesn’t require you to be an SD”\n\nhe got mad and got my SA account banned. Not a big deal though. \n\nI’m just confused as to how some people can think SA shouldn’t be so much about money. If you don’t have it that’s okay! don’t use the site.\n\nRant over.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cfu95u/a_small_splenda_daddy_rant/",
    "score": 314,
    "upvote_ratio": 0.97,
    "created_utc": 1563676967.0,
    "num_comments": 60,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "things don’t even work like that in vanilla dating! “unlimited access” to you. that’s ridiculous. and no condom, HAHA. so many red flags, you dodged a bullet hard on that one.",
            "author": "somniloquiesx",
            "id": "euck2iq",
            "parent_id": "t3_cfu95u",
            "score": 206,
            "created_utc": 1563677362.0,
            "replies": [
                {
                    "body": "Exactly. This isn't an arrangement or vanilla set up! No one would want him as an SD or a boyfriend with that attitude. You're better off.",
                    "author": null,
                    "id": "eucz43m",
                    "parent_id": "t1_euck2iq",
                    "score": 30,
                    "created_utc": 1563692992.0,
                    "replies": []
                },
                {
                    "body": "I had an ex say he wanted all that shit too. He's never going to say it again if he wants his ribcage in it's current bone order.",
                    "author": "Mopsydoll",
                    "id": "eud6gof",
                    "parent_id": "t1_euck2iq",
                    "score": 17,
                    "created_utc": 1563704074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ridiculous.  And he's the one irritated with you!\n\nAs a side note, this proves the rule again: as soon as you identify someone as toxic, disengage immediately.  There's nothing good that ever comes out of lecturing them, or yelling at them, or getting upset over them",
            "author": "Azurecole",
            "id": "euckj6k",
            "parent_id": "t3_cfu95u",
            "score": 104,
            "created_utc": 1563677745.0,
            "replies": [
                {
                    "body": "you’re correct! \ni’m not too upset but i never learn haha. SDs have the power on SA regardless if they’re a douche canoe or not haha :)",
                    "author": "sbthrowitawayyy",
                    "id": "euckwgh",
                    "parent_id": "t1_euckj6k",
                    "score": 31,
                    "created_utc": 1563678054.0,
                    "replies": [
                        {
                            "body": "And people wonder why ghosting is so common. It exactly because of guys like this. Ghost, block and report is unfortunately the right thing to do here. \n\nI still can't believe that he said that he was expecting \"unlimited access\" to you. Who even says that?",
                            "author": "denardos",
                            "id": "eucv932",
                            "parent_id": "t1_euckwgh",
                            "score": 35,
                            "created_utc": 1563688165.0,
                            "replies": [
                                {
                                    "body": "The \"unlimited access\" thing still has my skin crawling tbh",
                                    "author": "Mopsydoll",
                                    "id": "eud6is6",
                                    "parent_id": "t1_eucv932",
                                    "score": 22,
                                    "created_utc": 1563704171.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And you know that guy is home, sitting with his feet up, thinking how great it is to be a douche canoe",
                            "author": "Azurecole",
                            "id": "euclea4",
                            "parent_id": "t1_euckwgh",
                            "score": 26,
                            "created_utc": 1563678483.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't understand what SA rule you violated to get banned. He is an arse and I would have given him a tongue lashing too",
            "author": "birdy4real",
            "id": "eucl8af",
            "parent_id": "t3_cfu95u",
            "score": 47,
            "created_utc": 1563678339.0,
            "replies": [
                {
                    "body": "I’ve been told on this forum that SDs are priority on SA bc they pay for their membership. \nBasically a disgruntled SD can report any SB for whatever reason - all they gotta do is say you’re using escort terminology and you are banned no questions.",
                    "author": null,
                    "id": "eucmjzm",
                    "parent_id": "t1_eucl8af",
                    "score": 36,
                    "created_utc": 1563679497.0,
                    "replies": [
                        {
                            "body": "I believe they're cracking down on any mention of PPM. This is why it's a good idea to go to text as quickly as possible.",
                            "author": "ContriteSplendaDaddy",
                            "id": "euct9r9",
                            "parent_id": "t1_eucmjzm",
                            "score": 18,
                            "created_utc": 1563685978.0,
                            "replies": []
                        },
                        {
                            "body": "I got banned twice for standing up for myself against potential SD. It’s ridiculous how a SD word is gold on that site.",
                            "author": "babby_lizzzy",
                            "id": "euebmsz",
                            "parent_id": "t1_eucmjzm",
                            "score": 11,
                            "created_utc": 1563740309.0,
                            "replies": [
                                {
                                    "body": "Isn’t it? \nOne disgruntled SD can get SA to ban your account, forcing you to make another one, & I believe they use facial tracking so now I can’t use pics with my face lol.",
                                    "author": null,
                                    "id": "eufekmg",
                                    "parent_id": "t1_euebmsz",
                                    "score": 3,
                                    "created_utc": 1563771424.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I believe you still need to provide evidence.  The ban would be temporary until they review copies of messages or text.  I've had to provide evidence to get scammers banned.",
                            "author": "willfromvb",
                            "id": "eud2613",
                            "parent_id": "t1_eucmjzm",
                            "score": -1,
                            "created_utc": 1563697301.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "eudjzrg",
                    "parent_id": "t1_eucl8af",
                    "score": -16,
                    "created_utc": 1563719652.0,
                    "replies": [
                        {
                            "body": "Then everyone offering it is a John.",
                            "author": "maincoursdelegance",
                            "id": "eudq1mw",
                            "parent_id": "t1_eudjzrg",
                            "score": 11,
                            "created_utc": 1563724511.0,
                            "replies": []
                        },
                        {
                            "body": "get off your high horse.  \n\nThere is no way I am doing a monthly arrangement till we have met a few times.  I've been burned 2x by girls getting the monthly upfront & then not delivery.",
                            "author": "mollyflowers",
                            "id": "eudqa26",
                            "parent_id": "t1_eudjzrg",
                            "score": 0,
                            "created_utc": 1563724691.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said, even if it's out of anger it was politely put and you didn't call him names, you were just being frank and it seems like he needs a reality check.",
            "author": "throwawaaaay3545",
            "id": "euclj3d",
            "parent_id": "t3_cfu95u",
            "score": 22,
            "created_utc": 1563678598.0,
            "replies": []
        },
        {
            "body": "300 for unlimited access to you? He’s lucky you even considered giving him any access to you for that much lmao",
            "author": null,
            "id": "eucmcmn",
            "parent_id": "t3_cfu95u",
            "score": 37,
            "created_utc": 1563679314.0,
            "replies": []
        },
        {
            "body": "I had a Splenda Daddy try to pay $50 every two weeks and wanted me to kiss him and act like his girlfriend. When I tried to turn him down he said I'm just being greedy. \nHoney, $200 a month for me acting like your girlfriend? I don't understand why they feel so entitled to whoever they want. We have a right to say no.",
            "author": "LilOtter19",
            "id": "euduaep",
            "parent_id": "t3_cfu95u",
            "score": 16,
            "created_utc": 1563727691.0,
            "replies": []
        },
        {
            "body": " It’s always about money with you people.”   \n\nWell,you respond \" funny, it's always about sex with you people\"\n\nReport him to Seeking for insulting and abusive language.",
            "author": "GSSD",
            "id": "euej7al",
            "parent_id": "t3_cfu95u",
            "score": 11,
            "created_utc": 1563745713.0,
            "replies": []
        },
        {
            "body": "Splendaddy's proposition is abusive. Period. \n\nThat he turned around and gave OP shit for exposing the ridiculousness of:\n\n* ‘unlimited access’ to a human being when that includes her body (let alone with no protection)\n* and a ‘friendship’ that could suck 20 or 30 hours per week from a student's time—her most precious commodity…\n\n…that attitude on Splendaddy's part has a name: **gaslighting**. Being 100% machiavellian and trying to make the other person feel bad.\n\n&#x200B;\n\nKudos to OP for her lucidity, and to the members who contributed gems like:\n\n* “things don’t even work like that in vanilla dating!” — u/somniloquiesx\n* “as soon as you identify someone as toxic, disengage immediately” — u/azurecole",
            "author": null,
            "id": "eucnstf",
            "parent_id": "t3_cfu95u",
            "score": 44,
            "created_utc": 1563680626.0,
            "replies": []
        },
        {
            "body": "The Splenda/lowball offer is the least of the problems here. If he can afford $1200 a month, that's enough for a few PPMs at the going rate in most cities (three PPMs even at your rate). But even if he had offered double your PPM every day of the month, his message would still be problematic. Let's unpack his message:\n\n>I want unlimited access to you. \n\nMisogynistic, controlling, and dehumanizing. This is disturbing. \n\n>No condom, seeing you multiple times per week as a friend with benefits. \n\nUnsafe and delusional. A \"friend with benefits\" is not someone you have \"unlimited access to.\" FWB implies actual friendship -- you find a way to meet when it's mutually convenient. Who has \"unlimited access\" to a vanilla friend?\n\n>If you aren’t sexually attracted to me then we shouldn’t be speaking at all. \n\nCraving validation to the point of being toxic. He really wants to be seen as attractive, but he clearly has to clue as to how to develop attraction. \n\n>It’s always about money with you people.\n\nAnd racist to boot!",
            "author": "ContriteSplendaDaddy",
            "id": "euct7jx",
            "parent_id": "t3_cfu95u",
            "score": 25,
            "created_utc": 1563685914.0,
            "replies": [
                {
                    "body": "He could have meant \"sugar babies\" or \"escorts\" in general, not Asian women",
                    "author": "trangieexd",
                    "id": "eud32d6",
                    "parent_id": "t1_euct7jx",
                    "score": 14,
                    "created_utc": 1563698665.0,
                    "replies": [
                        {
                            "body": "I'd put it at 50/50. \"It's always about money with you people\" is such a quintinessential ethnic slur that anyone with any self-awareness and sense of decency wouldn't say that to a minority.",
                            "author": "ContriteSplendaDaddy",
                            "id": "euded0j",
                            "parent_id": "t1_eud32d6",
                            "score": 9,
                            "created_utc": 1563714491.0,
                            "replies": [
                                {
                                    "body": "He definitely was relying heavily on the “gold digger” stereotype so it’s not a stretch to think he’d also fetishize her race and hold ethnic stereotypes as well. Some SDs feel more comfortable expressing this fetishization on SA because “they’re paying for the fantasy” and then the ugly stereotypes hat accompany this toxic fetishization come out. Regardless, even without a racial component it’s ridiculous to throw out the gold digger stereotype on SA. Legitimate criticisms of unrealistic allowances are one thing but it grinds my gears to see wannabe SDs so uncomfortable with a money exchange.",
                                    "author": null,
                                    "id": "euecofw",
                                    "parent_id": "t1_euded0j",
                                    "score": 7,
                                    "created_utc": 1563741065.0,
                                    "replies": []
                                },
                                {
                                    "body": "You do realise that the complete overuse of the word racist or homophobic or misogynistic has devalued the word and real meaning.\n\nHe was out of line and an ahole regardless so that is sufficient to ban/block/ move on and learn from it.",
                                    "author": "TXPolyDaddy",
                                    "id": "eue0q01",
                                    "parent_id": "t1_euded0j",
                                    "score": 1,
                                    "created_utc": 1563732346.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Barf to anyone who thinks they could ever deserve full access to another human",
            "author": null,
            "id": "eud5ire",
            "parent_id": "t3_cfu95u",
            "score": 16,
            "created_utc": 1563702563.0,
            "replies": []
        },
        {
            "body": "That's why ghosting is better than giving an honest answer. Sucks but c'est la vie.",
            "author": "pacers3113",
            "id": "eucmkmc",
            "parent_id": "t3_cfu95u",
            "score": 16,
            "created_utc": 1563679513.0,
            "replies": [
                {
                    "body": "I hate that this is true.",
                    "author": "Sugarbeggar",
                    "id": "eucu7l7",
                    "parent_id": "t1_eucmkmc",
                    "score": 5,
                    "created_utc": 1563686998.0,
                    "replies": [
                        {
                            "body": "I don’t care if it’s “true”. I would rather someone say something before just ghosting. I’ve never gone off on someone for not thinking that we were a fit. If I did truly enjoyed getting to know them, I told him that and I think them for their time. I then proceed to wish them the very best, and I mean it. If I forgot to wish them the best then that was clearly an oversight on my part. However, I would be surprised if that happens very often.",
                            "author": "TirzahRed",
                            "id": "eucurfo",
                            "parent_id": "t1_eucu7l7",
                            "score": 1,
                            "created_utc": 1563687612.0,
                            "replies": [
                                {
                                    "body": "What you would prefer and what works best for other people, often different.\n\nI fucking hate getting ghosted, it's my least favorite thing, I'm absolutely not the kind of guy who would blow up at someone, but I understand why people ghost, even though I think on a net it creates more pain than it avoids.",
                                    "author": "Sugarbeggar",
                                    "id": "eucyiq3",
                                    "parent_id": "t1_eucurfo",
                                    "score": 10,
                                    "created_utc": 1563692195.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You actually sound great and quite reasonable with what you are seeking. Wish you were local to me! :)",
            "author": "laimbeer3",
            "id": "eue7fwl",
            "parent_id": "t3_cfu95u",
            "score": 3,
            "created_utc": 1563737264.0,
            "replies": []
        },
        {
            "body": "Wow that’s messed up.0",
            "author": "BeautifulDiva2266",
            "id": "euczg5s",
            "parent_id": "t3_cfu95u",
            "score": 3,
            "created_utc": 1563693438.0,
            "replies": []
        },
        {
            "body": "Yeah run like the wind.",
            "author": "WhiteTrash_Air",
            "id": "eue8nw0",
            "parent_id": "t3_cfu95u",
            "score": 3,
            "created_utc": 1563738158.0,
            "replies": []
        },
        {
            "body": "$300 a week? Wow, big spender. I guess his pension benefits must be getting cut back by sears bankruptcy",
            "author": "KnocDown",
            "id": "evtdo8t",
            "parent_id": "t3_cfu95u",
            "score": 3,
            "created_utc": 1564768183.0,
            "replies": []
        },
        {
            "body": "You are lucky, I wouldn't have responded to him.  I mean yeah 300 is 1200 a month so meeting weekly is about what you got with the 1400 a month,but he was too controlling.",
            "author": "Keylargo1071",
            "id": "euefuxg",
            "parent_id": "t3_cfu95u",
            "score": 2,
            "created_utc": 1563743333.0,
            "replies": []
        },
        {
            "body": "300/week might be a lot of money to him, oh poor guy never got a break!",
            "author": "blessedSD",
            "id": "euclz0m",
            "parent_id": "t3_cfu95u",
            "score": 3,
            "created_utc": 1563678984.0,
            "replies": []
        },
        {
            "body": "What happens with the banned account?  Can you create another one?  How can he have the power to get you banned?",
            "author": "RestartYourHeart",
            "id": "eucqah6",
            "parent_id": "t3_cfu95u",
            "score": 2,
            "created_utc": 1563682941.0,
            "replies": [
                {
                    "body": "I would need to make a new account w new pictures. \nI can make another one but it’s just a lot of work. \nSDs are priority on that site bc I think they pay to be on in general. Also as someone else mentioned, they just have to report you as an escort and you’re done. \nThey don’t really need evidence either.",
                    "author": "sbthrowitawayyy",
                    "id": "eucr4tv",
                    "parent_id": "t1_eucqah6",
                    "score": 8,
                    "created_utc": 1563683765.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eudaayy",
                            "parent_id": "t1_eucr4tv",
                            "score": -5,
                            "created_utc": 1563709785.0,
                            "replies": [
                                {
                                    "body": "Absolutely. It’s really hard to get anyone banned, regardless if you have a premium account or not. This guy had to get enough evidence of escorting or prostitution terms. The way the OP described it seems there was more to the conversation.",
                                    "author": "Limitlesspappy",
                                    "id": "eudy1qm",
                                    "parent_id": "t1_eudaayy",
                                    "score": 1,
                                    "created_utc": 1563730407.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The D in SD should suggest that someone has acquired some wisdom through experience. Thus, they should understand that there is no such thing as a free lunch. If you want more, you should expect to pay more. There's nothing wrong with asking for exclusivity, unprotected sex, unlimited access, so long as you understand that these are extra and you need to offer extra in return.  \n\n\nI think your reply was perfectly fine, buy you might have just said \"what are you willing to offer in return?\"",
            "author": null,
            "id": "eucrkqb",
            "parent_id": "t3_cfu95u",
            "score": 3,
            "created_utc": 1563684212.0,
            "replies": []
        },
        {
            "body": "By all mean, rant on here but stop ranting at POTs. There is no point in expressing your anger to him. \n\nIt is pointless to educating POTs that are not a match regardless of reasons. Any hint of being unreasonable, I just thank them and move on. If they persist, I would block them and move on.",
            "author": "SD_AU",
            "id": "euco6w1",
            "parent_id": "t3_cfu95u",
            "score": 0,
            "created_utc": 1563680982.0,
            "replies": []
        },
        {
            "body": "I wonder why and how he succeeded at getting your account banned?👀",
            "author": "Limitlesspappy",
            "id": "eudxk4b",
            "parent_id": "t3_cfu95u",
            "score": 1,
            "created_utc": 1563730052.0,
            "replies": [
                {
                    "body": "Hmm sounds fishy",
                    "author": "1trickponi",
                    "id": "eue2t6b",
                    "parent_id": "t1_eudxk4b",
                    "score": 0,
                    "created_utc": 1563733867.0,
                    "replies": [
                        {
                            "body": "It takes work to get someone banned on SA. You have to provide lots of evidence and screenshots.",
                            "author": "Limitlesspappy",
                            "id": "eue3vmd",
                            "parent_id": "t1_eue2t6b",
                            "score": 1,
                            "created_utc": 1563734660.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I respect your answer. Clearly, you were not a match. I think the less said the better, in general, however. So, a \"I just don't see how we're a good match. Good luck!'  <BLOCK>\n\nHe gives Splenda Daddies a bad name....",
            "author": "Haffbad",
            "id": "euct2al",
            "parent_id": "t3_cfu95u",
            "score": -5,
            "created_utc": 1563685758.0,
            "replies": [
                {
                    "body": "There's no good name for Splenda Daddies",
                    "author": "jiena-telaqi",
                    "id": "eud3tge",
                    "parent_id": "t1_euct2al",
                    "score": 16,
                    "created_utc": 1563699849.0,
                    "replies": [
                        {
                            "body": "That's true for actual Splenda Daddies. Sometimes, though, IMO the term 'Splenda Daddy\" is used to disparage someone who doesn't have a budget level judged appropriate. \n\nIn the case of the OP, the guy being described seems to be, at minimum, out of touch with the workings of the Bowl.",
                            "author": "Haffbad",
                            "id": "eudb7x9",
                            "parent_id": "t1_eud3tge",
                            "score": -1,
                            "created_utc": 1563710966.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It was never a good name to start with",
                    "author": null,
                    "id": "eud5ll3",
                    "parent_id": "t1_euct2al",
                    "score": 3,
                    "created_utc": 1563702686.0,
                    "replies": [
                        {
                            "body": ":)  True, but this guy needs to sharpen his game to even be considered a Splenda!",
                            "author": "Haffbad",
                            "id": "euen4rs",
                            "parent_id": "t1_eud5ll3",
                            "score": 1,
                            "created_utc": 1563748595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The bowl is spectrum and you met someone on one end of the spectrum. \n\nA Splenda Daddy is someone who doesn’t have the means to be a full time SD. I don’t think this guy is one of them. Technically speaking of he stays with his end of the agreement you would be making 200 less than your previous SR. \n\nHe stated his expectations which were not what you were looking for. You move on and find someone who is aligned with your expectations.",
            "author": "professorxc",
            "id": "euclbk4",
            "parent_id": "t3_cfu95u",
            "score": -14,
            "created_utc": 1563678417.0,
            "replies": [
                {
                    "body": "His expectations are delusional. Just because you’re upfront about your expectations doesn’t mean they are reasonable and immune to critique.",
                    "author": null,
                    "id": "eud5mm6",
                    "parent_id": "t1_euclbk4",
                    "score": 13,
                    "created_utc": 1563702732.0,
                    "replies": [
                        {
                            "body": "What makes your opinion more valid than his expectation? This is all value judgment. I think you are delusional in your response.\n\nHe was polite and stated clearly what he wanted. If it's not what you want just move on. Why bitch and moan about it like a fucking kid. We all know how sugar works.",
                            "author": "MofeedSaid",
                            "id": "eudjh9l",
                            "parent_id": "t1_eud5mm6",
                            "score": -6,
                            "created_utc": 1563719216.0,
                            "replies": [
                                {
                                    "body": "Because he is offering something that is far below market value and has far higher expectations than our appropriate, and he completely flew off the handle when she expressed that to him. Don’t be so one-sided just because you agree with him and you want something that is far more valuable than what you were prepared to offer, market value is market value and girl should not be getting banned for expressing that they know their value in the sugar bowl. \n\nI have found that many men who get offended like this are not prepared to offer substantial allowances, it seems that lower financial security results in lower forms of conduct. It’s all across the board, rarely have I found men or women who are prepared to provide a present/receive a high-level allowance behaving in such ways.",
                                    "author": "maincoursdelegance",
                                    "id": "eudq4sc",
                                    "parent_id": "t1_eudjh9l",
                                    "score": 9,
                                    "created_utc": 1563724578.0,
                                    "replies": []
                                },
                                {
                                    "body": "How is asking for unlimited access polite?! Just because you’re similarly delusional doesn’t mean this is a reasonable request in any way, shape, or form. Pointing out his delusional thinking isn’t bitching and moaning.",
                                    "author": null,
                                    "id": "euds6m8",
                                    "parent_id": "t1_eudjh9l",
                                    "score": 10,
                                    "created_utc": 1563726133.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hate posting like this. One person's Splenda is another's Sugar. Just fucking move on instead of ranting about it.\n\nSD/SB come in all different price points. Just plain supply and demand.\n\nAlso you should be banned. SA is for real SB not prostitutes.",
            "author": "MofeedSaid",
            "id": "eudioyg",
            "parent_id": "t3_cfu95u",
            "score": -16,
            "created_utc": 1563718543.0,
            "replies": [
                {
                    "body": "That's a bit harsh..  She said she had done allowance and PPM before..  Sounds like a pretty common SB situation. \n\nHis attitude was unhealthy regardless of the dollars.  All people should stand up to and walk away from mistreatment and emotional abuse.",
                    "author": "TXPolyDaddy",
                    "id": "eue12rl",
                    "parent_id": "t1_eudioyg",
                    "score": 9,
                    "created_utc": 1563732603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. This isn't an arrangement or vanilla set up! No one would want him as an SD or a boyfriend with that attitude. You're better off.",
            "author": null,
            "id": "eucz43m",
            "parent_id": "t1_euck2iq",
            "score": 30,
            "created_utc": 1563692992.0,
            "replies": []
        },
        {
            "body": "I had an ex say he wanted all that shit too. He's never going to say it again if he wants his ribcage in it's current bone order.",
            "author": "Mopsydoll",
            "id": "eud6gof",
            "parent_id": "t1_euck2iq",
            "score": 17,
            "created_utc": 1563704074.0,
            "replies": []
        },
        {
            "body": "you’re correct! \ni’m not too upset but i never learn haha. SDs have the power on SA regardless if they’re a douche canoe or not haha :)",
            "author": "sbthrowitawayyy",
            "id": "euckwgh",
            "parent_id": "t1_euckj6k",
            "score": 31,
            "created_utc": 1563678054.0,
            "replies": [
                {
                    "body": "And people wonder why ghosting is so common. It exactly because of guys like this. Ghost, block and report is unfortunately the right thing to do here. \n\nI still can't believe that he said that he was expecting \"unlimited access\" to you. Who even says that?",
                    "author": "denardos",
                    "id": "eucv932",
                    "parent_id": "t1_euckwgh",
                    "score": 35,
                    "created_utc": 1563688165.0,
                    "replies": [
                        {
                            "body": "The \"unlimited access\" thing still has my skin crawling tbh",
                            "author": "Mopsydoll",
                            "id": "eud6is6",
                            "parent_id": "t1_eucv932",
                            "score": 22,
                            "created_utc": 1563704171.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And you know that guy is home, sitting with his feet up, thinking how great it is to be a douche canoe",
                    "author": "Azurecole",
                    "id": "euclea4",
                    "parent_id": "t1_euckwgh",
                    "score": 26,
                    "created_utc": 1563678483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve been told on this forum that SDs are priority on SA bc they pay for their membership. \nBasically a disgruntled SD can report any SB for whatever reason - all they gotta do is say you’re using escort terminology and you are banned no questions.",
            "author": null,
            "id": "eucmjzm",
            "parent_id": "t1_eucl8af",
            "score": 36,
            "created_utc": 1563679497.0,
            "replies": [
                {
                    "body": "I believe they're cracking down on any mention of PPM. This is why it's a good idea to go to text as quickly as possible.",
                    "author": "ContriteSplendaDaddy",
                    "id": "euct9r9",
                    "parent_id": "t1_eucmjzm",
                    "score": 18,
                    "created_utc": 1563685978.0,
                    "replies": []
                },
                {
                    "body": "I got banned twice for standing up for myself against potential SD. It’s ridiculous how a SD word is gold on that site.",
                    "author": "babby_lizzzy",
                    "id": "euebmsz",
                    "parent_id": "t1_eucmjzm",
                    "score": 11,
                    "created_utc": 1563740309.0,
                    "replies": [
                        {
                            "body": "Isn’t it? \nOne disgruntled SD can get SA to ban your account, forcing you to make another one, & I believe they use facial tracking so now I can’t use pics with my face lol.",
                            "author": null,
                            "id": "eufekmg",
                            "parent_id": "t1_euebmsz",
                            "score": 3,
                            "created_utc": 1563771424.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I believe you still need to provide evidence.  The ban would be temporary until they review copies of messages or text.  I've had to provide evidence to get scammers banned.",
                    "author": "willfromvb",
                    "id": "eud2613",
                    "parent_id": "t1_eucmjzm",
                    "score": -1,
                    "created_utc": 1563697301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "eudjzrg",
            "parent_id": "t1_eucl8af",
            "score": -16,
            "created_utc": 1563719652.0,
            "replies": [
                {
                    "body": "Then everyone offering it is a John.",
                    "author": "maincoursdelegance",
                    "id": "eudq1mw",
                    "parent_id": "t1_eudjzrg",
                    "score": 11,
                    "created_utc": 1563724511.0,
                    "replies": []
                },
                {
                    "body": "get off your high horse.  \n\nThere is no way I am doing a monthly arrangement till we have met a few times.  I've been burned 2x by girls getting the monthly upfront & then not delivery.",
                    "author": "mollyflowers",
                    "id": "eudqa26",
                    "parent_id": "t1_eudjzrg",
                    "score": 0,
                    "created_utc": 1563724691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He could have meant \"sugar babies\" or \"escorts\" in general, not Asian women",
            "author": "trangieexd",
            "id": "eud32d6",
            "parent_id": "t1_euct7jx",
            "score": 14,
            "created_utc": 1563698665.0,
            "replies": [
                {
                    "body": "I'd put it at 50/50. \"It's always about money with you people\" is such a quintinessential ethnic slur that anyone with any self-awareness and sense of decency wouldn't say that to a minority.",
                    "author": "ContriteSplendaDaddy",
                    "id": "euded0j",
                    "parent_id": "t1_eud32d6",
                    "score": 9,
                    "created_utc": 1563714491.0,
                    "replies": [
                        {
                            "body": "He definitely was relying heavily on the “gold digger” stereotype so it’s not a stretch to think he’d also fetishize her race and hold ethnic stereotypes as well. Some SDs feel more comfortable expressing this fetishization on SA because “they’re paying for the fantasy” and then the ugly stereotypes hat accompany this toxic fetishization come out. Regardless, even without a racial component it’s ridiculous to throw out the gold digger stereotype on SA. Legitimate criticisms of unrealistic allowances are one thing but it grinds my gears to see wannabe SDs so uncomfortable with a money exchange.",
                            "author": null,
                            "id": "euecofw",
                            "parent_id": "t1_euded0j",
                            "score": 7,
                            "created_utc": 1563741065.0,
                            "replies": []
                        },
                        {
                            "body": "You do realise that the complete overuse of the word racist or homophobic or misogynistic has devalued the word and real meaning.\n\nHe was out of line and an ahole regardless so that is sufficient to ban/block/ move on and learn from it.",
                            "author": "TXPolyDaddy",
                            "id": "eue0q01",
                            "parent_id": "t1_euded0j",
                            "score": 1,
                            "created_utc": 1563732346.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hate that this is true.",
            "author": "Sugarbeggar",
            "id": "eucu7l7",
            "parent_id": "t1_eucmkmc",
            "score": 5,
            "created_utc": 1563686998.0,
            "replies": [
                {
                    "body": "I don’t care if it’s “true”. I would rather someone say something before just ghosting. I’ve never gone off on someone for not thinking that we were a fit. If I did truly enjoyed getting to know them, I told him that and I think them for their time. I then proceed to wish them the very best, and I mean it. If I forgot to wish them the best then that was clearly an oversight on my part. However, I would be surprised if that happens very often.",
                    "author": "TirzahRed",
                    "id": "eucurfo",
                    "parent_id": "t1_eucu7l7",
                    "score": 1,
                    "created_utc": 1563687612.0,
                    "replies": [
                        {
                            "body": "What you would prefer and what works best for other people, often different.\n\nI fucking hate getting ghosted, it's my least favorite thing, I'm absolutely not the kind of guy who would blow up at someone, but I understand why people ghost, even though I think on a net it creates more pain than it avoids.",
                            "author": "Sugarbeggar",
                            "id": "eucyiq3",
                            "parent_id": "t1_eucurfo",
                            "score": 10,
                            "created_utc": 1563692195.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would need to make a new account w new pictures. \nI can make another one but it’s just a lot of work. \nSDs are priority on that site bc I think they pay to be on in general. Also as someone else mentioned, they just have to report you as an escort and you’re done. \nThey don’t really need evidence either.",
            "author": "sbthrowitawayyy",
            "id": "eucr4tv",
            "parent_id": "t1_eucqah6",
            "score": 8,
            "created_utc": 1563683765.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eudaayy",
                    "parent_id": "t1_eucr4tv",
                    "score": -5,
                    "created_utc": 1563709785.0,
                    "replies": [
                        {
                            "body": "Absolutely. It’s really hard to get anyone banned, regardless if you have a premium account or not. This guy had to get enough evidence of escorting or prostitution terms. The way the OP described it seems there was more to the conversation.",
                            "author": "Limitlesspappy",
                            "id": "eudy1qm",
                            "parent_id": "t1_eudaayy",
                            "score": 1,
                            "created_utc": 1563730407.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmm sounds fishy",
            "author": "1trickponi",
            "id": "eue2t6b",
            "parent_id": "t1_eudxk4b",
            "score": 0,
            "created_utc": 1563733867.0,
            "replies": [
                {
                    "body": "It takes work to get someone banned on SA. You have to provide lots of evidence and screenshots.",
                    "author": "Limitlesspappy",
                    "id": "eue3vmd",
                    "parent_id": "t1_eue2t6b",
                    "score": 1,
                    "created_utc": 1563734660.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's no good name for Splenda Daddies",
            "author": "jiena-telaqi",
            "id": "eud3tge",
            "parent_id": "t1_euct2al",
            "score": 16,
            "created_utc": 1563699849.0,
            "replies": [
                {
                    "body": "That's true for actual Splenda Daddies. Sometimes, though, IMO the term 'Splenda Daddy\" is used to disparage someone who doesn't have a budget level judged appropriate. \n\nIn the case of the OP, the guy being described seems to be, at minimum, out of touch with the workings of the Bowl.",
                    "author": "Haffbad",
                    "id": "eudb7x9",
                    "parent_id": "t1_eud3tge",
                    "score": -1,
                    "created_utc": 1563710966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was never a good name to start with",
            "author": null,
            "id": "eud5ll3",
            "parent_id": "t1_euct2al",
            "score": 3,
            "created_utc": 1563702686.0,
            "replies": [
                {
                    "body": ":)  True, but this guy needs to sharpen his game to even be considered a Splenda!",
                    "author": "Haffbad",
                    "id": "euen4rs",
                    "parent_id": "t1_eud5ll3",
                    "score": 1,
                    "created_utc": 1563748595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "His expectations are delusional. Just because you’re upfront about your expectations doesn’t mean they are reasonable and immune to critique.",
            "author": null,
            "id": "eud5mm6",
            "parent_id": "t1_euclbk4",
            "score": 13,
            "created_utc": 1563702732.0,
            "replies": [
                {
                    "body": "What makes your opinion more valid than his expectation? This is all value judgment. I think you are delusional in your response.\n\nHe was polite and stated clearly what he wanted. If it's not what you want just move on. Why bitch and moan about it like a fucking kid. We all know how sugar works.",
                    "author": "MofeedSaid",
                    "id": "eudjh9l",
                    "parent_id": "t1_eud5mm6",
                    "score": -6,
                    "created_utc": 1563719216.0,
                    "replies": [
                        {
                            "body": "Because he is offering something that is far below market value and has far higher expectations than our appropriate, and he completely flew off the handle when she expressed that to him. Don’t be so one-sided just because you agree with him and you want something that is far more valuable than what you were prepared to offer, market value is market value and girl should not be getting banned for expressing that they know their value in the sugar bowl. \n\nI have found that many men who get offended like this are not prepared to offer substantial allowances, it seems that lower financial security results in lower forms of conduct. It’s all across the board, rarely have I found men or women who are prepared to provide a present/receive a high-level allowance behaving in such ways.",
                            "author": "maincoursdelegance",
                            "id": "eudq4sc",
                            "parent_id": "t1_eudjh9l",
                            "score": 9,
                            "created_utc": 1563724578.0,
                            "replies": []
                        },
                        {
                            "body": "How is asking for unlimited access polite?! Just because you’re similarly delusional doesn’t mean this is a reasonable request in any way, shape, or form. Pointing out his delusional thinking isn’t bitching and moaning.",
                            "author": null,
                            "id": "euds6m8",
                            "parent_id": "t1_eudjh9l",
                            "score": 10,
                            "created_utc": 1563726133.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's a bit harsh..  She said she had done allowance and PPM before..  Sounds like a pretty common SB situation. \n\nHis attitude was unhealthy regardless of the dollars.  All people should stand up to and walk away from mistreatment and emotional abuse.",
            "author": "TXPolyDaddy",
            "id": "eue12rl",
            "parent_id": "t1_eudioyg",
            "score": 9,
            "created_utc": 1563732603.0,
            "replies": []
        },
        {
            "body": "And people wonder why ghosting is so common. It exactly because of guys like this. Ghost, block and report is unfortunately the right thing to do here. \n\nI still can't believe that he said that he was expecting \"unlimited access\" to you. Who even says that?",
            "author": "denardos",
            "id": "eucv932",
            "parent_id": "t1_euckwgh",
            "score": 35,
            "created_utc": 1563688165.0,
            "replies": [
                {
                    "body": "The \"unlimited access\" thing still has my skin crawling tbh",
                    "author": "Mopsydoll",
                    "id": "eud6is6",
                    "parent_id": "t1_eucv932",
                    "score": 22,
                    "created_utc": 1563704171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And you know that guy is home, sitting with his feet up, thinking how great it is to be a douche canoe",
            "author": "Azurecole",
            "id": "euclea4",
            "parent_id": "t1_euckwgh",
            "score": 26,
            "created_utc": 1563678483.0,
            "replies": []
        },
        {
            "body": "I believe they're cracking down on any mention of PPM. This is why it's a good idea to go to text as quickly as possible.",
            "author": "ContriteSplendaDaddy",
            "id": "euct9r9",
            "parent_id": "t1_eucmjzm",
            "score": 18,
            "created_utc": 1563685978.0,
            "replies": []
        },
        {
            "body": "I got banned twice for standing up for myself against potential SD. It’s ridiculous how a SD word is gold on that site.",
            "author": "babby_lizzzy",
            "id": "euebmsz",
            "parent_id": "t1_eucmjzm",
            "score": 11,
            "created_utc": 1563740309.0,
            "replies": [
                {
                    "body": "Isn’t it? \nOne disgruntled SD can get SA to ban your account, forcing you to make another one, & I believe they use facial tracking so now I can’t use pics with my face lol.",
                    "author": null,
                    "id": "eufekmg",
                    "parent_id": "t1_euebmsz",
                    "score": 3,
                    "created_utc": 1563771424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I believe you still need to provide evidence.  The ban would be temporary until they review copies of messages or text.  I've had to provide evidence to get scammers banned.",
            "author": "willfromvb",
            "id": "eud2613",
            "parent_id": "t1_eucmjzm",
            "score": -1,
            "created_utc": 1563697301.0,
            "replies": []
        },
        {
            "body": "Then everyone offering it is a John.",
            "author": "maincoursdelegance",
            "id": "eudq1mw",
            "parent_id": "t1_eudjzrg",
            "score": 11,
            "created_utc": 1563724511.0,
            "replies": []
        },
        {
            "body": "get off your high horse.  \n\nThere is no way I am doing a monthly arrangement till we have met a few times.  I've been burned 2x by girls getting the monthly upfront & then not delivery.",
            "author": "mollyflowers",
            "id": "eudqa26",
            "parent_id": "t1_eudjzrg",
            "score": 0,
            "created_utc": 1563724691.0,
            "replies": []
        },
        {
            "body": "I'd put it at 50/50. \"It's always about money with you people\" is such a quintinessential ethnic slur that anyone with any self-awareness and sense of decency wouldn't say that to a minority.",
            "author": "ContriteSplendaDaddy",
            "id": "euded0j",
            "parent_id": "t1_eud32d6",
            "score": 9,
            "created_utc": 1563714491.0,
            "replies": [
                {
                    "body": "He definitely was relying heavily on the “gold digger” stereotype so it’s not a stretch to think he’d also fetishize her race and hold ethnic stereotypes as well. Some SDs feel more comfortable expressing this fetishization on SA because “they’re paying for the fantasy” and then the ugly stereotypes hat accompany this toxic fetishization come out. Regardless, even without a racial component it’s ridiculous to throw out the gold digger stereotype on SA. Legitimate criticisms of unrealistic allowances are one thing but it grinds my gears to see wannabe SDs so uncomfortable with a money exchange.",
                    "author": null,
                    "id": "euecofw",
                    "parent_id": "t1_euded0j",
                    "score": 7,
                    "created_utc": 1563741065.0,
                    "replies": []
                },
                {
                    "body": "You do realise that the complete overuse of the word racist or homophobic or misogynistic has devalued the word and real meaning.\n\nHe was out of line and an ahole regardless so that is sufficient to ban/block/ move on and learn from it.",
                    "author": "TXPolyDaddy",
                    "id": "eue0q01",
                    "parent_id": "t1_euded0j",
                    "score": 1,
                    "created_utc": 1563732346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t care if it’s “true”. I would rather someone say something before just ghosting. I’ve never gone off on someone for not thinking that we were a fit. If I did truly enjoyed getting to know them, I told him that and I think them for their time. I then proceed to wish them the very best, and I mean it. If I forgot to wish them the best then that was clearly an oversight on my part. However, I would be surprised if that happens very often.",
            "author": "TirzahRed",
            "id": "eucurfo",
            "parent_id": "t1_eucu7l7",
            "score": 1,
            "created_utc": 1563687612.0,
            "replies": [
                {
                    "body": "What you would prefer and what works best for other people, often different.\n\nI fucking hate getting ghosted, it's my least favorite thing, I'm absolutely not the kind of guy who would blow up at someone, but I understand why people ghost, even though I think on a net it creates more pain than it avoids.",
                    "author": "Sugarbeggar",
                    "id": "eucyiq3",
                    "parent_id": "t1_eucurfo",
                    "score": 10,
                    "created_utc": 1563692195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eudaayy",
            "parent_id": "t1_eucr4tv",
            "score": -5,
            "created_utc": 1563709785.0,
            "replies": [
                {
                    "body": "Absolutely. It’s really hard to get anyone banned, regardless if you have a premium account or not. This guy had to get enough evidence of escorting or prostitution terms. The way the OP described it seems there was more to the conversation.",
                    "author": "Limitlesspappy",
                    "id": "eudy1qm",
                    "parent_id": "t1_eudaayy",
                    "score": 1,
                    "created_utc": 1563730407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It takes work to get someone banned on SA. You have to provide lots of evidence and screenshots.",
            "author": "Limitlesspappy",
            "id": "eue3vmd",
            "parent_id": "t1_eue2t6b",
            "score": 1,
            "created_utc": 1563734660.0,
            "replies": []
        },
        {
            "body": "That's true for actual Splenda Daddies. Sometimes, though, IMO the term 'Splenda Daddy\" is used to disparage someone who doesn't have a budget level judged appropriate. \n\nIn the case of the OP, the guy being described seems to be, at minimum, out of touch with the workings of the Bowl.",
            "author": "Haffbad",
            "id": "eudb7x9",
            "parent_id": "t1_eud3tge",
            "score": -1,
            "created_utc": 1563710966.0,
            "replies": []
        },
        {
            "body": ":)  True, but this guy needs to sharpen his game to even be considered a Splenda!",
            "author": "Haffbad",
            "id": "euen4rs",
            "parent_id": "t1_eud5ll3",
            "score": 1,
            "created_utc": 1563748595.0,
            "replies": []
        },
        {
            "body": "What makes your opinion more valid than his expectation? This is all value judgment. I think you are delusional in your response.\n\nHe was polite and stated clearly what he wanted. If it's not what you want just move on. Why bitch and moan about it like a fucking kid. We all know how sugar works.",
            "author": "MofeedSaid",
            "id": "eudjh9l",
            "parent_id": "t1_eud5mm6",
            "score": -6,
            "created_utc": 1563719216.0,
            "replies": [
                {
                    "body": "Because he is offering something that is far below market value and has far higher expectations than our appropriate, and he completely flew off the handle when she expressed that to him. Don’t be so one-sided just because you agree with him and you want something that is far more valuable than what you were prepared to offer, market value is market value and girl should not be getting banned for expressing that they know their value in the sugar bowl. \n\nI have found that many men who get offended like this are not prepared to offer substantial allowances, it seems that lower financial security results in lower forms of conduct. It’s all across the board, rarely have I found men or women who are prepared to provide a present/receive a high-level allowance behaving in such ways.",
                    "author": "maincoursdelegance",
                    "id": "eudq4sc",
                    "parent_id": "t1_eudjh9l",
                    "score": 9,
                    "created_utc": 1563724578.0,
                    "replies": []
                },
                {
                    "body": "How is asking for unlimited access polite?! Just because you’re similarly delusional doesn’t mean this is a reasonable request in any way, shape, or form. Pointing out his delusional thinking isn’t bitching and moaning.",
                    "author": null,
                    "id": "euds6m8",
                    "parent_id": "t1_eudjh9l",
                    "score": 10,
                    "created_utc": 1563726133.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The \"unlimited access\" thing still has my skin crawling tbh",
            "author": "Mopsydoll",
            "id": "eud6is6",
            "parent_id": "t1_eucv932",
            "score": 22,
            "created_utc": 1563704171.0,
            "replies": []
        },
        {
            "body": "Isn’t it? \nOne disgruntled SD can get SA to ban your account, forcing you to make another one, & I believe they use facial tracking so now I can’t use pics with my face lol.",
            "author": null,
            "id": "eufekmg",
            "parent_id": "t1_euebmsz",
            "score": 3,
            "created_utc": 1563771424.0,
            "replies": []
        },
        {
            "body": "He definitely was relying heavily on the “gold digger” stereotype so it’s not a stretch to think he’d also fetishize her race and hold ethnic stereotypes as well. Some SDs feel more comfortable expressing this fetishization on SA because “they’re paying for the fantasy” and then the ugly stereotypes hat accompany this toxic fetishization come out. Regardless, even without a racial component it’s ridiculous to throw out the gold digger stereotype on SA. Legitimate criticisms of unrealistic allowances are one thing but it grinds my gears to see wannabe SDs so uncomfortable with a money exchange.",
            "author": null,
            "id": "euecofw",
            "parent_id": "t1_euded0j",
            "score": 7,
            "created_utc": 1563741065.0,
            "replies": []
        },
        {
            "body": "You do realise that the complete overuse of the word racist or homophobic or misogynistic has devalued the word and real meaning.\n\nHe was out of line and an ahole regardless so that is sufficient to ban/block/ move on and learn from it.",
            "author": "TXPolyDaddy",
            "id": "eue0q01",
            "parent_id": "t1_euded0j",
            "score": 1,
            "created_utc": 1563732346.0,
            "replies": []
        },
        {
            "body": "What you would prefer and what works best for other people, often different.\n\nI fucking hate getting ghosted, it's my least favorite thing, I'm absolutely not the kind of guy who would blow up at someone, but I understand why people ghost, even though I think on a net it creates more pain than it avoids.",
            "author": "Sugarbeggar",
            "id": "eucyiq3",
            "parent_id": "t1_eucurfo",
            "score": 10,
            "created_utc": 1563692195.0,
            "replies": []
        },
        {
            "body": "Absolutely. It’s really hard to get anyone banned, regardless if you have a premium account or not. This guy had to get enough evidence of escorting or prostitution terms. The way the OP described it seems there was more to the conversation.",
            "author": "Limitlesspappy",
            "id": "eudy1qm",
            "parent_id": "t1_eudaayy",
            "score": 1,
            "created_utc": 1563730407.0,
            "replies": []
        },
        {
            "body": "Because he is offering something that is far below market value and has far higher expectations than our appropriate, and he completely flew off the handle when she expressed that to him. Don’t be so one-sided just because you agree with him and you want something that is far more valuable than what you were prepared to offer, market value is market value and girl should not be getting banned for expressing that they know their value in the sugar bowl. \n\nI have found that many men who get offended like this are not prepared to offer substantial allowances, it seems that lower financial security results in lower forms of conduct. It’s all across the board, rarely have I found men or women who are prepared to provide a present/receive a high-level allowance behaving in such ways.",
            "author": "maincoursdelegance",
            "id": "eudq4sc",
            "parent_id": "t1_eudjh9l",
            "score": 9,
            "created_utc": 1563724578.0,
            "replies": []
        },
        {
            "body": "How is asking for unlimited access polite?! Just because you’re similarly delusional doesn’t mean this is a reasonable request in any way, shape, or form. Pointing out his delusional thinking isn’t bitching and moaning.",
            "author": null,
            "id": "euds6m8",
            "parent_id": "t1_eudjh9l",
            "score": 10,
            "created_utc": 1563726133.0,
            "replies": []
        }
    ]
}