{
    "title": "PSA - Take the picture to your barber. Do not ask us the name of the hairstyle - there probably isn't one.",
    "post_id": "7m7wkk",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/7m7wkk/psa_take_the_picture_to_your_barber_do_not_ask_us/",
    "author": null,
    "body": "Part of the reason I got frustrated and stopped modding this sub as much as I wanted to was because a good 50% of the posts are \"What is this hairstyle called?\" or \"How do I get this hairstyle?\" and monitoring this sub for those posts is difficult with a career, a family, etc. I'm sorry about that, but here's what I have to say:\n\nThere is likely not a name for the hairstyle. There's undercuts, long on top/short on sides, curly/wavy.. that's about it.\n\n#**PLEASE GO TAKE THE PICTURE WITH YOU TO THE BARBER.**\n\n There is NOTHING embarrassing about this. It is *significantly* easier for them to have a picture than for you to try and awkwardly say, \"yeah so I want like.. a fringe.. but um textured on the top and shorter on the sides and the back. Like.. idk what would an inch off of the top look like??\"\n\n#**PLEASE REPORT THESE POSTS**.\n\nThey will be removed from now on. They are cluttering this subreddit and are completely unneeded because the only right answer is to take in the picture.\n\nIf you *really* want to know, ask in the /mha general/ thread that I'm stickying. Even then you probably won't get an answer because **there isn't one**. \n\nAnyways, happy holidays. Please stop posting these questions. Please.",
    "url": "https://www.reddit.com/r/malehairadvice/comments/7m7wkk/psa_take_the_picture_to_your_barber_do_not_ask_us/",
    "score": 396,
    "upvote_ratio": 0.96,
    "created_utc": 1514296993.0,
    "num_comments": 1,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[That first report, haha.](http://imgur.com/KsOSAvW)",
            "author": "nathanpaulyoung",
            "id": "drspzvt",
            "parent_id": "t3_7m7wkk",
            "score": 1,
            "created_utc": 1514334028.0,
            "replies": []
        }
    ]
}