{
    "title": "My Splenda Daddy is coming to town!",
    "post_id": "go85mo",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/go85mo/my_splenda_daddy_is_coming_to_town/",
    "author": "musesb",
    "body": "I’m pretty excited to see him. So this guy, who was one of my very first dates in the bowl, nearly went broke trying to provide for me. He helped me move into my apartment and we had a good run until he confessed sheepishly that he really can’t afford my allowance. \n\nHe always gave me “things.” I assumed because he owns his own company and can write them off. But that wasn’t what I needed so we ended it and I found another. \n\nWe stopped seeing each other and he moved to another state for work. His family is here and he comes to town a few times a year (his buddy is flying him private before you mention to c word).\n\nHe bring me gifts like nespresso pods and gummies from a Nevada, he changed out my shower hardware and he does all the repairs around my house (I keep a running honey-do list for him), makes me laugh and is really into pleasing. Like super into it, which I found uncomfortable, but look forward to now. \n\nHe has taught me a lot and I’ve called him a few times when I was really sad. He has more patience than anyone I’ve ever met. Has never said an unkind thing to me and I am completely myself around him. I truly enjoy his laid-back and lighthearted personality. He’s a good man. \n\nHe’s my Splenda and my true friend and I like him a lot. \n\nWhy did I write this: Aren’t you just glad I’m not suicidal?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/go85mo/my_splenda_daddy_is_coming_to_town/",
    "score": 178,
    "upvote_ratio": 0.94,
    "created_utc": 1590104693.0,
    "num_comments": 59,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I have/had a Splenda Daddy. Never gave me straight cash but has paid my utilities/rent multiple times and oh, bailed me out of jail one time. Took me out to dinner for my birthday last year because it’s close to Christmas and everyone is home with their family. We can lay in bed and belly laugh for hours. I’ve painted two large pieces for him and he’s given me very thoughtful gifts. We met through work and I adore him. I know he loved me and maybe he still does — we stay in touch. I’ve had deep pocket daddies and I’ve had dudes who pretended to have what it took to be in the bowl. Everyone is different, but this guy is special to me. \n\n(LOL also realizing I’m posting this on my main and not my SB account, but whatever.)",
            "author": "gotnothing4u",
            "id": "freqwzj",
            "parent_id": "t3_go85mo",
            "score": 35,
            "created_utc": 1590114830.0,
            "replies": [
                {
                    "body": "Very sweet.",
                    "author": "musesb",
                    "id": "frerl1w",
                    "parent_id": "t1_freqwzj",
                    "score": 2,
                    "created_utc": 1590115243.0,
                    "replies": []
                },
                {
                    "body": "What about this makes him splenda? Depending on how long you dated, the amount of financial support he gave you could be quite a bit.",
                    "author": "SDprivatethrowaway",
                    "id": "frf9mu8",
                    "parent_id": "t1_freqwzj",
                    "score": 0,
                    "created_utc": 1590128105.0,
                    "replies": [
                        {
                            "body": "For me personally, when I am participating in the bowl, I expect more of a luxury allowance instead of my guy only covering bills. During this time with the aforementioned man, I  paid my own bills and he only helped if I was in a pinch. Ours could probably be considered a vanilla relationship, if he wasn't thirty years older.",
                            "author": "gotnothing4u",
                            "id": "frhszqj",
                            "parent_id": "t1_frf9mu8",
                            "score": 1,
                            "created_utc": 1590186038.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In b4 naysayers...\n\nLook, girl, as long as you're happy, that's all that matters!\n\nCongratulations for being happy!  I like seeing all people gushing about their SD/SB.",
            "author": "SugaShak",
            "id": "freb4w4",
            "parent_id": "t3_go85mo",
            "score": 69,
            "created_utc": 1590105441.0,
            "replies": [
                {
                    "body": "I mean he's no SD, but someone's going on a Costco spree. Just saying.",
                    "author": "musesb",
                    "id": "freby6z",
                    "parent_id": "t1_freb4w4",
                    "score": 42,
                    "created_utc": 1590105900.0,
                    "replies": [
                        {
                            "body": "Hahah! Costco Baby. That's a new one. Love it. I mean, someone brought me a bunch of toilet paper \\*from his own stash at home\\* when we couldn't find any anywhere around me and I thought that was pretty sweet",
                            "author": null,
                            "id": "frit2d9",
                            "parent_id": "t1_freby6z",
                            "score": 2,
                            "created_utc": 1590208672.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed.. this is a good thing.  Just seems like a nice guy he doesn't expect anything you don't and its all good.  Its almost like it morphed into .... a friendship (gasp).",
                    "author": "craa141",
                    "id": "frf2kyk",
                    "parent_id": "t1_freb4w4",
                    "score": 9,
                    "created_utc": 1590122478.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're lucky to have him in your existence, but you're super-fortunate to be aware of that fact **and** recognize it in such a charming, touching way.  That puts you in the 1%, perhaps not the infamous 1% group, but a rare breed nonetheless.\n\nHe likes to give and to please.  And you're accepting it.  Good!  But don't abuse the privilege, or give him the wrong impression—in case he's hopeful about something that's not in the cards at all.\n\nI **love** that you're not suicidal.",
            "author": null,
            "id": "fregapp",
            "parent_id": "t3_go85mo",
            "score": 26,
            "created_utc": 1590108431.0,
            "replies": [
                {
                    "body": "I would not. I care about him. Thanks for getting my reference.",
                    "author": "musesb",
                    "id": "freho7z",
                    "parent_id": "t1_fregapp",
                    "score": 7,
                    "created_utc": 1590109241.0,
                    "replies": [
                        {
                            "body": "I love hearing that.\n\nAll the best!",
                            "author": null,
                            "id": "fretrfa",
                            "parent_id": "t1_freho7z",
                            "score": 3,
                            "created_utc": 1590116590.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so cute 😭",
            "author": "hello_world_101",
            "id": "frea8qq",
            "parent_id": "t3_go85mo",
            "score": 14,
            "created_utc": 1590104938.0,
            "replies": []
        },
        {
            "body": "that's great. I'm so glad for you. money can't give you everything.  money is the basic line but it's not the only reason that some people chose to join the sugar bowl. I'm happy you have a true friend even if it is a Splenda daddy.",
            "author": "shreklee",
            "id": "frfi0e3",
            "parent_id": "t3_go85mo",
            "score": 4,
            "created_utc": 1590135868.0,
            "replies": [
                {
                    "body": "It's also why I like that people make the point here about how you can get more from a less rich guy than one who could afford more. It has to do with their level of generosity, Gs in the heart, not Gs in the bank, yo. hah.",
                    "author": null,
                    "id": "fritabz",
                    "parent_id": "t1_frfi0e3",
                    "score": 1,
                    "created_utc": 1590208839.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "frfngq5",
            "parent_id": "t3_go85mo",
            "score": 4,
            "created_utc": 1590141471.0,
            "replies": [
                {
                    "body": "Nope.",
                    "author": "musesb",
                    "id": "frg8m7s",
                    "parent_id": "t1_frfngq5",
                    "score": 2,
                    "created_utc": 1590157480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is awesome!",
            "author": "lavitaetroppobreve1",
            "id": "frfpnu2",
            "parent_id": "t3_go85mo",
            "score": 3,
            "created_utc": 1590143690.0,
            "replies": []
        },
        {
            "body": "I don’t know wtf you’re talking about. But yes. Very glad you’re not suicidal. 😘",
            "author": "StevenXBusby",
            "id": "frg9m5v",
            "parent_id": "t3_go85mo",
            "score": 3,
            "created_utc": 1590158025.0,
            "replies": []
        },
        {
            "body": "How are people coming to and going to towns in these times?",
            "author": null,
            "id": "frgh5gu",
            "parent_id": "t3_go85mo",
            "score": 3,
            "created_utc": 1590161956.0,
            "replies": [
                {
                    "body": "His best friend is a hobby pilot and has a little plane. I wouldn't want to meet someone right off a commercial flight.",
                    "author": "musesb",
                    "id": "frgifs3",
                    "parent_id": "t1_frgh5gu",
                    "score": 1,
                    "created_utc": 1590162599.0,
                    "replies": [
                        {
                            "body": "I know. I'm dealing with this right now. He's willing to come to me, but he would fly. If he drove by himself, that'd be one thing.",
                            "author": null,
                            "id": "fritgu8",
                            "parent_id": "t1_frgifs3",
                            "score": 1,
                            "created_utc": 1590208981.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had a few relationships like this where we didn’t have a traditional arrangement with scheduled meets or allowance. Often times there was a great chemistry but they either wanted something more intimate than I did (I’m platonic) or they aren’t in town enough for an ongoing arrangement.\n\nWe keep in touch casually and when they come to town I’ll clear my weekend for them. Sometimes I’ve also traveled with them and they fit the bill but we agree to no intimacy and no allowance. Again, these are friends I’d see regularly just because we’ve got great chemistry and I genuinely enjoy emotionally supporting people in my life and being there for them. Likewise, even though we don’t do weekly allowances they’re usually the first ones to offer to help in emergencies because they tend to be the first person I feel comfortable telling. I’ve also heard of them referred to as ‘floaters’.\n\nI agree yours sounds more like a Splenda daddy but just because he doesn’t have the cash doesn’t mean he can’t positively contribute to your life. That honey-do list is still saving you money and if you enjoy the company more power to you. As long as you both find it beneficial I don’t see the issue.",
            "author": "LVSugarBebe",
            "id": "frf4sfm",
            "parent_id": "t3_go85mo",
            "score": 5,
            "created_utc": 1590124150.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "frfjann",
                    "parent_id": "t1_frf4sfm",
                    "score": 3,
                    "created_utc": 1590137168.0,
                    "replies": [
                        {
                            "body": "Presently and for past couple years that I’ve been back in the sugar bowl all my arrangements have been strictly platonic. I’m not opposed to intimate arrangements and have had experience with them, but it just isn’t what I’m looking for right now and it has worked out well for me.",
                            "author": "LVSugarBebe",
                            "id": "frhqqb6",
                            "parent_id": "t1_frfjann",
                            "score": 3,
                            "created_utc": 1590184803.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "frj6sxr",
                                    "parent_id": "t1_frhqqb6",
                                    "score": 2,
                                    "created_utc": 1590220961.0,
                                    "replies": [
                                        {
                                            "body": "It’s a huge misconception likely spread by those who see no value in a sugar relationship without intimacy—a projection of their own belief and value system. The other reinforcement of this is most people just ignorantly repeat the narrative they’ve heard others on here say. I’ve spoken to others in platonic arrangements on here but we don’t speak up because we’re constantly called liars.\n\n*To clarify, platonic to me means truly just friendship and emotional connection, no kissing hand holding, dirty talk or even sexy pics.*\n\nI’m not saying they’re easy to find (as they almost always find me) but I’ve spent a long time refining my profile and communication to attract this type of SD. More often then not it’s actually an SD who is looking for a traditional arrangement but for one reason or another they really connected with my profile and decided it was worth getting to know me. When I ask them what specifically they connected with, most say something along the lines of “you’re very articulate and the most genuine profile I’ve read on here” or they specifically mention being impressed with my charitable work.\n\nI seriously have more meet up and arrangement requests than I have time to weed through so I’m honestly shocked people keep saying it’s impossible.\n\nSome factors I believe play a role in my success:\n- I’m 30 but the appearance and physique of a 21 yr old\n- I have a very gentle, girl next door look (I don’t post any sexy pics)\n- I’m very educated and cultured\n- I live in two major cities including a large tourist town (lots of platonic PPM requests).\n- I’m very caring and genuine in the relationships I pursue. I often give a lot more than I get.\n- Different needs I’ve filled are tour guide, dance partner, dinner date, business mentor, unofficial therapist, dating coach, travel companion, quarantine buddy, and friend to talk religion/politics with.\n\nI rarely bring up allowance or gifts, it’s always offered as a way they want to show their appreciation for my friendship and time (I’m a single mom so they know I pay my sitter and miss work to see them). Just this week I checked on two friends (from SA) who I hadn’t spoken to in a while and said I wanted to make sure they were doing well. After exchanging several messages they asked about my situation and pushed repeatedly for information regarding my finances and if they could help I’m any way. I’ve never met either of them because the pandemic started before we could meet but I make a point to check on them and care about their lives because I honestly care.\n\nAnyways, there’s probably more factors I’m missing but I hope that helps you and anyone else following to understand why gentlemen would seek out an arrangement without sex.",
                                            "author": "LVSugarBebe",
                                            "id": "frk0adw",
                                            "parent_id": "t1_frj6sxr",
                                            "score": 4,
                                            "created_utc": 1590246939.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "We need a better word for these guys than Splenda--maybe SplenDID. haha :)",
                    "author": null,
                    "id": "frite6i",
                    "parent_id": "t1_frf4sfm",
                    "score": 3,
                    "created_utc": 1590208922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm happy for you that you have an enjoyable FWB but I cringe when a splenda support OP comes out like yours. (almost)Nobody wants to encourage men who can't afford to be a SD to throw their hat in the ring.",
            "author": "GSSD",
            "id": "frgav0p",
            "parent_id": "t3_go85mo",
            "score": 3,
            "created_utc": 1590158698.0,
            "replies": [
                {
                    "body": "He's well off and owns a few businesses. I think he does have an SB, just not me. He wants to provide and is generous with what he has. As long as he is upfront about everything I don't see the problem. I did have to explain a lot to him. He thought of \"spoiling\" on a different level and he would take decent care of me for the rest of my life if I'd let him, just not liquid at this time. I think there's a place for him.",
                    "author": "musesb",
                    "id": "frgf142",
                    "parent_id": "t1_frgav0p",
                    "score": 2,
                    "created_utc": 1590160879.0,
                    "replies": [
                        {
                            "body": "> I think there's a place for him.\n\nIn the vanilla world for sure, not in a sugar one.",
                            "author": "GSSD",
                            "id": "frgnlbs",
                            "parent_id": "t1_frgf142",
                            "score": 6,
                            "created_utc": 1590165121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like a decent guy",
            "author": "ograx",
            "id": "freezum",
            "parent_id": "t3_go85mo",
            "score": 5,
            "created_utc": 1590107666.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "frebaa8",
            "parent_id": "t3_go85mo",
            "score": 9,
            "created_utc": 1590105526.0,
            "replies": [
                {
                    "body": "Yes but I met him on seeking so he knows the drill. Also would not vanilla date him. He’s a Splenda Daddy, let him be one. 😂",
                    "author": "musesb",
                    "id": "frebpc7",
                    "parent_id": "t1_frebaa8",
                    "score": 18,
                    "created_utc": 1590105762.0,
                    "replies": [
                        {
                            "body": "You can find this in a guy your age tho...my BF at like 19 did all this and more",
                            "author": "dancingqw33n17",
                            "id": "frekhkx",
                            "parent_id": "t1_frebpc7",
                            "score": 3,
                            "created_utc": 1590110919.0,
                            "replies": [
                                {
                                    "body": "I'm trying to bring some joy, perspective, and humor to our subreddit. He's not my bf, he's a failed attempt at an SR, but a positive influence on my life.",
                                    "author": "musesb",
                                    "id": "frel3el",
                                    "parent_id": "t1_frekhkx",
                                    "score": 22,
                                    "created_utc": 1590111279.0,
                                    "replies": [
                                        {
                                            "body": "No need to get defensive. I'm just posting for the 70k+ other people who are a lot of new, young Sbabies who read this subreddit.  \n\nThey deserve to know you can always date hypergamously and have some hot guy playing taskrabbit, even if that doesn't interested you.",
                                            "author": "dancingqw33n17",
                                            "id": "fren6gm",
                                            "parent_id": "t1_frel3el",
                                            "score": -4,
                                            "created_utc": 1590112541.0,
                                            "replies": [
                                                {
                                                    "body": "I am not defensive. :) don't understand the rest of what you wrote. 🤷🏻‍♀️ Is hypergamously a word? Dang. Also: what's task rabbit? Edit: now Googled. Ohhhh. That is a word! When I was younger I read pierre boudiou. He stated that one of the sure fire ways to move from one class to another was to become a teacher, but that takes work. Keep trying to fuck your way to the top with out refining your social skills. :)",
                                                    "author": "musesb",
                                                    "id": "frenmpt",
                                                    "parent_id": "t1_fren6gm",
                                                    "score": 5,
                                                    "created_utc": 1590112815.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
                                                            "author": "dancingqw33n17",
                                                            "id": "frfo8zm",
                                                            "parent_id": "t1_frenmpt",
                                                            "score": 7,
                                                            "created_utc": 1590142281.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                                                                    "author": "LaSirene23",
                                                                    "id": "frg0k4b",
                                                                    "parent_id": "t1_frfo8zm",
                                                                    "score": 7,
                                                                    "created_utc": 1590152657.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
                                                            "author": "dancingqw33n17",
                                                            "id": "freoj87",
                                                            "parent_id": "t1_frenmpt",
                                                            "score": -1,
                                                            "created_utc": 1590113369.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Why so mean, ma'am?",
                                                                    "author": "PioneerExperience",
                                                                    "id": "frepi77",
                                                                    "parent_id": "t1_freoj87",
                                                                    "score": 8,
                                                                    "created_utc": 1590113963.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                                                                    "author": "musesb",
                                                                    "id": "freptbe",
                                                                    "parent_id": "t1_freoj87",
                                                                    "score": 4,
                                                                    "created_utc": 1590114153.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "frerihc",
                                                                            "parent_id": "t1_freptbe",
                                                                            "score": 6,
                                                                            "created_utc": 1590115198.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                                                                    "author": "musesb",
                                                                                    "id": "frerzzq",
                                                                                    "parent_id": "t1_frerihc",
                                                                                    "score": 0,
                                                                                    "created_utc": 1590115496.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                                                                    "author": "musesb",
                                                                                    "id": "freuozv",
                                                                                    "parent_id": "t1_frerihc",
                                                                                    "score": 0,
                                                                                    "created_utc": 1590117172.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm afraid you can't find 19 years old guy is as patient as this \"Splenda Daddy\" and be kind enough to a lady.",
                                    "author": "shreklee",
                                    "id": "frfis0j",
                                    "parent_id": "t1_frekhkx",
                                    "score": 5,
                                    "created_utc": 1590136639.0,
                                    "replies": []
                                },
                                {
                                    "body": "You are implying that the age of the general populous here is something of a downside, you might be in the wrong place.",
                                    "author": "yeehaw_yall",
                                    "id": "frf704o",
                                    "parent_id": "t1_frekhkx",
                                    "score": 1,
                                    "created_utc": 1590125918.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's not fair to the Reddit community if your editing posts. Even if it makes me look better. Hello. Let the record stand or explain why you removed it.",
            "author": "musesb",
            "id": "frewjqn",
            "parent_id": "t3_go85mo",
            "score": 2,
            "created_utc": 1590118351.0,
            "replies": []
        },
        {
            "body": "I love your outlook on life and your prose. I repeat: your SD is one lucky guy. I’m glad you are having great experiences in the bowl",
            "author": "supportiveceo",
            "id": "freze8a",
            "parent_id": "t3_go85mo",
            "score": 4,
            "created_utc": 1590120227.0,
            "replies": []
        },
        {
            "body": "Is it just me or does this seem...off? You use to have a SR with him but now not anymore. Yet he’s still doing all these things for you and you have a new SD. It may not be much what he provides to you but it can easily come off as rinsing, even though yes, you use to have a SR with him. I’m assuming he’s doing all this with no expectations from you? Because most people wouldn’t do that and I can totally see it from the other end that he might be expecting to rekindle things (or hope so).",
            "author": null,
            "id": "frewk6b",
            "parent_id": "t3_go85mo",
            "score": 5,
            "created_utc": 1590118359.0,
            "replies": [
                {
                    "body": "He is really a very unique person. Deserving of this post. He lives 5 states away so I doubt it. He enjoys our time as do I. I'm not hurting him Reddit! Relax.",
                    "author": "musesb",
                    "id": "frex0ss",
                    "parent_id": "t1_frewk6b",
                    "score": 3,
                    "created_utc": 1590118657.0,
                    "replies": []
                },
                {
                    "body": "and you seem a little off with your 6 Karma. Just saying....",
                    "author": "musesb",
                    "id": "frey32l",
                    "parent_id": "t1_frewk6b",
                    "score": -3,
                    "created_utc": 1590119349.0,
                    "replies": [
                        {
                            "body": "No need to get defensive if that’s where you’re coming from. I mostly lurk and barely post. It just seems off that someone who is no longer in a SR with said individual is still helping out and contributing, and considering that he nearly went broke trying to please you, it’s just concerning from that end since it’s no longer a SR. Not that this is going to change your mind or influence you.",
                            "author": null,
                            "id": "freymbj",
                            "parent_id": "t1_frey32l",
                            "score": 2,
                            "created_utc": 1590119708.0,
                            "replies": [
                                {
                                    "body": "Oh hey there Trollheterogamy! I have been an extremely positive influence in his life. He is now a true friend. Can u comprehend this? This. Is. Not. Sex. Work.",
                                    "author": "musesb",
                                    "id": "frez5hc",
                                    "parent_id": "t1_freymbj",
                                    "score": 0,
                                    "created_utc": 1590120067.0,
                                    "replies": [
                                        {
                                            "body": "Nobody is even talking about sex work lol, why you so triggered? It’s not ok to wonder about the other side of the coin because, presumably, it could come off as taking advantage of someone? If you were friends and it truly works, cool, so why get all defensive? Lol. You could of just dropped it then. Just because he loves five states away doesn’t mean anything. Maybe he could really be trying to rekindle an SR. Maybe not. Who knows? I’ve had a baby live on the other side of the world, it didn’t stop me from having some sort of arrangement with said individual. Granted it wasn’t ideal, but for the time we made something out of nothing.",
                                            "author": null,
                                            "id": "frezui0",
                                            "parent_id": "t1_frez5hc",
                                            "score": 4,
                                            "created_utc": 1590120536.0,
                                            "replies": [
                                                {
                                                    "body": "Good. Same person as before with new name and different issue with my post... Let people have different interpretations. There's room for everyone. No?",
                                                    "author": "musesb",
                                                    "id": "frf04yg",
                                                    "parent_id": "t1_frezui0",
                                                    "score": 1,
                                                    "created_utc": 1590120733.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
                                                            "author": null,
                                                            "id": "frf0nmi",
                                                            "parent_id": "t1_frf04yg",
                                                            "score": 7,
                                                            "created_utc": 1590121090.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sorry assumed you were my troll. I guess not. My bad.",
                                                                    "author": "musesb",
                                                                    "id": "frf1igv",
                                                                    "parent_id": "t1_frf0nmi",
                                                                    "score": 1,
                                                                    "created_utc": 1590121701.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It sounds like you’re happy and that’s all that matters congrats",
            "author": "Maqlovin10and3",
            "id": "frf5krf",
            "parent_id": "t3_go85mo",
            "score": 2,
            "created_utc": 1590124769.0,
            "replies": []
        },
        {
            "body": "Glad you're excited to see him again. Pity he promised an allowance more substantial than he could afford though. Seems like he's got the spirit of an SD.",
            "author": "SDprivatethrowaway",
            "id": "frf9qmh",
            "parent_id": "t3_go85mo",
            "score": 2,
            "created_utc": 1590128195.0,
            "replies": [
                {
                    "body": "The spirit, but not the pockets. ;)",
                    "author": "musesb",
                    "id": "frg8e62",
                    "parent_id": "t1_frf9qmh",
                    "score": 2,
                    "created_utc": 1590157357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go ahead and DM me, I’m happy to help as I can.",
            "author": "LVSugarBebe",
            "id": "fryp6it",
            "parent_id": "t3_go85mo",
            "score": 1,
            "created_utc": 1590572432.0,
            "replies": []
        },
        {
            "body": "Sounds like you’ll have a great time. Have fun.",
            "author": "death_by_creampie",
            "id": "fretw64",
            "parent_id": "t3_go85mo",
            "score": 1,
            "created_utc": 1590116672.0,
            "replies": []
        },
        {
            "body": "Very sweet.",
            "author": "musesb",
            "id": "frerl1w",
            "parent_id": "t1_freqwzj",
            "score": 2,
            "created_utc": 1590115243.0,
            "replies": []
        },
        {
            "body": "What about this makes him splenda? Depending on how long you dated, the amount of financial support he gave you could be quite a bit.",
            "author": "SDprivatethrowaway",
            "id": "frf9mu8",
            "parent_id": "t1_freqwzj",
            "score": 0,
            "created_utc": 1590128105.0,
            "replies": [
                {
                    "body": "For me personally, when I am participating in the bowl, I expect more of a luxury allowance instead of my guy only covering bills. During this time with the aforementioned man, I  paid my own bills and he only helped if I was in a pinch. Ours could probably be considered a vanilla relationship, if he wasn't thirty years older.",
                    "author": "gotnothing4u",
                    "id": "frhszqj",
                    "parent_id": "t1_frf9mu8",
                    "score": 1,
                    "created_utc": 1590186038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean he's no SD, but someone's going on a Costco spree. Just saying.",
            "author": "musesb",
            "id": "freby6z",
            "parent_id": "t1_freb4w4",
            "score": 42,
            "created_utc": 1590105900.0,
            "replies": [
                {
                    "body": "Hahah! Costco Baby. That's a new one. Love it. I mean, someone brought me a bunch of toilet paper \\*from his own stash at home\\* when we couldn't find any anywhere around me and I thought that was pretty sweet",
                    "author": null,
                    "id": "frit2d9",
                    "parent_id": "t1_freby6z",
                    "score": 2,
                    "created_utc": 1590208672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed.. this is a good thing.  Just seems like a nice guy he doesn't expect anything you don't and its all good.  Its almost like it morphed into .... a friendship (gasp).",
            "author": "craa141",
            "id": "frf2kyk",
            "parent_id": "t1_freb4w4",
            "score": 9,
            "created_utc": 1590122478.0,
            "replies": []
        },
        {
            "body": "I would not. I care about him. Thanks for getting my reference.",
            "author": "musesb",
            "id": "freho7z",
            "parent_id": "t1_fregapp",
            "score": 7,
            "created_utc": 1590109241.0,
            "replies": [
                {
                    "body": "I love hearing that.\n\nAll the best!",
                    "author": null,
                    "id": "fretrfa",
                    "parent_id": "t1_freho7z",
                    "score": 3,
                    "created_utc": 1590116590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's also why I like that people make the point here about how you can get more from a less rich guy than one who could afford more. It has to do with their level of generosity, Gs in the heart, not Gs in the bank, yo. hah.",
            "author": null,
            "id": "fritabz",
            "parent_id": "t1_frfi0e3",
            "score": 1,
            "created_utc": 1590208839.0,
            "replies": []
        },
        {
            "body": "Nope.",
            "author": "musesb",
            "id": "frg8m7s",
            "parent_id": "t1_frfngq5",
            "score": 2,
            "created_utc": 1590157480.0,
            "replies": []
        },
        {
            "body": "His best friend is a hobby pilot and has a little plane. I wouldn't want to meet someone right off a commercial flight.",
            "author": "musesb",
            "id": "frgifs3",
            "parent_id": "t1_frgh5gu",
            "score": 1,
            "created_utc": 1590162599.0,
            "replies": [
                {
                    "body": "I know. I'm dealing with this right now. He's willing to come to me, but he would fly. If he drove by himself, that'd be one thing.",
                    "author": null,
                    "id": "fritgu8",
                    "parent_id": "t1_frgifs3",
                    "score": 1,
                    "created_utc": 1590208981.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "frfjann",
            "parent_id": "t1_frf4sfm",
            "score": 3,
            "created_utc": 1590137168.0,
            "replies": [
                {
                    "body": "Presently and for past couple years that I’ve been back in the sugar bowl all my arrangements have been strictly platonic. I’m not opposed to intimate arrangements and have had experience with them, but it just isn’t what I’m looking for right now and it has worked out well for me.",
                    "author": "LVSugarBebe",
                    "id": "frhqqb6",
                    "parent_id": "t1_frfjann",
                    "score": 3,
                    "created_utc": 1590184803.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "frj6sxr",
                            "parent_id": "t1_frhqqb6",
                            "score": 2,
                            "created_utc": 1590220961.0,
                            "replies": [
                                {
                                    "body": "It’s a huge misconception likely spread by those who see no value in a sugar relationship without intimacy—a projection of their own belief and value system. The other reinforcement of this is most people just ignorantly repeat the narrative they’ve heard others on here say. I’ve spoken to others in platonic arrangements on here but we don’t speak up because we’re constantly called liars.\n\n*To clarify, platonic to me means truly just friendship and emotional connection, no kissing hand holding, dirty talk or even sexy pics.*\n\nI’m not saying they’re easy to find (as they almost always find me) but I’ve spent a long time refining my profile and communication to attract this type of SD. More often then not it’s actually an SD who is looking for a traditional arrangement but for one reason or another they really connected with my profile and decided it was worth getting to know me. When I ask them what specifically they connected with, most say something along the lines of “you’re very articulate and the most genuine profile I’ve read on here” or they specifically mention being impressed with my charitable work.\n\nI seriously have more meet up and arrangement requests than I have time to weed through so I’m honestly shocked people keep saying it’s impossible.\n\nSome factors I believe play a role in my success:\n- I’m 30 but the appearance and physique of a 21 yr old\n- I have a very gentle, girl next door look (I don’t post any sexy pics)\n- I’m very educated and cultured\n- I live in two major cities including a large tourist town (lots of platonic PPM requests).\n- I’m very caring and genuine in the relationships I pursue. I often give a lot more than I get.\n- Different needs I’ve filled are tour guide, dance partner, dinner date, business mentor, unofficial therapist, dating coach, travel companion, quarantine buddy, and friend to talk religion/politics with.\n\nI rarely bring up allowance or gifts, it’s always offered as a way they want to show their appreciation for my friendship and time (I’m a single mom so they know I pay my sitter and miss work to see them). Just this week I checked on two friends (from SA) who I hadn’t spoken to in a while and said I wanted to make sure they were doing well. After exchanging several messages they asked about my situation and pushed repeatedly for information regarding my finances and if they could help I’m any way. I’ve never met either of them because the pandemic started before we could meet but I make a point to check on them and care about their lives because I honestly care.\n\nAnyways, there’s probably more factors I’m missing but I hope that helps you and anyone else following to understand why gentlemen would seek out an arrangement without sex.",
                                    "author": "LVSugarBebe",
                                    "id": "frk0adw",
                                    "parent_id": "t1_frj6sxr",
                                    "score": 4,
                                    "created_utc": 1590246939.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We need a better word for these guys than Splenda--maybe SplenDID. haha :)",
            "author": null,
            "id": "frite6i",
            "parent_id": "t1_frf4sfm",
            "score": 3,
            "created_utc": 1590208922.0,
            "replies": []
        },
        {
            "body": "He's well off and owns a few businesses. I think he does have an SB, just not me. He wants to provide and is generous with what he has. As long as he is upfront about everything I don't see the problem. I did have to explain a lot to him. He thought of \"spoiling\" on a different level and he would take decent care of me for the rest of my life if I'd let him, just not liquid at this time. I think there's a place for him.",
            "author": "musesb",
            "id": "frgf142",
            "parent_id": "t1_frgav0p",
            "score": 2,
            "created_utc": 1590160879.0,
            "replies": [
                {
                    "body": "> I think there's a place for him.\n\nIn the vanilla world for sure, not in a sugar one.",
                    "author": "GSSD",
                    "id": "frgnlbs",
                    "parent_id": "t1_frgf142",
                    "score": 6,
                    "created_utc": 1590165121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes but I met him on seeking so he knows the drill. Also would not vanilla date him. He’s a Splenda Daddy, let him be one. 😂",
            "author": "musesb",
            "id": "frebpc7",
            "parent_id": "t1_frebaa8",
            "score": 18,
            "created_utc": 1590105762.0,
            "replies": [
                {
                    "body": "You can find this in a guy your age tho...my BF at like 19 did all this and more",
                    "author": "dancingqw33n17",
                    "id": "frekhkx",
                    "parent_id": "t1_frebpc7",
                    "score": 3,
                    "created_utc": 1590110919.0,
                    "replies": [
                        {
                            "body": "I'm trying to bring some joy, perspective, and humor to our subreddit. He's not my bf, he's a failed attempt at an SR, but a positive influence on my life.",
                            "author": "musesb",
                            "id": "frel3el",
                            "parent_id": "t1_frekhkx",
                            "score": 22,
                            "created_utc": 1590111279.0,
                            "replies": [
                                {
                                    "body": "No need to get defensive. I'm just posting for the 70k+ other people who are a lot of new, young Sbabies who read this subreddit.  \n\nThey deserve to know you can always date hypergamously and have some hot guy playing taskrabbit, even if that doesn't interested you.",
                                    "author": "dancingqw33n17",
                                    "id": "fren6gm",
                                    "parent_id": "t1_frel3el",
                                    "score": -4,
                                    "created_utc": 1590112541.0,
                                    "replies": [
                                        {
                                            "body": "I am not defensive. :) don't understand the rest of what you wrote. 🤷🏻‍♀️ Is hypergamously a word? Dang. Also: what's task rabbit? Edit: now Googled. Ohhhh. That is a word! When I was younger I read pierre boudiou. He stated that one of the sure fire ways to move from one class to another was to become a teacher, but that takes work. Keep trying to fuck your way to the top with out refining your social skills. :)",
                                            "author": "musesb",
                                            "id": "frenmpt",
                                            "parent_id": "t1_fren6gm",
                                            "score": 5,
                                            "created_utc": 1590112815.0,
                                            "replies": [
                                                {
                                                    "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
                                                    "author": "dancingqw33n17",
                                                    "id": "frfo8zm",
                                                    "parent_id": "t1_frenmpt",
                                                    "score": 7,
                                                    "created_utc": 1590142281.0,
                                                    "replies": [
                                                        {
                                                            "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                                                            "author": "LaSirene23",
                                                            "id": "frg0k4b",
                                                            "parent_id": "t1_frfo8zm",
                                                            "score": 7,
                                                            "created_utc": 1590152657.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
                                                    "author": "dancingqw33n17",
                                                    "id": "freoj87",
                                                    "parent_id": "t1_frenmpt",
                                                    "score": -1,
                                                    "created_utc": 1590113369.0,
                                                    "replies": [
                                                        {
                                                            "body": "Why so mean, ma'am?",
                                                            "author": "PioneerExperience",
                                                            "id": "frepi77",
                                                            "parent_id": "t1_freoj87",
                                                            "score": 8,
                                                            "created_utc": 1590113963.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                                                            "author": "musesb",
                                                            "id": "freptbe",
                                                            "parent_id": "t1_freoj87",
                                                            "score": 4,
                                                            "created_utc": 1590114153.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "frerihc",
                                                                    "parent_id": "t1_freptbe",
                                                                    "score": 6,
                                                                    "created_utc": 1590115198.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                                                            "author": "musesb",
                                                                            "id": "frerzzq",
                                                                            "parent_id": "t1_frerihc",
                                                                            "score": 0,
                                                                            "created_utc": 1590115496.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                                                            "author": "musesb",
                                                                            "id": "freuozv",
                                                                            "parent_id": "t1_frerihc",
                                                                            "score": 0,
                                                                            "created_utc": 1590117172.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm afraid you can't find 19 years old guy is as patient as this \"Splenda Daddy\" and be kind enough to a lady.",
                            "author": "shreklee",
                            "id": "frfis0j",
                            "parent_id": "t1_frekhkx",
                            "score": 5,
                            "created_utc": 1590136639.0,
                            "replies": []
                        },
                        {
                            "body": "You are implying that the age of the general populous here is something of a downside, you might be in the wrong place.",
                            "author": "yeehaw_yall",
                            "id": "frf704o",
                            "parent_id": "t1_frekhkx",
                            "score": 1,
                            "created_utc": 1590125918.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is really a very unique person. Deserving of this post. He lives 5 states away so I doubt it. He enjoys our time as do I. I'm not hurting him Reddit! Relax.",
            "author": "musesb",
            "id": "frex0ss",
            "parent_id": "t1_frewk6b",
            "score": 3,
            "created_utc": 1590118657.0,
            "replies": []
        },
        {
            "body": "and you seem a little off with your 6 Karma. Just saying....",
            "author": "musesb",
            "id": "frey32l",
            "parent_id": "t1_frewk6b",
            "score": -3,
            "created_utc": 1590119349.0,
            "replies": [
                {
                    "body": "No need to get defensive if that’s where you’re coming from. I mostly lurk and barely post. It just seems off that someone who is no longer in a SR with said individual is still helping out and contributing, and considering that he nearly went broke trying to please you, it’s just concerning from that end since it’s no longer a SR. Not that this is going to change your mind or influence you.",
                    "author": null,
                    "id": "freymbj",
                    "parent_id": "t1_frey32l",
                    "score": 2,
                    "created_utc": 1590119708.0,
                    "replies": [
                        {
                            "body": "Oh hey there Trollheterogamy! I have been an extremely positive influence in his life. He is now a true friend. Can u comprehend this? This. Is. Not. Sex. Work.",
                            "author": "musesb",
                            "id": "frez5hc",
                            "parent_id": "t1_freymbj",
                            "score": 0,
                            "created_utc": 1590120067.0,
                            "replies": [
                                {
                                    "body": "Nobody is even talking about sex work lol, why you so triggered? It’s not ok to wonder about the other side of the coin because, presumably, it could come off as taking advantage of someone? If you were friends and it truly works, cool, so why get all defensive? Lol. You could of just dropped it then. Just because he loves five states away doesn’t mean anything. Maybe he could really be trying to rekindle an SR. Maybe not. Who knows? I’ve had a baby live on the other side of the world, it didn’t stop me from having some sort of arrangement with said individual. Granted it wasn’t ideal, but for the time we made something out of nothing.",
                                    "author": null,
                                    "id": "frezui0",
                                    "parent_id": "t1_frez5hc",
                                    "score": 4,
                                    "created_utc": 1590120536.0,
                                    "replies": [
                                        {
                                            "body": "Good. Same person as before with new name and different issue with my post... Let people have different interpretations. There's room for everyone. No?",
                                            "author": "musesb",
                                            "id": "frf04yg",
                                            "parent_id": "t1_frezui0",
                                            "score": 1,
                                            "created_utc": 1590120733.0,
                                            "replies": [
                                                {
                                                    "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
                                                    "author": null,
                                                    "id": "frf0nmi",
                                                    "parent_id": "t1_frf04yg",
                                                    "score": 7,
                                                    "created_utc": 1590121090.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry assumed you were my troll. I guess not. My bad.",
                                                            "author": "musesb",
                                                            "id": "frf1igv",
                                                            "parent_id": "t1_frf0nmi",
                                                            "score": 1,
                                                            "created_utc": 1590121701.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The spirit, but not the pockets. ;)",
            "author": "musesb",
            "id": "frg8e62",
            "parent_id": "t1_frf9qmh",
            "score": 2,
            "created_utc": 1590157357.0,
            "replies": []
        },
        {
            "body": "For me personally, when I am participating in the bowl, I expect more of a luxury allowance instead of my guy only covering bills. During this time with the aforementioned man, I  paid my own bills and he only helped if I was in a pinch. Ours could probably be considered a vanilla relationship, if he wasn't thirty years older.",
            "author": "gotnothing4u",
            "id": "frhszqj",
            "parent_id": "t1_frf9mu8",
            "score": 1,
            "created_utc": 1590186038.0,
            "replies": []
        },
        {
            "body": "Hahah! Costco Baby. That's a new one. Love it. I mean, someone brought me a bunch of toilet paper \\*from his own stash at home\\* when we couldn't find any anywhere around me and I thought that was pretty sweet",
            "author": null,
            "id": "frit2d9",
            "parent_id": "t1_freby6z",
            "score": 2,
            "created_utc": 1590208672.0,
            "replies": []
        },
        {
            "body": "I love hearing that.\n\nAll the best!",
            "author": null,
            "id": "fretrfa",
            "parent_id": "t1_freho7z",
            "score": 3,
            "created_utc": 1590116590.0,
            "replies": []
        },
        {
            "body": "I know. I'm dealing with this right now. He's willing to come to me, but he would fly. If he drove by himself, that'd be one thing.",
            "author": null,
            "id": "fritgu8",
            "parent_id": "t1_frgifs3",
            "score": 1,
            "created_utc": 1590208981.0,
            "replies": []
        },
        {
            "body": "Presently and for past couple years that I’ve been back in the sugar bowl all my arrangements have been strictly platonic. I’m not opposed to intimate arrangements and have had experience with them, but it just isn’t what I’m looking for right now and it has worked out well for me.",
            "author": "LVSugarBebe",
            "id": "frhqqb6",
            "parent_id": "t1_frfjann",
            "score": 3,
            "created_utc": 1590184803.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "frj6sxr",
                    "parent_id": "t1_frhqqb6",
                    "score": 2,
                    "created_utc": 1590220961.0,
                    "replies": [
                        {
                            "body": "It’s a huge misconception likely spread by those who see no value in a sugar relationship without intimacy—a projection of their own belief and value system. The other reinforcement of this is most people just ignorantly repeat the narrative they’ve heard others on here say. I’ve spoken to others in platonic arrangements on here but we don’t speak up because we’re constantly called liars.\n\n*To clarify, platonic to me means truly just friendship and emotional connection, no kissing hand holding, dirty talk or even sexy pics.*\n\nI’m not saying they’re easy to find (as they almost always find me) but I’ve spent a long time refining my profile and communication to attract this type of SD. More often then not it’s actually an SD who is looking for a traditional arrangement but for one reason or another they really connected with my profile and decided it was worth getting to know me. When I ask them what specifically they connected with, most say something along the lines of “you’re very articulate and the most genuine profile I’ve read on here” or they specifically mention being impressed with my charitable work.\n\nI seriously have more meet up and arrangement requests than I have time to weed through so I’m honestly shocked people keep saying it’s impossible.\n\nSome factors I believe play a role in my success:\n- I’m 30 but the appearance and physique of a 21 yr old\n- I have a very gentle, girl next door look (I don’t post any sexy pics)\n- I’m very educated and cultured\n- I live in two major cities including a large tourist town (lots of platonic PPM requests).\n- I’m very caring and genuine in the relationships I pursue. I often give a lot more than I get.\n- Different needs I’ve filled are tour guide, dance partner, dinner date, business mentor, unofficial therapist, dating coach, travel companion, quarantine buddy, and friend to talk religion/politics with.\n\nI rarely bring up allowance or gifts, it’s always offered as a way they want to show their appreciation for my friendship and time (I’m a single mom so they know I pay my sitter and miss work to see them). Just this week I checked on two friends (from SA) who I hadn’t spoken to in a while and said I wanted to make sure they were doing well. After exchanging several messages they asked about my situation and pushed repeatedly for information regarding my finances and if they could help I’m any way. I’ve never met either of them because the pandemic started before we could meet but I make a point to check on them and care about their lives because I honestly care.\n\nAnyways, there’s probably more factors I’m missing but I hope that helps you and anyone else following to understand why gentlemen would seek out an arrangement without sex.",
                            "author": "LVSugarBebe",
                            "id": "frk0adw",
                            "parent_id": "t1_frj6sxr",
                            "score": 4,
                            "created_utc": 1590246939.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I think there's a place for him.\n\nIn the vanilla world for sure, not in a sugar one.",
            "author": "GSSD",
            "id": "frgnlbs",
            "parent_id": "t1_frgf142",
            "score": 6,
            "created_utc": 1590165121.0,
            "replies": []
        },
        {
            "body": "You can find this in a guy your age tho...my BF at like 19 did all this and more",
            "author": "dancingqw33n17",
            "id": "frekhkx",
            "parent_id": "t1_frebpc7",
            "score": 3,
            "created_utc": 1590110919.0,
            "replies": [
                {
                    "body": "I'm trying to bring some joy, perspective, and humor to our subreddit. He's not my bf, he's a failed attempt at an SR, but a positive influence on my life.",
                    "author": "musesb",
                    "id": "frel3el",
                    "parent_id": "t1_frekhkx",
                    "score": 22,
                    "created_utc": 1590111279.0,
                    "replies": [
                        {
                            "body": "No need to get defensive. I'm just posting for the 70k+ other people who are a lot of new, young Sbabies who read this subreddit.  \n\nThey deserve to know you can always date hypergamously and have some hot guy playing taskrabbit, even if that doesn't interested you.",
                            "author": "dancingqw33n17",
                            "id": "fren6gm",
                            "parent_id": "t1_frel3el",
                            "score": -4,
                            "created_utc": 1590112541.0,
                            "replies": [
                                {
                                    "body": "I am not defensive. :) don't understand the rest of what you wrote. 🤷🏻‍♀️ Is hypergamously a word? Dang. Also: what's task rabbit? Edit: now Googled. Ohhhh. That is a word! When I was younger I read pierre boudiou. He stated that one of the sure fire ways to move from one class to another was to become a teacher, but that takes work. Keep trying to fuck your way to the top with out refining your social skills. :)",
                                    "author": "musesb",
                                    "id": "frenmpt",
                                    "parent_id": "t1_fren6gm",
                                    "score": 5,
                                    "created_utc": 1590112815.0,
                                    "replies": [
                                        {
                                            "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
                                            "author": "dancingqw33n17",
                                            "id": "frfo8zm",
                                            "parent_id": "t1_frenmpt",
                                            "score": 7,
                                            "created_utc": 1590142281.0,
                                            "replies": [
                                                {
                                                    "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                                                    "author": "LaSirene23",
                                                    "id": "frg0k4b",
                                                    "parent_id": "t1_frfo8zm",
                                                    "score": 7,
                                                    "created_utc": 1590152657.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
                                            "author": "dancingqw33n17",
                                            "id": "freoj87",
                                            "parent_id": "t1_frenmpt",
                                            "score": -1,
                                            "created_utc": 1590113369.0,
                                            "replies": [
                                                {
                                                    "body": "Why so mean, ma'am?",
                                                    "author": "PioneerExperience",
                                                    "id": "frepi77",
                                                    "parent_id": "t1_freoj87",
                                                    "score": 8,
                                                    "created_utc": 1590113963.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                                                    "author": "musesb",
                                                    "id": "freptbe",
                                                    "parent_id": "t1_freoj87",
                                                    "score": 4,
                                                    "created_utc": 1590114153.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "frerihc",
                                                            "parent_id": "t1_freptbe",
                                                            "score": 6,
                                                            "created_utc": 1590115198.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                                                    "author": "musesb",
                                                                    "id": "frerzzq",
                                                                    "parent_id": "t1_frerihc",
                                                                    "score": 0,
                                                                    "created_utc": 1590115496.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                                                    "author": "musesb",
                                                                    "id": "freuozv",
                                                                    "parent_id": "t1_frerihc",
                                                                    "score": 0,
                                                                    "created_utc": 1590117172.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm afraid you can't find 19 years old guy is as patient as this \"Splenda Daddy\" and be kind enough to a lady.",
                    "author": "shreklee",
                    "id": "frfis0j",
                    "parent_id": "t1_frekhkx",
                    "score": 5,
                    "created_utc": 1590136639.0,
                    "replies": []
                },
                {
                    "body": "You are implying that the age of the general populous here is something of a downside, you might be in the wrong place.",
                    "author": "yeehaw_yall",
                    "id": "frf704o",
                    "parent_id": "t1_frekhkx",
                    "score": 1,
                    "created_utc": 1590125918.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No need to get defensive if that’s where you’re coming from. I mostly lurk and barely post. It just seems off that someone who is no longer in a SR with said individual is still helping out and contributing, and considering that he nearly went broke trying to please you, it’s just concerning from that end since it’s no longer a SR. Not that this is going to change your mind or influence you.",
            "author": null,
            "id": "freymbj",
            "parent_id": "t1_frey32l",
            "score": 2,
            "created_utc": 1590119708.0,
            "replies": [
                {
                    "body": "Oh hey there Trollheterogamy! I have been an extremely positive influence in his life. He is now a true friend. Can u comprehend this? This. Is. Not. Sex. Work.",
                    "author": "musesb",
                    "id": "frez5hc",
                    "parent_id": "t1_freymbj",
                    "score": 0,
                    "created_utc": 1590120067.0,
                    "replies": [
                        {
                            "body": "Nobody is even talking about sex work lol, why you so triggered? It’s not ok to wonder about the other side of the coin because, presumably, it could come off as taking advantage of someone? If you were friends and it truly works, cool, so why get all defensive? Lol. You could of just dropped it then. Just because he loves five states away doesn’t mean anything. Maybe he could really be trying to rekindle an SR. Maybe not. Who knows? I’ve had a baby live on the other side of the world, it didn’t stop me from having some sort of arrangement with said individual. Granted it wasn’t ideal, but for the time we made something out of nothing.",
                            "author": null,
                            "id": "frezui0",
                            "parent_id": "t1_frez5hc",
                            "score": 4,
                            "created_utc": 1590120536.0,
                            "replies": [
                                {
                                    "body": "Good. Same person as before with new name and different issue with my post... Let people have different interpretations. There's room for everyone. No?",
                                    "author": "musesb",
                                    "id": "frf04yg",
                                    "parent_id": "t1_frezui0",
                                    "score": 1,
                                    "created_utc": 1590120733.0,
                                    "replies": [
                                        {
                                            "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
                                            "author": null,
                                            "id": "frf0nmi",
                                            "parent_id": "t1_frf04yg",
                                            "score": 7,
                                            "created_utc": 1590121090.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry assumed you were my troll. I guess not. My bad.",
                                                    "author": "musesb",
                                                    "id": "frf1igv",
                                                    "parent_id": "t1_frf0nmi",
                                                    "score": 1,
                                                    "created_utc": 1590121701.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "frj6sxr",
            "parent_id": "t1_frhqqb6",
            "score": 2,
            "created_utc": 1590220961.0,
            "replies": [
                {
                    "body": "It’s a huge misconception likely spread by those who see no value in a sugar relationship without intimacy—a projection of their own belief and value system. The other reinforcement of this is most people just ignorantly repeat the narrative they’ve heard others on here say. I’ve spoken to others in platonic arrangements on here but we don’t speak up because we’re constantly called liars.\n\n*To clarify, platonic to me means truly just friendship and emotional connection, no kissing hand holding, dirty talk or even sexy pics.*\n\nI’m not saying they’re easy to find (as they almost always find me) but I’ve spent a long time refining my profile and communication to attract this type of SD. More often then not it’s actually an SD who is looking for a traditional arrangement but for one reason or another they really connected with my profile and decided it was worth getting to know me. When I ask them what specifically they connected with, most say something along the lines of “you’re very articulate and the most genuine profile I’ve read on here” or they specifically mention being impressed with my charitable work.\n\nI seriously have more meet up and arrangement requests than I have time to weed through so I’m honestly shocked people keep saying it’s impossible.\n\nSome factors I believe play a role in my success:\n- I’m 30 but the appearance and physique of a 21 yr old\n- I have a very gentle, girl next door look (I don’t post any sexy pics)\n- I’m very educated and cultured\n- I live in two major cities including a large tourist town (lots of platonic PPM requests).\n- I’m very caring and genuine in the relationships I pursue. I often give a lot more than I get.\n- Different needs I’ve filled are tour guide, dance partner, dinner date, business mentor, unofficial therapist, dating coach, travel companion, quarantine buddy, and friend to talk religion/politics with.\n\nI rarely bring up allowance or gifts, it’s always offered as a way they want to show their appreciation for my friendship and time (I’m a single mom so they know I pay my sitter and miss work to see them). Just this week I checked on two friends (from SA) who I hadn’t spoken to in a while and said I wanted to make sure they were doing well. After exchanging several messages they asked about my situation and pushed repeatedly for information regarding my finances and if they could help I’m any way. I’ve never met either of them because the pandemic started before we could meet but I make a point to check on them and care about their lives because I honestly care.\n\nAnyways, there’s probably more factors I’m missing but I hope that helps you and anyone else following to understand why gentlemen would seek out an arrangement without sex.",
                    "author": "LVSugarBebe",
                    "id": "frk0adw",
                    "parent_id": "t1_frj6sxr",
                    "score": 4,
                    "created_utc": 1590246939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm trying to bring some joy, perspective, and humor to our subreddit. He's not my bf, he's a failed attempt at an SR, but a positive influence on my life.",
            "author": "musesb",
            "id": "frel3el",
            "parent_id": "t1_frekhkx",
            "score": 22,
            "created_utc": 1590111279.0,
            "replies": [
                {
                    "body": "No need to get defensive. I'm just posting for the 70k+ other people who are a lot of new, young Sbabies who read this subreddit.  \n\nThey deserve to know you can always date hypergamously and have some hot guy playing taskrabbit, even if that doesn't interested you.",
                    "author": "dancingqw33n17",
                    "id": "fren6gm",
                    "parent_id": "t1_frel3el",
                    "score": -4,
                    "created_utc": 1590112541.0,
                    "replies": [
                        {
                            "body": "I am not defensive. :) don't understand the rest of what you wrote. 🤷🏻‍♀️ Is hypergamously a word? Dang. Also: what's task rabbit? Edit: now Googled. Ohhhh. That is a word! When I was younger I read pierre boudiou. He stated that one of the sure fire ways to move from one class to another was to become a teacher, but that takes work. Keep trying to fuck your way to the top with out refining your social skills. :)",
                            "author": "musesb",
                            "id": "frenmpt",
                            "parent_id": "t1_fren6gm",
                            "score": 5,
                            "created_utc": 1590112815.0,
                            "replies": [
                                {
                                    "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
                                    "author": "dancingqw33n17",
                                    "id": "frfo8zm",
                                    "parent_id": "t1_frenmpt",
                                    "score": 7,
                                    "created_utc": 1590142281.0,
                                    "replies": [
                                        {
                                            "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                                            "author": "LaSirene23",
                                            "id": "frg0k4b",
                                            "parent_id": "t1_frfo8zm",
                                            "score": 7,
                                            "created_utc": 1590152657.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
                                    "author": "dancingqw33n17",
                                    "id": "freoj87",
                                    "parent_id": "t1_frenmpt",
                                    "score": -1,
                                    "created_utc": 1590113369.0,
                                    "replies": [
                                        {
                                            "body": "Why so mean, ma'am?",
                                            "author": "PioneerExperience",
                                            "id": "frepi77",
                                            "parent_id": "t1_freoj87",
                                            "score": 8,
                                            "created_utc": 1590113963.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                                            "author": "musesb",
                                            "id": "freptbe",
                                            "parent_id": "t1_freoj87",
                                            "score": 4,
                                            "created_utc": 1590114153.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "frerihc",
                                                    "parent_id": "t1_freptbe",
                                                    "score": 6,
                                                    "created_utc": 1590115198.0,
                                                    "replies": [
                                                        {
                                                            "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                                            "author": "musesb",
                                                            "id": "frerzzq",
                                                            "parent_id": "t1_frerihc",
                                                            "score": 0,
                                                            "created_utc": 1590115496.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                                            "author": "musesb",
                                                            "id": "freuozv",
                                                            "parent_id": "t1_frerihc",
                                                            "score": 0,
                                                            "created_utc": 1590117172.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm afraid you can't find 19 years old guy is as patient as this \"Splenda Daddy\" and be kind enough to a lady.",
            "author": "shreklee",
            "id": "frfis0j",
            "parent_id": "t1_frekhkx",
            "score": 5,
            "created_utc": 1590136639.0,
            "replies": []
        },
        {
            "body": "You are implying that the age of the general populous here is something of a downside, you might be in the wrong place.",
            "author": "yeehaw_yall",
            "id": "frf704o",
            "parent_id": "t1_frekhkx",
            "score": 1,
            "created_utc": 1590125918.0,
            "replies": []
        },
        {
            "body": "Oh hey there Trollheterogamy! I have been an extremely positive influence in his life. He is now a true friend. Can u comprehend this? This. Is. Not. Sex. Work.",
            "author": "musesb",
            "id": "frez5hc",
            "parent_id": "t1_freymbj",
            "score": 0,
            "created_utc": 1590120067.0,
            "replies": [
                {
                    "body": "Nobody is even talking about sex work lol, why you so triggered? It’s not ok to wonder about the other side of the coin because, presumably, it could come off as taking advantage of someone? If you were friends and it truly works, cool, so why get all defensive? Lol. You could of just dropped it then. Just because he loves five states away doesn’t mean anything. Maybe he could really be trying to rekindle an SR. Maybe not. Who knows? I’ve had a baby live on the other side of the world, it didn’t stop me from having some sort of arrangement with said individual. Granted it wasn’t ideal, but for the time we made something out of nothing.",
                    "author": null,
                    "id": "frezui0",
                    "parent_id": "t1_frez5hc",
                    "score": 4,
                    "created_utc": 1590120536.0,
                    "replies": [
                        {
                            "body": "Good. Same person as before with new name and different issue with my post... Let people have different interpretations. There's room for everyone. No?",
                            "author": "musesb",
                            "id": "frf04yg",
                            "parent_id": "t1_frezui0",
                            "score": 1,
                            "created_utc": 1590120733.0,
                            "replies": [
                                {
                                    "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
                                    "author": null,
                                    "id": "frf0nmi",
                                    "parent_id": "t1_frf04yg",
                                    "score": 7,
                                    "created_utc": 1590121090.0,
                                    "replies": [
                                        {
                                            "body": "Sorry assumed you were my troll. I guess not. My bad.",
                                            "author": "musesb",
                                            "id": "frf1igv",
                                            "parent_id": "t1_frf0nmi",
                                            "score": 1,
                                            "created_utc": 1590121701.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a huge misconception likely spread by those who see no value in a sugar relationship without intimacy—a projection of their own belief and value system. The other reinforcement of this is most people just ignorantly repeat the narrative they’ve heard others on here say. I’ve spoken to others in platonic arrangements on here but we don’t speak up because we’re constantly called liars.\n\n*To clarify, platonic to me means truly just friendship and emotional connection, no kissing hand holding, dirty talk or even sexy pics.*\n\nI’m not saying they’re easy to find (as they almost always find me) but I’ve spent a long time refining my profile and communication to attract this type of SD. More often then not it’s actually an SD who is looking for a traditional arrangement but for one reason or another they really connected with my profile and decided it was worth getting to know me. When I ask them what specifically they connected with, most say something along the lines of “you’re very articulate and the most genuine profile I’ve read on here” or they specifically mention being impressed with my charitable work.\n\nI seriously have more meet up and arrangement requests than I have time to weed through so I’m honestly shocked people keep saying it’s impossible.\n\nSome factors I believe play a role in my success:\n- I’m 30 but the appearance and physique of a 21 yr old\n- I have a very gentle, girl next door look (I don’t post any sexy pics)\n- I’m very educated and cultured\n- I live in two major cities including a large tourist town (lots of platonic PPM requests).\n- I’m very caring and genuine in the relationships I pursue. I often give a lot more than I get.\n- Different needs I’ve filled are tour guide, dance partner, dinner date, business mentor, unofficial therapist, dating coach, travel companion, quarantine buddy, and friend to talk religion/politics with.\n\nI rarely bring up allowance or gifts, it’s always offered as a way they want to show their appreciation for my friendship and time (I’m a single mom so they know I pay my sitter and miss work to see them). Just this week I checked on two friends (from SA) who I hadn’t spoken to in a while and said I wanted to make sure they were doing well. After exchanging several messages they asked about my situation and pushed repeatedly for information regarding my finances and if they could help I’m any way. I’ve never met either of them because the pandemic started before we could meet but I make a point to check on them and care about their lives because I honestly care.\n\nAnyways, there’s probably more factors I’m missing but I hope that helps you and anyone else following to understand why gentlemen would seek out an arrangement without sex.",
            "author": "LVSugarBebe",
            "id": "frk0adw",
            "parent_id": "t1_frj6sxr",
            "score": 4,
            "created_utc": 1590246939.0,
            "replies": []
        },
        {
            "body": "No need to get defensive. I'm just posting for the 70k+ other people who are a lot of new, young Sbabies who read this subreddit.  \n\nThey deserve to know you can always date hypergamously and have some hot guy playing taskrabbit, even if that doesn't interested you.",
            "author": "dancingqw33n17",
            "id": "fren6gm",
            "parent_id": "t1_frel3el",
            "score": -4,
            "created_utc": 1590112541.0,
            "replies": [
                {
                    "body": "I am not defensive. :) don't understand the rest of what you wrote. 🤷🏻‍♀️ Is hypergamously a word? Dang. Also: what's task rabbit? Edit: now Googled. Ohhhh. That is a word! When I was younger I read pierre boudiou. He stated that one of the sure fire ways to move from one class to another was to become a teacher, but that takes work. Keep trying to fuck your way to the top with out refining your social skills. :)",
                    "author": "musesb",
                    "id": "frenmpt",
                    "parent_id": "t1_fren6gm",
                    "score": 5,
                    "created_utc": 1590112815.0,
                    "replies": [
                        {
                            "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
                            "author": "dancingqw33n17",
                            "id": "frfo8zm",
                            "parent_id": "t1_frenmpt",
                            "score": 7,
                            "created_utc": 1590142281.0,
                            "replies": [
                                {
                                    "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                                    "author": "LaSirene23",
                                    "id": "frg0k4b",
                                    "parent_id": "t1_frfo8zm",
                                    "score": 7,
                                    "created_utc": 1590152657.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
                            "author": "dancingqw33n17",
                            "id": "freoj87",
                            "parent_id": "t1_frenmpt",
                            "score": -1,
                            "created_utc": 1590113369.0,
                            "replies": [
                                {
                                    "body": "Why so mean, ma'am?",
                                    "author": "PioneerExperience",
                                    "id": "frepi77",
                                    "parent_id": "t1_freoj87",
                                    "score": 8,
                                    "created_utc": 1590113963.0,
                                    "replies": []
                                },
                                {
                                    "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                                    "author": "musesb",
                                    "id": "freptbe",
                                    "parent_id": "t1_freoj87",
                                    "score": 4,
                                    "created_utc": 1590114153.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "frerihc",
                                            "parent_id": "t1_freptbe",
                                            "score": 6,
                                            "created_utc": 1590115198.0,
                                            "replies": [
                                                {
                                                    "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                                    "author": "musesb",
                                                    "id": "frerzzq",
                                                    "parent_id": "t1_frerihc",
                                                    "score": 0,
                                                    "created_utc": 1590115496.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                                    "author": "musesb",
                                                    "id": "freuozv",
                                                    "parent_id": "t1_frerihc",
                                                    "score": 0,
                                                    "created_utc": 1590117172.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nobody is even talking about sex work lol, why you so triggered? It’s not ok to wonder about the other side of the coin because, presumably, it could come off as taking advantage of someone? If you were friends and it truly works, cool, so why get all defensive? Lol. You could of just dropped it then. Just because he loves five states away doesn’t mean anything. Maybe he could really be trying to rekindle an SR. Maybe not. Who knows? I’ve had a baby live on the other side of the world, it didn’t stop me from having some sort of arrangement with said individual. Granted it wasn’t ideal, but for the time we made something out of nothing.",
            "author": null,
            "id": "frezui0",
            "parent_id": "t1_frez5hc",
            "score": 4,
            "created_utc": 1590120536.0,
            "replies": [
                {
                    "body": "Good. Same person as before with new name and different issue with my post... Let people have different interpretations. There's room for everyone. No?",
                    "author": "musesb",
                    "id": "frf04yg",
                    "parent_id": "t1_frezui0",
                    "score": 1,
                    "created_utc": 1590120733.0,
                    "replies": [
                        {
                            "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
                            "author": null,
                            "id": "frf0nmi",
                            "parent_id": "t1_frf04yg",
                            "score": 7,
                            "created_utc": 1590121090.0,
                            "replies": [
                                {
                                    "body": "Sorry assumed you were my troll. I guess not. My bad.",
                                    "author": "musesb",
                                    "id": "frf1igv",
                                    "parent_id": "t1_frf0nmi",
                                    "score": 1,
                                    "created_utc": 1590121701.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am not defensive. :) don't understand the rest of what you wrote. 🤷🏻‍♀️ Is hypergamously a word? Dang. Also: what's task rabbit? Edit: now Googled. Ohhhh. That is a word! When I was younger I read pierre boudiou. He stated that one of the sure fire ways to move from one class to another was to become a teacher, but that takes work. Keep trying to fuck your way to the top with out refining your social skills. :)",
            "author": "musesb",
            "id": "frenmpt",
            "parent_id": "t1_fren6gm",
            "score": 5,
            "created_utc": 1590112815.0,
            "replies": [
                {
                    "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
                    "author": "dancingqw33n17",
                    "id": "frfo8zm",
                    "parent_id": "t1_frenmpt",
                    "score": 7,
                    "created_utc": 1590142281.0,
                    "replies": [
                        {
                            "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                            "author": "LaSirene23",
                            "id": "frg0k4b",
                            "parent_id": "t1_frfo8zm",
                            "score": 7,
                            "created_utc": 1590152657.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
                    "author": "dancingqw33n17",
                    "id": "freoj87",
                    "parent_id": "t1_frenmpt",
                    "score": -1,
                    "created_utc": 1590113369.0,
                    "replies": [
                        {
                            "body": "Why so mean, ma'am?",
                            "author": "PioneerExperience",
                            "id": "frepi77",
                            "parent_id": "t1_freoj87",
                            "score": 8,
                            "created_utc": 1590113963.0,
                            "replies": []
                        },
                        {
                            "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                            "author": "musesb",
                            "id": "freptbe",
                            "parent_id": "t1_freoj87",
                            "score": 4,
                            "created_utc": 1590114153.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "frerihc",
                                    "parent_id": "t1_freptbe",
                                    "score": 6,
                                    "created_utc": 1590115198.0,
                                    "replies": [
                                        {
                                            "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                            "author": "musesb",
                                            "id": "frerzzq",
                                            "parent_id": "t1_frerihc",
                                            "score": 0,
                                            "created_utc": 1590115496.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                            "author": "musesb",
                                            "id": "freuozv",
                                            "parent_id": "t1_frerihc",
                                            "score": 0,
                                            "created_utc": 1590117172.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good. Same person as before with new name and different issue with my post... Let people have different interpretations. There's room for everyone. No?",
            "author": "musesb",
            "id": "frf04yg",
            "parent_id": "t1_frezui0",
            "score": 1,
            "created_utc": 1590120733.0,
            "replies": [
                {
                    "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
                    "author": null,
                    "id": "frf0nmi",
                    "parent_id": "t1_frf04yg",
                    "score": 7,
                    "created_utc": 1590121090.0,
                    "replies": [
                        {
                            "body": "Sorry assumed you were my troll. I guess not. My bad.",
                            "author": "musesb",
                            "id": "frf1igv",
                            "parent_id": "t1_frf0nmi",
                            "score": 1,
                            "created_utc": 1590121701.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn't expect someone who's fucking for something you can fix from a YouTube lessons to understand why I dont need to fuck my way to the top. If you're lazy enough to think that's a good trade awesome, but I just think it's weird when you didn't agree to that in the first place. You agreed to an allowance and by the time he couldn't afford it you liked him enough to not care which is great, but let's not suddenly start a new standard that it's okay to pretend to be a SD or to tolerate being lied to. \n\n\nHe basically pulled a common manipulative move men do, but because you don't see anything wrong with it doesn't make it different or okay.  I thought we all kinda agreed that wasn't good behavior and wanted to give women a more fun option if you have a hard time finding Sugar Daddy.",
            "author": "dancingqw33n17",
            "id": "frfo8zm",
            "parent_id": "t1_frenmpt",
            "score": 7,
            "created_utc": 1590142281.0,
            "replies": [
                {
                    "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
                    "author": "LaSirene23",
                    "id": "frg0k4b",
                    "parent_id": "t1_frfo8zm",
                    "score": 7,
                    "created_utc": 1590152657.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No worries, I understand google is super complex to understand and not everyone can afford wifi to use it\n\nHypergamy (colloquially referred to as \"marrying up\", occasionally referred to as \"higher-gamy\") is a term used in social science for the act or practice of a person marrying a spouse of higher caste or social status than themselves.\nIt's option when men your age are very attractive to you, and value you so they spoil you. You're basically a SB to an man you dont have to convince your self to like\n\n\nTask rabbit is a app you can use to pay someone to fix things, or run errands. Since my SD actually pays an allowance I use it instead of fucking for it",
            "author": "dancingqw33n17",
            "id": "freoj87",
            "parent_id": "t1_frenmpt",
            "score": -1,
            "created_utc": 1590113369.0,
            "replies": [
                {
                    "body": "Why so mean, ma'am?",
                    "author": "PioneerExperience",
                    "id": "frepi77",
                    "parent_id": "t1_freoj87",
                    "score": 8,
                    "created_utc": 1590113963.0,
                    "replies": []
                },
                {
                    "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
                    "author": "musesb",
                    "id": "freptbe",
                    "parent_id": "t1_freoj87",
                    "score": 4,
                    "created_utc": 1590114153.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "frerihc",
                            "parent_id": "t1_freptbe",
                            "score": 6,
                            "created_utc": 1590115198.0,
                            "replies": [
                                {
                                    "body": "Honey tongued? I will take  as a compliment! Thanks.",
                                    "author": "musesb",
                                    "id": "frerzzq",
                                    "parent_id": "t1_frerihc",
                                    "score": 0,
                                    "created_utc": 1590115496.0,
                                    "replies": []
                                },
                                {
                                    "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                                    "author": "musesb",
                                    "id": "freuozv",
                                    "parent_id": "t1_frerihc",
                                    "score": 0,
                                    "created_utc": 1590117172.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sure, people can come up with their own interpretations of what you are going through. You originally responded to my message and then went a step forward by responding again and trying to insinuate that I’m someone else. I wouldn’t of responded back based on your first response because it sounded fine. Mods can probably see post / IP address/ etc or whatever, so if I’m such a fake, let them go through the headache of finding out that I only have one handle. If I wanted to call you out for something, I would just do it now. Karma doesn’t mean anything.",
            "author": null,
            "id": "frf0nmi",
            "parent_id": "t1_frf04yg",
            "score": 7,
            "created_utc": 1590121090.0,
            "replies": [
                {
                    "body": "Sorry assumed you were my troll. I guess not. My bad.",
                    "author": "musesb",
                    "id": "frf1igv",
                    "parent_id": "t1_frf0nmi",
                    "score": 1,
                    "created_utc": 1590121701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Drop it and keep it moving. I think everyone is aware of your opinion on the matter by now. Consider this your final warning.",
            "author": "LaSirene23",
            "id": "frg0k4b",
            "parent_id": "t1_frfo8zm",
            "score": 7,
            "created_utc": 1590152657.0,
            "replies": []
        },
        {
            "body": "Why so mean, ma'am?",
            "author": "PioneerExperience",
            "id": "frepi77",
            "parent_id": "t1_freoj87",
            "score": 8,
            "created_utc": 1590113963.0,
            "replies": []
        },
        {
            "body": "Good luck to you. Cheers. I actually love men and love these relationships. Why don't you start r/ goldigger and get the fuckoff my sweet positive post. :) Which , was meant to cheer us up after several days of near suicides: likely because of people like you spouting absolute bullshit about how any girl can use a man for financial gains. Your heart is seasoned. Go back to your sex worker reddit.",
            "author": "musesb",
            "id": "freptbe",
            "parent_id": "t1_freoj87",
            "score": 4,
            "created_utc": 1590114153.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "frerihc",
                    "parent_id": "t1_freptbe",
                    "score": 6,
                    "created_utc": 1590115198.0,
                    "replies": [
                        {
                            "body": "Honey tongued? I will take  as a compliment! Thanks.",
                            "author": "musesb",
                            "id": "frerzzq",
                            "parent_id": "t1_frerihc",
                            "score": 0,
                            "created_utc": 1590115496.0,
                            "replies": []
                        },
                        {
                            "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                            "author": "musesb",
                            "id": "freuozv",
                            "parent_id": "t1_frerihc",
                            "score": 0,
                            "created_utc": 1590117172.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry assumed you were my troll. I guess not. My bad.",
            "author": "musesb",
            "id": "frf1igv",
            "parent_id": "t1_frf0nmi",
            "score": 1,
            "created_utc": 1590121701.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "frerihc",
            "parent_id": "t1_freptbe",
            "score": 6,
            "created_utc": 1590115198.0,
            "replies": [
                {
                    "body": "Honey tongued? I will take  as a compliment! Thanks.",
                    "author": "musesb",
                    "id": "frerzzq",
                    "parent_id": "t1_frerihc",
                    "score": 0,
                    "created_utc": 1590115496.0,
                    "replies": []
                },
                {
                    "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
                    "author": "musesb",
                    "id": "freuozv",
                    "parent_id": "t1_frerihc",
                    "score": 0,
                    "created_utc": 1590117172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honey tongued? I will take  as a compliment! Thanks.",
            "author": "musesb",
            "id": "frerzzq",
            "parent_id": "t1_frerihc",
            "score": 0,
            "created_utc": 1590115496.0,
            "replies": []
        },
        {
            "body": "...or maybe you don't understand the difference. This was a light-hearted post meant to to highlight the fact that these are relationships.  I was actually hoping to create a discussion about how different levels of care are ok within the lifestyle, and give a little brevity to a subreddit I used to enjoy. \n\nI am a sex-positive feminist and do not have negative feelings about sex-work. I think it is essential and honorable work. I do not think that hardened sex-workers should be giving advice to young girls. We have had a nasty boring  and sad week here. Sugaring is care work and is more about using your heart. That's  simply what I feel and how I do it. \n\nI am entitled to defend myself against a hard-heartened person trying to belittle my experience. I have met the most amazing men. They are, for the most part, looking for affection, attention, and care. Sex...yes, and \"marrying down\" not so much.\n\nIf I would like to express my opinion on how a relationship, outside of the perfect SB goal, which isn't usually marriage, just so that is clear, has been a positive. \n\nI should be allowed to do so without petty attacks or upset that I'm misinforming the young potential sex-workers or \"women who wish to marry up\" Sorry you don't like me anymore. That is what down-vote is for.  Good luck.",
            "author": "musesb",
            "id": "freuozv",
            "parent_id": "t1_frerihc",
            "score": 0,
            "created_utc": 1590117172.0,
            "replies": []
        }
    ]
}