{
    "title": "why do SDs \"forget\" to pay allowance",
    "post_id": "bze5b8",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bze5b8/why_do_sds_forget_to_pay_allowance/",
    "author": "GSSD",
    "body": "Here's why. This is an entry on a PUA/\"SB\" blog. \n\n\"-- after a couple of times of paying a SB I  stop the allowance.  If nothing is mentioned we keep seeing each other. I still pay for dates and small gifts. If she is into me it works every time.\"   \nSo these girls enable him because they tolerate this abusive behavior. This pattern is reinforced by his success in getting free pussy and the cycle goes on. \n\nAs Nancy Reagan said \"Just say NO\" . If you want to date a 50 yr old man for free, then by all means go for it. But don't settle for a free meal and cosmetics from Walgreens instead of an allowance. Have some self respect and know your \"worth\".",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bze5b8/why_do_sds_forget_to_pay_allowance/",
    "score": 148,
    "upvote_ratio": 0.92,
    "created_utc": 1560268144.0,
    "num_comments": 62,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "In support of all the SDs who pay, I would never miss a payment to my SB. I worked for corporations for many years and I sure as sugar would never go to work if i wasn’t sure there was a paycheck at the end of the week. It would not occur to me to not pay my SB for her time because of my history in the working world. But I guess there are some bad apples. I advise NEXT and find an SD with some ethics.",
            "author": "Janhammerfan",
            "id": "eqryims",
            "parent_id": "t3_bze5b8",
            "score": 63,
            "created_utc": 1560272737.0,
            "replies": [
                {
                    "body": "Where do you recommend finding a sugar daddy with “ethics?”  Everywhere I’ve looked so far has been a bust :(",
                    "author": "grlpwrrr",
                    "id": "er3tvc0",
                    "parent_id": "t1_eqryims",
                    "score": 4,
                    "created_utc": 1560472551.0,
                    "replies": [
                        {
                            "body": "Just keep looking.  Think of the adage about kissing frogs and princes.",
                            "author": null,
                            "id": "f8oxdpy",
                            "parent_id": "t1_er3tvc0",
                            "score": 1,
                            "created_utc": 1574691979.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So the context of the blogger was \"how to get pussy on the cheap or free\", not some altruistic move to take the SB to monthly or to see if she \"loves\" him.    \n\nThe correct way to change up an arrangement is to discuss it ahead of time and get mutual agreement before proceeding.",
            "author": "GSSD",
            "id": "eqss943",
            "parent_id": "t3_bze5b8",
            "score": 24,
            "created_utc": 1560292462.0,
            "replies": [
                {
                    "body": "Idk how I ended up here and maybe its not appropriate to ask but ive always wondered whats a ballpark of how much SDs pay for these types of arrangements? Feel free to DM or delete me if thats rude im genuinely just curious.",
                    "author": "TeamRocketBadger",
                    "id": "er2fd6a",
                    "parent_id": "t1_eqss943",
                    "score": 2,
                    "created_utc": 1560443736.0,
                    "replies": [
                        {
                            "body": "look to the right margin -there is an entry that covers that",
                            "author": "GSSD",
                            "id": "er2v5tg",
                            "parent_id": "t1_er2fd6a",
                            "score": 1,
                            "created_utc": 1560450380.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think for some it's a turn on, the feeling that they are needed and are in the power position etc. I actually had a SD tell me that he wanted to roleplay 'withholding' allowance to play to this kink. I told him straight up that this was non-negotiable and not something to play around with.",
            "author": "lavitaetroppobreve1",
            "id": "eqs7xrn",
            "parent_id": "t3_bze5b8",
            "score": 35,
            "created_utc": 1560278758.0,
            "replies": [
                {
                    "body": "He really tried to pass off trying to scam you as a kink?? These men omfg *I’m* insulted",
                    "author": "RussianAsshole",
                    "id": "eqsegsq",
                    "parent_id": "t1_eqs7xrn",
                    "score": 38,
                    "created_utc": 1560283031.0,
                    "replies": [
                        {
                            "body": "To be fair, he was never once late with allowance. Maybe just pushing his luck.",
                            "author": "lavitaetroppobreve1",
                            "id": "eqsfee4",
                            "parent_id": "t1_eqsegsq",
                            "score": 10,
                            "created_utc": 1560283648.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Just tell him to give you a bunch of blank, signed checks, and then you can roleplay whatever he wants.",
                    "author": "antonivs",
                    "id": "eqtapbr",
                    "parent_id": "t1_eqs7xrn",
                    "score": 15,
                    "created_utc": 1560306937.0,
                    "replies": [
                        {
                            "body": "Love that omg",
                            "author": null,
                            "id": "eqvjn6w",
                            "parent_id": "t1_eqtapbr",
                            "score": 4,
                            "created_utc": 1560346062.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So gross. There's also a power imbalance where SBs might not feel comfortable asserting themselves.",
            "author": "whatsnotclicking",
            "id": "eqrw8al",
            "parent_id": "t3_bze5b8",
            "score": 53,
            "created_utc": 1560271333.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs3vny",
            "parent_id": "t3_bze5b8",
            "score": 31,
            "created_utc": 1560276110.0,
            "replies": [
                {
                    "body": "I short change an allowance once by mistake. When she went home and counted it she texted me. I have no idea if I did or not, but I made up for it next time we catch up.",
                    "author": "SD_AU",
                    "id": "eqsrye3",
                    "parent_id": "t1_eqs3vny",
                    "score": 10,
                    "created_utc": 1560292241.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Couple things wrong here:  \n\n\nSB's should be catching feels for someone who won't honor their word. And someone who won't honor their word is abusive and no one should let that behavior slide.",
            "author": null,
            "id": "eqspa33",
            "parent_id": "t3_bze5b8",
            "score": 11,
            "created_utc": 1560290282.0,
            "replies": [
                {
                    "body": "Don't underestimate pick up artists.  They often are goodlooking, charming and well practiced at manipulating needy and desperate women.  Pimps, Loverboys and Pick Up artists often use the same manipulations. \n\nThis is why so many of the more seasoned SBs often avoid younger, good looking SD profiles....they usually are fakes trying to get free sex or scammers asking for bank info.",
                    "author": "willfromvb",
                    "id": "eqva8p1",
                    "parent_id": "t1_eqspa33",
                    "score": 10,
                    "created_utc": 1560342771.0,
                    "replies": [
                        {
                            "body": "Oh I dont! I won't even reply to someone who isn't 2x my age!",
                            "author": null,
                            "id": "eqvqjin",
                            "parent_id": "t1_eqva8p1",
                            "score": 4,
                            "created_utc": 1560348438.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeing as how we've had (at least) 2 posts about SDs giving inconsistent ppms & one who travelled to meet a pot only to let him slide when he forgot the ppm, in the past week, this should be a sticky. \nNot that those who need to read it would 😪",
            "author": "bsbdfw",
            "id": "eqstpsz",
            "parent_id": "t3_bze5b8",
            "score": 10,
            "created_utc": 1560293557.0,
            "replies": []
        },
        {
            "body": "Wow, this is something I’m dealing with.\n\nWe discussed moving to an electronic allowance to avoid the paper envelope, but he coincidentally “didn’t have time to make it to an ATM after hopping off a flight and heading to the restaurant” despite us coming to this agreement not even a week ago.\n\nNow he’s going to “make it up” to me the next time we meet, despite being able to send it in the click of a button. He’s said he’s fine with a per meet allowance, yet has compensated me with the amount agreed upon for every meet after meeting 3x! So I basically got 1/3 of what I was supposed to get. \n\nI don’t know why I’m still entertaining him because my other potentials are less work, better looking, and more fun + follow through with agreed upon terms as well as promises.",
            "author": "tasteofperfection",
            "id": "eqtac52",
            "parent_id": "t3_bze5b8",
            "score": 8,
            "created_utc": 1560306631.0,
            "replies": [
                {
                    "body": "Stop \"entertaining\" him until he pays up in full. And go back to PPM cash in hand. He's one of those guys trying to convert you to free. If you let it slide you are enabling him and accepting the new order of things.",
                    "author": "GSSD",
                    "id": "eqvuqmy",
                    "parent_id": "t1_eqtac52",
                    "score": 12,
                    "created_utc": 1560349897.0,
                    "replies": [
                        {
                            "body": "I need to, without a doubt. He’s always emphasizing that he’s respectful and whatnot, which he has been, but lately he’s made me feel really poorly about myself. I assume not purposefully, or maybe it is, but he was great at the start of it all and seemed incredibly promising. \n\nThe other men I’m seeing have delivered on what they’ve promised. If you can’t honor your word, that speaks volumes about the kind of man you are.",
                            "author": "tasteofperfection",
                            "id": "eqwq6gw",
                            "parent_id": "t1_eqvuqmy",
                            "score": 2,
                            "created_utc": 1560360194.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> I don’t know why I’m still entertaining him \n\nIn a way, this is really simple, but can also be quite hard: just stop entertaining him. You're letting yourself be exploited and enabling his behavior.",
                    "author": "antonivs",
                    "id": "eqtb1gz",
                    "parent_id": "t1_eqtac52",
                    "score": 12,
                    "created_utc": 1560307219.0,
                    "replies": [
                        {
                            "body": "I know. I’m finding it difficult to let go entirely because I’m holding out hope that he’s malleable enough for me to mold him into my “ideal” daddy. He’s never had a real sugar relationship before, only two from his past never had set allowances and received money sporadically whenever they needed it. \n\nIt’s just not worth the extra stress and effort anymore.",
                            "author": "tasteofperfection",
                            "id": "eqwprkt",
                            "parent_id": "t1_eqtb1gz",
                            "score": 2,
                            "created_utc": 1560360049.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know, that’s never happened to me. \n\nEdit: Ok actually. Story. One time I had a sugardaddy show up to a pot date steak dinner, who agreed to bring me 300, he admitted he didn’t so I said “sorry, broke liars aren’t my type” then stood up and immediately left. He seemed dumbfounded and it was honestly hilarious to look back on it. We had just ordered a full dinner. Lol. \n\n\nAnyways! With allowances:\n\nI always gently tell my partner that it’s so gross and unsexy to have to even bring it up, and if it’s not my purse at the beginning of the date I’ll disappear to the bathroom and wait until he puts it in before I get undressed into my lingerie so I don’t have to touch it or think about it. \n\nTruthfully I really do feel that way. Money is dirty and gross, and it’s tasteless to make me ask for it. Disrespect makes my pussy dry up faster than the Sahara, making me feel like an escort is rude as hell. Just pay my allowance before you try to undress me so I can continue with my fantasy that this is a rom-com 90s movie and I’m the plucky alternative female lead who is comfortable in her own skin. \n\n\nIf it’s a regular who is forgetting your allowance, the only thing we are forgetting is the air quotes. Girls, this sugardaddy didn’t “forget” a damn thing, he is renegotiating on your arrangement without your consent. This is 100% unreliable and untrustworthy. \n\n\nAnyone who tries to screw with you financially like this is trash, ESPECIALLY because you had a clear agreement beforehand. I don’t nickle and dime my daddy for the same reasons — I tried to pressure more allowance from my first sugardaddy and eventually I pressed too hard and he stopped calling me, I never forgot that lesson. \n\n\nSimilarly, the other lesson I learned about allowance is that if you let him get away with this even once it’s all over. Full allowance every time. I recommend throwing any fish like this back into the sea and catching ones that do not smell!",
            "author": "maincoursdelegance",
            "id": "erb1aij",
            "parent_id": "t3_bze5b8",
            "score": 7,
            "created_utc": 1560658106.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqsfje9",
            "parent_id": "t3_bze5b8",
            "score": 15,
            "created_utc": 1560283740.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqtayxd",
                    "parent_id": "t1_eqsfje9",
                    "score": 2,
                    "created_utc": 1560307159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How does one let a man leave without their gift?? I always say something, I even had a guy pull out a toy FBI badge on me when he only had $100 out of $500 after dragging out the date for hours and hours and sneaking around clearly trying to find a way to leave without me noticing... I grabbed the badge out of his hand super fast and stuck it in bra and told him to come back with my money, lol he then tried to fight me for it and I pulled my gun out and told him to call the cops and tell them I have his badge. I knew he had coke in his pocket so he wasn’t calling anybody and he def wasn’t a cop anyway, but it was nuts! Screw that, nobody’s robbing me, period, atleast not without a sick confrontation and a headache to boot, lol I eventually let him leave n kept the badge as a souvenir, but I would have chased his car down n pushed him off the road if it got to that tbh, I keeps a v8! lol😂",
            "author": "roseforealll",
            "id": "et7uksp",
            "parent_id": "t3_bze5b8",
            "score": 4,
            "created_utc": 1562538604.0,
            "replies": [
                {
                    "body": "Good for you! Most girls do not have the skills or chutzpah to do that. Heck, most guys don't either.",
                    "author": "GSSD",
                    "id": "et9bc37",
                    "parent_id": "t1_et7uksp",
                    "score": 2,
                    "created_utc": 1562592302.0,
                    "replies": [
                        {
                            "body": "That’s soooo sad, I can’t even imagine getting taken advantage of like that. I feel like it’s soooo important to be upfront especially in a business where dudes commonly prey on our vulnerabilities. So sad!",
                            "author": "roseforealll",
                            "id": "et9tjk5",
                            "parent_id": "t1_et9bc37",
                            "score": 2,
                            "created_utc": 1562605058.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think it is just easy to get lost in the illusion that the SB actually cares about you and that it is a real relationship and not a transaction. Some unconscious part of the brain wants to take away the transaction al aspect and validate it as a real relationship.",
            "author": "JDiGi7730",
            "id": "eqs93nv",
            "parent_id": "t3_bze5b8",
            "score": 11,
            "created_utc": 1560279526.0,
            "replies": []
        },
        {
            "body": "No free pussy! You boost his status being seen w him, and that I dnt a privledge u benefit from. Make him pay, always",
            "author": "PinkPinUp99",
            "id": "eqs2xpx",
            "parent_id": "t3_bze5b8",
            "score": 15,
            "created_utc": 1560275511.0,
            "replies": []
        },
        {
            "body": "To be honest, I have forgotten to provide an allowance at the end of the date.  Its happened maybe twice and always with someone I knew for a while and really liked.  Our dates didnt feel like a paid event and because we were rushed at the end, I simply forgot. \n\nI always contacted them as soon as a I realized and made arrangement to get it to her quickly.",
            "author": "willfromvb",
            "id": "eqv9cu7",
            "parent_id": "t3_bze5b8",
            "score": 3,
            "created_utc": 1560342440.0,
            "replies": []
        },
        {
            "body": "unacceptable behavior. you cant jus “forget” to pay the fuck? what kinda dumb fuckery is this?!",
            "author": "minjibaby",
            "id": "eqt6s6o",
            "parent_id": "t3_bze5b8",
            "score": 2,
            "created_utc": 1560303752.0,
            "replies": []
        },
        {
            "body": "It’s always wrong to bait and switch but it also plays out the other way.  When an SD agrees to a monthly allowance paid up front and on the first of the month and the SB suddenly gets really busy so they meet twice instead of the 4 times they agreed on.  On the first of the next month... she’s not expecting half the allowance.",
            "author": "LotBuilder",
            "id": "eqspe9s",
            "parent_id": "t3_bze5b8",
            "score": 2,
            "created_utc": 1560290365.0,
            "replies": []
        },
        {
            "body": "I don’t endorse the pua thinking esp in the bowl. With that said, There are 1000 posts on tumblr from SBs that will explicitly tell you what they do to mooch money from their SDs. It’s just as sickening.",
            "author": null,
            "id": "equvds8",
            "parent_id": "t3_bze5b8",
            "score": 1,
            "created_utc": 1560336215.0,
            "replies": []
        },
        {
            "body": "My previous SB has never ask me for anything face to face,  one time she almost left without her allowance, I'm the one who initiated and reminded her.",
            "author": "vdzz000",
            "id": "er2vm7b",
            "parent_id": "t3_bze5b8",
            "score": 1,
            "created_utc": 1560450632.0,
            "replies": []
        },
        {
            "body": "sb's shouldn't feel singled out, this is how men behave to each other in the business world also\n\nsome of them anyway\n\nhey what's wrong with walgreen's?",
            "author": "doctorcoolpop",
            "id": "eqspxqq",
            "parent_id": "t3_bze5b8",
            "score": 2,
            "created_utc": 1560290755.0,
            "replies": [
                {
                    "body": "> what's wrong with walgreen's\n\nlove 'em! I just don't \"treat \" my SB to a shopping spree there.",
                    "author": "GSSD",
                    "id": "eqsrf19",
                    "parent_id": "t1_eqspxqq",
                    "score": 8,
                    "created_utc": 1560291849.0,
                    "replies": [
                        {
                            "body": "Thank you for being one of the good ones and understanding the difference between luxury cosmetics vs. drugstore stuff that most girls could get themselves.",
                            "author": "tasteofperfection",
                            "id": "eqtap99",
                            "parent_id": "t1_eqsrf19",
                            "score": 5,
                            "created_utc": 1560306935.0,
                            "replies": []
                        },
                        {
                            "body": "It's just like Sephora, but with more toilet paper and Depends.",
                            "author": "antonivs",
                            "id": "eqtbb3l",
                            "parent_id": "t1_eqsrf19",
                            "score": 2,
                            "created_utc": 1560307443.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqrtnpm",
            "parent_id": "t3_bze5b8",
            "score": -1,
            "created_utc": 1560269612.0,
            "replies": [
                {
                    "body": "Yes, but when they breech an agreed upon allowance. That’s not okay. Young or old",
                    "author": "cornycatlady",
                    "id": "eqrwihw",
                    "parent_id": "t1_eqrtnpm",
                    "score": 20,
                    "created_utc": 1560271510.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqs19ke",
                            "parent_id": "t1_eqrwihw",
                            "score": 3,
                            "created_utc": 1560274466.0,
                            "replies": [
                                {
                                    "body": "Exactly. No money no arrangement. Like with your water bill though, if you keep forgetting payment, service will be shut off",
                                    "author": "cornycatlady",
                                    "id": "eqs2col",
                                    "parent_id": "t1_eqs19ke",
                                    "score": 13,
                                    "created_utc": 1560275147.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eqs2qmh",
                                            "parent_id": "t1_eqs2col",
                                            "score": -5,
                                            "created_utc": 1560275387.0,
                                            "replies": [
                                                {
                                                    "body": "Sure if there’s clear communication about it. \n\nHowever if the SD keeps forgetting an allowance, don’t be surprised if the SB will keep forgetting to have sex.",
                                                    "author": "cornycatlady",
                                                    "id": "eqs39s9",
                                                    "parent_id": "t1_eqs2qmh",
                                                    "score": 12,
                                                    "created_utc": 1560275722.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eqs6mzz",
                                                            "parent_id": "t1_eqs39s9",
                                                            "score": -7,
                                                            "created_utc": 1560277914.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Enlighten me",
                                                                    "author": "cornycatlady",
                                                                    "id": "eqsbe76",
                                                                    "parent_id": "t1_eqs6mzz",
                                                                    "score": 6,
                                                                    "created_utc": 1560281036.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "eqsd93x",
                                                                            "parent_id": "t1_eqsbe76",
                                                                            "score": -5,
                                                                            "created_utc": 1560282246.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                                                                    "author": "cornycatlady",
                                                                                    "id": "eqsfn7m",
                                                                                    "parent_id": "t1_eqsd93x",
                                                                                    "score": 6,
                                                                                    "created_utc": 1560283807.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "eqv0l54",
                                                                                            "parent_id": "t1_eqsfn7m",
                                                                                            "score": 0,
                                                                                            "created_utc": 1560338896.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                                                                    "author": "cornycatlady",
                                                                                                    "id": "eqv2rix",
                                                                                                    "parent_id": "t1_eqv0l54",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1560339780.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "[deleted]",
                                                                                                            "author": null,
                                                                                                            "id": "eqw3wfm",
                                                                                                            "parent_id": "t1_eqv2rix",
                                                                                                            "score": -1,
                                                                                                            "created_utc": 1560352858.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Okay then. Goodbye 👋🏽",
                                                                                                                    "author": "cornycatlady",
                                                                                                                    "id": "eqwp7vd",
                                                                                                                    "parent_id": "t1_eqw3wfm",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1560359851.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">they tolerate this abusive behavior.   \n>  \n>If you want to date a 50 yr old man for free, then by all means go for it.  \n\nhuh.",
            "author": "solosier",
            "id": "eqrwflp",
            "parent_id": "t3_bze5b8",
            "score": -3,
            "created_utc": 1560271464.0,
            "replies": []
        },
        {
            "body": "Your question answers itself, but the reasons could be quite simple:\n\n* To see if they can get away with it.\n* To test your boundries, to see if you'll speak up for yourself or just let it happen.\n* To try to switch to larger sums monthly instead of smaller sums weekly or per date.\n* To see if you really like them, or if you're just there for their money. While you may think it's a given that an SB would only be there for the cash, a lot of SDs are looking for a real connection.\n* To see if the relationship has moved past the stage where you don't trust them.\n* To see if the relationship has moved past the stage where they only see you as a piece of flesh they paid for. Sometimes this leads to much more generosity because maybe their level of respect and appreciation is growing.\n* Because maybe they feel they are offering you other things that exceed the value of the cash.\n* Because maybe the SB did a really poor job of setting boundaries and her own expectations of him.\n\nThe only things disgusting here is a lack of empathy for the other side. Some might call the SD \\*disgusting\\* because they think it's only happening to deprive them of something. It might be, but it could be some of these other reasons above. I agree that it would be disgusting if they only stop paying just to abuse the power they have in the relationship (lack of empathy for the SB) but I don't assume that's always the case.",
            "author": "gangsta_baby",
            "id": "eqrxfge",
            "parent_id": "t3_bze5b8",
            "score": -10,
            "created_utc": 1560272063.0,
            "replies": [
                {
                    "body": "Other than the third and last reason on your list, those are all examples of manipulative and/or abusive behaviors. And I think manipulation and abuse is pretty disgusting and not acceptable. I wouldn’t put up with any of those.",
                    "author": "Wetmommy1",
                    "id": "eqs3jut",
                    "parent_id": "t1_eqrxfge",
                    "score": 22,
                    "created_utc": 1560275898.0,
                    "replies": [
                        {
                            "body": "That’s totally your prerogative. If it’s not for you, walk away. From this perspective there’s nothing to talk about.",
                            "author": "gangsta_baby",
                            "id": "eqs4wxi",
                            "parent_id": "t1_eqs3jut",
                            "score": -10,
                            "created_utc": 1560276788.0,
                            "replies": [
                                {
                                    "body": "You can't really excuse behavior like that tho. Everyone knows behaving that way is shitty.",
                                    "author": "Elvishgirl",
                                    "id": "eqsbmay",
                                    "parent_id": "t1_eqs4wxi",
                                    "score": 11,
                                    "created_utc": 1560281182.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqs3o2f",
                    "parent_id": "t1_eqrxfge",
                    "score": 13,
                    "created_utc": 1560275973.0,
                    "replies": [
                        {
                            "body": "Well because In all your responses you seem to place the sole responsibility on the SD to define these things for both parties. You also only site negative examples where it goes wrong. Maybe consider exploring hypotheticals where the SDs intentions are “good”, makes a mistake, and rather than flipping out it becomes a teaching moment. It’s not solely your responsibility either, It takes two.\n\nPeople who run around complaining about how bad other people are often forget to check themselves and their role in their own situations.",
                            "author": "gangsta_baby",
                            "id": "eqs4nwt",
                            "parent_id": "t1_eqs3o2f",
                            "score": -6,
                            "created_utc": 1560276628.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqs78l6",
                                    "parent_id": "t1_eqs4nwt",
                                    "score": 7,
                                    "created_utc": 1560278304.0,
                                    "replies": [
                                        {
                                            "body": "Yup",
                                            "author": "gangsta_baby",
                                            "id": "eqsqxfi",
                                            "parent_id": "t1_eqs78l6",
                                            "score": 0,
                                            "created_utc": 1560291487.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "- all very verbose ways to scam an SB out of her due $ by trying to emotionally blackmail her into staying because “but what about the cOnNeCTiOn” while SD’s would be gone before you could finish your breath if you tried to not fuck them and used “but what about my pErSoNaLiTy” as an excuse",
                    "author": "RussianAsshole",
                    "id": "eqsgfcj",
                    "parent_id": "t1_eqrxfge",
                    "score": 16,
                    "created_utc": 1560284319.0,
                    "replies": []
                },
                {
                    "body": "It seems like some SBs genuinely are in it for the experience more than the allowance. Maybe they really want a boyfriend.",
                    "author": "RagingFileShut",
                    "id": "eqs1oop",
                    "parent_id": "t1_eqrxfge",
                    "score": 0,
                    "created_utc": 1560274730.0,
                    "replies": [
                        {
                            "body": "Some want a BF others want to fulfill a kink by dating an older man, some have genuine daddy issues, others use is to scratch an itch/sexual frustration and still others use seeking to find qualified men that have something going for them hoping to find a future husband.",
                            "author": "ruphun",
                            "id": "eqs483w",
                            "parent_id": "t1_eqs1oop",
                            "score": 0,
                            "created_utc": 1560276335.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs1r7c",
            "parent_id": "t3_bze5b8",
            "score": -10,
            "created_utc": 1560274774.0,
            "replies": [
                {
                    "body": "But if you agreed upon an allowance and your SD is not following through, like OP is talking about,  it’s not about a girl being happy without an allowance. It’s about an SD lying or manipulating,  or flaking, or possibly testing. None of which are good things",
                    "author": null,
                    "id": "eqs5orq",
                    "parent_id": "t1_eqs1r7c",
                    "score": 21,
                    "created_utc": 1560277293.0,
                    "replies": []
                },
                {
                    "body": "Stopping an allowance as a test to see if an SB is going to bring it up is patronising. \n\nIf she’s not comfortable or assertive in negotiation then it’s manipulative too.",
                    "author": null,
                    "id": "eqsw3o9",
                    "parent_id": "t1_eqs1r7c",
                    "score": 12,
                    "created_utc": 1560295369.0,
                    "replies": []
                },
                {
                    "body": "X 1000 👍🏻\n\nExactly! Not all women prioritize money over the other benefits of dating an older man.",
                    "author": "ruphun",
                    "id": "eqs4glm",
                    "parent_id": "t1_eqs1r7c",
                    "score": -13,
                    "created_utc": 1560276495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude, I was on board with everything until you said \"know your worth\". That statement makes me cringe. Are you sure you're not a SB masquerading as a SD on reddit?",
            "author": "SugarPieHunnieBunch",
            "id": "eqtm4en",
            "parent_id": "t3_bze5b8",
            "score": -3,
            "created_utc": 1560314370.0,
            "replies": [
                {
                    "body": "Yea,it's pretty lame. My bad.",
                    "author": "GSSD",
                    "id": "eqvubzr",
                    "parent_id": "t1_eqtm4en",
                    "score": 2,
                    "created_utc": 1560349753.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If the girls are ok with it why is it a problem? OP is the problem here.",
            "author": null,
            "id": "eqs3xmb",
            "parent_id": "t3_bze5b8",
            "score": -15,
            "created_utc": 1560276145.0,
            "replies": [
                {
                    "body": "9 out 10 at the end of the day the girls AREN'T happy because the moment they bring it up is the moment those dbagd go *poof*",
                    "author": "ChiCAWgoharlot",
                    "id": "eqs7ku6",
                    "parent_id": "t1_eqs3xmb",
                    "score": 13,
                    "created_utc": 1560278526.0,
                    "replies": []
                },
                {
                    "body": "They’re obviously vulnerable and neevous to speak up and the ‘SD’ is using that to manipulate her.",
                    "author": "roseforealll",
                    "id": "et7uvts",
                    "parent_id": "t1_eqs3xmb",
                    "score": 1,
                    "created_utc": 1562538829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where do you recommend finding a sugar daddy with “ethics?”  Everywhere I’ve looked so far has been a bust :(",
            "author": "grlpwrrr",
            "id": "er3tvc0",
            "parent_id": "t1_eqryims",
            "score": 4,
            "created_utc": 1560472551.0,
            "replies": [
                {
                    "body": "Just keep looking.  Think of the adage about kissing frogs and princes.",
                    "author": null,
                    "id": "f8oxdpy",
                    "parent_id": "t1_er3tvc0",
                    "score": 1,
                    "created_utc": 1574691979.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idk how I ended up here and maybe its not appropriate to ask but ive always wondered whats a ballpark of how much SDs pay for these types of arrangements? Feel free to DM or delete me if thats rude im genuinely just curious.",
            "author": "TeamRocketBadger",
            "id": "er2fd6a",
            "parent_id": "t1_eqss943",
            "score": 2,
            "created_utc": 1560443736.0,
            "replies": [
                {
                    "body": "look to the right margin -there is an entry that covers that",
                    "author": "GSSD",
                    "id": "er2v5tg",
                    "parent_id": "t1_er2fd6a",
                    "score": 1,
                    "created_utc": 1560450380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He really tried to pass off trying to scam you as a kink?? These men omfg *I’m* insulted",
            "author": "RussianAsshole",
            "id": "eqsegsq",
            "parent_id": "t1_eqs7xrn",
            "score": 38,
            "created_utc": 1560283031.0,
            "replies": [
                {
                    "body": "To be fair, he was never once late with allowance. Maybe just pushing his luck.",
                    "author": "lavitaetroppobreve1",
                    "id": "eqsfee4",
                    "parent_id": "t1_eqsegsq",
                    "score": 10,
                    "created_utc": 1560283648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just tell him to give you a bunch of blank, signed checks, and then you can roleplay whatever he wants.",
            "author": "antonivs",
            "id": "eqtapbr",
            "parent_id": "t1_eqs7xrn",
            "score": 15,
            "created_utc": 1560306937.0,
            "replies": [
                {
                    "body": "Love that omg",
                    "author": null,
                    "id": "eqvjn6w",
                    "parent_id": "t1_eqtapbr",
                    "score": 4,
                    "created_utc": 1560346062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I short change an allowance once by mistake. When she went home and counted it she texted me. I have no idea if I did or not, but I made up for it next time we catch up.",
            "author": "SD_AU",
            "id": "eqsrye3",
            "parent_id": "t1_eqs3vny",
            "score": 10,
            "created_utc": 1560292241.0,
            "replies": []
        },
        {
            "body": "Don't underestimate pick up artists.  They often are goodlooking, charming and well practiced at manipulating needy and desperate women.  Pimps, Loverboys and Pick Up artists often use the same manipulations. \n\nThis is why so many of the more seasoned SBs often avoid younger, good looking SD profiles....they usually are fakes trying to get free sex or scammers asking for bank info.",
            "author": "willfromvb",
            "id": "eqva8p1",
            "parent_id": "t1_eqspa33",
            "score": 10,
            "created_utc": 1560342771.0,
            "replies": [
                {
                    "body": "Oh I dont! I won't even reply to someone who isn't 2x my age!",
                    "author": null,
                    "id": "eqvqjin",
                    "parent_id": "t1_eqva8p1",
                    "score": 4,
                    "created_utc": 1560348438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Stop \"entertaining\" him until he pays up in full. And go back to PPM cash in hand. He's one of those guys trying to convert you to free. If you let it slide you are enabling him and accepting the new order of things.",
            "author": "GSSD",
            "id": "eqvuqmy",
            "parent_id": "t1_eqtac52",
            "score": 12,
            "created_utc": 1560349897.0,
            "replies": [
                {
                    "body": "I need to, without a doubt. He’s always emphasizing that he’s respectful and whatnot, which he has been, but lately he’s made me feel really poorly about myself. I assume not purposefully, or maybe it is, but he was great at the start of it all and seemed incredibly promising. \n\nThe other men I’m seeing have delivered on what they’ve promised. If you can’t honor your word, that speaks volumes about the kind of man you are.",
                    "author": "tasteofperfection",
                    "id": "eqwq6gw",
                    "parent_id": "t1_eqvuqmy",
                    "score": 2,
                    "created_utc": 1560360194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> I don’t know why I’m still entertaining him \n\nIn a way, this is really simple, but can also be quite hard: just stop entertaining him. You're letting yourself be exploited and enabling his behavior.",
            "author": "antonivs",
            "id": "eqtb1gz",
            "parent_id": "t1_eqtac52",
            "score": 12,
            "created_utc": 1560307219.0,
            "replies": [
                {
                    "body": "I know. I’m finding it difficult to let go entirely because I’m holding out hope that he’s malleable enough for me to mold him into my “ideal” daddy. He’s never had a real sugar relationship before, only two from his past never had set allowances and received money sporadically whenever they needed it. \n\nIt’s just not worth the extra stress and effort anymore.",
                    "author": "tasteofperfection",
                    "id": "eqwprkt",
                    "parent_id": "t1_eqtb1gz",
                    "score": 2,
                    "created_utc": 1560360049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqtayxd",
            "parent_id": "t1_eqsfje9",
            "score": 2,
            "created_utc": 1560307159.0,
            "replies": []
        },
        {
            "body": "Good for you! Most girls do not have the skills or chutzpah to do that. Heck, most guys don't either.",
            "author": "GSSD",
            "id": "et9bc37",
            "parent_id": "t1_et7uksp",
            "score": 2,
            "created_utc": 1562592302.0,
            "replies": [
                {
                    "body": "That’s soooo sad, I can’t even imagine getting taken advantage of like that. I feel like it’s soooo important to be upfront especially in a business where dudes commonly prey on our vulnerabilities. So sad!",
                    "author": "roseforealll",
                    "id": "et9tjk5",
                    "parent_id": "t1_et9bc37",
                    "score": 2,
                    "created_utc": 1562605058.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> what's wrong with walgreen's\n\nlove 'em! I just don't \"treat \" my SB to a shopping spree there.",
            "author": "GSSD",
            "id": "eqsrf19",
            "parent_id": "t1_eqspxqq",
            "score": 8,
            "created_utc": 1560291849.0,
            "replies": [
                {
                    "body": "Thank you for being one of the good ones and understanding the difference between luxury cosmetics vs. drugstore stuff that most girls could get themselves.",
                    "author": "tasteofperfection",
                    "id": "eqtap99",
                    "parent_id": "t1_eqsrf19",
                    "score": 5,
                    "created_utc": 1560306935.0,
                    "replies": []
                },
                {
                    "body": "It's just like Sephora, but with more toilet paper and Depends.",
                    "author": "antonivs",
                    "id": "eqtbb3l",
                    "parent_id": "t1_eqsrf19",
                    "score": 2,
                    "created_utc": 1560307443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, but when they breech an agreed upon allowance. That’s not okay. Young or old",
            "author": "cornycatlady",
            "id": "eqrwihw",
            "parent_id": "t1_eqrtnpm",
            "score": 20,
            "created_utc": 1560271510.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqs19ke",
                    "parent_id": "t1_eqrwihw",
                    "score": 3,
                    "created_utc": 1560274466.0,
                    "replies": [
                        {
                            "body": "Exactly. No money no arrangement. Like with your water bill though, if you keep forgetting payment, service will be shut off",
                            "author": "cornycatlady",
                            "id": "eqs2col",
                            "parent_id": "t1_eqs19ke",
                            "score": 13,
                            "created_utc": 1560275147.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqs2qmh",
                                    "parent_id": "t1_eqs2col",
                                    "score": -5,
                                    "created_utc": 1560275387.0,
                                    "replies": [
                                        {
                                            "body": "Sure if there’s clear communication about it. \n\nHowever if the SD keeps forgetting an allowance, don’t be surprised if the SB will keep forgetting to have sex.",
                                            "author": "cornycatlady",
                                            "id": "eqs39s9",
                                            "parent_id": "t1_eqs2qmh",
                                            "score": 12,
                                            "created_utc": 1560275722.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eqs6mzz",
                                                    "parent_id": "t1_eqs39s9",
                                                    "score": -7,
                                                    "created_utc": 1560277914.0,
                                                    "replies": [
                                                        {
                                                            "body": "Enlighten me",
                                                            "author": "cornycatlady",
                                                            "id": "eqsbe76",
                                                            "parent_id": "t1_eqs6mzz",
                                                            "score": 6,
                                                            "created_utc": 1560281036.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "eqsd93x",
                                                                    "parent_id": "t1_eqsbe76",
                                                                    "score": -5,
                                                                    "created_utc": 1560282246.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                                                            "author": "cornycatlady",
                                                                            "id": "eqsfn7m",
                                                                            "parent_id": "t1_eqsd93x",
                                                                            "score": 6,
                                                                            "created_utc": 1560283807.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "eqv0l54",
                                                                                    "parent_id": "t1_eqsfn7m",
                                                                                    "score": 0,
                                                                                    "created_utc": 1560338896.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                                                            "author": "cornycatlady",
                                                                                            "id": "eqv2rix",
                                                                                            "parent_id": "t1_eqv0l54",
                                                                                            "score": 1,
                                                                                            "created_utc": 1560339780.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "eqw3wfm",
                                                                                                    "parent_id": "t1_eqv2rix",
                                                                                                    "score": -1,
                                                                                                    "created_utc": 1560352858.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Okay then. Goodbye 👋🏽",
                                                                                                            "author": "cornycatlady",
                                                                                                            "id": "eqwp7vd",
                                                                                                            "parent_id": "t1_eqw3wfm",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1560359851.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Other than the third and last reason on your list, those are all examples of manipulative and/or abusive behaviors. And I think manipulation and abuse is pretty disgusting and not acceptable. I wouldn’t put up with any of those.",
            "author": "Wetmommy1",
            "id": "eqs3jut",
            "parent_id": "t1_eqrxfge",
            "score": 22,
            "created_utc": 1560275898.0,
            "replies": [
                {
                    "body": "That’s totally your prerogative. If it’s not for you, walk away. From this perspective there’s nothing to talk about.",
                    "author": "gangsta_baby",
                    "id": "eqs4wxi",
                    "parent_id": "t1_eqs3jut",
                    "score": -10,
                    "created_utc": 1560276788.0,
                    "replies": [
                        {
                            "body": "You can't really excuse behavior like that tho. Everyone knows behaving that way is shitty.",
                            "author": "Elvishgirl",
                            "id": "eqsbmay",
                            "parent_id": "t1_eqs4wxi",
                            "score": 11,
                            "created_utc": 1560281182.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs3o2f",
            "parent_id": "t1_eqrxfge",
            "score": 13,
            "created_utc": 1560275973.0,
            "replies": [
                {
                    "body": "Well because In all your responses you seem to place the sole responsibility on the SD to define these things for both parties. You also only site negative examples where it goes wrong. Maybe consider exploring hypotheticals where the SDs intentions are “good”, makes a mistake, and rather than flipping out it becomes a teaching moment. It’s not solely your responsibility either, It takes two.\n\nPeople who run around complaining about how bad other people are often forget to check themselves and their role in their own situations.",
                    "author": "gangsta_baby",
                    "id": "eqs4nwt",
                    "parent_id": "t1_eqs3o2f",
                    "score": -6,
                    "created_utc": 1560276628.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqs78l6",
                            "parent_id": "t1_eqs4nwt",
                            "score": 7,
                            "created_utc": 1560278304.0,
                            "replies": [
                                {
                                    "body": "Yup",
                                    "author": "gangsta_baby",
                                    "id": "eqsqxfi",
                                    "parent_id": "t1_eqs78l6",
                                    "score": 0,
                                    "created_utc": 1560291487.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "- all very verbose ways to scam an SB out of her due $ by trying to emotionally blackmail her into staying because “but what about the cOnNeCTiOn” while SD’s would be gone before you could finish your breath if you tried to not fuck them and used “but what about my pErSoNaLiTy” as an excuse",
            "author": "RussianAsshole",
            "id": "eqsgfcj",
            "parent_id": "t1_eqrxfge",
            "score": 16,
            "created_utc": 1560284319.0,
            "replies": []
        },
        {
            "body": "It seems like some SBs genuinely are in it for the experience more than the allowance. Maybe they really want a boyfriend.",
            "author": "RagingFileShut",
            "id": "eqs1oop",
            "parent_id": "t1_eqrxfge",
            "score": 0,
            "created_utc": 1560274730.0,
            "replies": [
                {
                    "body": "Some want a BF others want to fulfill a kink by dating an older man, some have genuine daddy issues, others use is to scratch an itch/sexual frustration and still others use seeking to find qualified men that have something going for them hoping to find a future husband.",
                    "author": "ruphun",
                    "id": "eqs483w",
                    "parent_id": "t1_eqs1oop",
                    "score": 0,
                    "created_utc": 1560276335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But if you agreed upon an allowance and your SD is not following through, like OP is talking about,  it’s not about a girl being happy without an allowance. It’s about an SD lying or manipulating,  or flaking, or possibly testing. None of which are good things",
            "author": null,
            "id": "eqs5orq",
            "parent_id": "t1_eqs1r7c",
            "score": 21,
            "created_utc": 1560277293.0,
            "replies": []
        },
        {
            "body": "Stopping an allowance as a test to see if an SB is going to bring it up is patronising. \n\nIf she’s not comfortable or assertive in negotiation then it’s manipulative too.",
            "author": null,
            "id": "eqsw3o9",
            "parent_id": "t1_eqs1r7c",
            "score": 12,
            "created_utc": 1560295369.0,
            "replies": []
        },
        {
            "body": "X 1000 👍🏻\n\nExactly! Not all women prioritize money over the other benefits of dating an older man.",
            "author": "ruphun",
            "id": "eqs4glm",
            "parent_id": "t1_eqs1r7c",
            "score": -13,
            "created_utc": 1560276495.0,
            "replies": []
        },
        {
            "body": "Yea,it's pretty lame. My bad.",
            "author": "GSSD",
            "id": "eqvubzr",
            "parent_id": "t1_eqtm4en",
            "score": 2,
            "created_utc": 1560349753.0,
            "replies": []
        },
        {
            "body": "9 out 10 at the end of the day the girls AREN'T happy because the moment they bring it up is the moment those dbagd go *poof*",
            "author": "ChiCAWgoharlot",
            "id": "eqs7ku6",
            "parent_id": "t1_eqs3xmb",
            "score": 13,
            "created_utc": 1560278526.0,
            "replies": []
        },
        {
            "body": "They’re obviously vulnerable and neevous to speak up and the ‘SD’ is using that to manipulate her.",
            "author": "roseforealll",
            "id": "et7uvts",
            "parent_id": "t1_eqs3xmb",
            "score": 1,
            "created_utc": 1562538829.0,
            "replies": []
        },
        {
            "body": "Just keep looking.  Think of the adage about kissing frogs and princes.",
            "author": null,
            "id": "f8oxdpy",
            "parent_id": "t1_er3tvc0",
            "score": 1,
            "created_utc": 1574691979.0,
            "replies": []
        },
        {
            "body": "look to the right margin -there is an entry that covers that",
            "author": "GSSD",
            "id": "er2v5tg",
            "parent_id": "t1_er2fd6a",
            "score": 1,
            "created_utc": 1560450380.0,
            "replies": []
        },
        {
            "body": "To be fair, he was never once late with allowance. Maybe just pushing his luck.",
            "author": "lavitaetroppobreve1",
            "id": "eqsfee4",
            "parent_id": "t1_eqsegsq",
            "score": 10,
            "created_utc": 1560283648.0,
            "replies": []
        },
        {
            "body": "Love that omg",
            "author": null,
            "id": "eqvjn6w",
            "parent_id": "t1_eqtapbr",
            "score": 4,
            "created_utc": 1560346062.0,
            "replies": []
        },
        {
            "body": "Oh I dont! I won't even reply to someone who isn't 2x my age!",
            "author": null,
            "id": "eqvqjin",
            "parent_id": "t1_eqva8p1",
            "score": 4,
            "created_utc": 1560348438.0,
            "replies": []
        },
        {
            "body": "I need to, without a doubt. He’s always emphasizing that he’s respectful and whatnot, which he has been, but lately he’s made me feel really poorly about myself. I assume not purposefully, or maybe it is, but he was great at the start of it all and seemed incredibly promising. \n\nThe other men I’m seeing have delivered on what they’ve promised. If you can’t honor your word, that speaks volumes about the kind of man you are.",
            "author": "tasteofperfection",
            "id": "eqwq6gw",
            "parent_id": "t1_eqvuqmy",
            "score": 2,
            "created_utc": 1560360194.0,
            "replies": []
        },
        {
            "body": "I know. I’m finding it difficult to let go entirely because I’m holding out hope that he’s malleable enough for me to mold him into my “ideal” daddy. He’s never had a real sugar relationship before, only two from his past never had set allowances and received money sporadically whenever they needed it. \n\nIt’s just not worth the extra stress and effort anymore.",
            "author": "tasteofperfection",
            "id": "eqwprkt",
            "parent_id": "t1_eqtb1gz",
            "score": 2,
            "created_utc": 1560360049.0,
            "replies": []
        },
        {
            "body": "That’s soooo sad, I can’t even imagine getting taken advantage of like that. I feel like it’s soooo important to be upfront especially in a business where dudes commonly prey on our vulnerabilities. So sad!",
            "author": "roseforealll",
            "id": "et9tjk5",
            "parent_id": "t1_et9bc37",
            "score": 2,
            "created_utc": 1562605058.0,
            "replies": []
        },
        {
            "body": "Thank you for being one of the good ones and understanding the difference between luxury cosmetics vs. drugstore stuff that most girls could get themselves.",
            "author": "tasteofperfection",
            "id": "eqtap99",
            "parent_id": "t1_eqsrf19",
            "score": 5,
            "created_utc": 1560306935.0,
            "replies": []
        },
        {
            "body": "It's just like Sephora, but with more toilet paper and Depends.",
            "author": "antonivs",
            "id": "eqtbb3l",
            "parent_id": "t1_eqsrf19",
            "score": 2,
            "created_utc": 1560307443.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs19ke",
            "parent_id": "t1_eqrwihw",
            "score": 3,
            "created_utc": 1560274466.0,
            "replies": [
                {
                    "body": "Exactly. No money no arrangement. Like with your water bill though, if you keep forgetting payment, service will be shut off",
                    "author": "cornycatlady",
                    "id": "eqs2col",
                    "parent_id": "t1_eqs19ke",
                    "score": 13,
                    "created_utc": 1560275147.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqs2qmh",
                            "parent_id": "t1_eqs2col",
                            "score": -5,
                            "created_utc": 1560275387.0,
                            "replies": [
                                {
                                    "body": "Sure if there’s clear communication about it. \n\nHowever if the SD keeps forgetting an allowance, don’t be surprised if the SB will keep forgetting to have sex.",
                                    "author": "cornycatlady",
                                    "id": "eqs39s9",
                                    "parent_id": "t1_eqs2qmh",
                                    "score": 12,
                                    "created_utc": 1560275722.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eqs6mzz",
                                            "parent_id": "t1_eqs39s9",
                                            "score": -7,
                                            "created_utc": 1560277914.0,
                                            "replies": [
                                                {
                                                    "body": "Enlighten me",
                                                    "author": "cornycatlady",
                                                    "id": "eqsbe76",
                                                    "parent_id": "t1_eqs6mzz",
                                                    "score": 6,
                                                    "created_utc": 1560281036.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eqsd93x",
                                                            "parent_id": "t1_eqsbe76",
                                                            "score": -5,
                                                            "created_utc": 1560282246.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                                                    "author": "cornycatlady",
                                                                    "id": "eqsfn7m",
                                                                    "parent_id": "t1_eqsd93x",
                                                                    "score": 6,
                                                                    "created_utc": 1560283807.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "eqv0l54",
                                                                            "parent_id": "t1_eqsfn7m",
                                                                            "score": 0,
                                                                            "created_utc": 1560338896.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                                                    "author": "cornycatlady",
                                                                                    "id": "eqv2rix",
                                                                                    "parent_id": "t1_eqv0l54",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560339780.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "eqw3wfm",
                                                                                            "parent_id": "t1_eqv2rix",
                                                                                            "score": -1,
                                                                                            "created_utc": 1560352858.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Okay then. Goodbye 👋🏽",
                                                                                                    "author": "cornycatlady",
                                                                                                    "id": "eqwp7vd",
                                                                                                    "parent_id": "t1_eqw3wfm",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1560359851.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s totally your prerogative. If it’s not for you, walk away. From this perspective there’s nothing to talk about.",
            "author": "gangsta_baby",
            "id": "eqs4wxi",
            "parent_id": "t1_eqs3jut",
            "score": -10,
            "created_utc": 1560276788.0,
            "replies": [
                {
                    "body": "You can't really excuse behavior like that tho. Everyone knows behaving that way is shitty.",
                    "author": "Elvishgirl",
                    "id": "eqsbmay",
                    "parent_id": "t1_eqs4wxi",
                    "score": 11,
                    "created_utc": 1560281182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well because In all your responses you seem to place the sole responsibility on the SD to define these things for both parties. You also only site negative examples where it goes wrong. Maybe consider exploring hypotheticals where the SDs intentions are “good”, makes a mistake, and rather than flipping out it becomes a teaching moment. It’s not solely your responsibility either, It takes two.\n\nPeople who run around complaining about how bad other people are often forget to check themselves and their role in their own situations.",
            "author": "gangsta_baby",
            "id": "eqs4nwt",
            "parent_id": "t1_eqs3o2f",
            "score": -6,
            "created_utc": 1560276628.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqs78l6",
                    "parent_id": "t1_eqs4nwt",
                    "score": 7,
                    "created_utc": 1560278304.0,
                    "replies": [
                        {
                            "body": "Yup",
                            "author": "gangsta_baby",
                            "id": "eqsqxfi",
                            "parent_id": "t1_eqs78l6",
                            "score": 0,
                            "created_utc": 1560291487.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some want a BF others want to fulfill a kink by dating an older man, some have genuine daddy issues, others use is to scratch an itch/sexual frustration and still others use seeking to find qualified men that have something going for them hoping to find a future husband.",
            "author": "ruphun",
            "id": "eqs483w",
            "parent_id": "t1_eqs1oop",
            "score": 0,
            "created_utc": 1560276335.0,
            "replies": []
        },
        {
            "body": "Exactly. No money no arrangement. Like with your water bill though, if you keep forgetting payment, service will be shut off",
            "author": "cornycatlady",
            "id": "eqs2col",
            "parent_id": "t1_eqs19ke",
            "score": 13,
            "created_utc": 1560275147.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqs2qmh",
                    "parent_id": "t1_eqs2col",
                    "score": -5,
                    "created_utc": 1560275387.0,
                    "replies": [
                        {
                            "body": "Sure if there’s clear communication about it. \n\nHowever if the SD keeps forgetting an allowance, don’t be surprised if the SB will keep forgetting to have sex.",
                            "author": "cornycatlady",
                            "id": "eqs39s9",
                            "parent_id": "t1_eqs2qmh",
                            "score": 12,
                            "created_utc": 1560275722.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqs6mzz",
                                    "parent_id": "t1_eqs39s9",
                                    "score": -7,
                                    "created_utc": 1560277914.0,
                                    "replies": [
                                        {
                                            "body": "Enlighten me",
                                            "author": "cornycatlady",
                                            "id": "eqsbe76",
                                            "parent_id": "t1_eqs6mzz",
                                            "score": 6,
                                            "created_utc": 1560281036.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eqsd93x",
                                                    "parent_id": "t1_eqsbe76",
                                                    "score": -5,
                                                    "created_utc": 1560282246.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                                            "author": "cornycatlady",
                                                            "id": "eqsfn7m",
                                                            "parent_id": "t1_eqsd93x",
                                                            "score": 6,
                                                            "created_utc": 1560283807.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "eqv0l54",
                                                                    "parent_id": "t1_eqsfn7m",
                                                                    "score": 0,
                                                                    "created_utc": 1560338896.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                                            "author": "cornycatlady",
                                                                            "id": "eqv2rix",
                                                                            "parent_id": "t1_eqv0l54",
                                                                            "score": 1,
                                                                            "created_utc": 1560339780.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "eqw3wfm",
                                                                                    "parent_id": "t1_eqv2rix",
                                                                                    "score": -1,
                                                                                    "created_utc": 1560352858.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Okay then. Goodbye 👋🏽",
                                                                                            "author": "cornycatlady",
                                                                                            "id": "eqwp7vd",
                                                                                            "parent_id": "t1_eqw3wfm",
                                                                                            "score": 1,
                                                                                            "created_utc": 1560359851.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can't really excuse behavior like that tho. Everyone knows behaving that way is shitty.",
            "author": "Elvishgirl",
            "id": "eqsbmay",
            "parent_id": "t1_eqs4wxi",
            "score": 11,
            "created_utc": 1560281182.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs78l6",
            "parent_id": "t1_eqs4nwt",
            "score": 7,
            "created_utc": 1560278304.0,
            "replies": [
                {
                    "body": "Yup",
                    "author": "gangsta_baby",
                    "id": "eqsqxfi",
                    "parent_id": "t1_eqs78l6",
                    "score": 0,
                    "created_utc": 1560291487.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs2qmh",
            "parent_id": "t1_eqs2col",
            "score": -5,
            "created_utc": 1560275387.0,
            "replies": [
                {
                    "body": "Sure if there’s clear communication about it. \n\nHowever if the SD keeps forgetting an allowance, don’t be surprised if the SB will keep forgetting to have sex.",
                    "author": "cornycatlady",
                    "id": "eqs39s9",
                    "parent_id": "t1_eqs2qmh",
                    "score": 12,
                    "created_utc": 1560275722.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqs6mzz",
                            "parent_id": "t1_eqs39s9",
                            "score": -7,
                            "created_utc": 1560277914.0,
                            "replies": [
                                {
                                    "body": "Enlighten me",
                                    "author": "cornycatlady",
                                    "id": "eqsbe76",
                                    "parent_id": "t1_eqs6mzz",
                                    "score": 6,
                                    "created_utc": 1560281036.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eqsd93x",
                                            "parent_id": "t1_eqsbe76",
                                            "score": -5,
                                            "created_utc": 1560282246.0,
                                            "replies": [
                                                {
                                                    "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                                    "author": "cornycatlady",
                                                    "id": "eqsfn7m",
                                                    "parent_id": "t1_eqsd93x",
                                                    "score": 6,
                                                    "created_utc": 1560283807.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eqv0l54",
                                                            "parent_id": "t1_eqsfn7m",
                                                            "score": 0,
                                                            "created_utc": 1560338896.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                                    "author": "cornycatlady",
                                                                    "id": "eqv2rix",
                                                                    "parent_id": "t1_eqv0l54",
                                                                    "score": 1,
                                                                    "created_utc": 1560339780.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "eqw3wfm",
                                                                            "parent_id": "t1_eqv2rix",
                                                                            "score": -1,
                                                                            "created_utc": 1560352858.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Okay then. Goodbye 👋🏽",
                                                                                    "author": "cornycatlady",
                                                                                    "id": "eqwp7vd",
                                                                                    "parent_id": "t1_eqw3wfm",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560359851.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup",
            "author": "gangsta_baby",
            "id": "eqsqxfi",
            "parent_id": "t1_eqs78l6",
            "score": 0,
            "created_utc": 1560291487.0,
            "replies": []
        },
        {
            "body": "Sure if there’s clear communication about it. \n\nHowever if the SD keeps forgetting an allowance, don’t be surprised if the SB will keep forgetting to have sex.",
            "author": "cornycatlady",
            "id": "eqs39s9",
            "parent_id": "t1_eqs2qmh",
            "score": 12,
            "created_utc": 1560275722.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqs6mzz",
                    "parent_id": "t1_eqs39s9",
                    "score": -7,
                    "created_utc": 1560277914.0,
                    "replies": [
                        {
                            "body": "Enlighten me",
                            "author": "cornycatlady",
                            "id": "eqsbe76",
                            "parent_id": "t1_eqs6mzz",
                            "score": 6,
                            "created_utc": 1560281036.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqsd93x",
                                    "parent_id": "t1_eqsbe76",
                                    "score": -5,
                                    "created_utc": 1560282246.0,
                                    "replies": [
                                        {
                                            "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                            "author": "cornycatlady",
                                            "id": "eqsfn7m",
                                            "parent_id": "t1_eqsd93x",
                                            "score": 6,
                                            "created_utc": 1560283807.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eqv0l54",
                                                    "parent_id": "t1_eqsfn7m",
                                                    "score": 0,
                                                    "created_utc": 1560338896.0,
                                                    "replies": [
                                                        {
                                                            "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                            "author": "cornycatlady",
                                                            "id": "eqv2rix",
                                                            "parent_id": "t1_eqv0l54",
                                                            "score": 1,
                                                            "created_utc": 1560339780.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "eqw3wfm",
                                                                    "parent_id": "t1_eqv2rix",
                                                                    "score": -1,
                                                                    "created_utc": 1560352858.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Okay then. Goodbye 👋🏽",
                                                                            "author": "cornycatlady",
                                                                            "id": "eqwp7vd",
                                                                            "parent_id": "t1_eqw3wfm",
                                                                            "score": 1,
                                                                            "created_utc": 1560359851.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqs6mzz",
            "parent_id": "t1_eqs39s9",
            "score": -7,
            "created_utc": 1560277914.0,
            "replies": [
                {
                    "body": "Enlighten me",
                    "author": "cornycatlady",
                    "id": "eqsbe76",
                    "parent_id": "t1_eqs6mzz",
                    "score": 6,
                    "created_utc": 1560281036.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqsd93x",
                            "parent_id": "t1_eqsbe76",
                            "score": -5,
                            "created_utc": 1560282246.0,
                            "replies": [
                                {
                                    "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                                    "author": "cornycatlady",
                                    "id": "eqsfn7m",
                                    "parent_id": "t1_eqsd93x",
                                    "score": 6,
                                    "created_utc": 1560283807.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eqv0l54",
                                            "parent_id": "t1_eqsfn7m",
                                            "score": 0,
                                            "created_utc": 1560338896.0,
                                            "replies": [
                                                {
                                                    "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                                    "author": "cornycatlady",
                                                    "id": "eqv2rix",
                                                    "parent_id": "t1_eqv0l54",
                                                    "score": 1,
                                                    "created_utc": 1560339780.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eqw3wfm",
                                                            "parent_id": "t1_eqv2rix",
                                                            "score": -1,
                                                            "created_utc": 1560352858.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Okay then. Goodbye 👋🏽",
                                                                    "author": "cornycatlady",
                                                                    "id": "eqwp7vd",
                                                                    "parent_id": "t1_eqw3wfm",
                                                                    "score": 1,
                                                                    "created_utc": 1560359851.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Enlighten me",
            "author": "cornycatlady",
            "id": "eqsbe76",
            "parent_id": "t1_eqs6mzz",
            "score": 6,
            "created_utc": 1560281036.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqsd93x",
                    "parent_id": "t1_eqsbe76",
                    "score": -5,
                    "created_utc": 1560282246.0,
                    "replies": [
                        {
                            "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                            "author": "cornycatlady",
                            "id": "eqsfn7m",
                            "parent_id": "t1_eqsd93x",
                            "score": 6,
                            "created_utc": 1560283807.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqv0l54",
                                    "parent_id": "t1_eqsfn7m",
                                    "score": 0,
                                    "created_utc": 1560338896.0,
                                    "replies": [
                                        {
                                            "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                            "author": "cornycatlady",
                                            "id": "eqv2rix",
                                            "parent_id": "t1_eqv0l54",
                                            "score": 1,
                                            "created_utc": 1560339780.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eqw3wfm",
                                                    "parent_id": "t1_eqv2rix",
                                                    "score": -1,
                                                    "created_utc": 1560352858.0,
                                                    "replies": [
                                                        {
                                                            "body": "Okay then. Goodbye 👋🏽",
                                                            "author": "cornycatlady",
                                                            "id": "eqwp7vd",
                                                            "parent_id": "t1_eqw3wfm",
                                                            "score": 1,
                                                            "created_utc": 1560359851.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqsd93x",
            "parent_id": "t1_eqsbe76",
            "score": -5,
            "created_utc": 1560282246.0,
            "replies": [
                {
                    "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
                    "author": "cornycatlady",
                    "id": "eqsfn7m",
                    "parent_id": "t1_eqsd93x",
                    "score": 6,
                    "created_utc": 1560283807.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqv0l54",
                            "parent_id": "t1_eqsfn7m",
                            "score": 0,
                            "created_utc": 1560338896.0,
                            "replies": [
                                {
                                    "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                                    "author": "cornycatlady",
                                    "id": "eqv2rix",
                                    "parent_id": "t1_eqv0l54",
                                    "score": 1,
                                    "created_utc": 1560339780.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eqw3wfm",
                                            "parent_id": "t1_eqv2rix",
                                            "score": -1,
                                            "created_utc": 1560352858.0,
                                            "replies": [
                                                {
                                                    "body": "Okay then. Goodbye 👋🏽",
                                                    "author": "cornycatlady",
                                                    "id": "eqwp7vd",
                                                    "parent_id": "t1_eqw3wfm",
                                                    "score": 1,
                                                    "created_utc": 1560359851.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope. Just because there is money involved, does not mean it’s prostitution.\n\nMoney, sex, and a genuine connection are the basis of a sugar relationship. Without one, it crosses into vanilla, platonic or prostitution.",
            "author": "cornycatlady",
            "id": "eqsfn7m",
            "parent_id": "t1_eqsd93x",
            "score": 6,
            "created_utc": 1560283807.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqv0l54",
                    "parent_id": "t1_eqsfn7m",
                    "score": 0,
                    "created_utc": 1560338896.0,
                    "replies": [
                        {
                            "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                            "author": "cornycatlady",
                            "id": "eqv2rix",
                            "parent_id": "t1_eqv0l54",
                            "score": 1,
                            "created_utc": 1560339780.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqw3wfm",
                                    "parent_id": "t1_eqv2rix",
                                    "score": -1,
                                    "created_utc": 1560352858.0,
                                    "replies": [
                                        {
                                            "body": "Okay then. Goodbye 👋🏽",
                                            "author": "cornycatlady",
                                            "id": "eqwp7vd",
                                            "parent_id": "t1_eqw3wfm",
                                            "score": 1,
                                            "created_utc": 1560359851.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqv0l54",
            "parent_id": "t1_eqsfn7m",
            "score": 0,
            "created_utc": 1560338896.0,
            "replies": [
                {
                    "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
                    "author": "cornycatlady",
                    "id": "eqv2rix",
                    "parent_id": "t1_eqv0l54",
                    "score": 1,
                    "created_utc": 1560339780.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqw3wfm",
                            "parent_id": "t1_eqv2rix",
                            "score": -1,
                            "created_utc": 1560352858.0,
                            "replies": [
                                {
                                    "body": "Okay then. Goodbye 👋🏽",
                                    "author": "cornycatlady",
                                    "id": "eqwp7vd",
                                    "parent_id": "t1_eqw3wfm",
                                    "score": 1,
                                    "created_utc": 1560359851.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whatever. I have no idea what you’re talking about. The general consensus on this sub would probably agree with me. Explain yourself, you’re being vague and impossible",
            "author": "cornycatlady",
            "id": "eqv2rix",
            "parent_id": "t1_eqv0l54",
            "score": 1,
            "created_utc": 1560339780.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqw3wfm",
                    "parent_id": "t1_eqv2rix",
                    "score": -1,
                    "created_utc": 1560352858.0,
                    "replies": [
                        {
                            "body": "Okay then. Goodbye 👋🏽",
                            "author": "cornycatlady",
                            "id": "eqwp7vd",
                            "parent_id": "t1_eqw3wfm",
                            "score": 1,
                            "created_utc": 1560359851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqw3wfm",
            "parent_id": "t1_eqv2rix",
            "score": -1,
            "created_utc": 1560352858.0,
            "replies": [
                {
                    "body": "Okay then. Goodbye 👋🏽",
                    "author": "cornycatlady",
                    "id": "eqwp7vd",
                    "parent_id": "t1_eqw3wfm",
                    "score": 1,
                    "created_utc": 1560359851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay then. Goodbye 👋🏽",
            "author": "cornycatlady",
            "id": "eqwp7vd",
            "parent_id": "t1_eqw3wfm",
            "score": 1,
            "created_utc": 1560359851.0,
            "replies": []
        }
    ]
}