{
    "title": "Just because he’s on YouTube for being a sugar daddy doesn’t mean he’s genuine.",
    "post_id": "e3rj8k",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e3rj8k/just_because_hes_on_youtube_for_being_a_sugar/",
    "author": "SBinSD_",
    "body": "Please learn from my idiotic, painful mistake. \n\nI met a POT  SD on SA who seemed to check all my boxes. Handsome, suave, and wanted to meet in person. \n\nI asked him if he had any experience in the bowl, and he sent me to a very popular YouTube video from 2012 of a TV interview with him about being a sugar daddy. I found it funny because I remembered watching it years ago. It was the whole nine yards: $$$$ allowances, multiple beachfront homes, designer everything. He seemed genuine, intelligent, the real deal. As a business owner, I was intrigued by his story as well.\n\nHis phone number checked out, so we arranged to meet in person and get sushi. We met at his place where I fell in love with his dog. Seriously, the cutest dog. I let my guard down. Next thing I know he’s cooking me dinner and being charming as hell. I’m dancing with him overlooking the ocean. \n\nBefore I know it, I’m bent over his bed while he whips me with a belt then pees on me without my consent. This is 100% new and I continue to ask him to stop. I tell him I’m uncomfortable and try to remove myself from the situation. \n\nHe gets upset, then drunk and high. I leave with no allowance while he falls all over the place. \n\nA few days later, he texts me that he won’t see me again and that I was “seductive,” but he doesn’t want to pursue anything further because I do not want to be recorded. \n\nAlthough I’m sure we all have stories of being used (I have plenty), this one stung on another level because I know how likely it is that he has done this many, many times. \n\nConsidering taking a long break from the bowl.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e3rj8k/just_because_hes_on_youtube_for_being_a_sugar/",
    "score": 131,
    "upvote_ratio": 0.95,
    "created_utc": 1575093207.0,
    "num_comments": 72,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "f94pivc",
            "parent_id": "t3_e3rj8k",
            "score": 91,
            "created_utc": 1575097168.0,
            "replies": [
                {
                    "body": "It is something I am considering at this point.",
                    "author": "SBinSD_",
                    "id": "f94rtw3",
                    "parent_id": "t1_f94pivc",
                    "score": 41,
                    "created_utc": 1575100243.0,
                    "replies": [
                        {
                            "body": "Please do at least consider it if you feel capable. You could help prevent him doing this to others.",
                            "author": "kalise_navidad",
                            "id": "f94s0mp",
                            "parent_id": "t1_f94rtw3",
                            "score": 21,
                            "created_utc": 1575100507.0,
                            "replies": []
                        },
                        {
                            "body": "Please do call the police. Save a ton of other women from the same experience and let him pay for what he did to you.",
                            "author": "Lar5031",
                            "id": "f97mz6w",
                            "parent_id": "t1_f94rtw3",
                            "score": 3,
                            "created_utc": 1575167744.0,
                            "replies": []
                        },
                        {
                            "body": "Reporting is a brave thing to do, and public conscience would probably push you in that direction. Just be careful, in areas that are less socially aware it can be a difficult process to endure. Getting justice is definitely better for other people, but you need to be sure it's also the best thing for you. \n\nI'm available in DMs if you want to discuss.",
                            "author": "msgavane",
                            "id": "f95ciwg",
                            "parent_id": "t1_f94rtw3",
                            "score": 5,
                            "created_utc": 1575124767.0,
                            "replies": []
                        },
                        {
                            "body": "You might prevent it from happening to other women by reaching out and reporting it.",
                            "author": "Goozalou",
                            "id": "f954gil",
                            "parent_id": "t1_f94rtw3",
                            "score": 5,
                            "created_utc": 1575118557.0,
                            "replies": []
                        },
                        {
                            "body": "If you are uncomfortable with the act of going to the police it'd be worth it to text him and say \"You assaulted me without consent the other night, I will be taking legal action in the coming days, please do not contact me any further\". That should at the very least make him think twice before he does this to anyone else.",
                            "author": "tenmillionplus",
                            "id": "f9675sf",
                            "parent_id": "t1_f94rtw3",
                            "score": 1,
                            "created_utc": 1575140770.0,
                            "replies": []
                        },
                        {
                            "body": "Do what you think is best, but I doubt the Police’ll do anything. \n\nBy your own admission it was all consensual. They will see the escalation to things that were non-consensual as a grey area unless you guys texted about or he recorded you unknowingly \n\nYou might be better off having a lawyer go after him in civil court.",
                            "author": null,
                            "id": "f94s13t",
                            "parent_id": "t1_f94rtw3",
                            "score": -22,
                            "created_utc": 1575100525.0,
                            "replies": [
                                {
                                    "body": "And while you are correct in that it would likely not go far even though it was rape, it might be good for my mental well-being to report it.",
                                    "author": "SBinSD_",
                                    "id": "f94s7hq",
                                    "parent_id": "t1_f94s13t",
                                    "score": 19,
                                    "created_utc": 1575100769.0,
                                    "replies": [
                                        {
                                            "body": "Please do what feels right for you and don't let anyone tell you how to feel about what you experienced.",
                                            "author": "interrobangin_",
                                            "id": "f94z9dh",
                                            "parent_id": "t1_f94s7hq",
                                            "score": 7,
                                            "created_utc": 1575111770.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Not sure if it was clear in the post, but what did happen was not consensual.",
                                    "author": "SBinSD_",
                                    "id": "f94s64j",
                                    "parent_id": "t1_f94s13t",
                                    "score": 19,
                                    "created_utc": 1575100720.0,
                                    "replies": [
                                        {
                                            "body": "\"By your own admission, it was all consensual.\"\n\nEven though you state that you asked him to stop and he didn't.\n\nWTF! I feel for the poor unfortunate souls who have encountered this Mr sugarman in any type of intimate way. This guy is all trying to mansplain what consent means, all the while fucking it up entirely. Holy hell, that was so so painful and cringe-worthy to read.",
                                            "author": "kimchi_Queen",
                                            "id": "f94x6vk",
                                            "parent_id": "t1_f94s64j",
                                            "score": 15,
                                            "created_utc": 1575108330.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not trying to mansplain anything. I was just sharing my opinion on a situation in a forum where I thought I was free and encouraged to do so.",
                                                    "author": null,
                                                    "id": "f9ga8se",
                                                    "parent_id": "t1_f94x6vk",
                                                    "score": 1,
                                                    "created_utc": 1575296048.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "If it was rape then there’s no debating, go to the cops",
                                            "author": null,
                                            "id": "f94si8r",
                                            "parent_id": "t1_f94s64j",
                                            "score": -3,
                                            "created_utc": 1575101190.0,
                                            "replies": [
                                                {
                                                    "body": "Sexual assault includes many other actions besides just rape.",
                                                    "author": "kimchi_Queen",
                                                    "id": "f94x1zu",
                                                    "parent_id": "t1_f94si8r",
                                                    "score": 8,
                                                    "created_utc": 1575108114.0,
                                                    "replies": [
                                                        {
                                                            "body": "Of course. My point was that cops aren’t going to have the patience for it.",
                                                            "author": null,
                                                            "id": "f94xagc",
                                                            "parent_id": "t1_f94x1zu",
                                                            "score": -9,
                                                            "created_utc": 1575108490.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You can revoke consent at any time during intercourse. That’s what our police department told me.",
                                    "author": "theladysgotmoxie",
                                    "id": "f94u7bu",
                                    "parent_id": "t1_f94s13t",
                                    "score": 15,
                                    "created_utc": 1575103645.0,
                                    "replies": [
                                        {
                                            "body": "Of course you can, that doesn’t mean they can convict someone with a crime. If they can’t convict, they may be unwilling to charge the accused in the first place. \n\nPolice departments weigh this type of decision all the time.",
                                            "author": null,
                                            "id": "f94yb84",
                                            "parent_id": "t1_f94u7bu",
                                            "score": -5,
                                            "created_utc": 1575110178.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, unfortunately that’s what happened to me as well. I had even gone to the hospital and had a kit done the next morning and he still wasn’t charged. I found out months later when i called to find out what was going on. They cited a lack of evidence, but now he’s in the system.",
                                                    "author": "theladysgotmoxie",
                                                    "id": "f95bd6c",
                                                    "parent_id": "t1_f94yb84",
                                                    "score": 3,
                                                    "created_utc": 1575123960.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
                                                            "author": null,
                                                            "id": "f9g2y60",
                                                            "parent_id": "t1_f95bd6c",
                                                            "score": 3,
                                                            "created_utc": 1575292373.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f94uvai",
                                    "parent_id": "t1_f94s13t",
                                    "score": 14,
                                    "created_utc": 1575104663.0,
                                    "replies": [
                                        {
                                            "body": "The way it’s written it can be interpreted differently. I read it as they had consensual sex until he peed on her, then she told him to stop.\n\nThis would mean everything that happened before the peeing was consensual, and everything after was non-consensual. The cops would then focus on the non-consensual acts\n\nIf I misread OP then my apologies",
                                            "author": null,
                                            "id": "f94y8gr",
                                            "parent_id": "t1_f94uvai",
                                            "score": -5,
                                            "created_utc": 1575110053.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f976amg",
                                                    "parent_id": "t1_f94y8gr",
                                                    "score": 2,
                                                    "created_utc": 1575160343.0,
                                                    "replies": [
                                                        {
                                                            "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
                                                            "author": null,
                                                            "id": "f9g2blc",
                                                            "parent_id": "t1_f976amg",
                                                            "score": 1,
                                                            "created_utc": 1575292002.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "f9g44c1",
                                                                    "parent_id": "t1_f9g2blc",
                                                                    "score": 1,
                                                                    "created_utc": 1575293018.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                                                                            "author": null,
                                                                            "id": "f9g4j89",
                                                                            "parent_id": "t1_f9g44c1",
                                                                            "score": 1,
                                                                            "created_utc": 1575293192.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "f9g58kh",
                                                                                    "parent_id": "t1_f9g4j89",
                                                                                    "score": 0,
                                                                                    "created_utc": 1575293543.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                                                                            "author": null,
                                                                                            "id": "f9g659s",
                                                                                            "parent_id": "t1_f9g58kh",
                                                                                            "score": 1,
                                                                                            "created_utc": 1575294007.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThat is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. And once they withdraw consent, and are ignored, it's no longer consensual.",
                                    "author": "interrobangin_",
                                    "id": "f94z8gu",
                                    "parent_id": "t1_f94s13t",
                                    "score": 7,
                                    "created_utc": 1575111727.0,
                                    "replies": [
                                        {
                                            "body": ">She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThe way I read it makes it sound like they started consensually then he started doing things she didn’t consent to, then she told him to stop and didn’t. Clearly a violation of her consent  and assault.\n\nHowever, that’s very different than the police even trying to charge someone (and succeeding in a conviction)\n\n>That is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. \n\nI don’t think I said that.\n\n>And once they withdraw consent, and are ignored, it's no longer consensual.\n\nCorrect",
                                            "author": null,
                                            "id": "f94zv0k",
                                            "parent_id": "t1_f94z8gu",
                                            "score": -1,
                                            "created_utc": 1575112763.0,
                                            "replies": [
                                                {
                                                    "body": "Your suggestion that she not even report him because the police probably won't help is not helpful. Rape victims shouldn't be told to be quiet just because the odds are against them. If it will help her heal to file a report against him, that's what she should do.\n\nYour exact words were \"by your own admission, it was all consensual\". So yes, you did say that. Which is why I felt you needed consent explained.",
                                                    "author": "interrobangin_",
                                                    "id": "f9500k4",
                                                    "parent_id": "t1_f94zv0k",
                                                    "score": 7,
                                                    "created_utc": 1575113018.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
                                                            "author": null,
                                                            "id": "f959whz",
                                                            "parent_id": "t1_f9500k4",
                                                            "score": -4,
                                                            "created_utc": 1575122882.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                                                                    "author": "King_of_SDs",
                                                                    "id": "f972fn3",
                                                                    "parent_id": "t1_f959whz",
                                                                    "score": 3,
                                                                    "created_utc": 1575157707.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No but the police department does. Isn’t that what we’re talking about here?",
                                                                            "author": null,
                                                                            "id": "f9g2j7t",
                                                                            "parent_id": "t1_f972fn3",
                                                                            "score": 1,
                                                                            "created_utc": 1575292120.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So sorry. Ugh. Putting this out there for the benefit of others is really selfless of you. \n\nSomeone will be spared learning this the hard way because you spoke up.",
            "author": "King_of_SDs",
            "id": "f94mjmo",
            "parent_id": "t3_e3rj8k",
            "score": 32,
            "created_utc": 1575093579.0,
            "replies": [
                {
                    "body": "It’s tough and took me a few days to be able to post, but hoping this resonates and helps others. I am by no means a newbie and usually think I am fairly street smart, but this is a tough reminder that most people aren’t as genuine as we want them to be.",
                    "author": "SBinSD_",
                    "id": "f94mnmk",
                    "parent_id": "t1_f94mjmo",
                    "score": 20,
                    "created_utc": 1575093704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a very good example of why you should never ever under any circumstances have a first meeting at POTs home. I am so sorry this happened to you and I hope this piece of shit gets what he deserves.",
            "author": "Ryan111778",
            "id": "f965u9g",
            "parent_id": "t3_e3rj8k",
            "score": 11,
            "created_utc": 1575140127.0,
            "replies": []
        },
        {
            "body": "my god that was 0-100",
            "author": "kamicandy",
            "id": "f971911",
            "parent_id": "t3_e3rj8k",
            "score": 7,
            "created_utc": 1575156909.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f95ag3n",
            "parent_id": "t3_e3rj8k",
            "score": 18,
            "created_utc": 1575123278.0,
            "replies": [
                {
                    "body": "Some justice is better then no justice. These types of men hate giving anything at all, you already have your trauma so he better pays for it!",
                    "author": "missesredpil",
                    "id": "f97x3hl",
                    "parent_id": "t1_f95ag3n",
                    "score": 2,
                    "created_utc": 1575171353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow!  I'm really sorry this happened to you.  Some tough lessons to learn.\n\n* Just because he has money doesn't mean he will share it with you\n* Psychopaths and narcissists are often financially successful people and are more common in the Sugar World than in every day life.  They have no compassion which can be an asset in business dealings, but can be extremely manipulative and dangerous.\n* Drugs and alcohol abuse are common\n* Physical abuse and violence is common",
            "author": "willfromvb",
            "id": "f94oxvs",
            "parent_id": "t3_e3rj8k",
            "score": 22,
            "created_utc": 1575096419.0,
            "replies": [
                {
                    "body": "All very true points.",
                    "author": "SBinSD_",
                    "id": "f94pd1n",
                    "parent_id": "t1_f94oxvs",
                    "score": 4,
                    "created_utc": 1575096956.0,
                    "replies": []
                },
                {
                    "body": "That’s exactly the problem ! You really hit the nail on that!",
                    "author": "missesredpil",
                    "id": "f97wwag",
                    "parent_id": "t1_f94oxvs",
                    "score": 1,
                    "created_utc": 1575171281.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry this happened to you",
            "author": null,
            "id": "f94mchy",
            "parent_id": "t3_e3rj8k",
            "score": 11,
            "created_utc": 1575093361.0,
            "replies": [
                {
                    "body": "It happens, it just hurts because I don’t want it to happen to anyone else.",
                    "author": "SBinSD_",
                    "id": "f94mhqt",
                    "parent_id": "t1_f94mchy",
                    "score": 14,
                    "created_utc": 1575093523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it were me I would blackmail him into at least giving you some allowance, and report him anonymously anyways.",
            "author": "kamicandy",
            "id": "f971epm",
            "parent_id": "t3_e3rj8k",
            "score": 3,
            "created_utc": 1575157015.0,
            "replies": []
        },
        {
            "body": "We are both guilty of chasing after the shiny stuff, SBs and SDs. So unfortunate and I'm so sorry this happened.\n\nTruth is, the most important aspect of a POT isn't their ability to pay and offer a luxurious lifestyle, it is: **Is he a decent person?** Because no amount of money and luxury will matter if he wants to whip you with a belt and piss on you :(",
            "author": "gingerdaddy56",
            "id": "f95d1jm",
            "parent_id": "t3_e3rj8k",
            "score": 6,
            "created_utc": 1575125122.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you. It's typical that shits like this will blame the other person (i.e. \"...he won’t see me again and that I was “seductive,” but he doesn’t want to pursue anything further because I do not want to be recorded.\") And it's also fairly typical that shits like this with money think they're above the law and won't be pursued.\n\nTwo things: 1) Him doing that was NOT your fault; 2) You did nothing wrong. You made it clear what he was doing was NOT welcome or wanted, and he continued. That is assault. Plain and simple. Whether you choose to make him face legal consequences or not is your choice.\n\nI also agree on your taking a break for a while. Assault causes trauma, which will take time to heal from and you owe that to yourself. \n\nIn future - and this is for ALL SBs - don't be blinded if a potential SD shows off money and material goods. In my experience, genuine SDs (and good people in general) have no need to do this. I also agree never meeting a POT SD at his home the first time. Occasionally it turns out well ... but all too often it doesn't.",
            "author": null,
            "id": "f97jxvl",
            "parent_id": "t3_e3rj8k",
            "score": 3,
            "created_utc": 1575166601.0,
            "replies": []
        },
        {
            "body": "This was sexual assault, no question. You need to go to the police. Good god, sorry this happened.",
            "author": null,
            "id": "f983ugm",
            "parent_id": "t3_e3rj8k",
            "score": 2,
            "created_utc": 1575173631.0,
            "replies": []
        },
        {
            "body": "https://youtu.be/S3W7g2puKY4\n\nWink if this is the guy",
            "author": "Gabagaba62",
            "id": "f94uxem",
            "parent_id": "t3_e3rj8k",
            "score": 5,
            "created_utc": 1575104752.0,
            "replies": [
                {
                    "body": "I thought of exactly this nightline segment when I read the post. I wonder if it’s him also. I wasn’t in the bowl at the time i saw this and as a guy  it actually turned me off to the idea. Him and the relationships seemed so fake and nasty.  So glad that reality can be so much more natural and fun.",
                    "author": "cooldudeATX",
                    "id": "f96xko9",
                    "parent_id": "t1_f94uxem",
                    "score": 2,
                    "created_utc": 1575154419.0,
                    "replies": []
                },
                {
                    "body": "Seriously... OMG.\n\nOkay- I am not experienced in the bowl, I kind of lucked out.. or not. I haven’t decided yet. Half of the messages I have ever received on Seeking Arrangements I never responded to because I wasn’t physically attracted to the dude that messaged me. \n \nLet me just say, I am not a good pretender. \nMy SD is sexy AF. He an I have one of those real (but rare) connections, that sometimes people don’t ever experience even in vanilla relationships- or whatever; unless he is an extremely good pretender.\n\nSo, for those of you that do the whole sugar thing with men that you’re not physically attracted to, but pretend to be, HOW?!  Like I previously said, I’m not experienced, not a good pretender, and my SD might not even be what you consider a real SD.  There’s no PPM or allowance, if I need help I ask him. I genuinely enjoy spending time with him and always want more. \nSalt, sugar or vanilla???",
                    "author": "shessosweeter",
                    "id": "f95ef48",
                    "parent_id": "t1_f94uxem",
                    "score": 0,
                    "created_utc": 1575126026.0,
                    "replies": [
                        {
                            "body": "I think you’re better off making your own post.",
                            "author": "YourExoticBabe",
                            "id": "f95s5rz",
                            "parent_id": "t1_f95ef48",
                            "score": 5,
                            "created_utc": 1575134292.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear that. Hope you come out stronger from all this. It’s always important to not get blinded by shiny and distracting stuff, that’s how all cons work by distracting you from what you should be paying attention to.",
            "author": null,
            "id": "f94nxj8",
            "parent_id": "t3_e3rj8k",
            "score": 3,
            "created_utc": 1575095187.0,
            "replies": [
                {
                    "body": "Shiny stuff includes cute puppies, and while we do need to be careful and protect ourselves, assault is never okay. \n\nI hope that in the future, we do better.",
                    "author": "SBinSD_",
                    "id": "f94pfap",
                    "parent_id": "t1_f94nxj8",
                    "score": 10,
                    "created_utc": 1575097038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very brave of you to share this cautionary tale. I hope you do consider reporting him for assault. Take care of yourself.",
            "author": "roscoe7585",
            "id": "f95frdp",
            "parent_id": "t3_e3rj8k",
            "score": 2,
            "created_utc": 1575126817.0,
            "replies": []
        },
        {
            "body": "So for any SBs who are reading this and want to know what to do to avoid this situation, what’s the answer?",
            "author": "King_of_SDs",
            "id": "f94prbg",
            "parent_id": "t3_e3rj8k",
            "score": 3,
            "created_utc": 1575097475.0,
            "replies": []
        },
        {
            "body": "I’m sorry and I feel you. Something similar happened to me, except the guy straight up told me he had used me, he was going to keep doing it to other people and there was nothing I could do about it. Because of where I live, I can’t go to police about it, but if this is something you can do legally without facing issues, please consider it... it’s difficult and up to you, but these men act the way they do because they think they can get away with it, until someone proves them they can’t",
            "author": null,
            "id": "f9fsjqj",
            "parent_id": "t3_e3rj8k",
            "score": 1,
            "created_utc": 1575284676.0,
            "replies": []
        },
        {
            "body": "I am so sorry this happened to you. \n\nWhat a twit. As if it's so hard to ask if a pot SB is into golden showers & being whipped. 🙄",
            "author": "bsbdfw",
            "id": "fac41tl",
            "parent_id": "t3_e3rj8k",
            "score": 1,
            "created_utc": 1575933210.0,
            "replies": []
        },
        {
            "body": "I don't know how many times I've met guys whip out their phone right away and record without consent. And it took me 5 of these crappy hookups before I realize I have the right to refuse it.\n Guys who record during sex are usually assholes too, like you're just some souvenir/trophy in their phone.",
            "author": "AquaScope",
            "id": "fb8rkpm",
            "parent_id": "t3_e3rj8k",
            "score": 1,
            "created_utc": 1576620205.0,
            "replies": []
        },
        {
            "body": "I’m so sorry this happened to you",
            "author": "allisonpv",
            "id": "f94viu6",
            "parent_id": "t3_e3rj8k",
            "score": 1,
            "created_utc": 1575105694.0,
            "replies": []
        },
        {
            "body": "Very very sorry about this experience .... \n\nOne way to avoid this type of situations is :\n\nalways to have some brief talk about sexuality fetishes in the meet and greet or in talking or texting before meeting to make sure \n\nI have a butt fetish and I always bring it up early to check chemistry \n\nAs a sugar daddy he should have discussed things and initiated the topic of both allowance and sexuality to insure your comfort ...",
            "author": "shamloo77",
            "id": "f94n1na",
            "parent_id": "t3_e3rj8k",
            "score": -1,
            "created_utc": 1575094143.0,
            "replies": [
                {
                    "body": "We briefly discussed sub / dom preferences, but nothing regarding piss play or recording. \n\nEither way, I was assaulted. I didn’t consent to anything. Not okay.",
                    "author": "SBinSD_",
                    "id": "f94n5iq",
                    "parent_id": "t1_f94n1na",
                    "score": 19,
                    "created_utc": 1575094269.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f96gng5",
                    "parent_id": "t1_f94n1na",
                    "score": 1,
                    "created_utc": 1575144793.0,
                    "replies": [
                        {
                            "body": "You are not making sense ... bc nothing is lost by having a discussion about sexuality and fetishes in a meet and great ..",
                            "author": "shamloo77",
                            "id": "f96i49o",
                            "parent_id": "t1_f96gng5",
                            "score": 2,
                            "created_utc": 1575145443.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is a piece of shit. Who pees on a pretty lady? My advice to women is to go for guys with a decent education. Some turn to be a successful business guy and especially the professional education guys have the empathy. Business guys lose their soul over time. Seen it over and over .",
            "author": "golferkris101",
            "id": "f95d6k9",
            "parent_id": "t3_e3rj8k",
            "score": -1,
            "created_utc": 1575125208.0,
            "replies": [
                {
                    "body": "Rewrite: “who assaults people?”, not “who pees on a pretty lady?”",
                    "author": "SBinSD_",
                    "id": "f95lzll",
                    "parent_id": "t1_f95d6k9",
                    "score": 8,
                    "created_utc": 1575130701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn... he must’ve been pretty calm to all of the sudden take a piss on you. Did you consent to the fucking or to the head, or did you not consent to anything? How did he all of the sudden piss on you? Maybe everything was recorded? The recording would be great evidence in a lawsuit. \nBut because of the nature of the transactional meetings, a lawsuit would be really expensive and time consuming with subpar chances of favorability.",
            "author": "Limitlesspappy",
            "id": "f97ai5a",
            "parent_id": "t3_e3rj8k",
            "score": 0,
            "created_utc": 1575162789.0,
            "replies": []
        },
        {
            "body": "So... you seduced the piss outta him and he forced a lawsuit outta you... it is what is it is. If he tells you to cut it out tell him that it is above you now in the hands of the law.",
            "author": "DarlingKC",
            "id": "f95p8tb",
            "parent_id": "t3_e3rj8k",
            "score": -2,
            "created_utc": 1575132614.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "f94mhk0",
            "parent_id": "t3_e3rj8k",
            "score": -24,
            "created_utc": 1575093517.0,
            "replies": [
                {
                    "body": "Sure wasn’t worth it. I’ve been in the bowl for years so should “know better”, but this was an entirely new level.",
                    "author": "SBinSD_",
                    "id": "f94mktn",
                    "parent_id": "t1_f94mhk0",
                    "score": 5,
                    "created_utc": 1575093616.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f94mzhf",
                            "parent_id": "t1_f94mktn",
                            "score": 1,
                            "created_utc": 1575094072.0,
                            "replies": [
                                {
                                    "body": "Maybe this wasn’t clear in the post, but I didn’t consent to any form of sex. He assaulted me.",
                                    "author": "SBinSD_",
                                    "id": "f94n4db",
                                    "parent_id": "t1_f94mzhf",
                                    "score": 9,
                                    "created_utc": 1575094232.0,
                                    "replies": [
                                        {
                                            "body": "The comment sucks but look at it this way, he’s an ever present example of what most SBs say they want to avoid.",
                                            "author": "King_of_SDs",
                                            "id": "f94pjq2",
                                            "parent_id": "t1_f94n4db",
                                            "score": -2,
                                            "created_utc": 1575097199.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wow, you're really fucking insensitive.",
                    "author": null,
                    "id": "f94onae",
                    "parent_id": "t1_f94mhk0",
                    "score": 10,
                    "created_utc": 1575096050.0,
                    "replies": [
                        {
                            "body": "Yeah I saw the comment and immediately blocked this useless troll user. And the screen name! What a loser. I block people who comment useless shit like that because it would be such a waste of time and energy to ever read anything they write.",
                            "author": "kimchi_Queen",
                            "id": "f94xcwm",
                            "parent_id": "t1_f94onae",
                            "score": 6,
                            "created_utc": 1575108601.0,
                            "replies": []
                        },
                        {
                            "body": "Understatement.",
                            "author": "King_of_SDs",
                            "id": "f94pmfi",
                            "parent_id": "t1_f94onae",
                            "score": 2,
                            "created_utc": 1575097295.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wow. \nWhat a comment?",
                    "author": null,
                    "id": "f94xhg9",
                    "parent_id": "t1_f94mhk0",
                    "score": 1,
                    "created_utc": 1575108816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f95eia5",
            "parent_id": "t3_e3rj8k",
            "score": -2,
            "created_utc": 1575126079.0,
            "replies": [
                {
                    "body": "Thank you for assuming my mental state around other men.",
                    "author": "SBinSD_",
                    "id": "f95m1p5",
                    "parent_id": "t1_f95eia5",
                    "score": 1,
                    "created_utc": 1575130738.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f95melr",
                            "parent_id": "t1_f95m1p5",
                            "score": 0,
                            "created_utc": 1575130981.0,
                            "replies": [
                                {
                                    "body": "I think she is being sarcastic 🙄",
                                    "author": "DarlingKC",
                                    "id": "f95osa9",
                                    "parent_id": "t1_f95melr",
                                    "score": 3,
                                    "created_utc": 1575132370.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is something I am considering at this point.",
            "author": "SBinSD_",
            "id": "f94rtw3",
            "parent_id": "t1_f94pivc",
            "score": 41,
            "created_utc": 1575100243.0,
            "replies": [
                {
                    "body": "Please do at least consider it if you feel capable. You could help prevent him doing this to others.",
                    "author": "kalise_navidad",
                    "id": "f94s0mp",
                    "parent_id": "t1_f94rtw3",
                    "score": 21,
                    "created_utc": 1575100507.0,
                    "replies": []
                },
                {
                    "body": "Please do call the police. Save a ton of other women from the same experience and let him pay for what he did to you.",
                    "author": "Lar5031",
                    "id": "f97mz6w",
                    "parent_id": "t1_f94rtw3",
                    "score": 3,
                    "created_utc": 1575167744.0,
                    "replies": []
                },
                {
                    "body": "Reporting is a brave thing to do, and public conscience would probably push you in that direction. Just be careful, in areas that are less socially aware it can be a difficult process to endure. Getting justice is definitely better for other people, but you need to be sure it's also the best thing for you. \n\nI'm available in DMs if you want to discuss.",
                    "author": "msgavane",
                    "id": "f95ciwg",
                    "parent_id": "t1_f94rtw3",
                    "score": 5,
                    "created_utc": 1575124767.0,
                    "replies": []
                },
                {
                    "body": "You might prevent it from happening to other women by reaching out and reporting it.",
                    "author": "Goozalou",
                    "id": "f954gil",
                    "parent_id": "t1_f94rtw3",
                    "score": 5,
                    "created_utc": 1575118557.0,
                    "replies": []
                },
                {
                    "body": "If you are uncomfortable with the act of going to the police it'd be worth it to text him and say \"You assaulted me without consent the other night, I will be taking legal action in the coming days, please do not contact me any further\". That should at the very least make him think twice before he does this to anyone else.",
                    "author": "tenmillionplus",
                    "id": "f9675sf",
                    "parent_id": "t1_f94rtw3",
                    "score": 1,
                    "created_utc": 1575140770.0,
                    "replies": []
                },
                {
                    "body": "Do what you think is best, but I doubt the Police’ll do anything. \n\nBy your own admission it was all consensual. They will see the escalation to things that were non-consensual as a grey area unless you guys texted about or he recorded you unknowingly \n\nYou might be better off having a lawyer go after him in civil court.",
                    "author": null,
                    "id": "f94s13t",
                    "parent_id": "t1_f94rtw3",
                    "score": -22,
                    "created_utc": 1575100525.0,
                    "replies": [
                        {
                            "body": "And while you are correct in that it would likely not go far even though it was rape, it might be good for my mental well-being to report it.",
                            "author": "SBinSD_",
                            "id": "f94s7hq",
                            "parent_id": "t1_f94s13t",
                            "score": 19,
                            "created_utc": 1575100769.0,
                            "replies": [
                                {
                                    "body": "Please do what feels right for you and don't let anyone tell you how to feel about what you experienced.",
                                    "author": "interrobangin_",
                                    "id": "f94z9dh",
                                    "parent_id": "t1_f94s7hq",
                                    "score": 7,
                                    "created_utc": 1575111770.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Not sure if it was clear in the post, but what did happen was not consensual.",
                            "author": "SBinSD_",
                            "id": "f94s64j",
                            "parent_id": "t1_f94s13t",
                            "score": 19,
                            "created_utc": 1575100720.0,
                            "replies": [
                                {
                                    "body": "\"By your own admission, it was all consensual.\"\n\nEven though you state that you asked him to stop and he didn't.\n\nWTF! I feel for the poor unfortunate souls who have encountered this Mr sugarman in any type of intimate way. This guy is all trying to mansplain what consent means, all the while fucking it up entirely. Holy hell, that was so so painful and cringe-worthy to read.",
                                    "author": "kimchi_Queen",
                                    "id": "f94x6vk",
                                    "parent_id": "t1_f94s64j",
                                    "score": 15,
                                    "created_utc": 1575108330.0,
                                    "replies": [
                                        {
                                            "body": "I’m not trying to mansplain anything. I was just sharing my opinion on a situation in a forum where I thought I was free and encouraged to do so.",
                                            "author": null,
                                            "id": "f9ga8se",
                                            "parent_id": "t1_f94x6vk",
                                            "score": 1,
                                            "created_utc": 1575296048.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "If it was rape then there’s no debating, go to the cops",
                                    "author": null,
                                    "id": "f94si8r",
                                    "parent_id": "t1_f94s64j",
                                    "score": -3,
                                    "created_utc": 1575101190.0,
                                    "replies": [
                                        {
                                            "body": "Sexual assault includes many other actions besides just rape.",
                                            "author": "kimchi_Queen",
                                            "id": "f94x1zu",
                                            "parent_id": "t1_f94si8r",
                                            "score": 8,
                                            "created_utc": 1575108114.0,
                                            "replies": [
                                                {
                                                    "body": "Of course. My point was that cops aren’t going to have the patience for it.",
                                                    "author": null,
                                                    "id": "f94xagc",
                                                    "parent_id": "t1_f94x1zu",
                                                    "score": -9,
                                                    "created_utc": 1575108490.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You can revoke consent at any time during intercourse. That’s what our police department told me.",
                            "author": "theladysgotmoxie",
                            "id": "f94u7bu",
                            "parent_id": "t1_f94s13t",
                            "score": 15,
                            "created_utc": 1575103645.0,
                            "replies": [
                                {
                                    "body": "Of course you can, that doesn’t mean they can convict someone with a crime. If they can’t convict, they may be unwilling to charge the accused in the first place. \n\nPolice departments weigh this type of decision all the time.",
                                    "author": null,
                                    "id": "f94yb84",
                                    "parent_id": "t1_f94u7bu",
                                    "score": -5,
                                    "created_utc": 1575110178.0,
                                    "replies": [
                                        {
                                            "body": "Yes, unfortunately that’s what happened to me as well. I had even gone to the hospital and had a kit done the next morning and he still wasn’t charged. I found out months later when i called to find out what was going on. They cited a lack of evidence, but now he’s in the system.",
                                            "author": "theladysgotmoxie",
                                            "id": "f95bd6c",
                                            "parent_id": "t1_f94yb84",
                                            "score": 3,
                                            "created_utc": 1575123960.0,
                                            "replies": [
                                                {
                                                    "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
                                                    "author": null,
                                                    "id": "f9g2y60",
                                                    "parent_id": "t1_f95bd6c",
                                                    "score": 3,
                                                    "created_utc": 1575292373.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f94uvai",
                            "parent_id": "t1_f94s13t",
                            "score": 14,
                            "created_utc": 1575104663.0,
                            "replies": [
                                {
                                    "body": "The way it’s written it can be interpreted differently. I read it as they had consensual sex until he peed on her, then she told him to stop.\n\nThis would mean everything that happened before the peeing was consensual, and everything after was non-consensual. The cops would then focus on the non-consensual acts\n\nIf I misread OP then my apologies",
                                    "author": null,
                                    "id": "f94y8gr",
                                    "parent_id": "t1_f94uvai",
                                    "score": -5,
                                    "created_utc": 1575110053.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f976amg",
                                            "parent_id": "t1_f94y8gr",
                                            "score": 2,
                                            "created_utc": 1575160343.0,
                                            "replies": [
                                                {
                                                    "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
                                                    "author": null,
                                                    "id": "f9g2blc",
                                                    "parent_id": "t1_f976amg",
                                                    "score": 1,
                                                    "created_utc": 1575292002.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "f9g44c1",
                                                            "parent_id": "t1_f9g2blc",
                                                            "score": 1,
                                                            "created_utc": 1575293018.0,
                                                            "replies": [
                                                                {
                                                                    "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                                                                    "author": null,
                                                                    "id": "f9g4j89",
                                                                    "parent_id": "t1_f9g44c1",
                                                                    "score": 1,
                                                                    "created_utc": 1575293192.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "f9g58kh",
                                                                            "parent_id": "t1_f9g4j89",
                                                                            "score": 0,
                                                                            "created_utc": 1575293543.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                                                                    "author": null,
                                                                                    "id": "f9g659s",
                                                                                    "parent_id": "t1_f9g58kh",
                                                                                    "score": 1,
                                                                                    "created_utc": 1575294007.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThat is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. And once they withdraw consent, and are ignored, it's no longer consensual.",
                            "author": "interrobangin_",
                            "id": "f94z8gu",
                            "parent_id": "t1_f94s13t",
                            "score": 7,
                            "created_utc": 1575111727.0,
                            "replies": [
                                {
                                    "body": ">She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThe way I read it makes it sound like they started consensually then he started doing things she didn’t consent to, then she told him to stop and didn’t. Clearly a violation of her consent  and assault.\n\nHowever, that’s very different than the police even trying to charge someone (and succeeding in a conviction)\n\n>That is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. \n\nI don’t think I said that.\n\n>And once they withdraw consent, and are ignored, it's no longer consensual.\n\nCorrect",
                                    "author": null,
                                    "id": "f94zv0k",
                                    "parent_id": "t1_f94z8gu",
                                    "score": -1,
                                    "created_utc": 1575112763.0,
                                    "replies": [
                                        {
                                            "body": "Your suggestion that she not even report him because the police probably won't help is not helpful. Rape victims shouldn't be told to be quiet just because the odds are against them. If it will help her heal to file a report against him, that's what she should do.\n\nYour exact words were \"by your own admission, it was all consensual\". So yes, you did say that. Which is why I felt you needed consent explained.",
                                            "author": "interrobangin_",
                                            "id": "f9500k4",
                                            "parent_id": "t1_f94zv0k",
                                            "score": 7,
                                            "created_utc": 1575113018.0,
                                            "replies": [
                                                {
                                                    "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
                                                    "author": null,
                                                    "id": "f959whz",
                                                    "parent_id": "t1_f9500k4",
                                                    "score": -4,
                                                    "created_utc": 1575122882.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                                                            "author": "King_of_SDs",
                                                            "id": "f972fn3",
                                                            "parent_id": "t1_f959whz",
                                                            "score": 3,
                                                            "created_utc": 1575157707.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No but the police department does. Isn’t that what we’re talking about here?",
                                                                    "author": null,
                                                                    "id": "f9g2j7t",
                                                                    "parent_id": "t1_f972fn3",
                                                                    "score": 1,
                                                                    "created_utc": 1575292120.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s tough and took me a few days to be able to post, but hoping this resonates and helps others. I am by no means a newbie and usually think I am fairly street smart, but this is a tough reminder that most people aren’t as genuine as we want them to be.",
            "author": "SBinSD_",
            "id": "f94mnmk",
            "parent_id": "t1_f94mjmo",
            "score": 20,
            "created_utc": 1575093704.0,
            "replies": []
        },
        {
            "body": "Some justice is better then no justice. These types of men hate giving anything at all, you already have your trauma so he better pays for it!",
            "author": "missesredpil",
            "id": "f97x3hl",
            "parent_id": "t1_f95ag3n",
            "score": 2,
            "created_utc": 1575171353.0,
            "replies": []
        },
        {
            "body": "All very true points.",
            "author": "SBinSD_",
            "id": "f94pd1n",
            "parent_id": "t1_f94oxvs",
            "score": 4,
            "created_utc": 1575096956.0,
            "replies": []
        },
        {
            "body": "That’s exactly the problem ! You really hit the nail on that!",
            "author": "missesredpil",
            "id": "f97wwag",
            "parent_id": "t1_f94oxvs",
            "score": 1,
            "created_utc": 1575171281.0,
            "replies": []
        },
        {
            "body": "It happens, it just hurts because I don’t want it to happen to anyone else.",
            "author": "SBinSD_",
            "id": "f94mhqt",
            "parent_id": "t1_f94mchy",
            "score": 14,
            "created_utc": 1575093523.0,
            "replies": []
        },
        {
            "body": "I thought of exactly this nightline segment when I read the post. I wonder if it’s him also. I wasn’t in the bowl at the time i saw this and as a guy  it actually turned me off to the idea. Him and the relationships seemed so fake and nasty.  So glad that reality can be so much more natural and fun.",
            "author": "cooldudeATX",
            "id": "f96xko9",
            "parent_id": "t1_f94uxem",
            "score": 2,
            "created_utc": 1575154419.0,
            "replies": []
        },
        {
            "body": "Seriously... OMG.\n\nOkay- I am not experienced in the bowl, I kind of lucked out.. or not. I haven’t decided yet. Half of the messages I have ever received on Seeking Arrangements I never responded to because I wasn’t physically attracted to the dude that messaged me. \n \nLet me just say, I am not a good pretender. \nMy SD is sexy AF. He an I have one of those real (but rare) connections, that sometimes people don’t ever experience even in vanilla relationships- or whatever; unless he is an extremely good pretender.\n\nSo, for those of you that do the whole sugar thing with men that you’re not physically attracted to, but pretend to be, HOW?!  Like I previously said, I’m not experienced, not a good pretender, and my SD might not even be what you consider a real SD.  There’s no PPM or allowance, if I need help I ask him. I genuinely enjoy spending time with him and always want more. \nSalt, sugar or vanilla???",
            "author": "shessosweeter",
            "id": "f95ef48",
            "parent_id": "t1_f94uxem",
            "score": 0,
            "created_utc": 1575126026.0,
            "replies": [
                {
                    "body": "I think you’re better off making your own post.",
                    "author": "YourExoticBabe",
                    "id": "f95s5rz",
                    "parent_id": "t1_f95ef48",
                    "score": 5,
                    "created_utc": 1575134292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shiny stuff includes cute puppies, and while we do need to be careful and protect ourselves, assault is never okay. \n\nI hope that in the future, we do better.",
            "author": "SBinSD_",
            "id": "f94pfap",
            "parent_id": "t1_f94nxj8",
            "score": 10,
            "created_utc": 1575097038.0,
            "replies": []
        },
        {
            "body": "We briefly discussed sub / dom preferences, but nothing regarding piss play or recording. \n\nEither way, I was assaulted. I didn’t consent to anything. Not okay.",
            "author": "SBinSD_",
            "id": "f94n5iq",
            "parent_id": "t1_f94n1na",
            "score": 19,
            "created_utc": 1575094269.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f96gng5",
            "parent_id": "t1_f94n1na",
            "score": 1,
            "created_utc": 1575144793.0,
            "replies": [
                {
                    "body": "You are not making sense ... bc nothing is lost by having a discussion about sexuality and fetishes in a meet and great ..",
                    "author": "shamloo77",
                    "id": "f96i49o",
                    "parent_id": "t1_f96gng5",
                    "score": 2,
                    "created_utc": 1575145443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rewrite: “who assaults people?”, not “who pees on a pretty lady?”",
            "author": "SBinSD_",
            "id": "f95lzll",
            "parent_id": "t1_f95d6k9",
            "score": 8,
            "created_utc": 1575130701.0,
            "replies": []
        },
        {
            "body": "Sure wasn’t worth it. I’ve been in the bowl for years so should “know better”, but this was an entirely new level.",
            "author": "SBinSD_",
            "id": "f94mktn",
            "parent_id": "t1_f94mhk0",
            "score": 5,
            "created_utc": 1575093616.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f94mzhf",
                    "parent_id": "t1_f94mktn",
                    "score": 1,
                    "created_utc": 1575094072.0,
                    "replies": [
                        {
                            "body": "Maybe this wasn’t clear in the post, but I didn’t consent to any form of sex. He assaulted me.",
                            "author": "SBinSD_",
                            "id": "f94n4db",
                            "parent_id": "t1_f94mzhf",
                            "score": 9,
                            "created_utc": 1575094232.0,
                            "replies": [
                                {
                                    "body": "The comment sucks but look at it this way, he’s an ever present example of what most SBs say they want to avoid.",
                                    "author": "King_of_SDs",
                                    "id": "f94pjq2",
                                    "parent_id": "t1_f94n4db",
                                    "score": -2,
                                    "created_utc": 1575097199.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, you're really fucking insensitive.",
            "author": null,
            "id": "f94onae",
            "parent_id": "t1_f94mhk0",
            "score": 10,
            "created_utc": 1575096050.0,
            "replies": [
                {
                    "body": "Yeah I saw the comment and immediately blocked this useless troll user. And the screen name! What a loser. I block people who comment useless shit like that because it would be such a waste of time and energy to ever read anything they write.",
                    "author": "kimchi_Queen",
                    "id": "f94xcwm",
                    "parent_id": "t1_f94onae",
                    "score": 6,
                    "created_utc": 1575108601.0,
                    "replies": []
                },
                {
                    "body": "Understatement.",
                    "author": "King_of_SDs",
                    "id": "f94pmfi",
                    "parent_id": "t1_f94onae",
                    "score": 2,
                    "created_utc": 1575097295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. \nWhat a comment?",
            "author": null,
            "id": "f94xhg9",
            "parent_id": "t1_f94mhk0",
            "score": 1,
            "created_utc": 1575108816.0,
            "replies": []
        },
        {
            "body": "Thank you for assuming my mental state around other men.",
            "author": "SBinSD_",
            "id": "f95m1p5",
            "parent_id": "t1_f95eia5",
            "score": 1,
            "created_utc": 1575130738.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f95melr",
                    "parent_id": "t1_f95m1p5",
                    "score": 0,
                    "created_utc": 1575130981.0,
                    "replies": [
                        {
                            "body": "I think she is being sarcastic 🙄",
                            "author": "DarlingKC",
                            "id": "f95osa9",
                            "parent_id": "t1_f95melr",
                            "score": 3,
                            "created_utc": 1575132370.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please do at least consider it if you feel capable. You could help prevent him doing this to others.",
            "author": "kalise_navidad",
            "id": "f94s0mp",
            "parent_id": "t1_f94rtw3",
            "score": 21,
            "created_utc": 1575100507.0,
            "replies": []
        },
        {
            "body": "Please do call the police. Save a ton of other women from the same experience and let him pay for what he did to you.",
            "author": "Lar5031",
            "id": "f97mz6w",
            "parent_id": "t1_f94rtw3",
            "score": 3,
            "created_utc": 1575167744.0,
            "replies": []
        },
        {
            "body": "Reporting is a brave thing to do, and public conscience would probably push you in that direction. Just be careful, in areas that are less socially aware it can be a difficult process to endure. Getting justice is definitely better for other people, but you need to be sure it's also the best thing for you. \n\nI'm available in DMs if you want to discuss.",
            "author": "msgavane",
            "id": "f95ciwg",
            "parent_id": "t1_f94rtw3",
            "score": 5,
            "created_utc": 1575124767.0,
            "replies": []
        },
        {
            "body": "You might prevent it from happening to other women by reaching out and reporting it.",
            "author": "Goozalou",
            "id": "f954gil",
            "parent_id": "t1_f94rtw3",
            "score": 5,
            "created_utc": 1575118557.0,
            "replies": []
        },
        {
            "body": "If you are uncomfortable with the act of going to the police it'd be worth it to text him and say \"You assaulted me without consent the other night, I will be taking legal action in the coming days, please do not contact me any further\". That should at the very least make him think twice before he does this to anyone else.",
            "author": "tenmillionplus",
            "id": "f9675sf",
            "parent_id": "t1_f94rtw3",
            "score": 1,
            "created_utc": 1575140770.0,
            "replies": []
        },
        {
            "body": "Do what you think is best, but I doubt the Police’ll do anything. \n\nBy your own admission it was all consensual. They will see the escalation to things that were non-consensual as a grey area unless you guys texted about or he recorded you unknowingly \n\nYou might be better off having a lawyer go after him in civil court.",
            "author": null,
            "id": "f94s13t",
            "parent_id": "t1_f94rtw3",
            "score": -22,
            "created_utc": 1575100525.0,
            "replies": [
                {
                    "body": "And while you are correct in that it would likely not go far even though it was rape, it might be good for my mental well-being to report it.",
                    "author": "SBinSD_",
                    "id": "f94s7hq",
                    "parent_id": "t1_f94s13t",
                    "score": 19,
                    "created_utc": 1575100769.0,
                    "replies": [
                        {
                            "body": "Please do what feels right for you and don't let anyone tell you how to feel about what you experienced.",
                            "author": "interrobangin_",
                            "id": "f94z9dh",
                            "parent_id": "t1_f94s7hq",
                            "score": 7,
                            "created_utc": 1575111770.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not sure if it was clear in the post, but what did happen was not consensual.",
                    "author": "SBinSD_",
                    "id": "f94s64j",
                    "parent_id": "t1_f94s13t",
                    "score": 19,
                    "created_utc": 1575100720.0,
                    "replies": [
                        {
                            "body": "\"By your own admission, it was all consensual.\"\n\nEven though you state that you asked him to stop and he didn't.\n\nWTF! I feel for the poor unfortunate souls who have encountered this Mr sugarman in any type of intimate way. This guy is all trying to mansplain what consent means, all the while fucking it up entirely. Holy hell, that was so so painful and cringe-worthy to read.",
                            "author": "kimchi_Queen",
                            "id": "f94x6vk",
                            "parent_id": "t1_f94s64j",
                            "score": 15,
                            "created_utc": 1575108330.0,
                            "replies": [
                                {
                                    "body": "I’m not trying to mansplain anything. I was just sharing my opinion on a situation in a forum where I thought I was free and encouraged to do so.",
                                    "author": null,
                                    "id": "f9ga8se",
                                    "parent_id": "t1_f94x6vk",
                                    "score": 1,
                                    "created_utc": 1575296048.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If it was rape then there’s no debating, go to the cops",
                            "author": null,
                            "id": "f94si8r",
                            "parent_id": "t1_f94s64j",
                            "score": -3,
                            "created_utc": 1575101190.0,
                            "replies": [
                                {
                                    "body": "Sexual assault includes many other actions besides just rape.",
                                    "author": "kimchi_Queen",
                                    "id": "f94x1zu",
                                    "parent_id": "t1_f94si8r",
                                    "score": 8,
                                    "created_utc": 1575108114.0,
                                    "replies": [
                                        {
                                            "body": "Of course. My point was that cops aren’t going to have the patience for it.",
                                            "author": null,
                                            "id": "f94xagc",
                                            "parent_id": "t1_f94x1zu",
                                            "score": -9,
                                            "created_utc": 1575108490.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You can revoke consent at any time during intercourse. That’s what our police department told me.",
                    "author": "theladysgotmoxie",
                    "id": "f94u7bu",
                    "parent_id": "t1_f94s13t",
                    "score": 15,
                    "created_utc": 1575103645.0,
                    "replies": [
                        {
                            "body": "Of course you can, that doesn’t mean they can convict someone with a crime. If they can’t convict, they may be unwilling to charge the accused in the first place. \n\nPolice departments weigh this type of decision all the time.",
                            "author": null,
                            "id": "f94yb84",
                            "parent_id": "t1_f94u7bu",
                            "score": -5,
                            "created_utc": 1575110178.0,
                            "replies": [
                                {
                                    "body": "Yes, unfortunately that’s what happened to me as well. I had even gone to the hospital and had a kit done the next morning and he still wasn’t charged. I found out months later when i called to find out what was going on. They cited a lack of evidence, but now he’s in the system.",
                                    "author": "theladysgotmoxie",
                                    "id": "f95bd6c",
                                    "parent_id": "t1_f94yb84",
                                    "score": 3,
                                    "created_utc": 1575123960.0,
                                    "replies": [
                                        {
                                            "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
                                            "author": null,
                                            "id": "f9g2y60",
                                            "parent_id": "t1_f95bd6c",
                                            "score": 3,
                                            "created_utc": 1575292373.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f94uvai",
                    "parent_id": "t1_f94s13t",
                    "score": 14,
                    "created_utc": 1575104663.0,
                    "replies": [
                        {
                            "body": "The way it’s written it can be interpreted differently. I read it as they had consensual sex until he peed on her, then she told him to stop.\n\nThis would mean everything that happened before the peeing was consensual, and everything after was non-consensual. The cops would then focus on the non-consensual acts\n\nIf I misread OP then my apologies",
                            "author": null,
                            "id": "f94y8gr",
                            "parent_id": "t1_f94uvai",
                            "score": -5,
                            "created_utc": 1575110053.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f976amg",
                                    "parent_id": "t1_f94y8gr",
                                    "score": 2,
                                    "created_utc": 1575160343.0,
                                    "replies": [
                                        {
                                            "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
                                            "author": null,
                                            "id": "f9g2blc",
                                            "parent_id": "t1_f976amg",
                                            "score": 1,
                                            "created_utc": 1575292002.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f9g44c1",
                                                    "parent_id": "t1_f9g2blc",
                                                    "score": 1,
                                                    "created_utc": 1575293018.0,
                                                    "replies": [
                                                        {
                                                            "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                                                            "author": null,
                                                            "id": "f9g4j89",
                                                            "parent_id": "t1_f9g44c1",
                                                            "score": 1,
                                                            "created_utc": 1575293192.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "f9g58kh",
                                                                    "parent_id": "t1_f9g4j89",
                                                                    "score": 0,
                                                                    "created_utc": 1575293543.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                                                            "author": null,
                                                                            "id": "f9g659s",
                                                                            "parent_id": "t1_f9g58kh",
                                                                            "score": 1,
                                                                            "created_utc": 1575294007.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThat is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. And once they withdraw consent, and are ignored, it's no longer consensual.",
                    "author": "interrobangin_",
                    "id": "f94z8gu",
                    "parent_id": "t1_f94s13t",
                    "score": 7,
                    "created_utc": 1575111727.0,
                    "replies": [
                        {
                            "body": ">She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThe way I read it makes it sound like they started consensually then he started doing things she didn’t consent to, then she told him to stop and didn’t. Clearly a violation of her consent  and assault.\n\nHowever, that’s very different than the police even trying to charge someone (and succeeding in a conviction)\n\n>That is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. \n\nI don’t think I said that.\n\n>And once they withdraw consent, and are ignored, it's no longer consensual.\n\nCorrect",
                            "author": null,
                            "id": "f94zv0k",
                            "parent_id": "t1_f94z8gu",
                            "score": -1,
                            "created_utc": 1575112763.0,
                            "replies": [
                                {
                                    "body": "Your suggestion that she not even report him because the police probably won't help is not helpful. Rape victims shouldn't be told to be quiet just because the odds are against them. If it will help her heal to file a report against him, that's what she should do.\n\nYour exact words were \"by your own admission, it was all consensual\". So yes, you did say that. Which is why I felt you needed consent explained.",
                                    "author": "interrobangin_",
                                    "id": "f9500k4",
                                    "parent_id": "t1_f94zv0k",
                                    "score": 7,
                                    "created_utc": 1575113018.0,
                                    "replies": [
                                        {
                                            "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
                                            "author": null,
                                            "id": "f959whz",
                                            "parent_id": "t1_f9500k4",
                                            "score": -4,
                                            "created_utc": 1575122882.0,
                                            "replies": [
                                                {
                                                    "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                                                    "author": "King_of_SDs",
                                                    "id": "f972fn3",
                                                    "parent_id": "t1_f959whz",
                                                    "score": 3,
                                                    "created_utc": 1575157707.0,
                                                    "replies": [
                                                        {
                                                            "body": "No but the police department does. Isn’t that what we’re talking about here?",
                                                            "author": null,
                                                            "id": "f9g2j7t",
                                                            "parent_id": "t1_f972fn3",
                                                            "score": 1,
                                                            "created_utc": 1575292120.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you’re better off making your own post.",
            "author": "YourExoticBabe",
            "id": "f95s5rz",
            "parent_id": "t1_f95ef48",
            "score": 5,
            "created_utc": 1575134292.0,
            "replies": []
        },
        {
            "body": "You are not making sense ... bc nothing is lost by having a discussion about sexuality and fetishes in a meet and great ..",
            "author": "shamloo77",
            "id": "f96i49o",
            "parent_id": "t1_f96gng5",
            "score": 2,
            "created_utc": 1575145443.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f94mzhf",
            "parent_id": "t1_f94mktn",
            "score": 1,
            "created_utc": 1575094072.0,
            "replies": [
                {
                    "body": "Maybe this wasn’t clear in the post, but I didn’t consent to any form of sex. He assaulted me.",
                    "author": "SBinSD_",
                    "id": "f94n4db",
                    "parent_id": "t1_f94mzhf",
                    "score": 9,
                    "created_utc": 1575094232.0,
                    "replies": [
                        {
                            "body": "The comment sucks but look at it this way, he’s an ever present example of what most SBs say they want to avoid.",
                            "author": "King_of_SDs",
                            "id": "f94pjq2",
                            "parent_id": "t1_f94n4db",
                            "score": -2,
                            "created_utc": 1575097199.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I saw the comment and immediately blocked this useless troll user. And the screen name! What a loser. I block people who comment useless shit like that because it would be such a waste of time and energy to ever read anything they write.",
            "author": "kimchi_Queen",
            "id": "f94xcwm",
            "parent_id": "t1_f94onae",
            "score": 6,
            "created_utc": 1575108601.0,
            "replies": []
        },
        {
            "body": "Understatement.",
            "author": "King_of_SDs",
            "id": "f94pmfi",
            "parent_id": "t1_f94onae",
            "score": 2,
            "created_utc": 1575097295.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f95melr",
            "parent_id": "t1_f95m1p5",
            "score": 0,
            "created_utc": 1575130981.0,
            "replies": [
                {
                    "body": "I think she is being sarcastic 🙄",
                    "author": "DarlingKC",
                    "id": "f95osa9",
                    "parent_id": "t1_f95melr",
                    "score": 3,
                    "created_utc": 1575132370.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And while you are correct in that it would likely not go far even though it was rape, it might be good for my mental well-being to report it.",
            "author": "SBinSD_",
            "id": "f94s7hq",
            "parent_id": "t1_f94s13t",
            "score": 19,
            "created_utc": 1575100769.0,
            "replies": [
                {
                    "body": "Please do what feels right for you and don't let anyone tell you how to feel about what you experienced.",
                    "author": "interrobangin_",
                    "id": "f94z9dh",
                    "parent_id": "t1_f94s7hq",
                    "score": 7,
                    "created_utc": 1575111770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not sure if it was clear in the post, but what did happen was not consensual.",
            "author": "SBinSD_",
            "id": "f94s64j",
            "parent_id": "t1_f94s13t",
            "score": 19,
            "created_utc": 1575100720.0,
            "replies": [
                {
                    "body": "\"By your own admission, it was all consensual.\"\n\nEven though you state that you asked him to stop and he didn't.\n\nWTF! I feel for the poor unfortunate souls who have encountered this Mr sugarman in any type of intimate way. This guy is all trying to mansplain what consent means, all the while fucking it up entirely. Holy hell, that was so so painful and cringe-worthy to read.",
                    "author": "kimchi_Queen",
                    "id": "f94x6vk",
                    "parent_id": "t1_f94s64j",
                    "score": 15,
                    "created_utc": 1575108330.0,
                    "replies": [
                        {
                            "body": "I’m not trying to mansplain anything. I was just sharing my opinion on a situation in a forum where I thought I was free and encouraged to do so.",
                            "author": null,
                            "id": "f9ga8se",
                            "parent_id": "t1_f94x6vk",
                            "score": 1,
                            "created_utc": 1575296048.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If it was rape then there’s no debating, go to the cops",
                    "author": null,
                    "id": "f94si8r",
                    "parent_id": "t1_f94s64j",
                    "score": -3,
                    "created_utc": 1575101190.0,
                    "replies": [
                        {
                            "body": "Sexual assault includes many other actions besides just rape.",
                            "author": "kimchi_Queen",
                            "id": "f94x1zu",
                            "parent_id": "t1_f94si8r",
                            "score": 8,
                            "created_utc": 1575108114.0,
                            "replies": [
                                {
                                    "body": "Of course. My point was that cops aren’t going to have the patience for it.",
                                    "author": null,
                                    "id": "f94xagc",
                                    "parent_id": "t1_f94x1zu",
                                    "score": -9,
                                    "created_utc": 1575108490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can revoke consent at any time during intercourse. That’s what our police department told me.",
            "author": "theladysgotmoxie",
            "id": "f94u7bu",
            "parent_id": "t1_f94s13t",
            "score": 15,
            "created_utc": 1575103645.0,
            "replies": [
                {
                    "body": "Of course you can, that doesn’t mean they can convict someone with a crime. If they can’t convict, they may be unwilling to charge the accused in the first place. \n\nPolice departments weigh this type of decision all the time.",
                    "author": null,
                    "id": "f94yb84",
                    "parent_id": "t1_f94u7bu",
                    "score": -5,
                    "created_utc": 1575110178.0,
                    "replies": [
                        {
                            "body": "Yes, unfortunately that’s what happened to me as well. I had even gone to the hospital and had a kit done the next morning and he still wasn’t charged. I found out months later when i called to find out what was going on. They cited a lack of evidence, but now he’s in the system.",
                            "author": "theladysgotmoxie",
                            "id": "f95bd6c",
                            "parent_id": "t1_f94yb84",
                            "score": 3,
                            "created_utc": 1575123960.0,
                            "replies": [
                                {
                                    "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
                                    "author": null,
                                    "id": "f9g2y60",
                                    "parent_id": "t1_f95bd6c",
                                    "score": 3,
                                    "created_utc": 1575292373.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f94uvai",
            "parent_id": "t1_f94s13t",
            "score": 14,
            "created_utc": 1575104663.0,
            "replies": [
                {
                    "body": "The way it’s written it can be interpreted differently. I read it as they had consensual sex until he peed on her, then she told him to stop.\n\nThis would mean everything that happened before the peeing was consensual, and everything after was non-consensual. The cops would then focus on the non-consensual acts\n\nIf I misread OP then my apologies",
                    "author": null,
                    "id": "f94y8gr",
                    "parent_id": "t1_f94uvai",
                    "score": -5,
                    "created_utc": 1575110053.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f976amg",
                            "parent_id": "t1_f94y8gr",
                            "score": 2,
                            "created_utc": 1575160343.0,
                            "replies": [
                                {
                                    "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
                                    "author": null,
                                    "id": "f9g2blc",
                                    "parent_id": "t1_f976amg",
                                    "score": 1,
                                    "created_utc": 1575292002.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f9g44c1",
                                            "parent_id": "t1_f9g2blc",
                                            "score": 1,
                                            "created_utc": 1575293018.0,
                                            "replies": [
                                                {
                                                    "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                                                    "author": null,
                                                    "id": "f9g4j89",
                                                    "parent_id": "t1_f9g44c1",
                                                    "score": 1,
                                                    "created_utc": 1575293192.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "f9g58kh",
                                                            "parent_id": "t1_f9g4j89",
                                                            "score": 0,
                                                            "created_utc": 1575293543.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                                                    "author": null,
                                                                    "id": "f9g659s",
                                                                    "parent_id": "t1_f9g58kh",
                                                                    "score": 1,
                                                                    "created_utc": 1575294007.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThat is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. And once they withdraw consent, and are ignored, it's no longer consensual.",
            "author": "interrobangin_",
            "id": "f94z8gu",
            "parent_id": "t1_f94s13t",
            "score": 7,
            "created_utc": 1575111727.0,
            "replies": [
                {
                    "body": ">She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThe way I read it makes it sound like they started consensually then he started doing things she didn’t consent to, then she told him to stop and didn’t. Clearly a violation of her consent  and assault.\n\nHowever, that’s very different than the police even trying to charge someone (and succeeding in a conviction)\n\n>That is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. \n\nI don’t think I said that.\n\n>And once they withdraw consent, and are ignored, it's no longer consensual.\n\nCorrect",
                    "author": null,
                    "id": "f94zv0k",
                    "parent_id": "t1_f94z8gu",
                    "score": -1,
                    "created_utc": 1575112763.0,
                    "replies": [
                        {
                            "body": "Your suggestion that she not even report him because the police probably won't help is not helpful. Rape victims shouldn't be told to be quiet just because the odds are against them. If it will help her heal to file a report against him, that's what she should do.\n\nYour exact words were \"by your own admission, it was all consensual\". So yes, you did say that. Which is why I felt you needed consent explained.",
                            "author": "interrobangin_",
                            "id": "f9500k4",
                            "parent_id": "t1_f94zv0k",
                            "score": 7,
                            "created_utc": 1575113018.0,
                            "replies": [
                                {
                                    "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
                                    "author": null,
                                    "id": "f959whz",
                                    "parent_id": "t1_f9500k4",
                                    "score": -4,
                                    "created_utc": 1575122882.0,
                                    "replies": [
                                        {
                                            "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                                            "author": "King_of_SDs",
                                            "id": "f972fn3",
                                            "parent_id": "t1_f959whz",
                                            "score": 3,
                                            "created_utc": 1575157707.0,
                                            "replies": [
                                                {
                                                    "body": "No but the police department does. Isn’t that what we’re talking about here?",
                                                    "author": null,
                                                    "id": "f9g2j7t",
                                                    "parent_id": "t1_f972fn3",
                                                    "score": 1,
                                                    "created_utc": 1575292120.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe this wasn’t clear in the post, but I didn’t consent to any form of sex. He assaulted me.",
            "author": "SBinSD_",
            "id": "f94n4db",
            "parent_id": "t1_f94mzhf",
            "score": 9,
            "created_utc": 1575094232.0,
            "replies": [
                {
                    "body": "The comment sucks but look at it this way, he’s an ever present example of what most SBs say they want to avoid.",
                    "author": "King_of_SDs",
                    "id": "f94pjq2",
                    "parent_id": "t1_f94n4db",
                    "score": -2,
                    "created_utc": 1575097199.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think she is being sarcastic 🙄",
            "author": "DarlingKC",
            "id": "f95osa9",
            "parent_id": "t1_f95melr",
            "score": 3,
            "created_utc": 1575132370.0,
            "replies": []
        },
        {
            "body": "Please do what feels right for you and don't let anyone tell you how to feel about what you experienced.",
            "author": "interrobangin_",
            "id": "f94z9dh",
            "parent_id": "t1_f94s7hq",
            "score": 7,
            "created_utc": 1575111770.0,
            "replies": []
        },
        {
            "body": "\"By your own admission, it was all consensual.\"\n\nEven though you state that you asked him to stop and he didn't.\n\nWTF! I feel for the poor unfortunate souls who have encountered this Mr sugarman in any type of intimate way. This guy is all trying to mansplain what consent means, all the while fucking it up entirely. Holy hell, that was so so painful and cringe-worthy to read.",
            "author": "kimchi_Queen",
            "id": "f94x6vk",
            "parent_id": "t1_f94s64j",
            "score": 15,
            "created_utc": 1575108330.0,
            "replies": [
                {
                    "body": "I’m not trying to mansplain anything. I was just sharing my opinion on a situation in a forum where I thought I was free and encouraged to do so.",
                    "author": null,
                    "id": "f9ga8se",
                    "parent_id": "t1_f94x6vk",
                    "score": 1,
                    "created_utc": 1575296048.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it was rape then there’s no debating, go to the cops",
            "author": null,
            "id": "f94si8r",
            "parent_id": "t1_f94s64j",
            "score": -3,
            "created_utc": 1575101190.0,
            "replies": [
                {
                    "body": "Sexual assault includes many other actions besides just rape.",
                    "author": "kimchi_Queen",
                    "id": "f94x1zu",
                    "parent_id": "t1_f94si8r",
                    "score": 8,
                    "created_utc": 1575108114.0,
                    "replies": [
                        {
                            "body": "Of course. My point was that cops aren’t going to have the patience for it.",
                            "author": null,
                            "id": "f94xagc",
                            "parent_id": "t1_f94x1zu",
                            "score": -9,
                            "created_utc": 1575108490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course you can, that doesn’t mean they can convict someone with a crime. If they can’t convict, they may be unwilling to charge the accused in the first place. \n\nPolice departments weigh this type of decision all the time.",
            "author": null,
            "id": "f94yb84",
            "parent_id": "t1_f94u7bu",
            "score": -5,
            "created_utc": 1575110178.0,
            "replies": [
                {
                    "body": "Yes, unfortunately that’s what happened to me as well. I had even gone to the hospital and had a kit done the next morning and he still wasn’t charged. I found out months later when i called to find out what was going on. They cited a lack of evidence, but now he’s in the system.",
                    "author": "theladysgotmoxie",
                    "id": "f95bd6c",
                    "parent_id": "t1_f94yb84",
                    "score": 3,
                    "created_utc": 1575123960.0,
                    "replies": [
                        {
                            "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
                            "author": null,
                            "id": "f9g2y60",
                            "parent_id": "t1_f95bd6c",
                            "score": 3,
                            "created_utc": 1575292373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The way it’s written it can be interpreted differently. I read it as they had consensual sex until he peed on her, then she told him to stop.\n\nThis would mean everything that happened before the peeing was consensual, and everything after was non-consensual. The cops would then focus on the non-consensual acts\n\nIf I misread OP then my apologies",
            "author": null,
            "id": "f94y8gr",
            "parent_id": "t1_f94uvai",
            "score": -5,
            "created_utc": 1575110053.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f976amg",
                    "parent_id": "t1_f94y8gr",
                    "score": 2,
                    "created_utc": 1575160343.0,
                    "replies": [
                        {
                            "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
                            "author": null,
                            "id": "f9g2blc",
                            "parent_id": "t1_f976amg",
                            "score": 1,
                            "created_utc": 1575292002.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f9g44c1",
                                    "parent_id": "t1_f9g2blc",
                                    "score": 1,
                                    "created_utc": 1575293018.0,
                                    "replies": [
                                        {
                                            "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                                            "author": null,
                                            "id": "f9g4j89",
                                            "parent_id": "t1_f9g44c1",
                                            "score": 1,
                                            "created_utc": 1575293192.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f9g58kh",
                                                    "parent_id": "t1_f9g4j89",
                                                    "score": 0,
                                                    "created_utc": 1575293543.0,
                                                    "replies": [
                                                        {
                                                            "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                                            "author": null,
                                                            "id": "f9g659s",
                                                            "parent_id": "t1_f9g58kh",
                                                            "score": 1,
                                                            "created_utc": 1575294007.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">She told him to stop when he started doing things that were not negotiated and are not activities anyone would assume to be standard sexual practice.\n\nThe way I read it makes it sound like they started consensually then he started doing things she didn’t consent to, then she told him to stop and didn’t. Clearly a violation of her consent  and assault.\n\nHowever, that’s very different than the police even trying to charge someone (and succeeding in a conviction)\n\n>That is not consensual. Just because someone consents to sex doesn't mean you can do literally anything therein. \n\nI don’t think I said that.\n\n>And once they withdraw consent, and are ignored, it's no longer consensual.\n\nCorrect",
            "author": null,
            "id": "f94zv0k",
            "parent_id": "t1_f94z8gu",
            "score": -1,
            "created_utc": 1575112763.0,
            "replies": [
                {
                    "body": "Your suggestion that she not even report him because the police probably won't help is not helpful. Rape victims shouldn't be told to be quiet just because the odds are against them. If it will help her heal to file a report against him, that's what she should do.\n\nYour exact words were \"by your own admission, it was all consensual\". So yes, you did say that. Which is why I felt you needed consent explained.",
                    "author": "interrobangin_",
                    "id": "f9500k4",
                    "parent_id": "t1_f94zv0k",
                    "score": 7,
                    "created_utc": 1575113018.0,
                    "replies": [
                        {
                            "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
                            "author": null,
                            "id": "f959whz",
                            "parent_id": "t1_f9500k4",
                            "score": -4,
                            "created_utc": 1575122882.0,
                            "replies": [
                                {
                                    "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                                    "author": "King_of_SDs",
                                    "id": "f972fn3",
                                    "parent_id": "t1_f959whz",
                                    "score": 3,
                                    "created_utc": 1575157707.0,
                                    "replies": [
                                        {
                                            "body": "No but the police department does. Isn’t that what we’re talking about here?",
                                            "author": null,
                                            "id": "f9g2j7t",
                                            "parent_id": "t1_f972fn3",
                                            "score": 1,
                                            "created_utc": 1575292120.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The comment sucks but look at it this way, he’s an ever present example of what most SBs say they want to avoid.",
            "author": "King_of_SDs",
            "id": "f94pjq2",
            "parent_id": "t1_f94n4db",
            "score": -2,
            "created_utc": 1575097199.0,
            "replies": []
        },
        {
            "body": "I’m not trying to mansplain anything. I was just sharing my opinion on a situation in a forum where I thought I was free and encouraged to do so.",
            "author": null,
            "id": "f9ga8se",
            "parent_id": "t1_f94x6vk",
            "score": 1,
            "created_utc": 1575296048.0,
            "replies": []
        },
        {
            "body": "Sexual assault includes many other actions besides just rape.",
            "author": "kimchi_Queen",
            "id": "f94x1zu",
            "parent_id": "t1_f94si8r",
            "score": 8,
            "created_utc": 1575108114.0,
            "replies": [
                {
                    "body": "Of course. My point was that cops aren’t going to have the patience for it.",
                    "author": null,
                    "id": "f94xagc",
                    "parent_id": "t1_f94x1zu",
                    "score": -9,
                    "created_utc": 1575108490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, unfortunately that’s what happened to me as well. I had even gone to the hospital and had a kit done the next morning and he still wasn’t charged. I found out months later when i called to find out what was going on. They cited a lack of evidence, but now he’s in the system.",
            "author": "theladysgotmoxie",
            "id": "f95bd6c",
            "parent_id": "t1_f94yb84",
            "score": 3,
            "created_utc": 1575123960.0,
            "replies": [
                {
                    "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
                    "author": null,
                    "id": "f9g2y60",
                    "parent_id": "t1_f95bd6c",
                    "score": 3,
                    "created_utc": 1575292373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f976amg",
            "parent_id": "t1_f94y8gr",
            "score": 2,
            "created_utc": 1575160343.0,
            "replies": [
                {
                    "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
                    "author": null,
                    "id": "f9g2blc",
                    "parent_id": "t1_f976amg",
                    "score": 1,
                    "created_utc": 1575292002.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9g44c1",
                            "parent_id": "t1_f9g2blc",
                            "score": 1,
                            "created_utc": 1575293018.0,
                            "replies": [
                                {
                                    "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                                    "author": null,
                                    "id": "f9g4j89",
                                    "parent_id": "t1_f9g44c1",
                                    "score": 1,
                                    "created_utc": 1575293192.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f9g58kh",
                                            "parent_id": "t1_f9g4j89",
                                            "score": 0,
                                            "created_utc": 1575293543.0,
                                            "replies": [
                                                {
                                                    "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                                    "author": null,
                                                    "id": "f9g659s",
                                                    "parent_id": "t1_f9g58kh",
                                                    "score": 1,
                                                    "created_utc": 1575294007.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your suggestion that she not even report him because the police probably won't help is not helpful. Rape victims shouldn't be told to be quiet just because the odds are against them. If it will help her heal to file a report against him, that's what she should do.\n\nYour exact words were \"by your own admission, it was all consensual\". So yes, you did say that. Which is why I felt you needed consent explained.",
            "author": "interrobangin_",
            "id": "f9500k4",
            "parent_id": "t1_f94zv0k",
            "score": 7,
            "created_utc": 1575113018.0,
            "replies": [
                {
                    "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
                    "author": null,
                    "id": "f959whz",
                    "parent_id": "t1_f9500k4",
                    "score": -4,
                    "created_utc": 1575122882.0,
                    "replies": [
                        {
                            "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                            "author": "King_of_SDs",
                            "id": "f972fn3",
                            "parent_id": "t1_f959whz",
                            "score": 3,
                            "created_utc": 1575157707.0,
                            "replies": [
                                {
                                    "body": "No but the police department does. Isn’t that what we’re talking about here?",
                                    "author": null,
                                    "id": "f9g2j7t",
                                    "parent_id": "t1_f972fn3",
                                    "score": 1,
                                    "created_utc": 1575292120.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course. My point was that cops aren’t going to have the patience for it.",
            "author": null,
            "id": "f94xagc",
            "parent_id": "t1_f94x1zu",
            "score": -9,
            "created_utc": 1575108490.0,
            "replies": []
        },
        {
            "body": "This is always what happens unless there’s more evidence than an accusation. This is why I’m pointing out that unless there was violence, physical evidence or witnesses the cops aren’t going to be helpful.\n\nIf you’re really trying to make the person suffer, file the police report (they basically ignore it) then file a civil suit. Burden of proof is lower and you can point to the fact that you tried to file a criminal complaint as well.",
            "author": null,
            "id": "f9g2y60",
            "parent_id": "t1_f95bd6c",
            "score": 3,
            "created_utc": 1575292373.0,
            "replies": []
        },
        {
            "body": "The part where she says she was eager to go out with him, had a great time, and ended up having sex. It does not say he did that by force. It says she ‘ended up bent over and spanked’ or something. Unclear if that part was enjoyable or consensual or not.\n\nIt’s clear that after she got peed on its not. To me it was unclear what OP was saying about the whole experience other than part of it was non-consensual (which implies the other parts were consensual)",
            "author": null,
            "id": "f9g2blc",
            "parent_id": "t1_f976amg",
            "score": 1,
            "created_utc": 1575292002.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9g44c1",
                    "parent_id": "t1_f9g2blc",
                    "score": 1,
                    "created_utc": 1575293018.0,
                    "replies": [
                        {
                            "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                            "author": null,
                            "id": "f9g4j89",
                            "parent_id": "t1_f9g44c1",
                            "score": 1,
                            "created_utc": 1575293192.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f9g58kh",
                                    "parent_id": "t1_f9g4j89",
                                    "score": 0,
                                    "created_utc": 1575293543.0,
                                    "replies": [
                                        {
                                            "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                            "author": null,
                                            "id": "f9g659s",
                                            "parent_id": "t1_f9g58kh",
                                            "score": 1,
                                            "created_utc": 1575294007.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not helpful to whom? Who told her to be quiet? Where does anything I wrote say any of this? \n\nMy other exact words were:\n\n“Do what you think is best...”, “file a civil suit” and “consensual at first” \n\nFiling a civil suit is easier to win and is likely to be more damaging to him (financially). The burden of proof for criminality is far higher and far more invasive on the victim. \n\nOn top of that, you can be violently raped and the cops sometimes don’t bother to test the rape kits or pursue the rapist. It’s not that assault victims shouldn’t file complaints against their attackers, it’s that the system seems so broken it often doesn’t work, even in the most extreme cases. So why not pursue the perpetrator in a way that’s going to be faster, less invasive, and possibly more successful.\n\nFinally, consent can be offered and then taken back at any time. This is why ‘at first’ matters here. The sequence of events matters a lot, even more so in a criminal investigation. Are these not the same details cops are going to ask for?",
            "author": null,
            "id": "f959whz",
            "parent_id": "t1_f9500k4",
            "score": -4,
            "created_utc": 1575122882.0,
            "replies": [
                {
                    "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
                    "author": "King_of_SDs",
                    "id": "f972fn3",
                    "parent_id": "t1_f959whz",
                    "score": 3,
                    "created_utc": 1575157707.0,
                    "replies": [
                        {
                            "body": "No but the police department does. Isn’t that what we’re talking about here?",
                            "author": null,
                            "id": "f9g2j7t",
                            "parent_id": "t1_f972fn3",
                            "score": 1,
                            "created_utc": 1575292120.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9g44c1",
            "parent_id": "t1_f9g2blc",
            "score": 1,
            "created_utc": 1575293018.0,
            "replies": [
                {
                    "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
                    "author": null,
                    "id": "f9g4j89",
                    "parent_id": "t1_f9g44c1",
                    "score": 1,
                    "created_utc": 1575293192.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9g58kh",
                            "parent_id": "t1_f9g4j89",
                            "score": 0,
                            "created_utc": 1575293543.0,
                            "replies": [
                                {
                                    "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                                    "author": null,
                                    "id": "f9g659s",
                                    "parent_id": "t1_f9g58kh",
                                    "score": 1,
                                    "created_utc": 1575294007.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you routinely split hairs on what constitutes rape? \n\nIf it’s not prosecutable, it’s party time! /s",
            "author": "King_of_SDs",
            "id": "f972fn3",
            "parent_id": "t1_f959whz",
            "score": 3,
            "created_utc": 1575157707.0,
            "replies": [
                {
                    "body": "No but the police department does. Isn’t that what we’re talking about here?",
                    "author": null,
                    "id": "f9g2j7t",
                    "parent_id": "t1_f972fn3",
                    "score": 1,
                    "created_utc": 1575292120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My point in all of these messages is that it’s unclear to me the way it’s written. That means I could have assumed what you did, or I could assume what I did. It’s still unclear to me what she meant",
            "author": null,
            "id": "f9g4j89",
            "parent_id": "t1_f9g44c1",
            "score": 1,
            "created_utc": 1575293192.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9g58kh",
                    "parent_id": "t1_f9g4j89",
                    "score": 0,
                    "created_utc": 1575293543.0,
                    "replies": [
                        {
                            "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                            "author": null,
                            "id": "f9g659s",
                            "parent_id": "t1_f9g58kh",
                            "score": 1,
                            "created_utc": 1575294007.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No but the police department does. Isn’t that what we’re talking about here?",
            "author": null,
            "id": "f9g2j7t",
            "parent_id": "t1_f972fn3",
            "score": 1,
            "created_utc": 1575292120.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9g58kh",
            "parent_id": "t1_f9g4j89",
            "score": 0,
            "created_utc": 1575293543.0,
            "replies": [
                {
                    "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
                    "author": null,
                    "id": "f9g659s",
                    "parent_id": "t1_f9g58kh",
                    "score": 1,
                    "created_utc": 1575294007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You keep selectively quoting my statements. Did I also not write “I may have misread OP, if so I apologize”?\n\nDid I also not write that ‘the way this is written is unclear’ to me?\n\nWhat about either of those statements is absolute?\n\nFinally, how you feel is how you feel. But it’s an gross assumption on your part to tell me you know my intent. I didn’t say she shouldn’t go to the police to be insensitive, I just know the police aren’t always helpful. They aren’t always helpful in ANY situation where there’s no hard evidence or witnesses. Is your argument that the police are always helpful and people should trust them blindly?\n\nI also suggested an alternative path (a civil suit) and gave my reasoning. Is your argument that a civil suit is not something a sexual assault victim should  consider? Why?\n\nIt sounds like you’re saying unless I give the same advice as you do then I’m wrong or insensitive.",
            "author": null,
            "id": "f9g659s",
            "parent_id": "t1_f9g58kh",
            "score": 1,
            "created_utc": 1575294007.0,
            "replies": []
        }
    ]
}