{
    "title": "SD wants 4hr dates to become 14hr dates and the price to stay the same.",
    "post_id": "hfxk6b",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hfxk6b/sd_wants_4hr_dates_to_become_14hr_dates_and_the/",
    "author": "ApprehensiveInsect1",
    "body": "Title says it all, SD has been insisting on overnights but refusing to entertain the idea of me having to pack a bag, make an excuse to my parents on who I’m staying the night with, getting a friend to cover me, waking up at 6AM so he wakes up to me with makeup on and have three+ rounds of sex should raise the $$$ compared to a three hour lunch date?\n\nObviously when I mention this his reply is “I don’t want it to feel transactional/like escorting.” 🙄I’m probably going to dump him completely, I’m so sick of this stupid manipulation tactic of trying to play on SB’s shame of being seen as fssw? \n\n“So you’re BETTER than an escort, right? So why don’t you, *taps forehead meme* charge 20% of what an escort charges? Because you’re BETTER than them!”\n\nAlso the bullshit of “you shouldn’t want more money because we have a REAL connection!!” By that logic, YOU shouldn’t want more sex because we have a ReAl CoNnEcTiOn. But no, it’s only me who should be content with my lot, but it’s fine for you to be the one insisting on full sexual availability, 3+ rounds of sex per date, constant texting, companionship, platonic dates completely uncompensated, etc.\n\nEdit:\nAn insightful conversation with u/azurecole has revealed a lot of reasoning behind the responses to this. I think there are a lot of generous and thoughtful SD’s who like to assume all other SD’s are as great as them. So when they see threads of SB’s complaining, the knee jerk response is to assume it’s the SB who is the one in the wrong and the SD is as angelic as them. So let me just get this out here. The guy I’m talking about is a dick. There was no “unspoken trust” or reciprocation for effort. Yes I’m very “transactional” but it’s not the half of how aggressive he was in letting me know he was in it for the sex. If I didn’t demand money I WOULDN’T GET MONEY. It is GREAT that your SR has mutual trust and is so much better than ours, but try to keep in mind that shitty SD’s exist. He wasn’t a scammer, and he wasn’t technically salt, but he was a dick. So when someone is complaining about an SD, they’re not complaining about you. If you come across an SB complaining about something you as an SD wouldn’t do, pat yourself on the back.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hfxk6b/sd_wants_4hr_dates_to_become_14hr_dates_and_the/",
    "score": 157,
    "upvote_ratio": 0.93,
    "created_utc": 1593131280.0,
    "num_comments": 104,
    "links": [
        [
            "/u/azurecole"
        ]
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0hdni",
            "parent_id": "t3_hfxk6b",
            "score": 71,
            "created_utc": 1593131750.0,
            "replies": [
                {
                    "body": "Agree with this fully.\n\nWe also dont have as much context--are you at an allowance stage?  I assume PPM stage still because platonic dates uncompensated.  How long have you been in this SR?  Sounds like its still pretty new.  I can't imagine doing an overnight with someone that early unless you really liked him.  Doesn't seem like you're there yet.\n\nSo just say you dont want to do overnights yet.  If he complains loudly, he can't respect boundaries or understand relational dynamics--and is worth dumping.",
                    "author": null,
                    "id": "fw0iiym",
                    "parent_id": "t1_fw0hdni",
                    "score": 16,
                    "created_utc": 1593132434.0,
                    "replies": [
                        {
                            "body": "Yes, it is PPM and pretty new. I was stupid and dumb the one time I did an overnight with him. By platonic dates I mean he’ll text me to schedule something, like \n“Want to go out to X museum?” \nI’ll reply yes, and then he’ll say he doesn’t have much time and sex won’t happen. The first time he asked I tried to gracefully ask what the PPM for platonic dates was and he said “no sugar = no sugar 😈”. The blatant disrespect for my time was astonishing. Thanks for your advice, I’ve already ignored several red flags with him and this was kind of the last straw.",
                            "author": "ApprehensiveInsect1",
                            "id": "fw0m43i",
                            "parent_id": "t1_fw0iiym",
                            "score": 44,
                            "created_utc": 1593134587.0,
                            "replies": [
                                {
                                    "body": "Ewwwww manipulative jerk. \n\nNO SUGAR FOR YOU! <in Seinfeld soup joke voice from last century lol>",
                                    "author": "testing1to3",
                                    "id": "fw0nkf9",
                                    "parent_id": "t1_fw0m43i",
                                    "score": 34,
                                    "created_utc": 1593135469.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fw0ppe4",
                                            "parent_id": "t1_fw0nkf9",
                                            "score": 4,
                                            "created_utc": 1593136761.0,
                                            "replies": [
                                                {
                                                    "body": "Hahaha albeit clearly too old for an SB 😳😂 <sarcasm>",
                                                    "author": "testing1to3",
                                                    "id": "fw0pt70",
                                                    "parent_id": "t1_fw0ppe4",
                                                    "score": 9,
                                                    "created_utc": 1593136822.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fw0qhl7",
                                                            "parent_id": "t1_fw0pt70",
                                                            "score": -3,
                                                            "created_utc": 1593137228.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ewwwwwwww 🤮",
                                                                    "author": "testing1to3",
                                                                    "id": "fw0qp3n",
                                                                    "parent_id": "t1_fw0qhl7",
                                                                    "score": 4,
                                                                    "created_utc": 1593137353.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Who doesn’t love 3 Doors Down though?!",
                                                                    "author": "lasswithaleash",
                                                                    "id": "fw1byg5",
                                                                    "parent_id": "t1_fw0qhl7",
                                                                    "score": 0,
                                                                    "created_utc": 1593151847.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I would have responded that my time is my sugar.",
                                    "author": "Lipstickluna97",
                                    "id": "fw2045u",
                                    "parent_id": "t1_fw0m43i",
                                    "score": 7,
                                    "created_utc": 1593173848.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yikes, that is so crude. Time to move on.\n\nNot just because of the disrespect, but it is clear you aren't attracted to your SD.",
                                    "author": "n0cturnalbaby",
                                    "id": "fw0n551",
                                    "parent_id": "t1_fw0m43i",
                                    "score": -2,
                                    "created_utc": 1593135211.0,
                                    "replies": [
                                        {
                                            "body": "And yet the opposite is true and just as crude.",
                                            "author": "otherwise-sorbet03",
                                            "id": "fw0spjs",
                                            "parent_id": "t1_fw0n551",
                                            "score": 1,
                                            "created_utc": 1593138585.0,
                                            "replies": [
                                                {
                                                    "body": "Well, although I'm not onboard with asking for more for overnights, I can empathize with why OP felt it was necessary. Her SD sounds far from ideal and she clearly treats the SR like a job. If she found someone she genuinely enjoys the company of, I doubt overnights would be an issue.",
                                                    "author": "n0cturnalbaby",
                                                    "id": "fw15ilv",
                                                    "parent_id": "t1_fw0spjs",
                                                    "score": 0,
                                                    "created_utc": 1593146940.0,
                                                    "replies": [
                                                        {
                                                            "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
                                                            "author": "AdministrativeLevel9",
                                                            "id": "fw44kp6",
                                                            "parent_id": "t1_fw15ilv",
                                                            "score": 6,
                                                            "created_utc": 1593213439.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                                                                    "author": "n0cturnalbaby",
                                                                    "id": "fw45mhj",
                                                                    "parent_id": "t1_fw44kp6",
                                                                    "score": 0,
                                                                    "created_utc": 1593214037.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
                                                            "author": "otherwise-sorbet03",
                                                            "id": "fw15r8n",
                                                            "parent_id": "t1_fw15ilv",
                                                            "score": -4,
                                                            "created_utc": 1593147112.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Agree that SRs shouldn't be treated like a job.",
                                                                    "author": "n0cturnalbaby",
                                                                    "id": "fw15twp",
                                                                    "parent_id": "t1_fw15r8n",
                                                                    "score": -1,
                                                                    "created_utc": 1593147164.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Next...... 😈",
                    "author": "ruphun",
                    "id": "fw0hhtt",
                    "parent_id": "t1_fw0hdni",
                    "score": -5,
                    "created_utc": 1593131819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0mba9",
            "parent_id": "t3_hfxk6b",
            "score": 52,
            "created_utc": 1593134709.0,
            "replies": [
                {
                    "body": "Ugh. Word. Amen. Or the word “real”",
                    "author": null,
                    "id": "fw53o1l",
                    "parent_id": "t1_fw0mba9",
                    "score": 3,
                    "created_utc": 1593236488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right. But let's not kid ourselves that this isn't transactional.",
            "author": "BigMattress269",
            "id": "fw1n57y",
            "parent_id": "t3_hfxk6b",
            "score": 12,
            "created_utc": 1593162180.0,
            "replies": []
        },
        {
            "body": "He sounds like a total salt ...  just find someone else",
            "author": "shamloo77",
            "id": "fw0l534",
            "parent_id": "t3_hfxk6b",
            "score": 28,
            "created_utc": 1593133998.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw0nb1s",
                    "parent_id": "t1_fw0l534",
                    "score": -34,
                    "created_utc": 1593135310.0,
                    "replies": [
                        {
                            "body": "Don't see it :\n\nIf they agreed on around 4 hours meets --- \nand she sounds like it has been very unpleasant ( ESCORT shaming ) and overnight would be even more unpleasant and he is not even trying to offer a little more ??? \n\n7 or 8 hours more of her time in every meet",
                            "author": "shamloo77",
                            "id": "fw0ojb0",
                            "parent_id": "t1_fw0nb1s",
                            "score": 21,
                            "created_utc": 1593136058.0,
                            "replies": []
                        },
                        {
                            "body": "He wants an extra 600 minutes over and above the agreement. Don't you think that asking for over three times the original time is a bit excessive?",
                            "author": "Mangotingthroneway",
                            "id": "fw1xy38",
                            "parent_id": "t1_fw0nb1s",
                            "score": 14,
                            "created_utc": 1593172205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw2dqoo",
            "parent_id": "t3_hfxk6b",
            "score": 7,
            "created_utc": 1593182066.0,
            "replies": [
                {
                    "body": "Absolutely!!",
                    "author": "AdministrativeLevel9",
                    "id": "fw46bsf",
                    "parent_id": "t1_fw2dqoo",
                    "score": 3,
                    "created_utc": 1593214443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, this response was predictable.    As soon as I see \"the price\" referenced, I know I'm in for some fun 🤣   Here's my two cents:\n\nI'm glad I've never had a \"the price is more for a sleepover\" SB.  In fact, I wouldn't have even known it was a thing if I didn't start reading slf.  Just not the sugar relationship vibe I'm going for, and no SB has ever asked me for this... really!\n\nBut!  I pretty quickly like to set up a dynamic of \"I do more for you than just our structured agreement (PPM)\".  Once I know I like an SB and want to keep her around, I'm covering her mani pedis, doordashing her lunch, volunteering to cover small bills she's stressing about.  If she returns in kind, delighting me in ways we never agree to, then I keep stepping it up.  Maybe it's not a surprise that an SB who knows her salon has my credit card to charge, or who knows I covered that bill for her, stays overnight without me having to ask, for PPM.  I suspect many of the guys who have SBs who do that, do the same.  I suspect many of the quid pro quo people are in super NSA SRs, whether by choice or not.\n\nI've only once had a truly NSA \"SR\".... she was fun during our dates, but we didn't speak at all between dates, I never did anything extra for her, she never did anything extra for me.  If I'd have asked her to stay overnight?  I'm 100% certain she would have asked for more PPM, and I understand why.\n\nAnyway, I think what these discussions always miss is what the rest of the SR is like.  u/ruphun's SRs are just like mine, for example, based on previous discussion. No wonder they just sleep over.  In a completely NSA minimal \"arrangement\"?  There's going to be quid pro quoing up in here.",
            "author": "Azurecole",
            "id": "fw0o9b3",
            "parent_id": "t3_hfxk6b",
            "score": 22,
            "created_utc": 1593135887.0,
            "replies": [
                {
                    "body": "Thanks a LOT for this reply, in that you understand different types of SR’s. From the responsive to this, my current SR is far from the SLF ideal. I entered this SR settling for someone less than ideal, that’s on me, so I’ve been treating it like a very NSA SR. While my soon-to-be ex SD, if I give him the benefit of the doubt, thinks our relationship is very attached and personal, though in all honesty, I think he’s an asshole trying to squeeze me for all I’m worth and disrespect my boundaries.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0r0uo",
                    "parent_id": "t1_fw0o9b3",
                    "score": 26,
                    "created_utc": 1593137552.0,
                    "replies": [
                        {
                            "body": "I think this thread would have gone much better if you'd mentioned that :)    Not shade to you -- no one ever thinks to talk about what the context is, what the arrangement dynamics are, etc.   So SDs who go above-and-beyond their SBs (and who subsequently get the same treatment back), get irritated at an SB who is quid pro auo, but don't realize that that SB is with a do-the-bare-minimum SD.  And then other SBs who have been in do-the-bare-minimum SRs rush to her defense.  I avoid NSA type SBs the moment I figure them out (usually).\n\nI do still wince when you call it a \"price\"... that's not how it feels in a good SR.  A price is an obligation I'm stuck paying; in a healthy SR, I enjoy supporting my SB.  But maybe it feels like a price in those NSA SRs",
                            "author": "Azurecole",
                            "id": "fw0s4fg",
                            "parent_id": "t1_fw0r0uo",
                            "score": 8,
                            "created_utc": 1593138226.0,
                            "replies": [
                                {
                                    "body": "I think that’s a huge problem of this forum tbh. Say you are an angelic, respectful, generous SD, just a delight for any SB to be around. And then an SB makes a post complaining and SD’s on this sub go “I’m an amazing SD, so HE must be an amazing SD! Because I’m a great person, ALL people under the same title as me must also be amazing! And she must be selfish and ungrateful and the one in the wrong!” Few people do what you have and actually acknowledge the idea that some SD’s are cheap and rude and shitty. \n\nAnd regarding calling it a “price”, talking about everything so clinically is a bit of a bad habit because the soon-to-be-ex SD was far worse. He didn’t want it to be “transactional” but would talk about sex like he was holding something over me and the only way I would get anything is if I laid it out like “this service costs this much.” SD’s on here talk about how “unspoken” their arrangements are, their SB’s know they’ll take care of them without talking. Good for them! But there was nothing unspoken in this arrangement.",
                                    "author": "ApprehensiveInsect1",
                                    "id": "fw0vgzs",
                                    "parent_id": "t1_fw0s4fg",
                                    "score": 24,
                                    "created_utc": 1593140275.0,
                                    "replies": [
                                        {
                                            "body": "I love your reply.",
                                            "author": "AdministrativeLevel9",
                                            "id": "fw458zb",
                                            "parent_id": "t1_fw0vgzs",
                                            "score": 3,
                                            "created_utc": 1593213823.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Sugar life as discussed in slf is an idealized version of what happens in the real sugar bowl.",
                                            "author": "nthcoming",
                                            "id": "fw27it0",
                                            "parent_id": "t1_fw0vgzs",
                                            "score": 5,
                                            "created_utc": 1593178640.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> And regarding calling it a “price”, talking about everything so  clinically is a bit of a bad habit because the soon-to-be-ex SD was far  worse.  \n\nYeah, I always what's the chicken and what's the egg.   Are you calling it a \"price\" because the way he treats you, that's what it feels like?  Or is your SR uber-transactional because you're a \"price\" girl, and that's how you (consciously or unconsciously) steer your SRs?   It sounds like in this case, it's the former -- you feel like his behavior was transactional and disrespectful from the beginning, but you would otherwise be open to a more classic style SR?  \n\nThere are plenty of SBs and SDs who are \"price\" types, which of course is perfectly fine!  Just not what many of us are looking for, and their standards do not apply to my SRs.",
                                            "author": "Azurecole",
                                            "id": "fw2qiu2",
                                            "parent_id": "t1_fw0vgzs",
                                            "score": -1,
                                            "created_utc": 1593188432.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "SB need to be nice even on this site. Sucks and is bull shit.",
                                    "author": "AdministrativeLevel9",
                                    "id": "fw451h0",
                                    "parent_id": "t1_fw0s4fg",
                                    "score": 2,
                                    "created_utc": 1593213704.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes. Once you know you want to keep her around. Charming. And before that, what are you like?",
                    "author": "AdministrativeLevel9",
                    "id": "fw44s4g",
                    "parent_id": "t1_fw0o9b3",
                    "score": 2,
                    "created_utc": 1593213557.0,
                    "replies": [
                        {
                            "body": "Some people try to find a negative spin or dark cloud in every description.  Once someone's gone toxic, is it really fruitful to engage?  Everyone else seemed to pick up a positive message -- if you can only find negative, maybe it's worth some self reflection.  Not trying to be rude but sheesh, I'm not playing this game.",
                            "author": "Azurecole",
                            "id": "fw45n6g",
                            "parent_id": "t1_fw44s4g",
                            "score": 1,
                            "created_utc": 1593214049.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What he said!!!! Ladies the treat this like a job will never see this type of relationship",
                    "author": "IntelligentExternal",
                    "id": "fw2mcvc",
                    "parent_id": "t1_fw0o9b3",
                    "score": 2,
                    "created_utc": 1593186441.0,
                    "replies": [
                        {
                            "body": "Exactly!  And SDs who treat their SBs transactionally, will also never see this type of relationship, and should expect to be asked to \"get paid\" for spending extra time.",
                            "author": "Azurecole",
                            "id": "fw2oowt",
                            "parent_id": "t1_fw2mcvc",
                            "score": 7,
                            "created_utc": 1593187563.0,
                            "replies": []
                        },
                        {
                            "body": "Men don't want it to 'seem\" transactional means they want the fantasy even if they know it is transactional.",
                            "author": "AdministrativeLevel9",
                            "id": "fw45t5p",
                            "parent_id": "t1_fw2mcvc",
                            "score": 4,
                            "created_utc": 1593214144.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw1naw4",
                    "parent_id": "t1_fw0o9b3",
                    "score": 0,
                    "created_utc": 1593162337.0,
                    "replies": [
                        {
                            "body": "The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened? \n\nBecause the only reason I hear against allowance is that SB's start putting less effort in but that should not be the case in SR's like yours and the above poster...",
                            "author": "Callie-jay",
                            "id": "fw1s1ge",
                            "parent_id": "t1_fw1naw4",
                            "score": 8,
                            "created_utc": 1593166995.0,
                            "replies": [
                                {
                                    "body": "Nothing is digital.  It's a transition.  It's not like yesterday we were cold and transactional and today we are warm, caring and close. \n\nMoving to allownace requires trust. Trust takes time and consistent actions. I think we are at the point where we have both demonstrated we are trustworthy through consistent actions where a move to a regular allownace is appropriate.  That's how I hope all SRs naturally evolve.",
                                    "author": "willfromvb",
                                    "id": "fw1syn3",
                                    "parent_id": "t1_fw1s1ge",
                                    "score": 1,
                                    "created_utc": 1593167888.0,
                                    "replies": [
                                        {
                                            "body": "Yeah... it's still not consistent. Rereading Azurecole's description of his SR (which is beautiful), the last thing I would pick up from that is that there is not yet enough trust.\n\nYou have to admit that PPM is incongruent with the way you are painting your SR and I'm not picking on you in particular because that inconsistency is rife here.",
                                            "author": "Callie-jay",
                                            "id": "fw1taoc",
                                            "parent_id": "t1_fw1syn3",
                                            "score": 8,
                                            "created_utc": 1593168206.0,
                                            "replies": [
                                                {
                                                    "body": "How so?  Should I have started on allownace?  Under what conditions should I transition from ppm to allowance?  \n\nI think I am just describing an SR that is currently transitioning from ppm to allownace.  This happens in almost every long term SR on allownace.  What is incongruent?",
                                                    "author": "willfromvb",
                                                    "id": "fw1thej",
                                                    "parent_id": "t1_fw1taoc",
                                                    "score": -2,
                                                    "created_utc": 1593168382.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
                                                            "author": "Callie-jay",
                                                            "id": "fw1tpc0",
                                                            "parent_id": "t1_fw1thej",
                                                            "score": 6,
                                                            "created_utc": 1593168589.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                                                                    "author": "willfromvb",
                                                                    "id": "fw1u01r",
                                                                    "parent_id": "t1_fw1tpc0",
                                                                    "score": -2,
                                                                    "created_utc": 1593168861.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> Moving to allownace requires trust.\n\nI think it's more than that.  Allowances aren't a one size fits all shoe.\n\nI've started arrangements from day 1 with a monthly allowance (divided into two parts the first month or two).",
                                            "author": "SDstartingOut",
                                            "id": "fw2qwva",
                                            "parent_id": "t1_fw1syn3",
                                            "score": 1,
                                            "created_utc": 1593188614.0,
                                            "replies": [
                                                {
                                                    "body": "It certainly is more than that and a ppm allowance  arrangement may be more appropriate than a periodic allowance arrangement for many reasons, but I would never consider a periodic allowance if I had not built trust.\n\nRespect everyone has a different view, but I would never start with a periodic allowance. There are too many rinsers and con artists to do that.  The best con artists are really good at not looking like a con artists and are not easily detected.",
                                                    "author": "willfromvb",
                                                    "id": "fw2rbhv",
                                                    "parent_id": "t1_fw2qwva",
                                                    "score": 1,
                                                    "created_utc": 1593188803.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened?\n\nI vastly prefer monthly allowances, and talk about a MA/what I can provide monthly before even talking about a PPM to kick off the first couple of dates.  \n\nHowever - I have had two (long term, both over a year) SBs that wanted to stay on PPM due to their schedules.  These weren't exactly NSA;  they were more of, FWB with a strong physical & friendship/mentoring connection.  But we were not monogamous by any means, in an open relationship.\n\nKey thing here was - there was trust.  Part of a monthly allowance is the commitment - the SB can count on a certain amount.  In this case - both of the women knew they could always count on X visits a month if they had the time.  But there was no commitment on their side to it.",
                                    "author": "SDstartingOut",
                                    "id": "fw2qo0z",
                                    "parent_id": "t1_fw1s1ge",
                                    "score": -1,
                                    "created_utc": 1593188499.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, I get that but I'm not talking about SB's that want to stay on PPM. I'm talking about SD's that repeatedly talk about how genuine their SR's are and how much mutual above and beyond giving there is but simultaneously refuse to move from PPM because of a lack of trust.",
                                            "author": "Callie-jay",
                                            "id": "fw46yax",
                                            "parent_id": "t1_fw2qo0z",
                                            "score": 2,
                                            "created_utc": 1593214802.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are you considering for an increase? If PPM now is X are you thinking 2X? 1.5X? \n\nAnd is it only for the overnights or for all dates moving forward?\n\nAlternatively, move to monthly allowance.",
            "author": "mraspencer",
            "id": "fw0laid",
            "parent_id": "t3_hfxk6b",
            "score": 8,
            "created_utc": 1593134087.0,
            "replies": []
        },
        {
            "body": "He is a user and manipulator who you should dump unless financially unable to. The time you put into this relationship could be spent making money elsewhere. And how old is this men that can have sex 3x in a row! You sound like you are done with him already. Listen to your gut!",
            "author": "AdministrativeLevel9",
            "id": "fw447gw",
            "parent_id": "t3_hfxk6b",
            "score": 3,
            "created_utc": 1593213232.0,
            "replies": []
        },
        {
            "body": "This is why I like allowance. We agree to meet 8 hours a month. He can have all 8 in one overnight or he can sparse it out however he wishes!!!",
            "author": "heretogetoutofmyhead",
            "id": "fw25jpb",
            "parent_id": "t3_hfxk6b",
            "score": 7,
            "created_utc": 1593177461.0,
            "replies": []
        },
        {
            "body": "Ask for more money, not to compensate you for the increased time but for whatever made up expenses you come up with.  If he says no, then sorry, cheap client but I can only stay the bare minimum because I now have multiple part time jobs because I'm struggling financially.\n\nSoo annoying that you have to resort to that sort of game just to get what you deserve.",
            "author": "sugarsenior2",
            "id": "fw2w1p9",
            "parent_id": "t3_hfxk6b",
            "score": 5,
            "created_utc": 1593191044.0,
            "replies": []
        },
        {
            "body": "Basic point of order: If you don't want to do it, then don't. From your description there is a fair amount of animosity here and that isn't healthy. Time to move on!",
            "author": "Intrepid_Seeker",
            "id": "fw0l561",
            "parent_id": "t3_hfxk6b",
            "score": 8,
            "created_utc": 1593133999.0,
            "replies": []
        },
        {
            "body": "You come through as an assertive person here in this post, why don’t you just be the same with this guy?",
            "author": null,
            "id": "fw0t5v9",
            "parent_id": "t3_hfxk6b",
            "score": 6,
            "created_utc": 1593138863.0,
            "replies": []
        },
        {
            "body": "TLDR: You are in a NSA FWB arrangement where he tries to get the max value for his money. You resent it as you don't seem to like how he is taking advantage of you.",
            "author": "nthcoming",
            "id": "fw2998s",
            "parent_id": "t3_hfxk6b",
            "score": 5,
            "created_utc": 1593179624.0,
            "replies": []
        },
        {
            "body": "Just block and move on...",
            "author": "tankbinding",
            "id": "fw2fpi0",
            "parent_id": "t3_hfxk6b",
            "score": 2,
            "created_utc": 1593183093.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw11tdc",
            "parent_id": "t3_hfxk6b",
            "score": 4,
            "created_utc": 1593144361.0,
            "replies": [
                {
                    "body": "Just to be clear, it's terms like price and paying I won't use -- they always represent a transactional mindset, and their SRs always reflect that.\n\nOn the other hand, I do use standard sugar terms for financial support, such as allowance and PPM (and \"financial support\").  Like it or hate it, PPM is the most rational way to start an SR, unless one enjoys getting rinsed, and I don't see any reason to back away from the term or its usefulness while trust and connection are being built.  For me, regardless of how the structured part of support goes (PPM or allowance), it's the unstructured, reciprocal awesome things we do for each other that are the real measure of the SR",
                    "author": "Azurecole",
                    "id": "fw13oob",
                    "parent_id": "t1_fw11tdc",
                    "score": 1,
                    "created_utc": 1593145654.0,
                    "replies": []
                },
                {
                    "body": "I dont think you're naive.  There are still a number of us here who think about sugar relationships the way you seem to.  I'm still fairly new to SLF, but on the whole have a number of great kindred spirits, so very much intend to stick around.",
                    "author": null,
                    "id": "fw19z73",
                    "parent_id": "t1_fw11tdc",
                    "score": -1,
                    "created_utc": 1593150245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No that's not cool.  Especially if you are doing a PPM arrangement and not actually sugar dating.  Either way he shouldn't be insisting on you doing things you don't want to do.\n\nMy SB comes over and we usually spend a few hours watching Netflix and having a few drinks before hand but that is because that is what she likes to do.  I am happy for the company but I would never try to guilt her into staying the night unless she wanted to and if I did really want her to stay over I absolutely would offer her extra.",
            "author": null,
            "id": "fw2mj3x",
            "parent_id": "t3_hfxk6b",
            "score": 2,
            "created_utc": 1593186526.0,
            "replies": []
        },
        {
            "body": "The detail about waking up at 6am to do makeup jumped out at me. What makes you feel that's necessary? Did he tell you he wants that? It's not normal. I'd be shocked if my SB were doing that. It shouldn't feel so stressful to spend time with your SD.",
            "author": "Finzi",
            "id": "fw13ntl",
            "parent_id": "t3_hfxk6b",
            "score": 1,
            "created_utc": 1593145638.0,
            "replies": [
                {
                    "body": "This ones not actually on the SD, I have facial marks that are easily covered up that I don’t like people seeing. So no it wouldn’t be a full face of makeup, but some foundation so he’d wake up to a me with clear skin. It’s still a hassle though and another thing I have to worry about that I don’t have to on shorter dates.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw16ecm",
                    "parent_id": "t1_fw13ntl",
                    "score": 11,
                    "created_utc": 1593147571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fw2bm25",
            "parent_id": "t3_hfxk6b",
            "score": 1,
            "created_utc": 1593180927.0,
            "replies": [
                {
                    "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. **Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.**\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
                    "author": "Azurecole",
                    "id": "fw2o1sy",
                    "parent_id": "t1_fw2bm25",
                    "score": 0,
                    "created_utc": 1593187255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"you are an angelic, respectful, generous SD, just a delight for any SB to be around.\"\n\nUnfortunately those are few and far between from what we hear. Most SRs have an element of transaction.(you get allowance,he gets sex). But the truly rewarding SRs are like Azure and others have. I have never had any backlash about spending the nights together,and have never compensated extra. But there has to be an element of mutual caring and enjoyment not to mention lack of stress. I don't wake my SBs up all night to get some extra nookie. We make love and go to sleep,snuggle a little but actually sleep. \n\nYou're soon to be ex is a douche sac and treats yo like a sex doll. Dump him asap. IF you keep him, lay down boundaries. Stick with the 4 hour lunch date. It's hard to say \"NO\" to these bullies but once you practice it gets easier.",
            "author": "GSSD",
            "id": "fw2i607",
            "parent_id": "t3_hfxk6b",
            "score": 1,
            "created_utc": 1593184351.0,
            "replies": []
        },
        {
            "body": "I understand that your SD is a dick. I am not denying it. I also agree that you should get what you deserve. I am not sure though that SR is where you need to be. Among many reasons it is called SR is that there is a reason why it is called a “Sugar” relationship and not dial a sex. Escort relationships are much more straightforward and not under falls pretenses.",
            "author": null,
            "id": "fw2b3gg",
            "parent_id": "t3_hfxk6b",
            "score": 0,
            "created_utc": 1593180642.0,
            "replies": []
        },
        {
            "body": "You just need to be upfront with what you are comfortable with and what you want. Personally id like the sb to be into me and want to spend time together. Theres really no rules for this it can resemble more vanilla or sgf or whatever you want.",
            "author": "dade_murphy1",
            "id": "fw0ihtd",
            "parent_id": "t3_hfxk6b",
            "score": -1,
            "created_utc": 1593132416.0,
            "replies": []
        },
        {
            "body": "If he thinks there's a connection and you don't, then he should dump you and find another one who does and is ok with overnight. If he doesn't do it for him then do it for you and dump him.",
            "author": "mtriad",
            "id": "fw1vozv",
            "parent_id": "t3_hfxk6b",
            "score": -2,
            "created_utc": 1593170361.0,
            "replies": []
        },
        {
            "body": "PPM is pay per meet. A meet can be 3 hours or 24. It all depends on the connection you have with someone and whether you enjoy their company or not. If your SD is just your personal ATM then I can see you wanting more",
            "author": "ruphun",
            "id": "fw0hmfj",
            "parent_id": "t3_hfxk6b",
            "score": -17,
            "created_utc": 1593131896.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw0iha3",
                    "parent_id": "t1_fw0hmfj",
                    "score": 31,
                    "created_utc": 1593132407.0,
                    "replies": [
                        {
                            "body": "Ha, my SB snores quite a bit but it's still cute.",
                            "author": null,
                            "id": "fw17242",
                            "parent_id": "t1_fw0iha3",
                            "score": 2,
                            "created_utc": 1593148040.0,
                            "replies": []
                        },
                        {
                            "body": "Right but when you start making a play for extra compensation for overnights then it isn’t any of the issues you mentioned at all. Because if it were those issues, then she just wouldn’t do overnights  at all regardless if more $$ is involved or not and she would just say I can’t do them.",
                            "author": "ruphun",
                            "id": "fw0k1wf",
                            "parent_id": "t1_fw0iha3",
                            "score": -10,
                            "created_utc": 1593133336.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Then shouldn’t he be helping her with an allowance of some kind for platonic meets as well if that is the case? He’s made it pretty clear he only cares about someone being his personal sex toy, if we’re going off of what OP has said about him.",
                    "author": "miuxiu",
                    "id": "fw14x23",
                    "parent_id": "t1_fw0hmfj",
                    "score": 15,
                    "created_utc": 1593146518.0,
                    "replies": []
                },
                {
                    "body": "I’d almost agree with this if the implicit terms of an overnight weren’t more sex. It’s the exact same as me saying, “occasionally I’ll ask for triple or quadruple the normal PPM for the exact same duration and experience. Please don’t argue with me about this or I’ll know you’re actually super cheap.” An insult to the SD’s intelligence yes? Completely disrespecting their time yes? \n\nAnd saying the reason I’d want more is because I only see the SD as an ATM is like me crying “you only want me for sex!!!” When an SD won’t pay me in full for a platonic meeting.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0o19k",
                    "parent_id": "t1_fw0hmfj",
                    "score": 18,
                    "created_utc": 1593135752.0,
                    "replies": [
                        {
                            "body": "As someone who was also living under her parents’ roof when she started sugaring, I can tell you that it isn’t the extra time she’s got the biggest problem with. It’s the prep work that goes into the ability to maintain her own discretion that becomes exponentially more difficult. She has to put in all this extra time and effort so his sex life is more fulfilling but she shouldn’t be compensated for that? How is that mutually beneficial?",
                            "author": "lasswithaleash",
                            "id": "fw1br3y",
                            "parent_id": "t1_fw0o19k",
                            "score": 15,
                            "created_utc": 1593151676.0,
                            "replies": []
                        },
                        {
                            "body": "I've heard that comparison before but there are a couple of issues with it. One, because as an SD I have been asked for extra help from time to time because my SB needed it that week or wanted to buy something for herself and I never looked at those requests as an opportunity for a quid pro quo, as long as we'd been seeing each other for a while and developed some level of trust. I would only feel insulted if it were a brand new relationship. But more importantly I think there's a difference between the money and the sex. The money is all about what the SB wants and needs. Its purely support from me to her. Spending time together and having sex, on the other hand, should be about both of us and what we both want. Its not something she is doing *for* me in exchange for money. By the time we are spending the night together it should be something we both want to do and the topic of more PPM for overnights has never come up.\n\nThat kind of SR doesn't rise to the level of angelic in my book but you're absolutely right that not every SR is like this. If yours is more transactional and overnights aren't something you want to do, then there's nothing wrong with asking for a higher PPM or just saying no.",
                            "author": "canavatar12",
                            "id": "fw30nhq",
                            "parent_id": "t1_fw0o19k",
                            "score": 0,
                            "created_utc": 1593193227.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Plenty of girls get more for overnights. Doesn’t mean he’s their personal ATM.",
                    "author": "pumpkinspicedcream",
                    "id": "fw0i5u0",
                    "parent_id": "t1_fw0hmfj",
                    "score": 21,
                    "created_utc": 1593132218.0,
                    "replies": [
                        {
                            "body": "Right, Plenty of girls also meet guys at their hotel or home without doing a proper meet and greet\n\nPlenty of girls juggle multiple SD back to back\n\nPlenty of girls rinse guys \n\nPlenty of girls are only in it for the money...\n\nbut it doesn’t mean any of it its the right thing to do in a sugar relationship.",
                            "author": "ruphun",
                            "id": "fw0kgn1",
                            "parent_id": "t1_fw0i5u0",
                            "score": -12,
                            "created_utc": 1593133587.0,
                            "replies": [
                                {
                                    "body": "Plenty of guys ask girls to meet at their home knowing a public space would be safer for her but rather than take their comfort into accountability selfishly ask so. \n\nPlenty of guys have multiple SBs but won’t even entertain the idea of one of theirs having a second and would dump them instead. \n\nPlenty of guys lure girls in with false promises then call them sluts and whores when they expect what was promised. \n\nPlenty of guys treat girls like their own personal pocket pussy. \n\nBut it doesn’t mean any of it is the right thing to do.",
                                    "author": "pumpkinspicedcream",
                                    "id": "fw0ltxu",
                                    "parent_id": "t1_fw0kgn1",
                                    "score": 18,
                                    "created_utc": 1593134415.0,
                                    "replies": [
                                        {
                                            "body": "Can we stick to the OP's actual situation?\n\nSBs--you can acknowledge that SDs here run the gamut from shitty/smarmy to true gentlemen who love their SBs.  \n\nSDs--we can acknowledge that SBs here run the same gamut.\n\nLet's just stay on topic.  :)",
                                            "author": null,
                                            "id": "fw1aem9",
                                            "parent_id": "t1_fw0ltxu",
                                            "score": -4,
                                            "created_utc": 1593150588.0,
                                            "replies": [
                                                {
                                                    "body": "Pretty sure in her edit she clarifies the guy is a dick straight out. Each has their shortcomings but don’t come telling me to stay on topic when I’m replying to someone that is only seeing it one way. Or are you only seeing it that way also? Because I’ve got no problem acknowledging when a girl is being a user.",
                                                    "author": "pumpkinspicedcream",
                                                    "id": "fw1arvm",
                                                    "parent_id": "t1_fw1aem9",
                                                    "score": 10,
                                                    "created_utc": 1593150878.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
                                                            "author": null,
                                                            "id": "fw1b20j",
                                                            "parent_id": "t1_fw1arvm",
                                                            "score": -4,
                                                            "created_utc": 1593151103.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                                                                    "author": "pumpkinspicedcream",
                                                                    "id": "fw1b6kb",
                                                                    "parent_id": "t1_fw1b20j",
                                                                    "score": 8,
                                                                    "created_utc": 1593151205.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fw0mrry",
                            "parent_id": "t1_fw0i5u0",
                            "score": -1,
                            "created_utc": 1593134987.0,
                            "replies": [
                                {
                                    "body": "Atreal, that's way over the line to personal.  No more personal attacks",
                                    "author": "Azurecole",
                                    "id": "fw0nf31",
                                    "parent_id": "t1_fw0mrry",
                                    "score": 5,
                                    "created_utc": 1593135379.0,
                                    "replies": [
                                        {
                                            "body": "I don’t know what was said but thank you anyhow.",
                                            "author": "pumpkinspicedcream",
                                            "id": "fw0t20k",
                                            "parent_id": "t1_fw0nf31",
                                            "score": 7,
                                            "created_utc": 1593138797.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "As opposed to her just being his personal sex toy...\n\nBy your logic, he should also be paying PPM for platonic dates.",
                    "author": "sbthrowaway0527",
                    "id": "fw0jn4a",
                    "parent_id": "t1_fw0hmfj",
                    "score": 17,
                    "created_utc": 1593133093.0,
                    "replies": []
                },
                {
                    "body": "This.",
                    "author": "dade_murphy1",
                    "id": "fw0ie93",
                    "parent_id": "t1_fw0hmfj",
                    "score": -4,
                    "created_utc": 1593132357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0y9px",
            "parent_id": "t3_hfxk6b",
            "score": -9,
            "created_utc": 1593142037.0,
            "replies": [
                {
                    "body": "Lmaoooo maybe you’re right. My perspective is I’m so shitty and “without any humanity” because I don’t like the SD. He’s shitty because he wants as much sex as he can get, to pay as little as he can pay, and uses escort shaming as his excuse. \n\nMaybe I’ll get some humanity with someone else. 🤞🏼",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0z1i4",
                    "parent_id": "t1_fw0y9px",
                    "score": 17,
                    "created_utc": 1593142530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These type of posts have come up a lot in the past few days.  What exactly would you be doing otherwise - watching beauty videos on youtube?\n\nI am not sure why SBs keep comparing themselves to escorts.  You are not talking about apples to apples.  (the topic of which is beyond the scope of this post.)\n\nIf this is so emotionally draining then **keep it moving**.  Why gripe about it to strangers on the internet?\n\nNo doubt there are a lot of SDs who try to squeeze every ounce of utility then can out of a ppm but dang find someone you like and go explore.  If you don't like them why do you continue to engage?\n\nMy SB always puts the Home & Garden station on the TV.  Sometimes we watch HGTV for a while.  Guess what I actually like watching that stupid shit with her.  \n\nA lot of you seem profoundly unhappy as SBs.  No doubt you will be the ones to down vote.",
            "author": null,
            "id": "fw0lul9",
            "parent_id": "t3_hfxk6b",
            "score": -16,
            "created_utc": 1593134427.0,
            "replies": [
                {
                    "body": "Is that really how you feel about women here? That they have nothing better to do with their lives than watch makeup videos? What the actual fuck",
                    "author": "miuxiu",
                    "id": "fw155tc",
                    "parent_id": "t1_fw0lul9",
                    "score": 20,
                    "created_utc": 1593146689.0,
                    "replies": []
                },
                {
                    "body": "One, the argument of “why complain to people on the internet” is only ever used in contexts where you don’t agree with whatever the person is complaining about. If an SD made a post complaining, say about a SB asking for a million dollars or doing something stupid, would you comment on that post “if it bothered you that much next her and stop complaining on the internet.” The reason this sub exists is because SD’s and SB’s can’t complain and discuss about sugar stuff to their acquaintances. It’s a simple concept that people like to pretend they don’t grasp when a poster complains about something they don’t like. \n\nAlso the comment about beauty videos is so insulting. “Why are you complaining? It’s not like you’ve got anything better to do!” I have a degree to study for and a job that doesn’t put up a fight paying me, starting your reply with “lmao it’s not like you’ve got anything else to do” is not it. \n\n“If you don’t like him, why do you continue to engage?” Money. “Believe it or not I actually like watching that stupid shit with her.” Yes, you’re the SD. That’s kind of how SR’s work. The SD likes the company of the SB, the SB’s enjoyment is clearly on a case by case basis. \n\nBut overall you’re right, I don’t like him and it was stupid of me to keep it going this long. Don’t enter SB’s desperate folks!",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0to35",
                    "parent_id": "t1_fw0lul9",
                    "score": 23,
                    "created_utc": 1593139173.0,
                    "replies": [
                        {
                            "body": "period",
                            "author": "_redchief_",
                            "id": "fw0z7lm",
                            "parent_id": "t1_fw0to35",
                            "score": 6,
                            "created_utc": 1593142639.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Imma be straight up, I don't really agree with the tone of your comment but I generally agree with the spirit. \n\nSBs (on here) tend to look at SRs on a very binary level. They neglect that, for most of us, we're not paying to have sex with them we're paying to date them. And just as they often complain that SDs \"don't respect their time or effort,\" so too do they disrespect the many other things a SD has to offer.\n\nAnd to that, I ask why even bother.",
                    "author": "otherwise-sorbet03",
                    "id": "fw0nd28",
                    "parent_id": "t1_fw0lul9",
                    "score": -3,
                    "created_utc": 1593135344.0,
                    "replies": [
                        {
                            "body": "I’m curious, what do you think the “spirit” of the comment was that you found constructive? What I took from his comment was the incredibly unhelpful “if you don’t like it move on and don’t complain about it!” Like somehow he stopped understanding that 90% of this sub is people complaining because they can’t complain to normal people, and he only cares when it’s something he doesn’t like. Even one of your posts is complaining about a ridiculous SB you messaged, do you think he would comment on your post “if it bothers you THAT much just move on and stop complaining on this sub!!!” \n\nI’m trying to extract the meaning of your comment. You’re saying that seeing relationships as money = sex is harmful. Fair enough, that seems to be every SD on here. But in thinking of the relationship on those terms, I’m “disrespecting what other SD’s have to offer.” I think this is a huge positive generalisation of “SD’s”. What exactly do you think MY SD has to offer? You don’t know, of course, but you’re assuming he has something. Are you assuming he acts like you? Are you assuming he does all the thoughtful, kind things you’ve done for your SB? Obviously if he was acting like you and I was acting so transactional, I’d be the one in the wrong! \n\nNow I know you see this as me “defending my actions by saying he was worse.” But the assumption in your comment that my SD has “many other things to offer” and “isn’t paying for sex, is paying for me to date him” seems to be you projecting the relationship dynamics of your own SR, a past SR or the “SLF ideal” SR onto the relationship in this post. The idea that all SD’s are generous and kind and compassionate, so all SB’s should be adoring and never pushy for money and should just know in their hearts their SD will take care of them. How idyllic.",
                            "author": "ApprehensiveInsect1",
                            "id": "fw2ij7r",
                            "parent_id": "t1_fw0nd28",
                            "score": 4,
                            "created_utc": 1593184534.0,
                            "replies": [
                                {
                                    "body": "You are awfully defensive. All of your comments make me doubt you're simply an innocent bystander in all of this. Often, on the internet, people try to minimize their culpability and maximize the responsibility of the other party. You have an excuse for every cuplable behavior you exhibit.\n\nI'm saying your nickle and diming is as much to blame as his lewdness. You bring up his not wanting to pay your PPM if there's no sex but then are mad when he won't pay more PPM for more sex. It's hypocritical and it's all antithetical to sugar dating.\n\nThere are some disgusting men who pretend to be SDs. And there are some manipulative women parading as SBs. This seems a case where they found each other.",
                                    "author": "otherwise-sorbet03",
                                    "id": "fw2mcct",
                                    "parent_id": "t1_fw2ij7r",
                                    "score": -1,
                                    "created_utc": 1593186434.0,
                                    "replies": [
                                        {
                                            "body": "I’m wondering what you mean when you say I brought up him not wanting to pay for dates with no sex. I’ve never asked for full PPM for platonic meets, I used that as a hypothetical counter to your idea that most SD’s are paying for dates rather than sex. The fact that almost no SD would have the same prices for sex and no sex combats that idea. If you were referring to me refusing to meet him platonically when he refused to pay for a platonic meet, no, I don’t meet SD’s for free. That’s not sugar dating.  \n\nThe comments about you not trusting me because this is only being told from my perspective, fair enough. But calling me “defensive” is puzzlingly redundant. You’ve  called me manipulative, “gross”, and criticised my actions and the presumed motivations behind them. You’ve insulted my character multiple times (again fair enough) but yes, I do react defensively when someone talks about me the way you have.",
                                            "author": "ApprehensiveInsect1",
                                            "id": "fw32ise",
                                            "parent_id": "t1_fw2mcct",
                                            "score": 4,
                                            "created_utc": 1593194100.0,
                                            "replies": [
                                                {
                                                    "body": "You realize I've done the same to you that you've done to your SD? So it begets the question, are you looking for honest opinions or a support group? I also don't believe I have insulted your character and I sincerely, genuinely apologize if it came off that way. I'm just saying this whole relationship is toxic and you most certainly are playing a role in that based on this post and these comments.",
                                                    "author": "otherwise-sorbet03",
                                                    "id": "fw334cb",
                                                    "parent_id": "t1_fw32ise",
                                                    "score": -2,
                                                    "created_utc": 1593194381.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The point you're missing is that you cannot make false assumptions about other peoples' SR's based on your personal experience. \n\nYou say that '*we're* not paying to have sex with them we're paying to date them' when that's clearly not the case for OP's SD. You need to realise that not everyone is like you and consider that when giving input.",
                            "author": "Callie-jay",
                            "id": "fw1t0w4",
                            "parent_id": "t1_fw0nd28",
                            "score": 4,
                            "created_utc": 1593167947.0,
                            "replies": [
                                {
                                    "body": "Or perhaps our individual biases are coloring our perceptions of these events? Isn't OP asking generalized opinions on PPM rates based on the experiences of others? Are you not making assumptions on their SR based on your personal experience? The SD hasn't said his side. Maybe he views this as being a more traditional SR which is why he's acting this way. Or maybe he's a dick. You're just assuming the latter.\n\nRegardless, I think it's pretty clear these two are not practicing a sugar relationship, but rather a dressed escort/John relationship. Nothing wrong with that but it needs to be pointed out that this isn't what sugaring should be.",
                                    "author": "otherwise-sorbet03",
                                    "id": "fw1tbb4",
                                    "parent_id": "t1_fw1t0w4",
                                    "score": -1,
                                    "created_utc": 1593168223.0,
                                    "replies": [
                                        {
                                            "body": "Erm no. I'm absolutely not making assumptions based on my personal experience, I am on an allowance not PPM and would not be with such a man. I am making 'assumptions' based on the information given, like a sensible person should. 'No honey, no money 😈' is not a text that would be sent by a man who wants a 'traditional SR'\n\nWe can agree that they are mismatched, but you should also check your bias and actually read the facts.",
                                            "author": "Callie-jay",
                                            "id": "fw1tjmp",
                                            "parent_id": "t1_fw1tbb4",
                                            "score": 5,
                                            "created_utc": 1593168441.0,
                                            "replies": [
                                                {
                                                    "body": "The blinders you have on are absurd. How is \"no honey no money\" any more or less repugnant than her \"no money no honey?\" Which is basically her argument. She wants more money for more sex. That is not a position that would be taken by a woman who wants a \"traditional SR\"\n\nBOTH are gross imo. She blames all of her bad behavior on \"well his behavior is worse.\" Stop assuming because we disagree that I'm not a sensible person. I admit my biases. You claim yours are facts. Get over yourself.\n\nNo \"facts\" were presented in this thread. The entirety of the thread is the perspective of one person in a two person relationship. Betcha his version of events is pretty different.",
                                                    "author": "otherwise-sorbet03",
                                                    "id": "fw1tw7k",
                                                    "parent_id": "t1_fw1tjmp",
                                                    "score": -5,
                                                    "created_utc": 1593168765.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0my4l",
            "parent_id": "t3_hfxk6b",
            "score": -14,
            "created_utc": 1593135095.0,
            "replies": [
                {
                    "body": "You’re right. I entered this relationship kind of desperate and that was a big mistake. I ended up settling for someone who likes me a lot more than I like him, which has only led to bad things.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0omz9",
                    "parent_id": "t1_fw0my4l",
                    "score": 7,
                    "created_utc": 1593136120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not sure what to tell you, nearly every SB I have been with was overnight all the time, I mean every time we got together and not a single one has complained one bit. It might have something to do with my (DAD) policy, don't be a dick. When SB wakes in the morning, I massage her with warm oil, we have great sex and then I make her breakfast, watch her put her makeup on and kiss her goodbye.",
            "author": null,
            "id": "fw16u5o",
            "parent_id": "t3_hfxk6b",
            "score": -4,
            "created_utc": 1593147882.0,
            "replies": []
        },
        {
            "body": "I think it works both ways.\n\nLast SB and I were together  over 18 months. Original agreement was twice a week, with one overnight. Turned out she never stayed overnight—always some reason. When virus hit we stopped temporarily....but when I couldn’t get a firm overnight commitment I’ve moved on.  \n\nShe said she didn’t like to stay overnight—that’s fine. But allowance was based on that. If we take that out, allowance needs to be adjusted. She didn’t like that idea, so I’ll find someone who does",
            "author": "TheRockateer75",
            "id": "fw1z8za",
            "parent_id": "t3_hfxk6b",
            "score": -2,
            "created_utc": 1593173202.0,
            "replies": []
        },
        {
            "body": "This group cracks me up. You're not dating him hahaha. How can you dump him. Isn't this your job? You would be quitting right? If you don't like someone find someone else?",
            "author": "davethomasv2",
            "id": "fw28f3h",
            "parent_id": "t3_hfxk6b",
            "score": -6,
            "created_utc": 1593179148.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fw2hh00",
                    "parent_id": "t1_fw28f3h",
                    "score": -2,
                    "created_utc": 1593184000.0,
                    "replies": [
                        {
                            "body": "Rule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                            "author": "Azurecole",
                            "id": "fw2o8hj",
                            "parent_id": "t1_fw2hh00",
                            "score": 2,
                            "created_utc": 1593187344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree with this fully.\n\nWe also dont have as much context--are you at an allowance stage?  I assume PPM stage still because platonic dates uncompensated.  How long have you been in this SR?  Sounds like its still pretty new.  I can't imagine doing an overnight with someone that early unless you really liked him.  Doesn't seem like you're there yet.\n\nSo just say you dont want to do overnights yet.  If he complains loudly, he can't respect boundaries or understand relational dynamics--and is worth dumping.",
            "author": null,
            "id": "fw0iiym",
            "parent_id": "t1_fw0hdni",
            "score": 16,
            "created_utc": 1593132434.0,
            "replies": [
                {
                    "body": "Yes, it is PPM and pretty new. I was stupid and dumb the one time I did an overnight with him. By platonic dates I mean he’ll text me to schedule something, like \n“Want to go out to X museum?” \nI’ll reply yes, and then he’ll say he doesn’t have much time and sex won’t happen. The first time he asked I tried to gracefully ask what the PPM for platonic dates was and he said “no sugar = no sugar 😈”. The blatant disrespect for my time was astonishing. Thanks for your advice, I’ve already ignored several red flags with him and this was kind of the last straw.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0m43i",
                    "parent_id": "t1_fw0iiym",
                    "score": 44,
                    "created_utc": 1593134587.0,
                    "replies": [
                        {
                            "body": "Ewwwww manipulative jerk. \n\nNO SUGAR FOR YOU! <in Seinfeld soup joke voice from last century lol>",
                            "author": "testing1to3",
                            "id": "fw0nkf9",
                            "parent_id": "t1_fw0m43i",
                            "score": 34,
                            "created_utc": 1593135469.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fw0ppe4",
                                    "parent_id": "t1_fw0nkf9",
                                    "score": 4,
                                    "created_utc": 1593136761.0,
                                    "replies": [
                                        {
                                            "body": "Hahaha albeit clearly too old for an SB 😳😂 <sarcasm>",
                                            "author": "testing1to3",
                                            "id": "fw0pt70",
                                            "parent_id": "t1_fw0ppe4",
                                            "score": 9,
                                            "created_utc": 1593136822.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fw0qhl7",
                                                    "parent_id": "t1_fw0pt70",
                                                    "score": -3,
                                                    "created_utc": 1593137228.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ewwwwwwww 🤮",
                                                            "author": "testing1to3",
                                                            "id": "fw0qp3n",
                                                            "parent_id": "t1_fw0qhl7",
                                                            "score": 4,
                                                            "created_utc": 1593137353.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Who doesn’t love 3 Doors Down though?!",
                                                            "author": "lasswithaleash",
                                                            "id": "fw1byg5",
                                                            "parent_id": "t1_fw0qhl7",
                                                            "score": 0,
                                                            "created_utc": 1593151847.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I would have responded that my time is my sugar.",
                            "author": "Lipstickluna97",
                            "id": "fw2045u",
                            "parent_id": "t1_fw0m43i",
                            "score": 7,
                            "created_utc": 1593173848.0,
                            "replies": []
                        },
                        {
                            "body": "Yikes, that is so crude. Time to move on.\n\nNot just because of the disrespect, but it is clear you aren't attracted to your SD.",
                            "author": "n0cturnalbaby",
                            "id": "fw0n551",
                            "parent_id": "t1_fw0m43i",
                            "score": -2,
                            "created_utc": 1593135211.0,
                            "replies": [
                                {
                                    "body": "And yet the opposite is true and just as crude.",
                                    "author": "otherwise-sorbet03",
                                    "id": "fw0spjs",
                                    "parent_id": "t1_fw0n551",
                                    "score": 1,
                                    "created_utc": 1593138585.0,
                                    "replies": [
                                        {
                                            "body": "Well, although I'm not onboard with asking for more for overnights, I can empathize with why OP felt it was necessary. Her SD sounds far from ideal and she clearly treats the SR like a job. If she found someone she genuinely enjoys the company of, I doubt overnights would be an issue.",
                                            "author": "n0cturnalbaby",
                                            "id": "fw15ilv",
                                            "parent_id": "t1_fw0spjs",
                                            "score": 0,
                                            "created_utc": 1593146940.0,
                                            "replies": [
                                                {
                                                    "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
                                                    "author": "AdministrativeLevel9",
                                                    "id": "fw44kp6",
                                                    "parent_id": "t1_fw15ilv",
                                                    "score": 6,
                                                    "created_utc": 1593213439.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                                                            "author": "n0cturnalbaby",
                                                            "id": "fw45mhj",
                                                            "parent_id": "t1_fw44kp6",
                                                            "score": 0,
                                                            "created_utc": 1593214037.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
                                                    "author": "otherwise-sorbet03",
                                                    "id": "fw15r8n",
                                                    "parent_id": "t1_fw15ilv",
                                                    "score": -4,
                                                    "created_utc": 1593147112.0,
                                                    "replies": [
                                                        {
                                                            "body": "Agree that SRs shouldn't be treated like a job.",
                                                            "author": "n0cturnalbaby",
                                                            "id": "fw15twp",
                                                            "parent_id": "t1_fw15r8n",
                                                            "score": -1,
                                                            "created_utc": 1593147164.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Next...... 😈",
            "author": "ruphun",
            "id": "fw0hhtt",
            "parent_id": "t1_fw0hdni",
            "score": -5,
            "created_utc": 1593131819.0,
            "replies": []
        },
        {
            "body": "Ugh. Word. Amen. Or the word “real”",
            "author": null,
            "id": "fw53o1l",
            "parent_id": "t1_fw0mba9",
            "score": 3,
            "created_utc": 1593236488.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0nb1s",
            "parent_id": "t1_fw0l534",
            "score": -34,
            "created_utc": 1593135310.0,
            "replies": [
                {
                    "body": "Don't see it :\n\nIf they agreed on around 4 hours meets --- \nand she sounds like it has been very unpleasant ( ESCORT shaming ) and overnight would be even more unpleasant and he is not even trying to offer a little more ??? \n\n7 or 8 hours more of her time in every meet",
                    "author": "shamloo77",
                    "id": "fw0ojb0",
                    "parent_id": "t1_fw0nb1s",
                    "score": 21,
                    "created_utc": 1593136058.0,
                    "replies": []
                },
                {
                    "body": "He wants an extra 600 minutes over and above the agreement. Don't you think that asking for over three times the original time is a bit excessive?",
                    "author": "Mangotingthroneway",
                    "id": "fw1xy38",
                    "parent_id": "t1_fw0nb1s",
                    "score": 14,
                    "created_utc": 1593172205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely!!",
            "author": "AdministrativeLevel9",
            "id": "fw46bsf",
            "parent_id": "t1_fw2dqoo",
            "score": 3,
            "created_utc": 1593214443.0,
            "replies": []
        },
        {
            "body": "Thanks a LOT for this reply, in that you understand different types of SR’s. From the responsive to this, my current SR is far from the SLF ideal. I entered this SR settling for someone less than ideal, that’s on me, so I’ve been treating it like a very NSA SR. While my soon-to-be ex SD, if I give him the benefit of the doubt, thinks our relationship is very attached and personal, though in all honesty, I think he’s an asshole trying to squeeze me for all I’m worth and disrespect my boundaries.",
            "author": "ApprehensiveInsect1",
            "id": "fw0r0uo",
            "parent_id": "t1_fw0o9b3",
            "score": 26,
            "created_utc": 1593137552.0,
            "replies": [
                {
                    "body": "I think this thread would have gone much better if you'd mentioned that :)    Not shade to you -- no one ever thinks to talk about what the context is, what the arrangement dynamics are, etc.   So SDs who go above-and-beyond their SBs (and who subsequently get the same treatment back), get irritated at an SB who is quid pro auo, but don't realize that that SB is with a do-the-bare-minimum SD.  And then other SBs who have been in do-the-bare-minimum SRs rush to her defense.  I avoid NSA type SBs the moment I figure them out (usually).\n\nI do still wince when you call it a \"price\"... that's not how it feels in a good SR.  A price is an obligation I'm stuck paying; in a healthy SR, I enjoy supporting my SB.  But maybe it feels like a price in those NSA SRs",
                    "author": "Azurecole",
                    "id": "fw0s4fg",
                    "parent_id": "t1_fw0r0uo",
                    "score": 8,
                    "created_utc": 1593138226.0,
                    "replies": [
                        {
                            "body": "I think that’s a huge problem of this forum tbh. Say you are an angelic, respectful, generous SD, just a delight for any SB to be around. And then an SB makes a post complaining and SD’s on this sub go “I’m an amazing SD, so HE must be an amazing SD! Because I’m a great person, ALL people under the same title as me must also be amazing! And she must be selfish and ungrateful and the one in the wrong!” Few people do what you have and actually acknowledge the idea that some SD’s are cheap and rude and shitty. \n\nAnd regarding calling it a “price”, talking about everything so clinically is a bit of a bad habit because the soon-to-be-ex SD was far worse. He didn’t want it to be “transactional” but would talk about sex like he was holding something over me and the only way I would get anything is if I laid it out like “this service costs this much.” SD’s on here talk about how “unspoken” their arrangements are, their SB’s know they’ll take care of them without talking. Good for them! But there was nothing unspoken in this arrangement.",
                            "author": "ApprehensiveInsect1",
                            "id": "fw0vgzs",
                            "parent_id": "t1_fw0s4fg",
                            "score": 24,
                            "created_utc": 1593140275.0,
                            "replies": [
                                {
                                    "body": "I love your reply.",
                                    "author": "AdministrativeLevel9",
                                    "id": "fw458zb",
                                    "parent_id": "t1_fw0vgzs",
                                    "score": 3,
                                    "created_utc": 1593213823.0,
                                    "replies": []
                                },
                                {
                                    "body": "Sugar life as discussed in slf is an idealized version of what happens in the real sugar bowl.",
                                    "author": "nthcoming",
                                    "id": "fw27it0",
                                    "parent_id": "t1_fw0vgzs",
                                    "score": 5,
                                    "created_utc": 1593178640.0,
                                    "replies": []
                                },
                                {
                                    "body": "> And regarding calling it a “price”, talking about everything so  clinically is a bit of a bad habit because the soon-to-be-ex SD was far  worse.  \n\nYeah, I always what's the chicken and what's the egg.   Are you calling it a \"price\" because the way he treats you, that's what it feels like?  Or is your SR uber-transactional because you're a \"price\" girl, and that's how you (consciously or unconsciously) steer your SRs?   It sounds like in this case, it's the former -- you feel like his behavior was transactional and disrespectful from the beginning, but you would otherwise be open to a more classic style SR?  \n\nThere are plenty of SBs and SDs who are \"price\" types, which of course is perfectly fine!  Just not what many of us are looking for, and their standards do not apply to my SRs.",
                                    "author": "Azurecole",
                                    "id": "fw2qiu2",
                                    "parent_id": "t1_fw0vgzs",
                                    "score": -1,
                                    "created_utc": 1593188432.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "SB need to be nice even on this site. Sucks and is bull shit.",
                            "author": "AdministrativeLevel9",
                            "id": "fw451h0",
                            "parent_id": "t1_fw0s4fg",
                            "score": 2,
                            "created_utc": 1593213704.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. Once you know you want to keep her around. Charming. And before that, what are you like?",
            "author": "AdministrativeLevel9",
            "id": "fw44s4g",
            "parent_id": "t1_fw0o9b3",
            "score": 2,
            "created_utc": 1593213557.0,
            "replies": [
                {
                    "body": "Some people try to find a negative spin or dark cloud in every description.  Once someone's gone toxic, is it really fruitful to engage?  Everyone else seemed to pick up a positive message -- if you can only find negative, maybe it's worth some self reflection.  Not trying to be rude but sheesh, I'm not playing this game.",
                    "author": "Azurecole",
                    "id": "fw45n6g",
                    "parent_id": "t1_fw44s4g",
                    "score": 1,
                    "created_utc": 1593214049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What he said!!!! Ladies the treat this like a job will never see this type of relationship",
            "author": "IntelligentExternal",
            "id": "fw2mcvc",
            "parent_id": "t1_fw0o9b3",
            "score": 2,
            "created_utc": 1593186441.0,
            "replies": [
                {
                    "body": "Exactly!  And SDs who treat their SBs transactionally, will also never see this type of relationship, and should expect to be asked to \"get paid\" for spending extra time.",
                    "author": "Azurecole",
                    "id": "fw2oowt",
                    "parent_id": "t1_fw2mcvc",
                    "score": 7,
                    "created_utc": 1593187563.0,
                    "replies": []
                },
                {
                    "body": "Men don't want it to 'seem\" transactional means they want the fantasy even if they know it is transactional.",
                    "author": "AdministrativeLevel9",
                    "id": "fw45t5p",
                    "parent_id": "t1_fw2mcvc",
                    "score": 4,
                    "created_utc": 1593214144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw1naw4",
            "parent_id": "t1_fw0o9b3",
            "score": 0,
            "created_utc": 1593162337.0,
            "replies": [
                {
                    "body": "The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened? \n\nBecause the only reason I hear against allowance is that SB's start putting less effort in but that should not be the case in SR's like yours and the above poster...",
                    "author": "Callie-jay",
                    "id": "fw1s1ge",
                    "parent_id": "t1_fw1naw4",
                    "score": 8,
                    "created_utc": 1593166995.0,
                    "replies": [
                        {
                            "body": "Nothing is digital.  It's a transition.  It's not like yesterday we were cold and transactional and today we are warm, caring and close. \n\nMoving to allownace requires trust. Trust takes time and consistent actions. I think we are at the point where we have both demonstrated we are trustworthy through consistent actions where a move to a regular allownace is appropriate.  That's how I hope all SRs naturally evolve.",
                            "author": "willfromvb",
                            "id": "fw1syn3",
                            "parent_id": "t1_fw1s1ge",
                            "score": 1,
                            "created_utc": 1593167888.0,
                            "replies": [
                                {
                                    "body": "Yeah... it's still not consistent. Rereading Azurecole's description of his SR (which is beautiful), the last thing I would pick up from that is that there is not yet enough trust.\n\nYou have to admit that PPM is incongruent with the way you are painting your SR and I'm not picking on you in particular because that inconsistency is rife here.",
                                    "author": "Callie-jay",
                                    "id": "fw1taoc",
                                    "parent_id": "t1_fw1syn3",
                                    "score": 8,
                                    "created_utc": 1593168206.0,
                                    "replies": [
                                        {
                                            "body": "How so?  Should I have started on allownace?  Under what conditions should I transition from ppm to allowance?  \n\nI think I am just describing an SR that is currently transitioning from ppm to allownace.  This happens in almost every long term SR on allownace.  What is incongruent?",
                                            "author": "willfromvb",
                                            "id": "fw1thej",
                                            "parent_id": "t1_fw1taoc",
                                            "score": -2,
                                            "created_utc": 1593168382.0,
                                            "replies": [
                                                {
                                                    "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
                                                    "author": "Callie-jay",
                                                    "id": "fw1tpc0",
                                                    "parent_id": "t1_fw1thej",
                                                    "score": 6,
                                                    "created_utc": 1593168589.0,
                                                    "replies": [
                                                        {
                                                            "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                                                            "author": "willfromvb",
                                                            "id": "fw1u01r",
                                                            "parent_id": "t1_fw1tpc0",
                                                            "score": -2,
                                                            "created_utc": 1593168861.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> Moving to allownace requires trust.\n\nI think it's more than that.  Allowances aren't a one size fits all shoe.\n\nI've started arrangements from day 1 with a monthly allowance (divided into two parts the first month or two).",
                                    "author": "SDstartingOut",
                                    "id": "fw2qwva",
                                    "parent_id": "t1_fw1syn3",
                                    "score": 1,
                                    "created_utc": 1593188614.0,
                                    "replies": [
                                        {
                                            "body": "It certainly is more than that and a ppm allowance  arrangement may be more appropriate than a periodic allowance arrangement for many reasons, but I would never consider a periodic allowance if I had not built trust.\n\nRespect everyone has a different view, but I would never start with a periodic allowance. There are too many rinsers and con artists to do that.  The best con artists are really good at not looking like a con artists and are not easily detected.",
                                            "author": "willfromvb",
                                            "id": "fw2rbhv",
                                            "parent_id": "t1_fw2qwva",
                                            "score": 1,
                                            "created_utc": 1593188803.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened?\n\nI vastly prefer monthly allowances, and talk about a MA/what I can provide monthly before even talking about a PPM to kick off the first couple of dates.  \n\nHowever - I have had two (long term, both over a year) SBs that wanted to stay on PPM due to their schedules.  These weren't exactly NSA;  they were more of, FWB with a strong physical & friendship/mentoring connection.  But we were not monogamous by any means, in an open relationship.\n\nKey thing here was - there was trust.  Part of a monthly allowance is the commitment - the SB can count on a certain amount.  In this case - both of the women knew they could always count on X visits a month if they had the time.  But there was no commitment on their side to it.",
                            "author": "SDstartingOut",
                            "id": "fw2qo0z",
                            "parent_id": "t1_fw1s1ge",
                            "score": -1,
                            "created_utc": 1593188499.0,
                            "replies": [
                                {
                                    "body": "Yeah, I get that but I'm not talking about SB's that want to stay on PPM. I'm talking about SD's that repeatedly talk about how genuine their SR's are and how much mutual above and beyond giving there is but simultaneously refuse to move from PPM because of a lack of trust.",
                                    "author": "Callie-jay",
                                    "id": "fw46yax",
                                    "parent_id": "t1_fw2qo0z",
                                    "score": 2,
                                    "created_utc": 1593214802.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just to be clear, it's terms like price and paying I won't use -- they always represent a transactional mindset, and their SRs always reflect that.\n\nOn the other hand, I do use standard sugar terms for financial support, such as allowance and PPM (and \"financial support\").  Like it or hate it, PPM is the most rational way to start an SR, unless one enjoys getting rinsed, and I don't see any reason to back away from the term or its usefulness while trust and connection are being built.  For me, regardless of how the structured part of support goes (PPM or allowance), it's the unstructured, reciprocal awesome things we do for each other that are the real measure of the SR",
            "author": "Azurecole",
            "id": "fw13oob",
            "parent_id": "t1_fw11tdc",
            "score": 1,
            "created_utc": 1593145654.0,
            "replies": []
        },
        {
            "body": "I dont think you're naive.  There are still a number of us here who think about sugar relationships the way you seem to.  I'm still fairly new to SLF, but on the whole have a number of great kindred spirits, so very much intend to stick around.",
            "author": null,
            "id": "fw19z73",
            "parent_id": "t1_fw11tdc",
            "score": -1,
            "created_utc": 1593150245.0,
            "replies": []
        },
        {
            "body": "This ones not actually on the SD, I have facial marks that are easily covered up that I don’t like people seeing. So no it wouldn’t be a full face of makeup, but some foundation so he’d wake up to a me with clear skin. It’s still a hassle though and another thing I have to worry about that I don’t have to on shorter dates.",
            "author": "ApprehensiveInsect1",
            "id": "fw16ecm",
            "parent_id": "t1_fw13ntl",
            "score": 11,
            "created_utc": 1593147571.0,
            "replies": []
        },
        {
            "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. **Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.**\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
            "author": "Azurecole",
            "id": "fw2o1sy",
            "parent_id": "t1_fw2bm25",
            "score": 0,
            "created_utc": 1593187255.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0iha3",
            "parent_id": "t1_fw0hmfj",
            "score": 31,
            "created_utc": 1593132407.0,
            "replies": [
                {
                    "body": "Ha, my SB snores quite a bit but it's still cute.",
                    "author": null,
                    "id": "fw17242",
                    "parent_id": "t1_fw0iha3",
                    "score": 2,
                    "created_utc": 1593148040.0,
                    "replies": []
                },
                {
                    "body": "Right but when you start making a play for extra compensation for overnights then it isn’t any of the issues you mentioned at all. Because if it were those issues, then she just wouldn’t do overnights  at all regardless if more $$ is involved or not and she would just say I can’t do them.",
                    "author": "ruphun",
                    "id": "fw0k1wf",
                    "parent_id": "t1_fw0iha3",
                    "score": -10,
                    "created_utc": 1593133336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then shouldn’t he be helping her with an allowance of some kind for platonic meets as well if that is the case? He’s made it pretty clear he only cares about someone being his personal sex toy, if we’re going off of what OP has said about him.",
            "author": "miuxiu",
            "id": "fw14x23",
            "parent_id": "t1_fw0hmfj",
            "score": 15,
            "created_utc": 1593146518.0,
            "replies": []
        },
        {
            "body": "I’d almost agree with this if the implicit terms of an overnight weren’t more sex. It’s the exact same as me saying, “occasionally I’ll ask for triple or quadruple the normal PPM for the exact same duration and experience. Please don’t argue with me about this or I’ll know you’re actually super cheap.” An insult to the SD’s intelligence yes? Completely disrespecting their time yes? \n\nAnd saying the reason I’d want more is because I only see the SD as an ATM is like me crying “you only want me for sex!!!” When an SD won’t pay me in full for a platonic meeting.",
            "author": "ApprehensiveInsect1",
            "id": "fw0o19k",
            "parent_id": "t1_fw0hmfj",
            "score": 18,
            "created_utc": 1593135752.0,
            "replies": [
                {
                    "body": "As someone who was also living under her parents’ roof when she started sugaring, I can tell you that it isn’t the extra time she’s got the biggest problem with. It’s the prep work that goes into the ability to maintain her own discretion that becomes exponentially more difficult. She has to put in all this extra time and effort so his sex life is more fulfilling but she shouldn’t be compensated for that? How is that mutually beneficial?",
                    "author": "lasswithaleash",
                    "id": "fw1br3y",
                    "parent_id": "t1_fw0o19k",
                    "score": 15,
                    "created_utc": 1593151676.0,
                    "replies": []
                },
                {
                    "body": "I've heard that comparison before but there are a couple of issues with it. One, because as an SD I have been asked for extra help from time to time because my SB needed it that week or wanted to buy something for herself and I never looked at those requests as an opportunity for a quid pro quo, as long as we'd been seeing each other for a while and developed some level of trust. I would only feel insulted if it were a brand new relationship. But more importantly I think there's a difference between the money and the sex. The money is all about what the SB wants and needs. Its purely support from me to her. Spending time together and having sex, on the other hand, should be about both of us and what we both want. Its not something she is doing *for* me in exchange for money. By the time we are spending the night together it should be something we both want to do and the topic of more PPM for overnights has never come up.\n\nThat kind of SR doesn't rise to the level of angelic in my book but you're absolutely right that not every SR is like this. If yours is more transactional and overnights aren't something you want to do, then there's nothing wrong with asking for a higher PPM or just saying no.",
                    "author": "canavatar12",
                    "id": "fw30nhq",
                    "parent_id": "t1_fw0o19k",
                    "score": 0,
                    "created_utc": 1593193227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Plenty of girls get more for overnights. Doesn’t mean he’s their personal ATM.",
            "author": "pumpkinspicedcream",
            "id": "fw0i5u0",
            "parent_id": "t1_fw0hmfj",
            "score": 21,
            "created_utc": 1593132218.0,
            "replies": [
                {
                    "body": "Right, Plenty of girls also meet guys at their hotel or home without doing a proper meet and greet\n\nPlenty of girls juggle multiple SD back to back\n\nPlenty of girls rinse guys \n\nPlenty of girls are only in it for the money...\n\nbut it doesn’t mean any of it its the right thing to do in a sugar relationship.",
                    "author": "ruphun",
                    "id": "fw0kgn1",
                    "parent_id": "t1_fw0i5u0",
                    "score": -12,
                    "created_utc": 1593133587.0,
                    "replies": [
                        {
                            "body": "Plenty of guys ask girls to meet at their home knowing a public space would be safer for her but rather than take their comfort into accountability selfishly ask so. \n\nPlenty of guys have multiple SBs but won’t even entertain the idea of one of theirs having a second and would dump them instead. \n\nPlenty of guys lure girls in with false promises then call them sluts and whores when they expect what was promised. \n\nPlenty of guys treat girls like their own personal pocket pussy. \n\nBut it doesn’t mean any of it is the right thing to do.",
                            "author": "pumpkinspicedcream",
                            "id": "fw0ltxu",
                            "parent_id": "t1_fw0kgn1",
                            "score": 18,
                            "created_utc": 1593134415.0,
                            "replies": [
                                {
                                    "body": "Can we stick to the OP's actual situation?\n\nSBs--you can acknowledge that SDs here run the gamut from shitty/smarmy to true gentlemen who love their SBs.  \n\nSDs--we can acknowledge that SBs here run the same gamut.\n\nLet's just stay on topic.  :)",
                                    "author": null,
                                    "id": "fw1aem9",
                                    "parent_id": "t1_fw0ltxu",
                                    "score": -4,
                                    "created_utc": 1593150588.0,
                                    "replies": [
                                        {
                                            "body": "Pretty sure in her edit she clarifies the guy is a dick straight out. Each has their shortcomings but don’t come telling me to stay on topic when I’m replying to someone that is only seeing it one way. Or are you only seeing it that way also? Because I’ve got no problem acknowledging when a girl is being a user.",
                                            "author": "pumpkinspicedcream",
                                            "id": "fw1arvm",
                                            "parent_id": "t1_fw1aem9",
                                            "score": 10,
                                            "created_utc": 1593150878.0,
                                            "replies": [
                                                {
                                                    "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
                                                    "author": null,
                                                    "id": "fw1b20j",
                                                    "parent_id": "t1_fw1arvm",
                                                    "score": -4,
                                                    "created_utc": 1593151103.0,
                                                    "replies": [
                                                        {
                                                            "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                                                            "author": "pumpkinspicedcream",
                                                            "id": "fw1b6kb",
                                                            "parent_id": "t1_fw1b20j",
                                                            "score": 8,
                                                            "created_utc": 1593151205.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fw0mrry",
                    "parent_id": "t1_fw0i5u0",
                    "score": -1,
                    "created_utc": 1593134987.0,
                    "replies": [
                        {
                            "body": "Atreal, that's way over the line to personal.  No more personal attacks",
                            "author": "Azurecole",
                            "id": "fw0nf31",
                            "parent_id": "t1_fw0mrry",
                            "score": 5,
                            "created_utc": 1593135379.0,
                            "replies": [
                                {
                                    "body": "I don’t know what was said but thank you anyhow.",
                                    "author": "pumpkinspicedcream",
                                    "id": "fw0t20k",
                                    "parent_id": "t1_fw0nf31",
                                    "score": 7,
                                    "created_utc": 1593138797.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As opposed to her just being his personal sex toy...\n\nBy your logic, he should also be paying PPM for platonic dates.",
            "author": "sbthrowaway0527",
            "id": "fw0jn4a",
            "parent_id": "t1_fw0hmfj",
            "score": 17,
            "created_utc": 1593133093.0,
            "replies": []
        },
        {
            "body": "This.",
            "author": "dade_murphy1",
            "id": "fw0ie93",
            "parent_id": "t1_fw0hmfj",
            "score": -4,
            "created_utc": 1593132357.0,
            "replies": []
        },
        {
            "body": "Lmaoooo maybe you’re right. My perspective is I’m so shitty and “without any humanity” because I don’t like the SD. He’s shitty because he wants as much sex as he can get, to pay as little as he can pay, and uses escort shaming as his excuse. \n\nMaybe I’ll get some humanity with someone else. 🤞🏼",
            "author": "ApprehensiveInsect1",
            "id": "fw0z1i4",
            "parent_id": "t1_fw0y9px",
            "score": 17,
            "created_utc": 1593142530.0,
            "replies": []
        },
        {
            "body": "Is that really how you feel about women here? That they have nothing better to do with their lives than watch makeup videos? What the actual fuck",
            "author": "miuxiu",
            "id": "fw155tc",
            "parent_id": "t1_fw0lul9",
            "score": 20,
            "created_utc": 1593146689.0,
            "replies": []
        },
        {
            "body": "One, the argument of “why complain to people on the internet” is only ever used in contexts where you don’t agree with whatever the person is complaining about. If an SD made a post complaining, say about a SB asking for a million dollars or doing something stupid, would you comment on that post “if it bothered you that much next her and stop complaining on the internet.” The reason this sub exists is because SD’s and SB’s can’t complain and discuss about sugar stuff to their acquaintances. It’s a simple concept that people like to pretend they don’t grasp when a poster complains about something they don’t like. \n\nAlso the comment about beauty videos is so insulting. “Why are you complaining? It’s not like you’ve got anything better to do!” I have a degree to study for and a job that doesn’t put up a fight paying me, starting your reply with “lmao it’s not like you’ve got anything else to do” is not it. \n\n“If you don’t like him, why do you continue to engage?” Money. “Believe it or not I actually like watching that stupid shit with her.” Yes, you’re the SD. That’s kind of how SR’s work. The SD likes the company of the SB, the SB’s enjoyment is clearly on a case by case basis. \n\nBut overall you’re right, I don’t like him and it was stupid of me to keep it going this long. Don’t enter SB’s desperate folks!",
            "author": "ApprehensiveInsect1",
            "id": "fw0to35",
            "parent_id": "t1_fw0lul9",
            "score": 23,
            "created_utc": 1593139173.0,
            "replies": [
                {
                    "body": "period",
                    "author": "_redchief_",
                    "id": "fw0z7lm",
                    "parent_id": "t1_fw0to35",
                    "score": 6,
                    "created_utc": 1593142639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Imma be straight up, I don't really agree with the tone of your comment but I generally agree with the spirit. \n\nSBs (on here) tend to look at SRs on a very binary level. They neglect that, for most of us, we're not paying to have sex with them we're paying to date them. And just as they often complain that SDs \"don't respect their time or effort,\" so too do they disrespect the many other things a SD has to offer.\n\nAnd to that, I ask why even bother.",
            "author": "otherwise-sorbet03",
            "id": "fw0nd28",
            "parent_id": "t1_fw0lul9",
            "score": -3,
            "created_utc": 1593135344.0,
            "replies": [
                {
                    "body": "I’m curious, what do you think the “spirit” of the comment was that you found constructive? What I took from his comment was the incredibly unhelpful “if you don’t like it move on and don’t complain about it!” Like somehow he stopped understanding that 90% of this sub is people complaining because they can’t complain to normal people, and he only cares when it’s something he doesn’t like. Even one of your posts is complaining about a ridiculous SB you messaged, do you think he would comment on your post “if it bothers you THAT much just move on and stop complaining on this sub!!!” \n\nI’m trying to extract the meaning of your comment. You’re saying that seeing relationships as money = sex is harmful. Fair enough, that seems to be every SD on here. But in thinking of the relationship on those terms, I’m “disrespecting what other SD’s have to offer.” I think this is a huge positive generalisation of “SD’s”. What exactly do you think MY SD has to offer? You don’t know, of course, but you’re assuming he has something. Are you assuming he acts like you? Are you assuming he does all the thoughtful, kind things you’ve done for your SB? Obviously if he was acting like you and I was acting so transactional, I’d be the one in the wrong! \n\nNow I know you see this as me “defending my actions by saying he was worse.” But the assumption in your comment that my SD has “many other things to offer” and “isn’t paying for sex, is paying for me to date him” seems to be you projecting the relationship dynamics of your own SR, a past SR or the “SLF ideal” SR onto the relationship in this post. The idea that all SD’s are generous and kind and compassionate, so all SB’s should be adoring and never pushy for money and should just know in their hearts their SD will take care of them. How idyllic.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw2ij7r",
                    "parent_id": "t1_fw0nd28",
                    "score": 4,
                    "created_utc": 1593184534.0,
                    "replies": [
                        {
                            "body": "You are awfully defensive. All of your comments make me doubt you're simply an innocent bystander in all of this. Often, on the internet, people try to minimize their culpability and maximize the responsibility of the other party. You have an excuse for every cuplable behavior you exhibit.\n\nI'm saying your nickle and diming is as much to blame as his lewdness. You bring up his not wanting to pay your PPM if there's no sex but then are mad when he won't pay more PPM for more sex. It's hypocritical and it's all antithetical to sugar dating.\n\nThere are some disgusting men who pretend to be SDs. And there are some manipulative women parading as SBs. This seems a case where they found each other.",
                            "author": "otherwise-sorbet03",
                            "id": "fw2mcct",
                            "parent_id": "t1_fw2ij7r",
                            "score": -1,
                            "created_utc": 1593186434.0,
                            "replies": [
                                {
                                    "body": "I’m wondering what you mean when you say I brought up him not wanting to pay for dates with no sex. I’ve never asked for full PPM for platonic meets, I used that as a hypothetical counter to your idea that most SD’s are paying for dates rather than sex. The fact that almost no SD would have the same prices for sex and no sex combats that idea. If you were referring to me refusing to meet him platonically when he refused to pay for a platonic meet, no, I don’t meet SD’s for free. That’s not sugar dating.  \n\nThe comments about you not trusting me because this is only being told from my perspective, fair enough. But calling me “defensive” is puzzlingly redundant. You’ve  called me manipulative, “gross”, and criticised my actions and the presumed motivations behind them. You’ve insulted my character multiple times (again fair enough) but yes, I do react defensively when someone talks about me the way you have.",
                                    "author": "ApprehensiveInsect1",
                                    "id": "fw32ise",
                                    "parent_id": "t1_fw2mcct",
                                    "score": 4,
                                    "created_utc": 1593194100.0,
                                    "replies": [
                                        {
                                            "body": "You realize I've done the same to you that you've done to your SD? So it begets the question, are you looking for honest opinions or a support group? I also don't believe I have insulted your character and I sincerely, genuinely apologize if it came off that way. I'm just saying this whole relationship is toxic and you most certainly are playing a role in that based on this post and these comments.",
                                            "author": "otherwise-sorbet03",
                                            "id": "fw334cb",
                                            "parent_id": "t1_fw32ise",
                                            "score": -2,
                                            "created_utc": 1593194381.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The point you're missing is that you cannot make false assumptions about other peoples' SR's based on your personal experience. \n\nYou say that '*we're* not paying to have sex with them we're paying to date them' when that's clearly not the case for OP's SD. You need to realise that not everyone is like you and consider that when giving input.",
                    "author": "Callie-jay",
                    "id": "fw1t0w4",
                    "parent_id": "t1_fw0nd28",
                    "score": 4,
                    "created_utc": 1593167947.0,
                    "replies": [
                        {
                            "body": "Or perhaps our individual biases are coloring our perceptions of these events? Isn't OP asking generalized opinions on PPM rates based on the experiences of others? Are you not making assumptions on their SR based on your personal experience? The SD hasn't said his side. Maybe he views this as being a more traditional SR which is why he's acting this way. Or maybe he's a dick. You're just assuming the latter.\n\nRegardless, I think it's pretty clear these two are not practicing a sugar relationship, but rather a dressed escort/John relationship. Nothing wrong with that but it needs to be pointed out that this isn't what sugaring should be.",
                            "author": "otherwise-sorbet03",
                            "id": "fw1tbb4",
                            "parent_id": "t1_fw1t0w4",
                            "score": -1,
                            "created_utc": 1593168223.0,
                            "replies": [
                                {
                                    "body": "Erm no. I'm absolutely not making assumptions based on my personal experience, I am on an allowance not PPM and would not be with such a man. I am making 'assumptions' based on the information given, like a sensible person should. 'No honey, no money 😈' is not a text that would be sent by a man who wants a 'traditional SR'\n\nWe can agree that they are mismatched, but you should also check your bias and actually read the facts.",
                                    "author": "Callie-jay",
                                    "id": "fw1tjmp",
                                    "parent_id": "t1_fw1tbb4",
                                    "score": 5,
                                    "created_utc": 1593168441.0,
                                    "replies": [
                                        {
                                            "body": "The blinders you have on are absurd. How is \"no honey no money\" any more or less repugnant than her \"no money no honey?\" Which is basically her argument. She wants more money for more sex. That is not a position that would be taken by a woman who wants a \"traditional SR\"\n\nBOTH are gross imo. She blames all of her bad behavior on \"well his behavior is worse.\" Stop assuming because we disagree that I'm not a sensible person. I admit my biases. You claim yours are facts. Get over yourself.\n\nNo \"facts\" were presented in this thread. The entirety of the thread is the perspective of one person in a two person relationship. Betcha his version of events is pretty different.",
                                            "author": "otherwise-sorbet03",
                                            "id": "fw1tw7k",
                                            "parent_id": "t1_fw1tjmp",
                                            "score": -5,
                                            "created_utc": 1593168765.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re right. I entered this relationship kind of desperate and that was a big mistake. I ended up settling for someone who likes me a lot more than I like him, which has only led to bad things.",
            "author": "ApprehensiveInsect1",
            "id": "fw0omz9",
            "parent_id": "t1_fw0my4l",
            "score": 7,
            "created_utc": 1593136120.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fw2hh00",
            "parent_id": "t1_fw28f3h",
            "score": -2,
            "created_utc": 1593184000.0,
            "replies": [
                {
                    "body": "Rule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                    "author": "Azurecole",
                    "id": "fw2o8hj",
                    "parent_id": "t1_fw2hh00",
                    "score": 2,
                    "created_utc": 1593187344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, it is PPM and pretty new. I was stupid and dumb the one time I did an overnight with him. By platonic dates I mean he’ll text me to schedule something, like \n“Want to go out to X museum?” \nI’ll reply yes, and then he’ll say he doesn’t have much time and sex won’t happen. The first time he asked I tried to gracefully ask what the PPM for platonic dates was and he said “no sugar = no sugar 😈”. The blatant disrespect for my time was astonishing. Thanks for your advice, I’ve already ignored several red flags with him and this was kind of the last straw.",
            "author": "ApprehensiveInsect1",
            "id": "fw0m43i",
            "parent_id": "t1_fw0iiym",
            "score": 44,
            "created_utc": 1593134587.0,
            "replies": [
                {
                    "body": "Ewwwww manipulative jerk. \n\nNO SUGAR FOR YOU! <in Seinfeld soup joke voice from last century lol>",
                    "author": "testing1to3",
                    "id": "fw0nkf9",
                    "parent_id": "t1_fw0m43i",
                    "score": 34,
                    "created_utc": 1593135469.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw0ppe4",
                            "parent_id": "t1_fw0nkf9",
                            "score": 4,
                            "created_utc": 1593136761.0,
                            "replies": [
                                {
                                    "body": "Hahaha albeit clearly too old for an SB 😳😂 <sarcasm>",
                                    "author": "testing1to3",
                                    "id": "fw0pt70",
                                    "parent_id": "t1_fw0ppe4",
                                    "score": 9,
                                    "created_utc": 1593136822.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fw0qhl7",
                                            "parent_id": "t1_fw0pt70",
                                            "score": -3,
                                            "created_utc": 1593137228.0,
                                            "replies": [
                                                {
                                                    "body": "Ewwwwwwww 🤮",
                                                    "author": "testing1to3",
                                                    "id": "fw0qp3n",
                                                    "parent_id": "t1_fw0qhl7",
                                                    "score": 4,
                                                    "created_utc": 1593137353.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Who doesn’t love 3 Doors Down though?!",
                                                    "author": "lasswithaleash",
                                                    "id": "fw1byg5",
                                                    "parent_id": "t1_fw0qhl7",
                                                    "score": 0,
                                                    "created_utc": 1593151847.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I would have responded that my time is my sugar.",
                    "author": "Lipstickluna97",
                    "id": "fw2045u",
                    "parent_id": "t1_fw0m43i",
                    "score": 7,
                    "created_utc": 1593173848.0,
                    "replies": []
                },
                {
                    "body": "Yikes, that is so crude. Time to move on.\n\nNot just because of the disrespect, but it is clear you aren't attracted to your SD.",
                    "author": "n0cturnalbaby",
                    "id": "fw0n551",
                    "parent_id": "t1_fw0m43i",
                    "score": -2,
                    "created_utc": 1593135211.0,
                    "replies": [
                        {
                            "body": "And yet the opposite is true and just as crude.",
                            "author": "otherwise-sorbet03",
                            "id": "fw0spjs",
                            "parent_id": "t1_fw0n551",
                            "score": 1,
                            "created_utc": 1593138585.0,
                            "replies": [
                                {
                                    "body": "Well, although I'm not onboard with asking for more for overnights, I can empathize with why OP felt it was necessary. Her SD sounds far from ideal and she clearly treats the SR like a job. If she found someone she genuinely enjoys the company of, I doubt overnights would be an issue.",
                                    "author": "n0cturnalbaby",
                                    "id": "fw15ilv",
                                    "parent_id": "t1_fw0spjs",
                                    "score": 0,
                                    "created_utc": 1593146940.0,
                                    "replies": [
                                        {
                                            "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
                                            "author": "AdministrativeLevel9",
                                            "id": "fw44kp6",
                                            "parent_id": "t1_fw15ilv",
                                            "score": 6,
                                            "created_utc": 1593213439.0,
                                            "replies": [
                                                {
                                                    "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                                                    "author": "n0cturnalbaby",
                                                    "id": "fw45mhj",
                                                    "parent_id": "t1_fw44kp6",
                                                    "score": 0,
                                                    "created_utc": 1593214037.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
                                            "author": "otherwise-sorbet03",
                                            "id": "fw15r8n",
                                            "parent_id": "t1_fw15ilv",
                                            "score": -4,
                                            "created_utc": 1593147112.0,
                                            "replies": [
                                                {
                                                    "body": "Agree that SRs shouldn't be treated like a job.",
                                                    "author": "n0cturnalbaby",
                                                    "id": "fw15twp",
                                                    "parent_id": "t1_fw15r8n",
                                                    "score": -1,
                                                    "created_utc": 1593147164.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't see it :\n\nIf they agreed on around 4 hours meets --- \nand she sounds like it has been very unpleasant ( ESCORT shaming ) and overnight would be even more unpleasant and he is not even trying to offer a little more ??? \n\n7 or 8 hours more of her time in every meet",
            "author": "shamloo77",
            "id": "fw0ojb0",
            "parent_id": "t1_fw0nb1s",
            "score": 21,
            "created_utc": 1593136058.0,
            "replies": []
        },
        {
            "body": "He wants an extra 600 minutes over and above the agreement. Don't you think that asking for over three times the original time is a bit excessive?",
            "author": "Mangotingthroneway",
            "id": "fw1xy38",
            "parent_id": "t1_fw0nb1s",
            "score": 14,
            "created_utc": 1593172205.0,
            "replies": []
        },
        {
            "body": "I think this thread would have gone much better if you'd mentioned that :)    Not shade to you -- no one ever thinks to talk about what the context is, what the arrangement dynamics are, etc.   So SDs who go above-and-beyond their SBs (and who subsequently get the same treatment back), get irritated at an SB who is quid pro auo, but don't realize that that SB is with a do-the-bare-minimum SD.  And then other SBs who have been in do-the-bare-minimum SRs rush to her defense.  I avoid NSA type SBs the moment I figure them out (usually).\n\nI do still wince when you call it a \"price\"... that's not how it feels in a good SR.  A price is an obligation I'm stuck paying; in a healthy SR, I enjoy supporting my SB.  But maybe it feels like a price in those NSA SRs",
            "author": "Azurecole",
            "id": "fw0s4fg",
            "parent_id": "t1_fw0r0uo",
            "score": 8,
            "created_utc": 1593138226.0,
            "replies": [
                {
                    "body": "I think that’s a huge problem of this forum tbh. Say you are an angelic, respectful, generous SD, just a delight for any SB to be around. And then an SB makes a post complaining and SD’s on this sub go “I’m an amazing SD, so HE must be an amazing SD! Because I’m a great person, ALL people under the same title as me must also be amazing! And she must be selfish and ungrateful and the one in the wrong!” Few people do what you have and actually acknowledge the idea that some SD’s are cheap and rude and shitty. \n\nAnd regarding calling it a “price”, talking about everything so clinically is a bit of a bad habit because the soon-to-be-ex SD was far worse. He didn’t want it to be “transactional” but would talk about sex like he was holding something over me and the only way I would get anything is if I laid it out like “this service costs this much.” SD’s on here talk about how “unspoken” their arrangements are, their SB’s know they’ll take care of them without talking. Good for them! But there was nothing unspoken in this arrangement.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw0vgzs",
                    "parent_id": "t1_fw0s4fg",
                    "score": 24,
                    "created_utc": 1593140275.0,
                    "replies": [
                        {
                            "body": "I love your reply.",
                            "author": "AdministrativeLevel9",
                            "id": "fw458zb",
                            "parent_id": "t1_fw0vgzs",
                            "score": 3,
                            "created_utc": 1593213823.0,
                            "replies": []
                        },
                        {
                            "body": "Sugar life as discussed in slf is an idealized version of what happens in the real sugar bowl.",
                            "author": "nthcoming",
                            "id": "fw27it0",
                            "parent_id": "t1_fw0vgzs",
                            "score": 5,
                            "created_utc": 1593178640.0,
                            "replies": []
                        },
                        {
                            "body": "> And regarding calling it a “price”, talking about everything so  clinically is a bit of a bad habit because the soon-to-be-ex SD was far  worse.  \n\nYeah, I always what's the chicken and what's the egg.   Are you calling it a \"price\" because the way he treats you, that's what it feels like?  Or is your SR uber-transactional because you're a \"price\" girl, and that's how you (consciously or unconsciously) steer your SRs?   It sounds like in this case, it's the former -- you feel like his behavior was transactional and disrespectful from the beginning, but you would otherwise be open to a more classic style SR?  \n\nThere are plenty of SBs and SDs who are \"price\" types, which of course is perfectly fine!  Just not what many of us are looking for, and their standards do not apply to my SRs.",
                            "author": "Azurecole",
                            "id": "fw2qiu2",
                            "parent_id": "t1_fw0vgzs",
                            "score": -1,
                            "created_utc": 1593188432.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "SB need to be nice even on this site. Sucks and is bull shit.",
                    "author": "AdministrativeLevel9",
                    "id": "fw451h0",
                    "parent_id": "t1_fw0s4fg",
                    "score": 2,
                    "created_utc": 1593213704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some people try to find a negative spin or dark cloud in every description.  Once someone's gone toxic, is it really fruitful to engage?  Everyone else seemed to pick up a positive message -- if you can only find negative, maybe it's worth some self reflection.  Not trying to be rude but sheesh, I'm not playing this game.",
            "author": "Azurecole",
            "id": "fw45n6g",
            "parent_id": "t1_fw44s4g",
            "score": 1,
            "created_utc": 1593214049.0,
            "replies": []
        },
        {
            "body": "Exactly!  And SDs who treat their SBs transactionally, will also never see this type of relationship, and should expect to be asked to \"get paid\" for spending extra time.",
            "author": "Azurecole",
            "id": "fw2oowt",
            "parent_id": "t1_fw2mcvc",
            "score": 7,
            "created_utc": 1593187563.0,
            "replies": []
        },
        {
            "body": "Men don't want it to 'seem\" transactional means they want the fantasy even if they know it is transactional.",
            "author": "AdministrativeLevel9",
            "id": "fw45t5p",
            "parent_id": "t1_fw2mcvc",
            "score": 4,
            "created_utc": 1593214144.0,
            "replies": []
        },
        {
            "body": "The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened? \n\nBecause the only reason I hear against allowance is that SB's start putting less effort in but that should not be the case in SR's like yours and the above poster...",
            "author": "Callie-jay",
            "id": "fw1s1ge",
            "parent_id": "t1_fw1naw4",
            "score": 8,
            "created_utc": 1593166995.0,
            "replies": [
                {
                    "body": "Nothing is digital.  It's a transition.  It's not like yesterday we were cold and transactional and today we are warm, caring and close. \n\nMoving to allownace requires trust. Trust takes time and consistent actions. I think we are at the point where we have both demonstrated we are trustworthy through consistent actions where a move to a regular allownace is appropriate.  That's how I hope all SRs naturally evolve.",
                    "author": "willfromvb",
                    "id": "fw1syn3",
                    "parent_id": "t1_fw1s1ge",
                    "score": 1,
                    "created_utc": 1593167888.0,
                    "replies": [
                        {
                            "body": "Yeah... it's still not consistent. Rereading Azurecole's description of his SR (which is beautiful), the last thing I would pick up from that is that there is not yet enough trust.\n\nYou have to admit that PPM is incongruent with the way you are painting your SR and I'm not picking on you in particular because that inconsistency is rife here.",
                            "author": "Callie-jay",
                            "id": "fw1taoc",
                            "parent_id": "t1_fw1syn3",
                            "score": 8,
                            "created_utc": 1593168206.0,
                            "replies": [
                                {
                                    "body": "How so?  Should I have started on allownace?  Under what conditions should I transition from ppm to allowance?  \n\nI think I am just describing an SR that is currently transitioning from ppm to allownace.  This happens in almost every long term SR on allownace.  What is incongruent?",
                                    "author": "willfromvb",
                                    "id": "fw1thej",
                                    "parent_id": "t1_fw1taoc",
                                    "score": -2,
                                    "created_utc": 1593168382.0,
                                    "replies": [
                                        {
                                            "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
                                            "author": "Callie-jay",
                                            "id": "fw1tpc0",
                                            "parent_id": "t1_fw1thej",
                                            "score": 6,
                                            "created_utc": 1593168589.0,
                                            "replies": [
                                                {
                                                    "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                                                    "author": "willfromvb",
                                                    "id": "fw1u01r",
                                                    "parent_id": "t1_fw1tpc0",
                                                    "score": -2,
                                                    "created_utc": 1593168861.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> Moving to allownace requires trust.\n\nI think it's more than that.  Allowances aren't a one size fits all shoe.\n\nI've started arrangements from day 1 with a monthly allowance (divided into two parts the first month or two).",
                            "author": "SDstartingOut",
                            "id": "fw2qwva",
                            "parent_id": "t1_fw1syn3",
                            "score": 1,
                            "created_utc": 1593188614.0,
                            "replies": [
                                {
                                    "body": "It certainly is more than that and a ppm allowance  arrangement may be more appropriate than a periodic allowance arrangement for many reasons, but I would never consider a periodic allowance if I had not built trust.\n\nRespect everyone has a different view, but I would never start with a periodic allowance. There are too many rinsers and con artists to do that.  The best con artists are really good at not looking like a con artists and are not easily detected.",
                                    "author": "willfromvb",
                                    "id": "fw2rbhv",
                                    "parent_id": "t1_fw2qwva",
                                    "score": 1,
                                    "created_utc": 1593188803.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened?\n\nI vastly prefer monthly allowances, and talk about a MA/what I can provide monthly before even talking about a PPM to kick off the first couple of dates.  \n\nHowever - I have had two (long term, both over a year) SBs that wanted to stay on PPM due to their schedules.  These weren't exactly NSA;  they were more of, FWB with a strong physical & friendship/mentoring connection.  But we were not monogamous by any means, in an open relationship.\n\nKey thing here was - there was trust.  Part of a monthly allowance is the commitment - the SB can count on a certain amount.  In this case - both of the women knew they could always count on X visits a month if they had the time.  But there was no commitment on their side to it.",
                    "author": "SDstartingOut",
                    "id": "fw2qo0z",
                    "parent_id": "t1_fw1s1ge",
                    "score": -1,
                    "created_utc": 1593188499.0,
                    "replies": [
                        {
                            "body": "Yeah, I get that but I'm not talking about SB's that want to stay on PPM. I'm talking about SD's that repeatedly talk about how genuine their SR's are and how much mutual above and beyond giving there is but simultaneously refuse to move from PPM because of a lack of trust.",
                            "author": "Callie-jay",
                            "id": "fw46yax",
                            "parent_id": "t1_fw2qo0z",
                            "score": 2,
                            "created_utc": 1593214802.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ha, my SB snores quite a bit but it's still cute.",
            "author": null,
            "id": "fw17242",
            "parent_id": "t1_fw0iha3",
            "score": 2,
            "created_utc": 1593148040.0,
            "replies": []
        },
        {
            "body": "Right but when you start making a play for extra compensation for overnights then it isn’t any of the issues you mentioned at all. Because if it were those issues, then she just wouldn’t do overnights  at all regardless if more $$ is involved or not and she would just say I can’t do them.",
            "author": "ruphun",
            "id": "fw0k1wf",
            "parent_id": "t1_fw0iha3",
            "score": -10,
            "created_utc": 1593133336.0,
            "replies": []
        },
        {
            "body": "As someone who was also living under her parents’ roof when she started sugaring, I can tell you that it isn’t the extra time she’s got the biggest problem with. It’s the prep work that goes into the ability to maintain her own discretion that becomes exponentially more difficult. She has to put in all this extra time and effort so his sex life is more fulfilling but she shouldn’t be compensated for that? How is that mutually beneficial?",
            "author": "lasswithaleash",
            "id": "fw1br3y",
            "parent_id": "t1_fw0o19k",
            "score": 15,
            "created_utc": 1593151676.0,
            "replies": []
        },
        {
            "body": "I've heard that comparison before but there are a couple of issues with it. One, because as an SD I have been asked for extra help from time to time because my SB needed it that week or wanted to buy something for herself and I never looked at those requests as an opportunity for a quid pro quo, as long as we'd been seeing each other for a while and developed some level of trust. I would only feel insulted if it were a brand new relationship. But more importantly I think there's a difference between the money and the sex. The money is all about what the SB wants and needs. Its purely support from me to her. Spending time together and having sex, on the other hand, should be about both of us and what we both want. Its not something she is doing *for* me in exchange for money. By the time we are spending the night together it should be something we both want to do and the topic of more PPM for overnights has never come up.\n\nThat kind of SR doesn't rise to the level of angelic in my book but you're absolutely right that not every SR is like this. If yours is more transactional and overnights aren't something you want to do, then there's nothing wrong with asking for a higher PPM or just saying no.",
            "author": "canavatar12",
            "id": "fw30nhq",
            "parent_id": "t1_fw0o19k",
            "score": 0,
            "created_utc": 1593193227.0,
            "replies": []
        },
        {
            "body": "Right, Plenty of girls also meet guys at their hotel or home without doing a proper meet and greet\n\nPlenty of girls juggle multiple SD back to back\n\nPlenty of girls rinse guys \n\nPlenty of girls are only in it for the money...\n\nbut it doesn’t mean any of it its the right thing to do in a sugar relationship.",
            "author": "ruphun",
            "id": "fw0kgn1",
            "parent_id": "t1_fw0i5u0",
            "score": -12,
            "created_utc": 1593133587.0,
            "replies": [
                {
                    "body": "Plenty of guys ask girls to meet at their home knowing a public space would be safer for her but rather than take their comfort into accountability selfishly ask so. \n\nPlenty of guys have multiple SBs but won’t even entertain the idea of one of theirs having a second and would dump them instead. \n\nPlenty of guys lure girls in with false promises then call them sluts and whores when they expect what was promised. \n\nPlenty of guys treat girls like their own personal pocket pussy. \n\nBut it doesn’t mean any of it is the right thing to do.",
                    "author": "pumpkinspicedcream",
                    "id": "fw0ltxu",
                    "parent_id": "t1_fw0kgn1",
                    "score": 18,
                    "created_utc": 1593134415.0,
                    "replies": [
                        {
                            "body": "Can we stick to the OP's actual situation?\n\nSBs--you can acknowledge that SDs here run the gamut from shitty/smarmy to true gentlemen who love their SBs.  \n\nSDs--we can acknowledge that SBs here run the same gamut.\n\nLet's just stay on topic.  :)",
                            "author": null,
                            "id": "fw1aem9",
                            "parent_id": "t1_fw0ltxu",
                            "score": -4,
                            "created_utc": 1593150588.0,
                            "replies": [
                                {
                                    "body": "Pretty sure in her edit she clarifies the guy is a dick straight out. Each has their shortcomings but don’t come telling me to stay on topic when I’m replying to someone that is only seeing it one way. Or are you only seeing it that way also? Because I’ve got no problem acknowledging when a girl is being a user.",
                                    "author": "pumpkinspicedcream",
                                    "id": "fw1arvm",
                                    "parent_id": "t1_fw1aem9",
                                    "score": 10,
                                    "created_utc": 1593150878.0,
                                    "replies": [
                                        {
                                            "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
                                            "author": null,
                                            "id": "fw1b20j",
                                            "parent_id": "t1_fw1arvm",
                                            "score": -4,
                                            "created_utc": 1593151103.0,
                                            "replies": [
                                                {
                                                    "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                                                    "author": "pumpkinspicedcream",
                                                    "id": "fw1b6kb",
                                                    "parent_id": "t1_fw1b20j",
                                                    "score": 8,
                                                    "created_utc": 1593151205.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fw0mrry",
            "parent_id": "t1_fw0i5u0",
            "score": -1,
            "created_utc": 1593134987.0,
            "replies": [
                {
                    "body": "Atreal, that's way over the line to personal.  No more personal attacks",
                    "author": "Azurecole",
                    "id": "fw0nf31",
                    "parent_id": "t1_fw0mrry",
                    "score": 5,
                    "created_utc": 1593135379.0,
                    "replies": [
                        {
                            "body": "I don’t know what was said but thank you anyhow.",
                            "author": "pumpkinspicedcream",
                            "id": "fw0t20k",
                            "parent_id": "t1_fw0nf31",
                            "score": 7,
                            "created_utc": 1593138797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "period",
            "author": "_redchief_",
            "id": "fw0z7lm",
            "parent_id": "t1_fw0to35",
            "score": 6,
            "created_utc": 1593142639.0,
            "replies": []
        },
        {
            "body": "I’m curious, what do you think the “spirit” of the comment was that you found constructive? What I took from his comment was the incredibly unhelpful “if you don’t like it move on and don’t complain about it!” Like somehow he stopped understanding that 90% of this sub is people complaining because they can’t complain to normal people, and he only cares when it’s something he doesn’t like. Even one of your posts is complaining about a ridiculous SB you messaged, do you think he would comment on your post “if it bothers you THAT much just move on and stop complaining on this sub!!!” \n\nI’m trying to extract the meaning of your comment. You’re saying that seeing relationships as money = sex is harmful. Fair enough, that seems to be every SD on here. But in thinking of the relationship on those terms, I’m “disrespecting what other SD’s have to offer.” I think this is a huge positive generalisation of “SD’s”. What exactly do you think MY SD has to offer? You don’t know, of course, but you’re assuming he has something. Are you assuming he acts like you? Are you assuming he does all the thoughtful, kind things you’ve done for your SB? Obviously if he was acting like you and I was acting so transactional, I’d be the one in the wrong! \n\nNow I know you see this as me “defending my actions by saying he was worse.” But the assumption in your comment that my SD has “many other things to offer” and “isn’t paying for sex, is paying for me to date him” seems to be you projecting the relationship dynamics of your own SR, a past SR or the “SLF ideal” SR onto the relationship in this post. The idea that all SD’s are generous and kind and compassionate, so all SB’s should be adoring and never pushy for money and should just know in their hearts their SD will take care of them. How idyllic.",
            "author": "ApprehensiveInsect1",
            "id": "fw2ij7r",
            "parent_id": "t1_fw0nd28",
            "score": 4,
            "created_utc": 1593184534.0,
            "replies": [
                {
                    "body": "You are awfully defensive. All of your comments make me doubt you're simply an innocent bystander in all of this. Often, on the internet, people try to minimize their culpability and maximize the responsibility of the other party. You have an excuse for every cuplable behavior you exhibit.\n\nI'm saying your nickle and diming is as much to blame as his lewdness. You bring up his not wanting to pay your PPM if there's no sex but then are mad when he won't pay more PPM for more sex. It's hypocritical and it's all antithetical to sugar dating.\n\nThere are some disgusting men who pretend to be SDs. And there are some manipulative women parading as SBs. This seems a case where they found each other.",
                    "author": "otherwise-sorbet03",
                    "id": "fw2mcct",
                    "parent_id": "t1_fw2ij7r",
                    "score": -1,
                    "created_utc": 1593186434.0,
                    "replies": [
                        {
                            "body": "I’m wondering what you mean when you say I brought up him not wanting to pay for dates with no sex. I’ve never asked for full PPM for platonic meets, I used that as a hypothetical counter to your idea that most SD’s are paying for dates rather than sex. The fact that almost no SD would have the same prices for sex and no sex combats that idea. If you were referring to me refusing to meet him platonically when he refused to pay for a platonic meet, no, I don’t meet SD’s for free. That’s not sugar dating.  \n\nThe comments about you not trusting me because this is only being told from my perspective, fair enough. But calling me “defensive” is puzzlingly redundant. You’ve  called me manipulative, “gross”, and criticised my actions and the presumed motivations behind them. You’ve insulted my character multiple times (again fair enough) but yes, I do react defensively when someone talks about me the way you have.",
                            "author": "ApprehensiveInsect1",
                            "id": "fw32ise",
                            "parent_id": "t1_fw2mcct",
                            "score": 4,
                            "created_utc": 1593194100.0,
                            "replies": [
                                {
                                    "body": "You realize I've done the same to you that you've done to your SD? So it begets the question, are you looking for honest opinions or a support group? I also don't believe I have insulted your character and I sincerely, genuinely apologize if it came off that way. I'm just saying this whole relationship is toxic and you most certainly are playing a role in that based on this post and these comments.",
                                    "author": "otherwise-sorbet03",
                                    "id": "fw334cb",
                                    "parent_id": "t1_fw32ise",
                                    "score": -2,
                                    "created_utc": 1593194381.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The point you're missing is that you cannot make false assumptions about other peoples' SR's based on your personal experience. \n\nYou say that '*we're* not paying to have sex with them we're paying to date them' when that's clearly not the case for OP's SD. You need to realise that not everyone is like you and consider that when giving input.",
            "author": "Callie-jay",
            "id": "fw1t0w4",
            "parent_id": "t1_fw0nd28",
            "score": 4,
            "created_utc": 1593167947.0,
            "replies": [
                {
                    "body": "Or perhaps our individual biases are coloring our perceptions of these events? Isn't OP asking generalized opinions on PPM rates based on the experiences of others? Are you not making assumptions on their SR based on your personal experience? The SD hasn't said his side. Maybe he views this as being a more traditional SR which is why he's acting this way. Or maybe he's a dick. You're just assuming the latter.\n\nRegardless, I think it's pretty clear these two are not practicing a sugar relationship, but rather a dressed escort/John relationship. Nothing wrong with that but it needs to be pointed out that this isn't what sugaring should be.",
                    "author": "otherwise-sorbet03",
                    "id": "fw1tbb4",
                    "parent_id": "t1_fw1t0w4",
                    "score": -1,
                    "created_utc": 1593168223.0,
                    "replies": [
                        {
                            "body": "Erm no. I'm absolutely not making assumptions based on my personal experience, I am on an allowance not PPM and would not be with such a man. I am making 'assumptions' based on the information given, like a sensible person should. 'No honey, no money 😈' is not a text that would be sent by a man who wants a 'traditional SR'\n\nWe can agree that they are mismatched, but you should also check your bias and actually read the facts.",
                            "author": "Callie-jay",
                            "id": "fw1tjmp",
                            "parent_id": "t1_fw1tbb4",
                            "score": 5,
                            "created_utc": 1593168441.0,
                            "replies": [
                                {
                                    "body": "The blinders you have on are absurd. How is \"no honey no money\" any more or less repugnant than her \"no money no honey?\" Which is basically her argument. She wants more money for more sex. That is not a position that would be taken by a woman who wants a \"traditional SR\"\n\nBOTH are gross imo. She blames all of her bad behavior on \"well his behavior is worse.\" Stop assuming because we disagree that I'm not a sensible person. I admit my biases. You claim yours are facts. Get over yourself.\n\nNo \"facts\" were presented in this thread. The entirety of the thread is the perspective of one person in a two person relationship. Betcha his version of events is pretty different.",
                                    "author": "otherwise-sorbet03",
                                    "id": "fw1tw7k",
                                    "parent_id": "t1_fw1tjmp",
                                    "score": -5,
                                    "created_utc": 1593168765.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
            "author": "Azurecole",
            "id": "fw2o8hj",
            "parent_id": "t1_fw2hh00",
            "score": 2,
            "created_utc": 1593187344.0,
            "replies": []
        },
        {
            "body": "Ewwwww manipulative jerk. \n\nNO SUGAR FOR YOU! <in Seinfeld soup joke voice from last century lol>",
            "author": "testing1to3",
            "id": "fw0nkf9",
            "parent_id": "t1_fw0m43i",
            "score": 34,
            "created_utc": 1593135469.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw0ppe4",
                    "parent_id": "t1_fw0nkf9",
                    "score": 4,
                    "created_utc": 1593136761.0,
                    "replies": [
                        {
                            "body": "Hahaha albeit clearly too old for an SB 😳😂 <sarcasm>",
                            "author": "testing1to3",
                            "id": "fw0pt70",
                            "parent_id": "t1_fw0ppe4",
                            "score": 9,
                            "created_utc": 1593136822.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fw0qhl7",
                                    "parent_id": "t1_fw0pt70",
                                    "score": -3,
                                    "created_utc": 1593137228.0,
                                    "replies": [
                                        {
                                            "body": "Ewwwwwwww 🤮",
                                            "author": "testing1to3",
                                            "id": "fw0qp3n",
                                            "parent_id": "t1_fw0qhl7",
                                            "score": 4,
                                            "created_utc": 1593137353.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Who doesn’t love 3 Doors Down though?!",
                                            "author": "lasswithaleash",
                                            "id": "fw1byg5",
                                            "parent_id": "t1_fw0qhl7",
                                            "score": 0,
                                            "created_utc": 1593151847.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would have responded that my time is my sugar.",
            "author": "Lipstickluna97",
            "id": "fw2045u",
            "parent_id": "t1_fw0m43i",
            "score": 7,
            "created_utc": 1593173848.0,
            "replies": []
        },
        {
            "body": "Yikes, that is so crude. Time to move on.\n\nNot just because of the disrespect, but it is clear you aren't attracted to your SD.",
            "author": "n0cturnalbaby",
            "id": "fw0n551",
            "parent_id": "t1_fw0m43i",
            "score": -2,
            "created_utc": 1593135211.0,
            "replies": [
                {
                    "body": "And yet the opposite is true and just as crude.",
                    "author": "otherwise-sorbet03",
                    "id": "fw0spjs",
                    "parent_id": "t1_fw0n551",
                    "score": 1,
                    "created_utc": 1593138585.0,
                    "replies": [
                        {
                            "body": "Well, although I'm not onboard with asking for more for overnights, I can empathize with why OP felt it was necessary. Her SD sounds far from ideal and she clearly treats the SR like a job. If she found someone she genuinely enjoys the company of, I doubt overnights would be an issue.",
                            "author": "n0cturnalbaby",
                            "id": "fw15ilv",
                            "parent_id": "t1_fw0spjs",
                            "score": 0,
                            "created_utc": 1593146940.0,
                            "replies": [
                                {
                                    "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
                                    "author": "AdministrativeLevel9",
                                    "id": "fw44kp6",
                                    "parent_id": "t1_fw15ilv",
                                    "score": 6,
                                    "created_utc": 1593213439.0,
                                    "replies": [
                                        {
                                            "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                                            "author": "n0cturnalbaby",
                                            "id": "fw45mhj",
                                            "parent_id": "t1_fw44kp6",
                                            "score": 0,
                                            "created_utc": 1593214037.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
                                    "author": "otherwise-sorbet03",
                                    "id": "fw15r8n",
                                    "parent_id": "t1_fw15ilv",
                                    "score": -4,
                                    "created_utc": 1593147112.0,
                                    "replies": [
                                        {
                                            "body": "Agree that SRs shouldn't be treated like a job.",
                                            "author": "n0cturnalbaby",
                                            "id": "fw15twp",
                                            "parent_id": "t1_fw15r8n",
                                            "score": -1,
                                            "created_utc": 1593147164.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that’s a huge problem of this forum tbh. Say you are an angelic, respectful, generous SD, just a delight for any SB to be around. And then an SB makes a post complaining and SD’s on this sub go “I’m an amazing SD, so HE must be an amazing SD! Because I’m a great person, ALL people under the same title as me must also be amazing! And she must be selfish and ungrateful and the one in the wrong!” Few people do what you have and actually acknowledge the idea that some SD’s are cheap and rude and shitty. \n\nAnd regarding calling it a “price”, talking about everything so clinically is a bit of a bad habit because the soon-to-be-ex SD was far worse. He didn’t want it to be “transactional” but would talk about sex like he was holding something over me and the only way I would get anything is if I laid it out like “this service costs this much.” SD’s on here talk about how “unspoken” their arrangements are, their SB’s know they’ll take care of them without talking. Good for them! But there was nothing unspoken in this arrangement.",
            "author": "ApprehensiveInsect1",
            "id": "fw0vgzs",
            "parent_id": "t1_fw0s4fg",
            "score": 24,
            "created_utc": 1593140275.0,
            "replies": [
                {
                    "body": "I love your reply.",
                    "author": "AdministrativeLevel9",
                    "id": "fw458zb",
                    "parent_id": "t1_fw0vgzs",
                    "score": 3,
                    "created_utc": 1593213823.0,
                    "replies": []
                },
                {
                    "body": "Sugar life as discussed in slf is an idealized version of what happens in the real sugar bowl.",
                    "author": "nthcoming",
                    "id": "fw27it0",
                    "parent_id": "t1_fw0vgzs",
                    "score": 5,
                    "created_utc": 1593178640.0,
                    "replies": []
                },
                {
                    "body": "> And regarding calling it a “price”, talking about everything so  clinically is a bit of a bad habit because the soon-to-be-ex SD was far  worse.  \n\nYeah, I always what's the chicken and what's the egg.   Are you calling it a \"price\" because the way he treats you, that's what it feels like?  Or is your SR uber-transactional because you're a \"price\" girl, and that's how you (consciously or unconsciously) steer your SRs?   It sounds like in this case, it's the former -- you feel like his behavior was transactional and disrespectful from the beginning, but you would otherwise be open to a more classic style SR?  \n\nThere are plenty of SBs and SDs who are \"price\" types, which of course is perfectly fine!  Just not what many of us are looking for, and their standards do not apply to my SRs.",
                    "author": "Azurecole",
                    "id": "fw2qiu2",
                    "parent_id": "t1_fw0vgzs",
                    "score": -1,
                    "created_utc": 1593188432.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SB need to be nice even on this site. Sucks and is bull shit.",
            "author": "AdministrativeLevel9",
            "id": "fw451h0",
            "parent_id": "t1_fw0s4fg",
            "score": 2,
            "created_utc": 1593213704.0,
            "replies": []
        },
        {
            "body": "Nothing is digital.  It's a transition.  It's not like yesterday we were cold and transactional and today we are warm, caring and close. \n\nMoving to allownace requires trust. Trust takes time and consistent actions. I think we are at the point where we have both demonstrated we are trustworthy through consistent actions where a move to a regular allownace is appropriate.  That's how I hope all SRs naturally evolve.",
            "author": "willfromvb",
            "id": "fw1syn3",
            "parent_id": "t1_fw1s1ge",
            "score": 1,
            "created_utc": 1593167888.0,
            "replies": [
                {
                    "body": "Yeah... it's still not consistent. Rereading Azurecole's description of his SR (which is beautiful), the last thing I would pick up from that is that there is not yet enough trust.\n\nYou have to admit that PPM is incongruent with the way you are painting your SR and I'm not picking on you in particular because that inconsistency is rife here.",
                    "author": "Callie-jay",
                    "id": "fw1taoc",
                    "parent_id": "t1_fw1syn3",
                    "score": 8,
                    "created_utc": 1593168206.0,
                    "replies": [
                        {
                            "body": "How so?  Should I have started on allownace?  Under what conditions should I transition from ppm to allowance?  \n\nI think I am just describing an SR that is currently transitioning from ppm to allownace.  This happens in almost every long term SR on allownace.  What is incongruent?",
                            "author": "willfromvb",
                            "id": "fw1thej",
                            "parent_id": "t1_fw1taoc",
                            "score": -2,
                            "created_utc": 1593168382.0,
                            "replies": [
                                {
                                    "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
                                    "author": "Callie-jay",
                                    "id": "fw1tpc0",
                                    "parent_id": "t1_fw1thej",
                                    "score": 6,
                                    "created_utc": 1593168589.0,
                                    "replies": [
                                        {
                                            "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                                            "author": "willfromvb",
                                            "id": "fw1u01r",
                                            "parent_id": "t1_fw1tpc0",
                                            "score": -2,
                                            "created_utc": 1593168861.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Moving to allownace requires trust.\n\nI think it's more than that.  Allowances aren't a one size fits all shoe.\n\nI've started arrangements from day 1 with a monthly allowance (divided into two parts the first month or two).",
                    "author": "SDstartingOut",
                    "id": "fw2qwva",
                    "parent_id": "t1_fw1syn3",
                    "score": 1,
                    "created_utc": 1593188614.0,
                    "replies": [
                        {
                            "body": "It certainly is more than that and a ppm allowance  arrangement may be more appropriate than a periodic allowance arrangement for many reasons, but I would never consider a periodic allowance if I had not built trust.\n\nRespect everyone has a different view, but I would never start with a periodic allowance. There are too many rinsers and con artists to do that.  The best con artists are really good at not looking like a con artists and are not easily detected.",
                            "author": "willfromvb",
                            "id": "fw2rbhv",
                            "parent_id": "t1_fw2qwva",
                            "score": 1,
                            "created_utc": 1593188803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> The part I don't understand is why super close, genuine SR's would still be on PPM? If there is that much trust and affection, why would the move to allowance not have happened?\n\nI vastly prefer monthly allowances, and talk about a MA/what I can provide monthly before even talking about a PPM to kick off the first couple of dates.  \n\nHowever - I have had two (long term, both over a year) SBs that wanted to stay on PPM due to their schedules.  These weren't exactly NSA;  they were more of, FWB with a strong physical & friendship/mentoring connection.  But we were not monogamous by any means, in an open relationship.\n\nKey thing here was - there was trust.  Part of a monthly allowance is the commitment - the SB can count on a certain amount.  In this case - both of the women knew they could always count on X visits a month if they had the time.  But there was no commitment on their side to it.",
            "author": "SDstartingOut",
            "id": "fw2qo0z",
            "parent_id": "t1_fw1s1ge",
            "score": -1,
            "created_utc": 1593188499.0,
            "replies": [
                {
                    "body": "Yeah, I get that but I'm not talking about SB's that want to stay on PPM. I'm talking about SD's that repeatedly talk about how genuine their SR's are and how much mutual above and beyond giving there is but simultaneously refuse to move from PPM because of a lack of trust.",
                    "author": "Callie-jay",
                    "id": "fw46yax",
                    "parent_id": "t1_fw2qo0z",
                    "score": 2,
                    "created_utc": 1593214802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Plenty of guys ask girls to meet at their home knowing a public space would be safer for her but rather than take their comfort into accountability selfishly ask so. \n\nPlenty of guys have multiple SBs but won’t even entertain the idea of one of theirs having a second and would dump them instead. \n\nPlenty of guys lure girls in with false promises then call them sluts and whores when they expect what was promised. \n\nPlenty of guys treat girls like their own personal pocket pussy. \n\nBut it doesn’t mean any of it is the right thing to do.",
            "author": "pumpkinspicedcream",
            "id": "fw0ltxu",
            "parent_id": "t1_fw0kgn1",
            "score": 18,
            "created_utc": 1593134415.0,
            "replies": [
                {
                    "body": "Can we stick to the OP's actual situation?\n\nSBs--you can acknowledge that SDs here run the gamut from shitty/smarmy to true gentlemen who love their SBs.  \n\nSDs--we can acknowledge that SBs here run the same gamut.\n\nLet's just stay on topic.  :)",
                    "author": null,
                    "id": "fw1aem9",
                    "parent_id": "t1_fw0ltxu",
                    "score": -4,
                    "created_utc": 1593150588.0,
                    "replies": [
                        {
                            "body": "Pretty sure in her edit she clarifies the guy is a dick straight out. Each has their shortcomings but don’t come telling me to stay on topic when I’m replying to someone that is only seeing it one way. Or are you only seeing it that way also? Because I’ve got no problem acknowledging when a girl is being a user.",
                            "author": "pumpkinspicedcream",
                            "id": "fw1arvm",
                            "parent_id": "t1_fw1aem9",
                            "score": 10,
                            "created_utc": 1593150878.0,
                            "replies": [
                                {
                                    "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
                                    "author": null,
                                    "id": "fw1b20j",
                                    "parent_id": "t1_fw1arvm",
                                    "score": -4,
                                    "created_utc": 1593151103.0,
                                    "replies": [
                                        {
                                            "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                                            "author": "pumpkinspicedcream",
                                            "id": "fw1b6kb",
                                            "parent_id": "t1_fw1b20j",
                                            "score": 8,
                                            "created_utc": 1593151205.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Atreal, that's way over the line to personal.  No more personal attacks",
            "author": "Azurecole",
            "id": "fw0nf31",
            "parent_id": "t1_fw0mrry",
            "score": 5,
            "created_utc": 1593135379.0,
            "replies": [
                {
                    "body": "I don’t know what was said but thank you anyhow.",
                    "author": "pumpkinspicedcream",
                    "id": "fw0t20k",
                    "parent_id": "t1_fw0nf31",
                    "score": 7,
                    "created_utc": 1593138797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are awfully defensive. All of your comments make me doubt you're simply an innocent bystander in all of this. Often, on the internet, people try to minimize their culpability and maximize the responsibility of the other party. You have an excuse for every cuplable behavior you exhibit.\n\nI'm saying your nickle and diming is as much to blame as his lewdness. You bring up his not wanting to pay your PPM if there's no sex but then are mad when he won't pay more PPM for more sex. It's hypocritical and it's all antithetical to sugar dating.\n\nThere are some disgusting men who pretend to be SDs. And there are some manipulative women parading as SBs. This seems a case where they found each other.",
            "author": "otherwise-sorbet03",
            "id": "fw2mcct",
            "parent_id": "t1_fw2ij7r",
            "score": -1,
            "created_utc": 1593186434.0,
            "replies": [
                {
                    "body": "I’m wondering what you mean when you say I brought up him not wanting to pay for dates with no sex. I’ve never asked for full PPM for platonic meets, I used that as a hypothetical counter to your idea that most SD’s are paying for dates rather than sex. The fact that almost no SD would have the same prices for sex and no sex combats that idea. If you were referring to me refusing to meet him platonically when he refused to pay for a platonic meet, no, I don’t meet SD’s for free. That’s not sugar dating.  \n\nThe comments about you not trusting me because this is only being told from my perspective, fair enough. But calling me “defensive” is puzzlingly redundant. You’ve  called me manipulative, “gross”, and criticised my actions and the presumed motivations behind them. You’ve insulted my character multiple times (again fair enough) but yes, I do react defensively when someone talks about me the way you have.",
                    "author": "ApprehensiveInsect1",
                    "id": "fw32ise",
                    "parent_id": "t1_fw2mcct",
                    "score": 4,
                    "created_utc": 1593194100.0,
                    "replies": [
                        {
                            "body": "You realize I've done the same to you that you've done to your SD? So it begets the question, are you looking for honest opinions or a support group? I also don't believe I have insulted your character and I sincerely, genuinely apologize if it came off that way. I'm just saying this whole relationship is toxic and you most certainly are playing a role in that based on this post and these comments.",
                            "author": "otherwise-sorbet03",
                            "id": "fw334cb",
                            "parent_id": "t1_fw32ise",
                            "score": -2,
                            "created_utc": 1593194381.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or perhaps our individual biases are coloring our perceptions of these events? Isn't OP asking generalized opinions on PPM rates based on the experiences of others? Are you not making assumptions on their SR based on your personal experience? The SD hasn't said his side. Maybe he views this as being a more traditional SR which is why he's acting this way. Or maybe he's a dick. You're just assuming the latter.\n\nRegardless, I think it's pretty clear these two are not practicing a sugar relationship, but rather a dressed escort/John relationship. Nothing wrong with that but it needs to be pointed out that this isn't what sugaring should be.",
            "author": "otherwise-sorbet03",
            "id": "fw1tbb4",
            "parent_id": "t1_fw1t0w4",
            "score": -1,
            "created_utc": 1593168223.0,
            "replies": [
                {
                    "body": "Erm no. I'm absolutely not making assumptions based on my personal experience, I am on an allowance not PPM and would not be with such a man. I am making 'assumptions' based on the information given, like a sensible person should. 'No honey, no money 😈' is not a text that would be sent by a man who wants a 'traditional SR'\n\nWe can agree that they are mismatched, but you should also check your bias and actually read the facts.",
                    "author": "Callie-jay",
                    "id": "fw1tjmp",
                    "parent_id": "t1_fw1tbb4",
                    "score": 5,
                    "created_utc": 1593168441.0,
                    "replies": [
                        {
                            "body": "The blinders you have on are absurd. How is \"no honey no money\" any more or less repugnant than her \"no money no honey?\" Which is basically her argument. She wants more money for more sex. That is not a position that would be taken by a woman who wants a \"traditional SR\"\n\nBOTH are gross imo. She blames all of her bad behavior on \"well his behavior is worse.\" Stop assuming because we disagree that I'm not a sensible person. I admit my biases. You claim yours are facts. Get over yourself.\n\nNo \"facts\" were presented in this thread. The entirety of the thread is the perspective of one person in a two person relationship. Betcha his version of events is pretty different.",
                            "author": "otherwise-sorbet03",
                            "id": "fw1tw7k",
                            "parent_id": "t1_fw1tjmp",
                            "score": -5,
                            "created_utc": 1593168765.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0ppe4",
            "parent_id": "t1_fw0nkf9",
            "score": 4,
            "created_utc": 1593136761.0,
            "replies": [
                {
                    "body": "Hahaha albeit clearly too old for an SB 😳😂 <sarcasm>",
                    "author": "testing1to3",
                    "id": "fw0pt70",
                    "parent_id": "t1_fw0ppe4",
                    "score": 9,
                    "created_utc": 1593136822.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw0qhl7",
                            "parent_id": "t1_fw0pt70",
                            "score": -3,
                            "created_utc": 1593137228.0,
                            "replies": [
                                {
                                    "body": "Ewwwwwwww 🤮",
                                    "author": "testing1to3",
                                    "id": "fw0qp3n",
                                    "parent_id": "t1_fw0qhl7",
                                    "score": 4,
                                    "created_utc": 1593137353.0,
                                    "replies": []
                                },
                                {
                                    "body": "Who doesn’t love 3 Doors Down though?!",
                                    "author": "lasswithaleash",
                                    "id": "fw1byg5",
                                    "parent_id": "t1_fw0qhl7",
                                    "score": 0,
                                    "created_utc": 1593151847.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And yet the opposite is true and just as crude.",
            "author": "otherwise-sorbet03",
            "id": "fw0spjs",
            "parent_id": "t1_fw0n551",
            "score": 1,
            "created_utc": 1593138585.0,
            "replies": [
                {
                    "body": "Well, although I'm not onboard with asking for more for overnights, I can empathize with why OP felt it was necessary. Her SD sounds far from ideal and she clearly treats the SR like a job. If she found someone she genuinely enjoys the company of, I doubt overnights would be an issue.",
                    "author": "n0cturnalbaby",
                    "id": "fw15ilv",
                    "parent_id": "t1_fw0spjs",
                    "score": 0,
                    "created_utc": 1593146940.0,
                    "replies": [
                        {
                            "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
                            "author": "AdministrativeLevel9",
                            "id": "fw44kp6",
                            "parent_id": "t1_fw15ilv",
                            "score": 6,
                            "created_utc": 1593213439.0,
                            "replies": [
                                {
                                    "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                                    "author": "n0cturnalbaby",
                                    "id": "fw45mhj",
                                    "parent_id": "t1_fw44kp6",
                                    "score": 0,
                                    "created_utc": 1593214037.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
                            "author": "otherwise-sorbet03",
                            "id": "fw15r8n",
                            "parent_id": "t1_fw15ilv",
                            "score": -4,
                            "created_utc": 1593147112.0,
                            "replies": [
                                {
                                    "body": "Agree that SRs shouldn't be treated like a job.",
                                    "author": "n0cturnalbaby",
                                    "id": "fw15twp",
                                    "parent_id": "t1_fw15r8n",
                                    "score": -1,
                                    "created_utc": 1593147164.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love your reply.",
            "author": "AdministrativeLevel9",
            "id": "fw458zb",
            "parent_id": "t1_fw0vgzs",
            "score": 3,
            "created_utc": 1593213823.0,
            "replies": []
        },
        {
            "body": "Sugar life as discussed in slf is an idealized version of what happens in the real sugar bowl.",
            "author": "nthcoming",
            "id": "fw27it0",
            "parent_id": "t1_fw0vgzs",
            "score": 5,
            "created_utc": 1593178640.0,
            "replies": []
        },
        {
            "body": "> And regarding calling it a “price”, talking about everything so  clinically is a bit of a bad habit because the soon-to-be-ex SD was far  worse.  \n\nYeah, I always what's the chicken and what's the egg.   Are you calling it a \"price\" because the way he treats you, that's what it feels like?  Or is your SR uber-transactional because you're a \"price\" girl, and that's how you (consciously or unconsciously) steer your SRs?   It sounds like in this case, it's the former -- you feel like his behavior was transactional and disrespectful from the beginning, but you would otherwise be open to a more classic style SR?  \n\nThere are plenty of SBs and SDs who are \"price\" types, which of course is perfectly fine!  Just not what many of us are looking for, and their standards do not apply to my SRs.",
            "author": "Azurecole",
            "id": "fw2qiu2",
            "parent_id": "t1_fw0vgzs",
            "score": -1,
            "created_utc": 1593188432.0,
            "replies": []
        },
        {
            "body": "Yeah... it's still not consistent. Rereading Azurecole's description of his SR (which is beautiful), the last thing I would pick up from that is that there is not yet enough trust.\n\nYou have to admit that PPM is incongruent with the way you are painting your SR and I'm not picking on you in particular because that inconsistency is rife here.",
            "author": "Callie-jay",
            "id": "fw1taoc",
            "parent_id": "t1_fw1syn3",
            "score": 8,
            "created_utc": 1593168206.0,
            "replies": [
                {
                    "body": "How so?  Should I have started on allownace?  Under what conditions should I transition from ppm to allowance?  \n\nI think I am just describing an SR that is currently transitioning from ppm to allownace.  This happens in almost every long term SR on allownace.  What is incongruent?",
                    "author": "willfromvb",
                    "id": "fw1thej",
                    "parent_id": "t1_fw1taoc",
                    "score": -2,
                    "created_utc": 1593168382.0,
                    "replies": [
                        {
                            "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
                            "author": "Callie-jay",
                            "id": "fw1tpc0",
                            "parent_id": "t1_fw1thej",
                            "score": 6,
                            "created_utc": 1593168589.0,
                            "replies": [
                                {
                                    "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                                    "author": "willfromvb",
                                    "id": "fw1u01r",
                                    "parent_id": "t1_fw1tpc0",
                                    "score": -2,
                                    "created_utc": 1593168861.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Moving to allownace requires trust.\n\nI think it's more than that.  Allowances aren't a one size fits all shoe.\n\nI've started arrangements from day 1 with a monthly allowance (divided into two parts the first month or two).",
            "author": "SDstartingOut",
            "id": "fw2qwva",
            "parent_id": "t1_fw1syn3",
            "score": 1,
            "created_utc": 1593188614.0,
            "replies": [
                {
                    "body": "It certainly is more than that and a ppm allowance  arrangement may be more appropriate than a periodic allowance arrangement for many reasons, but I would never consider a periodic allowance if I had not built trust.\n\nRespect everyone has a different view, but I would never start with a periodic allowance. There are too many rinsers and con artists to do that.  The best con artists are really good at not looking like a con artists and are not easily detected.",
                    "author": "willfromvb",
                    "id": "fw2rbhv",
                    "parent_id": "t1_fw2qwva",
                    "score": 1,
                    "created_utc": 1593188803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I get that but I'm not talking about SB's that want to stay on PPM. I'm talking about SD's that repeatedly talk about how genuine their SR's are and how much mutual above and beyond giving there is but simultaneously refuse to move from PPM because of a lack of trust.",
            "author": "Callie-jay",
            "id": "fw46yax",
            "parent_id": "t1_fw2qo0z",
            "score": 2,
            "created_utc": 1593214802.0,
            "replies": []
        },
        {
            "body": "Can we stick to the OP's actual situation?\n\nSBs--you can acknowledge that SDs here run the gamut from shitty/smarmy to true gentlemen who love their SBs.  \n\nSDs--we can acknowledge that SBs here run the same gamut.\n\nLet's just stay on topic.  :)",
            "author": null,
            "id": "fw1aem9",
            "parent_id": "t1_fw0ltxu",
            "score": -4,
            "created_utc": 1593150588.0,
            "replies": [
                {
                    "body": "Pretty sure in her edit she clarifies the guy is a dick straight out. Each has their shortcomings but don’t come telling me to stay on topic when I’m replying to someone that is only seeing it one way. Or are you only seeing it that way also? Because I’ve got no problem acknowledging when a girl is being a user.",
                    "author": "pumpkinspicedcream",
                    "id": "fw1arvm",
                    "parent_id": "t1_fw1aem9",
                    "score": 10,
                    "created_utc": 1593150878.0,
                    "replies": [
                        {
                            "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
                            "author": null,
                            "id": "fw1b20j",
                            "parent_id": "t1_fw1arvm",
                            "score": -4,
                            "created_utc": 1593151103.0,
                            "replies": [
                                {
                                    "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                                    "author": "pumpkinspicedcream",
                                    "id": "fw1b6kb",
                                    "parent_id": "t1_fw1b20j",
                                    "score": 8,
                                    "created_utc": 1593151205.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know what was said but thank you anyhow.",
            "author": "pumpkinspicedcream",
            "id": "fw0t20k",
            "parent_id": "t1_fw0nf31",
            "score": 7,
            "created_utc": 1593138797.0,
            "replies": []
        },
        {
            "body": "I’m wondering what you mean when you say I brought up him not wanting to pay for dates with no sex. I’ve never asked for full PPM for platonic meets, I used that as a hypothetical counter to your idea that most SD’s are paying for dates rather than sex. The fact that almost no SD would have the same prices for sex and no sex combats that idea. If you were referring to me refusing to meet him platonically when he refused to pay for a platonic meet, no, I don’t meet SD’s for free. That’s not sugar dating.  \n\nThe comments about you not trusting me because this is only being told from my perspective, fair enough. But calling me “defensive” is puzzlingly redundant. You’ve  called me manipulative, “gross”, and criticised my actions and the presumed motivations behind them. You’ve insulted my character multiple times (again fair enough) but yes, I do react defensively when someone talks about me the way you have.",
            "author": "ApprehensiveInsect1",
            "id": "fw32ise",
            "parent_id": "t1_fw2mcct",
            "score": 4,
            "created_utc": 1593194100.0,
            "replies": [
                {
                    "body": "You realize I've done the same to you that you've done to your SD? So it begets the question, are you looking for honest opinions or a support group? I also don't believe I have insulted your character and I sincerely, genuinely apologize if it came off that way. I'm just saying this whole relationship is toxic and you most certainly are playing a role in that based on this post and these comments.",
                    "author": "otherwise-sorbet03",
                    "id": "fw334cb",
                    "parent_id": "t1_fw32ise",
                    "score": -2,
                    "created_utc": 1593194381.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Erm no. I'm absolutely not making assumptions based on my personal experience, I am on an allowance not PPM and would not be with such a man. I am making 'assumptions' based on the information given, like a sensible person should. 'No honey, no money 😈' is not a text that would be sent by a man who wants a 'traditional SR'\n\nWe can agree that they are mismatched, but you should also check your bias and actually read the facts.",
            "author": "Callie-jay",
            "id": "fw1tjmp",
            "parent_id": "t1_fw1tbb4",
            "score": 5,
            "created_utc": 1593168441.0,
            "replies": [
                {
                    "body": "The blinders you have on are absurd. How is \"no honey no money\" any more or less repugnant than her \"no money no honey?\" Which is basically her argument. She wants more money for more sex. That is not a position that would be taken by a woman who wants a \"traditional SR\"\n\nBOTH are gross imo. She blames all of her bad behavior on \"well his behavior is worse.\" Stop assuming because we disagree that I'm not a sensible person. I admit my biases. You claim yours are facts. Get over yourself.\n\nNo \"facts\" were presented in this thread. The entirety of the thread is the perspective of one person in a two person relationship. Betcha his version of events is pretty different.",
                    "author": "otherwise-sorbet03",
                    "id": "fw1tw7k",
                    "parent_id": "t1_fw1tjmp",
                    "score": -5,
                    "created_utc": 1593168765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahaha albeit clearly too old for an SB 😳😂 <sarcasm>",
            "author": "testing1to3",
            "id": "fw0pt70",
            "parent_id": "t1_fw0ppe4",
            "score": 9,
            "created_utc": 1593136822.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw0qhl7",
                    "parent_id": "t1_fw0pt70",
                    "score": -3,
                    "created_utc": 1593137228.0,
                    "replies": [
                        {
                            "body": "Ewwwwwwww 🤮",
                            "author": "testing1to3",
                            "id": "fw0qp3n",
                            "parent_id": "t1_fw0qhl7",
                            "score": 4,
                            "created_utc": 1593137353.0,
                            "replies": []
                        },
                        {
                            "body": "Who doesn’t love 3 Doors Down though?!",
                            "author": "lasswithaleash",
                            "id": "fw1byg5",
                            "parent_id": "t1_fw0qhl7",
                            "score": 0,
                            "created_utc": 1593151847.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, although I'm not onboard with asking for more for overnights, I can empathize with why OP felt it was necessary. Her SD sounds far from ideal and she clearly treats the SR like a job. If she found someone she genuinely enjoys the company of, I doubt overnights would be an issue.",
            "author": "n0cturnalbaby",
            "id": "fw15ilv",
            "parent_id": "t1_fw0spjs",
            "score": 0,
            "created_utc": 1593146940.0,
            "replies": [
                {
                    "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
                    "author": "AdministrativeLevel9",
                    "id": "fw44kp6",
                    "parent_id": "t1_fw15ilv",
                    "score": 6,
                    "created_utc": 1593213439.0,
                    "replies": [
                        {
                            "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                            "author": "n0cturnalbaby",
                            "id": "fw45mhj",
                            "parent_id": "t1_fw44kp6",
                            "score": 0,
                            "created_utc": 1593214037.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
                    "author": "otherwise-sorbet03",
                    "id": "fw15r8n",
                    "parent_id": "t1_fw15ilv",
                    "score": -4,
                    "created_utc": 1593147112.0,
                    "replies": [
                        {
                            "body": "Agree that SRs shouldn't be treated like a job.",
                            "author": "n0cturnalbaby",
                            "id": "fw15twp",
                            "parent_id": "t1_fw15r8n",
                            "score": -1,
                            "created_utc": 1593147164.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How so?  Should I have started on allownace?  Under what conditions should I transition from ppm to allowance?  \n\nI think I am just describing an SR that is currently transitioning from ppm to allownace.  This happens in almost every long term SR on allownace.  What is incongruent?",
            "author": "willfromvb",
            "id": "fw1thej",
            "parent_id": "t1_fw1taoc",
            "score": -2,
            "created_utc": 1593168382.0,
            "replies": [
                {
                    "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
                    "author": "Callie-jay",
                    "id": "fw1tpc0",
                    "parent_id": "t1_fw1thej",
                    "score": 6,
                    "created_utc": 1593168589.0,
                    "replies": [
                        {
                            "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                            "author": "willfromvb",
                            "id": "fw1u01r",
                            "parent_id": "t1_fw1tpc0",
                            "score": -2,
                            "created_utc": 1593168861.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It certainly is more than that and a ppm allowance  arrangement may be more appropriate than a periodic allowance arrangement for many reasons, but I would never consider a periodic allowance if I had not built trust.\n\nRespect everyone has a different view, but I would never start with a periodic allowance. There are too many rinsers and con artists to do that.  The best con artists are really good at not looking like a con artists and are not easily detected.",
            "author": "willfromvb",
            "id": "fw2rbhv",
            "parent_id": "t1_fw2qwva",
            "score": 1,
            "created_utc": 1593188803.0,
            "replies": []
        },
        {
            "body": "Pretty sure in her edit she clarifies the guy is a dick straight out. Each has their shortcomings but don’t come telling me to stay on topic when I’m replying to someone that is only seeing it one way. Or are you only seeing it that way also? Because I’ve got no problem acknowledging when a girl is being a user.",
            "author": "pumpkinspicedcream",
            "id": "fw1arvm",
            "parent_id": "t1_fw1aem9",
            "score": 10,
            "created_utc": 1593150878.0,
            "replies": [
                {
                    "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
                    "author": null,
                    "id": "fw1b20j",
                    "parent_id": "t1_fw1arvm",
                    "score": -4,
                    "created_utc": 1593151103.0,
                    "replies": [
                        {
                            "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                            "author": "pumpkinspicedcream",
                            "id": "fw1b6kb",
                            "parent_id": "t1_fw1b20j",
                            "score": 8,
                            "created_utc": 1593151205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You realize I've done the same to you that you've done to your SD? So it begets the question, are you looking for honest opinions or a support group? I also don't believe I have insulted your character and I sincerely, genuinely apologize if it came off that way. I'm just saying this whole relationship is toxic and you most certainly are playing a role in that based on this post and these comments.",
            "author": "otherwise-sorbet03",
            "id": "fw334cb",
            "parent_id": "t1_fw32ise",
            "score": -2,
            "created_utc": 1593194381.0,
            "replies": []
        },
        {
            "body": "The blinders you have on are absurd. How is \"no honey no money\" any more or less repugnant than her \"no money no honey?\" Which is basically her argument. She wants more money for more sex. That is not a position that would be taken by a woman who wants a \"traditional SR\"\n\nBOTH are gross imo. She blames all of her bad behavior on \"well his behavior is worse.\" Stop assuming because we disagree that I'm not a sensible person. I admit my biases. You claim yours are facts. Get over yourself.\n\nNo \"facts\" were presented in this thread. The entirety of the thread is the perspective of one person in a two person relationship. Betcha his version of events is pretty different.",
            "author": "otherwise-sorbet03",
            "id": "fw1tw7k",
            "parent_id": "t1_fw1tjmp",
            "score": -5,
            "created_utc": 1593168765.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw0qhl7",
            "parent_id": "t1_fw0pt70",
            "score": -3,
            "created_utc": 1593137228.0,
            "replies": [
                {
                    "body": "Ewwwwwwww 🤮",
                    "author": "testing1to3",
                    "id": "fw0qp3n",
                    "parent_id": "t1_fw0qhl7",
                    "score": 4,
                    "created_utc": 1593137353.0,
                    "replies": []
                },
                {
                    "body": "Who doesn’t love 3 Doors Down though?!",
                    "author": "lasswithaleash",
                    "id": "fw1byg5",
                    "parent_id": "t1_fw0qhl7",
                    "score": 0,
                    "created_utc": 1593151847.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Time is money. In any relationship. And he is super manipulative. Why do u defend him?",
            "author": "AdministrativeLevel9",
            "id": "fw44kp6",
            "parent_id": "t1_fw15ilv",
            "score": 6,
            "created_utc": 1593213439.0,
            "replies": [
                {
                    "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
                    "author": "n0cturnalbaby",
                    "id": "fw45mhj",
                    "parent_id": "t1_fw44kp6",
                    "score": 0,
                    "created_utc": 1593214037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right, but my argument is an SR isn't a job and shouldn't be approached as such. Reading her comments, she was kind of desperate and jumped into a bad arrangement. She's not in an SR",
            "author": "otherwise-sorbet03",
            "id": "fw15r8n",
            "parent_id": "t1_fw15ilv",
            "score": -4,
            "created_utc": 1593147112.0,
            "replies": [
                {
                    "body": "Agree that SRs shouldn't be treated like a job.",
                    "author": "n0cturnalbaby",
                    "id": "fw15twp",
                    "parent_id": "t1_fw15r8n",
                    "score": -1,
                    "created_utc": 1593147164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Should I have started on allowance?\n\nObviously not. \n\nBut by the time you have reached the condition of all the things above (I refer back to Azurecole's description), there should be enough trust in the SB that you don't believe she'd immediately start putting in less effort if she was on a monthly allowance.",
            "author": "Callie-jay",
            "id": "fw1tpc0",
            "parent_id": "t1_fw1thej",
            "score": 6,
            "created_utc": 1593168589.0,
            "replies": [
                {
                    "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
                    "author": "willfromvb",
                    "id": "fw1u01r",
                    "parent_id": "t1_fw1tpc0",
                    "score": -2,
                    "created_utc": 1593168861.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't say that.  I just think we need stop piling on more general comments about SBs and SDs.  Last couple of days have had a lot of crazy back and forth, and we just end up not necessarily helping out an OP if we're all going back and forth at each other for an extended period.\n\nAnd yes, she already admitted it in more recent comments.",
            "author": null,
            "id": "fw1b20j",
            "parent_id": "t1_fw1arvm",
            "score": -4,
            "created_utc": 1593151103.0,
            "replies": [
                {
                    "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
                    "author": "pumpkinspicedcream",
                    "id": "fw1b6kb",
                    "parent_id": "t1_fw1b20j",
                    "score": 8,
                    "created_utc": 1593151205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ewwwwwwww 🤮",
            "author": "testing1to3",
            "id": "fw0qp3n",
            "parent_id": "t1_fw0qhl7",
            "score": 4,
            "created_utc": 1593137353.0,
            "replies": []
        },
        {
            "body": "Who doesn’t love 3 Doors Down though?!",
            "author": "lasswithaleash",
            "id": "fw1byg5",
            "parent_id": "t1_fw0qhl7",
            "score": 0,
            "created_utc": 1593151847.0,
            "replies": []
        },
        {
            "body": "Not sure who you think I'm defending but I had OP's best interest in mind. She should find someone she's attracted to and not enter a relationship with a man she's merely tolerating. The best SRs aren't quid pro quo which ultimately results in an SR feeling ingenuine. And sure time is money but doesn't that go both ways? An SD is also investing his time. In OP's case, the SD is a douche and she should move on.",
            "author": "n0cturnalbaby",
            "id": "fw45mhj",
            "parent_id": "t1_fw44kp6",
            "score": 0,
            "created_utc": 1593214037.0,
            "replies": []
        },
        {
            "body": "Agree that SRs shouldn't be treated like a job.",
            "author": "n0cturnalbaby",
            "id": "fw15twp",
            "parent_id": "t1_fw15r8n",
            "score": -1,
            "created_utc": 1593147164.0,
            "replies": []
        },
        {
            "body": "I agree, but everyone has different set points  for when the trust is high enough to transition to allownace.  \n\nTrust has been described as a bank account.  For every good action, you make deposits.  For every bad deed, you make withdrawls.  Withdrawls are usually much larger than deposits.  \n\nWe may all have different bank account balances needed to move to allowance.",
            "author": "willfromvb",
            "id": "fw1u01r",
            "parent_id": "t1_fw1tpc0",
            "score": -2,
            "created_utc": 1593168861.0,
            "replies": []
        },
        {
            "body": "It wasn’t an extended period. It was only a couple of comments and the commenter I was responding to made a rash generalization of the OP saying she sees her SD as an ATM. Pretty unfair assumption made.",
            "author": "pumpkinspicedcream",
            "id": "fw1b6kb",
            "parent_id": "t1_fw1b20j",
            "score": 8,
            "created_utc": 1593151205.0,
            "replies": []
        }
    ]
}