{
    "title": "He ain’t wrong though",
    "post_id": "p9bv5v",
    "post_url": "https://www.reddit.com/r/dankruto/comments/p9bv5v/he_aint_wrong_though/",
    "author": "Affectionate_Fuel_60",
    "body": "",
    "url": "https://i.redd.it/202fqm9dowi71.jpg",
    "score": 4499,
    "upvote_ratio": 0.98,
    "created_utc": 1629636464.0,
    "num_comments": 72,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "So, he's a \"guardian\" of that galaxy?",
            "author": null,
            "id": "h9wk27e",
            "parent_id": "t3_p9bv5v",
            "score": 242,
            "created_utc": 1629636761.0,
            "replies": [
                {
                    "body": "Oh you sly dog",
                    "author": "Elion_",
                    "id": "h9wri3v",
                    "parent_id": "t1_h9wk27e",
                    "score": 63,
                    "created_utc": 1629640781.0,
                    "replies": [
                        {
                            "body": "Im fairly sure he's just CGI...",
                            "author": "InternetPopulism",
                            "id": "h9wyh2v",
                            "parent_id": "t1_h9wri3v",
                            "score": 42,
                            "created_utc": 1629644051.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Nope thats the people working security at Samsung’s stores",
                    "author": "mo-did",
                    "id": "h9yer45",
                    "parent_id": "t1_h9wk27e",
                    "score": 14,
                    "created_utc": 1629666816.0,
                    "replies": []
                },
                {
                    "body": "He’s just holding onto it.",
                    "author": null,
                    "id": "h9yvxlw",
                    "parent_id": "t1_h9wk27e",
                    "score": 3,
                    "created_utc": 1629674802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idk, easy clap for tenten",
            "author": "pranamya2005",
            "id": "h9x46lv",
            "parent_id": "t3_p9bv5v",
            "score": 91,
            "created_utc": 1629646615.0,
            "replies": [
                {
                    "body": "Tenten can take him",
                    "author": "LikeQueHombre",
                    "id": "h9z11p6",
                    "parent_id": "t1_h9x46lv",
                    "score": 8,
                    "created_utc": 1629677288.0,
                    "replies": [
                        {
                            "body": "In a fight right?",
                            "author": "ResidentGood2",
                            "id": "h9zqosb",
                            "parent_id": "t1_h9z11p6",
                            "score": 11,
                            "created_utc": 1629690403.0,
                            "replies": [
                                {
                                    "body": "Of course",
                                    "author": "LikeQueHombre",
                                    "id": "h9zxgg5",
                                    "parent_id": "t1_h9zqosb",
                                    "score": 6,
                                    "created_utc": 1629694538.0,
                                    "replies": [
                                        {
                                            "body": "You could've chosen to regress through the Anakin Smirk",
                                            "author": "ResidentGood2",
                                            "id": "ha07thv",
                                            "parent_id": "t1_h9zxgg5",
                                            "score": 2,
                                            "created_utc": 1629702334.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Tenten solos",
                    "author": "ssnoopy2222",
                    "id": "h9zsfo2",
                    "parent_id": "t1_h9x46lv",
                    "score": 7,
                    "created_utc": 1629691419.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Row row fight the power",
            "author": "Pf_Farnsworth",
            "id": "h9x0my3",
            "parent_id": "t3_p9bv5v",
            "score": 67,
            "created_utc": 1629645015.0,
            "replies": [
                {
                    "body": "Your drill is the drill that will pierce the heavens",
                    "author": "Yamisallblackforces",
                    "id": "h9z5fgh",
                    "parent_id": "t1_h9x0my3",
                    "score": 8,
                    "created_utc": 1629679458.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tbh I did think that was a rasenshuriken as well lol",
            "author": "ilongforyesterday",
            "id": "h9wsm72",
            "parent_id": "t3_p9bv5v",
            "score": 114,
            "created_utc": 1629641329.0,
            "replies": []
        },
        {
            "body": "so its a real action Tengen Toppa Gurren Lagann?",
            "author": "LilQuasar",
            "id": "h9xwuje",
            "parent_id": "t3_p9bv5v",
            "score": 43,
            "created_utc": 1629658902.0,
            "replies": [
                {
                    "body": "Was about to say. Gurren Lagann tho.",
                    "author": "LeaveMeAloneLorenzo",
                    "id": "h9yut3m",
                    "parent_id": "t1_h9xwuje",
                    "score": 10,
                    "created_utc": 1629674263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Beuh they usually nerf  characters in the MCU bit they're doing the opposite for the celestials. When Galactus comes in, he'll look kinda dumb",
            "author": "nazitouinz",
            "id": "h9y3m1t",
            "parent_id": "t3_p9bv5v",
            "score": 33,
            "created_utc": 1629661863.0,
            "replies": [
                {
                    "body": "Galactus is far weaker than the celestials, one has been beaten by an elastic man the other is a match for the guy who made Galactus his pet",
                    "author": "thewiburi",
                    "id": "h9yy2fw",
                    "parent_id": "t1_h9y3m1t",
                    "score": 6,
                    "created_utc": 1629675835.0,
                    "replies": [
                        {
                            "body": "Mister Fantastic has never beaten Galactus, and he only face him in his weakest form. Galactus is the first living thing in the universe and the last from the previous one. His fully fed form can destroy many galaxies with a single blast. \nAnd Future Franklin Richard never has Galactus as a pet. He just handed Somme of his powers to him as he was in a weakened state, making Galactus Franklin's herald for a few minutes. Plus if you actually saw this story, you would know that This happened as Galactus in a form far from his best was facing 3 celestials at once and winning. They then had to fuse to put him in trouble. But one single celestial doesn't stand a chance against Galactus.",
                            "author": "nazitouinz",
                            "id": "h9z201d",
                            "parent_id": "t1_h9yy2fw",
                            "score": 7,
                            "created_utc": 1629677757.0,
                            "replies": [
                                {
                                    "body": "Ok i stand corrected",
                                    "author": "thewiburi",
                                    "id": "h9z2eqs",
                                    "parent_id": "t1_h9z201d",
                                    "score": 4,
                                    "created_utc": 1629677959.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We can’t be totally sure that Naruto isn’t hurling little galaxies at people, wiping out billions or trillions of lives each time he uses that technique",
            "author": "SendMeRobotFeetPics",
            "id": "h9xcxct",
            "parent_id": "t3_p9bv5v",
            "score": 47,
            "created_utc": 1629650332.0,
            "replies": [
                {
                    "body": "He 100% is wiping out billions or trillions of lives. RIP the microbes in the way of his technique",
                    "author": null,
                    "id": "h9yn36k",
                    "parent_id": "t1_h9xcxct",
                    "score": 22,
                    "created_utc": 1629670592.0,
                    "replies": [
                        {
                            "body": "If you wanna get even deeper:\n\nYour body is not you. It is hundreds of trillions of cells and neurons working together to form a single organism. You are only your mind and soul that inhabit that organism. That said, the rasenshuriken destroys things down to a molecular level. Meaning all the cells that make up your body, all get wiped out when hit with the attack. Meaning yes, every time he uses it, regardless of if it lands or not, many living things are dying",
                            "author": "MrStarfishyYT",
                            "id": "h9yr6i6",
                            "parent_id": "t1_h9yn36k",
                            "score": 10,
                            "created_utc": 1629672525.0,
                            "replies": [
                                {
                                    "body": "True. I knew naruto wasn't the good guy he looks like. The main villain is boruto is the king of cells, who can manipulate other cells. He had a grudge against naruto and is know after his son too.",
                                    "author": null,
                                    "id": "h9ysibh",
                                    "parent_id": "t1_h9yr6i6",
                                    "score": 4,
                                    "created_utc": 1629673155.0,
                                    "replies": []
                                },
                                {
                                    "body": "Just your mind, there is no such thing as souls.",
                                    "author": "Money_Enthusiast_",
                                    "id": "ha0h52m",
                                    "parent_id": "t1_h9yr6i6",
                                    "score": 1,
                                    "created_utc": 1629710560.0,
                                    "replies": [
                                        {
                                            "body": "I mean it's a pretty well accepted fact by society that the soul exists. However what it exactly is, we haven't figured out as we have no means of interacting with it(on a physical spectrum anyway)",
                                            "author": "MrStarfishyYT",
                                            "id": "ha0heel",
                                            "parent_id": "t1_ha0h52m",
                                            "score": 1,
                                            "created_utc": 1629710794.0,
                                            "replies": [
                                                {
                                                    "body": "No, it's not. There is no evidence supporting it being real. There is only our physical reality, that's it. Practically all scientists don't believe souls exist.",
                                                    "author": "Money_Enthusiast_",
                                                    "id": "ha0hj0y",
                                                    "parent_id": "t1_ha0heel",
                                                    "score": 2,
                                                    "created_utc": 1629710907.0,
                                                    "replies": [
                                                        {
                                                            "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
                                                            "author": "MrStarfishyYT",
                                                            "id": "ha0jg6c",
                                                            "parent_id": "t1_ha0hj0y",
                                                            "score": 1,
                                                            "created_utc": 1629712563.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                                                                    "author": "Money_Enthusiast_",
                                                                    "id": "ha0jzmg",
                                                                    "parent_id": "t1_ha0jg6c",
                                                                    "score": 2,
                                                                    "created_utc": 1629713025.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                                                                            "author": "MrStarfishyYT",
                                                                            "id": "ha3js9y",
                                                                            "parent_id": "t1_ha0jzmg",
                                                                            "score": 0,
                                                                            "created_utc": 1629762851.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                                                                    "author": "Money_Enthusiast_",
                                                                                    "id": "ha3lfqy",
                                                                                    "parent_id": "t1_ha3js9y",
                                                                                    "score": 2,
                                                                                    "created_utc": 1629763626.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                                                                            "author": "MrStarfishyYT",
                                                                                            "id": "ha3spzc",
                                                                                            "parent_id": "t1_ha3lfqy",
                                                                                            "score": 0,
                                                                                            "created_utc": 1629766919.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                                                                    "author": "Money_Enthusiast_",
                                                                                                    "id": "ha3v3xx",
                                                                                                    "parent_id": "t1_ha3spzc",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1629767986.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That isn't Wind Style, That's a Planetary Rasen Shuriken",
            "author": "mahmudnmg",
            "id": "h9y0ssa",
            "parent_id": "t3_p9bv5v",
            "score": 20,
            "created_utc": 1629660616.0,
            "replies": []
        },
        {
            "body": "Still weaker than Goku",
            "author": "SexWithFischl69",
            "id": "h9y2b0y",
            "parent_id": "t3_p9bv5v",
            "score": 8,
            "created_utc": 1629661279.0,
            "replies": [
                {
                    "body": "Alioth says hello 👋",
                    "author": "Affectionate_Fuel_60",
                    "id": "h9y3v2w",
                    "parent_id": "t1_h9y2b0y",
                    "score": 3,
                    "created_utc": 1629661975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Team Dai-Gurren in the MCU confirmed",
            "author": "TheRancidFit",
            "id": "h9y5g8h",
            "parent_id": "t3_p9bv5v",
            "score": 7,
            "created_utc": 1629662681.0,
            "replies": []
        },
        {
            "body": "Huh, guess Ego must of been the runt of the litter among the Celestials.",
            "author": "Masked_Raider",
            "id": "h9yizat",
            "parent_id": "t3_p9bv5v",
            "score": 5,
            "created_utc": 1629668729.0,
            "replies": [
                {
                    "body": "I understand you not, guess ego wilt of been the runt of the litter 'mongst the celestials\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                    "author": "Shakespeare-Bot",
                    "id": "h9yj0dn",
                    "parent_id": "t1_h9yizat",
                    "score": -2,
                    "created_utc": 1629668742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He ain’t beatin goku tho",
            "author": null,
            "id": "h9yt57g",
            "parent_id": "t3_p9bv5v",
            "score": 6,
            "created_utc": 1629673460.0,
            "replies": [
                {
                    "body": "Stfu",
                    "author": "FlochYeager",
                    "id": "h9zhq1x",
                    "parent_id": "t1_h9yt57g",
                    "score": 2,
                    "created_utc": 1629685549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Isn’t this just the end of gurren lagann?",
            "author": "Jackson_M_Bueller",
            "id": "h9zapar",
            "parent_id": "t3_p9bv5v",
            "score": 4,
            "created_utc": 1629682044.0,
            "replies": []
        },
        {
            "body": "Maybe he’s holding the boruto version of it from that one dumb filler",
            "author": "mo-did",
            "id": "h9yekwl",
            "parent_id": "t3_p9bv5v",
            "score": 3,
            "created_utc": 1629666738.0,
            "replies": []
        },
        {
            "body": "Damn rasen shuriken of planets and black holes",
            "author": "peepeepoopoo_the_1",
            "id": "h9z2ku3",
            "parent_id": "t3_p9bv5v",
            "score": 2,
            "created_utc": 1629678044.0,
            "replies": []
        },
        {
            "body": "this shit looks so boring",
            "author": "TheWombatFromHell",
            "id": "h9xj7fk",
            "parent_id": "t3_p9bv5v",
            "score": 5,
            "created_utc": 1629653006.0,
            "replies": []
        },
        {
            "body": "whatever that movie is looks boring as hell.",
            "author": "hux002",
            "id": "h9xscis",
            "parent_id": "t3_p9bv5v",
            "score": 3,
            "created_utc": 1629656946.0,
            "replies": []
        },
        {
            "body": "Totally ripped from Naruto, I don't care what is said, Marvel has bored me since End Game. Not End Game itself but this would make it more fun",
            "author": "Cloakbot",
            "id": "h9z7slf",
            "parent_id": "t3_p9bv5v",
            "score": 1,
            "created_utc": 1629680611.0,
            "replies": [
                {
                    "body": "Here's a joke! Teacher: Why are you doing your multiplication on the floor?\nStudent: You told me not to use tables.",
                    "author": "comfort_bot_1962",
                    "id": "h9zaxyn",
                    "parent_id": "t1_h9z7slf",
                    "score": 4,
                    "created_utc": 1629682164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Funny how naruto still solos",
            "author": "Jealous_Shame6908",
            "id": "h9x609w",
            "parent_id": "t3_p9bv5v",
            "score": -16,
            "created_utc": 1629647403.0,
            "replies": [
                {
                    "body": "How? I never saw Naruto holding a galaxy in his palm or something like that.",
                    "author": "Ok_Context_9891",
                    "id": "h9x656r",
                    "parent_id": "t1_h9x609w",
                    "score": 20,
                    "created_utc": 1629647460.0,
                    "replies": [
                        {
                            "body": "Naruto can talk",
                            "author": null,
                            "id": "h9xc8uv",
                            "parent_id": "t1_h9x656r",
                            "score": 48,
                            "created_utc": 1629650043.0,
                            "replies": []
                        },
                        {
                            "body": "Base naruto is shown to be boundless and that's a low ball tbh",
                            "author": "Jealous_Shame6908",
                            "id": "ha2eh56",
                            "parent_id": "t1_h9x656r",
                            "score": 1,
                            "created_utc": 1629745268.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those are Celestials, not eternals.",
            "author": "ZoneFan666",
            "id": "h9yv57d",
            "parent_id": "t3_p9bv5v",
            "score": 0,
            "created_utc": 1629674424.0,
            "replies": [
                {
                    "body": "It says celestials?",
                    "author": "PatchyThePirate159",
                    "id": "ha01pdd",
                    "parent_id": "t1_h9yv57d",
                    "score": 2,
                    "created_utc": 1629697507.0,
                    "replies": []
                },
                {
                    "body": "They literally say that they are celestials lol who are you correcting",
                    "author": "LeSnazzyGamer",
                    "id": "ha0ymkt",
                    "parent_id": "t1_h9yv57d",
                    "score": 1,
                    "created_utc": 1629722927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And.. wow you guessed it.. the HEROES save the day again. Wooo.. god this shit is boring",
            "author": "Metalona",
            "id": "h9x7n27",
            "parent_id": "t3_p9bv5v",
            "score": -27,
            "created_utc": 1629648102.0,
            "replies": [
                {
                    "body": "Isn’t that the theme of Naruto as well though? or more precisely pretty much every story it’s just how the author portrays it that sells it to the crowd and MCU does a frickin amazing job at that.",
                    "author": "Affectionate_Fuel_60",
                    "id": "h9x981o",
                    "parent_id": "t1_h9x7n27",
                    "score": 33,
                    "created_utc": 1629648766.0,
                    "replies": [
                        {
                            "body": "Arguably. We get the views of both the good, Naruto, and the bad (at the time), sasuke. Without prior knowledge of watching the show, everything was insane to see at the time. From Naruto kicking an akatsuki members ass that murdered Gaara, to Sasuke overpowering OROCHIMARU and even stealing the power. Then their lines keep going. Marvel, capcom sort of comics are moreso about making the reader feel good and fuzzy by seeing some action, and always knowing the good guys gonna win. Personally, im not a huge fan of that, as its hella unrealistic. But, like i said, thats my own opinion",
                            "author": "Metalona",
                            "id": "h9xalk1",
                            "parent_id": "t1_h9x981o",
                            "score": -14,
                            "created_utc": 1629649345.0,
                            "replies": [
                                {
                                    "body": "I wouldn’t call what happened in Infinity War and Endgame a win really. I think it was a great way to show even in the MCU, sometimes the good guys don’t always win.",
                                    "author": "Nurpless",
                                    "id": "h9xjh3x",
                                    "parent_id": "t1_h9xalk1",
                                    "score": 10,
                                    "created_utc": 1629653119.0,
                                    "replies": [
                                        {
                                            "body": "Even civil war as well MCU has plenty of villains similar to anime villains in terms of their backstory and not some generic bad guy",
                                            "author": "Yamisallblackforces",
                                            "id": "h9z5y4c",
                                            "parent_id": "t1_h9xjh3x",
                                            "score": 1,
                                            "created_utc": 1629679707.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "did you watch Infinity War and Endgame? the heroes couldnt save the day...\n\nweird saying that in a Naruto sub too",
                    "author": "LilQuasar",
                    "id": "h9xwq87",
                    "parent_id": "t1_h9x7n27",
                    "score": 3,
                    "created_utc": 1629658848.0,
                    "replies": [
                        {
                            "body": "Umm, did YOU watch Endgame? The heroes saved the day.",
                            "author": "SnoopyGoldberg",
                            "id": "h9y3pzl",
                            "parent_id": "t1_h9xwq87",
                            "score": 0,
                            "created_utc": 1629661912.0,
                            "replies": [
                                {
                                    "body": "Yeah and people still died? There was still stakes to be lost considering they lost the previous movie? If you're making the argument of \"the good guys win so it's boring\" then Shonen anime must be torture to  you",
                                    "author": "TheRancidFit",
                                    "id": "h9y5d76",
                                    "parent_id": "t1_h9y3pzl",
                                    "score": 4,
                                    "created_utc": 1629662644.0,
                                    "replies": [
                                        {
                                            "body": "I never made that argument, I’m saying that using Endgame as an example of a movie where the heroes didn’t save the day is wrong. People dying in the process doesn’t mean that the Avengers didn’t ultimately save the world from Thanos, which is the very definition of the heroes saving the day.",
                                            "author": "SnoopyGoldberg",
                                            "id": "h9yidtg",
                                            "parent_id": "t1_h9y5d76",
                                            "score": 1,
                                            "created_utc": 1629668462.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "they beat Thanos. they definitely didnt save the day, a lot of people died and the consequences were awful as shown by the following shows",
                                    "author": "LilQuasar",
                                    "id": "h9y74xa",
                                    "parent_id": "t1_h9y3pzl",
                                    "score": 1,
                                    "created_utc": 1629663428.0,
                                    "replies": [
                                        {
                                            "body": "Bro, they undid the snap and revived half of the universe, how is that not considered saving the day? Just because there were consequences afterwards doesn’t mean that they didn’t fix their current most urgent situation. \n\nThey made more Star Wars that took place after the original trilogy, that doesn’t mean Luke Skywalker didn’t save the day in Return of the Jedi.",
                                            "author": "SnoopyGoldberg",
                                            "id": "h9yjgev",
                                            "parent_id": "t1_h9y74xa",
                                            "score": 0,
                                            "created_utc": 1629668942.0,
                                            "replies": [
                                                {
                                                    "body": "because of the timelines? because of losing half of the original Avengers, including the most important ones? how they undid the snap and revived half of the universe is important, theres was still 5 years of snap that caused a lot of problems\n\nwho said that making more Avengers / Marvel stuff means they didnt save the day? its whats happening in them that shows \"saving\" isnt accurate at all",
                                                    "author": "LilQuasar",
                                                    "id": "h9yo7u5",
                                                    "parent_id": "t1_h9yjgev",
                                                    "score": 0,
                                                    "created_utc": 1629671113.0,
                                                    "replies": [
                                                        {
                                                            "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
                                                            "author": "SnoopyGoldberg",
                                                            "id": "h9z8kuz",
                                                            "parent_id": "t1_h9yo7u5",
                                                            "score": 0,
                                                            "created_utc": 1629680997.0,
                                                            "replies": [
                                                                {
                                                                    "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                                                                    "author": "LilQuasar",
                                                                    "id": "h9zcoms",
                                                                    "parent_id": "t1_h9z8kuz",
                                                                    "score": 0,
                                                                    "created_utc": 1629683029.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                                                                            "author": "SnoopyGoldberg",
                                                                            "id": "h9zh7m9",
                                                                            "parent_id": "t1_h9zcoms",
                                                                            "score": 1,
                                                                            "created_utc": 1629685290.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So naruto is also a  celestial.",
            "author": "flaming0_101",
            "id": "h9zljxj",
            "parent_id": "t3_p9bv5v",
            "score": 1,
            "created_utc": 1629687544.0,
            "replies": []
        },
        {
            "body": "Wow, monster that destroys the earth in 30 minute ago shitfest isn't big and dumb enough anymore. Let's go bigger and dumber and do the same thing but with galaxy monsters!",
            "author": null,
            "id": "ha08joi",
            "parent_id": "t3_p9bv5v",
            "score": 1,
            "created_utc": 1629702948.0,
            "replies": []
        },
        {
            "body": "Oh you sly dog",
            "author": "Elion_",
            "id": "h9wri3v",
            "parent_id": "t1_h9wk27e",
            "score": 63,
            "created_utc": 1629640781.0,
            "replies": [
                {
                    "body": "Im fairly sure he's just CGI...",
                    "author": "InternetPopulism",
                    "id": "h9wyh2v",
                    "parent_id": "t1_h9wri3v",
                    "score": 42,
                    "created_utc": 1629644051.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope thats the people working security at Samsung’s stores",
            "author": "mo-did",
            "id": "h9yer45",
            "parent_id": "t1_h9wk27e",
            "score": 14,
            "created_utc": 1629666816.0,
            "replies": []
        },
        {
            "body": "He’s just holding onto it.",
            "author": null,
            "id": "h9yvxlw",
            "parent_id": "t1_h9wk27e",
            "score": 3,
            "created_utc": 1629674802.0,
            "replies": []
        },
        {
            "body": "Tenten can take him",
            "author": "LikeQueHombre",
            "id": "h9z11p6",
            "parent_id": "t1_h9x46lv",
            "score": 8,
            "created_utc": 1629677288.0,
            "replies": [
                {
                    "body": "In a fight right?",
                    "author": "ResidentGood2",
                    "id": "h9zqosb",
                    "parent_id": "t1_h9z11p6",
                    "score": 11,
                    "created_utc": 1629690403.0,
                    "replies": [
                        {
                            "body": "Of course",
                            "author": "LikeQueHombre",
                            "id": "h9zxgg5",
                            "parent_id": "t1_h9zqosb",
                            "score": 6,
                            "created_utc": 1629694538.0,
                            "replies": [
                                {
                                    "body": "You could've chosen to regress through the Anakin Smirk",
                                    "author": "ResidentGood2",
                                    "id": "ha07thv",
                                    "parent_id": "t1_h9zxgg5",
                                    "score": 2,
                                    "created_utc": 1629702334.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tenten solos",
            "author": "ssnoopy2222",
            "id": "h9zsfo2",
            "parent_id": "t1_h9x46lv",
            "score": 7,
            "created_utc": 1629691419.0,
            "replies": []
        },
        {
            "body": "Your drill is the drill that will pierce the heavens",
            "author": "Yamisallblackforces",
            "id": "h9z5fgh",
            "parent_id": "t1_h9x0my3",
            "score": 8,
            "created_utc": 1629679458.0,
            "replies": []
        },
        {
            "body": "Was about to say. Gurren Lagann tho.",
            "author": "LeaveMeAloneLorenzo",
            "id": "h9yut3m",
            "parent_id": "t1_h9xwuje",
            "score": 10,
            "created_utc": 1629674263.0,
            "replies": []
        },
        {
            "body": "Galactus is far weaker than the celestials, one has been beaten by an elastic man the other is a match for the guy who made Galactus his pet",
            "author": "thewiburi",
            "id": "h9yy2fw",
            "parent_id": "t1_h9y3m1t",
            "score": 6,
            "created_utc": 1629675835.0,
            "replies": [
                {
                    "body": "Mister Fantastic has never beaten Galactus, and he only face him in his weakest form. Galactus is the first living thing in the universe and the last from the previous one. His fully fed form can destroy many galaxies with a single blast. \nAnd Future Franklin Richard never has Galactus as a pet. He just handed Somme of his powers to him as he was in a weakened state, making Galactus Franklin's herald for a few minutes. Plus if you actually saw this story, you would know that This happened as Galactus in a form far from his best was facing 3 celestials at once and winning. They then had to fuse to put him in trouble. But one single celestial doesn't stand a chance against Galactus.",
                    "author": "nazitouinz",
                    "id": "h9z201d",
                    "parent_id": "t1_h9yy2fw",
                    "score": 7,
                    "created_utc": 1629677757.0,
                    "replies": [
                        {
                            "body": "Ok i stand corrected",
                            "author": "thewiburi",
                            "id": "h9z2eqs",
                            "parent_id": "t1_h9z201d",
                            "score": 4,
                            "created_utc": 1629677959.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He 100% is wiping out billions or trillions of lives. RIP the microbes in the way of his technique",
            "author": null,
            "id": "h9yn36k",
            "parent_id": "t1_h9xcxct",
            "score": 22,
            "created_utc": 1629670592.0,
            "replies": [
                {
                    "body": "If you wanna get even deeper:\n\nYour body is not you. It is hundreds of trillions of cells and neurons working together to form a single organism. You are only your mind and soul that inhabit that organism. That said, the rasenshuriken destroys things down to a molecular level. Meaning all the cells that make up your body, all get wiped out when hit with the attack. Meaning yes, every time he uses it, regardless of if it lands or not, many living things are dying",
                    "author": "MrStarfishyYT",
                    "id": "h9yr6i6",
                    "parent_id": "t1_h9yn36k",
                    "score": 10,
                    "created_utc": 1629672525.0,
                    "replies": [
                        {
                            "body": "True. I knew naruto wasn't the good guy he looks like. The main villain is boruto is the king of cells, who can manipulate other cells. He had a grudge against naruto and is know after his son too.",
                            "author": null,
                            "id": "h9ysibh",
                            "parent_id": "t1_h9yr6i6",
                            "score": 4,
                            "created_utc": 1629673155.0,
                            "replies": []
                        },
                        {
                            "body": "Just your mind, there is no such thing as souls.",
                            "author": "Money_Enthusiast_",
                            "id": "ha0h52m",
                            "parent_id": "t1_h9yr6i6",
                            "score": 1,
                            "created_utc": 1629710560.0,
                            "replies": [
                                {
                                    "body": "I mean it's a pretty well accepted fact by society that the soul exists. However what it exactly is, we haven't figured out as we have no means of interacting with it(on a physical spectrum anyway)",
                                    "author": "MrStarfishyYT",
                                    "id": "ha0heel",
                                    "parent_id": "t1_ha0h52m",
                                    "score": 1,
                                    "created_utc": 1629710794.0,
                                    "replies": [
                                        {
                                            "body": "No, it's not. There is no evidence supporting it being real. There is only our physical reality, that's it. Practically all scientists don't believe souls exist.",
                                            "author": "Money_Enthusiast_",
                                            "id": "ha0hj0y",
                                            "parent_id": "t1_ha0heel",
                                            "score": 2,
                                            "created_utc": 1629710907.0,
                                            "replies": [
                                                {
                                                    "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
                                                    "author": "MrStarfishyYT",
                                                    "id": "ha0jg6c",
                                                    "parent_id": "t1_ha0hj0y",
                                                    "score": 1,
                                                    "created_utc": 1629712563.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                                                            "author": "Money_Enthusiast_",
                                                            "id": "ha0jzmg",
                                                            "parent_id": "t1_ha0jg6c",
                                                            "score": 2,
                                                            "created_utc": 1629713025.0,
                                                            "replies": [
                                                                {
                                                                    "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                                                                    "author": "MrStarfishyYT",
                                                                    "id": "ha3js9y",
                                                                    "parent_id": "t1_ha0jzmg",
                                                                    "score": 0,
                                                                    "created_utc": 1629762851.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                                                            "author": "Money_Enthusiast_",
                                                                            "id": "ha3lfqy",
                                                                            "parent_id": "t1_ha3js9y",
                                                                            "score": 2,
                                                                            "created_utc": 1629763626.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                                                                    "author": "MrStarfishyYT",
                                                                                    "id": "ha3spzc",
                                                                                    "parent_id": "t1_ha3lfqy",
                                                                                    "score": 0,
                                                                                    "created_utc": 1629766919.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                                                            "author": "Money_Enthusiast_",
                                                                                            "id": "ha3v3xx",
                                                                                            "parent_id": "t1_ha3spzc",
                                                                                            "score": 2,
                                                                                            "created_utc": 1629767986.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Alioth says hello 👋",
            "author": "Affectionate_Fuel_60",
            "id": "h9y3v2w",
            "parent_id": "t1_h9y2b0y",
            "score": 3,
            "created_utc": 1629661975.0,
            "replies": []
        },
        {
            "body": "I understand you not, guess ego wilt of been the runt of the litter 'mongst the celestials\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
            "author": "Shakespeare-Bot",
            "id": "h9yj0dn",
            "parent_id": "t1_h9yizat",
            "score": -2,
            "created_utc": 1629668742.0,
            "replies": []
        },
        {
            "body": "Stfu",
            "author": "FlochYeager",
            "id": "h9zhq1x",
            "parent_id": "t1_h9yt57g",
            "score": 2,
            "created_utc": 1629685549.0,
            "replies": []
        },
        {
            "body": "Here's a joke! Teacher: Why are you doing your multiplication on the floor?\nStudent: You told me not to use tables.",
            "author": "comfort_bot_1962",
            "id": "h9zaxyn",
            "parent_id": "t1_h9z7slf",
            "score": 4,
            "created_utc": 1629682164.0,
            "replies": []
        },
        {
            "body": "How? I never saw Naruto holding a galaxy in his palm or something like that.",
            "author": "Ok_Context_9891",
            "id": "h9x656r",
            "parent_id": "t1_h9x609w",
            "score": 20,
            "created_utc": 1629647460.0,
            "replies": [
                {
                    "body": "Naruto can talk",
                    "author": null,
                    "id": "h9xc8uv",
                    "parent_id": "t1_h9x656r",
                    "score": 48,
                    "created_utc": 1629650043.0,
                    "replies": []
                },
                {
                    "body": "Base naruto is shown to be boundless and that's a low ball tbh",
                    "author": "Jealous_Shame6908",
                    "id": "ha2eh56",
                    "parent_id": "t1_h9x656r",
                    "score": 1,
                    "created_utc": 1629745268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It says celestials?",
            "author": "PatchyThePirate159",
            "id": "ha01pdd",
            "parent_id": "t1_h9yv57d",
            "score": 2,
            "created_utc": 1629697507.0,
            "replies": []
        },
        {
            "body": "They literally say that they are celestials lol who are you correcting",
            "author": "LeSnazzyGamer",
            "id": "ha0ymkt",
            "parent_id": "t1_h9yv57d",
            "score": 1,
            "created_utc": 1629722927.0,
            "replies": []
        },
        {
            "body": "Isn’t that the theme of Naruto as well though? or more precisely pretty much every story it’s just how the author portrays it that sells it to the crowd and MCU does a frickin amazing job at that.",
            "author": "Affectionate_Fuel_60",
            "id": "h9x981o",
            "parent_id": "t1_h9x7n27",
            "score": 33,
            "created_utc": 1629648766.0,
            "replies": [
                {
                    "body": "Arguably. We get the views of both the good, Naruto, and the bad (at the time), sasuke. Without prior knowledge of watching the show, everything was insane to see at the time. From Naruto kicking an akatsuki members ass that murdered Gaara, to Sasuke overpowering OROCHIMARU and even stealing the power. Then their lines keep going. Marvel, capcom sort of comics are moreso about making the reader feel good and fuzzy by seeing some action, and always knowing the good guys gonna win. Personally, im not a huge fan of that, as its hella unrealistic. But, like i said, thats my own opinion",
                    "author": "Metalona",
                    "id": "h9xalk1",
                    "parent_id": "t1_h9x981o",
                    "score": -14,
                    "created_utc": 1629649345.0,
                    "replies": [
                        {
                            "body": "I wouldn’t call what happened in Infinity War and Endgame a win really. I think it was a great way to show even in the MCU, sometimes the good guys don’t always win.",
                            "author": "Nurpless",
                            "id": "h9xjh3x",
                            "parent_id": "t1_h9xalk1",
                            "score": 10,
                            "created_utc": 1629653119.0,
                            "replies": [
                                {
                                    "body": "Even civil war as well MCU has plenty of villains similar to anime villains in terms of their backstory and not some generic bad guy",
                                    "author": "Yamisallblackforces",
                                    "id": "h9z5y4c",
                                    "parent_id": "t1_h9xjh3x",
                                    "score": 1,
                                    "created_utc": 1629679707.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "did you watch Infinity War and Endgame? the heroes couldnt save the day...\n\nweird saying that in a Naruto sub too",
            "author": "LilQuasar",
            "id": "h9xwq87",
            "parent_id": "t1_h9x7n27",
            "score": 3,
            "created_utc": 1629658848.0,
            "replies": [
                {
                    "body": "Umm, did YOU watch Endgame? The heroes saved the day.",
                    "author": "SnoopyGoldberg",
                    "id": "h9y3pzl",
                    "parent_id": "t1_h9xwq87",
                    "score": 0,
                    "created_utc": 1629661912.0,
                    "replies": [
                        {
                            "body": "Yeah and people still died? There was still stakes to be lost considering they lost the previous movie? If you're making the argument of \"the good guys win so it's boring\" then Shonen anime must be torture to  you",
                            "author": "TheRancidFit",
                            "id": "h9y5d76",
                            "parent_id": "t1_h9y3pzl",
                            "score": 4,
                            "created_utc": 1629662644.0,
                            "replies": [
                                {
                                    "body": "I never made that argument, I’m saying that using Endgame as an example of a movie where the heroes didn’t save the day is wrong. People dying in the process doesn’t mean that the Avengers didn’t ultimately save the world from Thanos, which is the very definition of the heroes saving the day.",
                                    "author": "SnoopyGoldberg",
                                    "id": "h9yidtg",
                                    "parent_id": "t1_h9y5d76",
                                    "score": 1,
                                    "created_utc": 1629668462.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "they beat Thanos. they definitely didnt save the day, a lot of people died and the consequences were awful as shown by the following shows",
                            "author": "LilQuasar",
                            "id": "h9y74xa",
                            "parent_id": "t1_h9y3pzl",
                            "score": 1,
                            "created_utc": 1629663428.0,
                            "replies": [
                                {
                                    "body": "Bro, they undid the snap and revived half of the universe, how is that not considered saving the day? Just because there were consequences afterwards doesn’t mean that they didn’t fix their current most urgent situation. \n\nThey made more Star Wars that took place after the original trilogy, that doesn’t mean Luke Skywalker didn’t save the day in Return of the Jedi.",
                                    "author": "SnoopyGoldberg",
                                    "id": "h9yjgev",
                                    "parent_id": "t1_h9y74xa",
                                    "score": 0,
                                    "created_utc": 1629668942.0,
                                    "replies": [
                                        {
                                            "body": "because of the timelines? because of losing half of the original Avengers, including the most important ones? how they undid the snap and revived half of the universe is important, theres was still 5 years of snap that caused a lot of problems\n\nwho said that making more Avengers / Marvel stuff means they didnt save the day? its whats happening in them that shows \"saving\" isnt accurate at all",
                                            "author": "LilQuasar",
                                            "id": "h9yo7u5",
                                            "parent_id": "t1_h9yjgev",
                                            "score": 0,
                                            "created_utc": 1629671113.0,
                                            "replies": [
                                                {
                                                    "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
                                                    "author": "SnoopyGoldberg",
                                                    "id": "h9z8kuz",
                                                    "parent_id": "t1_h9yo7u5",
                                                    "score": 0,
                                                    "created_utc": 1629680997.0,
                                                    "replies": [
                                                        {
                                                            "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                                                            "author": "LilQuasar",
                                                            "id": "h9zcoms",
                                                            "parent_id": "t1_h9z8kuz",
                                                            "score": 0,
                                                            "created_utc": 1629683029.0,
                                                            "replies": [
                                                                {
                                                                    "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                                                                    "author": "SnoopyGoldberg",
                                                                    "id": "h9zh7m9",
                                                                    "parent_id": "t1_h9zcoms",
                                                                    "score": 1,
                                                                    "created_utc": 1629685290.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im fairly sure he's just CGI...",
            "author": "InternetPopulism",
            "id": "h9wyh2v",
            "parent_id": "t1_h9wri3v",
            "score": 42,
            "created_utc": 1629644051.0,
            "replies": []
        },
        {
            "body": "In a fight right?",
            "author": "ResidentGood2",
            "id": "h9zqosb",
            "parent_id": "t1_h9z11p6",
            "score": 11,
            "created_utc": 1629690403.0,
            "replies": [
                {
                    "body": "Of course",
                    "author": "LikeQueHombre",
                    "id": "h9zxgg5",
                    "parent_id": "t1_h9zqosb",
                    "score": 6,
                    "created_utc": 1629694538.0,
                    "replies": [
                        {
                            "body": "You could've chosen to regress through the Anakin Smirk",
                            "author": "ResidentGood2",
                            "id": "ha07thv",
                            "parent_id": "t1_h9zxgg5",
                            "score": 2,
                            "created_utc": 1629702334.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mister Fantastic has never beaten Galactus, and he only face him in his weakest form. Galactus is the first living thing in the universe and the last from the previous one. His fully fed form can destroy many galaxies with a single blast. \nAnd Future Franklin Richard never has Galactus as a pet. He just handed Somme of his powers to him as he was in a weakened state, making Galactus Franklin's herald for a few minutes. Plus if you actually saw this story, you would know that This happened as Galactus in a form far from his best was facing 3 celestials at once and winning. They then had to fuse to put him in trouble. But one single celestial doesn't stand a chance against Galactus.",
            "author": "nazitouinz",
            "id": "h9z201d",
            "parent_id": "t1_h9yy2fw",
            "score": 7,
            "created_utc": 1629677757.0,
            "replies": [
                {
                    "body": "Ok i stand corrected",
                    "author": "thewiburi",
                    "id": "h9z2eqs",
                    "parent_id": "t1_h9z201d",
                    "score": 4,
                    "created_utc": 1629677959.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you wanna get even deeper:\n\nYour body is not you. It is hundreds of trillions of cells and neurons working together to form a single organism. You are only your mind and soul that inhabit that organism. That said, the rasenshuriken destroys things down to a molecular level. Meaning all the cells that make up your body, all get wiped out when hit with the attack. Meaning yes, every time he uses it, regardless of if it lands or not, many living things are dying",
            "author": "MrStarfishyYT",
            "id": "h9yr6i6",
            "parent_id": "t1_h9yn36k",
            "score": 10,
            "created_utc": 1629672525.0,
            "replies": [
                {
                    "body": "True. I knew naruto wasn't the good guy he looks like. The main villain is boruto is the king of cells, who can manipulate other cells. He had a grudge against naruto and is know after his son too.",
                    "author": null,
                    "id": "h9ysibh",
                    "parent_id": "t1_h9yr6i6",
                    "score": 4,
                    "created_utc": 1629673155.0,
                    "replies": []
                },
                {
                    "body": "Just your mind, there is no such thing as souls.",
                    "author": "Money_Enthusiast_",
                    "id": "ha0h52m",
                    "parent_id": "t1_h9yr6i6",
                    "score": 1,
                    "created_utc": 1629710560.0,
                    "replies": [
                        {
                            "body": "I mean it's a pretty well accepted fact by society that the soul exists. However what it exactly is, we haven't figured out as we have no means of interacting with it(on a physical spectrum anyway)",
                            "author": "MrStarfishyYT",
                            "id": "ha0heel",
                            "parent_id": "t1_ha0h52m",
                            "score": 1,
                            "created_utc": 1629710794.0,
                            "replies": [
                                {
                                    "body": "No, it's not. There is no evidence supporting it being real. There is only our physical reality, that's it. Practically all scientists don't believe souls exist.",
                                    "author": "Money_Enthusiast_",
                                    "id": "ha0hj0y",
                                    "parent_id": "t1_ha0heel",
                                    "score": 2,
                                    "created_utc": 1629710907.0,
                                    "replies": [
                                        {
                                            "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
                                            "author": "MrStarfishyYT",
                                            "id": "ha0jg6c",
                                            "parent_id": "t1_ha0hj0y",
                                            "score": 1,
                                            "created_utc": 1629712563.0,
                                            "replies": [
                                                {
                                                    "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                                                    "author": "Money_Enthusiast_",
                                                    "id": "ha0jzmg",
                                                    "parent_id": "t1_ha0jg6c",
                                                    "score": 2,
                                                    "created_utc": 1629713025.0,
                                                    "replies": [
                                                        {
                                                            "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                                                            "author": "MrStarfishyYT",
                                                            "id": "ha3js9y",
                                                            "parent_id": "t1_ha0jzmg",
                                                            "score": 0,
                                                            "created_utc": 1629762851.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                                                    "author": "Money_Enthusiast_",
                                                                    "id": "ha3lfqy",
                                                                    "parent_id": "t1_ha3js9y",
                                                                    "score": 2,
                                                                    "created_utc": 1629763626.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                                                            "author": "MrStarfishyYT",
                                                                            "id": "ha3spzc",
                                                                            "parent_id": "t1_ha3lfqy",
                                                                            "score": 0,
                                                                            "created_utc": 1629766919.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                                                    "author": "Money_Enthusiast_",
                                                                                    "id": "ha3v3xx",
                                                                                    "parent_id": "t1_ha3spzc",
                                                                                    "score": 2,
                                                                                    "created_utc": 1629767986.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto can talk",
            "author": null,
            "id": "h9xc8uv",
            "parent_id": "t1_h9x656r",
            "score": 48,
            "created_utc": 1629650043.0,
            "replies": []
        },
        {
            "body": "Base naruto is shown to be boundless and that's a low ball tbh",
            "author": "Jealous_Shame6908",
            "id": "ha2eh56",
            "parent_id": "t1_h9x656r",
            "score": 1,
            "created_utc": 1629745268.0,
            "replies": []
        },
        {
            "body": "Arguably. We get the views of both the good, Naruto, and the bad (at the time), sasuke. Without prior knowledge of watching the show, everything was insane to see at the time. From Naruto kicking an akatsuki members ass that murdered Gaara, to Sasuke overpowering OROCHIMARU and even stealing the power. Then their lines keep going. Marvel, capcom sort of comics are moreso about making the reader feel good and fuzzy by seeing some action, and always knowing the good guys gonna win. Personally, im not a huge fan of that, as its hella unrealistic. But, like i said, thats my own opinion",
            "author": "Metalona",
            "id": "h9xalk1",
            "parent_id": "t1_h9x981o",
            "score": -14,
            "created_utc": 1629649345.0,
            "replies": [
                {
                    "body": "I wouldn’t call what happened in Infinity War and Endgame a win really. I think it was a great way to show even in the MCU, sometimes the good guys don’t always win.",
                    "author": "Nurpless",
                    "id": "h9xjh3x",
                    "parent_id": "t1_h9xalk1",
                    "score": 10,
                    "created_utc": 1629653119.0,
                    "replies": [
                        {
                            "body": "Even civil war as well MCU has plenty of villains similar to anime villains in terms of their backstory and not some generic bad guy",
                            "author": "Yamisallblackforces",
                            "id": "h9z5y4c",
                            "parent_id": "t1_h9xjh3x",
                            "score": 1,
                            "created_utc": 1629679707.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Umm, did YOU watch Endgame? The heroes saved the day.",
            "author": "SnoopyGoldberg",
            "id": "h9y3pzl",
            "parent_id": "t1_h9xwq87",
            "score": 0,
            "created_utc": 1629661912.0,
            "replies": [
                {
                    "body": "Yeah and people still died? There was still stakes to be lost considering they lost the previous movie? If you're making the argument of \"the good guys win so it's boring\" then Shonen anime must be torture to  you",
                    "author": "TheRancidFit",
                    "id": "h9y5d76",
                    "parent_id": "t1_h9y3pzl",
                    "score": 4,
                    "created_utc": 1629662644.0,
                    "replies": [
                        {
                            "body": "I never made that argument, I’m saying that using Endgame as an example of a movie where the heroes didn’t save the day is wrong. People dying in the process doesn’t mean that the Avengers didn’t ultimately save the world from Thanos, which is the very definition of the heroes saving the day.",
                            "author": "SnoopyGoldberg",
                            "id": "h9yidtg",
                            "parent_id": "t1_h9y5d76",
                            "score": 1,
                            "created_utc": 1629668462.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "they beat Thanos. they definitely didnt save the day, a lot of people died and the consequences were awful as shown by the following shows",
                    "author": "LilQuasar",
                    "id": "h9y74xa",
                    "parent_id": "t1_h9y3pzl",
                    "score": 1,
                    "created_utc": 1629663428.0,
                    "replies": [
                        {
                            "body": "Bro, they undid the snap and revived half of the universe, how is that not considered saving the day? Just because there were consequences afterwards doesn’t mean that they didn’t fix their current most urgent situation. \n\nThey made more Star Wars that took place after the original trilogy, that doesn’t mean Luke Skywalker didn’t save the day in Return of the Jedi.",
                            "author": "SnoopyGoldberg",
                            "id": "h9yjgev",
                            "parent_id": "t1_h9y74xa",
                            "score": 0,
                            "created_utc": 1629668942.0,
                            "replies": [
                                {
                                    "body": "because of the timelines? because of losing half of the original Avengers, including the most important ones? how they undid the snap and revived half of the universe is important, theres was still 5 years of snap that caused a lot of problems\n\nwho said that making more Avengers / Marvel stuff means they didnt save the day? its whats happening in them that shows \"saving\" isnt accurate at all",
                                    "author": "LilQuasar",
                                    "id": "h9yo7u5",
                                    "parent_id": "t1_h9yjgev",
                                    "score": 0,
                                    "created_utc": 1629671113.0,
                                    "replies": [
                                        {
                                            "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
                                            "author": "SnoopyGoldberg",
                                            "id": "h9z8kuz",
                                            "parent_id": "t1_h9yo7u5",
                                            "score": 0,
                                            "created_utc": 1629680997.0,
                                            "replies": [
                                                {
                                                    "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                                                    "author": "LilQuasar",
                                                    "id": "h9zcoms",
                                                    "parent_id": "t1_h9z8kuz",
                                                    "score": 0,
                                                    "created_utc": 1629683029.0,
                                                    "replies": [
                                                        {
                                                            "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                                                            "author": "SnoopyGoldberg",
                                                            "id": "h9zh7m9",
                                                            "parent_id": "t1_h9zcoms",
                                                            "score": 1,
                                                            "created_utc": 1629685290.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course",
            "author": "LikeQueHombre",
            "id": "h9zxgg5",
            "parent_id": "t1_h9zqosb",
            "score": 6,
            "created_utc": 1629694538.0,
            "replies": [
                {
                    "body": "You could've chosen to regress through the Anakin Smirk",
                    "author": "ResidentGood2",
                    "id": "ha07thv",
                    "parent_id": "t1_h9zxgg5",
                    "score": 2,
                    "created_utc": 1629702334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok i stand corrected",
            "author": "thewiburi",
            "id": "h9z2eqs",
            "parent_id": "t1_h9z201d",
            "score": 4,
            "created_utc": 1629677959.0,
            "replies": []
        },
        {
            "body": "True. I knew naruto wasn't the good guy he looks like. The main villain is boruto is the king of cells, who can manipulate other cells. He had a grudge against naruto and is know after his son too.",
            "author": null,
            "id": "h9ysibh",
            "parent_id": "t1_h9yr6i6",
            "score": 4,
            "created_utc": 1629673155.0,
            "replies": []
        },
        {
            "body": "Just your mind, there is no such thing as souls.",
            "author": "Money_Enthusiast_",
            "id": "ha0h52m",
            "parent_id": "t1_h9yr6i6",
            "score": 1,
            "created_utc": 1629710560.0,
            "replies": [
                {
                    "body": "I mean it's a pretty well accepted fact by society that the soul exists. However what it exactly is, we haven't figured out as we have no means of interacting with it(on a physical spectrum anyway)",
                    "author": "MrStarfishyYT",
                    "id": "ha0heel",
                    "parent_id": "t1_ha0h52m",
                    "score": 1,
                    "created_utc": 1629710794.0,
                    "replies": [
                        {
                            "body": "No, it's not. There is no evidence supporting it being real. There is only our physical reality, that's it. Practically all scientists don't believe souls exist.",
                            "author": "Money_Enthusiast_",
                            "id": "ha0hj0y",
                            "parent_id": "t1_ha0heel",
                            "score": 2,
                            "created_utc": 1629710907.0,
                            "replies": [
                                {
                                    "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
                                    "author": "MrStarfishyYT",
                                    "id": "ha0jg6c",
                                    "parent_id": "t1_ha0hj0y",
                                    "score": 1,
                                    "created_utc": 1629712563.0,
                                    "replies": [
                                        {
                                            "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                                            "author": "Money_Enthusiast_",
                                            "id": "ha0jzmg",
                                            "parent_id": "t1_ha0jg6c",
                                            "score": 2,
                                            "created_utc": 1629713025.0,
                                            "replies": [
                                                {
                                                    "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                                                    "author": "MrStarfishyYT",
                                                    "id": "ha3js9y",
                                                    "parent_id": "t1_ha0jzmg",
                                                    "score": 0,
                                                    "created_utc": 1629762851.0,
                                                    "replies": [
                                                        {
                                                            "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                                            "author": "Money_Enthusiast_",
                                                            "id": "ha3lfqy",
                                                            "parent_id": "t1_ha3js9y",
                                                            "score": 2,
                                                            "created_utc": 1629763626.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                                                    "author": "MrStarfishyYT",
                                                                    "id": "ha3spzc",
                                                                    "parent_id": "t1_ha3lfqy",
                                                                    "score": 0,
                                                                    "created_utc": 1629766919.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                                            "author": "Money_Enthusiast_",
                                                                            "id": "ha3v3xx",
                                                                            "parent_id": "t1_ha3spzc",
                                                                            "score": 2,
                                                                            "created_utc": 1629767986.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn’t call what happened in Infinity War and Endgame a win really. I think it was a great way to show even in the MCU, sometimes the good guys don’t always win.",
            "author": "Nurpless",
            "id": "h9xjh3x",
            "parent_id": "t1_h9xalk1",
            "score": 10,
            "created_utc": 1629653119.0,
            "replies": [
                {
                    "body": "Even civil war as well MCU has plenty of villains similar to anime villains in terms of their backstory and not some generic bad guy",
                    "author": "Yamisallblackforces",
                    "id": "h9z5y4c",
                    "parent_id": "t1_h9xjh3x",
                    "score": 1,
                    "created_utc": 1629679707.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah and people still died? There was still stakes to be lost considering they lost the previous movie? If you're making the argument of \"the good guys win so it's boring\" then Shonen anime must be torture to  you",
            "author": "TheRancidFit",
            "id": "h9y5d76",
            "parent_id": "t1_h9y3pzl",
            "score": 4,
            "created_utc": 1629662644.0,
            "replies": [
                {
                    "body": "I never made that argument, I’m saying that using Endgame as an example of a movie where the heroes didn’t save the day is wrong. People dying in the process doesn’t mean that the Avengers didn’t ultimately save the world from Thanos, which is the very definition of the heroes saving the day.",
                    "author": "SnoopyGoldberg",
                    "id": "h9yidtg",
                    "parent_id": "t1_h9y5d76",
                    "score": 1,
                    "created_utc": 1629668462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "they beat Thanos. they definitely didnt save the day, a lot of people died and the consequences were awful as shown by the following shows",
            "author": "LilQuasar",
            "id": "h9y74xa",
            "parent_id": "t1_h9y3pzl",
            "score": 1,
            "created_utc": 1629663428.0,
            "replies": [
                {
                    "body": "Bro, they undid the snap and revived half of the universe, how is that not considered saving the day? Just because there were consequences afterwards doesn’t mean that they didn’t fix their current most urgent situation. \n\nThey made more Star Wars that took place after the original trilogy, that doesn’t mean Luke Skywalker didn’t save the day in Return of the Jedi.",
                    "author": "SnoopyGoldberg",
                    "id": "h9yjgev",
                    "parent_id": "t1_h9y74xa",
                    "score": 0,
                    "created_utc": 1629668942.0,
                    "replies": [
                        {
                            "body": "because of the timelines? because of losing half of the original Avengers, including the most important ones? how they undid the snap and revived half of the universe is important, theres was still 5 years of snap that caused a lot of problems\n\nwho said that making more Avengers / Marvel stuff means they didnt save the day? its whats happening in them that shows \"saving\" isnt accurate at all",
                            "author": "LilQuasar",
                            "id": "h9yo7u5",
                            "parent_id": "t1_h9yjgev",
                            "score": 0,
                            "created_utc": 1629671113.0,
                            "replies": [
                                {
                                    "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
                                    "author": "SnoopyGoldberg",
                                    "id": "h9z8kuz",
                                    "parent_id": "t1_h9yo7u5",
                                    "score": 0,
                                    "created_utc": 1629680997.0,
                                    "replies": [
                                        {
                                            "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                                            "author": "LilQuasar",
                                            "id": "h9zcoms",
                                            "parent_id": "t1_h9z8kuz",
                                            "score": 0,
                                            "created_utc": 1629683029.0,
                                            "replies": [
                                                {
                                                    "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                                                    "author": "SnoopyGoldberg",
                                                    "id": "h9zh7m9",
                                                    "parent_id": "t1_h9zcoms",
                                                    "score": 1,
                                                    "created_utc": 1629685290.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You could've chosen to regress through the Anakin Smirk",
            "author": "ResidentGood2",
            "id": "ha07thv",
            "parent_id": "t1_h9zxgg5",
            "score": 2,
            "created_utc": 1629702334.0,
            "replies": []
        },
        {
            "body": "I mean it's a pretty well accepted fact by society that the soul exists. However what it exactly is, we haven't figured out as we have no means of interacting with it(on a physical spectrum anyway)",
            "author": "MrStarfishyYT",
            "id": "ha0heel",
            "parent_id": "t1_ha0h52m",
            "score": 1,
            "created_utc": 1629710794.0,
            "replies": [
                {
                    "body": "No, it's not. There is no evidence supporting it being real. There is only our physical reality, that's it. Practically all scientists don't believe souls exist.",
                    "author": "Money_Enthusiast_",
                    "id": "ha0hj0y",
                    "parent_id": "t1_ha0heel",
                    "score": 2,
                    "created_utc": 1629710907.0,
                    "replies": [
                        {
                            "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
                            "author": "MrStarfishyYT",
                            "id": "ha0jg6c",
                            "parent_id": "t1_ha0hj0y",
                            "score": 1,
                            "created_utc": 1629712563.0,
                            "replies": [
                                {
                                    "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                                    "author": "Money_Enthusiast_",
                                    "id": "ha0jzmg",
                                    "parent_id": "t1_ha0jg6c",
                                    "score": 2,
                                    "created_utc": 1629713025.0,
                                    "replies": [
                                        {
                                            "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                                            "author": "MrStarfishyYT",
                                            "id": "ha3js9y",
                                            "parent_id": "t1_ha0jzmg",
                                            "score": 0,
                                            "created_utc": 1629762851.0,
                                            "replies": [
                                                {
                                                    "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                                    "author": "Money_Enthusiast_",
                                                    "id": "ha3lfqy",
                                                    "parent_id": "t1_ha3js9y",
                                                    "score": 2,
                                                    "created_utc": 1629763626.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                                            "author": "MrStarfishyYT",
                                                            "id": "ha3spzc",
                                                            "parent_id": "t1_ha3lfqy",
                                                            "score": 0,
                                                            "created_utc": 1629766919.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                                    "author": "Money_Enthusiast_",
                                                                    "id": "ha3v3xx",
                                                                    "parent_id": "t1_ha3spzc",
                                                                    "score": 2,
                                                                    "created_utc": 1629767986.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even civil war as well MCU has plenty of villains similar to anime villains in terms of their backstory and not some generic bad guy",
            "author": "Yamisallblackforces",
            "id": "h9z5y4c",
            "parent_id": "t1_h9xjh3x",
            "score": 1,
            "created_utc": 1629679707.0,
            "replies": []
        },
        {
            "body": "I never made that argument, I’m saying that using Endgame as an example of a movie where the heroes didn’t save the day is wrong. People dying in the process doesn’t mean that the Avengers didn’t ultimately save the world from Thanos, which is the very definition of the heroes saving the day.",
            "author": "SnoopyGoldberg",
            "id": "h9yidtg",
            "parent_id": "t1_h9y5d76",
            "score": 1,
            "created_utc": 1629668462.0,
            "replies": []
        },
        {
            "body": "Bro, they undid the snap and revived half of the universe, how is that not considered saving the day? Just because there were consequences afterwards doesn’t mean that they didn’t fix their current most urgent situation. \n\nThey made more Star Wars that took place after the original trilogy, that doesn’t mean Luke Skywalker didn’t save the day in Return of the Jedi.",
            "author": "SnoopyGoldberg",
            "id": "h9yjgev",
            "parent_id": "t1_h9y74xa",
            "score": 0,
            "created_utc": 1629668942.0,
            "replies": [
                {
                    "body": "because of the timelines? because of losing half of the original Avengers, including the most important ones? how they undid the snap and revived half of the universe is important, theres was still 5 years of snap that caused a lot of problems\n\nwho said that making more Avengers / Marvel stuff means they didnt save the day? its whats happening in them that shows \"saving\" isnt accurate at all",
                    "author": "LilQuasar",
                    "id": "h9yo7u5",
                    "parent_id": "t1_h9yjgev",
                    "score": 0,
                    "created_utc": 1629671113.0,
                    "replies": [
                        {
                            "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
                            "author": "SnoopyGoldberg",
                            "id": "h9z8kuz",
                            "parent_id": "t1_h9yo7u5",
                            "score": 0,
                            "created_utc": 1629680997.0,
                            "replies": [
                                {
                                    "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                                    "author": "LilQuasar",
                                    "id": "h9zcoms",
                                    "parent_id": "t1_h9z8kuz",
                                    "score": 0,
                                    "created_utc": 1629683029.0,
                                    "replies": [
                                        {
                                            "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                                            "author": "SnoopyGoldberg",
                                            "id": "h9zh7m9",
                                            "parent_id": "t1_h9zcoms",
                                            "score": 1,
                                            "created_utc": 1629685290.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, it's not. There is no evidence supporting it being real. There is only our physical reality, that's it. Practically all scientists don't believe souls exist.",
            "author": "Money_Enthusiast_",
            "id": "ha0hj0y",
            "parent_id": "t1_ha0heel",
            "score": 2,
            "created_utc": 1629710907.0,
            "replies": [
                {
                    "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
                    "author": "MrStarfishyYT",
                    "id": "ha0jg6c",
                    "parent_id": "t1_ha0hj0y",
                    "score": 1,
                    "created_utc": 1629712563.0,
                    "replies": [
                        {
                            "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                            "author": "Money_Enthusiast_",
                            "id": "ha0jzmg",
                            "parent_id": "t1_ha0jg6c",
                            "score": 2,
                            "created_utc": 1629713025.0,
                            "replies": [
                                {
                                    "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                                    "author": "MrStarfishyYT",
                                    "id": "ha3js9y",
                                    "parent_id": "t1_ha0jzmg",
                                    "score": 0,
                                    "created_utc": 1629762851.0,
                                    "replies": [
                                        {
                                            "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                            "author": "Money_Enthusiast_",
                                            "id": "ha3lfqy",
                                            "parent_id": "t1_ha3js9y",
                                            "score": 2,
                                            "created_utc": 1629763626.0,
                                            "replies": [
                                                {
                                                    "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                                    "author": "MrStarfishyYT",
                                                    "id": "ha3spzc",
                                                    "parent_id": "t1_ha3lfqy",
                                                    "score": 0,
                                                    "created_utc": 1629766919.0,
                                                    "replies": [
                                                        {
                                                            "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                            "author": "Money_Enthusiast_",
                                                            "id": "ha3v3xx",
                                                            "parent_id": "t1_ha3spzc",
                                                            "score": 2,
                                                            "created_utc": 1629767986.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "because of the timelines? because of losing half of the original Avengers, including the most important ones? how they undid the snap and revived half of the universe is important, theres was still 5 years of snap that caused a lot of problems\n\nwho said that making more Avengers / Marvel stuff means they didnt save the day? its whats happening in them that shows \"saving\" isnt accurate at all",
            "author": "LilQuasar",
            "id": "h9yo7u5",
            "parent_id": "t1_h9yjgev",
            "score": 0,
            "created_utc": 1629671113.0,
            "replies": [
                {
                    "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
                    "author": "SnoopyGoldberg",
                    "id": "h9z8kuz",
                    "parent_id": "t1_h9yo7u5",
                    "score": 0,
                    "created_utc": 1629680997.0,
                    "replies": [
                        {
                            "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                            "author": "LilQuasar",
                            "id": "h9zcoms",
                            "parent_id": "t1_h9z8kuz",
                            "score": 0,
                            "created_utc": 1629683029.0,
                            "replies": [
                                {
                                    "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                                    "author": "SnoopyGoldberg",
                                    "id": "h9zh7m9",
                                    "parent_id": "t1_h9zcoms",
                                    "score": 1,
                                    "created_utc": 1629685290.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The absence of evidence is not the evidence of absence. You can not see or touch the wind, yet are you going to say it doesn't exist because of it? Of course not. We see how it affects the environment, and how it affects us. Thus, we know it's there. It's the same with the soul. The soul IS part of our physical reality. We can't see or touch it, but we know it's there. It's the thing that gives us a moral compass. That guides our decisions in right or wrong. We know it's there because we see the effect somebody has on it when there soul is \"touched\". Without the soul, you would only be guided by your consciousness. Your brain would only allow you to act of your bodies impulses and instinct, like an animal. Your consciousness is the blend of your mind being guided by the soul and the brain receiving information from the things you perceive. Our soul is the thing that separates us from animals. If you kill a pig for food, it's gonna feel bad the first few times. Your gonna feel awful from doing it for a while. But a pack of wolves would then slaughter that pig and feel nothing. It was hungry, the pig seemed like it would feed them, therefore they acted on their impulse and killed it. If the soul didn't exist, we wouldn't be the species we are. If we even managed to develop society, there wouldn't be laws in place. Crime would be through the roof but nothing would be done cause we'd have no sense of morality. \"Oh, that guy just raped that girl? Oh well. He was horny, he couldn't help it.\" You see the issue with that? If you take the soul out of the equation, you take away half of what a human is, and then they just become your basic primate, only a bit more advanced.\n\nWhether or not the soul is what we believe it to be is up for debate. Maybe it's that part of the DNA we haven't figured out. Maybe it's a hormone we don't know we have. Whatever it is, we know it has to exist, because we've observed it for thousands of years and it's affect on us both as a species, and as the individual.",
            "author": "MrStarfishyYT",
            "id": "ha0jg6c",
            "parent_id": "t1_ha0hj0y",
            "score": 1,
            "created_utc": 1629712563.0,
            "replies": [
                {
                    "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
                    "author": "Money_Enthusiast_",
                    "id": "ha0jzmg",
                    "parent_id": "t1_ha0jg6c",
                    "score": 2,
                    "created_utc": 1629713025.0,
                    "replies": [
                        {
                            "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                            "author": "MrStarfishyYT",
                            "id": "ha3js9y",
                            "parent_id": "t1_ha0jzmg",
                            "score": 0,
                            "created_utc": 1629762851.0,
                            "replies": [
                                {
                                    "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                                    "author": "Money_Enthusiast_",
                                    "id": "ha3lfqy",
                                    "parent_id": "t1_ha3js9y",
                                    "score": 2,
                                    "created_utc": 1629763626.0,
                                    "replies": [
                                        {
                                            "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                            "author": "MrStarfishyYT",
                                            "id": "ha3spzc",
                                            "parent_id": "t1_ha3lfqy",
                                            "score": 0,
                                            "created_utc": 1629766919.0,
                                            "replies": [
                                                {
                                                    "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                                    "author": "Money_Enthusiast_",
                                                    "id": "ha3v3xx",
                                                    "parent_id": "t1_ha3spzc",
                                                    "score": 2,
                                                    "created_utc": 1629767986.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You do understand that dying in order to achieve a goal still counts as a success if the goal gets accomplished in the end right? Undoing the snap and bringing everyone back to life was the goal, they achieved said goal despite some casualties. They beat the bad guy and saved the world, I don’t understand how you’re trying to argue against this.",
            "author": "SnoopyGoldberg",
            "id": "h9z8kuz",
            "parent_id": "t1_h9yo7u5",
            "score": 0,
            "created_utc": 1629680997.0,
            "replies": [
                {
                    "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
                    "author": "LilQuasar",
                    "id": "h9zcoms",
                    "parent_id": "t1_h9z8kuz",
                    "score": 0,
                    "created_utc": 1629683029.0,
                    "replies": [
                        {
                            "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                            "author": "SnoopyGoldberg",
                            "id": "h9zh7m9",
                            "parent_id": "t1_h9zcoms",
                            "score": 1,
                            "created_utc": 1629685290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey, idiot, what you are describing is the brain. Our human intelligence and our emotions is what gives us the ability to do what you said. Almost every animal like wolves are no where near as smart. Wolves are carnivores, they need to hunt and eat meat. They don't feel guilt, because they were evolved that way. If they felt guilt, they couldn't survive. It's all their brains. Brains and nervous system is what you are describing as the soul. When we die, our nervous system and brain shuts off like an electronic when out of battery. \n\n Intelligence ≠ \"soul\". Bottle-nosed dolphins are equal in intelligence to humans, but I bet you say they don't have a \"soul\" because you think we are superior since we can build with our thumbs. You have no fucking clue what you are talking about, so stop spreading this fake shit and go learn some real science. Oh, btw, there is no divine beings/gods.",
            "author": "Money_Enthusiast_",
            "id": "ha0jzmg",
            "parent_id": "t1_ha0jg6c",
            "score": 2,
            "created_utc": 1629713025.0,
            "replies": [
                {
                    "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
                    "author": "MrStarfishyYT",
                    "id": "ha3js9y",
                    "parent_id": "t1_ha0jzmg",
                    "score": 0,
                    "created_utc": 1629762851.0,
                    "replies": [
                        {
                            "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                            "author": "Money_Enthusiast_",
                            "id": "ha3lfqy",
                            "parent_id": "t1_ha3js9y",
                            "score": 2,
                            "created_utc": 1629763626.0,
                            "replies": [
                                {
                                    "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                                    "author": "MrStarfishyYT",
                                    "id": "ha3spzc",
                                    "parent_id": "t1_ha3lfqy",
                                    "score": 0,
                                    "created_utc": 1629766919.0,
                                    "replies": [
                                        {
                                            "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                            "author": "Money_Enthusiast_",
                                            "id": "ha3v3xx",
                                            "parent_id": "t1_ha3spzc",
                                            "score": 2,
                                            "created_utc": 1629767986.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "they succeed in that, \"saving the day\" is much different. they lost, they didnt save the world man\n\nagain, have you watched the following shows? its not just some casualties, its half of the original Avengers. they messed up the timelines and there have been other awful consequences, including the 5 years between the snaps\n\nif you think thats saving the world you do you but thats clearly not what they are showing. as youve ignored my comment and seems you havent kept up theres no point in this",
            "author": "LilQuasar",
            "id": "h9zcoms",
            "parent_id": "t1_h9z8kuz",
            "score": 0,
            "created_utc": 1629683029.0,
            "replies": [
                {
                    "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
                    "author": "SnoopyGoldberg",
                    "id": "h9zh7m9",
                    "parent_id": "t1_h9zcoms",
                    "score": 1,
                    "created_utc": 1629685290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All I'm gonna say is you clearly did not understand a damn thing I said, or chose not to understand because you didn't have a proper rebuttal",
            "author": "MrStarfishyYT",
            "id": "ha3js9y",
            "parent_id": "t1_ha0jzmg",
            "score": 0,
            "created_utc": 1629762851.0,
            "replies": [
                {
                    "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
                    "author": "Money_Enthusiast_",
                    "id": "ha3lfqy",
                    "parent_id": "t1_ha3js9y",
                    "score": 2,
                    "created_utc": 1629763626.0,
                    "replies": [
                        {
                            "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                            "author": "MrStarfishyYT",
                            "id": "ha3spzc",
                            "parent_id": "t1_ha3lfqy",
                            "score": 0,
                            "created_utc": 1629766919.0,
                            "replies": [
                                {
                                    "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                                    "author": "Money_Enthusiast_",
                                    "id": "ha3v3xx",
                                    "parent_id": "t1_ha3spzc",
                                    "score": 2,
                                    "created_utc": 1629767986.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How did they “lose”? They basically undid all of Infinity War and defeated Thanos, that was very much their win condition. If they defeated Thanos but were unable to undo the snap, THEN you could argue that they obtained a Pyrrhic victory at most, but that wasn’t the case. \n\nProblems arose after the events of Endgame, but the events of Endgame themselves were a victory for the good guys and a defeat of the bad guys, there’s just no way around that.",
            "author": "SnoopyGoldberg",
            "id": "h9zh7m9",
            "parent_id": "t1_h9zcoms",
            "score": 1,
            "created_utc": 1629685290.0,
            "replies": []
        },
        {
            "body": "I did, I read your wall of bullshit, and countered it with what we already know. You described the soul as what is basically our brain. Learn how evolution works and how humans evolved in the past.",
            "author": "Money_Enthusiast_",
            "id": "ha3lfqy",
            "parent_id": "t1_ha3js9y",
            "score": 2,
            "created_utc": 1629763626.0,
            "replies": [
                {
                    "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
                    "author": "MrStarfishyYT",
                    "id": "ha3spzc",
                    "parent_id": "t1_ha3lfqy",
                    "score": 0,
                    "created_utc": 1629766919.0,
                    "replies": [
                        {
                            "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                            "author": "Money_Enthusiast_",
                            "id": "ha3v3xx",
                            "parent_id": "t1_ha3spzc",
                            "score": 2,
                            "created_utc": 1629767986.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, I described what the brain is, and what the soul is and it's effect on the brain. Your mind, the thing that lets you think what you do, works by blending the information your brain collects and the moral guidance of the soul. Like I said, if you want to believe the soul is the 2% of DNA we haven't figured out, or if it's some hormone we don't recognize, or whatever scientific explanation you want to put behind it, the soul has to be real because it's what separates us from animals. Clearly you don't know how evolution works. Based off evolution, we shouldn't have any form of morality. Nothing to tell us what's right and wrong. The brain will only act on instinct. We see this in literally every living creature. They have no sense of morality and act purely on instinct. They have a brain but no mind of their own. Sure they make decisions, but those decisions are guided by the natural desire to preserve ones life. Again, a built in instinct. If humans didn't have whatever we want to classify the soul as, we wouldn't be able to make any decision other than what's best for our survival. Art, music, science, literature, the phone you are on right now, everything that we see today in society wouldn't be here. The soul gives us our natural curiosity to explore and invent. Without it, we'd still be in the stone age. The only things we'd have constructed were basic tools for survival. We'd have never evolved to what we are now because there wouldn't be a need to.\n\nI'm gonna be blunt. I'm Christian. I believe we were created. But I also believe there is a good bit of truth to evolution. God knew the world would become a hostile environment for everything, and thus he gave us all the ability to adapt and evolve. So while I don't believe we evolved from another creature, I do believe we are an evolved form of what we once we're. I believe everything is.\n\nDo you get it now? Your trying to disprove the soul through science, and yet, from a scientific stand point, the soul has to exist. Whatever you want to believe it is, regardless of if it's from a spiritual stand point or a scientific one, it has to exist. Without it, we would just be animals. I mean we are already an animal from a scientific standpoint, but that's now what I mean. We would still be animals, out in the wild, living off the land. Instinct wouldn't tell us do develop government, separate ourselves by states and providences, cities and towns. We wouldn't spend the time to develop technology for the betterment of our species as a whole, or even for other species. We wouldn't care about anyone but ourselves and our offspring. Nature literally shows us how acting on pure instinct gives a species both an advantage and a disadvantage. And yet in our society, acting on instinct a lot of the time will you get in trouble. But if we didn't have the soul telling the mind what we're doing is wrong, nobody would pay attention when someone acts on instinct. It would just be normal. Everybody would act on it and so somebody not acting on it would seem, inferior. Weak, not fit to survive. Something wrong with their DNA. And chances our, that person would die a virgin.\n\nI'm not gonna keep arguing this. If your so narrow minded as to disregard the evidence society and nature gives you of the soul all because \"science\" said isn't real, then your the idiot. Not me. You want proof of the soul, I gave it, but you didn't want to acknowledge it because that would mean you'd have to admit your wrong about some of the stuff you know. What's that called? Oh yeah, pride. Something only humans care about. A feeling that can not be described through science like anger and joy. Have a nice day",
            "author": "MrStarfishyYT",
            "id": "ha3spzc",
            "parent_id": "t1_ha3lfqy",
            "score": 0,
            "created_utc": 1629766919.0,
            "replies": [
                {
                    "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
                    "author": "Money_Enthusiast_",
                    "id": "ha3v3xx",
                    "parent_id": "t1_ha3spzc",
                    "score": 2,
                    "created_utc": 1629767986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Another wall of bullshit I'm not going to read this time. You keep saying the soul is what separates us from animals, so you are saying animals don't have souls. What separates us from animals is our intelligence, which again, is our brain. Our closest relatives are chimpanzees, and they surprisingly act a lot like humans. They even have wars and have war strategies against each other much like humans. They have very similar emotions to us too. They know it's wrong to murder and steal. They have \"souls\" too. Most animals lack the amount of intelligence we have, because they didn't need it to survive for millions of years. \n\n I saw God a few times in that wall of bullshit, and I'm just going to say: God is fake, stop believing in fairy tales. Don't believe a 2000 year old fantasy book, it was written by a man who wasn't alive when Jesus died.",
            "author": "Money_Enthusiast_",
            "id": "ha3v3xx",
            "parent_id": "t1_ha3spzc",
            "score": 2,
            "created_utc": 1629767986.0,
            "replies": []
        }
    ]
}