{
    "title": "Girls who think being an SB is scamming older men for money.",
    "post_id": "hwlzd2",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hwlzd2/girls_who_think_being_an_sb_is_scamming_older_men/",
    "author": null,
    "body": "This is a rant, because i just saw a post about “platonic” SBs on youtube and tik tok. Now that i have been an SB for a while, i get really offended when i hear a girl talking about wanting a sugar daddy but without giving any sugar. My friends know what i do and will tell me how they want an SD, but wouldn’t do anything with them. If youre not into older men, dont fucking pretend like you are just for money. That is a scam, you are being a scammer. \n\nI also knew this one girl who would set up m&amp;g and then ghost them after their date (shed only choose men who’d offer ppm on m&amp;g) and at first I was like... you do you, but now i am just disgusted by this behavior. \n\nGIRLS, BEING A SB IS NOT JUST FOR KICKS AND GIGGLES!!!! Do your research, figure out what you want, and if you dont want older man dick, DONT BE A FUCKING SBABY!!!\n\nEdit: Being a SB/SD is not like vanilla dating, it is not “easy”. To the females/males who put in effort to finding and having a real genuine sugar relationship, I applaud and support you. I do not mean to bash any true SBs, and you know who you are. \nTo the scammers, johns, salt daddies, catfishers, fake SBs: STOP RUINING THE BOWL AND GET THE FLIP OUT :)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hwlzd2/girls_who_think_being_an_sb_is_scamming_older_men/",
    "score": 298,
    "upvote_ratio": 0.92,
    "created_utc": 1595531632.0,
    "num_comments": 128,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">one girl who would set up m&g and then ghost them after their date (shed only choose men who’d offer ppm on m&g)\n\nWhich is precisely why, while I always give a cash gift during the M&G, I move on from people that request anything over travel expenses or anything before the M&G.\n\nBeing too nice not just gets you rinsed, but it makes the rinsing problem worse by rewarding rinsers.",
            "author": "GDarn",
            "id": "fz0lk4m",
            "parent_id": "t3_hwlzd2",
            "score": 24,
            "created_utc": 1595535152.0,
            "replies": []
        },
        {
            "body": "Frrrrrr like some girls say they want a sugar daddy cuz they think it’s so simple just like dating someone. Like sorry sis, but the only check you’re gonna get soon is a reality check 💅 especially if you’re being a terrible person & leading these men on with no intention of follow through.",
            "author": "sugarbbellie",
            "id": "fz0h07c",
            "parent_id": "t3_hwlzd2",
            "score": 87,
            "created_utc": 1595533048.0,
            "replies": [
                {
                    "body": "Unfortunately, the bowl is full of these types.  Thinking they can get a free ride from an SD.  These types are lazy and have no morals/values.  Lazy and lack of morals/values is a really bad combination that leads to a difficult life full of pain and heartbreak.",
                    "author": "EMPOWER_not_enable",
                    "id": "fz0hdeo",
                    "parent_id": "t1_fz0h07c",
                    "score": 13,
                    "created_utc": 1595533218.0,
                    "replies": [
                        {
                            "body": "It’s so sad to see. Like a healthy relationship is rewarding enough on its own, why do some people have to go & screw someone over too.",
                            "author": "sugarbbellie",
                            "id": "fz0idhn",
                            "parent_id": "t1_fz0hdeo",
                            "score": 13,
                            "created_utc": 1595533681.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This exactly. I happen to really like older men for their experience and wisdom. I like listening to people and they typically have the best things to say. Girls who just scam give younger SBs like myself a bad rep because men think we aren't genuine. It really sucks.",
            "author": "muffinandberries",
            "id": "fz0iojm",
            "parent_id": "t3_hwlzd2",
            "score": 29,
            "created_utc": 1595533819.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz32ygy",
                    "parent_id": "t1_fz0iojm",
                    "score": 2,
                    "created_utc": 1595594804.0,
                    "replies": [
                        {
                            "body": "Maybe half of them😂😂",
                            "author": "ophiserys",
                            "id": "fz439lt",
                            "parent_id": "t1_fz32ygy",
                            "score": 3,
                            "created_utc": 1595613334.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SAME!! My friends all know about my arrangement but also joke about sugar babies all the time and how it is “so easy” and send screenshots of those Instagram dm scammers to make fun, but when I talk about it the reaction I always get it “gross but you do you”🙄\nSugar relationships are really so unique and fun, I hate the stigma.",
            "author": "productivebungalow",
            "id": "fz19f16",
            "parent_id": "t3_hwlzd2",
            "score": 10,
            "created_utc": 1595547106.0,
            "replies": [
                {
                    "body": "And you tell them to keep doing their deadbeat boyfriends that want them to split the bill at restaurants lol",
                    "author": "Jdn345",
                    "id": "fz1lmpn",
                    "parent_id": "t1_fz19f16",
                    "score": 8,
                    "created_utc": 1595553887.0,
                    "replies": []
                },
                {
                    "body": "HAHAHAHA AND THEY GO “should i do it????”  And im like its a scam, sure :)",
                    "author": null,
                    "id": "fz1cdyt",
                    "parent_id": "t1_fz19f16",
                    "score": 3,
                    "created_utc": 1595548681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> I also knew this one girl who would set up m&g and then ghost them after their date (shed only choose men who’d offer ppm on m&g)\n\nAnd this is why asking for it is such a red flag.",
            "author": "SDstartingOut",
            "id": "fz0pa01",
            "parent_id": "t3_hwlzd2",
            "score": 13,
            "created_utc": 1595536923.0,
            "replies": [
                {
                    "body": "Yep, a M&G is not a date, it is an interview.",
                    "author": null,
                    "id": "fz1hoar",
                    "parent_id": "t1_fz0pa01",
                    "score": 8,
                    "created_utc": 1595551611.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, this is why I haven’t actually tried dipping into sugaring. It wouldn’t be fair to them. I’m still trying to overcome the ptsd after being sexually assaulted by my former partner. Even though I feel like I’m missing out, since crave the kind of mentoring relationship that I see so many  of you have. \n\nI think the sugaring lifestyle is beautiful, and it’s really sad how many people have such unrealistic expectations (thinking they can have everything be platonic when that’s not the norm), based on a few stories/accounts they’ve heard of. :/",
            "author": "estalligatum",
            "id": "fz13qod",
            "parent_id": "t3_hwlzd2",
            "score": 13,
            "created_utc": 1595544156.0,
            "replies": [
                {
                    "body": "There are many supportive, caring, mentoring  SD's out there. We are just not easy to spot. Look for the ones a little older. Us granddaddies can be great sugar daddies.",
                    "author": "AFSMSgt",
                    "id": "fz1bura",
                    "parent_id": "t1_fz13qod",
                    "score": 15,
                    "created_utc": 1595548394.0,
                    "replies": [
                        {
                            "body": "This comment felt like a nice hug.",
                            "author": "Indra_Makani",
                            "id": "fz1v90e",
                            "parent_id": "t1_fz1bura",
                            "score": 7,
                            "created_utc": 1595559430.0,
                            "replies": [
                                {
                                    "body": "Thank you. It was meant to be. After my own children, my sugar babies are the best thing to ever happen to me. You have brought such joy into my life.",
                                    "author": "AFSMSgt",
                                    "id": "fz2yjsf",
                                    "parent_id": "t1_fz1v90e",
                                    "score": 3,
                                    "created_utc": 1595591577.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I will definitely keep that in mind! Thank you!",
                            "author": "estalligatum",
                            "id": "fz1ksak",
                            "parent_id": "t1_fz1bura",
                            "score": 3,
                            "created_utc": 1595553390.0,
                            "replies": []
                        },
                        {
                            "body": "I’m a stripper and this older man I met at the strip club was bragging about his yacht and jumped right into of I was gonna go on his boat he’s want me to fuck him or his grandsons 😂 I was like yeah I’m not gonna just tell you I’m gonna fuck you after knowing you for 20 mins. I barely know you...",
                            "author": "SharkBait206",
                            "id": "fz65rfk",
                            "parent_id": "t1_fz1bura",
                            "score": 1,
                            "created_utc": 1595654915.0,
                            "replies": [
                                {
                                    "body": "I never sat ALL granddad's are great. Lol",
                                    "author": "AFSMSgt",
                                    "id": "fz6p295",
                                    "parent_id": "t1_fz65rfk",
                                    "score": 1,
                                    "created_utc": 1595673771.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Someone was commenting on my post today about how all her arrangements are platonic and how That’s normal and if you sleep with an sd and get an allowance your an escort 🙄🙄",
                    "author": "ophiserys",
                    "id": "fz43l7b",
                    "parent_id": "t1_fz13qod",
                    "score": 1,
                    "created_utc": 1595613482.0,
                    "replies": [
                        {
                            "body": "Good for her finding platonic relationships, but she has no right to devalue other sugar relationships!",
                            "author": "estalligatum",
                            "id": "fz4468n",
                            "parent_id": "t1_fz43l7b",
                            "score": 1,
                            "created_utc": 1595613755.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep there seems to be more of this than ever on SA in my recent experience. It's pretty easy to avoid though.\n\nIn the past I feel like there were videos out there advertising this that were actual SBs who didn't want to admit they were having sex with SDs for what they were receiving financially. Now it's just complete BS.",
            "author": null,
            "id": "fz0grg6",
            "parent_id": "t3_hwlzd2",
            "score": 11,
            "created_utc": 1595532934.0,
            "replies": []
        },
        {
            "body": "This makes me so upset because SDs can be incredible amazing sweet kind and generous. If anyone did that to my SD (now BF) I’d rip their freaking eyeballs out",
            "author": "sugarprincessp",
            "id": "fz0kpq7",
            "parent_id": "t3_hwlzd2",
            "score": 15,
            "created_utc": 1595534757.0,
            "replies": [
                {
                    "body": "There is a reason you're a sugar princess❤",
                    "author": "Jdn345",
                    "id": "fz1lao2",
                    "parent_id": "t1_fz0kpq7",
                    "score": 0,
                    "created_utc": 1595553690.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All those girls on YouTube don’t know shit and are just saying stuff for views and it’s ruining the bowl",
            "author": "throwawayFA93",
            "id": "fz0sj8c",
            "parent_id": "t3_hwlzd2",
            "score": 7,
            "created_utc": 1595538536.0,
            "replies": []
        },
        {
            "body": "Totally agreed. I try to keep my mouth shut when I hear people talk about it because of negative experiences myself and 2 friends have had. Sometimes it’s hard to explain as well that not everyone on SA is an SD. Even if he’s old, larger, especially unattractive... that don’t mean he’s an SD....",
            "author": "sugarbunnyy",
            "id": "fz0rjwg",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595538039.0,
            "replies": []
        },
        {
            "body": "Agreed!! It honestly breaks my heart and angers me. Not only are they toiling with these mens emotions but they are also giving us and our community a bad name. Uncool.",
            "author": "w4termelonsug4r",
            "id": "fz0hxrw",
            "parent_id": "t3_hwlzd2",
            "score": 9,
            "created_utc": 1595533480.0,
            "replies": []
        },
        {
            "body": "let's hear it for older man dick!",
            "author": "doctorcoolpop",
            "id": "fz0k7yp",
            "parent_id": "t3_hwlzd2",
            "score": 19,
            "created_utc": 1595534527.0,
            "replies": [
                {
                    "body": "[Yeah!](https://upload.wikimedia.org/wikipedia/commons/d/d5/Richard_Nixon_in_1992.jpg)",
                    "author": "TY2022",
                    "id": "fz15hzt",
                    "parent_id": "t1_fz0k7yp",
                    "score": 6,
                    "created_utc": 1595545069.0,
                    "replies": [
                        {
                            "body": "Double yeah!",
                            "author": "Jdn345",
                            "id": "fz1lekr",
                            "parent_id": "t1_fz15hzt",
                            "score": 2,
                            "created_utc": 1595553754.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzorqkb",
                                    "parent_id": "t1_fz1lekr",
                                    "score": 1,
                                    "created_utc": 1596075232.0,
                                    "replies": [
                                        {
                                            "body": "Well it's always good when Sig gets to play. He's named after my pistol. A Sig Sauer full-size Legion 45 cal! Lol. Boom boom boom! Boom!",
                                            "author": "Jdn345",
                                            "id": "fzosn9o",
                                            "parent_id": "t1_fzorqkb",
                                            "score": 1,
                                            "created_utc": 1596075764.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would have been a good SD but I got out of the game after a few M&G situations then ghosting that went exactly like that. They are ruining it.",
            "author": "SebastianArnault",
            "id": "fz0gwc7",
            "parent_id": "t3_hwlzd2",
            "score": 9,
            "created_utc": 1595532997.0,
            "replies": [
                {
                    "body": "Don't let someone else prevent you from living your best life and being happy. They'll get their karma/comeuppance in due time. If you never get back in you're letting them win.",
                    "author": "gixxer_baby",
                    "id": "fz170h3",
                    "parent_id": "t1_fz0gwc7",
                    "score": 4,
                    "created_utc": 1595545864.0,
                    "replies": [
                        {
                            "body": "That’s a sweet sentiment but it’s just not worth my time investment at this point in my life to have to deal with scams and games like that. There are easier ways to meet women.",
                            "author": "SebastianArnault",
                            "id": "fz19isu",
                            "parent_id": "t1_fz170h3",
                            "score": 3,
                            "created_utc": 1595547161.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, as an older SD, of course I agree with the OP!  But I think this trend will pass.  Men who are gullible enough to fall for this kind of SB will either wise up or leave the bowl...or both.",
            "author": "hal99514",
            "id": "fz13hf2",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595544023.0,
            "replies": []
        },
        {
            "body": "I simply like older men idk it’s weird to see girls out with a SD and them being like this lol it’s weird tbh like why even put yourself threw it only for the money... that’s gross in my opinion.",
            "author": "theinternetwho",
            "id": "fz16qm8",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595545720.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz1aujm",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595547856.0,
            "replies": [
                {
                    "body": "Not my friend, a girl that i know who opened up to me about what she does. She didn’t tell me how much money she was getting either. \n\nMy friends, they just talk. They have never scammed men like this before, i would not tolerate that behavior in someone i call my friend.",
                    "author": null,
                    "id": "fz1bmw4",
                    "parent_id": "t1_fz1aujm",
                    "score": 3,
                    "created_utc": 1595548275.0,
                    "replies": []
                },
                {
                    "body": "Hell I've had them try to hit me up for money for gas to go to the M & G. Then ghost you. I mean like 20 or 30 bucks. It's ridiculous. I always offer a Benjamin for an M & G. If she ghosts after, no harm done and I can cross her off the list. I like to give them some kind of incentive to show up.",
                    "author": "Jdn345",
                    "id": "fz1nkcr",
                    "parent_id": "t1_fz1aujm",
                    "score": 3,
                    "created_utc": 1595555006.0,
                    "replies": [
                        {
                            "body": "If she never asks for anything (before or during M&G), then that almost guarantees that I will give her something for her gas/trouble/time/whateveryouwannacallit, and if we've agreed to proceed to a playdate for our next meeting, I'll email a VS egift card as a surprise.  \n\nIs there a risk of them ghosting after that?  Sure.  But if they do, I chalk it up to the cost of doing business.",
                            "author": "Patrucio71",
                            "id": "fz32rax",
                            "parent_id": "t1_fz1nkcr",
                            "score": 1,
                            "created_utc": 1595594673.0,
                            "replies": [
                                {
                                    "body": "I like that, cost of doing business. I'm a framing contractor and I want said that to one of my builders and he about flipped out lol. He was bitching about Lumber being wasted and I was telling him that some waste is inevitable. Part of the cost of doing business. He didn't like that at all but he was a dick head anyway. He went into my discarded Builder list.",
                                    "author": "Jdn345",
                                    "id": "fz3s5hy",
                                    "parent_id": "t1_fz32rax",
                                    "score": 2,
                                    "created_utc": 1595608154.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz1qy2m",
                            "parent_id": "t1_fz1nkcr",
                            "score": 1,
                            "created_utc": 1595556941.0,
                            "replies": [
                                {
                                    "body": "That's kind of my reasoning I'm giving a Benjamin. I can't say that I always offered ahead of time but I do give it for the same reason as you state",
                                    "author": "Jdn345",
                                    "id": "fz1rb5g",
                                    "parent_id": "t1_fz1qy2m",
                                    "score": 3,
                                    "created_utc": 1595557151.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the very reason as to why it took me 2 years before actually dipping into the bowl! I worked on myself to understand the lifestyle and prepare myself for it—mentally, emotionally, and physically. I thought it wouldn’t be fair to the serious SBs and SDs to jump in just to saturate the bowl.",
            "author": "doopityboopfff",
            "id": "fz6gb02",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595664672.0,
            "replies": []
        },
        {
            "body": "\\+1,000",
            "author": null,
            "id": "fz0e7n7",
            "parent_id": "t3_hwlzd2",
            "score": 7,
            "created_utc": 1595531743.0,
            "replies": []
        },
        {
            "body": "The sad thing is if they were to try it (older man dick), pretty sure they would like it.  In general it is way more experienced and better at delivering pleasure than that of 18-30 year old men.",
            "author": "montrealthreesomes",
            "id": "fz0w38n",
            "parent_id": "t3_hwlzd2",
            "score": 6,
            "created_utc": 1595540312.0,
            "replies": [
                {
                    "body": "Soooo true 😏",
                    "author": null,
                    "id": "fz1das3",
                    "parent_id": "t1_fz0w38n",
                    "score": 3,
                    "created_utc": 1595549183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz1dtit",
            "parent_id": "t3_hwlzd2",
            "score": 2,
            "created_utc": 1595549469.0,
            "replies": [
                {
                    "body": "This comment doesn't have a parent, so it doesn't make a connected sense.  Maybe you didn't hit reply?",
                    "author": "Indra_Makani",
                    "id": "fz1vfd0",
                    "parent_id": "t1_fz1dtit",
                    "score": 1,
                    "created_utc": 1595559532.0,
                    "replies": [
                        {
                            "body": "Thanks",
                            "author": null,
                            "id": "fz232c6",
                            "parent_id": "t1_fz1vfd0",
                            "score": 1,
                            "created_utc": 1595564150.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "amen",
            "author": "mraspencer",
            "id": "fz0g9uy",
            "parent_id": "t3_hwlzd2",
            "score": 4,
            "created_utc": 1595532707.0,
            "replies": []
        },
        {
            "body": "Great rant and post, upvoted and awarded!  I've said it before, karma will catch up for SBs (and SDs) that purposefully scam and deceive.",
            "author": "EMPOWER_not_enable",
            "id": "fz0grfm",
            "parent_id": "t3_hwlzd2",
            "score": 5,
            "created_utc": 1595532934.0,
            "replies": []
        },
        {
            "body": "Good reason never to pay for M&G. Money for nothing (as the Dire Straights song goes)",
            "author": "sanfran4fun",
            "id": "fz1dx19",
            "parent_id": "t3_hwlzd2",
            "score": 4,
            "created_utc": 1595549524.0,
            "replies": [
                {
                    "body": "Yep, the women who want money for nothing and the guys who want chicks for free are polluting the bowl.",
                    "author": "roscoe7585",
                    "id": "fz1nnr3",
                    "parent_id": "t1_fz1dx19",
                    "score": 5,
                    "created_utc": 1595555060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t know why you would be offended by that.\nI fuck with most of my SDs, i had one platonic but he was sooo annoying that I’d rather have a full package man in my life ( nice moment, sex, and money).\nI also have friends who had many SD and some she never fucked! Just because you’ve never found it doesn’t mean it doesn’t exist \nBefore being a SB, I never dated an older man and never looked at them.i love my SDs and the way they treat me and make me feel but 100% if money wasn’t on the table I would be out. Actually no matter the age, if money is out of the equation in a way or another, I’m out\n\nCall me gold digger I guess",
            "author": "Lilipuss25",
            "id": "fz0xaqs",
            "parent_id": "t3_hwlzd2",
            "score": 4,
            "created_utc": 1595540910.0,
            "replies": [
                {
                    "body": "Im not offended by platonic SBs, i am against platonic scammers. In your case it sounds like you had an arrangement that worked for you, which is amazing and hard to come by. I am in the same boat as you, once the sugar is gone so am I, but to scam someone is completely different. As a Sb, you would know that its not “easy” and i hate when girls think that it is. Thats what offends me",
                    "author": null,
                    "id": "fz1d7er",
                    "parent_id": "t1_fz0xaqs",
                    "score": 1,
                    "created_utc": 1595549133.0,
                    "replies": []
                },
                {
                    "body": "Gold digger and scammer that is taking advantage of these men.",
                    "author": "sdthrowout23",
                    "id": "fz100eo",
                    "parent_id": "t1_fz0xaqs",
                    "score": -6,
                    "created_utc": 1595542261.0,
                    "replies": [
                        {
                            "body": "I dont think that is true in her case. The money is important but she is giving her SD exactly what he is paying for. Not a scam",
                            "author": "AFSMSgt",
                            "id": "fz1cmke",
                            "parent_id": "t1_fz100eo",
                            "score": 5,
                            "created_utc": 1595548811.0,
                            "replies": []
                        },
                        {
                            "body": "They are happily giving me money. I don’t need to scam men because they are willingly giving me. The platonic SD we become friends/acquaintances, and I know I can ask him anything when I want. And he text me every now and then to know how I’m seeing and never asked any type of « refund »",
                            "author": "Lilipuss25",
                            "id": "fz2chyt",
                            "parent_id": "t1_fz100eo",
                            "score": 3,
                            "created_utc": 1595570933.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz0usfb",
            "parent_id": "t3_hwlzd2",
            "score": 5,
            "created_utc": 1595539667.0,
            "replies": [
                {
                    "body": "That is not fair to say, as I am a Gen Z and pretty young and am influenced by all those things. But i am a legitimate SB who is in it for the “right reason”. Dont knock all of the young girls. Those scammer girls dont have morals, werent raised right, spoiled brats.",
                    "author": null,
                    "id": "fz1dpt6",
                    "parent_id": "t1_fz0usfb",
                    "score": 0,
                    "created_utc": 1595549413.0,
                    "replies": [
                        {
                            "body": "I agree it's not fair.  As a SD I wasn't sure why I got in the bowl or what I was looking for.  I don't know what the right reason is.   I went through a lot of fakes, rinsers and scammers and it cost me a chunk of money.  But I met a young woman (20), me (57) who became my sb, then sgf and now vanilla gf and we have fallen madly in love with each other.  We are living our lives together and we are happy and that's what counts.",
                            "author": "rjjr1963",
                            "id": "fz2nzps",
                            "parent_id": "t1_fz1dpt6",
                            "score": 3,
                            "created_utc": 1595581707.0,
                            "replies": [
                                {
                                    "body": "that is amazing! Lucky you :)",
                                    "author": null,
                                    "id": "fz89ot7",
                                    "parent_id": "t1_fz2nzps",
                                    "score": 2,
                                    "created_utc": 1595707487.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah there's really not many like you. Very few I'm afraid. Which is sad. Don't take offense but I tend to call the Generation Z, generation zombies. But it's good to see that there is some light in the abyss such as yourself.",
                            "author": "Jdn345",
                            "id": "fz1mf5s",
                            "parent_id": "t1_fz1dpt6",
                            "score": 1,
                            "created_utc": 1595554346.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fz103yp",
                    "parent_id": "t1_fz0usfb",
                    "score": -2,
                    "created_utc": 1595542311.0,
                    "replies": [
                        {
                            "body": "Is *what* her fault?",
                            "author": "TY2022",
                            "id": "fz15wdi",
                            "parent_id": "t1_fz103yp",
                            "score": 1,
                            "created_utc": 1595545276.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Older man dick is far superior to younger man dick.\n\nAsk any REAL sugar baby and she will confirm.",
            "author": "KnightAnthony",
            "id": "fz0jdae",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595534134.0,
            "replies": []
        },
        {
            "body": "Couldn’t agree more !",
            "author": "Pollydolly75",
            "id": "fz0nsni",
            "parent_id": "t3_hwlzd2",
            "score": 2,
            "created_utc": 1595536210.0,
            "replies": []
        },
        {
            "body": "PREACH🙌🙌",
            "author": "_Fortuna_",
            "id": "fz0pfa4",
            "parent_id": "t3_hwlzd2",
            "score": 2,
            "created_utc": 1595536994.0,
            "replies": []
        },
        {
            "body": "Girls wonder why SD’s are so jaded and this is why.  You run across so many of these types you start thinking poorly of all young women until she has proven otherwise.  I’m amazed at how these YouTube SB “coaches” portray SD’s as dumb and old and that these 21 year old girls are playing them.  Most guys with the income to sugar are far from stupid.",
            "author": "LotBuilder",
            "id": "fz0h8hb",
            "parent_id": "t3_hwlzd2",
            "score": 3,
            "created_utc": 1595533154.0,
            "replies": [
                {
                    "body": "our penis' are pretty stupid though",
                    "author": null,
                    "id": "fz0kd5w",
                    "parent_id": "t1_fz0h8hb",
                    "score": 18,
                    "created_utc": 1595534594.0,
                    "replies": [
                        {
                            "body": "Two heads and only enough blood for one.",
                            "author": "LoftDaddy",
                            "id": "fz0pzuf",
                            "parent_id": "t1_fz0kd5w",
                            "score": 8,
                            "created_utc": 1595537270.0,
                            "replies": []
                        },
                        {
                            "body": "Mine was stupid, as crossed over into the 50's my brain got the lead on that little bastard.",
                            "author": null,
                            "id": "fz0x6p3",
                            "parent_id": "t1_fz0kd5w",
                            "score": 7,
                            "created_utc": 1595540855.0,
                            "replies": [
                                {
                                    "body": "This whole thread made me chuckle.",
                                    "author": "gixxer_baby",
                                    "id": "fz178ys",
                                    "parent_id": "t1_fz0x6p3",
                                    "score": 2,
                                    "created_utc": 1595545987.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Penises at all ages during and after puberty are stupid lol. Hopefully when you get older you get that fucker under a little better control.",
                            "author": "Jdn345",
                            "id": "fz1ms88",
                            "parent_id": "t1_fz0kd5w",
                            "score": 2,
                            "created_utc": 1595554557.0,
                            "replies": []
                        },
                        {
                            "body": "also gullible, kind, lonely is a type. Choose 1 2 or 3.",
                            "author": "amigodeface",
                            "id": "fz2rf9o",
                            "parent_id": "t1_fz0kd5w",
                            "score": 1,
                            "created_utc": 1595585140.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! It is far too often on here women are either silent about this or encourage online/platonic/rinsing. I see constant rationalizations first horrendous behavior from women and blaming it on the guy.\n\nThe truth is, this is 90% or more of women on seeking right now.\n\nEdit: and sure enough as the thread has gone on you have women defending this behavior and blaming the guys for falling for the scams.",
            "author": "sdthrowout23",
            "id": "fz0oy8n",
            "parent_id": "t3_hwlzd2",
            "score": 2,
            "created_utc": 1595536767.0,
            "replies": []
        },
        {
            "body": "I've had it happen to me and it sucks.",
            "author": null,
            "id": "fz12buf",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595543428.0,
            "replies": [
                {
                    "body": "Im sorry to hear that :(",
                    "author": null,
                    "id": "fz1cp6v",
                    "parent_id": "t1_fz12buf",
                    "score": 2,
                    "created_utc": 1595548851.0,
                    "replies": []
                },
                {
                    "body": "As in everything there's good ones and bad ones.",
                    "author": "Jdn345",
                    "id": "fz1n0uh",
                    "parent_id": "t1_fz12buf",
                    "score": 1,
                    "created_utc": 1595554695.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for posting this. \n\nThey also make it harder for real SB as we have trust issues as a result of some of the fakes.",
            "author": "craa141",
            "id": "fz13in5",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595544040.0,
            "replies": []
        },
        {
            "body": "Sucks tht ppl do that, right!",
            "author": null,
            "id": "fz1c073",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595548473.0,
            "replies": [
                {
                    "body": "What sucks is that it's done on both sides and it makes it so damn hard for the rest of us",
                    "author": "Jdn345",
                    "id": "fz1nslp",
                    "parent_id": "t1_fz1c073",
                    "score": 1,
                    "created_utc": 1595555137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "   \nIt’s true. Although sugar relationship is very popular now, you will encounter many fake SD/SB. This has a very bad impact on real SD/SB, and real SD/SB communication becomes very difficult. I have seen a lot of SB/SD information posted on social software, it is difficult for you to judge which is the real one. An SD once complained to me. He was cheated by too many SBs. He has been looking for it on social software. So I suggested that he try the sugar dating site. On the one hand, you can meet more people of the same kind on the sugar dating site. The real SB is more likely. On the other hand, the sugar dating site will perform identity verification when registering, which is safer and more reliable for SD/SB. In addition, becoming a member of the website will know more information than ordinary users, and it will be more protective for real SD/SB. Of course, if you just entered the sugar bowl and want to wait and see, social software can also satisfy you.",
            "author": "dhsjkhd8",
            "id": "fz25h8e",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595565708.0,
            "replies": []
        },
        {
            "body": "I call the ones on Tik tok scammers because that’s exactly what they’re trying to do. It’s legit sooo many minors on SA because of Tik tok it’s ridiculous and not okay at all",
            "author": null,
            "id": "fz25qfr",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595565882.0,
            "replies": []
        },
        {
            "body": "Those parasites take good sds out the market for good thats why. That's a real low value skank lol",
            "author": "ForceGlittering",
            "id": "fzpq6u0",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1596102712.0,
            "replies": [
                {
                    "body": "Sluggy parasites",
                    "author": null,
                    "id": "fzqkd1q",
                    "parent_id": "t1_fzpq6u0",
                    "score": 1,
                    "created_utc": 1596123080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can someone please be my sugar daddy 😩",
            "author": "Lily_spade",
            "id": "g2zgba0",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1598497753.0,
            "replies": []
        },
        {
            "body": "Platonic situations definitely exist but you have to be meeting a lot of guys via some other type of sex work to come across them tbh and a square who just wants to jump into the life with no work and all perks isn’t going to be the one to get lucky. \n\nAsking for ppm on a first date shouldn’t be a red flag though- time is money- and I’m sure there were other red flags in her conversation before that these guys chose to ignore.",
            "author": "prettylilprostitute",
            "id": "fz0re7e",
            "parent_id": "t3_hwlzd2",
            "score": 2,
            "created_utc": 1595537959.0,
            "replies": [
                {
                    "body": "Asking for PPM for platonic dates is an immediate next for myself and probably every guy that posts in this sub.",
                    "author": "sdthrowout23",
                    "id": "fz10899",
                    "parent_id": "t1_fz0re7e",
                    "score": 7,
                    "created_utc": 1595542372.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz0tw6d",
                    "parent_id": "t1_fz0re7e",
                    "score": 0,
                    "created_utc": 1595539219.0,
                    "replies": [
                        {
                            "body": "He who has the gold makes the rules. And my rule is that anybody who asks for money before the M&G is a hard “next”. If they need to be paid back for an Uber or gas or other expenses, I’m happy to give them that. In cash. At the M&G. \n\nIt’s harsh to say, but if the SD’s time wasn’t a lot more valuable than the SB’s time, they wouldn’t be talking, would they?",
                            "author": "LaGriffeDuLion",
                            "id": "fz1wjpc",
                            "parent_id": "t1_fz0tw6d",
                            "score": 4,
                            "created_utc": 1595560196.0,
                            "replies": []
                        },
                        {
                            "body": "It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is. The SDs shouldn’t be getting time and attention just free. Period",
                            "author": "prettylilprostitute",
                            "id": "fz0ur59",
                            "parent_id": "t1_fz0tw6d",
                            "score": -2,
                            "created_utc": 1595539649.0,
                            "replies": [
                                {
                                    "body": "Christ, you are entitled. You really think you should be paid for men to stare at you?",
                                    "author": "sdthrowout23",
                                    "id": "fz10cpq",
                                    "parent_id": "t1_fz0ur59",
                                    "score": 4,
                                    "created_utc": 1595542435.0,
                                    "replies": [
                                        {
                                            "body": "> Christ, you are entitled.\n\nNot really;  she is an escort.  It's very hard for someone in that line of work - to not see sugaring as an extension of it.",
                                            "author": "SDstartingOut",
                                            "id": "fz38vfk",
                                            "parent_id": "t1_fz10cpq",
                                            "score": 0,
                                            "created_utc": 1595598436.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz0uzaj",
                                    "parent_id": "t1_fz0ur59",
                                    "score": -1,
                                    "created_utc": 1595539762.0,
                                    "replies": [
                                        {
                                            "body": "With all due respect- I’m not",
                                            "author": "prettylilprostitute",
                                            "id": "fz0v22k",
                                            "parent_id": "t1_fz0uzaj",
                                            "score": -3,
                                            "created_utc": 1595539802.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Always is",
                                            "author": "mraspencer",
                                            "id": "fz16qqc",
                                            "parent_id": "t1_fz0uzaj",
                                            "score": -1,
                                            "created_utc": 1595545722.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is.\n\nBecause sugaring is not strictly sex work (some treat it as such, some do not);  and the platform is not geared towards prostitutes.",
                                    "author": "SDstartingOut",
                                    "id": "fz38pwl",
                                    "parent_id": "t1_fz0ur59",
                                    "score": -1,
                                    "created_utc": 1595598347.0,
                                    "replies": [
                                        {
                                            "body": "Regardless of whether it’s sex work or not- this subreddit and SA in general is backwards.",
                                            "author": "prettylilprostitute",
                                            "id": "fz54vq6",
                                            "parent_id": "t1_fz38pwl",
                                            "score": 1,
                                            "created_utc": 1595631988.0,
                                            "replies": [
                                                {
                                                    "body": "And it's not surprising that someone that views sugaring as an extension of escorting - which is not what SA (nor this sub) are geared towards - would have that view point.",
                                                    "author": "SDstartingOut",
                                                    "id": "fz55jbt",
                                                    "parent_id": "t1_fz54vq6",
                                                    "score": 1,
                                                    "created_utc": 1595632340.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If they ask, I'm gone. But I offer to pay their transportation expense, and i do give a gift. But only because i want to not because it was required for the m&g",
                            "author": "AFSMSgt",
                            "id": "fz1d5y6",
                            "parent_id": "t1_fz0tw6d",
                            "score": 0,
                            "created_utc": 1595549109.0,
                            "replies": [
                                {
                                    "body": "Yeah I usually offer something although it's not going to be a full amount then I would otherwise be getting later on if it worked out",
                                    "author": "Jdn345",
                                    "id": "fz1o6si",
                                    "parent_id": "t1_fz1d5y6",
                                    "score": 0,
                                    "created_utc": 1595555363.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Genuinely curious, would you still consider it a scam if it was a consensual platonic Sugar relationship?",
            "author": "Think2Panic",
            "id": "fz0qovu",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595537610.0,
            "replies": [
                {
                    "body": "Yes because the guy almost always wants more",
                    "author": "sdthrowout23",
                    "id": "fz0y07i",
                    "parent_id": "t1_fz0qovu",
                    "score": 0,
                    "created_utc": 1595541258.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz1ht09",
                            "parent_id": "t1_fz0y07i",
                            "score": 7,
                            "created_utc": 1595551685.0,
                            "replies": [
                                {
                                    "body": "Yeah I don't ever contact women that put platonic or say anything about it. And I usually let them know before we ever meet I'm looking for a traditional SB / SD relationship",
                                    "author": "Jdn345",
                                    "id": "fz1oh1f",
                                    "parent_id": "t1_fz1ht09",
                                    "score": 2,
                                    "created_utc": 1595555526.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz1prtf",
                                            "parent_id": "t1_fz1oh1f",
                                            "score": 2,
                                            "created_utc": 1595556266.0,
                                            "replies": [
                                                {
                                                    "body": "Well you do still have to take it with a grain of salt. It takes time to gain Trust. But I try to be as upfront as I can.",
                                                    "author": "Jdn345",
                                                    "id": "fz1qaax",
                                                    "parent_id": "t1_fz1prtf",
                                                    "score": 1,
                                                    "created_utc": 1595556560.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If a guy is getting what he paid, it's  not a scam.",
                            "author": "AFSMSgt",
                            "id": "fz1dhqw",
                            "parent_id": "t1_fz0y07i",
                            "score": 2,
                            "created_utc": 1595549291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean....yeah. But also there’s different options and the game has changed.",
            "author": "yungbutthole",
            "id": "fz13e7a",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595543977.0,
            "replies": [
                {
                    "body": "What other options 🤔",
                    "author": null,
                    "id": "fz1cqfs",
                    "parent_id": "t1_fz13e7a",
                    "score": 1,
                    "created_utc": 1595548871.0,
                    "replies": [
                        {
                            "body": "There are actually some sugar daddy’s and mamas that really jus wanna talk. No sex. Or they want nasty phone calls.  They respect ur boundaries and jus happy to have a bad bih",
                            "author": "yungbutthole",
                            "id": "fz1cx9k",
                            "parent_id": "t1_fz1cqfs",
                            "score": 5,
                            "created_utc": 1595548977.0,
                            "replies": [
                                {
                                    "body": "That is amazing! But also, that is putting effort and time in for something in return. Not just give me money cuz im me and you are my SD.",
                                    "author": null,
                                    "id": "fz1e01z",
                                    "parent_id": "t1_fz1cx9k",
                                    "score": 6,
                                    "created_utc": 1595549570.0,
                                    "replies": [
                                        {
                                            "body": "That’s true.",
                                            "author": "yungbutthole",
                                            "id": "fz1mnqn",
                                            "parent_id": "t1_fz1e01z",
                                            "score": 3,
                                            "created_utc": 1595554484.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Statistically these people don’t exist. Everyone has heard the third-hand rumors but nobody seems to have actually met one.",
                                    "author": "LaGriffeDuLion",
                                    "id": "fz1xdhp",
                                    "parent_id": "t1_fz1cx9k",
                                    "score": 1,
                                    "created_utc": 1595560683.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz33xpv",
                                            "parent_id": "t1_fz1xdhp",
                                            "score": 2,
                                            "created_utc": 1595595431.0,
                                            "replies": [
                                                {
                                                    "body": "I’m guessing that they want more and she gets a date or two out of it and then it fizzles. I’d also speculate that the guys she’s seeing are very new to the sugar bowl and haven’t been rinsed enough yet to be over it — at some point they will stop agreeing to paid M&Gs with anyone. It’s my theory, for reasons I detailed in another post, that the supply of men willing to do that is slowly shrinking over time. The bowl is still a growing market, when it reaches a stable state, I think paid M&Gs will be a thing of the past. \n\nI’ve been on WYP dates where I’ve cheerfully paid for a date because sometimes I just want to grab a steak with a hottie when I’m between SBs. But I rarely go on a second date with them because “one and done” is kinda the whole point of WYP — to me, anyway.",
                                                    "author": "LaGriffeDuLion",
                                                    "id": "fz35ge5",
                                                    "parent_id": "t1_fz33xpv",
                                                    "score": 2,
                                                    "created_utc": 1595596390.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fz35z2p",
                                                            "parent_id": "t1_fz35ge5",
                                                            "score": 1,
                                                            "created_utc": 1595596710.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                                                                    "author": "LaGriffeDuLion",
                                                                    "id": "fz39ctq",
                                                                    "parent_id": "t1_fz35z2p",
                                                                    "score": 0,
                                                                    "created_utc": 1595598709.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Okay but that’s not a sugar baby imo. 🤷‍♀️Just like every girl who’s gone on two dates from WYP are not sugar babies and every guy with an account there is not a sugar daddy",
                                                    "author": "jszly",
                                                    "id": "fz54624",
                                                    "parent_id": "t1_fz33xpv",
                                                    "score": 1,
                                                    "created_utc": 1595631597.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Um that’s great but is that a SR???? I feel like these days we call *anything* a SR. It is okay for dynamics to exist outside of sugaring that don’t have an exact name. To me, paying a woman for sex calls is in the same line as cam girls. Just because a man paid a woman in exchange for ~sexual energy does not make it sugaring. The actual definition of sugaring has a relationship component historically. And historically, all that other little shit would’ve been for the escorts.\n\nThanks to social media we believe anything someone claims with no verifying questions. Girls (like my niece) are getting $20 for sexting and undies pics. She is not a sugar baby....but let her tell it...🙄🤦‍♀️",
                                    "author": "jszly",
                                    "id": "fz53tnh",
                                    "parent_id": "t1_fz1cx9k",
                                    "score": 0,
                                    "created_utc": 1595631407.0,
                                    "replies": [
                                        {
                                            "body": "Like everything the definitions and dynamic of a relationship are subject to change. It’s different for everybody. Gatekeeping doesn’t help the new girls figure out how to truly get this coin and make a better life for themselves.",
                                            "author": "yungbutthole",
                                            "id": "fz5shxd",
                                            "parent_id": "t1_fz53tnh",
                                            "score": 1,
                                            "created_utc": 1595645702.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not trying to gatekeep anymore than the OP is for saying scamming men is not what a SR is. Call it what you want, but not every activity that involves money from older men is a SR which is what I mean. it makes it hard for people who do sugar to trust intentions on women’s ends when women who have no intentions of a relationship crowd the space. It’s like if I said I was an escort but platonically.... like no that’s something else.",
                                                    "author": "jszly",
                                                    "id": "fz5w0qx",
                                                    "parent_id": "t1_fz5shxd",
                                                    "score": 1,
                                                    "created_utc": 1595647955.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, the \"looking for a sugar daddy who doesn't want any sugar\" profiles crack me up.  What exactly do they think \"sugar\" is?  What would they think of a guy who put up a profile reading \"looking for a sugar baby who doesn't want any sugar?\"",
            "author": "SAThrowAway5",
            "id": "fz177fk",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595545965.0,
            "replies": []
        },
        {
            "body": "All about the hussle for some.",
            "author": "bookworm010101",
            "id": "fz19kbl",
            "parent_id": "t3_hwlzd2",
            "score": 1,
            "created_utc": 1595547182.0,
            "replies": [
                {
                    "body": "Hussle somewhere else at least! Or hussle the right and moral way? \n\nJust dont mess up mine, which is what these bitches are doing 😤",
                    "author": null,
                    "id": "fz1c64k",
                    "parent_id": "t1_fz19kbl",
                    "score": 2,
                    "created_utc": 1595548562.0,
                    "replies": [
                        {
                            "body": "They're messing us all up",
                            "author": "Jdn345",
                            "id": "fz1oj8f",
                            "parent_id": "t1_fz1c64k",
                            "score": 2,
                            "created_utc": 1595555561.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Money for a m&g, that makes me chuckle now that I’m older wiser and battle scared",
            "author": "KnocDown",
            "id": "fz1o8k8",
            "parent_id": "t3_hwlzd2",
            "score": 0,
            "created_utc": 1595555391.0,
            "replies": [
                {
                    "body": "My absolute favorite thing is when i do NOT ask for anything ever before m&g and still end up getting something :)",
                    "author": null,
                    "id": "fz1on1i",
                    "parent_id": "t1_fz1o8k8",
                    "score": 3,
                    "created_utc": 1595555622.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you.  There are a lot of girls on SA right now that seem to fall into this category.  They are a major headache to screen out.  They will message you back and forth but as soon as you try to set up something with them they vanish like cockroaches when you turn on the light.  \n\nIf you are not sure that you actually want to be a SB then why the hell are you even bothering to set up a profile and message people?  No one, and I mean no one who has the means to be a SD is going to be so desperate that they will settle for a platonic relationship.",
            "author": null,
            "id": "fz1hfem",
            "parent_id": "t3_hwlzd2",
            "score": -1,
            "created_utc": 1595551472.0,
            "replies": []
        },
        {
            "body": "I think it's so funny how girls who ask for money before the date are getting scammed now. Karma is a b\\_\\_\\_\\_. \n\n  \nYou are right that Fake SB's are ruining it because real SD's are getting replaced by time wasting dudes. I could have been a really great SD to some of the girls I met, but they were so slimy that I had to back out.",
            "author": "UnearthlyDinosaur",
            "id": "fz286fk",
            "parent_id": "t3_hwlzd2",
            "score": 0,
            "created_utc": 1595567596.0,
            "replies": []
        },
        {
            "body": "Then the SB's get offended because the SD wants sex at the m&g without \"having a connection\" first.",
            "author": "AFSMSgt",
            "id": "fz0hnlv",
            "parent_id": "t3_hwlzd2",
            "score": -3,
            "created_utc": 1595533348.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz0v6hb",
                    "parent_id": "t1_fz0hnlv",
                    "score": 3,
                    "created_utc": 1595539863.0,
                    "replies": [
                        {
                            "body": "And there it is! It is the guys fault the women on seeking suck!!",
                            "author": "sdthrowout23",
                            "id": "fz0xxvc",
                            "parent_id": "t1_fz0v6hb",
                            "score": 4,
                            "created_utc": 1595541226.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz0y4yr",
                                    "parent_id": "t1_fz0xxvc",
                                    "score": 3,
                                    "created_utc": 1595541323.0,
                                    "replies": [
                                        {
                                            "body": "You definitely misunderstood what he is saying I think. If women are going to say they need paid for platonic dates to build a connection that is the equivalent of men saying they need free sex to test for chemistry. Neither is acceptable.\n\nYou however blaming the guy for falling for a scam is pretty dreadful. Imagine if someone took that line with sexual assault, for example.",
                                            "author": "sdthrowout23",
                                            "id": "fz0zts7",
                                            "parent_id": "t1_fz0y4yr",
                                            "score": 1,
                                            "created_utc": 1595542169.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fz1166v",
                                                    "parent_id": "t1_fz0zts7",
                                                    "score": 1,
                                                    "created_utc": 1595542845.0,
                                                    "replies": [
                                                        {
                                                            "body": "We tend to think with little helmet head.",
                                                            "author": "AFSMSgt",
                                                            "id": "fz196i8",
                                                            "parent_id": "t1_fz1166v",
                                                            "score": 1,
                                                            "created_utc": 1595546984.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fz199sx",
                                                                    "parent_id": "t1_fz196i8",
                                                                    "score": 1,
                                                                    "created_utc": 1595547031.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                                                                            "author": "Jdn345",
                                                                            "id": "fz1p1jz",
                                                                            "parent_id": "t1_fz199sx",
                                                                            "score": 1,
                                                                            "created_utc": 1595555850.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unfortunately, the bowl is full of these types.  Thinking they can get a free ride from an SD.  These types are lazy and have no morals/values.  Lazy and lack of morals/values is a really bad combination that leads to a difficult life full of pain and heartbreak.",
            "author": "EMPOWER_not_enable",
            "id": "fz0hdeo",
            "parent_id": "t1_fz0h07c",
            "score": 13,
            "created_utc": 1595533218.0,
            "replies": [
                {
                    "body": "It’s so sad to see. Like a healthy relationship is rewarding enough on its own, why do some people have to go & screw someone over too.",
                    "author": "sugarbbellie",
                    "id": "fz0idhn",
                    "parent_id": "t1_fz0hdeo",
                    "score": 13,
                    "created_utc": 1595533681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz32ygy",
            "parent_id": "t1_fz0iojm",
            "score": 2,
            "created_utc": 1595594804.0,
            "replies": [
                {
                    "body": "Maybe half of them😂😂",
                    "author": "ophiserys",
                    "id": "fz439lt",
                    "parent_id": "t1_fz32ygy",
                    "score": 3,
                    "created_utc": 1595613334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And you tell them to keep doing their deadbeat boyfriends that want them to split the bill at restaurants lol",
            "author": "Jdn345",
            "id": "fz1lmpn",
            "parent_id": "t1_fz19f16",
            "score": 8,
            "created_utc": 1595553887.0,
            "replies": []
        },
        {
            "body": "HAHAHAHA AND THEY GO “should i do it????”  And im like its a scam, sure :)",
            "author": null,
            "id": "fz1cdyt",
            "parent_id": "t1_fz19f16",
            "score": 3,
            "created_utc": 1595548681.0,
            "replies": []
        },
        {
            "body": "Yep, a M&G is not a date, it is an interview.",
            "author": null,
            "id": "fz1hoar",
            "parent_id": "t1_fz0pa01",
            "score": 8,
            "created_utc": 1595551611.0,
            "replies": []
        },
        {
            "body": "There are many supportive, caring, mentoring  SD's out there. We are just not easy to spot. Look for the ones a little older. Us granddaddies can be great sugar daddies.",
            "author": "AFSMSgt",
            "id": "fz1bura",
            "parent_id": "t1_fz13qod",
            "score": 15,
            "created_utc": 1595548394.0,
            "replies": [
                {
                    "body": "This comment felt like a nice hug.",
                    "author": "Indra_Makani",
                    "id": "fz1v90e",
                    "parent_id": "t1_fz1bura",
                    "score": 7,
                    "created_utc": 1595559430.0,
                    "replies": [
                        {
                            "body": "Thank you. It was meant to be. After my own children, my sugar babies are the best thing to ever happen to me. You have brought such joy into my life.",
                            "author": "AFSMSgt",
                            "id": "fz2yjsf",
                            "parent_id": "t1_fz1v90e",
                            "score": 3,
                            "created_utc": 1595591577.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I will definitely keep that in mind! Thank you!",
                    "author": "estalligatum",
                    "id": "fz1ksak",
                    "parent_id": "t1_fz1bura",
                    "score": 3,
                    "created_utc": 1595553390.0,
                    "replies": []
                },
                {
                    "body": "I’m a stripper and this older man I met at the strip club was bragging about his yacht and jumped right into of I was gonna go on his boat he’s want me to fuck him or his grandsons 😂 I was like yeah I’m not gonna just tell you I’m gonna fuck you after knowing you for 20 mins. I barely know you...",
                    "author": "SharkBait206",
                    "id": "fz65rfk",
                    "parent_id": "t1_fz1bura",
                    "score": 1,
                    "created_utc": 1595654915.0,
                    "replies": [
                        {
                            "body": "I never sat ALL granddad's are great. Lol",
                            "author": "AFSMSgt",
                            "id": "fz6p295",
                            "parent_id": "t1_fz65rfk",
                            "score": 1,
                            "created_utc": 1595673771.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Someone was commenting on my post today about how all her arrangements are platonic and how That’s normal and if you sleep with an sd and get an allowance your an escort 🙄🙄",
            "author": "ophiserys",
            "id": "fz43l7b",
            "parent_id": "t1_fz13qod",
            "score": 1,
            "created_utc": 1595613482.0,
            "replies": [
                {
                    "body": "Good for her finding platonic relationships, but she has no right to devalue other sugar relationships!",
                    "author": "estalligatum",
                    "id": "fz4468n",
                    "parent_id": "t1_fz43l7b",
                    "score": 1,
                    "created_utc": 1595613755.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There is a reason you're a sugar princess❤",
            "author": "Jdn345",
            "id": "fz1lao2",
            "parent_id": "t1_fz0kpq7",
            "score": 0,
            "created_utc": 1595553690.0,
            "replies": []
        },
        {
            "body": "[Yeah!](https://upload.wikimedia.org/wikipedia/commons/d/d5/Richard_Nixon_in_1992.jpg)",
            "author": "TY2022",
            "id": "fz15hzt",
            "parent_id": "t1_fz0k7yp",
            "score": 6,
            "created_utc": 1595545069.0,
            "replies": [
                {
                    "body": "Double yeah!",
                    "author": "Jdn345",
                    "id": "fz1lekr",
                    "parent_id": "t1_fz15hzt",
                    "score": 2,
                    "created_utc": 1595553754.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzorqkb",
                            "parent_id": "t1_fz1lekr",
                            "score": 1,
                            "created_utc": 1596075232.0,
                            "replies": [
                                {
                                    "body": "Well it's always good when Sig gets to play. He's named after my pistol. A Sig Sauer full-size Legion 45 cal! Lol. Boom boom boom! Boom!",
                                    "author": "Jdn345",
                                    "id": "fzosn9o",
                                    "parent_id": "t1_fzorqkb",
                                    "score": 1,
                                    "created_utc": 1596075764.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't let someone else prevent you from living your best life and being happy. They'll get their karma/comeuppance in due time. If you never get back in you're letting them win.",
            "author": "gixxer_baby",
            "id": "fz170h3",
            "parent_id": "t1_fz0gwc7",
            "score": 4,
            "created_utc": 1595545864.0,
            "replies": [
                {
                    "body": "That’s a sweet sentiment but it’s just not worth my time investment at this point in my life to have to deal with scams and games like that. There are easier ways to meet women.",
                    "author": "SebastianArnault",
                    "id": "fz19isu",
                    "parent_id": "t1_fz170h3",
                    "score": 3,
                    "created_utc": 1595547161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not my friend, a girl that i know who opened up to me about what she does. She didn’t tell me how much money she was getting either. \n\nMy friends, they just talk. They have never scammed men like this before, i would not tolerate that behavior in someone i call my friend.",
            "author": null,
            "id": "fz1bmw4",
            "parent_id": "t1_fz1aujm",
            "score": 3,
            "created_utc": 1595548275.0,
            "replies": []
        },
        {
            "body": "Hell I've had them try to hit me up for money for gas to go to the M & G. Then ghost you. I mean like 20 or 30 bucks. It's ridiculous. I always offer a Benjamin for an M & G. If she ghosts after, no harm done and I can cross her off the list. I like to give them some kind of incentive to show up.",
            "author": "Jdn345",
            "id": "fz1nkcr",
            "parent_id": "t1_fz1aujm",
            "score": 3,
            "created_utc": 1595555006.0,
            "replies": [
                {
                    "body": "If she never asks for anything (before or during M&G), then that almost guarantees that I will give her something for her gas/trouble/time/whateveryouwannacallit, and if we've agreed to proceed to a playdate for our next meeting, I'll email a VS egift card as a surprise.  \n\nIs there a risk of them ghosting after that?  Sure.  But if they do, I chalk it up to the cost of doing business.",
                    "author": "Patrucio71",
                    "id": "fz32rax",
                    "parent_id": "t1_fz1nkcr",
                    "score": 1,
                    "created_utc": 1595594673.0,
                    "replies": [
                        {
                            "body": "I like that, cost of doing business. I'm a framing contractor and I want said that to one of my builders and he about flipped out lol. He was bitching about Lumber being wasted and I was telling him that some waste is inevitable. Part of the cost of doing business. He didn't like that at all but he was a dick head anyway. He went into my discarded Builder list.",
                            "author": "Jdn345",
                            "id": "fz3s5hy",
                            "parent_id": "t1_fz32rax",
                            "score": 2,
                            "created_utc": 1595608154.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz1qy2m",
                    "parent_id": "t1_fz1nkcr",
                    "score": 1,
                    "created_utc": 1595556941.0,
                    "replies": [
                        {
                            "body": "That's kind of my reasoning I'm giving a Benjamin. I can't say that I always offered ahead of time but I do give it for the same reason as you state",
                            "author": "Jdn345",
                            "id": "fz1rb5g",
                            "parent_id": "t1_fz1qy2m",
                            "score": 3,
                            "created_utc": 1595557151.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Soooo true 😏",
            "author": null,
            "id": "fz1das3",
            "parent_id": "t1_fz0w38n",
            "score": 3,
            "created_utc": 1595549183.0,
            "replies": []
        },
        {
            "body": "This comment doesn't have a parent, so it doesn't make a connected sense.  Maybe you didn't hit reply?",
            "author": "Indra_Makani",
            "id": "fz1vfd0",
            "parent_id": "t1_fz1dtit",
            "score": 1,
            "created_utc": 1595559532.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": null,
                    "id": "fz232c6",
                    "parent_id": "t1_fz1vfd0",
                    "score": 1,
                    "created_utc": 1595564150.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, the women who want money for nothing and the guys who want chicks for free are polluting the bowl.",
            "author": "roscoe7585",
            "id": "fz1nnr3",
            "parent_id": "t1_fz1dx19",
            "score": 5,
            "created_utc": 1595555060.0,
            "replies": []
        },
        {
            "body": "Im not offended by platonic SBs, i am against platonic scammers. In your case it sounds like you had an arrangement that worked for you, which is amazing and hard to come by. I am in the same boat as you, once the sugar is gone so am I, but to scam someone is completely different. As a Sb, you would know that its not “easy” and i hate when girls think that it is. Thats what offends me",
            "author": null,
            "id": "fz1d7er",
            "parent_id": "t1_fz0xaqs",
            "score": 1,
            "created_utc": 1595549133.0,
            "replies": []
        },
        {
            "body": "Gold digger and scammer that is taking advantage of these men.",
            "author": "sdthrowout23",
            "id": "fz100eo",
            "parent_id": "t1_fz0xaqs",
            "score": -6,
            "created_utc": 1595542261.0,
            "replies": [
                {
                    "body": "I dont think that is true in her case. The money is important but she is giving her SD exactly what he is paying for. Not a scam",
                    "author": "AFSMSgt",
                    "id": "fz1cmke",
                    "parent_id": "t1_fz100eo",
                    "score": 5,
                    "created_utc": 1595548811.0,
                    "replies": []
                },
                {
                    "body": "They are happily giving me money. I don’t need to scam men because they are willingly giving me. The platonic SD we become friends/acquaintances, and I know I can ask him anything when I want. And he text me every now and then to know how I’m seeing and never asked any type of « refund »",
                    "author": "Lilipuss25",
                    "id": "fz2chyt",
                    "parent_id": "t1_fz100eo",
                    "score": 3,
                    "created_utc": 1595570933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is not fair to say, as I am a Gen Z and pretty young and am influenced by all those things. But i am a legitimate SB who is in it for the “right reason”. Dont knock all of the young girls. Those scammer girls dont have morals, werent raised right, spoiled brats.",
            "author": null,
            "id": "fz1dpt6",
            "parent_id": "t1_fz0usfb",
            "score": 0,
            "created_utc": 1595549413.0,
            "replies": [
                {
                    "body": "I agree it's not fair.  As a SD I wasn't sure why I got in the bowl or what I was looking for.  I don't know what the right reason is.   I went through a lot of fakes, rinsers and scammers and it cost me a chunk of money.  But I met a young woman (20), me (57) who became my sb, then sgf and now vanilla gf and we have fallen madly in love with each other.  We are living our lives together and we are happy and that's what counts.",
                    "author": "rjjr1963",
                    "id": "fz2nzps",
                    "parent_id": "t1_fz1dpt6",
                    "score": 3,
                    "created_utc": 1595581707.0,
                    "replies": [
                        {
                            "body": "that is amazing! Lucky you :)",
                            "author": null,
                            "id": "fz89ot7",
                            "parent_id": "t1_fz2nzps",
                            "score": 2,
                            "created_utc": 1595707487.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah there's really not many like you. Very few I'm afraid. Which is sad. Don't take offense but I tend to call the Generation Z, generation zombies. But it's good to see that there is some light in the abyss such as yourself.",
                    "author": "Jdn345",
                    "id": "fz1mf5s",
                    "parent_id": "t1_fz1dpt6",
                    "score": 1,
                    "created_utc": 1595554346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fz103yp",
            "parent_id": "t1_fz0usfb",
            "score": -2,
            "created_utc": 1595542311.0,
            "replies": [
                {
                    "body": "Is *what* her fault?",
                    "author": "TY2022",
                    "id": "fz15wdi",
                    "parent_id": "t1_fz103yp",
                    "score": 1,
                    "created_utc": 1595545276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "our penis' are pretty stupid though",
            "author": null,
            "id": "fz0kd5w",
            "parent_id": "t1_fz0h8hb",
            "score": 18,
            "created_utc": 1595534594.0,
            "replies": [
                {
                    "body": "Two heads and only enough blood for one.",
                    "author": "LoftDaddy",
                    "id": "fz0pzuf",
                    "parent_id": "t1_fz0kd5w",
                    "score": 8,
                    "created_utc": 1595537270.0,
                    "replies": []
                },
                {
                    "body": "Mine was stupid, as crossed over into the 50's my brain got the lead on that little bastard.",
                    "author": null,
                    "id": "fz0x6p3",
                    "parent_id": "t1_fz0kd5w",
                    "score": 7,
                    "created_utc": 1595540855.0,
                    "replies": [
                        {
                            "body": "This whole thread made me chuckle.",
                            "author": "gixxer_baby",
                            "id": "fz178ys",
                            "parent_id": "t1_fz0x6p3",
                            "score": 2,
                            "created_utc": 1595545987.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Penises at all ages during and after puberty are stupid lol. Hopefully when you get older you get that fucker under a little better control.",
                    "author": "Jdn345",
                    "id": "fz1ms88",
                    "parent_id": "t1_fz0kd5w",
                    "score": 2,
                    "created_utc": 1595554557.0,
                    "replies": []
                },
                {
                    "body": "also gullible, kind, lonely is a type. Choose 1 2 or 3.",
                    "author": "amigodeface",
                    "id": "fz2rf9o",
                    "parent_id": "t1_fz0kd5w",
                    "score": 1,
                    "created_utc": 1595585140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im sorry to hear that :(",
            "author": null,
            "id": "fz1cp6v",
            "parent_id": "t1_fz12buf",
            "score": 2,
            "created_utc": 1595548851.0,
            "replies": []
        },
        {
            "body": "As in everything there's good ones and bad ones.",
            "author": "Jdn345",
            "id": "fz1n0uh",
            "parent_id": "t1_fz12buf",
            "score": 1,
            "created_utc": 1595554695.0,
            "replies": []
        },
        {
            "body": "What sucks is that it's done on both sides and it makes it so damn hard for the rest of us",
            "author": "Jdn345",
            "id": "fz1nslp",
            "parent_id": "t1_fz1c073",
            "score": 1,
            "created_utc": 1595555137.0,
            "replies": []
        },
        {
            "body": "Sluggy parasites",
            "author": null,
            "id": "fzqkd1q",
            "parent_id": "t1_fzpq6u0",
            "score": 1,
            "created_utc": 1596123080.0,
            "replies": []
        },
        {
            "body": "Asking for PPM for platonic dates is an immediate next for myself and probably every guy that posts in this sub.",
            "author": "sdthrowout23",
            "id": "fz10899",
            "parent_id": "t1_fz0re7e",
            "score": 7,
            "created_utc": 1595542372.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz0tw6d",
            "parent_id": "t1_fz0re7e",
            "score": 0,
            "created_utc": 1595539219.0,
            "replies": [
                {
                    "body": "He who has the gold makes the rules. And my rule is that anybody who asks for money before the M&G is a hard “next”. If they need to be paid back for an Uber or gas or other expenses, I’m happy to give them that. In cash. At the M&G. \n\nIt’s harsh to say, but if the SD’s time wasn’t a lot more valuable than the SB’s time, they wouldn’t be talking, would they?",
                    "author": "LaGriffeDuLion",
                    "id": "fz1wjpc",
                    "parent_id": "t1_fz0tw6d",
                    "score": 4,
                    "created_utc": 1595560196.0,
                    "replies": []
                },
                {
                    "body": "It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is. The SDs shouldn’t be getting time and attention just free. Period",
                    "author": "prettylilprostitute",
                    "id": "fz0ur59",
                    "parent_id": "t1_fz0tw6d",
                    "score": -2,
                    "created_utc": 1595539649.0,
                    "replies": [
                        {
                            "body": "Christ, you are entitled. You really think you should be paid for men to stare at you?",
                            "author": "sdthrowout23",
                            "id": "fz10cpq",
                            "parent_id": "t1_fz0ur59",
                            "score": 4,
                            "created_utc": 1595542435.0,
                            "replies": [
                                {
                                    "body": "> Christ, you are entitled.\n\nNot really;  she is an escort.  It's very hard for someone in that line of work - to not see sugaring as an extension of it.",
                                    "author": "SDstartingOut",
                                    "id": "fz38vfk",
                                    "parent_id": "t1_fz10cpq",
                                    "score": 0,
                                    "created_utc": 1595598436.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz0uzaj",
                            "parent_id": "t1_fz0ur59",
                            "score": -1,
                            "created_utc": 1595539762.0,
                            "replies": [
                                {
                                    "body": "With all due respect- I’m not",
                                    "author": "prettylilprostitute",
                                    "id": "fz0v22k",
                                    "parent_id": "t1_fz0uzaj",
                                    "score": -3,
                                    "created_utc": 1595539802.0,
                                    "replies": []
                                },
                                {
                                    "body": "Always is",
                                    "author": "mraspencer",
                                    "id": "fz16qqc",
                                    "parent_id": "t1_fz0uzaj",
                                    "score": -1,
                                    "created_utc": 1595545722.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is.\n\nBecause sugaring is not strictly sex work (some treat it as such, some do not);  and the platform is not geared towards prostitutes.",
                            "author": "SDstartingOut",
                            "id": "fz38pwl",
                            "parent_id": "t1_fz0ur59",
                            "score": -1,
                            "created_utc": 1595598347.0,
                            "replies": [
                                {
                                    "body": "Regardless of whether it’s sex work or not- this subreddit and SA in general is backwards.",
                                    "author": "prettylilprostitute",
                                    "id": "fz54vq6",
                                    "parent_id": "t1_fz38pwl",
                                    "score": 1,
                                    "created_utc": 1595631988.0,
                                    "replies": [
                                        {
                                            "body": "And it's not surprising that someone that views sugaring as an extension of escorting - which is not what SA (nor this sub) are geared towards - would have that view point.",
                                            "author": "SDstartingOut",
                                            "id": "fz55jbt",
                                            "parent_id": "t1_fz54vq6",
                                            "score": 1,
                                            "created_utc": 1595632340.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If they ask, I'm gone. But I offer to pay their transportation expense, and i do give a gift. But only because i want to not because it was required for the m&g",
                    "author": "AFSMSgt",
                    "id": "fz1d5y6",
                    "parent_id": "t1_fz0tw6d",
                    "score": 0,
                    "created_utc": 1595549109.0,
                    "replies": [
                        {
                            "body": "Yeah I usually offer something although it's not going to be a full amount then I would otherwise be getting later on if it worked out",
                            "author": "Jdn345",
                            "id": "fz1o6si",
                            "parent_id": "t1_fz1d5y6",
                            "score": 0,
                            "created_utc": 1595555363.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes because the guy almost always wants more",
            "author": "sdthrowout23",
            "id": "fz0y07i",
            "parent_id": "t1_fz0qovu",
            "score": 0,
            "created_utc": 1595541258.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz1ht09",
                    "parent_id": "t1_fz0y07i",
                    "score": 7,
                    "created_utc": 1595551685.0,
                    "replies": [
                        {
                            "body": "Yeah I don't ever contact women that put platonic or say anything about it. And I usually let them know before we ever meet I'm looking for a traditional SB / SD relationship",
                            "author": "Jdn345",
                            "id": "fz1oh1f",
                            "parent_id": "t1_fz1ht09",
                            "score": 2,
                            "created_utc": 1595555526.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz1prtf",
                                    "parent_id": "t1_fz1oh1f",
                                    "score": 2,
                                    "created_utc": 1595556266.0,
                                    "replies": [
                                        {
                                            "body": "Well you do still have to take it with a grain of salt. It takes time to gain Trust. But I try to be as upfront as I can.",
                                            "author": "Jdn345",
                                            "id": "fz1qaax",
                                            "parent_id": "t1_fz1prtf",
                                            "score": 1,
                                            "created_utc": 1595556560.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If a guy is getting what he paid, it's  not a scam.",
                    "author": "AFSMSgt",
                    "id": "fz1dhqw",
                    "parent_id": "t1_fz0y07i",
                    "score": 2,
                    "created_utc": 1595549291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What other options 🤔",
            "author": null,
            "id": "fz1cqfs",
            "parent_id": "t1_fz13e7a",
            "score": 1,
            "created_utc": 1595548871.0,
            "replies": [
                {
                    "body": "There are actually some sugar daddy’s and mamas that really jus wanna talk. No sex. Or they want nasty phone calls.  They respect ur boundaries and jus happy to have a bad bih",
                    "author": "yungbutthole",
                    "id": "fz1cx9k",
                    "parent_id": "t1_fz1cqfs",
                    "score": 5,
                    "created_utc": 1595548977.0,
                    "replies": [
                        {
                            "body": "That is amazing! But also, that is putting effort and time in for something in return. Not just give me money cuz im me and you are my SD.",
                            "author": null,
                            "id": "fz1e01z",
                            "parent_id": "t1_fz1cx9k",
                            "score": 6,
                            "created_utc": 1595549570.0,
                            "replies": [
                                {
                                    "body": "That’s true.",
                                    "author": "yungbutthole",
                                    "id": "fz1mnqn",
                                    "parent_id": "t1_fz1e01z",
                                    "score": 3,
                                    "created_utc": 1595554484.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Statistically these people don’t exist. Everyone has heard the third-hand rumors but nobody seems to have actually met one.",
                            "author": "LaGriffeDuLion",
                            "id": "fz1xdhp",
                            "parent_id": "t1_fz1cx9k",
                            "score": 1,
                            "created_utc": 1595560683.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz33xpv",
                                    "parent_id": "t1_fz1xdhp",
                                    "score": 2,
                                    "created_utc": 1595595431.0,
                                    "replies": [
                                        {
                                            "body": "I’m guessing that they want more and she gets a date or two out of it and then it fizzles. I’d also speculate that the guys she’s seeing are very new to the sugar bowl and haven’t been rinsed enough yet to be over it — at some point they will stop agreeing to paid M&Gs with anyone. It’s my theory, for reasons I detailed in another post, that the supply of men willing to do that is slowly shrinking over time. The bowl is still a growing market, when it reaches a stable state, I think paid M&Gs will be a thing of the past. \n\nI’ve been on WYP dates where I’ve cheerfully paid for a date because sometimes I just want to grab a steak with a hottie when I’m between SBs. But I rarely go on a second date with them because “one and done” is kinda the whole point of WYP — to me, anyway.",
                                            "author": "LaGriffeDuLion",
                                            "id": "fz35ge5",
                                            "parent_id": "t1_fz33xpv",
                                            "score": 2,
                                            "created_utc": 1595596390.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fz35z2p",
                                                    "parent_id": "t1_fz35ge5",
                                                    "score": 1,
                                                    "created_utc": 1595596710.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                                                            "author": "LaGriffeDuLion",
                                                            "id": "fz39ctq",
                                                            "parent_id": "t1_fz35z2p",
                                                            "score": 0,
                                                            "created_utc": 1595598709.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Okay but that’s not a sugar baby imo. 🤷‍♀️Just like every girl who’s gone on two dates from WYP are not sugar babies and every guy with an account there is not a sugar daddy",
                                            "author": "jszly",
                                            "id": "fz54624",
                                            "parent_id": "t1_fz33xpv",
                                            "score": 1,
                                            "created_utc": 1595631597.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Um that’s great but is that a SR???? I feel like these days we call *anything* a SR. It is okay for dynamics to exist outside of sugaring that don’t have an exact name. To me, paying a woman for sex calls is in the same line as cam girls. Just because a man paid a woman in exchange for ~sexual energy does not make it sugaring. The actual definition of sugaring has a relationship component historically. And historically, all that other little shit would’ve been for the escorts.\n\nThanks to social media we believe anything someone claims with no verifying questions. Girls (like my niece) are getting $20 for sexting and undies pics. She is not a sugar baby....but let her tell it...🙄🤦‍♀️",
                            "author": "jszly",
                            "id": "fz53tnh",
                            "parent_id": "t1_fz1cx9k",
                            "score": 0,
                            "created_utc": 1595631407.0,
                            "replies": [
                                {
                                    "body": "Like everything the definitions and dynamic of a relationship are subject to change. It’s different for everybody. Gatekeeping doesn’t help the new girls figure out how to truly get this coin and make a better life for themselves.",
                                    "author": "yungbutthole",
                                    "id": "fz5shxd",
                                    "parent_id": "t1_fz53tnh",
                                    "score": 1,
                                    "created_utc": 1595645702.0,
                                    "replies": [
                                        {
                                            "body": "I’m not trying to gatekeep anymore than the OP is for saying scamming men is not what a SR is. Call it what you want, but not every activity that involves money from older men is a SR which is what I mean. it makes it hard for people who do sugar to trust intentions on women’s ends when women who have no intentions of a relationship crowd the space. It’s like if I said I was an escort but platonically.... like no that’s something else.",
                                            "author": "jszly",
                                            "id": "fz5w0qx",
                                            "parent_id": "t1_fz5shxd",
                                            "score": 1,
                                            "created_utc": 1595647955.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hussle somewhere else at least! Or hussle the right and moral way? \n\nJust dont mess up mine, which is what these bitches are doing 😤",
            "author": null,
            "id": "fz1c64k",
            "parent_id": "t1_fz19kbl",
            "score": 2,
            "created_utc": 1595548562.0,
            "replies": [
                {
                    "body": "They're messing us all up",
                    "author": "Jdn345",
                    "id": "fz1oj8f",
                    "parent_id": "t1_fz1c64k",
                    "score": 2,
                    "created_utc": 1595555561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My absolute favorite thing is when i do NOT ask for anything ever before m&g and still end up getting something :)",
            "author": null,
            "id": "fz1on1i",
            "parent_id": "t1_fz1o8k8",
            "score": 3,
            "created_utc": 1595555622.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz0v6hb",
            "parent_id": "t1_fz0hnlv",
            "score": 3,
            "created_utc": 1595539863.0,
            "replies": [
                {
                    "body": "And there it is! It is the guys fault the women on seeking suck!!",
                    "author": "sdthrowout23",
                    "id": "fz0xxvc",
                    "parent_id": "t1_fz0v6hb",
                    "score": 4,
                    "created_utc": 1595541226.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz0y4yr",
                            "parent_id": "t1_fz0xxvc",
                            "score": 3,
                            "created_utc": 1595541323.0,
                            "replies": [
                                {
                                    "body": "You definitely misunderstood what he is saying I think. If women are going to say they need paid for platonic dates to build a connection that is the equivalent of men saying they need free sex to test for chemistry. Neither is acceptable.\n\nYou however blaming the guy for falling for a scam is pretty dreadful. Imagine if someone took that line with sexual assault, for example.",
                                    "author": "sdthrowout23",
                                    "id": "fz0zts7",
                                    "parent_id": "t1_fz0y4yr",
                                    "score": 1,
                                    "created_utc": 1595542169.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz1166v",
                                            "parent_id": "t1_fz0zts7",
                                            "score": 1,
                                            "created_utc": 1595542845.0,
                                            "replies": [
                                                {
                                                    "body": "We tend to think with little helmet head.",
                                                    "author": "AFSMSgt",
                                                    "id": "fz196i8",
                                                    "parent_id": "t1_fz1166v",
                                                    "score": 1,
                                                    "created_utc": 1595546984.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fz199sx",
                                                            "parent_id": "t1_fz196i8",
                                                            "score": 1,
                                                            "created_utc": 1595547031.0,
                                                            "replies": [
                                                                {
                                                                    "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                                                                    "author": "Jdn345",
                                                                    "id": "fz1p1jz",
                                                                    "parent_id": "t1_fz199sx",
                                                                    "score": 1,
                                                                    "created_utc": 1595555850.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s so sad to see. Like a healthy relationship is rewarding enough on its own, why do some people have to go & screw someone over too.",
            "author": "sugarbbellie",
            "id": "fz0idhn",
            "parent_id": "t1_fz0hdeo",
            "score": 13,
            "created_utc": 1595533681.0,
            "replies": []
        },
        {
            "body": "Maybe half of them😂😂",
            "author": "ophiserys",
            "id": "fz439lt",
            "parent_id": "t1_fz32ygy",
            "score": 3,
            "created_utc": 1595613334.0,
            "replies": []
        },
        {
            "body": "This comment felt like a nice hug.",
            "author": "Indra_Makani",
            "id": "fz1v90e",
            "parent_id": "t1_fz1bura",
            "score": 7,
            "created_utc": 1595559430.0,
            "replies": [
                {
                    "body": "Thank you. It was meant to be. After my own children, my sugar babies are the best thing to ever happen to me. You have brought such joy into my life.",
                    "author": "AFSMSgt",
                    "id": "fz2yjsf",
                    "parent_id": "t1_fz1v90e",
                    "score": 3,
                    "created_utc": 1595591577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I will definitely keep that in mind! Thank you!",
            "author": "estalligatum",
            "id": "fz1ksak",
            "parent_id": "t1_fz1bura",
            "score": 3,
            "created_utc": 1595553390.0,
            "replies": []
        },
        {
            "body": "I’m a stripper and this older man I met at the strip club was bragging about his yacht and jumped right into of I was gonna go on his boat he’s want me to fuck him or his grandsons 😂 I was like yeah I’m not gonna just tell you I’m gonna fuck you after knowing you for 20 mins. I barely know you...",
            "author": "SharkBait206",
            "id": "fz65rfk",
            "parent_id": "t1_fz1bura",
            "score": 1,
            "created_utc": 1595654915.0,
            "replies": [
                {
                    "body": "I never sat ALL granddad's are great. Lol",
                    "author": "AFSMSgt",
                    "id": "fz6p295",
                    "parent_id": "t1_fz65rfk",
                    "score": 1,
                    "created_utc": 1595673771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good for her finding platonic relationships, but she has no right to devalue other sugar relationships!",
            "author": "estalligatum",
            "id": "fz4468n",
            "parent_id": "t1_fz43l7b",
            "score": 1,
            "created_utc": 1595613755.0,
            "replies": []
        },
        {
            "body": "Double yeah!",
            "author": "Jdn345",
            "id": "fz1lekr",
            "parent_id": "t1_fz15hzt",
            "score": 2,
            "created_utc": 1595553754.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzorqkb",
                    "parent_id": "t1_fz1lekr",
                    "score": 1,
                    "created_utc": 1596075232.0,
                    "replies": [
                        {
                            "body": "Well it's always good when Sig gets to play. He's named after my pistol. A Sig Sauer full-size Legion 45 cal! Lol. Boom boom boom! Boom!",
                            "author": "Jdn345",
                            "id": "fzosn9o",
                            "parent_id": "t1_fzorqkb",
                            "score": 1,
                            "created_utc": 1596075764.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s a sweet sentiment but it’s just not worth my time investment at this point in my life to have to deal with scams and games like that. There are easier ways to meet women.",
            "author": "SebastianArnault",
            "id": "fz19isu",
            "parent_id": "t1_fz170h3",
            "score": 3,
            "created_utc": 1595547161.0,
            "replies": []
        },
        {
            "body": "If she never asks for anything (before or during M&G), then that almost guarantees that I will give her something for her gas/trouble/time/whateveryouwannacallit, and if we've agreed to proceed to a playdate for our next meeting, I'll email a VS egift card as a surprise.  \n\nIs there a risk of them ghosting after that?  Sure.  But if they do, I chalk it up to the cost of doing business.",
            "author": "Patrucio71",
            "id": "fz32rax",
            "parent_id": "t1_fz1nkcr",
            "score": 1,
            "created_utc": 1595594673.0,
            "replies": [
                {
                    "body": "I like that, cost of doing business. I'm a framing contractor and I want said that to one of my builders and he about flipped out lol. He was bitching about Lumber being wasted and I was telling him that some waste is inevitable. Part of the cost of doing business. He didn't like that at all but he was a dick head anyway. He went into my discarded Builder list.",
                    "author": "Jdn345",
                    "id": "fz3s5hy",
                    "parent_id": "t1_fz32rax",
                    "score": 2,
                    "created_utc": 1595608154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz1qy2m",
            "parent_id": "t1_fz1nkcr",
            "score": 1,
            "created_utc": 1595556941.0,
            "replies": [
                {
                    "body": "That's kind of my reasoning I'm giving a Benjamin. I can't say that I always offered ahead of time but I do give it for the same reason as you state",
                    "author": "Jdn345",
                    "id": "fz1rb5g",
                    "parent_id": "t1_fz1qy2m",
                    "score": 3,
                    "created_utc": 1595557151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks",
            "author": null,
            "id": "fz232c6",
            "parent_id": "t1_fz1vfd0",
            "score": 1,
            "created_utc": 1595564150.0,
            "replies": []
        },
        {
            "body": "I dont think that is true in her case. The money is important but she is giving her SD exactly what he is paying for. Not a scam",
            "author": "AFSMSgt",
            "id": "fz1cmke",
            "parent_id": "t1_fz100eo",
            "score": 5,
            "created_utc": 1595548811.0,
            "replies": []
        },
        {
            "body": "They are happily giving me money. I don’t need to scam men because they are willingly giving me. The platonic SD we become friends/acquaintances, and I know I can ask him anything when I want. And he text me every now and then to know how I’m seeing and never asked any type of « refund »",
            "author": "Lilipuss25",
            "id": "fz2chyt",
            "parent_id": "t1_fz100eo",
            "score": 3,
            "created_utc": 1595570933.0,
            "replies": []
        },
        {
            "body": "I agree it's not fair.  As a SD I wasn't sure why I got in the bowl or what I was looking for.  I don't know what the right reason is.   I went through a lot of fakes, rinsers and scammers and it cost me a chunk of money.  But I met a young woman (20), me (57) who became my sb, then sgf and now vanilla gf and we have fallen madly in love with each other.  We are living our lives together and we are happy and that's what counts.",
            "author": "rjjr1963",
            "id": "fz2nzps",
            "parent_id": "t1_fz1dpt6",
            "score": 3,
            "created_utc": 1595581707.0,
            "replies": [
                {
                    "body": "that is amazing! Lucky you :)",
                    "author": null,
                    "id": "fz89ot7",
                    "parent_id": "t1_fz2nzps",
                    "score": 2,
                    "created_utc": 1595707487.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah there's really not many like you. Very few I'm afraid. Which is sad. Don't take offense but I tend to call the Generation Z, generation zombies. But it's good to see that there is some light in the abyss such as yourself.",
            "author": "Jdn345",
            "id": "fz1mf5s",
            "parent_id": "t1_fz1dpt6",
            "score": 1,
            "created_utc": 1595554346.0,
            "replies": []
        },
        {
            "body": "Is *what* her fault?",
            "author": "TY2022",
            "id": "fz15wdi",
            "parent_id": "t1_fz103yp",
            "score": 1,
            "created_utc": 1595545276.0,
            "replies": []
        },
        {
            "body": "Two heads and only enough blood for one.",
            "author": "LoftDaddy",
            "id": "fz0pzuf",
            "parent_id": "t1_fz0kd5w",
            "score": 8,
            "created_utc": 1595537270.0,
            "replies": []
        },
        {
            "body": "Mine was stupid, as crossed over into the 50's my brain got the lead on that little bastard.",
            "author": null,
            "id": "fz0x6p3",
            "parent_id": "t1_fz0kd5w",
            "score": 7,
            "created_utc": 1595540855.0,
            "replies": [
                {
                    "body": "This whole thread made me chuckle.",
                    "author": "gixxer_baby",
                    "id": "fz178ys",
                    "parent_id": "t1_fz0x6p3",
                    "score": 2,
                    "created_utc": 1595545987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Penises at all ages during and after puberty are stupid lol. Hopefully when you get older you get that fucker under a little better control.",
            "author": "Jdn345",
            "id": "fz1ms88",
            "parent_id": "t1_fz0kd5w",
            "score": 2,
            "created_utc": 1595554557.0,
            "replies": []
        },
        {
            "body": "also gullible, kind, lonely is a type. Choose 1 2 or 3.",
            "author": "amigodeface",
            "id": "fz2rf9o",
            "parent_id": "t1_fz0kd5w",
            "score": 1,
            "created_utc": 1595585140.0,
            "replies": []
        },
        {
            "body": "He who has the gold makes the rules. And my rule is that anybody who asks for money before the M&G is a hard “next”. If they need to be paid back for an Uber or gas or other expenses, I’m happy to give them that. In cash. At the M&G. \n\nIt’s harsh to say, but if the SD’s time wasn’t a lot more valuable than the SB’s time, they wouldn’t be talking, would they?",
            "author": "LaGriffeDuLion",
            "id": "fz1wjpc",
            "parent_id": "t1_fz0tw6d",
            "score": 4,
            "created_utc": 1595560196.0,
            "replies": []
        },
        {
            "body": "It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is. The SDs shouldn’t be getting time and attention just free. Period",
            "author": "prettylilprostitute",
            "id": "fz0ur59",
            "parent_id": "t1_fz0tw6d",
            "score": -2,
            "created_utc": 1595539649.0,
            "replies": [
                {
                    "body": "Christ, you are entitled. You really think you should be paid for men to stare at you?",
                    "author": "sdthrowout23",
                    "id": "fz10cpq",
                    "parent_id": "t1_fz0ur59",
                    "score": 4,
                    "created_utc": 1595542435.0,
                    "replies": [
                        {
                            "body": "> Christ, you are entitled.\n\nNot really;  she is an escort.  It's very hard for someone in that line of work - to not see sugaring as an extension of it.",
                            "author": "SDstartingOut",
                            "id": "fz38vfk",
                            "parent_id": "t1_fz10cpq",
                            "score": 0,
                            "created_utc": 1595598436.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz0uzaj",
                    "parent_id": "t1_fz0ur59",
                    "score": -1,
                    "created_utc": 1595539762.0,
                    "replies": [
                        {
                            "body": "With all due respect- I’m not",
                            "author": "prettylilprostitute",
                            "id": "fz0v22k",
                            "parent_id": "t1_fz0uzaj",
                            "score": -3,
                            "created_utc": 1595539802.0,
                            "replies": []
                        },
                        {
                            "body": "Always is",
                            "author": "mraspencer",
                            "id": "fz16qqc",
                            "parent_id": "t1_fz0uzaj",
                            "score": -1,
                            "created_utc": 1595545722.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is.\n\nBecause sugaring is not strictly sex work (some treat it as such, some do not);  and the platform is not geared towards prostitutes.",
                    "author": "SDstartingOut",
                    "id": "fz38pwl",
                    "parent_id": "t1_fz0ur59",
                    "score": -1,
                    "created_utc": 1595598347.0,
                    "replies": [
                        {
                            "body": "Regardless of whether it’s sex work or not- this subreddit and SA in general is backwards.",
                            "author": "prettylilprostitute",
                            "id": "fz54vq6",
                            "parent_id": "t1_fz38pwl",
                            "score": 1,
                            "created_utc": 1595631988.0,
                            "replies": [
                                {
                                    "body": "And it's not surprising that someone that views sugaring as an extension of escorting - which is not what SA (nor this sub) are geared towards - would have that view point.",
                                    "author": "SDstartingOut",
                                    "id": "fz55jbt",
                                    "parent_id": "t1_fz54vq6",
                                    "score": 1,
                                    "created_utc": 1595632340.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If they ask, I'm gone. But I offer to pay their transportation expense, and i do give a gift. But only because i want to not because it was required for the m&g",
            "author": "AFSMSgt",
            "id": "fz1d5y6",
            "parent_id": "t1_fz0tw6d",
            "score": 0,
            "created_utc": 1595549109.0,
            "replies": [
                {
                    "body": "Yeah I usually offer something although it's not going to be a full amount then I would otherwise be getting later on if it worked out",
                    "author": "Jdn345",
                    "id": "fz1o6si",
                    "parent_id": "t1_fz1d5y6",
                    "score": 0,
                    "created_utc": 1595555363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz1ht09",
            "parent_id": "t1_fz0y07i",
            "score": 7,
            "created_utc": 1595551685.0,
            "replies": [
                {
                    "body": "Yeah I don't ever contact women that put platonic or say anything about it. And I usually let them know before we ever meet I'm looking for a traditional SB / SD relationship",
                    "author": "Jdn345",
                    "id": "fz1oh1f",
                    "parent_id": "t1_fz1ht09",
                    "score": 2,
                    "created_utc": 1595555526.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz1prtf",
                            "parent_id": "t1_fz1oh1f",
                            "score": 2,
                            "created_utc": 1595556266.0,
                            "replies": [
                                {
                                    "body": "Well you do still have to take it with a grain of salt. It takes time to gain Trust. But I try to be as upfront as I can.",
                                    "author": "Jdn345",
                                    "id": "fz1qaax",
                                    "parent_id": "t1_fz1prtf",
                                    "score": 1,
                                    "created_utc": 1595556560.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If a guy is getting what he paid, it's  not a scam.",
            "author": "AFSMSgt",
            "id": "fz1dhqw",
            "parent_id": "t1_fz0y07i",
            "score": 2,
            "created_utc": 1595549291.0,
            "replies": []
        },
        {
            "body": "There are actually some sugar daddy’s and mamas that really jus wanna talk. No sex. Or they want nasty phone calls.  They respect ur boundaries and jus happy to have a bad bih",
            "author": "yungbutthole",
            "id": "fz1cx9k",
            "parent_id": "t1_fz1cqfs",
            "score": 5,
            "created_utc": 1595548977.0,
            "replies": [
                {
                    "body": "That is amazing! But also, that is putting effort and time in for something in return. Not just give me money cuz im me and you are my SD.",
                    "author": null,
                    "id": "fz1e01z",
                    "parent_id": "t1_fz1cx9k",
                    "score": 6,
                    "created_utc": 1595549570.0,
                    "replies": [
                        {
                            "body": "That’s true.",
                            "author": "yungbutthole",
                            "id": "fz1mnqn",
                            "parent_id": "t1_fz1e01z",
                            "score": 3,
                            "created_utc": 1595554484.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Statistically these people don’t exist. Everyone has heard the third-hand rumors but nobody seems to have actually met one.",
                    "author": "LaGriffeDuLion",
                    "id": "fz1xdhp",
                    "parent_id": "t1_fz1cx9k",
                    "score": 1,
                    "created_utc": 1595560683.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz33xpv",
                            "parent_id": "t1_fz1xdhp",
                            "score": 2,
                            "created_utc": 1595595431.0,
                            "replies": [
                                {
                                    "body": "I’m guessing that they want more and she gets a date or two out of it and then it fizzles. I’d also speculate that the guys she’s seeing are very new to the sugar bowl and haven’t been rinsed enough yet to be over it — at some point they will stop agreeing to paid M&Gs with anyone. It’s my theory, for reasons I detailed in another post, that the supply of men willing to do that is slowly shrinking over time. The bowl is still a growing market, when it reaches a stable state, I think paid M&Gs will be a thing of the past. \n\nI’ve been on WYP dates where I’ve cheerfully paid for a date because sometimes I just want to grab a steak with a hottie when I’m between SBs. But I rarely go on a second date with them because “one and done” is kinda the whole point of WYP — to me, anyway.",
                                    "author": "LaGriffeDuLion",
                                    "id": "fz35ge5",
                                    "parent_id": "t1_fz33xpv",
                                    "score": 2,
                                    "created_utc": 1595596390.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz35z2p",
                                            "parent_id": "t1_fz35ge5",
                                            "score": 1,
                                            "created_utc": 1595596710.0,
                                            "replies": [
                                                {
                                                    "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                                                    "author": "LaGriffeDuLion",
                                                    "id": "fz39ctq",
                                                    "parent_id": "t1_fz35z2p",
                                                    "score": 0,
                                                    "created_utc": 1595598709.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Okay but that’s not a sugar baby imo. 🤷‍♀️Just like every girl who’s gone on two dates from WYP are not sugar babies and every guy with an account there is not a sugar daddy",
                                    "author": "jszly",
                                    "id": "fz54624",
                                    "parent_id": "t1_fz33xpv",
                                    "score": 1,
                                    "created_utc": 1595631597.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Um that’s great but is that a SR???? I feel like these days we call *anything* a SR. It is okay for dynamics to exist outside of sugaring that don’t have an exact name. To me, paying a woman for sex calls is in the same line as cam girls. Just because a man paid a woman in exchange for ~sexual energy does not make it sugaring. The actual definition of sugaring has a relationship component historically. And historically, all that other little shit would’ve been for the escorts.\n\nThanks to social media we believe anything someone claims with no verifying questions. Girls (like my niece) are getting $20 for sexting and undies pics. She is not a sugar baby....but let her tell it...🙄🤦‍♀️",
                    "author": "jszly",
                    "id": "fz53tnh",
                    "parent_id": "t1_fz1cx9k",
                    "score": 0,
                    "created_utc": 1595631407.0,
                    "replies": [
                        {
                            "body": "Like everything the definitions and dynamic of a relationship are subject to change. It’s different for everybody. Gatekeeping doesn’t help the new girls figure out how to truly get this coin and make a better life for themselves.",
                            "author": "yungbutthole",
                            "id": "fz5shxd",
                            "parent_id": "t1_fz53tnh",
                            "score": 1,
                            "created_utc": 1595645702.0,
                            "replies": [
                                {
                                    "body": "I’m not trying to gatekeep anymore than the OP is for saying scamming men is not what a SR is. Call it what you want, but not every activity that involves money from older men is a SR which is what I mean. it makes it hard for people who do sugar to trust intentions on women’s ends when women who have no intentions of a relationship crowd the space. It’s like if I said I was an escort but platonically.... like no that’s something else.",
                                    "author": "jszly",
                                    "id": "fz5w0qx",
                                    "parent_id": "t1_fz5shxd",
                                    "score": 1,
                                    "created_utc": 1595647955.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They're messing us all up",
            "author": "Jdn345",
            "id": "fz1oj8f",
            "parent_id": "t1_fz1c64k",
            "score": 2,
            "created_utc": 1595555561.0,
            "replies": []
        },
        {
            "body": "And there it is! It is the guys fault the women on seeking suck!!",
            "author": "sdthrowout23",
            "id": "fz0xxvc",
            "parent_id": "t1_fz0v6hb",
            "score": 4,
            "created_utc": 1595541226.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz0y4yr",
                    "parent_id": "t1_fz0xxvc",
                    "score": 3,
                    "created_utc": 1595541323.0,
                    "replies": [
                        {
                            "body": "You definitely misunderstood what he is saying I think. If women are going to say they need paid for platonic dates to build a connection that is the equivalent of men saying they need free sex to test for chemistry. Neither is acceptable.\n\nYou however blaming the guy for falling for a scam is pretty dreadful. Imagine if someone took that line with sexual assault, for example.",
                            "author": "sdthrowout23",
                            "id": "fz0zts7",
                            "parent_id": "t1_fz0y4yr",
                            "score": 1,
                            "created_utc": 1595542169.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz1166v",
                                    "parent_id": "t1_fz0zts7",
                                    "score": 1,
                                    "created_utc": 1595542845.0,
                                    "replies": [
                                        {
                                            "body": "We tend to think with little helmet head.",
                                            "author": "AFSMSgt",
                                            "id": "fz196i8",
                                            "parent_id": "t1_fz1166v",
                                            "score": 1,
                                            "created_utc": 1595546984.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fz199sx",
                                                    "parent_id": "t1_fz196i8",
                                                    "score": 1,
                                                    "created_utc": 1595547031.0,
                                                    "replies": [
                                                        {
                                                            "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                                                            "author": "Jdn345",
                                                            "id": "fz1p1jz",
                                                            "parent_id": "t1_fz199sx",
                                                            "score": 1,
                                                            "created_utc": 1595555850.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you. It was meant to be. After my own children, my sugar babies are the best thing to ever happen to me. You have brought such joy into my life.",
            "author": "AFSMSgt",
            "id": "fz2yjsf",
            "parent_id": "t1_fz1v90e",
            "score": 3,
            "created_utc": 1595591577.0,
            "replies": []
        },
        {
            "body": "I never sat ALL granddad's are great. Lol",
            "author": "AFSMSgt",
            "id": "fz6p295",
            "parent_id": "t1_fz65rfk",
            "score": 1,
            "created_utc": 1595673771.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzorqkb",
            "parent_id": "t1_fz1lekr",
            "score": 1,
            "created_utc": 1596075232.0,
            "replies": [
                {
                    "body": "Well it's always good when Sig gets to play. He's named after my pistol. A Sig Sauer full-size Legion 45 cal! Lol. Boom boom boom! Boom!",
                    "author": "Jdn345",
                    "id": "fzosn9o",
                    "parent_id": "t1_fzorqkb",
                    "score": 1,
                    "created_utc": 1596075764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like that, cost of doing business. I'm a framing contractor and I want said that to one of my builders and he about flipped out lol. He was bitching about Lumber being wasted and I was telling him that some waste is inevitable. Part of the cost of doing business. He didn't like that at all but he was a dick head anyway. He went into my discarded Builder list.",
            "author": "Jdn345",
            "id": "fz3s5hy",
            "parent_id": "t1_fz32rax",
            "score": 2,
            "created_utc": 1595608154.0,
            "replies": []
        },
        {
            "body": "That's kind of my reasoning I'm giving a Benjamin. I can't say that I always offered ahead of time but I do give it for the same reason as you state",
            "author": "Jdn345",
            "id": "fz1rb5g",
            "parent_id": "t1_fz1qy2m",
            "score": 3,
            "created_utc": 1595557151.0,
            "replies": []
        },
        {
            "body": "that is amazing! Lucky you :)",
            "author": null,
            "id": "fz89ot7",
            "parent_id": "t1_fz2nzps",
            "score": 2,
            "created_utc": 1595707487.0,
            "replies": []
        },
        {
            "body": "This whole thread made me chuckle.",
            "author": "gixxer_baby",
            "id": "fz178ys",
            "parent_id": "t1_fz0x6p3",
            "score": 2,
            "created_utc": 1595545987.0,
            "replies": []
        },
        {
            "body": "Christ, you are entitled. You really think you should be paid for men to stare at you?",
            "author": "sdthrowout23",
            "id": "fz10cpq",
            "parent_id": "t1_fz0ur59",
            "score": 4,
            "created_utc": 1595542435.0,
            "replies": [
                {
                    "body": "> Christ, you are entitled.\n\nNot really;  she is an escort.  It's very hard for someone in that line of work - to not see sugaring as an extension of it.",
                    "author": "SDstartingOut",
                    "id": "fz38vfk",
                    "parent_id": "t1_fz10cpq",
                    "score": 0,
                    "created_utc": 1595598436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz0uzaj",
            "parent_id": "t1_fz0ur59",
            "score": -1,
            "created_utc": 1595539762.0,
            "replies": [
                {
                    "body": "With all due respect- I’m not",
                    "author": "prettylilprostitute",
                    "id": "fz0v22k",
                    "parent_id": "t1_fz0uzaj",
                    "score": -3,
                    "created_utc": 1595539802.0,
                    "replies": []
                },
                {
                    "body": "Always is",
                    "author": "mraspencer",
                    "id": "fz16qqc",
                    "parent_id": "t1_fz0uzaj",
                    "score": -1,
                    "created_utc": 1595545722.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> It’s a red flag because SA caters to SDs and the way the platform works is completely backwards from how sex worker/ sugaring truly is.\n\nBecause sugaring is not strictly sex work (some treat it as such, some do not);  and the platform is not geared towards prostitutes.",
            "author": "SDstartingOut",
            "id": "fz38pwl",
            "parent_id": "t1_fz0ur59",
            "score": -1,
            "created_utc": 1595598347.0,
            "replies": [
                {
                    "body": "Regardless of whether it’s sex work or not- this subreddit and SA in general is backwards.",
                    "author": "prettylilprostitute",
                    "id": "fz54vq6",
                    "parent_id": "t1_fz38pwl",
                    "score": 1,
                    "created_utc": 1595631988.0,
                    "replies": [
                        {
                            "body": "And it's not surprising that someone that views sugaring as an extension of escorting - which is not what SA (nor this sub) are geared towards - would have that view point.",
                            "author": "SDstartingOut",
                            "id": "fz55jbt",
                            "parent_id": "t1_fz54vq6",
                            "score": 1,
                            "created_utc": 1595632340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I usually offer something although it's not going to be a full amount then I would otherwise be getting later on if it worked out",
            "author": "Jdn345",
            "id": "fz1o6si",
            "parent_id": "t1_fz1d5y6",
            "score": 0,
            "created_utc": 1595555363.0,
            "replies": []
        },
        {
            "body": "Yeah I don't ever contact women that put platonic or say anything about it. And I usually let them know before we ever meet I'm looking for a traditional SB / SD relationship",
            "author": "Jdn345",
            "id": "fz1oh1f",
            "parent_id": "t1_fz1ht09",
            "score": 2,
            "created_utc": 1595555526.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz1prtf",
                    "parent_id": "t1_fz1oh1f",
                    "score": 2,
                    "created_utc": 1595556266.0,
                    "replies": [
                        {
                            "body": "Well you do still have to take it with a grain of salt. It takes time to gain Trust. But I try to be as upfront as I can.",
                            "author": "Jdn345",
                            "id": "fz1qaax",
                            "parent_id": "t1_fz1prtf",
                            "score": 1,
                            "created_utc": 1595556560.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is amazing! But also, that is putting effort and time in for something in return. Not just give me money cuz im me and you are my SD.",
            "author": null,
            "id": "fz1e01z",
            "parent_id": "t1_fz1cx9k",
            "score": 6,
            "created_utc": 1595549570.0,
            "replies": [
                {
                    "body": "That’s true.",
                    "author": "yungbutthole",
                    "id": "fz1mnqn",
                    "parent_id": "t1_fz1e01z",
                    "score": 3,
                    "created_utc": 1595554484.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Statistically these people don’t exist. Everyone has heard the third-hand rumors but nobody seems to have actually met one.",
            "author": "LaGriffeDuLion",
            "id": "fz1xdhp",
            "parent_id": "t1_fz1cx9k",
            "score": 1,
            "created_utc": 1595560683.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz33xpv",
                    "parent_id": "t1_fz1xdhp",
                    "score": 2,
                    "created_utc": 1595595431.0,
                    "replies": [
                        {
                            "body": "I’m guessing that they want more and she gets a date or two out of it and then it fizzles. I’d also speculate that the guys she’s seeing are very new to the sugar bowl and haven’t been rinsed enough yet to be over it — at some point they will stop agreeing to paid M&Gs with anyone. It’s my theory, for reasons I detailed in another post, that the supply of men willing to do that is slowly shrinking over time. The bowl is still a growing market, when it reaches a stable state, I think paid M&Gs will be a thing of the past. \n\nI’ve been on WYP dates where I’ve cheerfully paid for a date because sometimes I just want to grab a steak with a hottie when I’m between SBs. But I rarely go on a second date with them because “one and done” is kinda the whole point of WYP — to me, anyway.",
                            "author": "LaGriffeDuLion",
                            "id": "fz35ge5",
                            "parent_id": "t1_fz33xpv",
                            "score": 2,
                            "created_utc": 1595596390.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz35z2p",
                                    "parent_id": "t1_fz35ge5",
                                    "score": 1,
                                    "created_utc": 1595596710.0,
                                    "replies": [
                                        {
                                            "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                                            "author": "LaGriffeDuLion",
                                            "id": "fz39ctq",
                                            "parent_id": "t1_fz35z2p",
                                            "score": 0,
                                            "created_utc": 1595598709.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Okay but that’s not a sugar baby imo. 🤷‍♀️Just like every girl who’s gone on two dates from WYP are not sugar babies and every guy with an account there is not a sugar daddy",
                            "author": "jszly",
                            "id": "fz54624",
                            "parent_id": "t1_fz33xpv",
                            "score": 1,
                            "created_utc": 1595631597.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Um that’s great but is that a SR???? I feel like these days we call *anything* a SR. It is okay for dynamics to exist outside of sugaring that don’t have an exact name. To me, paying a woman for sex calls is in the same line as cam girls. Just because a man paid a woman in exchange for ~sexual energy does not make it sugaring. The actual definition of sugaring has a relationship component historically. And historically, all that other little shit would’ve been for the escorts.\n\nThanks to social media we believe anything someone claims with no verifying questions. Girls (like my niece) are getting $20 for sexting and undies pics. She is not a sugar baby....but let her tell it...🙄🤦‍♀️",
            "author": "jszly",
            "id": "fz53tnh",
            "parent_id": "t1_fz1cx9k",
            "score": 0,
            "created_utc": 1595631407.0,
            "replies": [
                {
                    "body": "Like everything the definitions and dynamic of a relationship are subject to change. It’s different for everybody. Gatekeeping doesn’t help the new girls figure out how to truly get this coin and make a better life for themselves.",
                    "author": "yungbutthole",
                    "id": "fz5shxd",
                    "parent_id": "t1_fz53tnh",
                    "score": 1,
                    "created_utc": 1595645702.0,
                    "replies": [
                        {
                            "body": "I’m not trying to gatekeep anymore than the OP is for saying scamming men is not what a SR is. Call it what you want, but not every activity that involves money from older men is a SR which is what I mean. it makes it hard for people who do sugar to trust intentions on women’s ends when women who have no intentions of a relationship crowd the space. It’s like if I said I was an escort but platonically.... like no that’s something else.",
                            "author": "jszly",
                            "id": "fz5w0qx",
                            "parent_id": "t1_fz5shxd",
                            "score": 1,
                            "created_utc": 1595647955.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz0y4yr",
            "parent_id": "t1_fz0xxvc",
            "score": 3,
            "created_utc": 1595541323.0,
            "replies": [
                {
                    "body": "You definitely misunderstood what he is saying I think. If women are going to say they need paid for platonic dates to build a connection that is the equivalent of men saying they need free sex to test for chemistry. Neither is acceptable.\n\nYou however blaming the guy for falling for a scam is pretty dreadful. Imagine if someone took that line with sexual assault, for example.",
                    "author": "sdthrowout23",
                    "id": "fz0zts7",
                    "parent_id": "t1_fz0y4yr",
                    "score": 1,
                    "created_utc": 1595542169.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz1166v",
                            "parent_id": "t1_fz0zts7",
                            "score": 1,
                            "created_utc": 1595542845.0,
                            "replies": [
                                {
                                    "body": "We tend to think with little helmet head.",
                                    "author": "AFSMSgt",
                                    "id": "fz196i8",
                                    "parent_id": "t1_fz1166v",
                                    "score": 1,
                                    "created_utc": 1595546984.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fz199sx",
                                            "parent_id": "t1_fz196i8",
                                            "score": 1,
                                            "created_utc": 1595547031.0,
                                            "replies": [
                                                {
                                                    "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                                                    "author": "Jdn345",
                                                    "id": "fz1p1jz",
                                                    "parent_id": "t1_fz199sx",
                                                    "score": 1,
                                                    "created_utc": 1595555850.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well it's always good when Sig gets to play. He's named after my pistol. A Sig Sauer full-size Legion 45 cal! Lol. Boom boom boom! Boom!",
            "author": "Jdn345",
            "id": "fzosn9o",
            "parent_id": "t1_fzorqkb",
            "score": 1,
            "created_utc": 1596075764.0,
            "replies": []
        },
        {
            "body": "> Christ, you are entitled.\n\nNot really;  she is an escort.  It's very hard for someone in that line of work - to not see sugaring as an extension of it.",
            "author": "SDstartingOut",
            "id": "fz38vfk",
            "parent_id": "t1_fz10cpq",
            "score": 0,
            "created_utc": 1595598436.0,
            "replies": []
        },
        {
            "body": "With all due respect- I’m not",
            "author": "prettylilprostitute",
            "id": "fz0v22k",
            "parent_id": "t1_fz0uzaj",
            "score": -3,
            "created_utc": 1595539802.0,
            "replies": []
        },
        {
            "body": "Always is",
            "author": "mraspencer",
            "id": "fz16qqc",
            "parent_id": "t1_fz0uzaj",
            "score": -1,
            "created_utc": 1595545722.0,
            "replies": []
        },
        {
            "body": "Regardless of whether it’s sex work or not- this subreddit and SA in general is backwards.",
            "author": "prettylilprostitute",
            "id": "fz54vq6",
            "parent_id": "t1_fz38pwl",
            "score": 1,
            "created_utc": 1595631988.0,
            "replies": [
                {
                    "body": "And it's not surprising that someone that views sugaring as an extension of escorting - which is not what SA (nor this sub) are geared towards - would have that view point.",
                    "author": "SDstartingOut",
                    "id": "fz55jbt",
                    "parent_id": "t1_fz54vq6",
                    "score": 1,
                    "created_utc": 1595632340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz1prtf",
            "parent_id": "t1_fz1oh1f",
            "score": 2,
            "created_utc": 1595556266.0,
            "replies": [
                {
                    "body": "Well you do still have to take it with a grain of salt. It takes time to gain Trust. But I try to be as upfront as I can.",
                    "author": "Jdn345",
                    "id": "fz1qaax",
                    "parent_id": "t1_fz1prtf",
                    "score": 1,
                    "created_utc": 1595556560.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s true.",
            "author": "yungbutthole",
            "id": "fz1mnqn",
            "parent_id": "t1_fz1e01z",
            "score": 3,
            "created_utc": 1595554484.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz33xpv",
            "parent_id": "t1_fz1xdhp",
            "score": 2,
            "created_utc": 1595595431.0,
            "replies": [
                {
                    "body": "I’m guessing that they want more and she gets a date or two out of it and then it fizzles. I’d also speculate that the guys she’s seeing are very new to the sugar bowl and haven’t been rinsed enough yet to be over it — at some point they will stop agreeing to paid M&Gs with anyone. It’s my theory, for reasons I detailed in another post, that the supply of men willing to do that is slowly shrinking over time. The bowl is still a growing market, when it reaches a stable state, I think paid M&Gs will be a thing of the past. \n\nI’ve been on WYP dates where I’ve cheerfully paid for a date because sometimes I just want to grab a steak with a hottie when I’m between SBs. But I rarely go on a second date with them because “one and done” is kinda the whole point of WYP — to me, anyway.",
                    "author": "LaGriffeDuLion",
                    "id": "fz35ge5",
                    "parent_id": "t1_fz33xpv",
                    "score": 2,
                    "created_utc": 1595596390.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz35z2p",
                            "parent_id": "t1_fz35ge5",
                            "score": 1,
                            "created_utc": 1595596710.0,
                            "replies": [
                                {
                                    "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                                    "author": "LaGriffeDuLion",
                                    "id": "fz39ctq",
                                    "parent_id": "t1_fz35z2p",
                                    "score": 0,
                                    "created_utc": 1595598709.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Okay but that’s not a sugar baby imo. 🤷‍♀️Just like every girl who’s gone on two dates from WYP are not sugar babies and every guy with an account there is not a sugar daddy",
                    "author": "jszly",
                    "id": "fz54624",
                    "parent_id": "t1_fz33xpv",
                    "score": 1,
                    "created_utc": 1595631597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like everything the definitions and dynamic of a relationship are subject to change. It’s different for everybody. Gatekeeping doesn’t help the new girls figure out how to truly get this coin and make a better life for themselves.",
            "author": "yungbutthole",
            "id": "fz5shxd",
            "parent_id": "t1_fz53tnh",
            "score": 1,
            "created_utc": 1595645702.0,
            "replies": [
                {
                    "body": "I’m not trying to gatekeep anymore than the OP is for saying scamming men is not what a SR is. Call it what you want, but not every activity that involves money from older men is a SR which is what I mean. it makes it hard for people who do sugar to trust intentions on women’s ends when women who have no intentions of a relationship crowd the space. It’s like if I said I was an escort but platonically.... like no that’s something else.",
                    "author": "jszly",
                    "id": "fz5w0qx",
                    "parent_id": "t1_fz5shxd",
                    "score": 1,
                    "created_utc": 1595647955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You definitely misunderstood what he is saying I think. If women are going to say they need paid for platonic dates to build a connection that is the equivalent of men saying they need free sex to test for chemistry. Neither is acceptable.\n\nYou however blaming the guy for falling for a scam is pretty dreadful. Imagine if someone took that line with sexual assault, for example.",
            "author": "sdthrowout23",
            "id": "fz0zts7",
            "parent_id": "t1_fz0y4yr",
            "score": 1,
            "created_utc": 1595542169.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz1166v",
                    "parent_id": "t1_fz0zts7",
                    "score": 1,
                    "created_utc": 1595542845.0,
                    "replies": [
                        {
                            "body": "We tend to think with little helmet head.",
                            "author": "AFSMSgt",
                            "id": "fz196i8",
                            "parent_id": "t1_fz1166v",
                            "score": 1,
                            "created_utc": 1595546984.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fz199sx",
                                    "parent_id": "t1_fz196i8",
                                    "score": 1,
                                    "created_utc": 1595547031.0,
                                    "replies": [
                                        {
                                            "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                                            "author": "Jdn345",
                                            "id": "fz1p1jz",
                                            "parent_id": "t1_fz199sx",
                                            "score": 1,
                                            "created_utc": 1595555850.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And it's not surprising that someone that views sugaring as an extension of escorting - which is not what SA (nor this sub) are geared towards - would have that view point.",
            "author": "SDstartingOut",
            "id": "fz55jbt",
            "parent_id": "t1_fz54vq6",
            "score": 1,
            "created_utc": 1595632340.0,
            "replies": []
        },
        {
            "body": "Well you do still have to take it with a grain of salt. It takes time to gain Trust. But I try to be as upfront as I can.",
            "author": "Jdn345",
            "id": "fz1qaax",
            "parent_id": "t1_fz1prtf",
            "score": 1,
            "created_utc": 1595556560.0,
            "replies": []
        },
        {
            "body": "I’m guessing that they want more and she gets a date or two out of it and then it fizzles. I’d also speculate that the guys she’s seeing are very new to the sugar bowl and haven’t been rinsed enough yet to be over it — at some point they will stop agreeing to paid M&Gs with anyone. It’s my theory, for reasons I detailed in another post, that the supply of men willing to do that is slowly shrinking over time. The bowl is still a growing market, when it reaches a stable state, I think paid M&Gs will be a thing of the past. \n\nI’ve been on WYP dates where I’ve cheerfully paid for a date because sometimes I just want to grab a steak with a hottie when I’m between SBs. But I rarely go on a second date with them because “one and done” is kinda the whole point of WYP — to me, anyway.",
            "author": "LaGriffeDuLion",
            "id": "fz35ge5",
            "parent_id": "t1_fz33xpv",
            "score": 2,
            "created_utc": 1595596390.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz35z2p",
                    "parent_id": "t1_fz35ge5",
                    "score": 1,
                    "created_utc": 1595596710.0,
                    "replies": [
                        {
                            "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                            "author": "LaGriffeDuLion",
                            "id": "fz39ctq",
                            "parent_id": "t1_fz35z2p",
                            "score": 0,
                            "created_utc": 1595598709.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay but that’s not a sugar baby imo. 🤷‍♀️Just like every girl who’s gone on two dates from WYP are not sugar babies and every guy with an account there is not a sugar daddy",
            "author": "jszly",
            "id": "fz54624",
            "parent_id": "t1_fz33xpv",
            "score": 1,
            "created_utc": 1595631597.0,
            "replies": []
        },
        {
            "body": "I’m not trying to gatekeep anymore than the OP is for saying scamming men is not what a SR is. Call it what you want, but not every activity that involves money from older men is a SR which is what I mean. it makes it hard for people who do sugar to trust intentions on women’s ends when women who have no intentions of a relationship crowd the space. It’s like if I said I was an escort but platonically.... like no that’s something else.",
            "author": "jszly",
            "id": "fz5w0qx",
            "parent_id": "t1_fz5shxd",
            "score": 1,
            "created_utc": 1595647955.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz1166v",
            "parent_id": "t1_fz0zts7",
            "score": 1,
            "created_utc": 1595542845.0,
            "replies": [
                {
                    "body": "We tend to think with little helmet head.",
                    "author": "AFSMSgt",
                    "id": "fz196i8",
                    "parent_id": "t1_fz1166v",
                    "score": 1,
                    "created_utc": 1595546984.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fz199sx",
                            "parent_id": "t1_fz196i8",
                            "score": 1,
                            "created_utc": 1595547031.0,
                            "replies": [
                                {
                                    "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                                    "author": "Jdn345",
                                    "id": "fz1p1jz",
                                    "parent_id": "t1_fz199sx",
                                    "score": 1,
                                    "created_utc": 1595555850.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz35z2p",
            "parent_id": "t1_fz35ge5",
            "score": 1,
            "created_utc": 1595596710.0,
            "replies": [
                {
                    "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
                    "author": "LaGriffeDuLion",
                    "id": "fz39ctq",
                    "parent_id": "t1_fz35z2p",
                    "score": 0,
                    "created_utc": 1595598709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We tend to think with little helmet head.",
            "author": "AFSMSgt",
            "id": "fz196i8",
            "parent_id": "t1_fz1166v",
            "score": 1,
            "created_utc": 1595546984.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fz199sx",
                    "parent_id": "t1_fz196i8",
                    "score": 1,
                    "created_utc": 1595547031.0,
                    "replies": [
                        {
                            "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                            "author": "Jdn345",
                            "id": "fz1p1jz",
                            "parent_id": "t1_fz199sx",
                            "score": 1,
                            "created_utc": 1595555850.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh, I agree with you there. I’m just saying that men are getting savvy at a higher rate than “delusional” men are entering the bowl; being the analytical type, I’m making the claim that “time to savvy” is dropping as is the supply of “delusional” men.",
            "author": "LaGriffeDuLion",
            "id": "fz39ctq",
            "parent_id": "t1_fz35z2p",
            "score": 0,
            "created_utc": 1595598709.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fz199sx",
            "parent_id": "t1_fz196i8",
            "score": 1,
            "created_utc": 1595547031.0,
            "replies": [
                {
                    "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
                    "author": "Jdn345",
                    "id": "fz1p1jz",
                    "parent_id": "t1_fz199sx",
                    "score": 1,
                    "created_utc": 1595555850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And it's always nice when helmet-head and Vee get together and they end up liking each other. And the good ones always end up adapting to each other very well",
            "author": "Jdn345",
            "id": "fz1p1jz",
            "parent_id": "t1_fz199sx",
            "score": 1,
            "created_utc": 1595555850.0,
            "replies": []
        }
    ]
}