{
    "title": "Ended things yesterday with a 11/10 \"I know my worth\" type",
    "post_id": "u0lkhm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/u0lkhm/ended_things_yesterday_with_a_1110_i_know_my/",
    "author": "dmwmni",
    "body": "She messaged me first about 3 months ago and her ask was 1.5x the highest I've given, but decided to carpe diem YOLO it. We've had exactly 10 intimate dates in 2 months, where 3 of those dates were full Friday to Monday weekends, which makes me feel pretty confident to say without being delusional that she genuinely liked me. After a month, she even started to not bother putting on makeup and those guady nails, and I started to feel like maybe maybe maybe we could move to allowance, but there has always been a nagging undertone of entitlement when we went out on dates.\n\nThe final straw was surprisingly over an e-bike! She's sporty like me and wanted one like mine to get to work more green, get some exercise, and use the pedal assist to not arrive sweaty. Battery tech is evolving rapidly right now, so I did some research on current models and offered to buy her one that I thought she would love because it had styling/colours that appealed more to women with great specs, it would have cost around a dozen ones with double zeros. Well, she did her own research and wanted me to get her one that was more than twice as expensive.\n\nI said \"Doesn't it give you pause that I can afford to be an SD that meets your standards, but the e-bike I bought for myself is still less than what I want to get for you? I would never think of getting the one you want for myself. How do you think I got to this financial position in life?\"\n\nShe went full on Veruca Salt.\n\nI mean, come on. She's told me it takes her 3 to 4 months to find an SD because of her standards, she has a dead end job with no advancement, lives paycheck to paycheck, spends on luxury brand nonsense, and her profile said she also wanted mentorship to raise her standard of living.\n\nShe's blowing up my phone today with a mix anger, sadness, and questionable regret.\n\nNot really looking for advice, just saying: it was worth it, for 2 months. Max.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/u0lkhm/ended_things_yesterday_with_a_1110_i_know_my/",
    "score": 170,
    "upvote_ratio": 0.93,
    "created_utc": 1649609319.0,
    "num_comments": 151,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Im sorry but Im struggling to understand what amount is ‘a dozen ones with double zeros’. Like, is that 12 + 00 so $1200? I’m so confused 😂😂😂",
            "author": "Altruistic-Lie9606",
            "id": "i472nt9",
            "parent_id": "t3_u0lkhm",
            "score": 38,
            "created_utc": 1649616341.0,
            "replies": [
                {
                    "body": "In b4 the robot comes and tells you off for mentioning amounts",
                    "author": "Blade4Hoover",
                    "id": "i47xjbi",
                    "parent_id": "t1_i472nt9",
                    "score": 15,
                    "created_utc": 1649629381.0,
                    "replies": []
                },
                {
                    "body": "Was thinking 12 x (1 concatenate 00), but yeah, 12 + 00 works too! Lol",
                    "author": "dmwmni",
                    "id": "i479hmh",
                    "parent_id": "t1_i472nt9",
                    "score": 9,
                    "created_utc": 1649619177.0,
                    "replies": [
                        {
                            "body": "Honestly, that’s NOT a very expensive bike.",
                            "author": "Pitkin_SD",
                            "id": "i4899n0",
                            "parent_id": "t1_i479hmh",
                            "score": 39,
                            "created_utc": 1649634712.0,
                            "replies": [
                                {
                                    "body": "Agreed, it's not a huge price for an e-bike. I've definitely seen plenty in the $2-3k range and even one at almost $8k. \n\nHowever I'd argue it's probably a good choice for a first e-bike like this situation. She wanted it to get to and from work, and the main reason was to not be sweaty when she arrived. There's no need for all the best specs, newest features, etc. Also there's no telling how long this \"urge\" will last before she gets over it or just finds it too inconvenient and moves on leaving the bike to sit unused.\n\nThat's besides the entire point that the e-bike that he's currently using cost less than $1200.",
                                    "author": "BlueLantern",
                                    "id": "i48gx4g",
                                    "parent_id": "t1_i4899n0",
                                    "score": 16,
                                    "created_utc": 1649638313.0,
                                    "replies": [
                                        {
                                            "body": "Personally, I think his post made her look much more entitled.\n\nAnyway….we all have our pet peeves.",
                                            "author": "Pitkin_SD",
                                            "id": "i48l234",
                                            "parent_id": "t1_i48gx4g",
                                            "score": 13,
                                            "created_utc": 1649640261.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "You are exactly correct sir.",
                                            "author": "dmwmni",
                                            "id": "i4jntcx",
                                            "parent_id": "t1_i48gx4g",
                                            "score": 4,
                                            "created_utc": 1649843476.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "My push bike cost another extra zero! My view on some of the technology things are that it is not spending too much money on because the one next year will be cheaper and better. I would never be able to justify buying an Apple Watch, but I have a few mechanical watch that is worth more than a new Accord.",
                                    "author": "SD_AU",
                                    "id": "i49jk5k",
                                    "parent_id": "t1_i4899n0",
                                    "score": 3,
                                    "created_utc": 1649660274.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "i4c5u7o",
                                    "parent_id": "t1_i4899n0",
                                    "score": 3,
                                    "created_utc": 1649708730.0,
                                    "replies": [
                                        {
                                            "body": "Yes!!!  \n\nWhen he put in the amount OP lost any of my sympathy.",
                                            "author": "Pitkin_SD",
                                            "id": "i4cxqgu",
                                            "parent_id": "t1_i4c5u7o",
                                            "score": 5,
                                            "created_utc": 1649720017.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I have one that’s double that and one that’s half that. The cheaper one is definitely more fun.",
                                    "author": "riotmaster",
                                    "id": "i48g7dj",
                                    "parent_id": "t1_i4899n0",
                                    "score": 3,
                                    "created_utc": 1649637978.0,
                                    "replies": []
                                },
                                {
                                    "body": "That's so cheap for an ebike I'd be surprised if his is cheaper.",
                                    "author": "lethalpenis",
                                    "id": "i4908hb",
                                    "parent_id": "t1_i4899n0",
                                    "score": 2,
                                    "created_utc": 1649647674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "*She went full on Veruca Salt.*\n\nAnd that, so often, is the nail in the coffin.",
            "author": "BinghamtonSD",
            "id": "i46vl5t",
            "parent_id": "t3_u0lkhm",
            "score": 56,
            "created_utc": 1649613441.0,
            "replies": [
                {
                    "body": "\nI wonder how old this person is. <25 and attractive are going to feel entitled to everything you have for going out with them. Even then, stable personality is a hole other ballgame.",
                    "author": "onlyFax_noFans",
                    "id": "i47qkat",
                    "parent_id": "t1_i46vl5t",
                    "score": 9,
                    "created_utc": 1649626359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's so funny when she says she knows her worth and yet it's in a dead end job and lives paycheck to paycheck wasting her money on things she can't afford. I have no sympathy for those types",
            "author": "Heree2Comment",
            "id": "i46yc1j",
            "parent_id": "t3_u0lkhm",
            "score": 65,
            "created_utc": 1649614562.0,
            "replies": [
                {
                    "body": ">wasting her money on things she can't afford\n\nI can't stand to see people do this.  I really gets my goat when you see sugar babies on this sub talking about wasting 7k on a fucking handbag.  \n\nYou don't spend 7k on a fucking handbag when you are living paycheck to paycheck and needing to have roommates just to make ends meet. You take that 7k and you invest it.  Then when you are a millionaire you can spend all the money you want on ugly handbags and shoes you will never wear.",
                    "author": "RTManson",
                    "id": "i47k5u0",
                    "parent_id": "t1_i46yc1j",
                    "score": 41,
                    "created_utc": 1649623624.0,
                    "replies": [
                        {
                            "body": "A 7k handbag could be an investment. Also, people who aren't rich and entitled and whose people are also not rich and entitled don't keep cash because liquid assets leak. You're not going to tell your mother you can't help with her meds while sitting on cash. But a 7k handbag isn't fungible. She's going to be able to keep that.\n\nAlso, for SBs, looking nice and fitting in amongst the wealthy are business expenses. She's investing in her career.\n\n There is also the fact that some men don't like giving money but are cool with giving gifts. Some men would much rather gift the handbag for a weekend trip than half the cost in cash paid per night.",
                            "author": "lethalpenis",
                            "id": "i48zidb",
                            "parent_id": "t1_i47k5u0",
                            "score": 10,
                            "created_utc": 1649647289.0,
                            "replies": [
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "i48zifd",
                                    "parent_id": "t1_i48zidb",
                                    "score": 1,
                                    "created_utc": 1649647290.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Bro I need 7k for my college tuitions 🫣💀",
                            "author": "Devinequicest",
                            "id": "i6ikfsn",
                            "parent_id": "t1_i47k5u0",
                            "score": 1,
                            "created_utc": 1651140383.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Let me just add this. I'm not rich or debt free. My vice isn't expensive purses or shoes, it's pussy. Could I be debt free if I put money towards my debts instead of sbs? Most definitely. But, I also pay my rent on time and my bills. \n\nIf you can't pay your basic expenses you shouldn't be worried about designer handbags.",
                    "author": "Heree2Comment",
                    "id": "i4av7k7",
                    "parent_id": "t1_i46yc1j",
                    "score": 5,
                    "created_utc": 1649689237.0,
                    "replies": []
                },
                {
                    "body": "“I know my worth, but can barely afford to pay rent so there you go lol.”",
                    "author": null,
                    "id": "i47zjqb",
                    "parent_id": "t1_i46yc1j",
                    "score": 10,
                    "created_utc": 1649630272.0,
                    "replies": []
                },
                {
                    "body": "It's an obvious flag, women who are doing dead end jobs are there because they don't know how to control their spending or they don't have any other skills or resources.  I've dealt with a few and I walked away knowing they want to indulge and not save.  They also don't want your comments about their lifestyles when it comes to lavish spending and they only make peanuts.  They are using men as their ticket to indulge but refuse to acknowledge how they can't meet their their monthly expenses.\n\nI get tired of getting called around end of month looking for some extra ppm.  I told her quite a few times her microspending needs to be limited and she just said well you can pamper me right.  Well, I can do that but I rather you take my pampering towards a better future.",
                    "author": "MKTekke",
                    "id": "i4790j5",
                    "parent_id": "t1_i46yc1j",
                    "score": 12,
                    "created_utc": 1649618979.0,
                    "replies": [
                        {
                            "body": "I was talking to this girl from SB and she was talking about how she couldn't afford her rent and how she had no luck looking for a job. Then later she's talking about going to an event with her roommate and how she had to pay 4 bills to get her hair done. 😐",
                            "author": "Heree2Comment",
                            "id": "i47hzut",
                            "parent_id": "t1_i4790j5",
                            "score": 8,
                            "created_utc": 1649622712.0,
                            "replies": [
                                {
                                    "body": "She's a professionally attractive person. Paying to get her hair done is a business expenses. It's her job.\n\nYou'll notice you weren't trying to pay a girl for company who was a little unkempt because she's working two jobs and refuses to spend on clothes that fit or makeup that won't break out her face. \n\nYou are looking to pay someone who spends their resources trying to be attractive to wealthy men who pay for company.",
                                    "author": "lethalpenis",
                                    "id": "i4903jj",
                                    "parent_id": "t1_i47hzut",
                                    "score": 17,
                                    "created_utc": 1649647599.0,
                                    "replies": [
                                        {
                                            "body": "Except she was getting her hair and nails done to go out with a friend and not the SD…so it was a leisure expense and not a business one…unless it was for another SD…in which case, the other SD’s problem.",
                                            "author": "Jahammy72",
                                            "id": "i4i539r",
                                            "parent_id": "t1_i4903jj",
                                            "score": 2,
                                            "created_utc": 1649810612.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "First off I love your name.\n\nSecondly she was a total weirdo and possible scammer. I'll possibly post about my meeting with her someday. \n\nThirdly she had no job at all.",
                                            "author": "Heree2Comment",
                                            "id": "i495sh7",
                                            "parent_id": "t1_i4903jj",
                                            "score": 4,
                                            "created_utc": 1649650807.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "u can see why they pay for company ...",
                                            "author": "103h",
                                            "id": "i7uvdff",
                                            "parent_id": "t1_i4903jj",
                                            "score": 1,
                                            "created_utc": 1652052972.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Right. That is her actual worth. From a monetary standpoint.",
                    "author": "Pretend-Complaint880",
                    "id": "i47c1b6",
                    "parent_id": "t1_i46yc1j",
                    "score": 1,
                    "created_utc": 1649620232.0,
                    "replies": []
                },
                {
                    "body": "This.",
                    "author": null,
                    "id": "i475enr",
                    "parent_id": "t1_i46yc1j",
                    "score": 0,
                    "created_utc": 1649617466.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I got an E bike too, one of those folding ones. \nI just had a ride to the Domain with my girl friend yesterday :-) \n\nI have to say they aren’t the best thing to ride to work though. It’s ridiculous I turn up at work with an E bike but I am happy to turn up with an Electric car. \n\nI do hope the battery technology gets improved and what do we do with used batteries? Dump them underground creating more junk? How is that more green than petrol? 🤔 \n\nRe your experience, some people aren’t grateful or they have higher expectations. Whatever it is for your SB, it’s a bad match. \n\nShe loves that ebike more than you. Or she loves your money more than you. \n\nBut I assume all of you SDs reading this understand this is seeking.com, not truelove.com .. \n\nVery rarely you find a girl who will love you for being you, most of them are here for money. \n\nIt reminded me that my ex-SD proactively offered to take me shopping. I asked if there was a budget. He said no. But somehow I did sense a tiny bit of hesitation. I already decided I will not go over 2k. Actually the money side was so not important. What really made me happy was he accompanied me the whole day.\n\nWhen I tried things on, he’d give opinions. His participation was much much more valuable than the items I bought. \n\nMy love language is quality time. I value peoples effort & time, especially the man I respect and I am extremely fond of. But then I am not the SB you had, she might see sugar more important than daddy. \n\nYou made a lot of effort doing your research. I’d be very grateful .. but if the bike is truly not what I want, I’d say thank you and get the one I want and pay for the difference myself.",
            "author": null,
            "id": "i47bu2a",
            "parent_id": "t3_u0lkhm",
            "score": 7,
            "created_utc": 1649620148.0,
            "replies": [
                {
                    "body": "The folding ones are usually smaller with small wheels, have to pedal a lot more to cover the same distance, so understand that it doesn't feel comfortable. These are full size, much more pleasant.\n\n> You made a lot of effort doing your research. I’d be very grateful .. but if the bike is truly not what I want, I’d say thank you and get the one I want and pay for the difference myself.\n\nThat is a respectable solution. +1",
                    "author": "dmwmni",
                    "id": "i47dbga",
                    "parent_id": "t1_i47bu2a",
                    "score": 3,
                    "created_utc": 1649620768.0,
                    "replies": [
                        {
                            "body": "Oh I am petit. A small bike just suits me fine. 😊",
                            "author": null,
                            "id": "i48imy4",
                            "parent_id": "t1_i47dbga",
                            "score": 2,
                            "created_utc": 1649639124.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is so f-ing inconsiderate of her. I always feel so guilty when people spend money on me. I can’t imagine being so entitled or so rude to you for spoiling her so much.",
            "author": null,
            "id": "i470xvw",
            "parent_id": "t3_u0lkhm",
            "score": 23,
            "created_utc": 1649615632.0,
            "replies": [
                {
                    "body": "When a person has it in their mind that it's \"expected\" that they're given gifts, then the gratefulness may fade.\n\nBless the SBs that get absolutely spoiled and remain ever thankful.  You are the real MVPs.",
                    "author": "TheSugarCouple",
                    "id": "i47o9cs",
                    "parent_id": "t1_i470xvw",
                    "score": 18,
                    "created_utc": 1649625365.0,
                    "replies": [
                        {
                            "body": "For real. This🤎 I do t expect anything and my SD gloriously delights me!!",
                            "author": "lotuskissed",
                            "id": "i481iyk",
                            "parent_id": "t1_i47o9cs",
                            "score": 3,
                            "created_utc": 1649631158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "On an unrelated front, I am thinking of getting an e-bike and the selection is ginormous.  Hard to figure out where to even start.",
            "author": "MrBuzzard",
            "id": "i46oajy",
            "parent_id": "t3_u0lkhm",
            "score": 5,
            "created_utc": 1649610528.0,
            "replies": [
                {
                    "body": "Suggest local with independent bike shops. Find the ones who pride themselves with knowledgable staff.",
                    "author": "dmwmni",
                    "id": "i46qklm",
                    "parent_id": "t1_i46oajy",
                    "score": 8,
                    "created_utc": 1649611442.0,
                    "replies": [
                        {
                            "body": "Yup this would be my suggestion u/MrBuzzard. Go to a local shop, see what they recommend. They'd also be familiar with local laws/requirements/regulations to avoid pitfalls because of stupid lawmakers. \n\nThen go home do your own research based off that. If the local shop wasn't recommending crap or trying to rip you off, try and support local businesses.\n\nThere's also subreddits like r/ebikes that would be helpful with pretty pictures, suggestions and helpful links.",
                            "author": "BlueLantern",
                            "id": "i48i9zs",
                            "parent_id": "t1_i46qklm",
                            "score": 3,
                            "created_utc": 1649638955.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Aventon is great!",
                    "author": "SD-47",
                    "id": "i47oqrf",
                    "parent_id": "t1_i46oajy",
                    "score": 2,
                    "created_utc": 1649625574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahhh I’ve had this type before. Sad to say this, but she needs a bit more tough love like yours. Tougher, even. I’d wager she’s in her 20s still? \n\nBy the time she’s in her 30s with a closet full of Veblen goods that have lost most of their worth and little else in the way of investments or savings is when she’s actually going to either start changing for real or go down a very slippery slope in life. \n\nTough, but right now she’s arguably at the peak of her life due to her looks and she can still pull this kind of behaviour off.",
            "author": "fleeingdivision",
            "id": "i48ugsq",
            "parent_id": "t3_u0lkhm",
            "score": 5,
            "created_utc": 1649644724.0,
            "replies": [
                {
                    "body": "To be fair, given that's the way it's viewed in our society \"she's at the peak of her life\" and I think a lot of dudes do view it that way, I can't say I blame her for trying to pull that kind of behaviour off. I know a lot of men do see it that way, so honestly I can understand it totally. If I were a woman, I'd probably pull the same shit lmfao",
                    "author": "generalmunks",
                    "id": "i4a3u0s",
                    "parent_id": "t1_i48ugsq",
                    "score": 6,
                    "created_utc": 1649676152.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Entitlement is the number one thing I screen for.  There are women out there that go through life with the attitude that just because they want something then that means they deserve it.  But at the same time they aren't willing to put any real work in to improve their lives.  They just expect the world to give it to them because they are pretty.\n\nI know what I offer for PPM is good for my area and every time I have agreed to see someone that wanted more I have been disappointed.  It seems to me that how they react to what I offer is a good way to gauge how they will be in a relationship.\n\nAn entitled woman will treat you like a pet wallet and get angry when you don't perform for her.  As opposed to the average sugar baby that is interested in building a real relationship with you.",
            "author": "RTManson",
            "id": "i47jipn",
            "parent_id": "t3_u0lkhm",
            "score": 13,
            "created_utc": 1649623354.0,
            "replies": [
                {
                    "body": "\"They just expect the world to give it to them because they are pretty.\"  Says the guy who expects women to give themselves to him just because he's rich.",
                    "author": "lethalpenis",
                    "id": "i490nd9",
                    "parent_id": "t1_i47jipn",
                    "score": 6,
                    "created_utc": 1649647895.0,
                    "replies": [
                        {
                            "body": "All you are really doing when you reply like this is telling everyone in this thread that you are exactly the type of person I was talking about.\n\nAnd no, I don't expect anything from a sugar baby simply because I am rich.  I want companionship and sexual access, she wants an allowance.  Both of us consider what the other has to offer a fair exchange.\n\nThe problem with entitled sugar babies is that they expect far more in return than they have to offer. It starts with asking for an unreasonably high allowance.  Then demands for extra's and gifts.  And as OP discovered they get pissy when you don't give it to them.  They also are the type to start flaking as soon as you put them on allowance. Best to just next them right away.",
                            "author": "RTManson",
                            "id": "i493qmm",
                            "parent_id": "t1_i490nd9",
                            "score": 5,
                            "created_utc": 1649649601.0,
                            "replies": [
                                {
                                    "body": "You're trading money for sex.  \nShe's trading sex for money.  \n\n\nYou're in here grumping because you didn't get the sex you wanted for the money but called her entitled and pissy because she didn't the money she wanted for the sex.   \n\n\nSounds like you're the same level of entitled and pissy except that she's running a business and you're complaining on reddit.",
                                    "author": "lethalpenis",
                                    "id": "i49738x",
                                    "parent_id": "t1_i493qmm",
                                    "score": 6,
                                    "created_utc": 1649651587.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've gotten these types and the most I can say it is you've stood your  ground and that's the most important thing to do as a SD is to maintain your composure and not let lust and indulgence affect your decisions.  A lot of SBs are very manipulative and they have learned from their past dealings where they can easily tap into the weakness of many men.",
            "author": "MKTekke",
            "id": "i46tlko",
            "parent_id": "t3_u0lkhm",
            "score": 12,
            "created_utc": 1649612640.0,
            "replies": [
                {
                    "body": "Great take, very true. I've seen it happen to a couple of friends of mine.",
                    "author": "dmwmni",
                    "id": "i46yia5",
                    "parent_id": "t1_i46tlko",
                    "score": 6,
                    "created_utc": 1649614633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> those gaudy nails\n\nSo I'm guessing your relationship didn't involve prostate massage? lol",
            "author": "Y_4Z44",
            "id": "i46nsjz",
            "parent_id": "t3_u0lkhm",
            "score": 9,
            "created_utc": 1649610328.0,
            "replies": [
                {
                    "body": "😅",
                    "author": "SunGoddessFancy",
                    "id": "i47zhtq",
                    "parent_id": "t1_i46nsjz",
                    "score": 3,
                    "created_utc": 1649630247.0,
                    "replies": []
                },
                {
                    "body": "Cheap shot. He was still smashing wasn’t he?\n\nAlways fun to hear men poke at women’s appearances when they still want to f* her. \n\nAt least the nails are removable. Being old and having saggy you know what isn’t. \n\nGood lord. I had way too much haterade tonight. \n\nBlessings to all.",
                    "author": "WokeWallflower",
                    "id": "i4c4zc4",
                    "parent_id": "t1_i46nsjz",
                    "score": 0,
                    "created_utc": 1649708404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im trying to think what it would take for some SB to be worth 1.5x my current long term SB who I would rate overall a 9, and is the highest allowance Ive agreed to.  And have to deal with entitlement on top of it. That alone is usually a deal breaker. \n\nIm struggling to come up with anything, and it's mostly sexual, sorry to say.",
            "author": "sparky_SD16",
            "id": "i46s370",
            "parent_id": "t3_u0lkhm",
            "score": 8,
            "created_utc": 1649612041.0,
            "replies": [
                {
                    "body": "You're not wrong, lol. The sex was not even great tbh, but the visuals for oral were like a dream that I thought would never actually come true. Perfect Playboy face/body/hair/bust, all natural.\n\nJust to relax on my lazyboy and .......... hmmm, maybe I should text her back ....... No, don't do it! LOL",
                    "author": "dmwmni",
                    "id": "i46u9wv",
                    "parent_id": "t1_i46s370",
                    "score": 20,
                    "created_utc": 1649612910.0,
                    "replies": [
                        {
                            "body": "And that’s the problem. Sometime the pussy is so great we get blinded and just ignore the bad times 😂",
                            "author": "SoftAndGentleSD",
                            "id": "i4ek7tn",
                            "parent_id": "t1_i46u9wv",
                            "score": 3,
                            "created_utc": 1649752899.0,
                            "replies": []
                        },
                        {
                            "body": "Text her back 😈",
                            "author": "SunGoddessFancy",
                            "id": "i47vtru",
                            "parent_id": "t1_i46u9wv",
                            "score": 6,
                            "created_utc": 1649628633.0,
                            "replies": []
                        },
                        {
                            "body": "This may be getting too NSFW for this sub, but there are times when its happening and I have my head back and eyes closed and Im like what are you doing! Need to sear every visual into my memory bank",
                            "author": "sparky_SD16",
                            "id": "i46v1z5",
                            "parent_id": "t1_i46u9wv",
                            "score": 6,
                            "created_utc": 1649613222.0,
                            "replies": [
                                {
                                    "body": "Amen brother!",
                                    "author": "dmwmni",
                                    "id": "i46vth0",
                                    "parent_id": "t1_i46v1z5",
                                    "score": 0,
                                    "created_utc": 1649613535.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I was thinking the same thing. And then to have to put up with the attitude on top of it. No thanks.",
                    "author": "Significant-Fun-2146",
                    "id": "i46tn5c",
                    "parent_id": "t1_i46s370",
                    "score": 2,
                    "created_utc": 1649612657.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can relate. Similar story, sb wanted a back to school computer with an i9 processor last year  with a dual screen set up.  She was using a busted laptop and I told her I personally use a 4th gen i7 and it is plenty fast.  Neither of us are gamers or graphic designers.  When I picked out a i5 10th gen micro desktop she wasn’t too happy and I ended it and same thing happened with the anger, then the apologies.  But I hope she is using it to find a new SD!",
            "author": "Twilight-310",
            "id": "i47bf4h",
            "parent_id": "t3_u0lkhm",
            "score": 8,
            "created_utc": 1649619976.0,
            "replies": [
                {
                    "body": "Feels comforting that we are not alone, sorry that happened to you.",
                    "author": "dmwmni",
                    "id": "i47epym",
                    "parent_id": "t1_i47bf4h",
                    "score": 3,
                    "created_utc": 1649621352.0,
                    "replies": [
                        {
                            "body": "Not at all!  It happens and I did not mention it in the comments and I am certain you are in the same boat but because it was as \"desktop computer\", she also needed a desk and chair which I had already purchased and for context this is all on top of any allowance/ppm.  I think the lesson learned is to take care of what you have and to respect each other, no one wants to be a tool or taken advantage of.",
                            "author": "Twilight-310",
                            "id": "i47iv98",
                            "parent_id": "t1_i47epym",
                            "score": 2,
                            "created_utc": 1649623083.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“those gaudy nails”\n\n🤣🤣🤣",
            "author": "Pitkin_SD",
            "id": "i46m2fr",
            "parent_id": "t3_u0lkhm",
            "score": 9,
            "created_utc": 1649609649.0,
            "replies": [
                {
                    "body": "They're so bad ... 🤣",
                    "author": "dmwmni",
                    "id": "i46vhnb",
                    "parent_id": "t1_i46m2fr",
                    "score": 4,
                    "created_utc": 1649613401.0,
                    "replies": [
                        {
                            "body": "What were they like?",
                            "author": "lipstickdiet",
                            "id": "i47hn55",
                            "parent_id": "t1_i46vhnb",
                            "score": 2,
                            "created_utc": 1649622565.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I wouldn't have made it past those either. Lol",
                    "author": "JohnnyKemmer009",
                    "id": "i46muyi",
                    "parent_id": "t1_i46m2fr",
                    "score": 6,
                    "created_utc": 1649609963.0,
                    "replies": [
                        {
                            "body": "I actually find those a turn off. And depending on how bad, sometimes nextable in itself.",
                            "author": "BinghamtonSD",
                            "id": "i46vot8",
                            "parent_id": "t1_i46muyi",
                            "score": 7,
                            "created_utc": 1649613483.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why are nails being so attacked in this sub today?",
                    "author": null,
                    "id": "i47pj8b",
                    "parent_id": "t1_i46m2fr",
                    "score": 2,
                    "created_utc": 1649625915.0,
                    "replies": [
                        {
                            "body": "Nails are not.\n\nGaudy nails are.\n\nThere IS a difference.",
                            "author": "Pitkin_SD",
                            "id": "i47qmno",
                            "parent_id": "t1_i47pj8b",
                            "score": 6,
                            "created_utc": 1649626388.0,
                            "replies": [
                                {
                                    "body": "What’s considered gaudy is subjective. A nail design that I may think is simple and cute may be come off as gaudy and extreme to someone else",
                                    "author": null,
                                    "id": "i47vqdy",
                                    "parent_id": "t1_i47qmno",
                                    "score": 2,
                                    "created_utc": 1649628593.0,
                                    "replies": [
                                        {
                                            "body": "Of course.  Nearly every judgment of a style choice is subjective.",
                                            "author": "Pitkin_SD",
                                            "id": "i480u3i",
                                            "parent_id": "t1_i47vqdy",
                                            "score": 3,
                                            "created_utc": 1649630852.0,
                                            "replies": [
                                                {
                                                    "body": "Touché my friend, touché",
                                                    "author": null,
                                                    "id": "i4810h1",
                                                    "parent_id": "t1_i480u3i",
                                                    "score": 1,
                                                    "created_utc": 1649630930.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes.  Some opinions are more narrowly or widely held than others.",
                                                            "author": "Pitkin_SD",
                                                            "id": "i4876iz",
                                                            "parent_id": "t1_i4810h1",
                                                            "score": 1,
                                                            "created_utc": 1649633744.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Are gaudy nails long obnoxiously decorated nails?",
                                    "author": "SunGoddessFancy",
                                    "id": "i47wh43",
                                    "parent_id": "t1_i47qmno",
                                    "score": 2,
                                    "created_utc": 1649628919.0,
                                    "replies": [
                                        {
                                            "body": "100% this.",
                                            "author": "Pitkin_SD",
                                            "id": "i480i87",
                                            "parent_id": "t1_i47wh43",
                                            "score": 3,
                                            "created_utc": 1649630705.0,
                                            "replies": [
                                                {
                                                    "body": "Truth be told I dislike them too . I cringe every time I see them .",
                                                    "author": "SunGoddessFancy",
                                                    "id": "i482foj",
                                                    "parent_id": "t1_i480i87",
                                                    "score": 0,
                                                    "created_utc": 1649631573.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i46tix5",
            "parent_id": "t3_u0lkhm",
            "score": 9,
            "created_utc": 1649612610.0,
            "replies": [
                {
                    "body": "Fair assessment from I wrote, but you're not missing part of the story. My snide response was near the end of the conversation when I do agree with what you said, I didn't care as much if it ended when I said that quote. But prior to that, my offer to buy her an e-bike was very in line with wanting to stay with her. I wasn't thinking of using the price disparity of the bikes to end things.",
                    "author": "dmwmni",
                    "id": "i46vd8h",
                    "parent_id": "t1_i46tix5",
                    "score": 10,
                    "created_utc": 1649613350.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i46tmjc",
            "parent_id": "t3_u0lkhm",
            "score": 12,
            "created_utc": 1649612650.0,
            "replies": [
                {
                    "body": "Isn't part of the whole mentoring thing helping them raise their standard of living?",
                    "author": "lethalpenis",
                    "id": "i490du3",
                    "parent_id": "t1_i46tmjc",
                    "score": 2,
                    "created_utc": 1649647753.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Something tells me she will beg and plead to get back with you, so just be prepared :)",
            "author": "BusddhistDSM",
            "id": "i471oq0",
            "parent_id": "t3_u0lkhm",
            "score": 8,
            "created_utc": 1649615936.0,
            "replies": [
                {
                    "body": "Yes, the begging texts started an hour ago. Having difficulty with this, don't want to block someone who is emotional, Hell hath no fury like a woman scorned. Doing my best to be nice, yet firm.",
                    "author": "dmwmni",
                    "id": "i48uwj4",
                    "parent_id": "t1_i471oq0",
                    "score": 5,
                    "created_utc": 1649644940.0,
                    "replies": [
                        {
                            "body": "You're too nice! Its great that you have empathy, but her issues seem to be behavioral and she needs to fix them.",
                            "author": "BusddhistDSM",
                            "id": "i4bnv9s",
                            "parent_id": "t1_i48uwj4",
                            "score": 2,
                            "created_utc": 1649700352.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i46ma27",
            "parent_id": "t3_u0lkhm",
            "score": 11,
            "created_utc": 1649609733.0,
            "replies": [
                {
                    "body": ">she grew and learned \n\nWould like to know where you see evidence of this?",
                    "author": "NoLimitLexa",
                    "id": "i46nd3u",
                    "parent_id": "t1_i46ma27",
                    "score": 8,
                    "created_utc": 1649610160.0,
                    "replies": [
                        {
                            "body": "LOL, exactly, maybe in a year?",
                            "author": "dmwmni",
                            "id": "i46o05b",
                            "parent_id": "t1_i46nd3u",
                            "score": 3,
                            "created_utc": 1649610413.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Good for you! You have standards too.",
                    "author": "Carlaroo75",
                    "id": "i47bnic",
                    "parent_id": "t1_i46ma27",
                    "score": 1,
                    "created_utc": 1649620073.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My only comment to this post is: who uses \"YOLO\" in 2022?",
            "author": "ElaineDoll",
            "id": "i4au0rd",
            "parent_id": "t3_u0lkhm",
            "score": 3,
            "created_utc": 1649688756.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i46yif9",
            "parent_id": "t3_u0lkhm",
            "score": 6,
            "created_utc": 1649614634.0,
            "replies": [
                {
                    "body": "Will she learn it? My money's on no....",
                    "author": "AustinMetz18",
                    "id": "i478z6r",
                    "parent_id": "t1_i46yif9",
                    "score": 0,
                    "created_utc": 1649618964.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be fair, I think we need to back up a bit and establish more context. \n\nIn my opinion, a sort of informal social contract was created upon your arrangement. The fact that you agreed to see this person and accept their behavior/expectations, means that there’s an implicit agreement upon the nature of the relationship. It’s not like you were suddenly surprised by how the person in front of you was.\n\nSo maybe to her, it became unacceptable that you didn’t get her the bike. After all, your sudden diatribe about financial responsibility sounded like it killed the mood. No offense, SDs kinda lose their image the moment they start talking about how humble their life is, whilst wanting a fabulous sugar arrangement at the same time. \n\nMaybe the way she treated you was dependent on how she saw you, so she may have felt confused when she felt the effort she gave was inequitable to your financial input.\n\nI think your mistake started from your “carpe diem” moment, when you didn’t fully realize that you committed to her expectations. Can you really turn around now and complain when you knew from the start what kind of arrangement this would likely be?",
            "author": "haleykohr",
            "id": "i479lsj",
            "parent_id": "t3_u0lkhm",
            "score": 10,
            "created_utc": 1649619225.0,
            "replies": [
                {
                    "body": "> I think your mistake started from your “carpe diem” moment, when you didn’t fully realize that you committed to her expectations\n\nNah, I didn't know everything about her when I agreed to the m&g. And I committed to her expectations by giving her exactly what she asked for without negotiating. I also took her to fancy places and spent more going out than I usually do, gave her pricey gifts, and the gesture of the bike offer was to keep going with the SR.\n\nBut seeing her being wasteful with what she was getting and not doing things to advance herself through life was less and less attractive, but it was still early, so wasn't that bothered about it enough to end it. The outburst and lack of appreciation yesterday was just too much, I'm not in SRs for that.",
                    "author": "dmwmni",
                    "id": "i47c5y9",
                    "parent_id": "t1_i479lsj",
                    "score": 7,
                    "created_utc": 1649620285.0,
                    "replies": []
                },
                {
                    "body": ">So maybe to her, it became unacceptable that you didn’t get her the bike. After all, your sudden diatribe about financial responsibility sounded like it killed the mood. No offense, SDs kinda lose their image the moment they start talking about how humble their life is, whilst wanting a fabulous sugar arrangement at the same time.\n\nTHANK YOU!",
                    "author": "DottiesHotSake",
                    "id": "i48tcrq",
                    "parent_id": "t1_i479lsj",
                    "score": -1,
                    "created_utc": 1649644179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some of these ladies don’t appreciate what we do for them. There’s not many of us holding it down like that. Her searches gonna be exhausting.",
            "author": "YACSB",
            "id": "i48oc76",
            "parent_id": "t3_u0lkhm",
            "score": 4,
            "created_utc": 1649641796.0,
            "replies": []
        },
        {
            "body": ">I said \"Doesn't it give you pause that I can afford to be an SD that meets your standards, but the e-bike I bought for myself is still less than what I want to get for you? I would never think of getting the one you want for myself. How do you think I got to this financial position in life?\"\n\nThis seems pretty argumentative and condescending, and would def get a shitty response from me. Perhaps more context would make it less so.... obviously you've had lots of conversations in the last 3 months that you didn't post here, so hard to say. Just something to consider.",
            "author": "NoLimitLexa",
            "id": "i46o8io",
            "parent_id": "t3_u0lkhm",
            "score": 11,
            "created_utc": 1649610505.0,
            "replies": [
                {
                    "body": "Gotta disagree…that sounds neither argumentative nor condescending to me.  Rather a statement of fact and a lesson about value.",
                    "author": "Pitkin_SD",
                    "id": "i46v1dw",
                    "parent_id": "t1_i46o8io",
                    "score": 8,
                    "created_utc": 1649613215.0,
                    "replies": [
                        {
                            "body": "I agree here. I would feel some type of way if an SD went out of his way to do this for me and it was more than something he bought for himself. Not that I value myself lower but the effort and thoughtfulness makes it more meaningful than the price tag",
                            "author": "SatansBirthdayCake",
                            "id": "i46w0kt",
                            "parent_id": "t1_i46v1dw",
                            "score": 8,
                            "created_utc": 1649613613.0,
                            "replies": [
                                {
                                    "body": "I actually agree here too. As long as it was the same or somewhat similar. But not double",
                                    "author": "Sugarcookie54321_",
                                    "id": "i46ze6e",
                                    "parent_id": "t1_i46w0kt",
                                    "score": 3,
                                    "created_utc": 1649614993.0,
                                    "replies": []
                                },
                                {
                                    "body": "Well, depends on what it is.",
                                    "author": "lipstickdiet",
                                    "id": "i47i0cl",
                                    "parent_id": "t1_i46w0kt",
                                    "score": 1,
                                    "created_utc": 1649622718.0,
                                    "replies": []
                                },
                                {
                                    "body": "And just what \"type of way\" would that be?",
                                    "author": "jorjxmckie9",
                                    "id": "i47vpbp",
                                    "parent_id": "t1_i46w0kt",
                                    "score": 1,
                                    "created_utc": 1649628580.0,
                                    "replies": [
                                        {
                                            "body": "It would be awkward but I would be gracious. It’s hard to articulate the nuance in a Reddit comment",
                                            "author": "SatansBirthdayCake",
                                            "id": "i48qez5",
                                            "parent_id": "t1_i47vpbp",
                                            "score": 2,
                                            "created_utc": 1649642765.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not something you can say on day one, but in bounds after two months I would say. It was also said near the end of a 30 minute conversation on this where I pretty much felt the SR couldn't continue, it was a last chance effort to reason with her differently. But the Veruca response sealed it.",
                    "author": "dmwmni",
                    "id": "i46q1o5",
                    "parent_id": "t1_i46o8io",
                    "score": 5,
                    "created_utc": 1649611230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think a main question now is what YOU are going to do next and how long it will take for you to get there. That’s the downside of all breakups, right?",
            "author": "SD-47",
            "id": "i47p12s",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1649625696.0,
            "replies": []
        },
        {
            "body": "Jmm what ebike would you recommend that is in the range of 3k max?",
            "author": null,
            "id": "i487534",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1649633726.0,
            "replies": []
        },
        {
            "body": "Why do you consider her an 11/10? Doesn't anything besides looks play in to how attractive a partner is to you...because she doesn't sound like anywhere near a 10 for me.",
            "author": "roscoe7585",
            "id": "i48rjqd",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1649643311.0,
            "replies": [
                {
                    "body": "She looks like Sara Jean Underwood. The eyes see, the blood rushes, the parasympathetic nervous system takes over, and the brains don't stand a chance. Forgive me, I'm just a mere guy.",
                    "author": "dmwmni",
                    "id": "i49dchb",
                    "parent_id": "t1_i48rjqd",
                    "score": 1,
                    "created_utc": 1649655660.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "all the 10/10 chicks IME are a waste of time. I met with one this weekend, we had sex on first date but just didn't feel great. She joked after that I would never be contacting her again and I am like try to have a bit more personality and maybe that will change with guys...",
            "author": "thesuitelife2010",
            "id": "i4fbpyh",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1649770070.0,
            "replies": []
        },
        {
            "body": "Well , she is a whore. So....what TF you expect?",
            "author": "BabydollPenny",
            "id": "i539wg4",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1650208896.0,
            "replies": []
        },
        {
            "body": "ahem... what's an ebike?",
            "author": null,
            "id": "i5435j9",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1650221107.0,
            "replies": []
        },
        {
            "body": "Unfortunately I find a number of people are making decisions that are just not good for them.  This is very common.  I take the position of not spending much time trying to improve their lives - unless they truly want to change things.",
            "author": "RP_Bear9",
            "id": "i6ttll7",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1651349869.0,
            "replies": []
        },
        {
            "body": "There are some girls who genuinely have what it takes to get into the right social circles , find the right whale, and bag him. To live the lifestyle she wants. Then, there's women who are already trying to live the life before getting there. Your girl is one of them.",
            "author": "malcolm_reyn0lds",
            "id": "ieci46a",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1656612040.0,
            "replies": []
        },
        {
            "body": "Sounds like you dodged a bullet there mate.Youre already looking after her financially and now she expects you to buy here something you wouldn't even get yourself.Thats like someone asking you to buy them a Bugatti while you're driving a Lamborghini,it just doesn't make sense.She sounds way to entitled.",
            "author": "ThatRedditNerd",
            "id": "i47aylf",
            "parent_id": "t3_u0lkhm",
            "score": 3,
            "created_utc": 1649619785.0,
            "replies": []
        },
        {
            "body": "I am going to play devils advocate here and womansplain some points you made, which  I found off putting even though you don’t want advice these are just observations made.\n\nNumber 1 - don’t keep score of how many intimate dates you had or you gave her 1.5 over the rate you usually do. That’s just. . Yuck.\n\nI will assume she is young, due to her reactions and she really wanted this bike gift. You could have indulged her. Have you not bought her any gifts before this?\n\nTaking 3-4 months to find someone is not really that long. It can take much longer for most. And I am not talking about meeting anyone online either but more organically. What is this hurry, anyway? Who cares if it take 6 months? If she is not running on scarcity mindset then she is confident enough to know she can and will find someone else. Slow and steady wins the race, as they say.  \n\nUnless, she is operating from a different mindset or has a business model where you want a set amount per month with several patrons. Nothing wrong with that model either but it sounded like she was happy with just one guy or two . .\n\n>I said \"Doesn't it give you pause that I can afford to be an SD that meets your standards, but the e-bike I bought for myself is still less than what I want to get for you? I would never think of getting the one you want for myself. How do you think I got to this financial position in life?\"\n\nThis is talking down to her and outright telling her you value gifts to yourself over gifts to her. maybe, do not outright tell this to someone? It will not go over well with any woman. I know you wrote you were willing to get her one more expensive than yours but your overall message does not say this IMO.\n\nI’m not saying she handled it maturely or whatnot. You can let someone know you are displeased by not responding in anger. I usually choose silence. It gets the message across quite well. \n\nThere is absolutely nothing wrong with knowing your worth btw. But I don’t think it has much to do with what your were giving her monetarily or her looks ‘scale ranking’ you gave her. \n\nSome maybes here: Maybe, you could have assisted her with finding a better career if you wanted to really mentor her. Perhaps, you could accept that some ladies prefer not to work much or at all, as a kept woman. If you want someone already established in a good career, then only see women like this and stop going on looks scale ‘11/ 10’ maybe?",
            "author": null,
            "id": "i47e6yy",
            "parent_id": "t3_u0lkhm",
            "score": 6,
            "created_utc": 1649621130.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i47he1w",
                    "parent_id": "t1_i47e6yy",
                    "score": 3,
                    "created_utc": 1649622460.0,
                    "replies": [
                        {
                            "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
                            "author": "NoLimitLexa",
                            "id": "i48961t",
                            "parent_id": "t1_i47he1w",
                            "score": 2,
                            "created_utc": 1649634666.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i47j75a",
                            "parent_id": "t1_i47he1w",
                            "score": -1,
                            "created_utc": 1649623221.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "i47mutk",
                                    "parent_id": "t1_i47j75a",
                                    "score": 1,
                                    "created_utc": 1649624762.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think the issue here is that the OP’s former SB is clearly an idiot. She NEEDS a sd since she is broke and lives paycheck to paycheck. She should’ve tried harder to keep him. But she wanted to be a brat and demand certain things. Now she is still broke, has no sd, and still no bike. Now she has to hunt for another sd that can pay her high ppm request which won’t be an easy feat. \n\nMeanwhile, the OP Can find someone else to replace her pretty quick. Or choose not to find someone else.",
                    "author": null,
                    "id": "i480meq",
                    "parent_id": "t1_i47e6yy",
                    "score": 7,
                    "created_utc": 1649630757.0,
                    "replies": [
                        {
                            "body": "I don’t want to get off topic too much but my thoughts:\n\nI don’t know the exact ppm so cannot say it is high or not. 🤷‍♀️ \n\nShe might not have ambitious drive to work at another job but the OP said he saw potential to mentor her? If so, did he not try to get her into contacts with another, better paying  career? When I asked  him this he just said he disagreed with every single paragraph I wrote. 🤷‍♀️\n\nI don’t think she demanded the bike gift but he offered her one. When she picked out one higher than he wanted to spend, he could have told her it was not in his budget, and asked if she could stay under a certain amount, instead of talking down to her. 🤷‍♀️ That usually goes over better.\n\nI don’t think she is missing out on much, especially the way he interacted with me when I brought up how his delivery was off putting. 🤷‍♀️",
                            "author": null,
                            "id": "i48516t",
                            "parent_id": "t1_i480meq",
                            "score": 3,
                            "created_utc": 1649632764.0,
                            "replies": [
                                {
                                    "body": "Come on, you’re just taking the SB’s side here. What woman says no to a gift and then demands a gift that’s twice as expensive, then goes full on Veruca Salt I want it now?? That’s some heavy entitlement on her part. And not only that but she’s broke living paycheck to paycheck. \n\nAnd per her own words, it takes 3-4 months to find a suitable sd due to her standards. It does sound like she’s missing out and will be broke for another 3-4 months (or longer) while trying to find another sd.",
                                    "author": null,
                                    "id": "i4853m7",
                                    "parent_id": "t1_i48516t",
                                    "score": 7,
                                    "created_utc": 1649632794.0,
                                    "replies": [
                                        {
                                            "body": "Are you being biased like OP and not really listening to what I am saying? I saw two sides to this story. \n\nDifferent kind of bikes here but maybe same feelings. .I used to be very into spinning and mountain biking and I feel like, a bike is a very personal thing. A suitor bought me a peloton when they first came out and I asked him to return it and I picked out something else bc I felt the original peloton bike was made cheaply IMO. But the new spin bike I got was less expensive but better made in quality. Of course, the extra technology added to it separately might have ended up costing more. He didn’t keep track. He also offered to get me a mountain bike bc I was interested in starting that up again but told him I would need to pick that out also. Personally, I don’t feel a bike is the same as requesting your run if the mill tech gadget. You need to feel the bike on your body and it can be a very personal choice. 🤷‍♀️ \n\nShould a woman stay with someone for 1-4 months until she finds someone else? Maybe so, if it is not a bad relationship . .with a guy who does not keep saying he can replace her easily as if she is an easily replaceable commodity. but I don’t think she’s missing out on much or operating on scarcity mindset so she isn’t too pressed about losing him. \n\nLike I said, not all money is good money. I never said her reaction was in good taste but his wasn’t exactly innocent.",
                                            "author": null,
                                            "id": "i48770a",
                                            "parent_id": "t1_i4853m7",
                                            "score": 1,
                                            "created_utc": 1649633750.0,
                                            "replies": [
                                                {
                                                    "body": "You're not wrong about it being a personal thing, but you are making a lot of false assumptions to, at best, cling on to the devil's advocate position. She didn't even want to listen to the merits of the model I suggested. I went to a local bike shop, asked questions, and took pictures of the bike and spec sheet to show her. I don't want to lie and say that all she did was visit the website, sort the bikes by price from high to low, and picked the top result; because I didn't ask her how she picked it, but I'm pretty sure that's all she did. I did ask her why she wanted that model and all I got was \"It's the best\" and \"I want it\". Her choice was not a personal decision.\n\nThere are lots of digs at me in your comments that she isn't losing much, but at the end of the day: she picked me, I was good enough to end her 4 month search with me, she clearly enjoyed my company, I gave her everything she asked for and more for 2 months, I wanted to continue giving to her, but that's not going to happen anymore. You've also fabricated that I treat people like they are disposable to add unwarranted credibility, but it just isn't the case.\n\nShe's not a bad person, but she is too entitled. Full. Stop.\nI do admire the solidarity FWIW.",
                                                    "author": "dmwmni",
                                                    "id": "i48ti3b",
                                                    "parent_id": "t1_i48770a",
                                                    "score": 4,
                                                    "created_utc": 1649644251.0,
                                                    "replies": [
                                                        {
                                                            "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
                                                            "author": "bluelunarmonkey",
                                                            "id": "i48xyit",
                                                            "parent_id": "t1_i48ti3b",
                                                            "score": 1,
                                                            "created_utc": 1649646483.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                                    "author": "Paid-Not-Payed-Bot",
                                                                    "id": "i48xzff",
                                                                    "parent_id": "t1_i48xyit",
                                                                    "score": 1,
                                                                    "created_utc": 1649646496.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                                                                    "author": null,
                                                                    "id": "i490euj",
                                                                    "parent_id": "t1_i48xyit",
                                                                    "score": 1,
                                                                    "created_utc": 1649647768.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                                                                            "author": "bluelunarmonkey",
                                                                            "id": "i495vbv",
                                                                            "parent_id": "t1_i490euj",
                                                                            "score": 2,
                                                                            "created_utc": 1649650853.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                                                                            "author": "everythingisducky",
                                                                            "id": "i4as4z5",
                                                                            "parent_id": "t1_i490euj",
                                                                            "score": 0,
                                                                            "created_utc": 1649687988.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                                                                    "author": null,
                                                                                    "id": "i4aywyd",
                                                                                    "parent_id": "t1_i4as4z5",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649690727.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                                                                            "author": "everythingisducky",
                                                                                            "id": "i4b5vtp",
                                                                                            "parent_id": "t1_i4aywyd",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649693579.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                                                                    "author": null,
                                                                                                    "id": "i4b7aor",
                                                                                                    "parent_id": "t1_i4b5vtp",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1649694125.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "i48x2uw",
                                                            "parent_id": "t1_i48ti3b",
                                                            "score": 0,
                                                            "created_utc": 1649646032.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                                                                    "author": "dmwmni",
                                                                    "id": "i492323",
                                                                    "parent_id": "t1_i48x2uw",
                                                                    "score": 2,
                                                                    "created_utc": 1649648680.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I dunno man, if she looks like he is describing I think it will be pretty easy. The whole playboy look thing tends to be pretty popular in our society. Not everyone. But a lot.",
                            "author": "generalmunks",
                            "id": "i4a4pnr",
                            "parent_id": "t1_i480meq",
                            "score": 1,
                            "created_utc": 1649676700.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s the stupid Instagram lifestyle that many can’t afford, but want to show off for likes and comments from random people! When the sense of entitlement is way too much …. Leaving is a good option. I never approach “I know my worth” type of profiles, just too much shit to deal with.",
            "author": "Blackmawba",
            "id": "i47xcx5",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1649629304.0,
            "replies": [
                {
                    "body": "yep. a whole generation of girls brain washed into this nonsense.",
                    "author": "vtec__",
                    "id": "i48ijm1",
                    "parent_id": "t1_i47xcx5",
                    "score": 2,
                    "created_utc": 1649639080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately a lot of women these days suffer mental illness and this sounds like she might be going down a bad path, would certainly cut your losses but maybe have some compassion while doing so, she probably doesn't have the sense to even know what she's doing 😓",
            "author": "abyssalwench",
            "id": "i48h1hm",
            "parent_id": "t3_u0lkhm",
            "score": 2,
            "created_utc": 1649638371.0,
            "replies": []
        },
        {
            "body": "Ah OK, there's a sub just about these experiences, they'd call her a \"Choosey-Begger.\" \n\nIt's where people should be STFU and being grateful for what they get but are everything but.\n\nYou know the whole tagline, \"Beggers shouldn't be choosey.\"",
            "author": "DarkEyes87",
            "id": "i46qz20",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649611599.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "i46tsaz",
                    "parent_id": "t1_i46qz20",
                    "score": 6,
                    "created_utc": 1649612715.0,
                    "replies": [
                        {
                            "body": "Right and he was getting her a 1200 bike from what I understood (which isn't cheap by any means). He states its on level with what he bought himself. \n\nHe also mentions in same post, that she's financially not in a good place at all, living check to check. \n\nSo most, *in her position* would have STFU and said, \"Thank you, Baby.\" But not the \"Choosey-Beggar\" types. They exist outside the SD SB realm too.",
                            "author": "DarkEyes87",
                            "id": "i46u988",
                            "parent_id": "t1_i46tsaz",
                            "score": 10,
                            "created_utc": 1649612903.0,
                            "replies": []
                        },
                        {
                            "body": "> The bike is just part of the allowance to.see her.\n\nThat sounds like entitlement too. Allowance is to see her, the bike was extra on top.",
                            "author": "dmwmni",
                            "id": "i479rti",
                            "parent_id": "t1_i46tsaz",
                            "score": 2,
                            "created_utc": 1649619293.0,
                            "replies": []
                        },
                        {
                            "body": "Sounds like she wasn’t worth it lol.",
                            "author": null,
                            "id": "i475y0a",
                            "parent_id": "t1_i46tsaz",
                            "score": 1,
                            "created_utc": 1649617688.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A bright future in perspective.",
            "author": "Splenda-Paris",
            "id": "i46miqx",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649609830.0,
            "replies": []
        },
        {
            "body": "I'm not sure how to judge such people.  \nOn one hand we live in a democracy and this \"reason free\" kind of people are going to vote for whatever politician who promises the most free shit.  \nOn the other hand she's 11/10 and in perpetual, self-inflicted, need of SDs.  \n\n\nWould I expel such people from the land? it'd lower my tax bill by half, but then I'd spend it on fleshlights and Cabo trips. tough dilemma.",
            "author": "JeaneyBowl",
            "id": "i47x6of",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649629230.0,
            "replies": []
        },
        {
            "body": "You pay, your rules. \n\nYou can ALWAYS replace them bitches.",
            "author": "matri_xxx15",
            "id": "i49plzw",
            "parent_id": "t3_u0lkhm",
            "score": 0,
            "created_utc": 1649665213.0,
            "replies": [
                {
                    "body": "True, true. But only if he does, pay.😀 Couldn't resist.",
                    "author": "generalmunks",
                    "id": "i4a5qzi",
                    "parent_id": "t1_i49plzw",
                    "score": 1,
                    "created_utc": 1649677331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s why I avoid POTs with anything about “I know my worth” or describe some meal that doesn’t sound appetizing at all. If I could give one piece of advice to POT SBs it would be find a POT SD who would rather gift you experiences than stuff. There will always be next years model of clothes, tech, whatever but the memories you have from experiencing travel or theater or dance or music will stick with you as opposed to the Jimmy Choo heels that will be out of style in 6 months.",
            "author": "Daddyg2019",
            "id": "i48dqqf",
            "parent_id": "t3_u0lkhm",
            "score": 0,
            "created_utc": 1649636814.0,
            "replies": []
        },
        {
            "body": "Never worked out when someone tried to negotiate for a higher PPM.  Hey at least you found out before you got deeper in.",
            "author": "RedHeavyG603",
            "id": "i48j7bf",
            "parent_id": "t3_u0lkhm",
            "score": 0,
            "created_utc": 1649639394.0,
            "replies": []
        },
        {
            "body": "Reminds me of a beggar woman who asked for some change and I (honestly) told her I didn't have any on me.\n\nShe screamed at the top of her lungs, \"WHY ARE YOU SO MEAN TO ME?!?\"",
            "author": "matthewjphillips",
            "id": "i48kk4l",
            "parent_id": "t3_u0lkhm",
            "score": 0,
            "created_utc": 1649640027.0,
            "replies": []
        },
        {
            "body": "I think you both messed up. \n\nBottom line: she wasn’t wrong for wanting the bike she wanted. You need to move away from wanting to matchey match with your SB. Save that for your bros. This lifestyle is about enjoying finer things. I bet you are the same type that thinks DeSiGnER BagS aRe A WasTe….\n\nAt that rate, SBs would be walking around in crocs, socks, tightly whiteys and a wife beater. Women have expensive taste. It was not even an expensive bike- get over yourself. A young college guy can afford that as a gift from part time work. \n\nThe bigger issue is that you have a chip on your shoulder regarding women outside your league. You want her, but you could never have her all these years and now you only have access to her because of your money. You are desperate to be loved for you and yet the $ part is always in the back of your mind. So you are constantly on edge, looking to be triggered. \n\nNow you’ll need to move onto a woman who ‘doesn’t know her worth.’ With this mentality, you can only ever thrive with a barely legal SB from a broken home/desperate situation.",
            "author": "WokeWallflower",
            "id": "i4c4m2i",
            "parent_id": "t3_u0lkhm",
            "score": 0,
            "created_utc": 1649708265.0,
            "replies": [
                {
                    "body": "I will give you the satisfaction that I have read your comment.\n\nLots of wishful assumptions again to help you feel validated, must have felt great to hit that send button. DeSiGNeR  HaNdBags ArE iNdEeD a wAsTe, but I've bought them for SBs, whatever makes them happy. SB gets what SB wants.\n\nWhat you failed to take into consideration with your expert shoot-from-the-hip psychological evaluation is that she had a dead end job and lives paycheck to paycheck, and it pains me to see that because that's how I grew up without a choice with parents from Italy who could barely speak English when they immigrated to Canada. My mom cleaned hotel rooms and my dad was a high school janitor. If she was using her money somewhat more wisely and had a modicum of ambition in her life, and we could have a thoughtful discussion (instead of I WANT IT) on the merits of the model she wanted, I would have bought her that 2k bike. But dating her was like funding a meth addiction, don't want to sponsor that anymore.\n\nBut you wouldn't understand that. I'm sorry, Veruca, that my post offended you.",
                    "author": "dmwmni",
                    "id": "i4cj54w",
                    "parent_id": "t1_i4c4m2i",
                    "score": 5,
                    "created_utc": 1649713882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So did you buy her the bike lol?",
            "author": null,
            "id": "i47613c",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649617724.0,
            "replies": [
                {
                    "body": "Would not do it, but it's a funny thought to leave Barbie tricycle on her doorstep.",
                    "author": "dmwmni",
                    "id": "i47ad6j",
                    "parent_id": "t1_i47613c",
                    "score": 1,
                    "created_utc": 1649619536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You had your turn. Move on. \n\nIf you want 1 more turn on the wheel I'd guess you could have Wednesday nights at half price for a month till she lowers her standards enough to reel in another fish.",
            "author": "daniellederek",
            "id": "i48p2dk",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649642134.0,
            "replies": []
        },
        {
            "body": "I can see how this ebike situation could kill some of your feelings but she did spend 3 full weekends with you (I assume for a single ppm each). And for a girl you say is an 11/10 and a picture perfect bj. I don’t know man.",
            "author": "mike_o212",
            "id": "i49y5a0",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649672180.0,
            "replies": []
        },
        {
            "body": "\"Full on Veruca Salt\" 😂 \n\nI honestly read this and thought - Awe he wanted to buy her a bike!! How cool is that!! \n\nShame she didn't really appreciate what she had ♥️",
            "author": "fairybuttercup",
            "id": "i4a6mn8",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649677850.0,
            "replies": []
        },
        {
            "body": "We've had exactly 10 intimate dates in 2 months, where 3 of those dates were full Friday to Monday weekends\n\nSounds like you got your money's worth from a PPM POV. Her entitlement is showing through. I have learned to avoid those 11/10s for that very reason. These types have dozens of guys throwing money at them.",
            "author": "GSSD",
            "id": "i4aa6ko",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649679825.0,
            "replies": []
        },
        {
            "body": "2 cents:  My SB is 10/11, knows it and uses me as a shield against legitimate suitors.  As a rule, I go overboard when requests for gifts come up.  That policy seems to limit her requests.  She pokes around about a new car...and I stay quiet.   No way do I want a road with such a high ceiling.",
            "author": "sdphilly",
            "id": "i4aua6i",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1649688862.0,
            "replies": []
        },
        {
            "body": "Where can I find a sugar daddy? I’m in college right now and really need help. I definitely can’t do meets because I don’t have a car…",
            "author": "Fit_Tank2322",
            "id": "i69b6oc",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1650976656.0,
            "replies": []
        },
        {
            "body": "Brutal I'd be so sick to lose something solid over that behaviour.",
            "author": "Alphachadbeard",
            "id": "i71byv4",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1651504596.0,
            "replies": []
        },
        {
            "body": "Hey - not an sd or sb, not rich for that matter, but do try to pay a little extra for quality on important stuff. Granted, mine is specialized, but my ebike is about 2600. $1200 seems cheap for a higher end bicycle, let alone an ebike. I’m not entirely convinced that she’s entitled, but rather that OP is dating a hot chick because of his money and then is surprised that she wants money.",
            "author": "throwawayrandomqs",
            "id": "i7mhz4j",
            "parent_id": "t3_u0lkhm",
            "score": 1,
            "created_utc": 1651885794.0,
            "replies": []
        },
        {
            "body": "In b4 the robot comes and tells you off for mentioning amounts",
            "author": "Blade4Hoover",
            "id": "i47xjbi",
            "parent_id": "t1_i472nt9",
            "score": 15,
            "created_utc": 1649629381.0,
            "replies": []
        },
        {
            "body": "Was thinking 12 x (1 concatenate 00), but yeah, 12 + 00 works too! Lol",
            "author": "dmwmni",
            "id": "i479hmh",
            "parent_id": "t1_i472nt9",
            "score": 9,
            "created_utc": 1649619177.0,
            "replies": [
                {
                    "body": "Honestly, that’s NOT a very expensive bike.",
                    "author": "Pitkin_SD",
                    "id": "i4899n0",
                    "parent_id": "t1_i479hmh",
                    "score": 39,
                    "created_utc": 1649634712.0,
                    "replies": [
                        {
                            "body": "Agreed, it's not a huge price for an e-bike. I've definitely seen plenty in the $2-3k range and even one at almost $8k. \n\nHowever I'd argue it's probably a good choice for a first e-bike like this situation. She wanted it to get to and from work, and the main reason was to not be sweaty when she arrived. There's no need for all the best specs, newest features, etc. Also there's no telling how long this \"urge\" will last before she gets over it or just finds it too inconvenient and moves on leaving the bike to sit unused.\n\nThat's besides the entire point that the e-bike that he's currently using cost less than $1200.",
                            "author": "BlueLantern",
                            "id": "i48gx4g",
                            "parent_id": "t1_i4899n0",
                            "score": 16,
                            "created_utc": 1649638313.0,
                            "replies": [
                                {
                                    "body": "Personally, I think his post made her look much more entitled.\n\nAnyway….we all have our pet peeves.",
                                    "author": "Pitkin_SD",
                                    "id": "i48l234",
                                    "parent_id": "t1_i48gx4g",
                                    "score": 13,
                                    "created_utc": 1649640261.0,
                                    "replies": []
                                },
                                {
                                    "body": "You are exactly correct sir.",
                                    "author": "dmwmni",
                                    "id": "i4jntcx",
                                    "parent_id": "t1_i48gx4g",
                                    "score": 4,
                                    "created_utc": 1649843476.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My push bike cost another extra zero! My view on some of the technology things are that it is not spending too much money on because the one next year will be cheaper and better. I would never be able to justify buying an Apple Watch, but I have a few mechanical watch that is worth more than a new Accord.",
                            "author": "SD_AU",
                            "id": "i49jk5k",
                            "parent_id": "t1_i4899n0",
                            "score": 3,
                            "created_utc": 1649660274.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "i4c5u7o",
                            "parent_id": "t1_i4899n0",
                            "score": 3,
                            "created_utc": 1649708730.0,
                            "replies": [
                                {
                                    "body": "Yes!!!  \n\nWhen he put in the amount OP lost any of my sympathy.",
                                    "author": "Pitkin_SD",
                                    "id": "i4cxqgu",
                                    "parent_id": "t1_i4c5u7o",
                                    "score": 5,
                                    "created_utc": 1649720017.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I have one that’s double that and one that’s half that. The cheaper one is definitely more fun.",
                            "author": "riotmaster",
                            "id": "i48g7dj",
                            "parent_id": "t1_i4899n0",
                            "score": 3,
                            "created_utc": 1649637978.0,
                            "replies": []
                        },
                        {
                            "body": "That's so cheap for an ebike I'd be surprised if his is cheaper.",
                            "author": "lethalpenis",
                            "id": "i4908hb",
                            "parent_id": "t1_i4899n0",
                            "score": 2,
                            "created_utc": 1649647674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\nI wonder how old this person is. <25 and attractive are going to feel entitled to everything you have for going out with them. Even then, stable personality is a hole other ballgame.",
            "author": "onlyFax_noFans",
            "id": "i47qkat",
            "parent_id": "t1_i46vl5t",
            "score": 9,
            "created_utc": 1649626359.0,
            "replies": []
        },
        {
            "body": ">wasting her money on things she can't afford\n\nI can't stand to see people do this.  I really gets my goat when you see sugar babies on this sub talking about wasting 7k on a fucking handbag.  \n\nYou don't spend 7k on a fucking handbag when you are living paycheck to paycheck and needing to have roommates just to make ends meet. You take that 7k and you invest it.  Then when you are a millionaire you can spend all the money you want on ugly handbags and shoes you will never wear.",
            "author": "RTManson",
            "id": "i47k5u0",
            "parent_id": "t1_i46yc1j",
            "score": 41,
            "created_utc": 1649623624.0,
            "replies": [
                {
                    "body": "A 7k handbag could be an investment. Also, people who aren't rich and entitled and whose people are also not rich and entitled don't keep cash because liquid assets leak. You're not going to tell your mother you can't help with her meds while sitting on cash. But a 7k handbag isn't fungible. She's going to be able to keep that.\n\nAlso, for SBs, looking nice and fitting in amongst the wealthy are business expenses. She's investing in her career.\n\n There is also the fact that some men don't like giving money but are cool with giving gifts. Some men would much rather gift the handbag for a weekend trip than half the cost in cash paid per night.",
                    "author": "lethalpenis",
                    "id": "i48zidb",
                    "parent_id": "t1_i47k5u0",
                    "score": 10,
                    "created_utc": 1649647289.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "i48zifd",
                            "parent_id": "t1_i48zidb",
                            "score": 1,
                            "created_utc": 1649647290.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Bro I need 7k for my college tuitions 🫣💀",
                    "author": "Devinequicest",
                    "id": "i6ikfsn",
                    "parent_id": "t1_i47k5u0",
                    "score": 1,
                    "created_utc": 1651140383.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let me just add this. I'm not rich or debt free. My vice isn't expensive purses or shoes, it's pussy. Could I be debt free if I put money towards my debts instead of sbs? Most definitely. But, I also pay my rent on time and my bills. \n\nIf you can't pay your basic expenses you shouldn't be worried about designer handbags.",
            "author": "Heree2Comment",
            "id": "i4av7k7",
            "parent_id": "t1_i46yc1j",
            "score": 5,
            "created_utc": 1649689237.0,
            "replies": []
        },
        {
            "body": "“I know my worth, but can barely afford to pay rent so there you go lol.”",
            "author": null,
            "id": "i47zjqb",
            "parent_id": "t1_i46yc1j",
            "score": 10,
            "created_utc": 1649630272.0,
            "replies": []
        },
        {
            "body": "It's an obvious flag, women who are doing dead end jobs are there because they don't know how to control their spending or they don't have any other skills or resources.  I've dealt with a few and I walked away knowing they want to indulge and not save.  They also don't want your comments about their lifestyles when it comes to lavish spending and they only make peanuts.  They are using men as their ticket to indulge but refuse to acknowledge how they can't meet their their monthly expenses.\n\nI get tired of getting called around end of month looking for some extra ppm.  I told her quite a few times her microspending needs to be limited and she just said well you can pamper me right.  Well, I can do that but I rather you take my pampering towards a better future.",
            "author": "MKTekke",
            "id": "i4790j5",
            "parent_id": "t1_i46yc1j",
            "score": 12,
            "created_utc": 1649618979.0,
            "replies": [
                {
                    "body": "I was talking to this girl from SB and she was talking about how she couldn't afford her rent and how she had no luck looking for a job. Then later she's talking about going to an event with her roommate and how she had to pay 4 bills to get her hair done. 😐",
                    "author": "Heree2Comment",
                    "id": "i47hzut",
                    "parent_id": "t1_i4790j5",
                    "score": 8,
                    "created_utc": 1649622712.0,
                    "replies": [
                        {
                            "body": "She's a professionally attractive person. Paying to get her hair done is a business expenses. It's her job.\n\nYou'll notice you weren't trying to pay a girl for company who was a little unkempt because she's working two jobs and refuses to spend on clothes that fit or makeup that won't break out her face. \n\nYou are looking to pay someone who spends their resources trying to be attractive to wealthy men who pay for company.",
                            "author": "lethalpenis",
                            "id": "i4903jj",
                            "parent_id": "t1_i47hzut",
                            "score": 17,
                            "created_utc": 1649647599.0,
                            "replies": [
                                {
                                    "body": "Except she was getting her hair and nails done to go out with a friend and not the SD…so it was a leisure expense and not a business one…unless it was for another SD…in which case, the other SD’s problem.",
                                    "author": "Jahammy72",
                                    "id": "i4i539r",
                                    "parent_id": "t1_i4903jj",
                                    "score": 2,
                                    "created_utc": 1649810612.0,
                                    "replies": []
                                },
                                {
                                    "body": "First off I love your name.\n\nSecondly she was a total weirdo and possible scammer. I'll possibly post about my meeting with her someday. \n\nThirdly she had no job at all.",
                                    "author": "Heree2Comment",
                                    "id": "i495sh7",
                                    "parent_id": "t1_i4903jj",
                                    "score": 4,
                                    "created_utc": 1649650807.0,
                                    "replies": []
                                },
                                {
                                    "body": "u can see why they pay for company ...",
                                    "author": "103h",
                                    "id": "i7uvdff",
                                    "parent_id": "t1_i4903jj",
                                    "score": 1,
                                    "created_utc": 1652052972.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right. That is her actual worth. From a monetary standpoint.",
            "author": "Pretend-Complaint880",
            "id": "i47c1b6",
            "parent_id": "t1_i46yc1j",
            "score": 1,
            "created_utc": 1649620232.0,
            "replies": []
        },
        {
            "body": "This.",
            "author": null,
            "id": "i475enr",
            "parent_id": "t1_i46yc1j",
            "score": 0,
            "created_utc": 1649617466.0,
            "replies": []
        },
        {
            "body": "The folding ones are usually smaller with small wheels, have to pedal a lot more to cover the same distance, so understand that it doesn't feel comfortable. These are full size, much more pleasant.\n\n> You made a lot of effort doing your research. I’d be very grateful .. but if the bike is truly not what I want, I’d say thank you and get the one I want and pay for the difference myself.\n\nThat is a respectable solution. +1",
            "author": "dmwmni",
            "id": "i47dbga",
            "parent_id": "t1_i47bu2a",
            "score": 3,
            "created_utc": 1649620768.0,
            "replies": [
                {
                    "body": "Oh I am petit. A small bike just suits me fine. 😊",
                    "author": null,
                    "id": "i48imy4",
                    "parent_id": "t1_i47dbga",
                    "score": 2,
                    "created_utc": 1649639124.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When a person has it in their mind that it's \"expected\" that they're given gifts, then the gratefulness may fade.\n\nBless the SBs that get absolutely spoiled and remain ever thankful.  You are the real MVPs.",
            "author": "TheSugarCouple",
            "id": "i47o9cs",
            "parent_id": "t1_i470xvw",
            "score": 18,
            "created_utc": 1649625365.0,
            "replies": [
                {
                    "body": "For real. This🤎 I do t expect anything and my SD gloriously delights me!!",
                    "author": "lotuskissed",
                    "id": "i481iyk",
                    "parent_id": "t1_i47o9cs",
                    "score": 3,
                    "created_utc": 1649631158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Suggest local with independent bike shops. Find the ones who pride themselves with knowledgable staff.",
            "author": "dmwmni",
            "id": "i46qklm",
            "parent_id": "t1_i46oajy",
            "score": 8,
            "created_utc": 1649611442.0,
            "replies": [
                {
                    "body": "Yup this would be my suggestion u/MrBuzzard. Go to a local shop, see what they recommend. They'd also be familiar with local laws/requirements/regulations to avoid pitfalls because of stupid lawmakers. \n\nThen go home do your own research based off that. If the local shop wasn't recommending crap or trying to rip you off, try and support local businesses.\n\nThere's also subreddits like r/ebikes that would be helpful with pretty pictures, suggestions and helpful links.",
                    "author": "BlueLantern",
                    "id": "i48i9zs",
                    "parent_id": "t1_i46qklm",
                    "score": 3,
                    "created_utc": 1649638955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aventon is great!",
            "author": "SD-47",
            "id": "i47oqrf",
            "parent_id": "t1_i46oajy",
            "score": 2,
            "created_utc": 1649625574.0,
            "replies": []
        },
        {
            "body": "To be fair, given that's the way it's viewed in our society \"she's at the peak of her life\" and I think a lot of dudes do view it that way, I can't say I blame her for trying to pull that kind of behaviour off. I know a lot of men do see it that way, so honestly I can understand it totally. If I were a woman, I'd probably pull the same shit lmfao",
            "author": "generalmunks",
            "id": "i4a3u0s",
            "parent_id": "t1_i48ugsq",
            "score": 6,
            "created_utc": 1649676152.0,
            "replies": []
        },
        {
            "body": "\"They just expect the world to give it to them because they are pretty.\"  Says the guy who expects women to give themselves to him just because he's rich.",
            "author": "lethalpenis",
            "id": "i490nd9",
            "parent_id": "t1_i47jipn",
            "score": 6,
            "created_utc": 1649647895.0,
            "replies": [
                {
                    "body": "All you are really doing when you reply like this is telling everyone in this thread that you are exactly the type of person I was talking about.\n\nAnd no, I don't expect anything from a sugar baby simply because I am rich.  I want companionship and sexual access, she wants an allowance.  Both of us consider what the other has to offer a fair exchange.\n\nThe problem with entitled sugar babies is that they expect far more in return than they have to offer. It starts with asking for an unreasonably high allowance.  Then demands for extra's and gifts.  And as OP discovered they get pissy when you don't give it to them.  They also are the type to start flaking as soon as you put them on allowance. Best to just next them right away.",
                    "author": "RTManson",
                    "id": "i493qmm",
                    "parent_id": "t1_i490nd9",
                    "score": 5,
                    "created_utc": 1649649601.0,
                    "replies": [
                        {
                            "body": "You're trading money for sex.  \nShe's trading sex for money.  \n\n\nYou're in here grumping because you didn't get the sex you wanted for the money but called her entitled and pissy because she didn't the money she wanted for the sex.   \n\n\nSounds like you're the same level of entitled and pissy except that she's running a business and you're complaining on reddit.",
                            "author": "lethalpenis",
                            "id": "i49738x",
                            "parent_id": "t1_i493qmm",
                            "score": 6,
                            "created_utc": 1649651587.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great take, very true. I've seen it happen to a couple of friends of mine.",
            "author": "dmwmni",
            "id": "i46yia5",
            "parent_id": "t1_i46tlko",
            "score": 6,
            "created_utc": 1649614633.0,
            "replies": []
        },
        {
            "body": "😅",
            "author": "SunGoddessFancy",
            "id": "i47zhtq",
            "parent_id": "t1_i46nsjz",
            "score": 3,
            "created_utc": 1649630247.0,
            "replies": []
        },
        {
            "body": "Cheap shot. He was still smashing wasn’t he?\n\nAlways fun to hear men poke at women’s appearances when they still want to f* her. \n\nAt least the nails are removable. Being old and having saggy you know what isn’t. \n\nGood lord. I had way too much haterade tonight. \n\nBlessings to all.",
            "author": "WokeWallflower",
            "id": "i4c4zc4",
            "parent_id": "t1_i46nsjz",
            "score": 0,
            "created_utc": 1649708404.0,
            "replies": []
        },
        {
            "body": "You're not wrong, lol. The sex was not even great tbh, but the visuals for oral were like a dream that I thought would never actually come true. Perfect Playboy face/body/hair/bust, all natural.\n\nJust to relax on my lazyboy and .......... hmmm, maybe I should text her back ....... No, don't do it! LOL",
            "author": "dmwmni",
            "id": "i46u9wv",
            "parent_id": "t1_i46s370",
            "score": 20,
            "created_utc": 1649612910.0,
            "replies": [
                {
                    "body": "And that’s the problem. Sometime the pussy is so great we get blinded and just ignore the bad times 😂",
                    "author": "SoftAndGentleSD",
                    "id": "i4ek7tn",
                    "parent_id": "t1_i46u9wv",
                    "score": 3,
                    "created_utc": 1649752899.0,
                    "replies": []
                },
                {
                    "body": "Text her back 😈",
                    "author": "SunGoddessFancy",
                    "id": "i47vtru",
                    "parent_id": "t1_i46u9wv",
                    "score": 6,
                    "created_utc": 1649628633.0,
                    "replies": []
                },
                {
                    "body": "This may be getting too NSFW for this sub, but there are times when its happening and I have my head back and eyes closed and Im like what are you doing! Need to sear every visual into my memory bank",
                    "author": "sparky_SD16",
                    "id": "i46v1z5",
                    "parent_id": "t1_i46u9wv",
                    "score": 6,
                    "created_utc": 1649613222.0,
                    "replies": [
                        {
                            "body": "Amen brother!",
                            "author": "dmwmni",
                            "id": "i46vth0",
                            "parent_id": "t1_i46v1z5",
                            "score": 0,
                            "created_utc": 1649613535.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was thinking the same thing. And then to have to put up with the attitude on top of it. No thanks.",
            "author": "Significant-Fun-2146",
            "id": "i46tn5c",
            "parent_id": "t1_i46s370",
            "score": 2,
            "created_utc": 1649612657.0,
            "replies": []
        },
        {
            "body": "Feels comforting that we are not alone, sorry that happened to you.",
            "author": "dmwmni",
            "id": "i47epym",
            "parent_id": "t1_i47bf4h",
            "score": 3,
            "created_utc": 1649621352.0,
            "replies": [
                {
                    "body": "Not at all!  It happens and I did not mention it in the comments and I am certain you are in the same boat but because it was as \"desktop computer\", she also needed a desk and chair which I had already purchased and for context this is all on top of any allowance/ppm.  I think the lesson learned is to take care of what you have and to respect each other, no one wants to be a tool or taken advantage of.",
                    "author": "Twilight-310",
                    "id": "i47iv98",
                    "parent_id": "t1_i47epym",
                    "score": 2,
                    "created_utc": 1649623083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They're so bad ... 🤣",
            "author": "dmwmni",
            "id": "i46vhnb",
            "parent_id": "t1_i46m2fr",
            "score": 4,
            "created_utc": 1649613401.0,
            "replies": [
                {
                    "body": "What were they like?",
                    "author": "lipstickdiet",
                    "id": "i47hn55",
                    "parent_id": "t1_i46vhnb",
                    "score": 2,
                    "created_utc": 1649622565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn't have made it past those either. Lol",
            "author": "JohnnyKemmer009",
            "id": "i46muyi",
            "parent_id": "t1_i46m2fr",
            "score": 6,
            "created_utc": 1649609963.0,
            "replies": [
                {
                    "body": "I actually find those a turn off. And depending on how bad, sometimes nextable in itself.",
                    "author": "BinghamtonSD",
                    "id": "i46vot8",
                    "parent_id": "t1_i46muyi",
                    "score": 7,
                    "created_utc": 1649613483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why are nails being so attacked in this sub today?",
            "author": null,
            "id": "i47pj8b",
            "parent_id": "t1_i46m2fr",
            "score": 2,
            "created_utc": 1649625915.0,
            "replies": [
                {
                    "body": "Nails are not.\n\nGaudy nails are.\n\nThere IS a difference.",
                    "author": "Pitkin_SD",
                    "id": "i47qmno",
                    "parent_id": "t1_i47pj8b",
                    "score": 6,
                    "created_utc": 1649626388.0,
                    "replies": [
                        {
                            "body": "What’s considered gaudy is subjective. A nail design that I may think is simple and cute may be come off as gaudy and extreme to someone else",
                            "author": null,
                            "id": "i47vqdy",
                            "parent_id": "t1_i47qmno",
                            "score": 2,
                            "created_utc": 1649628593.0,
                            "replies": [
                                {
                                    "body": "Of course.  Nearly every judgment of a style choice is subjective.",
                                    "author": "Pitkin_SD",
                                    "id": "i480u3i",
                                    "parent_id": "t1_i47vqdy",
                                    "score": 3,
                                    "created_utc": 1649630852.0,
                                    "replies": [
                                        {
                                            "body": "Touché my friend, touché",
                                            "author": null,
                                            "id": "i4810h1",
                                            "parent_id": "t1_i480u3i",
                                            "score": 1,
                                            "created_utc": 1649630930.0,
                                            "replies": [
                                                {
                                                    "body": "Yes.  Some opinions are more narrowly or widely held than others.",
                                                    "author": "Pitkin_SD",
                                                    "id": "i4876iz",
                                                    "parent_id": "t1_i4810h1",
                                                    "score": 1,
                                                    "created_utc": 1649633744.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Are gaudy nails long obnoxiously decorated nails?",
                            "author": "SunGoddessFancy",
                            "id": "i47wh43",
                            "parent_id": "t1_i47qmno",
                            "score": 2,
                            "created_utc": 1649628919.0,
                            "replies": [
                                {
                                    "body": "100% this.",
                                    "author": "Pitkin_SD",
                                    "id": "i480i87",
                                    "parent_id": "t1_i47wh43",
                                    "score": 3,
                                    "created_utc": 1649630705.0,
                                    "replies": [
                                        {
                                            "body": "Truth be told I dislike them too . I cringe every time I see them .",
                                            "author": "SunGoddessFancy",
                                            "id": "i482foj",
                                            "parent_id": "t1_i480i87",
                                            "score": 0,
                                            "created_utc": 1649631573.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fair assessment from I wrote, but you're not missing part of the story. My snide response was near the end of the conversation when I do agree with what you said, I didn't care as much if it ended when I said that quote. But prior to that, my offer to buy her an e-bike was very in line with wanting to stay with her. I wasn't thinking of using the price disparity of the bikes to end things.",
            "author": "dmwmni",
            "id": "i46vd8h",
            "parent_id": "t1_i46tix5",
            "score": 10,
            "created_utc": 1649613350.0,
            "replies": []
        },
        {
            "body": "Isn't part of the whole mentoring thing helping them raise their standard of living?",
            "author": "lethalpenis",
            "id": "i490du3",
            "parent_id": "t1_i46tmjc",
            "score": 2,
            "created_utc": 1649647753.0,
            "replies": []
        },
        {
            "body": "Yes, the begging texts started an hour ago. Having difficulty with this, don't want to block someone who is emotional, Hell hath no fury like a woman scorned. Doing my best to be nice, yet firm.",
            "author": "dmwmni",
            "id": "i48uwj4",
            "parent_id": "t1_i471oq0",
            "score": 5,
            "created_utc": 1649644940.0,
            "replies": [
                {
                    "body": "You're too nice! Its great that you have empathy, but her issues seem to be behavioral and she needs to fix them.",
                    "author": "BusddhistDSM",
                    "id": "i4bnv9s",
                    "parent_id": "t1_i48uwj4",
                    "score": 2,
                    "created_utc": 1649700352.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">she grew and learned \n\nWould like to know where you see evidence of this?",
            "author": "NoLimitLexa",
            "id": "i46nd3u",
            "parent_id": "t1_i46ma27",
            "score": 8,
            "created_utc": 1649610160.0,
            "replies": [
                {
                    "body": "LOL, exactly, maybe in a year?",
                    "author": "dmwmni",
                    "id": "i46o05b",
                    "parent_id": "t1_i46nd3u",
                    "score": 3,
                    "created_utc": 1649610413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good for you! You have standards too.",
            "author": "Carlaroo75",
            "id": "i47bnic",
            "parent_id": "t1_i46ma27",
            "score": 1,
            "created_utc": 1649620073.0,
            "replies": []
        },
        {
            "body": "Will she learn it? My money's on no....",
            "author": "AustinMetz18",
            "id": "i478z6r",
            "parent_id": "t1_i46yif9",
            "score": 0,
            "created_utc": 1649618964.0,
            "replies": []
        },
        {
            "body": "> I think your mistake started from your “carpe diem” moment, when you didn’t fully realize that you committed to her expectations\n\nNah, I didn't know everything about her when I agreed to the m&g. And I committed to her expectations by giving her exactly what she asked for without negotiating. I also took her to fancy places and spent more going out than I usually do, gave her pricey gifts, and the gesture of the bike offer was to keep going with the SR.\n\nBut seeing her being wasteful with what she was getting and not doing things to advance herself through life was less and less attractive, but it was still early, so wasn't that bothered about it enough to end it. The outburst and lack of appreciation yesterday was just too much, I'm not in SRs for that.",
            "author": "dmwmni",
            "id": "i47c5y9",
            "parent_id": "t1_i479lsj",
            "score": 7,
            "created_utc": 1649620285.0,
            "replies": []
        },
        {
            "body": ">So maybe to her, it became unacceptable that you didn’t get her the bike. After all, your sudden diatribe about financial responsibility sounded like it killed the mood. No offense, SDs kinda lose their image the moment they start talking about how humble their life is, whilst wanting a fabulous sugar arrangement at the same time.\n\nTHANK YOU!",
            "author": "DottiesHotSake",
            "id": "i48tcrq",
            "parent_id": "t1_i479lsj",
            "score": -1,
            "created_utc": 1649644179.0,
            "replies": []
        },
        {
            "body": "Gotta disagree…that sounds neither argumentative nor condescending to me.  Rather a statement of fact and a lesson about value.",
            "author": "Pitkin_SD",
            "id": "i46v1dw",
            "parent_id": "t1_i46o8io",
            "score": 8,
            "created_utc": 1649613215.0,
            "replies": [
                {
                    "body": "I agree here. I would feel some type of way if an SD went out of his way to do this for me and it was more than something he bought for himself. Not that I value myself lower but the effort and thoughtfulness makes it more meaningful than the price tag",
                    "author": "SatansBirthdayCake",
                    "id": "i46w0kt",
                    "parent_id": "t1_i46v1dw",
                    "score": 8,
                    "created_utc": 1649613613.0,
                    "replies": [
                        {
                            "body": "I actually agree here too. As long as it was the same or somewhat similar. But not double",
                            "author": "Sugarcookie54321_",
                            "id": "i46ze6e",
                            "parent_id": "t1_i46w0kt",
                            "score": 3,
                            "created_utc": 1649614993.0,
                            "replies": []
                        },
                        {
                            "body": "Well, depends on what it is.",
                            "author": "lipstickdiet",
                            "id": "i47i0cl",
                            "parent_id": "t1_i46w0kt",
                            "score": 1,
                            "created_utc": 1649622718.0,
                            "replies": []
                        },
                        {
                            "body": "And just what \"type of way\" would that be?",
                            "author": "jorjxmckie9",
                            "id": "i47vpbp",
                            "parent_id": "t1_i46w0kt",
                            "score": 1,
                            "created_utc": 1649628580.0,
                            "replies": [
                                {
                                    "body": "It would be awkward but I would be gracious. It’s hard to articulate the nuance in a Reddit comment",
                                    "author": "SatansBirthdayCake",
                                    "id": "i48qez5",
                                    "parent_id": "t1_i47vpbp",
                                    "score": 2,
                                    "created_utc": 1649642765.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not something you can say on day one, but in bounds after two months I would say. It was also said near the end of a 30 minute conversation on this where I pretty much felt the SR couldn't continue, it was a last chance effort to reason with her differently. But the Veruca response sealed it.",
            "author": "dmwmni",
            "id": "i46q1o5",
            "parent_id": "t1_i46o8io",
            "score": 5,
            "created_utc": 1649611230.0,
            "replies": []
        },
        {
            "body": "She looks like Sara Jean Underwood. The eyes see, the blood rushes, the parasympathetic nervous system takes over, and the brains don't stand a chance. Forgive me, I'm just a mere guy.",
            "author": "dmwmni",
            "id": "i49dchb",
            "parent_id": "t1_i48rjqd",
            "score": 1,
            "created_utc": 1649655660.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i47he1w",
            "parent_id": "t1_i47e6yy",
            "score": 3,
            "created_utc": 1649622460.0,
            "replies": [
                {
                    "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
                    "author": "NoLimitLexa",
                    "id": "i48961t",
                    "parent_id": "t1_i47he1w",
                    "score": 2,
                    "created_utc": 1649634666.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i47j75a",
                    "parent_id": "t1_i47he1w",
                    "score": -1,
                    "created_utc": 1649623221.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "i47mutk",
                            "parent_id": "t1_i47j75a",
                            "score": 1,
                            "created_utc": 1649624762.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think the issue here is that the OP’s former SB is clearly an idiot. She NEEDS a sd since she is broke and lives paycheck to paycheck. She should’ve tried harder to keep him. But she wanted to be a brat and demand certain things. Now she is still broke, has no sd, and still no bike. Now she has to hunt for another sd that can pay her high ppm request which won’t be an easy feat. \n\nMeanwhile, the OP Can find someone else to replace her pretty quick. Or choose not to find someone else.",
            "author": null,
            "id": "i480meq",
            "parent_id": "t1_i47e6yy",
            "score": 7,
            "created_utc": 1649630757.0,
            "replies": [
                {
                    "body": "I don’t want to get off topic too much but my thoughts:\n\nI don’t know the exact ppm so cannot say it is high or not. 🤷‍♀️ \n\nShe might not have ambitious drive to work at another job but the OP said he saw potential to mentor her? If so, did he not try to get her into contacts with another, better paying  career? When I asked  him this he just said he disagreed with every single paragraph I wrote. 🤷‍♀️\n\nI don’t think she demanded the bike gift but he offered her one. When she picked out one higher than he wanted to spend, he could have told her it was not in his budget, and asked if she could stay under a certain amount, instead of talking down to her. 🤷‍♀️ That usually goes over better.\n\nI don’t think she is missing out on much, especially the way he interacted with me when I brought up how his delivery was off putting. 🤷‍♀️",
                    "author": null,
                    "id": "i48516t",
                    "parent_id": "t1_i480meq",
                    "score": 3,
                    "created_utc": 1649632764.0,
                    "replies": [
                        {
                            "body": "Come on, you’re just taking the SB’s side here. What woman says no to a gift and then demands a gift that’s twice as expensive, then goes full on Veruca Salt I want it now?? That’s some heavy entitlement on her part. And not only that but she’s broke living paycheck to paycheck. \n\nAnd per her own words, it takes 3-4 months to find a suitable sd due to her standards. It does sound like she’s missing out and will be broke for another 3-4 months (or longer) while trying to find another sd.",
                            "author": null,
                            "id": "i4853m7",
                            "parent_id": "t1_i48516t",
                            "score": 7,
                            "created_utc": 1649632794.0,
                            "replies": [
                                {
                                    "body": "Are you being biased like OP and not really listening to what I am saying? I saw two sides to this story. \n\nDifferent kind of bikes here but maybe same feelings. .I used to be very into spinning and mountain biking and I feel like, a bike is a very personal thing. A suitor bought me a peloton when they first came out and I asked him to return it and I picked out something else bc I felt the original peloton bike was made cheaply IMO. But the new spin bike I got was less expensive but better made in quality. Of course, the extra technology added to it separately might have ended up costing more. He didn’t keep track. He also offered to get me a mountain bike bc I was interested in starting that up again but told him I would need to pick that out also. Personally, I don’t feel a bike is the same as requesting your run if the mill tech gadget. You need to feel the bike on your body and it can be a very personal choice. 🤷‍♀️ \n\nShould a woman stay with someone for 1-4 months until she finds someone else? Maybe so, if it is not a bad relationship . .with a guy who does not keep saying he can replace her easily as if she is an easily replaceable commodity. but I don’t think she’s missing out on much or operating on scarcity mindset so she isn’t too pressed about losing him. \n\nLike I said, not all money is good money. I never said her reaction was in good taste but his wasn’t exactly innocent.",
                                    "author": null,
                                    "id": "i48770a",
                                    "parent_id": "t1_i4853m7",
                                    "score": 1,
                                    "created_utc": 1649633750.0,
                                    "replies": [
                                        {
                                            "body": "You're not wrong about it being a personal thing, but you are making a lot of false assumptions to, at best, cling on to the devil's advocate position. She didn't even want to listen to the merits of the model I suggested. I went to a local bike shop, asked questions, and took pictures of the bike and spec sheet to show her. I don't want to lie and say that all she did was visit the website, sort the bikes by price from high to low, and picked the top result; because I didn't ask her how she picked it, but I'm pretty sure that's all she did. I did ask her why she wanted that model and all I got was \"It's the best\" and \"I want it\". Her choice was not a personal decision.\n\nThere are lots of digs at me in your comments that she isn't losing much, but at the end of the day: she picked me, I was good enough to end her 4 month search with me, she clearly enjoyed my company, I gave her everything she asked for and more for 2 months, I wanted to continue giving to her, but that's not going to happen anymore. You've also fabricated that I treat people like they are disposable to add unwarranted credibility, but it just isn't the case.\n\nShe's not a bad person, but she is too entitled. Full. Stop.\nI do admire the solidarity FWIW.",
                                            "author": "dmwmni",
                                            "id": "i48ti3b",
                                            "parent_id": "t1_i48770a",
                                            "score": 4,
                                            "created_utc": 1649644251.0,
                                            "replies": [
                                                {
                                                    "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
                                                    "author": "bluelunarmonkey",
                                                    "id": "i48xyit",
                                                    "parent_id": "t1_i48ti3b",
                                                    "score": 1,
                                                    "created_utc": 1649646483.0,
                                                    "replies": [
                                                        {
                                                            "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                            "author": "Paid-Not-Payed-Bot",
                                                            "id": "i48xzff",
                                                            "parent_id": "t1_i48xyit",
                                                            "score": 1,
                                                            "created_utc": 1649646496.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                                                            "author": null,
                                                            "id": "i490euj",
                                                            "parent_id": "t1_i48xyit",
                                                            "score": 1,
                                                            "created_utc": 1649647768.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                                                                    "author": "bluelunarmonkey",
                                                                    "id": "i495vbv",
                                                                    "parent_id": "t1_i490euj",
                                                                    "score": 2,
                                                                    "created_utc": 1649650853.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                                                                    "author": "everythingisducky",
                                                                    "id": "i4as4z5",
                                                                    "parent_id": "t1_i490euj",
                                                                    "score": 0,
                                                                    "created_utc": 1649687988.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                                                            "author": null,
                                                                            "id": "i4aywyd",
                                                                            "parent_id": "t1_i4as4z5",
                                                                            "score": 1,
                                                                            "created_utc": 1649690727.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                                                                    "author": "everythingisducky",
                                                                                    "id": "i4b5vtp",
                                                                                    "parent_id": "t1_i4aywyd",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649693579.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                                                            "author": null,
                                                                                            "id": "i4b7aor",
                                                                                            "parent_id": "t1_i4b5vtp",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649694125.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "i48x2uw",
                                                    "parent_id": "t1_i48ti3b",
                                                    "score": 0,
                                                    "created_utc": 1649646032.0,
                                                    "replies": [
                                                        {
                                                            "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                                                            "author": "dmwmni",
                                                            "id": "i492323",
                                                            "parent_id": "t1_i48x2uw",
                                                            "score": 2,
                                                            "created_utc": 1649648680.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I dunno man, if she looks like he is describing I think it will be pretty easy. The whole playboy look thing tends to be pretty popular in our society. Not everyone. But a lot.",
                    "author": "generalmunks",
                    "id": "i4a4pnr",
                    "parent_id": "t1_i480meq",
                    "score": 1,
                    "created_utc": 1649676700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yep. a whole generation of girls brain washed into this nonsense.",
            "author": "vtec__",
            "id": "i48ijm1",
            "parent_id": "t1_i47xcx5",
            "score": 2,
            "created_utc": 1649639080.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i46tsaz",
            "parent_id": "t1_i46qz20",
            "score": 6,
            "created_utc": 1649612715.0,
            "replies": [
                {
                    "body": "Right and he was getting her a 1200 bike from what I understood (which isn't cheap by any means). He states its on level with what he bought himself. \n\nHe also mentions in same post, that she's financially not in a good place at all, living check to check. \n\nSo most, *in her position* would have STFU and said, \"Thank you, Baby.\" But not the \"Choosey-Beggar\" types. They exist outside the SD SB realm too.",
                    "author": "DarkEyes87",
                    "id": "i46u988",
                    "parent_id": "t1_i46tsaz",
                    "score": 10,
                    "created_utc": 1649612903.0,
                    "replies": []
                },
                {
                    "body": "> The bike is just part of the allowance to.see her.\n\nThat sounds like entitlement too. Allowance is to see her, the bike was extra on top.",
                    "author": "dmwmni",
                    "id": "i479rti",
                    "parent_id": "t1_i46tsaz",
                    "score": 2,
                    "created_utc": 1649619293.0,
                    "replies": []
                },
                {
                    "body": "Sounds like she wasn’t worth it lol.",
                    "author": null,
                    "id": "i475y0a",
                    "parent_id": "t1_i46tsaz",
                    "score": 1,
                    "created_utc": 1649617688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True, true. But only if he does, pay.😀 Couldn't resist.",
            "author": "generalmunks",
            "id": "i4a5qzi",
            "parent_id": "t1_i49plzw",
            "score": 1,
            "created_utc": 1649677331.0,
            "replies": []
        },
        {
            "body": "I will give you the satisfaction that I have read your comment.\n\nLots of wishful assumptions again to help you feel validated, must have felt great to hit that send button. DeSiGNeR  HaNdBags ArE iNdEeD a wAsTe, but I've bought them for SBs, whatever makes them happy. SB gets what SB wants.\n\nWhat you failed to take into consideration with your expert shoot-from-the-hip psychological evaluation is that she had a dead end job and lives paycheck to paycheck, and it pains me to see that because that's how I grew up without a choice with parents from Italy who could barely speak English when they immigrated to Canada. My mom cleaned hotel rooms and my dad was a high school janitor. If she was using her money somewhat more wisely and had a modicum of ambition in her life, and we could have a thoughtful discussion (instead of I WANT IT) on the merits of the model she wanted, I would have bought her that 2k bike. But dating her was like funding a meth addiction, don't want to sponsor that anymore.\n\nBut you wouldn't understand that. I'm sorry, Veruca, that my post offended you.",
            "author": "dmwmni",
            "id": "i4cj54w",
            "parent_id": "t1_i4c4m2i",
            "score": 5,
            "created_utc": 1649713882.0,
            "replies": []
        },
        {
            "body": "Would not do it, but it's a funny thought to leave Barbie tricycle on her doorstep.",
            "author": "dmwmni",
            "id": "i47ad6j",
            "parent_id": "t1_i47613c",
            "score": 1,
            "created_utc": 1649619536.0,
            "replies": []
        },
        {
            "body": "Honestly, that’s NOT a very expensive bike.",
            "author": "Pitkin_SD",
            "id": "i4899n0",
            "parent_id": "t1_i479hmh",
            "score": 39,
            "created_utc": 1649634712.0,
            "replies": [
                {
                    "body": "Agreed, it's not a huge price for an e-bike. I've definitely seen plenty in the $2-3k range and even one at almost $8k. \n\nHowever I'd argue it's probably a good choice for a first e-bike like this situation. She wanted it to get to and from work, and the main reason was to not be sweaty when she arrived. There's no need for all the best specs, newest features, etc. Also there's no telling how long this \"urge\" will last before she gets over it or just finds it too inconvenient and moves on leaving the bike to sit unused.\n\nThat's besides the entire point that the e-bike that he's currently using cost less than $1200.",
                    "author": "BlueLantern",
                    "id": "i48gx4g",
                    "parent_id": "t1_i4899n0",
                    "score": 16,
                    "created_utc": 1649638313.0,
                    "replies": [
                        {
                            "body": "Personally, I think his post made her look much more entitled.\n\nAnyway….we all have our pet peeves.",
                            "author": "Pitkin_SD",
                            "id": "i48l234",
                            "parent_id": "t1_i48gx4g",
                            "score": 13,
                            "created_utc": 1649640261.0,
                            "replies": []
                        },
                        {
                            "body": "You are exactly correct sir.",
                            "author": "dmwmni",
                            "id": "i4jntcx",
                            "parent_id": "t1_i48gx4g",
                            "score": 4,
                            "created_utc": 1649843476.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My push bike cost another extra zero! My view on some of the technology things are that it is not spending too much money on because the one next year will be cheaper and better. I would never be able to justify buying an Apple Watch, but I have a few mechanical watch that is worth more than a new Accord.",
                    "author": "SD_AU",
                    "id": "i49jk5k",
                    "parent_id": "t1_i4899n0",
                    "score": 3,
                    "created_utc": 1649660274.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "i4c5u7o",
                    "parent_id": "t1_i4899n0",
                    "score": 3,
                    "created_utc": 1649708730.0,
                    "replies": [
                        {
                            "body": "Yes!!!  \n\nWhen he put in the amount OP lost any of my sympathy.",
                            "author": "Pitkin_SD",
                            "id": "i4cxqgu",
                            "parent_id": "t1_i4c5u7o",
                            "score": 5,
                            "created_utc": 1649720017.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I have one that’s double that and one that’s half that. The cheaper one is definitely more fun.",
                    "author": "riotmaster",
                    "id": "i48g7dj",
                    "parent_id": "t1_i4899n0",
                    "score": 3,
                    "created_utc": 1649637978.0,
                    "replies": []
                },
                {
                    "body": "That's so cheap for an ebike I'd be surprised if his is cheaper.",
                    "author": "lethalpenis",
                    "id": "i4908hb",
                    "parent_id": "t1_i4899n0",
                    "score": 2,
                    "created_utc": 1649647674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A 7k handbag could be an investment. Also, people who aren't rich and entitled and whose people are also not rich and entitled don't keep cash because liquid assets leak. You're not going to tell your mother you can't help with her meds while sitting on cash. But a 7k handbag isn't fungible. She's going to be able to keep that.\n\nAlso, for SBs, looking nice and fitting in amongst the wealthy are business expenses. She's investing in her career.\n\n There is also the fact that some men don't like giving money but are cool with giving gifts. Some men would much rather gift the handbag for a weekend trip than half the cost in cash paid per night.",
            "author": "lethalpenis",
            "id": "i48zidb",
            "parent_id": "t1_i47k5u0",
            "score": 10,
            "created_utc": 1649647289.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "i48zifd",
                    "parent_id": "t1_i48zidb",
                    "score": 1,
                    "created_utc": 1649647290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bro I need 7k for my college tuitions 🫣💀",
            "author": "Devinequicest",
            "id": "i6ikfsn",
            "parent_id": "t1_i47k5u0",
            "score": 1,
            "created_utc": 1651140383.0,
            "replies": []
        },
        {
            "body": "I was talking to this girl from SB and she was talking about how she couldn't afford her rent and how she had no luck looking for a job. Then later she's talking about going to an event with her roommate and how she had to pay 4 bills to get her hair done. 😐",
            "author": "Heree2Comment",
            "id": "i47hzut",
            "parent_id": "t1_i4790j5",
            "score": 8,
            "created_utc": 1649622712.0,
            "replies": [
                {
                    "body": "She's a professionally attractive person. Paying to get her hair done is a business expenses. It's her job.\n\nYou'll notice you weren't trying to pay a girl for company who was a little unkempt because she's working two jobs and refuses to spend on clothes that fit or makeup that won't break out her face. \n\nYou are looking to pay someone who spends their resources trying to be attractive to wealthy men who pay for company.",
                    "author": "lethalpenis",
                    "id": "i4903jj",
                    "parent_id": "t1_i47hzut",
                    "score": 17,
                    "created_utc": 1649647599.0,
                    "replies": [
                        {
                            "body": "Except she was getting her hair and nails done to go out with a friend and not the SD…so it was a leisure expense and not a business one…unless it was for another SD…in which case, the other SD’s problem.",
                            "author": "Jahammy72",
                            "id": "i4i539r",
                            "parent_id": "t1_i4903jj",
                            "score": 2,
                            "created_utc": 1649810612.0,
                            "replies": []
                        },
                        {
                            "body": "First off I love your name.\n\nSecondly she was a total weirdo and possible scammer. I'll possibly post about my meeting with her someday. \n\nThirdly she had no job at all.",
                            "author": "Heree2Comment",
                            "id": "i495sh7",
                            "parent_id": "t1_i4903jj",
                            "score": 4,
                            "created_utc": 1649650807.0,
                            "replies": []
                        },
                        {
                            "body": "u can see why they pay for company ...",
                            "author": "103h",
                            "id": "i7uvdff",
                            "parent_id": "t1_i4903jj",
                            "score": 1,
                            "created_utc": 1652052972.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I am petit. A small bike just suits me fine. 😊",
            "author": null,
            "id": "i48imy4",
            "parent_id": "t1_i47dbga",
            "score": 2,
            "created_utc": 1649639124.0,
            "replies": []
        },
        {
            "body": "For real. This🤎 I do t expect anything and my SD gloriously delights me!!",
            "author": "lotuskissed",
            "id": "i481iyk",
            "parent_id": "t1_i47o9cs",
            "score": 3,
            "created_utc": 1649631158.0,
            "replies": []
        },
        {
            "body": "Yup this would be my suggestion u/MrBuzzard. Go to a local shop, see what they recommend. They'd also be familiar with local laws/requirements/regulations to avoid pitfalls because of stupid lawmakers. \n\nThen go home do your own research based off that. If the local shop wasn't recommending crap or trying to rip you off, try and support local businesses.\n\nThere's also subreddits like r/ebikes that would be helpful with pretty pictures, suggestions and helpful links.",
            "author": "BlueLantern",
            "id": "i48i9zs",
            "parent_id": "t1_i46qklm",
            "score": 3,
            "created_utc": 1649638955.0,
            "replies": []
        },
        {
            "body": "All you are really doing when you reply like this is telling everyone in this thread that you are exactly the type of person I was talking about.\n\nAnd no, I don't expect anything from a sugar baby simply because I am rich.  I want companionship and sexual access, she wants an allowance.  Both of us consider what the other has to offer a fair exchange.\n\nThe problem with entitled sugar babies is that they expect far more in return than they have to offer. It starts with asking for an unreasonably high allowance.  Then demands for extra's and gifts.  And as OP discovered they get pissy when you don't give it to them.  They also are the type to start flaking as soon as you put them on allowance. Best to just next them right away.",
            "author": "RTManson",
            "id": "i493qmm",
            "parent_id": "t1_i490nd9",
            "score": 5,
            "created_utc": 1649649601.0,
            "replies": [
                {
                    "body": "You're trading money for sex.  \nShe's trading sex for money.  \n\n\nYou're in here grumping because you didn't get the sex you wanted for the money but called her entitled and pissy because she didn't the money she wanted for the sex.   \n\n\nSounds like you're the same level of entitled and pissy except that she's running a business and you're complaining on reddit.",
                    "author": "lethalpenis",
                    "id": "i49738x",
                    "parent_id": "t1_i493qmm",
                    "score": 6,
                    "created_utc": 1649651587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And that’s the problem. Sometime the pussy is so great we get blinded and just ignore the bad times 😂",
            "author": "SoftAndGentleSD",
            "id": "i4ek7tn",
            "parent_id": "t1_i46u9wv",
            "score": 3,
            "created_utc": 1649752899.0,
            "replies": []
        },
        {
            "body": "Text her back 😈",
            "author": "SunGoddessFancy",
            "id": "i47vtru",
            "parent_id": "t1_i46u9wv",
            "score": 6,
            "created_utc": 1649628633.0,
            "replies": []
        },
        {
            "body": "This may be getting too NSFW for this sub, but there are times when its happening and I have my head back and eyes closed and Im like what are you doing! Need to sear every visual into my memory bank",
            "author": "sparky_SD16",
            "id": "i46v1z5",
            "parent_id": "t1_i46u9wv",
            "score": 6,
            "created_utc": 1649613222.0,
            "replies": [
                {
                    "body": "Amen brother!",
                    "author": "dmwmni",
                    "id": "i46vth0",
                    "parent_id": "t1_i46v1z5",
                    "score": 0,
                    "created_utc": 1649613535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not at all!  It happens and I did not mention it in the comments and I am certain you are in the same boat but because it was as \"desktop computer\", she also needed a desk and chair which I had already purchased and for context this is all on top of any allowance/ppm.  I think the lesson learned is to take care of what you have and to respect each other, no one wants to be a tool or taken advantage of.",
            "author": "Twilight-310",
            "id": "i47iv98",
            "parent_id": "t1_i47epym",
            "score": 2,
            "created_utc": 1649623083.0,
            "replies": []
        },
        {
            "body": "What were they like?",
            "author": "lipstickdiet",
            "id": "i47hn55",
            "parent_id": "t1_i46vhnb",
            "score": 2,
            "created_utc": 1649622565.0,
            "replies": []
        },
        {
            "body": "I actually find those a turn off. And depending on how bad, sometimes nextable in itself.",
            "author": "BinghamtonSD",
            "id": "i46vot8",
            "parent_id": "t1_i46muyi",
            "score": 7,
            "created_utc": 1649613483.0,
            "replies": []
        },
        {
            "body": "Nails are not.\n\nGaudy nails are.\n\nThere IS a difference.",
            "author": "Pitkin_SD",
            "id": "i47qmno",
            "parent_id": "t1_i47pj8b",
            "score": 6,
            "created_utc": 1649626388.0,
            "replies": [
                {
                    "body": "What’s considered gaudy is subjective. A nail design that I may think is simple and cute may be come off as gaudy and extreme to someone else",
                    "author": null,
                    "id": "i47vqdy",
                    "parent_id": "t1_i47qmno",
                    "score": 2,
                    "created_utc": 1649628593.0,
                    "replies": [
                        {
                            "body": "Of course.  Nearly every judgment of a style choice is subjective.",
                            "author": "Pitkin_SD",
                            "id": "i480u3i",
                            "parent_id": "t1_i47vqdy",
                            "score": 3,
                            "created_utc": 1649630852.0,
                            "replies": [
                                {
                                    "body": "Touché my friend, touché",
                                    "author": null,
                                    "id": "i4810h1",
                                    "parent_id": "t1_i480u3i",
                                    "score": 1,
                                    "created_utc": 1649630930.0,
                                    "replies": [
                                        {
                                            "body": "Yes.  Some opinions are more narrowly or widely held than others.",
                                            "author": "Pitkin_SD",
                                            "id": "i4876iz",
                                            "parent_id": "t1_i4810h1",
                                            "score": 1,
                                            "created_utc": 1649633744.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Are gaudy nails long obnoxiously decorated nails?",
                    "author": "SunGoddessFancy",
                    "id": "i47wh43",
                    "parent_id": "t1_i47qmno",
                    "score": 2,
                    "created_utc": 1649628919.0,
                    "replies": [
                        {
                            "body": "100% this.",
                            "author": "Pitkin_SD",
                            "id": "i480i87",
                            "parent_id": "t1_i47wh43",
                            "score": 3,
                            "created_utc": 1649630705.0,
                            "replies": [
                                {
                                    "body": "Truth be told I dislike them too . I cringe every time I see them .",
                                    "author": "SunGoddessFancy",
                                    "id": "i482foj",
                                    "parent_id": "t1_i480i87",
                                    "score": 0,
                                    "created_utc": 1649631573.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're too nice! Its great that you have empathy, but her issues seem to be behavioral and she needs to fix them.",
            "author": "BusddhistDSM",
            "id": "i4bnv9s",
            "parent_id": "t1_i48uwj4",
            "score": 2,
            "created_utc": 1649700352.0,
            "replies": []
        },
        {
            "body": "LOL, exactly, maybe in a year?",
            "author": "dmwmni",
            "id": "i46o05b",
            "parent_id": "t1_i46nd3u",
            "score": 3,
            "created_utc": 1649610413.0,
            "replies": []
        },
        {
            "body": "I agree here. I would feel some type of way if an SD went out of his way to do this for me and it was more than something he bought for himself. Not that I value myself lower but the effort and thoughtfulness makes it more meaningful than the price tag",
            "author": "SatansBirthdayCake",
            "id": "i46w0kt",
            "parent_id": "t1_i46v1dw",
            "score": 8,
            "created_utc": 1649613613.0,
            "replies": [
                {
                    "body": "I actually agree here too. As long as it was the same or somewhat similar. But not double",
                    "author": "Sugarcookie54321_",
                    "id": "i46ze6e",
                    "parent_id": "t1_i46w0kt",
                    "score": 3,
                    "created_utc": 1649614993.0,
                    "replies": []
                },
                {
                    "body": "Well, depends on what it is.",
                    "author": "lipstickdiet",
                    "id": "i47i0cl",
                    "parent_id": "t1_i46w0kt",
                    "score": 1,
                    "created_utc": 1649622718.0,
                    "replies": []
                },
                {
                    "body": "And just what \"type of way\" would that be?",
                    "author": "jorjxmckie9",
                    "id": "i47vpbp",
                    "parent_id": "t1_i46w0kt",
                    "score": 1,
                    "created_utc": 1649628580.0,
                    "replies": [
                        {
                            "body": "It would be awkward but I would be gracious. It’s hard to articulate the nuance in a Reddit comment",
                            "author": "SatansBirthdayCake",
                            "id": "i48qez5",
                            "parent_id": "t1_i47vpbp",
                            "score": 2,
                            "created_utc": 1649642765.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
            "author": "NoLimitLexa",
            "id": "i48961t",
            "parent_id": "t1_i47he1w",
            "score": 2,
            "created_utc": 1649634666.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i47j75a",
            "parent_id": "t1_i47he1w",
            "score": -1,
            "created_utc": 1649623221.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "i47mutk",
                    "parent_id": "t1_i47j75a",
                    "score": 1,
                    "created_utc": 1649624762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t want to get off topic too much but my thoughts:\n\nI don’t know the exact ppm so cannot say it is high or not. 🤷‍♀️ \n\nShe might not have ambitious drive to work at another job but the OP said he saw potential to mentor her? If so, did he not try to get her into contacts with another, better paying  career? When I asked  him this he just said he disagreed with every single paragraph I wrote. 🤷‍♀️\n\nI don’t think she demanded the bike gift but he offered her one. When she picked out one higher than he wanted to spend, he could have told her it was not in his budget, and asked if she could stay under a certain amount, instead of talking down to her. 🤷‍♀️ That usually goes over better.\n\nI don’t think she is missing out on much, especially the way he interacted with me when I brought up how his delivery was off putting. 🤷‍♀️",
            "author": null,
            "id": "i48516t",
            "parent_id": "t1_i480meq",
            "score": 3,
            "created_utc": 1649632764.0,
            "replies": [
                {
                    "body": "Come on, you’re just taking the SB’s side here. What woman says no to a gift and then demands a gift that’s twice as expensive, then goes full on Veruca Salt I want it now?? That’s some heavy entitlement on her part. And not only that but she’s broke living paycheck to paycheck. \n\nAnd per her own words, it takes 3-4 months to find a suitable sd due to her standards. It does sound like she’s missing out and will be broke for another 3-4 months (or longer) while trying to find another sd.",
                    "author": null,
                    "id": "i4853m7",
                    "parent_id": "t1_i48516t",
                    "score": 7,
                    "created_utc": 1649632794.0,
                    "replies": [
                        {
                            "body": "Are you being biased like OP and not really listening to what I am saying? I saw two sides to this story. \n\nDifferent kind of bikes here but maybe same feelings. .I used to be very into spinning and mountain biking and I feel like, a bike is a very personal thing. A suitor bought me a peloton when they first came out and I asked him to return it and I picked out something else bc I felt the original peloton bike was made cheaply IMO. But the new spin bike I got was less expensive but better made in quality. Of course, the extra technology added to it separately might have ended up costing more. He didn’t keep track. He also offered to get me a mountain bike bc I was interested in starting that up again but told him I would need to pick that out also. Personally, I don’t feel a bike is the same as requesting your run if the mill tech gadget. You need to feel the bike on your body and it can be a very personal choice. 🤷‍♀️ \n\nShould a woman stay with someone for 1-4 months until she finds someone else? Maybe so, if it is not a bad relationship . .with a guy who does not keep saying he can replace her easily as if she is an easily replaceable commodity. but I don’t think she’s missing out on much or operating on scarcity mindset so she isn’t too pressed about losing him. \n\nLike I said, not all money is good money. I never said her reaction was in good taste but his wasn’t exactly innocent.",
                            "author": null,
                            "id": "i48770a",
                            "parent_id": "t1_i4853m7",
                            "score": 1,
                            "created_utc": 1649633750.0,
                            "replies": [
                                {
                                    "body": "You're not wrong about it being a personal thing, but you are making a lot of false assumptions to, at best, cling on to the devil's advocate position. She didn't even want to listen to the merits of the model I suggested. I went to a local bike shop, asked questions, and took pictures of the bike and spec sheet to show her. I don't want to lie and say that all she did was visit the website, sort the bikes by price from high to low, and picked the top result; because I didn't ask her how she picked it, but I'm pretty sure that's all she did. I did ask her why she wanted that model and all I got was \"It's the best\" and \"I want it\". Her choice was not a personal decision.\n\nThere are lots of digs at me in your comments that she isn't losing much, but at the end of the day: she picked me, I was good enough to end her 4 month search with me, she clearly enjoyed my company, I gave her everything she asked for and more for 2 months, I wanted to continue giving to her, but that's not going to happen anymore. You've also fabricated that I treat people like they are disposable to add unwarranted credibility, but it just isn't the case.\n\nShe's not a bad person, but she is too entitled. Full. Stop.\nI do admire the solidarity FWIW.",
                                    "author": "dmwmni",
                                    "id": "i48ti3b",
                                    "parent_id": "t1_i48770a",
                                    "score": 4,
                                    "created_utc": 1649644251.0,
                                    "replies": [
                                        {
                                            "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
                                            "author": "bluelunarmonkey",
                                            "id": "i48xyit",
                                            "parent_id": "t1_i48ti3b",
                                            "score": 1,
                                            "created_utc": 1649646483.0,
                                            "replies": [
                                                {
                                                    "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                    "author": "Paid-Not-Payed-Bot",
                                                    "id": "i48xzff",
                                                    "parent_id": "t1_i48xyit",
                                                    "score": 1,
                                                    "created_utc": 1649646496.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                                                    "author": null,
                                                    "id": "i490euj",
                                                    "parent_id": "t1_i48xyit",
                                                    "score": 1,
                                                    "created_utc": 1649647768.0,
                                                    "replies": [
                                                        {
                                                            "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                                                            "author": "bluelunarmonkey",
                                                            "id": "i495vbv",
                                                            "parent_id": "t1_i490euj",
                                                            "score": 2,
                                                            "created_utc": 1649650853.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                                                            "author": "everythingisducky",
                                                            "id": "i4as4z5",
                                                            "parent_id": "t1_i490euj",
                                                            "score": 0,
                                                            "created_utc": 1649687988.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                                                    "author": null,
                                                                    "id": "i4aywyd",
                                                                    "parent_id": "t1_i4as4z5",
                                                                    "score": 1,
                                                                    "created_utc": 1649690727.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                                                            "author": "everythingisducky",
                                                                            "id": "i4b5vtp",
                                                                            "parent_id": "t1_i4aywyd",
                                                                            "score": 1,
                                                                            "created_utc": 1649693579.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                                                    "author": null,
                                                                                    "id": "i4b7aor",
                                                                                    "parent_id": "t1_i4b5vtp",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649694125.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "i48x2uw",
                                            "parent_id": "t1_i48ti3b",
                                            "score": 0,
                                            "created_utc": 1649646032.0,
                                            "replies": [
                                                {
                                                    "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                                                    "author": "dmwmni",
                                                    "id": "i492323",
                                                    "parent_id": "t1_i48x2uw",
                                                    "score": 2,
                                                    "created_utc": 1649648680.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I dunno man, if she looks like he is describing I think it will be pretty easy. The whole playboy look thing tends to be pretty popular in our society. Not everyone. But a lot.",
            "author": "generalmunks",
            "id": "i4a4pnr",
            "parent_id": "t1_i480meq",
            "score": 1,
            "created_utc": 1649676700.0,
            "replies": []
        },
        {
            "body": "Right and he was getting her a 1200 bike from what I understood (which isn't cheap by any means). He states its on level with what he bought himself. \n\nHe also mentions in same post, that she's financially not in a good place at all, living check to check. \n\nSo most, *in her position* would have STFU and said, \"Thank you, Baby.\" But not the \"Choosey-Beggar\" types. They exist outside the SD SB realm too.",
            "author": "DarkEyes87",
            "id": "i46u988",
            "parent_id": "t1_i46tsaz",
            "score": 10,
            "created_utc": 1649612903.0,
            "replies": []
        },
        {
            "body": "> The bike is just part of the allowance to.see her.\n\nThat sounds like entitlement too. Allowance is to see her, the bike was extra on top.",
            "author": "dmwmni",
            "id": "i479rti",
            "parent_id": "t1_i46tsaz",
            "score": 2,
            "created_utc": 1649619293.0,
            "replies": []
        },
        {
            "body": "Sounds like she wasn’t worth it lol.",
            "author": null,
            "id": "i475y0a",
            "parent_id": "t1_i46tsaz",
            "score": 1,
            "created_utc": 1649617688.0,
            "replies": []
        },
        {
            "body": "Agreed, it's not a huge price for an e-bike. I've definitely seen plenty in the $2-3k range and even one at almost $8k. \n\nHowever I'd argue it's probably a good choice for a first e-bike like this situation. She wanted it to get to and from work, and the main reason was to not be sweaty when she arrived. There's no need for all the best specs, newest features, etc. Also there's no telling how long this \"urge\" will last before she gets over it or just finds it too inconvenient and moves on leaving the bike to sit unused.\n\nThat's besides the entire point that the e-bike that he's currently using cost less than $1200.",
            "author": "BlueLantern",
            "id": "i48gx4g",
            "parent_id": "t1_i4899n0",
            "score": 16,
            "created_utc": 1649638313.0,
            "replies": [
                {
                    "body": "Personally, I think his post made her look much more entitled.\n\nAnyway….we all have our pet peeves.",
                    "author": "Pitkin_SD",
                    "id": "i48l234",
                    "parent_id": "t1_i48gx4g",
                    "score": 13,
                    "created_utc": 1649640261.0,
                    "replies": []
                },
                {
                    "body": "You are exactly correct sir.",
                    "author": "dmwmni",
                    "id": "i4jntcx",
                    "parent_id": "t1_i48gx4g",
                    "score": 4,
                    "created_utc": 1649843476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My push bike cost another extra zero! My view on some of the technology things are that it is not spending too much money on because the one next year will be cheaper and better. I would never be able to justify buying an Apple Watch, but I have a few mechanical watch that is worth more than a new Accord.",
            "author": "SD_AU",
            "id": "i49jk5k",
            "parent_id": "t1_i4899n0",
            "score": 3,
            "created_utc": 1649660274.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i4c5u7o",
            "parent_id": "t1_i4899n0",
            "score": 3,
            "created_utc": 1649708730.0,
            "replies": [
                {
                    "body": "Yes!!!  \n\nWhen he put in the amount OP lost any of my sympathy.",
                    "author": "Pitkin_SD",
                    "id": "i4cxqgu",
                    "parent_id": "t1_i4c5u7o",
                    "score": 5,
                    "created_utc": 1649720017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have one that’s double that and one that’s half that. The cheaper one is definitely more fun.",
            "author": "riotmaster",
            "id": "i48g7dj",
            "parent_id": "t1_i4899n0",
            "score": 3,
            "created_utc": 1649637978.0,
            "replies": []
        },
        {
            "body": "That's so cheap for an ebike I'd be surprised if his is cheaper.",
            "author": "lethalpenis",
            "id": "i4908hb",
            "parent_id": "t1_i4899n0",
            "score": 2,
            "created_utc": 1649647674.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "i48zifd",
            "parent_id": "t1_i48zidb",
            "score": 1,
            "created_utc": 1649647290.0,
            "replies": []
        },
        {
            "body": "She's a professionally attractive person. Paying to get her hair done is a business expenses. It's her job.\n\nYou'll notice you weren't trying to pay a girl for company who was a little unkempt because she's working two jobs and refuses to spend on clothes that fit or makeup that won't break out her face. \n\nYou are looking to pay someone who spends their resources trying to be attractive to wealthy men who pay for company.",
            "author": "lethalpenis",
            "id": "i4903jj",
            "parent_id": "t1_i47hzut",
            "score": 17,
            "created_utc": 1649647599.0,
            "replies": [
                {
                    "body": "Except she was getting her hair and nails done to go out with a friend and not the SD…so it was a leisure expense and not a business one…unless it was for another SD…in which case, the other SD’s problem.",
                    "author": "Jahammy72",
                    "id": "i4i539r",
                    "parent_id": "t1_i4903jj",
                    "score": 2,
                    "created_utc": 1649810612.0,
                    "replies": []
                },
                {
                    "body": "First off I love your name.\n\nSecondly she was a total weirdo and possible scammer. I'll possibly post about my meeting with her someday. \n\nThirdly she had no job at all.",
                    "author": "Heree2Comment",
                    "id": "i495sh7",
                    "parent_id": "t1_i4903jj",
                    "score": 4,
                    "created_utc": 1649650807.0,
                    "replies": []
                },
                {
                    "body": "u can see why they pay for company ...",
                    "author": "103h",
                    "id": "i7uvdff",
                    "parent_id": "t1_i4903jj",
                    "score": 1,
                    "created_utc": 1652052972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're trading money for sex.  \nShe's trading sex for money.  \n\n\nYou're in here grumping because you didn't get the sex you wanted for the money but called her entitled and pissy because she didn't the money she wanted for the sex.   \n\n\nSounds like you're the same level of entitled and pissy except that she's running a business and you're complaining on reddit.",
            "author": "lethalpenis",
            "id": "i49738x",
            "parent_id": "t1_i493qmm",
            "score": 6,
            "created_utc": 1649651587.0,
            "replies": []
        },
        {
            "body": "Amen brother!",
            "author": "dmwmni",
            "id": "i46vth0",
            "parent_id": "t1_i46v1z5",
            "score": 0,
            "created_utc": 1649613535.0,
            "replies": []
        },
        {
            "body": "What’s considered gaudy is subjective. A nail design that I may think is simple and cute may be come off as gaudy and extreme to someone else",
            "author": null,
            "id": "i47vqdy",
            "parent_id": "t1_i47qmno",
            "score": 2,
            "created_utc": 1649628593.0,
            "replies": [
                {
                    "body": "Of course.  Nearly every judgment of a style choice is subjective.",
                    "author": "Pitkin_SD",
                    "id": "i480u3i",
                    "parent_id": "t1_i47vqdy",
                    "score": 3,
                    "created_utc": 1649630852.0,
                    "replies": [
                        {
                            "body": "Touché my friend, touché",
                            "author": null,
                            "id": "i4810h1",
                            "parent_id": "t1_i480u3i",
                            "score": 1,
                            "created_utc": 1649630930.0,
                            "replies": [
                                {
                                    "body": "Yes.  Some opinions are more narrowly or widely held than others.",
                                    "author": "Pitkin_SD",
                                    "id": "i4876iz",
                                    "parent_id": "t1_i4810h1",
                                    "score": 1,
                                    "created_utc": 1649633744.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are gaudy nails long obnoxiously decorated nails?",
            "author": "SunGoddessFancy",
            "id": "i47wh43",
            "parent_id": "t1_i47qmno",
            "score": 2,
            "created_utc": 1649628919.0,
            "replies": [
                {
                    "body": "100% this.",
                    "author": "Pitkin_SD",
                    "id": "i480i87",
                    "parent_id": "t1_i47wh43",
                    "score": 3,
                    "created_utc": 1649630705.0,
                    "replies": [
                        {
                            "body": "Truth be told I dislike them too . I cringe every time I see them .",
                            "author": "SunGoddessFancy",
                            "id": "i482foj",
                            "parent_id": "t1_i480i87",
                            "score": 0,
                            "created_utc": 1649631573.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I actually agree here too. As long as it was the same or somewhat similar. But not double",
            "author": "Sugarcookie54321_",
            "id": "i46ze6e",
            "parent_id": "t1_i46w0kt",
            "score": 3,
            "created_utc": 1649614993.0,
            "replies": []
        },
        {
            "body": "Well, depends on what it is.",
            "author": "lipstickdiet",
            "id": "i47i0cl",
            "parent_id": "t1_i46w0kt",
            "score": 1,
            "created_utc": 1649622718.0,
            "replies": []
        },
        {
            "body": "And just what \"type of way\" would that be?",
            "author": "jorjxmckie9",
            "id": "i47vpbp",
            "parent_id": "t1_i46w0kt",
            "score": 1,
            "created_utc": 1649628580.0,
            "replies": [
                {
                    "body": "It would be awkward but I would be gracious. It’s hard to articulate the nuance in a Reddit comment",
                    "author": "SatansBirthdayCake",
                    "id": "i48qez5",
                    "parent_id": "t1_i47vpbp",
                    "score": 2,
                    "created_utc": 1649642765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i47mutk",
            "parent_id": "t1_i47j75a",
            "score": 1,
            "created_utc": 1649624762.0,
            "replies": []
        },
        {
            "body": "Come on, you’re just taking the SB’s side here. What woman says no to a gift and then demands a gift that’s twice as expensive, then goes full on Veruca Salt I want it now?? That’s some heavy entitlement on her part. And not only that but she’s broke living paycheck to paycheck. \n\nAnd per her own words, it takes 3-4 months to find a suitable sd due to her standards. It does sound like she’s missing out and will be broke for another 3-4 months (or longer) while trying to find another sd.",
            "author": null,
            "id": "i4853m7",
            "parent_id": "t1_i48516t",
            "score": 7,
            "created_utc": 1649632794.0,
            "replies": [
                {
                    "body": "Are you being biased like OP and not really listening to what I am saying? I saw two sides to this story. \n\nDifferent kind of bikes here but maybe same feelings. .I used to be very into spinning and mountain biking and I feel like, a bike is a very personal thing. A suitor bought me a peloton when they first came out and I asked him to return it and I picked out something else bc I felt the original peloton bike was made cheaply IMO. But the new spin bike I got was less expensive but better made in quality. Of course, the extra technology added to it separately might have ended up costing more. He didn’t keep track. He also offered to get me a mountain bike bc I was interested in starting that up again but told him I would need to pick that out also. Personally, I don’t feel a bike is the same as requesting your run if the mill tech gadget. You need to feel the bike on your body and it can be a very personal choice. 🤷‍♀️ \n\nShould a woman stay with someone for 1-4 months until she finds someone else? Maybe so, if it is not a bad relationship . .with a guy who does not keep saying he can replace her easily as if she is an easily replaceable commodity. but I don’t think she’s missing out on much or operating on scarcity mindset so she isn’t too pressed about losing him. \n\nLike I said, not all money is good money. I never said her reaction was in good taste but his wasn’t exactly innocent.",
                    "author": null,
                    "id": "i48770a",
                    "parent_id": "t1_i4853m7",
                    "score": 1,
                    "created_utc": 1649633750.0,
                    "replies": [
                        {
                            "body": "You're not wrong about it being a personal thing, but you are making a lot of false assumptions to, at best, cling on to the devil's advocate position. She didn't even want to listen to the merits of the model I suggested. I went to a local bike shop, asked questions, and took pictures of the bike and spec sheet to show her. I don't want to lie and say that all she did was visit the website, sort the bikes by price from high to low, and picked the top result; because I didn't ask her how she picked it, but I'm pretty sure that's all she did. I did ask her why she wanted that model and all I got was \"It's the best\" and \"I want it\". Her choice was not a personal decision.\n\nThere are lots of digs at me in your comments that she isn't losing much, but at the end of the day: she picked me, I was good enough to end her 4 month search with me, she clearly enjoyed my company, I gave her everything she asked for and more for 2 months, I wanted to continue giving to her, but that's not going to happen anymore. You've also fabricated that I treat people like they are disposable to add unwarranted credibility, but it just isn't the case.\n\nShe's not a bad person, but she is too entitled. Full. Stop.\nI do admire the solidarity FWIW.",
                            "author": "dmwmni",
                            "id": "i48ti3b",
                            "parent_id": "t1_i48770a",
                            "score": 4,
                            "created_utc": 1649644251.0,
                            "replies": [
                                {
                                    "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
                                    "author": "bluelunarmonkey",
                                    "id": "i48xyit",
                                    "parent_id": "t1_i48ti3b",
                                    "score": 1,
                                    "created_utc": 1649646483.0,
                                    "replies": [
                                        {
                                            "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                            "author": "Paid-Not-Payed-Bot",
                                            "id": "i48xzff",
                                            "parent_id": "t1_i48xyit",
                                            "score": 1,
                                            "created_utc": 1649646496.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                                            "author": null,
                                            "id": "i490euj",
                                            "parent_id": "t1_i48xyit",
                                            "score": 1,
                                            "created_utc": 1649647768.0,
                                            "replies": [
                                                {
                                                    "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                                                    "author": "bluelunarmonkey",
                                                    "id": "i495vbv",
                                                    "parent_id": "t1_i490euj",
                                                    "score": 2,
                                                    "created_utc": 1649650853.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                                                    "author": "everythingisducky",
                                                    "id": "i4as4z5",
                                                    "parent_id": "t1_i490euj",
                                                    "score": 0,
                                                    "created_utc": 1649687988.0,
                                                    "replies": [
                                                        {
                                                            "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                                            "author": null,
                                                            "id": "i4aywyd",
                                                            "parent_id": "t1_i4as4z5",
                                                            "score": 1,
                                                            "created_utc": 1649690727.0,
                                                            "replies": [
                                                                {
                                                                    "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                                                    "author": "everythingisducky",
                                                                    "id": "i4b5vtp",
                                                                    "parent_id": "t1_i4aywyd",
                                                                    "score": 1,
                                                                    "created_utc": 1649693579.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                                            "author": null,
                                                                            "id": "i4b7aor",
                                                                            "parent_id": "t1_i4b5vtp",
                                                                            "score": 1,
                                                                            "created_utc": 1649694125.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "i48x2uw",
                                    "parent_id": "t1_i48ti3b",
                                    "score": 0,
                                    "created_utc": 1649646032.0,
                                    "replies": [
                                        {
                                            "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                                            "author": "dmwmni",
                                            "id": "i492323",
                                            "parent_id": "t1_i48x2uw",
                                            "score": 2,
                                            "created_utc": 1649648680.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Personally, I think his post made her look much more entitled.\n\nAnyway….we all have our pet peeves.",
            "author": "Pitkin_SD",
            "id": "i48l234",
            "parent_id": "t1_i48gx4g",
            "score": 13,
            "created_utc": 1649640261.0,
            "replies": []
        },
        {
            "body": "You are exactly correct sir.",
            "author": "dmwmni",
            "id": "i4jntcx",
            "parent_id": "t1_i48gx4g",
            "score": 4,
            "created_utc": 1649843476.0,
            "replies": []
        },
        {
            "body": "Yes!!!  \n\nWhen he put in the amount OP lost any of my sympathy.",
            "author": "Pitkin_SD",
            "id": "i4cxqgu",
            "parent_id": "t1_i4c5u7o",
            "score": 5,
            "created_utc": 1649720017.0,
            "replies": []
        },
        {
            "body": "Except she was getting her hair and nails done to go out with a friend and not the SD…so it was a leisure expense and not a business one…unless it was for another SD…in which case, the other SD’s problem.",
            "author": "Jahammy72",
            "id": "i4i539r",
            "parent_id": "t1_i4903jj",
            "score": 2,
            "created_utc": 1649810612.0,
            "replies": []
        },
        {
            "body": "First off I love your name.\n\nSecondly she was a total weirdo and possible scammer. I'll possibly post about my meeting with her someday. \n\nThirdly she had no job at all.",
            "author": "Heree2Comment",
            "id": "i495sh7",
            "parent_id": "t1_i4903jj",
            "score": 4,
            "created_utc": 1649650807.0,
            "replies": []
        },
        {
            "body": "u can see why they pay for company ...",
            "author": "103h",
            "id": "i7uvdff",
            "parent_id": "t1_i4903jj",
            "score": 1,
            "created_utc": 1652052972.0,
            "replies": []
        },
        {
            "body": "Of course.  Nearly every judgment of a style choice is subjective.",
            "author": "Pitkin_SD",
            "id": "i480u3i",
            "parent_id": "t1_i47vqdy",
            "score": 3,
            "created_utc": 1649630852.0,
            "replies": [
                {
                    "body": "Touché my friend, touché",
                    "author": null,
                    "id": "i4810h1",
                    "parent_id": "t1_i480u3i",
                    "score": 1,
                    "created_utc": 1649630930.0,
                    "replies": [
                        {
                            "body": "Yes.  Some opinions are more narrowly or widely held than others.",
                            "author": "Pitkin_SD",
                            "id": "i4876iz",
                            "parent_id": "t1_i4810h1",
                            "score": 1,
                            "created_utc": 1649633744.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% this.",
            "author": "Pitkin_SD",
            "id": "i480i87",
            "parent_id": "t1_i47wh43",
            "score": 3,
            "created_utc": 1649630705.0,
            "replies": [
                {
                    "body": "Truth be told I dislike them too . I cringe every time I see them .",
                    "author": "SunGoddessFancy",
                    "id": "i482foj",
                    "parent_id": "t1_i480i87",
                    "score": 0,
                    "created_utc": 1649631573.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It would be awkward but I would be gracious. It’s hard to articulate the nuance in a Reddit comment",
            "author": "SatansBirthdayCake",
            "id": "i48qez5",
            "parent_id": "t1_i47vpbp",
            "score": 2,
            "created_utc": 1649642765.0,
            "replies": []
        },
        {
            "body": "Are you being biased like OP and not really listening to what I am saying? I saw two sides to this story. \n\nDifferent kind of bikes here but maybe same feelings. .I used to be very into spinning and mountain biking and I feel like, a bike is a very personal thing. A suitor bought me a peloton when they first came out and I asked him to return it and I picked out something else bc I felt the original peloton bike was made cheaply IMO. But the new spin bike I got was less expensive but better made in quality. Of course, the extra technology added to it separately might have ended up costing more. He didn’t keep track. He also offered to get me a mountain bike bc I was interested in starting that up again but told him I would need to pick that out also. Personally, I don’t feel a bike is the same as requesting your run if the mill tech gadget. You need to feel the bike on your body and it can be a very personal choice. 🤷‍♀️ \n\nShould a woman stay with someone for 1-4 months until she finds someone else? Maybe so, if it is not a bad relationship . .with a guy who does not keep saying he can replace her easily as if she is an easily replaceable commodity. but I don’t think she’s missing out on much or operating on scarcity mindset so she isn’t too pressed about losing him. \n\nLike I said, not all money is good money. I never said her reaction was in good taste but his wasn’t exactly innocent.",
            "author": null,
            "id": "i48770a",
            "parent_id": "t1_i4853m7",
            "score": 1,
            "created_utc": 1649633750.0,
            "replies": [
                {
                    "body": "You're not wrong about it being a personal thing, but you are making a lot of false assumptions to, at best, cling on to the devil's advocate position. She didn't even want to listen to the merits of the model I suggested. I went to a local bike shop, asked questions, and took pictures of the bike and spec sheet to show her. I don't want to lie and say that all she did was visit the website, sort the bikes by price from high to low, and picked the top result; because I didn't ask her how she picked it, but I'm pretty sure that's all she did. I did ask her why she wanted that model and all I got was \"It's the best\" and \"I want it\". Her choice was not a personal decision.\n\nThere are lots of digs at me in your comments that she isn't losing much, but at the end of the day: she picked me, I was good enough to end her 4 month search with me, she clearly enjoyed my company, I gave her everything she asked for and more for 2 months, I wanted to continue giving to her, but that's not going to happen anymore. You've also fabricated that I treat people like they are disposable to add unwarranted credibility, but it just isn't the case.\n\nShe's not a bad person, but she is too entitled. Full. Stop.\nI do admire the solidarity FWIW.",
                    "author": "dmwmni",
                    "id": "i48ti3b",
                    "parent_id": "t1_i48770a",
                    "score": 4,
                    "created_utc": 1649644251.0,
                    "replies": [
                        {
                            "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
                            "author": "bluelunarmonkey",
                            "id": "i48xyit",
                            "parent_id": "t1_i48ti3b",
                            "score": 1,
                            "created_utc": 1649646483.0,
                            "replies": [
                                {
                                    "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                    "author": "Paid-Not-Payed-Bot",
                                    "id": "i48xzff",
                                    "parent_id": "t1_i48xyit",
                                    "score": 1,
                                    "created_utc": 1649646496.0,
                                    "replies": []
                                },
                                {
                                    "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                                    "author": null,
                                    "id": "i490euj",
                                    "parent_id": "t1_i48xyit",
                                    "score": 1,
                                    "created_utc": 1649647768.0,
                                    "replies": [
                                        {
                                            "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                                            "author": "bluelunarmonkey",
                                            "id": "i495vbv",
                                            "parent_id": "t1_i490euj",
                                            "score": 2,
                                            "created_utc": 1649650853.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                                            "author": "everythingisducky",
                                            "id": "i4as4z5",
                                            "parent_id": "t1_i490euj",
                                            "score": 0,
                                            "created_utc": 1649687988.0,
                                            "replies": [
                                                {
                                                    "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                                    "author": null,
                                                    "id": "i4aywyd",
                                                    "parent_id": "t1_i4as4z5",
                                                    "score": 1,
                                                    "created_utc": 1649690727.0,
                                                    "replies": [
                                                        {
                                                            "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                                            "author": "everythingisducky",
                                                            "id": "i4b5vtp",
                                                            "parent_id": "t1_i4aywyd",
                                                            "score": 1,
                                                            "created_utc": 1649693579.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                                    "author": null,
                                                                    "id": "i4b7aor",
                                                                    "parent_id": "t1_i4b5vtp",
                                                                    "score": 1,
                                                                    "created_utc": 1649694125.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "i48x2uw",
                            "parent_id": "t1_i48ti3b",
                            "score": 0,
                            "created_utc": 1649646032.0,
                            "replies": [
                                {
                                    "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                                    "author": "dmwmni",
                                    "id": "i492323",
                                    "parent_id": "t1_i48x2uw",
                                    "score": 2,
                                    "created_utc": 1649648680.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Touché my friend, touché",
            "author": null,
            "id": "i4810h1",
            "parent_id": "t1_i480u3i",
            "score": 1,
            "created_utc": 1649630930.0,
            "replies": [
                {
                    "body": "Yes.  Some opinions are more narrowly or widely held than others.",
                    "author": "Pitkin_SD",
                    "id": "i4876iz",
                    "parent_id": "t1_i4810h1",
                    "score": 1,
                    "created_utc": 1649633744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Truth be told I dislike them too . I cringe every time I see them .",
            "author": "SunGoddessFancy",
            "id": "i482foj",
            "parent_id": "t1_i480i87",
            "score": 0,
            "created_utc": 1649631573.0,
            "replies": []
        },
        {
            "body": "You're not wrong about it being a personal thing, but you are making a lot of false assumptions to, at best, cling on to the devil's advocate position. She didn't even want to listen to the merits of the model I suggested. I went to a local bike shop, asked questions, and took pictures of the bike and spec sheet to show her. I don't want to lie and say that all she did was visit the website, sort the bikes by price from high to low, and picked the top result; because I didn't ask her how she picked it, but I'm pretty sure that's all she did. I did ask her why she wanted that model and all I got was \"It's the best\" and \"I want it\". Her choice was not a personal decision.\n\nThere are lots of digs at me in your comments that she isn't losing much, but at the end of the day: she picked me, I was good enough to end her 4 month search with me, she clearly enjoyed my company, I gave her everything she asked for and more for 2 months, I wanted to continue giving to her, but that's not going to happen anymore. You've also fabricated that I treat people like they are disposable to add unwarranted credibility, but it just isn't the case.\n\nShe's not a bad person, but she is too entitled. Full. Stop.\nI do admire the solidarity FWIW.",
            "author": "dmwmni",
            "id": "i48ti3b",
            "parent_id": "t1_i48770a",
            "score": 4,
            "created_utc": 1649644251.0,
            "replies": [
                {
                    "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
                    "author": "bluelunarmonkey",
                    "id": "i48xyit",
                    "parent_id": "t1_i48ti3b",
                    "score": 1,
                    "created_utc": 1649646483.0,
                    "replies": [
                        {
                            "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "author": "Paid-Not-Payed-Bot",
                            "id": "i48xzff",
                            "parent_id": "t1_i48xyit",
                            "score": 1,
                            "created_utc": 1649646496.0,
                            "replies": []
                        },
                        {
                            "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                            "author": null,
                            "id": "i490euj",
                            "parent_id": "t1_i48xyit",
                            "score": 1,
                            "created_utc": 1649647768.0,
                            "replies": [
                                {
                                    "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                                    "author": "bluelunarmonkey",
                                    "id": "i495vbv",
                                    "parent_id": "t1_i490euj",
                                    "score": 2,
                                    "created_utc": 1649650853.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                                    "author": "everythingisducky",
                                    "id": "i4as4z5",
                                    "parent_id": "t1_i490euj",
                                    "score": 0,
                                    "created_utc": 1649687988.0,
                                    "replies": [
                                        {
                                            "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                            "author": null,
                                            "id": "i4aywyd",
                                            "parent_id": "t1_i4as4z5",
                                            "score": 1,
                                            "created_utc": 1649690727.0,
                                            "replies": [
                                                {
                                                    "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                                    "author": "everythingisducky",
                                                    "id": "i4b5vtp",
                                                    "parent_id": "t1_i4aywyd",
                                                    "score": 1,
                                                    "created_utc": 1649693579.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                            "author": null,
                                                            "id": "i4b7aor",
                                                            "parent_id": "t1_i4b5vtp",
                                                            "score": 1,
                                                            "created_utc": 1649694125.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "i48x2uw",
                    "parent_id": "t1_i48ti3b",
                    "score": 0,
                    "created_utc": 1649646032.0,
                    "replies": [
                        {
                            "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                            "author": "dmwmni",
                            "id": "i492323",
                            "parent_id": "t1_i48x2uw",
                            "score": 2,
                            "created_utc": 1649648680.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes.  Some opinions are more narrowly or widely held than others.",
            "author": "Pitkin_SD",
            "id": "i4876iz",
            "parent_id": "t1_i4810h1",
            "score": 1,
            "created_utc": 1649633744.0,
            "replies": []
        },
        {
            "body": "OP could have offered the amount on the OP’s bike of choice and SB payed the difference to get the ‘best’ and just missed buying next month’s useless expensive bag. \nKudos for exposing the VS entitlement early at two months.",
            "author": "bluelunarmonkey",
            "id": "i48xyit",
            "parent_id": "t1_i48ti3b",
            "score": 1,
            "created_utc": 1649646483.0,
            "replies": [
                {
                    "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                    "author": "Paid-Not-Payed-Bot",
                    "id": "i48xzff",
                    "parent_id": "t1_i48xyit",
                    "score": 1,
                    "created_utc": 1649646496.0,
                    "replies": []
                },
                {
                    "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
                    "author": null,
                    "id": "i490euj",
                    "parent_id": "t1_i48xyit",
                    "score": 1,
                    "created_utc": 1649647768.0,
                    "replies": [
                        {
                            "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                            "author": "bluelunarmonkey",
                            "id": "i495vbv",
                            "parent_id": "t1_i490euj",
                            "score": 2,
                            "created_utc": 1649650853.0,
                            "replies": []
                        },
                        {
                            "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                            "author": "everythingisducky",
                            "id": "i4as4z5",
                            "parent_id": "t1_i490euj",
                            "score": 0,
                            "created_utc": 1649687988.0,
                            "replies": [
                                {
                                    "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                                    "author": null,
                                    "id": "i4aywyd",
                                    "parent_id": "t1_i4as4z5",
                                    "score": 1,
                                    "created_utc": 1649690727.0,
                                    "replies": [
                                        {
                                            "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                            "author": "everythingisducky",
                                            "id": "i4b5vtp",
                                            "parent_id": "t1_i4aywyd",
                                            "score": 1,
                                            "created_utc": 1649693579.0,
                                            "replies": [
                                                {
                                                    "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                                    "author": null,
                                                    "id": "i4b7aor",
                                                    "parent_id": "t1_i4b5vtp",
                                                    "score": 1,
                                                    "created_utc": 1649694125.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i48x2uw",
            "parent_id": "t1_i48ti3b",
            "score": 0,
            "created_utc": 1649646032.0,
            "replies": [
                {
                    "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
                    "author": "dmwmni",
                    "id": "i492323",
                    "parent_id": "t1_i48x2uw",
                    "score": 2,
                    "created_utc": 1649648680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> and SB *paid* the difference\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
            "author": "Paid-Not-Payed-Bot",
            "id": "i48xzff",
            "parent_id": "t1_i48xyit",
            "score": 1,
            "created_utc": 1649646496.0,
            "replies": []
        },
        {
            "body": "Personally, I don’t really see the difference of this entitlement you speak of, with many guy’s entitlement that they should, and claim they can, have a steady stream of disposable women [who are the best looking] who should toe the line. 🤷‍♀️ except we are talking about entitlement over material items vs entitlement over having physical and emotional  access to actual human beings [women].",
            "author": null,
            "id": "i490euj",
            "parent_id": "t1_i48xyit",
            "score": 1,
            "created_utc": 1649647768.0,
            "replies": [
                {
                    "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
                    "author": "bluelunarmonkey",
                    "id": "i495vbv",
                    "parent_id": "t1_i490euj",
                    "score": 2,
                    "created_utc": 1649650853.0,
                    "replies": []
                },
                {
                    "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
                    "author": "everythingisducky",
                    "id": "i4as4z5",
                    "parent_id": "t1_i490euj",
                    "score": 0,
                    "created_utc": 1649687988.0,
                    "replies": [
                        {
                            "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                            "author": null,
                            "id": "i4aywyd",
                            "parent_id": "t1_i4as4z5",
                            "score": 1,
                            "created_utc": 1649690727.0,
                            "replies": [
                                {
                                    "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                                    "author": "everythingisducky",
                                    "id": "i4b5vtp",
                                    "parent_id": "t1_i4aywyd",
                                    "score": 1,
                                    "created_utc": 1649693579.0,
                                    "replies": [
                                        {
                                            "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                            "author": null,
                                            "id": "i4b7aor",
                                            "parent_id": "t1_i4b5vtp",
                                            "score": 1,
                                            "created_utc": 1649694125.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That all sounds reasonable, but this isn't the first time out of nowhere. As her comfort with me has grown, so has her demands. If you heard our conversation before that quote, including before yesterday, I'm sure you would agree that I did exactly what you are saying. I grew up poor, it pains me to see someone live paycheck to paycheck, especially when they can choose not to. I tried to talk about her work and spending decisions without sounding judgemental or controlling. She has so much potential, I want her to do so much more with her life, but she doesn't want that. You can't go into a relationship thinking you can change the person to be what you want them to be. The SR with her, knowing we are not in it for life, was almost perfect. She's gorgeous, a nice person, and I can roll with the demands and the most expensive wine at a restaurant, I can roll with and manage a demand for a much more expensive bike, but I can't roll with Veruca Salt. I know that the more I'm with her, the more I will see that side of her. I know her well enough now to know how steep the climb will be to enlightenment, and I don't want to sign up for that.",
            "author": "dmwmni",
            "id": "i492323",
            "parent_id": "t1_i48x2uw",
            "score": 2,
            "created_utc": 1649648680.0,
            "replies": []
        },
        {
            "body": "The VS ‘Veruca Salt’ entitlement. The hissy fit as seen on the 70s movie with Gene Wilder. That comparison for men doesn’t fit.\n\nYou’re going to need to come up with your own definition for that aspect of those men, maybe Shallow Hal? Can’t really think of one and it’s not my job",
            "author": "bluelunarmonkey",
            "id": "i495vbv",
            "parent_id": "t1_i490euj",
            "score": 2,
            "created_utc": 1649650853.0,
            "replies": []
        },
        {
            "body": "It’s different because people don’t need sex the way that people need money. \n\nPeople with money simply have more options to satisfy sexual desire than people have options to satisfy their financial desires. \n\nThere are exceptions to this, because idiots with money exist.",
            "author": "everythingisducky",
            "id": "i4as4z5",
            "parent_id": "t1_i490euj",
            "score": 0,
            "created_utc": 1649687988.0,
            "replies": [
                {
                    "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
                    "author": null,
                    "id": "i4aywyd",
                    "parent_id": "t1_i4as4z5",
                    "score": 1,
                    "created_utc": 1649690727.0,
                    "replies": [
                        {
                            "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                            "author": "everythingisducky",
                            "id": "i4b5vtp",
                            "parent_id": "t1_i4aywyd",
                            "score": 1,
                            "created_utc": 1649693579.0,
                            "replies": [
                                {
                                    "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                                    "author": null,
                                    "id": "i4b7aor",
                                    "parent_id": "t1_i4b5vtp",
                                    "score": 1,
                                    "created_utc": 1649694125.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No one ‘needs a guy for money’ though, which is what we are talking about here. and if they do, they have given a guy too much power if it’s a relationship where they depend on him for money then it’s  in exploitation territory. .",
            "author": null,
            "id": "i4aywyd",
            "parent_id": "t1_i4as4z5",
            "score": 1,
            "created_utc": 1649690727.0,
            "replies": [
                {
                    "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
                    "author": "everythingisducky",
                    "id": "i4b5vtp",
                    "parent_id": "t1_i4aywyd",
                    "score": 1,
                    "created_utc": 1649693579.0,
                    "replies": [
                        {
                            "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                            "author": null,
                            "id": "i4b7aor",
                            "parent_id": "t1_i4b5vtp",
                            "score": 1,
                            "created_utc": 1649694125.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My point is money is more valuable than sex.\n\nEdit: sex as the act, not someone’s biology.",
            "author": "everythingisducky",
            "id": "i4b5vtp",
            "parent_id": "t1_i4aywyd",
            "score": 1,
            "created_utc": 1649693579.0,
            "replies": [
                {
                    "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
                    "author": null,
                    "id": "i4b7aor",
                    "parent_id": "t1_i4b5vtp",
                    "score": 1,
                    "created_utc": 1649694125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your point is terrible, and untrue. what an awful thing to say to a woman.",
            "author": null,
            "id": "i4b7aor",
            "parent_id": "t1_i4b5vtp",
            "score": 1,
            "created_utc": 1649694125.0,
            "replies": []
        }
    ]
}