{
    "title": "Guys...have some compassion for us younger SBs...",
    "post_id": "an7q4t",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/an7q4t/guyshave_some_compassion_for_us_younger_sbs/",
    "author": "ThatKGirl",
    "body": "I saw another thread here where one of the top responses was one of you SD guys saying the girl who wrote the original post was over-educated, under-employed, in debt, making poor decisions, and using SA like an aspiring escort.\n\nI just have to...really? wow.\n\nDouble-standard much? But it's not even that. I'm used to the double-standard where you can have tons of sex with strangers but if a girl does it, she's a ho.\n\nIt's more...have some compassion for this poor girl. This may surprise you, guys, but there's no class in school for how to do \"this\" right. Every single girl who you meet this way has walked, alone, into a room with a guy who wants to use her body. Every single girl you take to your hotel is hoping you follow her \"rules' and don't hurt her. And I guarantee you that every single one of them is silently praying that you keep up your end of the deal and actually fucking \\*PAY\\* her the way you're supposed to. We're terrified about all this stuff because sometimes it doesn't happen. Because some guys force things. Some guys like to cause pain. Some guys don't think \"they\" should have to pay. And no one wants it to be \"like a transaction\" (which pretty much always turns into \"let's have sex and I'll pretend I'm going to pay you another time\").\n\nDo you know how terrifying it is to put yourself out there? To deal with 100 creepy come-ons for every legit contact you make?\n\nMaybe you do know what it's like to feel like your drowning in debt (hint...it feels like you're drowning!), but I'd take a bet that pretty much none of you guys has ever agreed to let a stranger paw you or had to have the courage to demand a condom while some guy who's as old as your dad, three times as big as you, and a million times more rich/powerful/entitled is doing everything he can to \"accidentally\" put it in bare.\n\nI don't know anything about that girl who wrote that article. She did come across as a little...off to me, too. But not every girl who is doing \"this\" and not getting it exactly right is clueless. Sometimes we're still learning. Sometimes we're even acting a certain way because it's what we've learned works with the guys we've been with. Or sometimes we're just too fucking scared to do anything else.\n\nRemember the person, ok? Especially if it's a naive little 20 year old who is drowning in debt.\n\nMaybe, even, be thankful that there are girls who are willing to say \"Yah, I'll do it with guys for money...because it is exciting, I enjoy sex, and I have to pay rent\". If you have the luck to meet someone like this and if you have even the slightest connection with her, then treat her right. She'll be the best friend you could ever hope for! :)\n\n&#x200B;\n\n&#x200B;\nEdit: wow. This blew up! And it sounds so bad. I didn’t mean to sound so angry! I just wanted us to be nice to each other. This is fun and exciting! Or, it’s supposed to be. And when we make mistakes we laugh and learn and keep going. The guys I’ve met doing this have almost all been amazing gentlemen - but the learning curve is steep.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/an7q4t/guyshave_some_compassion_for_us_younger_sbs/",
    "score": 450,
    "upvote_ratio": 0.93,
    "created_utc": 1549322433.0,
    "num_comments": 97,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I got a taste of this perspective several years ago. She was 19. The m&g had gone well enough.  She was shy/timid but admitted she was new to this,  so I accepted that she just needed to get comfortable.  We worked out terms and had our first date the next night.  I told her that I was happy to go slow and see her platonicaly until she was ready to go further,  but she insisted she was ready at the end of dinner.  I could tell she tensed up while clothing came off and I was sure she was not ok shorty after she started oral.  I asked if she was sure she was ready for this and she started sobbing. With some comforting,  she shared she had an infant at home and child protective services was coming back in two days to make sure she had her power turned back on or they would take the baby.  \n\nWhat was fun and games to me was what she needed to do not to lose her baby. I called and paid the power bill right then and there. I gave her the envelope i already had for her and sent her home to her baby.\n\nIf you check my post history,  I have made some unpopular comments about not treating sugaring as transactional relationships with an escort and this girl is where that started for me. Since her, I prefer a little older SB, I am happy to be patient and wait until they are ready to move things along.  I genuinely want a SR we are both glad to be in. ",
            "author": "SDvegas",
            "id": "efs69zj",
            "parent_id": "t3_an7q4t",
            "score": 160,
            "created_utc": 1549351014.0,
            "replies": [
                {
                    "body": ">she started sobbing\n\nbeen there, the next week I helped her with a resume and to get a job. Her kid just needed to get a bed and some Christmas presents.  He had a nice Christmas and slept better. She was 29 :)",
                    "author": "TooOldForSD",
                    "id": "eft67kd",
                    "parent_id": "t1_efs69zj",
                    "score": 32,
                    "created_utc": 1549389638.0,
                    "replies": []
                },
                {
                    "body": "Man... such a sad story... Feel genuinely for her... to be at the risk of losing her Baby :'( So sad... No one following this lifestyle should be because they have to (or feel like they have to).",
                    "author": null,
                    "id": "ei78a01",
                    "parent_id": "t1_efs69zj",
                    "score": 4,
                    "created_utc": 1552215736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even a not so naive, \"old\" SB deals with the same shit.  It sucks.  I'm looking while my current SR winds down (he knows I'm looking, it's ending for reasons unrelated to \"us\") and it's been miserable at times.  If I was doing this in my 20s, I can't even imagine",
            "author": "CentralUSGal",
            "id": "efreiw0",
            "parent_id": "t3_an7q4t",
            "score": 76,
            "created_utc": 1549324805.0,
            "replies": [
                {
                    "body": ">Even a not so naive, \"old\" SB deals with the same shit.\n\n\\+1\n\n&#x200B;",
                    "author": "MASugarBaby",
                    "id": "efrg9xe",
                    "parent_id": "t1_efreiw0",
                    "score": 24,
                    "created_utc": 1549326305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. As an SD, loved the sincerity of your post. I try to be a good guy, considerate, generous etc, but for some reason your post made me feel like a bit of a shit...and very sad...On my side of the table, it’s all fun and games, pretty girls, good meals, sex and adventure for fundamentally a trivial amount of money...but for you SBs...not so much...quite the cold shower...but thanks for a much needed wake up call.",
            "author": "zenpelican",
            "id": "efrgoo1",
            "parent_id": "t3_an7q4t",
            "score": 158,
            "created_utc": 1549326648.0,
            "replies": [
                {
                    "body": "I think for a lot of SBs and SRs it can get to that place, but it takes a minute. \n\nI know personally I’m not necessarily fully comfortable with a guy until we’ve had a few dates. And that’s vanilla guys - that I’m conditioned to trust more than old men and who I readily swap real information with, and who are not in charge of the situation because they’re paying me.  In sugar there are an abundance of factors that point towards running away, but instead I’m expected to jump into bed the second time I lay eyes on the man. It’s like you’ve skipped ten steps. Eventually you make that ground up, but you still have to be past the finish line immediately. \n\nIt’s a choice we make for a variety of reasons. But it’s not an easy one. ",
                    "author": "MASugarBaby",
                    "id": "efrhtza",
                    "parent_id": "t1_efrgoo1",
                    "score": 43,
                    "created_utc": 1549327611.0,
                    "replies": []
                },
                {
                    "body": "Just remember, if you're a good man, you're a good man.  Find the right woman for this and it's not scary or creepy or distorted or dysfunctional. On her side of the table, in the right circumstances, it's \"fun and games, a decent gentleman, good meals, sex and adventure for fundamentally a life changing amount of money.\"\n\nI'm proud of my SRs and I have put a lot of effort into the comfort and well-being of my partner.  I'm protective, considerate and thoughtful.  So don't let the broad brush make it appear that every time someone enters into this, it's some scary sex-trafficking type of situation.  Some women are excited, eager and enthusiastic about these relationships and the opportunities they provide.\n\nIf you're good to your girl, the last paragraph of the OP and the Edit are where you should focus.  If you're not one of the \"some guys,\" then there's no reason to feel like shit.",
                    "author": null,
                    "id": "efsq396",
                    "parent_id": "t1_efrgoo1",
                    "score": 4,
                    "created_utc": 1549378016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your post struck a chord with me. There are large power imbalances in an arrangement and I always worry about exploiting someone in need. It’s the reason on occasion  I have been scammed, and it’s a price I am willing to pay. Unfortunately, for better or worse, my days of care free sugaring and meeting amazing people may be coming to an end. ",
            "author": "AussieSD",
            "id": "efs33ir",
            "parent_id": "t3_an7q4t",
            "score": 27,
            "created_utc": 1549346751.0,
            "replies": []
        },
        {
            "body": "I think this is the first post on SLF that I've seriously considered giving gold to. \n\n&#x200B;\n\n> I'd take a bet that pretty much none of you guys has ever agreed to let a stranger paw you or had to have the courage to demand a condom while some guy who's as old as your dad, three times as big as you, and a million times more rich/powerful/entitled is doing everything he can to \"accidentally\" put it in bare.\n\n&#x200B;\n\nThis hit me right in the gut. Sugar is hard. It gets easier once you get to know the guy, but those first few interactions require ignoring the blaring red \"danger\" alarm going off in your head that has warned you about stranger danger for years. But we don't get enough time to get to know the guy before we have to let him paw at us - 1-2 max platonic dates and we're expected to be naked. It's tough. \n\n&#x200B;\n\nI'm not saying sugar is bad, and I'm not in any way regretful of the choices I've made in the bowl. But it's not easy. And some compassion for the very different places that SBs and SDs are coming from when they hop into bed together would go a long way. ",
            "author": "MASugarBaby",
            "id": "efrfgcp",
            "parent_id": "t3_an7q4t",
            "score": 100,
            "created_utc": 1549325577.0,
            "replies": []
        },
        {
            "body": "*Every single girl you meet.... has walked alone, into a room with a guy who wants to use her body.\n\nThis. Applies to pretty much all women. Great wording OP.",
            "author": "foggymaria",
            "id": "efrnhgv",
            "parent_id": "t3_an7q4t",
            "score": 66,
            "created_utc": 1549332270.0,
            "replies": [
                {
                    "body": "At the risk of 10^6 downvotes ...... in today's world most young women who are participating in arrangements have walked into a room intending to have sex with a man (or boy) whom she met that evening at a party, bar, social event, internet hookup or other. Where sugaring gets damaging is where there is manipulation, desperation, deceit or threats. Yes it has become much more of a jungle with the rise of an army of scam artists using SA as a source of victims where they had no intent other than to leverage false promises into sexual fraud.",
                    "author": "pinotandsugar",
                    "id": "efs69ig",
                    "parent_id": "t1_efrnhgv",
                    "score": 4,
                    "created_utc": 1549350994.0,
                    "replies": [
                        {
                            "body": "You really don't get the whole consent concept, do you? ",
                            "author": "earthlingfemale",
                            "id": "efsbmme",
                            "parent_id": "t1_efs69ig",
                            "score": 20,
                            "created_utc": 1549360074.0,
                            "replies": [
                                {
                                    "body": "Not sure where that came from......... I absolutely believe in and practice that not only is consent a foundational requirement but that it is also a revokable and subject to such limits as the SB wishes to impose.  without question or negotiation...  It's something that's important in itself but also leads to long term relationships both as sugar partners and often later as friends as they move to a different phase of their lives. I'm sorry if it was interpreted it differently . ",
                                    "author": "pinotandsugar",
                                    "id": "efsqu9m",
                                    "parent_id": "t1_efsbmme",
                                    "score": 5,
                                    "created_utc": 1549378594.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You're right and why worry about down votes? It's a forum to voice yourself. That said the need increases, age difference (in most cases) as well as nervousness. Do you want to be used by a particular kind of guy...?? There's a bit of Difference between middle aged banker/lawyer/business man and college guy I've got a crush on. Just for perspective as both serve different purposes 😊",
                            "author": "absthaw",
                            "id": "efskfo7",
                            "parent_id": "t1_efs69ig",
                            "score": 7,
                            "created_utc": 1549372890.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Including those who hookup on tinder!!",
                    "author": null,
                    "id": "efu3rjm",
                    "parent_id": "t1_efrnhgv",
                    "score": 2,
                    "created_utc": 1549414090.0,
                    "replies": []
                },
                {
                    "body": "True but dramatic.  Participation is voluntary.  Girls don’t just find themselves in that situation,  they sign up for it and follow through with 1-2 meetings.    I always do a no contact meet and greet because I never want a girl to feel rushed or uncomfortable.  If we don’t click at the M&G then it’s not really a big investment or loss on either side.   Pushing for intimacy on the first date is a huge red flag on both sides.  Pushiness on his and desperation on hers.  ",
                    "author": "LotBuilder",
                    "id": "efrzlcx",
                    "parent_id": "t1_efrnhgv",
                    "score": -3,
                    "created_utc": 1549342856.0,
                    "replies": [
                        {
                            "body": "You’re wrong to assume that even after 1-2 platonic dates a SD won’t become aggressive suddenly. I’ve seen it firsthand. Sometimes they change the second the door is locked and you’re alone. \nWomen have a very different experience. If he decides to be violent or not listen to your limits, how can a woman fight off a man 2-3 times her size? It’s almost impossible. ",
                            "author": "babe__ruthless",
                            "id": "efs5mlx",
                            "parent_id": "t1_efrzlcx",
                            "score": 30,
                            "created_utc": 1549350072.0,
                            "replies": [
                                {
                                    "body": "It's how the bowl plays. A girl has to educate herself before stepping in. That's just the truth. \n\nSome women aren't into sex yet they step in the bowl with Daddies twice or triple their age and sometimes so ugly inside out that they shiver at his touch. Yet, that's not the point. Those ladies are in for the goodies but forget the \"rules\" and when comes the time to speak up, they clam up and shove his dick wherever, thinking it'll be easy. It's not for the faint of heart.  It's not easy and it can produce very bad long term traumatisms.\n\nThe bowl is not a game. Even for a woman who think she knows how to do it, she can realize very quick that it won't work but \"MONEY\"! That's the problem.  If you're not desperate, you can quit as per your judgment. If not, the relationship will most certainly get worse.\n\nBut that's been said over and over. \n\nI still understand the OP's plea and wish her well.",
                                    "author": "KishiKawaii",
                                    "id": "efsiimn",
                                    "parent_id": "t1_efs5mlx",
                                    "score": 0,
                                    "created_utc": 1549370773.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "As a man how can you say it doesn’t apply to women? How do you know what truly goes on in their lives? ",
                            "author": "danger0usw0man",
                            "id": "efs5xav",
                            "parent_id": "t1_efrzlcx",
                            "score": 17,
                            "created_utc": 1549350499.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow good post this gets to the heart of things, you don’t sound angry and have the most upvoting I’ve seen on this forum. I support you and your thoughts. You mention power, money, safety, the reality of being a fantasy 24/7 and more. This post is more than good\n\nSb young and old have to deal with this. A lot of us do things because we are desperate for money or as you say drowning in debt. \nWe risk our sexual health, chance of pregnancy and risk our lives with these men. We hope they are truthful with us but we don’t know. They can just change just like that and use their power and money. \n\nThe lack of compassion for sb is sadness. ",
            "author": "plussizefairy",
            "id": "efsitxq",
            "parent_id": "t3_an7q4t",
            "score": 23,
            "created_utc": 1549371137.0,
            "replies": []
        },
        {
            "body": "I love this! I felt this in my chest.",
            "author": "Californiadreamgirl",
            "id": "efrcbrf",
            "parent_id": "t3_an7q4t",
            "score": 22,
            "created_utc": 1549323037.0,
            "replies": []
        },
        {
            "body": "Regardless of your difference of opinion from the OP...  It's ok to simply **take a moment to sympathize** with the plight of the young SBs as they are truly more vulnerable.  You don't have to have the last say.  \n\n&#x200B;\n\nThe OP is simply asking for compassion, it's **ok to be silent** and let those with compassion have their moment.",
            "author": null,
            "id": "efrxjr1",
            "parent_id": "t3_an7q4t",
            "score": 30,
            "created_utc": 1549340836.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "yourgirlfriday99",
                    "id": "efsadii",
                    "parent_id": "t1_efrxjr1",
                    "score": 5,
                    "created_utc": 1549357743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "unfortunately most guys are not looking for a SB to be actually helpful!  I am disgusted by most responses I hear from  SD's.  I have had 3 arrangements the last was 3 years, my goal was to get her to a place where my money was no longer needed, now we did enjoy a great physical arrangement, but I cared for her on a personal level, I did with the other 2 as well, I hate seeing guys treat SB's like prostitutes or brag about how cheap they got this or that SB!  Now I know there are plenty of SB's out there for the wrong reasons as well, but for the most part they are easy to spot.  Good luck and great post!  ",
            "author": "tulsatyler23",
            "id": "efs2k6u",
            "parent_id": "t3_an7q4t",
            "score": 20,
            "created_utc": 1549346115.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efribuo",
            "parent_id": "t3_an7q4t",
            "score": 24,
            "created_utc": 1549328033.0,
            "replies": [
                {
                    "body": "How does this map to hooking up with a guy on tinder and ending up at his house? ",
                    "author": null,
                    "id": "efu3q0k",
                    "parent_id": "t1_efribuo",
                    "score": 1,
                    "created_utc": 1549414055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post and mostly great comments on the post!  It would be nice to find an SD like most of the ones in this group because I think for the most part, they get it.  At least they have read what we have to say and know our concerns and goals.  I think this group has given me unrealistic expectations of what to expect hahaha  just joking!  ",
            "author": "NOLA_Lady504",
            "id": "efsqlxa",
            "parent_id": "t3_an7q4t",
            "score": 5,
            "created_utc": 1549378417.0,
            "replies": []
        },
        {
            "body": ">...over-educated, under-employed, in debt, making poor decisions...\n\nI gotta say, in all honesty, this sounds like your average 20-something be they male or female. Hell, I certainly used to resemble that remark.\n\nThat's the fun is being a good mentor.  I prefer to leverage my life experience so SB(s) don't end up doing the same stupid shit I did in my youth. ",
            "author": "pluvoaz",
            "id": "efrglex",
            "parent_id": "t3_an7q4t",
            "score": 21,
            "created_utc": 1549326573.0,
            "replies": []
        },
        {
            "body": "To the OP and SB’s:  Some of us SD’s do “get it” which is why we pay our allowance in advance or at the very start of every date, treat you with respect, avoid unnecessary arguments, talk to you and treat you as our equals, advance you money when needed at the risk of getting rinsed and we avoid turning you into the police and your families when you do rinse us since we know this works both ways... and most of all... we greatly appreciate and consider ourselves very fortunate to be in your orbit for a few special hours every month.  Thank you!",
            "author": null,
            "id": "efrpi5h",
            "parent_id": "t3_an7q4t",
            "score": 22,
            "created_utc": 1549333926.0,
            "replies": []
        },
        {
            "body": "Thank you so much for this post. I’m so glad someone’s been transparent about how hard it can be for the SB’s sometimes",
            "author": "cricketcactus",
            "id": "efrivwm",
            "parent_id": "t3_an7q4t",
            "score": 16,
            "created_utc": 1549328503.0,
            "replies": []
        },
        {
            "body": "This was a really well written post, and it really hit home for me. The respect for young vulnerable women in the bowl is not where it should be ",
            "author": "danger0usw0man",
            "id": "efs647x",
            "parent_id": "t3_an7q4t",
            "score": 10,
            "created_utc": 1549350777.0,
            "replies": []
        },
        {
            "body": "Preach.",
            "author": null,
            "id": "efs9dew",
            "parent_id": "t3_an7q4t",
            "score": 5,
            "created_utc": 1549355960.0,
            "replies": []
        },
        {
            "body": "Powerful post!  But, how many times have we read in these pages a SB's comment something like this. \" I know my worth. Im gonna leverage my youth and beauty while I have it to ( pay off loans, make that down payment, build up my IRA, get that Gucci bag, etc.)  I know we hear \"I like older men\", but seriously. How many young women think \" I can't wait to nab an old man my Dad's age or Granddad's because i find an overweight, bald, alcoholic ,cigar smoking geezer attractive? I thought so -not too many. \n\nSo ,while I sympathize with the risks,dangers, and disgust that SBs have to bear, in the end they are adults and need to be present to make responsible decisions. Here are some suggestions:    \n1) don't sugar-it is risky, potentially dangerous, and often disgusting    \n2)If you DO sugar:    \n      a- prepare thoroughly by studying all the information in these pages     \n      b-decide on your limits and stick to them.  If you don't like anal--don't do it.    \n      c-establish a backup system with friends,family. If you are going to play make sure you are not alone.    \n      d-ALWAYS negotiate an allowance BEFORE going for intimacy.  Yes, it is awkward ,but you have to get over it. Playing this game requires dealing with tough situations and negotiating with your elders who are better at it than you are. But never forget. You have 100% of what the POT is looking for. Without your agreement and consent he will not get to play with you.      \n      e-ALWAYS collect allowance up front before intimacy. (see f). Yes- it is hard to do and awkward and transactional ,but sugar IS such a thing. We just pretend that it isn't. It gets easier after the deed is done and the deal is in place.     \n      g-  Run at the first sign of weirdness. If you think something is off, it usually is.     \n      h-I could go on and on, but you've heard it all before. NOBODY is going to look after your wellbeing like you will. So do it.  \n\n",
            "author": "GSSD",
            "id": "efsourg",
            "parent_id": "t3_an7q4t",
            "score": 5,
            "created_utc": 1549377002.0,
            "replies": [
                {
                    "body": "So all old men are overweight, bald, alcoholic, cigar-smoking geezers who are also dangerous predators.... give me a break ",
                    "author": "Sparkledork1",
                    "id": "eftcjgf",
                    "parent_id": "t1_efsourg",
                    "score": 2,
                    "created_utc": 1549394012.0,
                    "replies": [
                        {
                            "body": "except for me of course! ",
                            "author": "GSSD",
                            "id": "eftd3in",
                            "parent_id": "t1_eftcjgf",
                            "score": 4,
                            "created_utc": 1549394398.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your post is very strong and very true. \n\nYet, I believe those problems do reside in the choices made by the SBs that suffer from bad experiences. \n\nI'm a female and have been through some of the hardships you described. However, when looking back at each of those bad times, I always realized how stupid my decisions were.\n\nHaving debts is bad...REAL bad. Money rule this world, so does power. \n\nEmpowering oneself is the main tool that a female has to develop. How to do it ? It's all about the perception that you have about yourself. Sure, it won't pay your bills, but it will help you remember where you are and what your goals are.\n\nReading the whole Intern story, the main aspect that hits me is how lost she is. Her self-esteem is extremely low and most of the time, she's not aware of the reasons behind her decisions except: making money. Where is she? Who is she? That's what made me sad when reading her dairy. \n\nThere's indeed no class on how to behave as a SB, but in 2019, you have access to this Forum, testimonies like that one (The Intern), and plenty other stories on the net. There's also the possibility of meeting other SBs. The goal is to open up to the right people by learning how to screen the demands.  The goal is to step out of the dark.\n\nThere's also an adamant rule to Sugaring which not a lot of younger SBs seems to understand. \n\nNever Sugar Out of Despair ! EVER ! \n\nBy doing so, the SB will always end up in the most shitty situations. That's just the basic logic of submissiveness and dominance.  But if that logic isn't understood, then time has yet to come before joining the bowl. \n\n*I understand that some people really find themselves in deep trouble and will admit that I have no clue how they'll get out of that rabbit hole, but I know for sure that hell will be paid million time before and IF they do get out. I feel deeply sadden for the faith of those individuals.*\n\nVictimisation is a dangerous path. It leads to conclusions based on biased and extremely shocking situations, but the truth is, more often than not, there's 2 sides involved. Some situations truly deserve to be labeled as such, but they include specific components which clearly demonstrate the complete lack of control and/or freedom of the victim. A SB getting herself in a SR freely (none obstent the financial struggle) doesn't fit as a victim unless she's being kidnapped, coarse or worse. Same rule apply for SDs, just with different type of struggles.\n\nFinally, money is dangerous. It's a tool and has to be handled as such. Money doesn't bring life, nor death, but it can become a tool for one or the other if not carefully managed. Maturity in handling money has to be developed through life experience and, if lucky, by the teaching of parents, teachers or very close friends.\n\nIf every SB would join the bowl with a clear mindset, goals already established and a good opinion of herself, the struggles would definitely lessen. \n\nNo, it's not easy to get it \"wet\" with a much older guy, and yes the douch will always hang around, but as you learn how to swim in this huge pool, you'll avoid the obvious escort seekers and the less obvious insane men.\n\nThe 2nd adamant rule to Sugaring\n\nStep by Step Screening/Veting ! Especially if your young and beautiful. Take it slow before going to a first date, ask questions, feel the man throughout his texts, learn the red signs \n\nExamples : \nDo you offer anal? = Next !\nI'm successful and will never pay or need to pay for sex! = Next! \nWant to come to my place for the M&G? = Next! \nWanna come to a party tonight babe? = Next!\n\nLearning how respectful older men talk to women is a must. Being upfront yet tactful is a must. Learning how to say no, is a definite must. Learning what it means to be a SB is a must. Learning why your POT SD wants a SB is a must. And the list could go on and on.\n\nYes, some men have to learn how to treat women properly. Women need to learn how to treat themselves properly first before engaging with men. And women need to learn how to treat men properly. \n\n\nThat's it, so long, way too long...",
            "author": "KishiKawaii",
            "id": "efrkp9w",
            "parent_id": "t3_an7q4t",
            "score": 13,
            "created_utc": 1549329990.0,
            "replies": [
                {
                    "body": ">Never Sugar Out of Despair ! EVER ! \n\nI think it's been established that while this is great advice theoretically, it's just way too idealistic and to be honest, a bit rich coming from someone who *isn't* in despair. I'm not personally but I can empathize with how tough this world can be when you're young and in a tricky situation in need of a helping hand. \n\nThat's why the above advice will always be ignored and that's why instead of sanctimoniously telling them to stay out of the bowl (which they won't), we should focus on empowering them to remember and giving them tools to enforce their boundaries despite their desperation. ",
                    "author": "yourgirlfriday99",
                    "id": "efsal8e",
                    "parent_id": "t1_efrkp9w",
                    "score": 19,
                    "created_utc": 1549358132.0,
                    "replies": [
                        {
                            "body": "Indeed, \n\nI also mentioned the importance of empowering oneself in my very long post. It would take another post to explain how to do that though. You are welcome to provide those tools anytime.\n\nI've been there too and got fairly out of the rabbit hole. I still think that desparation is not the key to Sugaring. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\nToday, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to.  I didn't always think that way and learned my lesson. Some are lucky and never get to learn, and I'm truly happy for them. Again, life is not fair.\n\nEither I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.",
                            "author": "KishiKawaii",
                            "id": "efshwog",
                            "parent_id": "t1_efsal8e",
                            "score": 2,
                            "created_utc": 1549370054.0,
                            "replies": [
                                {
                                    "body": "Of course desperation is not the key to Sugaring. I just think we need to recognize the complete and utter futility of a statement like 'Never ever sugar out of desperation!'\n\n>I've been there too and got fairly out of the rabbit hole. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\n>Today, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to. I didn't always think that way and learned my lesson. \n\n>Either I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.\n\nSo with respect, it's not really about *you*... Your experiences are not necessarily the experiences of others and especially those your comment seems to be directed at; if your advice is coming directly from your own perspective, the scope of its benefit is limited. Much of your original comment contains helpful advice! But your oversimplified world view (and as an older SB, I'm assuming?) is shown in idealistic statements like 'If every SB would join the bowl with a clear mindset, goals already established and a good opinion of herself, the struggles would definitely lessen.' That would be great but it is simply not the world we live in, particularly in a bowl that attracts young and naive teenagers, people with little self worth and people in precarious financial situations - whether we like it or not. ",
                                    "author": "yourgirlfriday99",
                                    "id": "efsl9ai",
                                    "parent_id": "t1_efshwog",
                                    "score": 6,
                                    "created_utc": 1549373738.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "efsjws5",
                            "parent_id": "t1_efsal8e",
                            "score": 0,
                            "created_utc": 1549372329.0,
                            "replies": [
                                {
                                    "body": "I know it's true. It's really not ideal - but unfortunately lots of people in this world aren't living in ideal situations. \n\n>Maybe this should be rewritten to... \"you should not sugar out of despair.  And if you have to - you should understand why you shouldn't, so you can try to avoid the same mistakes\".\n\nAnd this is my point exactly. Does anyone really think someone in a desperate situation and entering the bowl is going to read the statement 'you should not sugar out of despair' and think 'Oh gee, I guess that's true. Now I'm going to stay out of the bowl until I'm financially stable!'. Of course not. It's like telling a drug addict 'Don't do drugs' vs 'Don't do drugs but if you must, here's how to use needles safely etc'. (Bad analogy but I'm in class and multitasking lol)\n\nWith your revision above, yes they're going to skip straight past the first sentence but maybe actually gain something useful by understanding *why* they will be vulnerable and how they can take steps to minimize it.",
                                    "author": "yourgirlfriday99",
                                    "id": "efsl0ic",
                                    "parent_id": "t1_efsjws5",
                                    "score": 6,
                                    "created_utc": 1549373489.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thanks Kish you said what none of SDs would be allowed to say here risk of the down vote cascade.\n\nYou have to say it long....because so many will take just one thing out of context because you didn't make it long.\n\nA++ and a million upvotes",
                    "author": "Momopllc",
                    "id": "efrojt1",
                    "parent_id": "t1_efrkp9w",
                    "score": 5,
                    "created_utc": 1549333146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remember that post very well. Unless I missed it, or the comments were deleted, I don’t think anyone called the girl in that article a ho. \n\nMy comment on the article had to do with the series of choices that she made. She is dependent on sugaring which I believe is dangerous. It puts her in impossible situations both in vanilla dating and sugar dating. \n\nShe ignores her own feelings about her relationships (I.e. Ray and how he behaves towards her) and any red flags she has! That’s scary to me! There’s almost a palpable desperation in her writing and it opens her up to a lot of hurt.\n\nI don’t think anyone is expecting us to get it right 100% of the time, but at least listen to your instincts. It’s integral to sugaring.\n\n\n\n\n\n",
            "author": null,
            "id": "efrlx55",
            "parent_id": "t3_an7q4t",
            "score": 11,
            "created_utc": 1549330982.0,
            "replies": []
        },
        {
            "body": "Very well worded! ",
            "author": null,
            "id": "efrcobz",
            "parent_id": "t3_an7q4t",
            "score": 7,
            "created_utc": 1549323317.0,
            "replies": []
        },
        {
            "body": "I remember the article. Maybe edit your post to include the link where it was posted originally?",
            "author": "sweetpoly",
            "id": "efrerr4",
            "parent_id": "t3_an7q4t",
            "score": 5,
            "created_utc": 1549325011.0,
            "replies": []
        },
        {
            "body": "I agree with this actually (and yes I was one of the people who was openly annoyed at that article - albeit didn't read most of it). I mean I know the parrels many SBs (of any age) face when they go out and meet a complete stranger for the first time, especially for the first sexual encounter with them. As a big and tall man I am very cognizant of that fact and try to be very accommodating and try to find out likes and dislikes and all of that. I don't want to be viewed as a creep or a potential threat, but I know it comes with the territory. So yes this is a great post and sometimes we need to be reminded of it. ",
            "author": "BigBearSD",
            "id": "efsmhih",
            "parent_id": "t3_an7q4t",
            "score": 4,
            "created_utc": 1549374950.0,
            "replies": [
                {
                    "body": "*perils",
                    "author": "Cookie_Duchess",
                    "id": "efsned6",
                    "parent_id": "t1_efsmhih",
                    "score": 1,
                    "created_utc": 1549375791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did not see thread, can you please link?   ",
            "author": null,
            "id": "efrcxfn",
            "parent_id": "t3_an7q4t",
            "score": 5,
            "created_utc": 1549323520.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efre600",
                    "parent_id": "t1_efrcxfn",
                    "score": 7,
                    "created_utc": 1549324517.0,
                    "replies": [
                        {
                            "body": "If that's it, then it changes things dramatically. There is a big difference between saying things like that to someone and talking about someone when they just wrote an autobiographical article.",
                            "author": "sexviewer",
                            "id": "efrf7f7",
                            "parent_id": "t1_efre600",
                            "score": 4,
                            "created_utc": 1549325373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This \"job\" has a dark side: if you are a greedy person, becoming a SB will make you more greedy.\n\nAnother category is SB's in a desperate need for money, but deep down are women who \"like\" to suffer (in a subconscious way ofcourse). They get in arrangements or relationships where they are always deceived and humiliated. She made her drama public to get more drama. Every girl here knows a person like this.\n\n\"Smart\" and \"intelligent\" are two different topics. You can be intelligent having an important degree, excel in science, technology etc. but when it comes to relationships and human interaction you are not that \"smart\".\n\nA SD can be a victim as well in his seeking for pleasure, love or acceptance. There are no right people on this planet. \n\nI use to say each of us deserve our fate, that's why everyone say \"no\" to the question \"would you love someone like you?\"\nWhen you are going to somebody with so many needs, you are going as a beggar, and a beggar can not choose. That's why I insist a SB has to have a decent job before getting into this and have her shit together. \nAre people on SR with serious mental problems, abused or neglected children begging for love and attention. Some pay  with money, some pay with their body. \n\n\n",
            "author": null,
            "id": "eftqv7r",
            "parent_id": "t3_an7q4t",
            "score": 2,
            "created_utc": 1549404081.0,
            "replies": []
        },
        {
            "body": "This is post of the year material. If everyone approached relating to other humans (especially in intimate ways) with this kind of thoughtful empathy and compassion, the sugar bowl and the world would be a much more positive and enlightened place. ",
            "author": "Cledaddy23",
            "id": "eg5oqn9",
            "parent_id": "t3_an7q4t",
            "score": 2,
            "created_utc": 1549811184.0,
            "replies": []
        },
        {
            "body": "A little louder for the people in the back. \n\n👏🏻👏🏻",
            "author": "seekingsweetsugar",
            "id": "efrwstp",
            "parent_id": "t3_an7q4t",
            "score": 4,
            "created_utc": 1549340147.0,
            "replies": []
        },
        {
            "body": "I’m so glad you wrote this. I’m an “old” SB, personally I’m here for the alone-time-with-men (or women) because life is busy and expensive and if all my income was from jobworkstuff I wouldn’t have time to get laid. However, I have made friends with several of the younger girls and help them navigate the world of men 2-3x their age/size. A little bit of fear is healthy, meeting a new SD or becoming intimate should be something a girl does with full awareness and antennaes up. Some of them are legitimately terrified, though, and that’s not fair to anyone.  I’m glad to see SD’s here taking your words to heart. ",
            "author": "w-r",
            "id": "eftc7d7",
            "parent_id": "t3_an7q4t",
            "score": 2,
            "created_utc": 1549393781.0,
            "replies": []
        },
        {
            "body": "Sorry WTF. Naive seriously. I have to disagree. \n\nWhen I was a naive 20’yo, I worked 3 jobs and did an unpaid internship during the week. Then I used to work as a server at wedding parties on Sundays. All this carrying a high GPA with a full course load. Yup 4 hours of sleep on most nights thanks to the crazy homework assignments!!!!!!\n\nI remember piling on with 4 roommates and eating tons of ramen. I NEVER got in debt. Not then and not now. Why!!!!! I lived well within my means. \n\nYOLO, You are young only once etc so go fuck make crap stinky choices, buy stuff, keep up with the joneses, spend endless hours on social media, sign up for the towns most expensive gym even if one cant make the rent !!!!!!!!!!!!!!!!!!’ Ask any SB, she is perpetually young and naive, even the 36 yo (who in reality is 43)!!! Bull crap. By 25, many of us had professional jobs. By 27, many of us were home owners!!!!\n\nSeriously WTF!!!\n\nWe are not evil devils. We just walked the right path, made a lot of sacrifices and still do. We respect women even if they are SBs. I don’t side with the creep SDs but as SDs we deal with shady women all the time. Still there is no excuse to mistreat a woman or do things without her consent. That said, there is no way there won’t be creeps in the bowl. Question is can you filter or even better just stay the fuck away from the “older than your dad” guys. Many women deliberately pick older and uglier guys because they can wield “looks power” over them. Well it comes with a double edged sword!!!\n\nYou are no naive !! No woman who walks into sugaring is naive!!!",
            "author": null,
            "id": "efro6hd",
            "parent_id": "t3_an7q4t",
            "score": 0,
            "created_utc": 1549332846.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efrxgmy",
                    "parent_id": "t1_efro6hd",
                    "score": 20,
                    "created_utc": 1549340755.0,
                    "replies": [
                        {
                            "body": "Indeed. The older than your dad is something I picked up in the original post that the SB says she has to deal with. I did not see a point for her to mention that. Yes the bowl is about older guys and if you meet the right one, he will treat you better than any of the younger ones. Fact is there was no need for her to mention that guys are older etc. Hence I picked it up and responded to it. I was no shaming but I felt she was shaming!",
                            "author": null,
                            "id": "efsff7g",
                            "parent_id": "t1_efrxgmy",
                            "score": -5,
                            "created_utc": 1549366666.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Sorry WTF. Naive seriously. I have to disagree. \n\n>When I was a naive 20’yo, I worked 3 jobs and did an unpaid internship during the week. Then I used to work as a server at wedding parties on Sundays. All this carrying a high GPA with a full course load. Yup 4 hours of sleep on most nights thanks to the crazy homework assignments!!!!!!\n\n>I remember piling on with 4 roommates and eating tons of ramen. I NEVER got in debt. Not then and not now. Why!!!!! I lived well within my means. \n\n>YOLO, You are young only once etc so go fuck make crap stinky choices, buy stuff, keep up with the joneses, spend endless hours on social media, sign up for the towns most expensive gym even if one cant make the rent !!!!!!!!!!!!!!!!!!’ Ask any SB, she is perpetually young and naive, even the 36 yo (who in reality is 43)!!! Bull crap. By 25, many of us had professional jobs. By 27, many of us were home owners!!!!\n\n>Seriously WTF!!!\n\n>We are not evil devils. We just walked the right path, made a lot of sacrifices and still do. We respect women even if they are SBs. I don’t side with the creep SDs but as SDs we deal with shady women all the time. Still there is no excuse to mistreat a woman or do things without her consent. That said, there is no way there won’t be creeps in the bowl. Question is can you filter or even better just stay the fuck away from the “older than your dad” guys. Many women deliberately pick older and uglier guys because they can wield “looks power” over them. Well it comes with a double edged sword!!!\n\n>You are no naive !! No woman who walks into sugaring is naive!!!\n\n\nWhy are you so angry (that's how this seems)?  Her post doesn't mean every guy is bad, but some are, and bad things happen, and we worry about that.  And try not to project that concern. \n\nP.s.  I owned my first house well before sugaring at 24, after graduating college with a high GPA in a male dominated STEM major.   Not all SBs are the same either.  I didn't become an SB until mid 30s (and no, I'm still not 43, I use my real age)",
                    "author": "CentralUSGal",
                    "id": "efrqeq0",
                    "parent_id": "t1_efro6hd",
                    "score": 21,
                    "created_utc": 1549334654.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "efrupmf",
                            "parent_id": "t1_efrqeq0",
                            "score": 2,
                            "created_utc": 1549338267.0,
                            "replies": [
                                {
                                    "body": "Fortunately every move I've made comes with a full relo package, so it makes it an easier decision.   I've also mostly lived in Midwest, so makes a difference I'm sure.",
                                    "author": "CentralUSGal",
                                    "id": "efrv8ao",
                                    "parent_id": "t1_efrupmf",
                                    "score": 4,
                                    "created_utc": 1549338720.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I like your story of being a homeowner at a young age. Well done.\n\nMy point to the OP is the bowl does not always invite good intentions from both sides. We all walk into it with our eyes wide open. Not every SD is a bad guy or a creep. Not every SD is a predator. No SB is naive nor is any SD. \n",
                            "author": null,
                            "id": "efsengy",
                            "parent_id": "t1_efrqeq0",
                            "score": -2,
                            "created_utc": 1549365452.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "YOLO ! I die 🤣. This would be great on Rant Friday! \n\nJoke aside, I agree with you 100%. My reply was a tad more balanced, but the point I made is similar to the one you're making. \n\nCongrats on making it through your youth somewhat unscathed... or in one piece! ",
                    "author": "KishiKawaii",
                    "id": "efrqcnc",
                    "parent_id": "t1_efro6hd",
                    "score": 0,
                    "created_utc": 1549334608.0,
                    "replies": [
                        {
                            "body": "It was not an easy journey. Frankly in my 40s, I have no desire to go back and live my 20s. I walked thru fire but it helped build an amazing foundation for my life. I don’t think many young people especially in the bowl realize that it takes sacrifice and hard work to get further in life. It’s a bit too much about “I am young, I am broke and so I am entitled”! ",
                            "author": null,
                            "id": "efsfj8r",
                            "parent_id": "t1_efrqcnc",
                            "score": 0,
                            "created_utc": 1549366833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow... I try to keep that in mind, but the way you said it makes it more.. tangible and human. You are right. Below the make-up and nice dresses there is a Person who has feelings and expectations that deserves to be treated with consideration and respect! I agree 100%!",
            "author": null,
            "id": "ei783hr",
            "parent_id": "t3_an7q4t",
            "score": 1,
            "created_utc": 1552215422.0,
            "replies": []
        },
        {
            "body": "Reading below from SD's who just basically just gave away money for charity to girls who cry, I think there is just about the right amount of compassion...\n\nYou are right that almost every non-grotesque woman who walks into a room is desired by men, so there is the downfalls  and challenges of that.\n\nBut look on the upside.  I've never met or seen even 1 homeless attractive/average looking woman.  Why? Because even a average woman always knows at least 1 man they can call and stay with indefinitely \"in trade\". If you are a man in this world, and if you do not have a family/real friends to lean on, you are completely on your own and you will be sleeping under a bridge with maybe some free WiFi. :-) :-)  This is my reality.\n\nIf i need to make some \"gig\" money from a 2nd job, I can turn on a food delivery app and maybe make $10-$20 an hour. Any woman over a \"5\" can sugar or escort and make in 1 hour what would take me 20.  Many camgirls can make $3000-$50,000 a month literally from sitting in front of a computer, from anywhere in the world, selling something that cost them nothing to obtain and can be resold over and over.\n\nThose women who cry about not having electricity, money or whatever could easily go get a retail job, or food delivery or any one of 1000 other \"normal\" jobs, put their head down and work hard.  Or they can choose to go the path of least resistance/highest pay in going towards sex-work.  At least they get that choice.   \n\nI read that article and she mentioned she had like 15 roommates.  Do you think the roommate guys living in those bunk beds have such an easy way to claw out? \n\nEvery time I apply for a government job and it asks if I am a Veteran, a woman or a minority and I have to check no 3 times and never get called back,  nobody is going to show me compassion.  I would argue its a woman's world in 2019.",
            "author": "capsfan80",
            "id": "efssb7t",
            "parent_id": "t3_an7q4t",
            "score": -2,
            "created_utc": 1549379719.0,
            "replies": [
                {
                    "body": "Since I come up in your comment,  I will reply where I would usually hold my tongue.  \n\nWhen you turn on that app to do deliveries,  are you afraid that next customer is going to lock you in their basement and rape you? No? Every woman doing that same gig fears exactly that.\n\nWhen you get a job,  are you wondering how long it will be until your boss grabs your ass or makes some inappropriate request with a veiled implication that your response will impact your future there? Every woman does.\n\nWhen you walk down the street,  do strangers approach you,  demanding your number and make you wonder if your safety is at risk if you reject them?  Every woman does. \n\nYou overlook the glorious luxury of feeling safe most of the time in almost everything you do. Every woman has a plan for when shit goes bad, because every woman at least knows someone that has seen shit go bad.\n\nConsider what you are actually complaining about before you complain that I paid some poor girl's electric bill. You sob at my feet,  naked,  with my dick still wet with your saliva,  about losing your infant child and I may pay your electric bill as well. ",
                    "author": "SDvegas",
                    "id": "efthcua",
                    "parent_id": "t1_efssb7t",
                    "score": 12,
                    "created_utc": 1549397376.0,
                    "replies": [
                        {
                            "body": "Well said. Empathy level on 100! ",
                            "author": "blonde-throwaway",
                            "id": "efuzbvk",
                            "parent_id": "t1_efthcua",
                            "score": 2,
                            "created_utc": 1549445847.0,
                            "replies": []
                        },
                        {
                            "body": "Eh,  you have what i describe as white knight mentality.  You see that quite a bit on webcam sites where men try to \"save\" every girl. Honestly a quick way to go broke.\nWhen i do deliveries.  There is a risk of being robbed, killed or anything else, especially in a bad neighborhood. I have a concealed gun permit. I don't think being male is going to make the money in my wallet less attractive to a robber.\n\nI would argue based on my 20+ years of corporate that women have 100% power. If any woman at my workplace walked into an HR office and even said i made them feel uncomfortable for any reason, I would be fired without proof or any real reason, because its cheaper to find a replacement for me than a possible lawsuit.  It has actually happened to me already and cost me many thousands of dollars frivolously. I only talk about business with women in business and keep a distance, making no friends. Workplaces gave gotten fairly hostile towards men and I don't bother making women friends under 50 in the workplace anymore. Insecure 20 somethings are a disaster. If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not.  \n\nNot every woman gets asked for her number or catcalled. I think most obese women would be the first to tell you that they are virtual ghosts... But you aren't trying to \"save\" those girls, are you?\nYou act like every woman is a potential victim waiting to happen. I just understand that there is an acceptance of risk just even walking out the front door each day. Most people do.\nIt is fine to be charitable. I buy my broke neighbor groceries all the time asking nothing in return. But that is what it is.. Charity.  Charity and compassion only go so far.  If she really has no money, she qualifies for SNAP, WIC, and a number of other programs, plus she should be collecting child support from her baby daddy, since she decided to have kids prior to an education or a real income. \n\nBut my points about her enhanced earning ability still remain.  She is not a victim. She put herself exactly in the circumstances she chose, based on her own decisions.\n",
                            "author": "capsfan80",
                            "id": "eftk4ue",
                            "parent_id": "t1_efthcua",
                            "score": 1,
                            "created_utc": 1549399250.0,
                            "replies": [
                                {
                                    "body": "You are a victim of your own thinking. ",
                                    "author": "SDvegas",
                                    "id": "eftlju2",
                                    "parent_id": "t1_eftk4ue",
                                    "score": 7,
                                    "created_utc": 1549400362.0,
                                    "replies": [
                                        {
                                            "body": "No, I'm just a victim of having to read that lame response.  Please go save another 19 year old.  She is a girl... she needs you.  :-) :-)",
                                            "author": "capsfan80",
                                            "id": "eftmcsw",
                                            "parent_id": "t1_eftlju2",
                                            "score": 0,
                                            "created_utc": 1549400934.0,
                                            "replies": [
                                                {
                                                    "body": "Lame response?  I read your verbose,  but delusional,  reply. If you want a more voluminous response,  you will need to include something with some objective validity. I am not about to validate your delusions. \n\nOf note however,  is your failure to address the help I offered.",
                                                    "author": "SDvegas",
                                                    "id": "efu2awp",
                                                    "parent_id": "t1_eftmcsw",
                                                    "score": 5,
                                                    "created_utc": 1549412908.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not. \n\nThis stuff angers me, I will try to be non-emotional in my response.  I want to preface this with I was not a sugar baby until very recently, nor did I sleep with anyone even remotely related to work ever.  So please remove that lens from your judgement.\n\nI worked my ass off to get where I am.  I made conscious decisions to not be note taker in meetings, make coffee (I don't drink it), bring homemade treats, or look overtly feminine so I would be treated equally, and not as a \"girl\".  You have any idea what it's like to be accused of sleeping your way there, or it being insinuated you got where you were because of your gender or race?\n\nI'm not naive, it makes it easier to get an interview, I'm sure.  I would argue though, that no high level manager in their right mind would hire someone at my level who wasn't the best for the job.\n\nAnd as I hiring manager, I have NEVER considered anything other than if the person was best for the job.  I remember hiring an older gentleman one time and later someone saying, why did you hire someone so close to retirement?  It hadn't even occurred to me, he was the best qualified.\n\nMost of the men who I know that complain are either not as smart, skilled, or have a personality issue that prevents them from being more successful.  Not because they are a man. \n\nI'm going to leave all your other points alone for now.",
                                    "author": "CentralUSGal",
                                    "id": "eftn0xp",
                                    "parent_id": "t1_eftk4ue",
                                    "score": 5,
                                    "created_utc": 1549401401.0,
                                    "replies": [
                                        {
                                            "body": "When it comes to work, I'm speaking mostly from a technical/IT lens. Not sure what industry you work in. I cannot speak to your hiring practices and I commend you on hiring based on talent. I'm sure you do work hard, but it does not mean that HR didn't get to check off a box in interviewing you and they are still reporting all of those statistics annually, patting themselves on the back for being so inclusive regardless of merit.\nNot sure what field you work in that required you to dress so neutral. Men appreciate a well dressed woman, I would argue your biggest enemies on that will be other women. :-)\nAs for the insinuations, I can only tell you that in many IT jobs, they do not even interview you (see government) unless you are a woman or minority unless you have a special skill that they cannot find anywhere else. Don't believe me? Go apply for any IT job on USAjobs that pays under 150K. Some hiring managers say \"hire the next woman that walks thru the door\", that is not your fault or say anything to the merits of how qualified you are, it just is the way it is with the world today.\n\nHow do you define success? Lots of money? A gratefulness to wake up each day and breathe fresh air? A job you enjoy and a roof overhead?\n\nI am not complaining, I am just telling you the way it is. There is a difference. Your statement about men \"not being as smart, skilled or having a personality issue\" for pointing out the differences is just garbage. If it makes you feel better, you should keep believing it... I had a work permit the day i turned 14, worked at an internet provider 2 years later and worked at a firm in DC at age 18 when everyone else started off college. I went to college at night and paid cash.  I earned everything I have in this life, there was no shortcuts. So I know you most certainly couldn't be talking about me. :-) :-)\n",
                                            "author": "capsfan80",
                                            "id": "eftpwog",
                                            "parent_id": "t1_eftn0xp",
                                            "score": 1,
                                            "created_utc": 1549403404.0,
                                            "replies": [
                                                {
                                                    "body": "I didn't make that statement because they pointed out the issues, I said that of \"most of the men I know who complain\".  I didn't say you, I will emphasize the statement was about men I personally know who have complained to me.\n\nHard work does not equal smart or skilled.  And by personality issues, I mean they literally have faults that prevent them from getting the next promotion.  This isn't really what I'm talking about, but to be honest and frank, I wouldn't want a manager who has a chip on his shoulder about women having it so \"easy\" or whatever word/phrase fits. \n\nIf you are open to hearing some of the things I have dealt with that more women than men deal with by far (always exceptions), I'd be happy to share to help perhaps provide a different perspective.  The things that are perceived by some white men as so unfair came about because of the disparity in how women or minorities have often been treated.  Often unintentionally.  So many don't even realize they are doing it.\n\nAgain, some and often - not all or always.\n\nI have worked with many amazing men, have had friendships with many more.  Until sugaring recently, I'll be honest that I was naive about how many probably wanted to sleep with me.  But I never realized it because they treated me like a human and not a sex object.  And in the end, isn't that what we all want, to be treated fairly?  Or at least not treated differently because of something we have no control over.    \n\nSometimes people use policies and programs inappropriately, but that doesn't mean the intent behind them was malicious.  It was to help one portion of people, not to harm anyone, despite what some seem to believe.  And to be very clear, the vast majority of the men I've worked with and the experiences I've had are good and positive.  The exceptions are unfortunate, and suck, and hopefully over time the frequency with which those things happen will continue to reduce.  The things that frustrate you so much have been implemented with that intention.",
                                                    "author": "CentralUSGal",
                                                    "id": "eftuxmp",
                                                    "parent_id": "t1_eftpwog",
                                                    "score": 5,
                                                    "created_utc": 1549407083.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You do know that male escorts/ SB's exist right? Albeit with a mostly male clientele. So men are also free to leverage sex with people they would otherwise not be sleeping with. Something you may want to consider? All the best. ",
                    "author": "blonde-throwaway",
                    "id": "efsxlew",
                    "parent_id": "t1_efssb7t",
                    "score": 5,
                    "created_utc": 1549383556.0,
                    "replies": [
                        {
                            "body": "Yes, but it is not really an apples to apples comparison.  You aren't sugaring or escorting with women as a straight woman or being asked to, your default client falls in line with your sexual orientation.  Sure I'm sure there are lesbians offering services to men,  but they are the exception.\n\n&#x200B;",
                            "author": "capsfan80",
                            "id": "eft7vcf",
                            "parent_id": "t1_efsxlew",
                            "score": 1,
                            "created_utc": 1549390779.0,
                            "replies": [
                                {
                                    "body": "Sexuality is not relevant. You are still free to leverage sex with people you otherwise not be sleeping with, as sex workers do. Whether they align with their sexuality or not does not make them partners they would sleep without with money being involved.\n\nMy point is that you have options yet are purporting that you have none.",
                                    "author": "blonde-throwaway",
                                    "id": "eft7y94",
                                    "parent_id": "t1_eft7vcf",
                                    "score": 3,
                                    "created_utc": 1549390834.0,
                                    "replies": [
                                        {
                                            "body": "Of course sexuality and gender are relevant and clearly this isn't getting thru to you...Probably 98% of sugar is straight women serving straight men because that is the demand. You aren't asking women to go gay.\n\nMy argument and statements above still hold.  Let me know if you have an actual viable alternative.   I don't think I'll be seeing any attractive or even average looking homeless women on the streets of DC today.  \n\nMy point has been made.\n\n&#x200B;\n\n&#x200B;",
                                            "author": "capsfan80",
                                            "id": "eft9s6d",
                                            "parent_id": "t1_eft7y94",
                                            "score": 3,
                                            "created_utc": 1549392100.0,
                                            "replies": [
                                                {
                                                    "body": "You have options, if you don't want to pursue those options then that is *your* choice. All the best anyway. ",
                                                    "author": "blonde-throwaway",
                                                    "id": "eft9xr4",
                                                    "parent_id": "t1_eft9s6d",
                                                    "score": 3,
                                                    "created_utc": 1549392205.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This is an irrelevant comment. The market for male escorts / SB’s is tiny. Few people pay for dick, whether they are straight women or gay men. So your comment was nothing more than a red herring argument that added nothing to the conversation.",
                            "author": "sd_90210",
                            "id": "eftg2f7",
                            "parent_id": "t1_efsxlew",
                            "score": 0,
                            "created_utc": 1549396487.0,
                            "replies": [
                                {
                                    "body": "His comment was also irrelevant. Like attracts like.",
                                    "author": "blonde-throwaway",
                                    "id": "eftx3z2",
                                    "parent_id": "t1_eftg2f7",
                                    "score": 2,
                                    "created_utc": 1549408787.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "100% truth bro\n\n&#x200B;\n\nDont worry about the downvotes considering the SB ratio is 10:1 on this reddit. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
                    "author": "alphadawg26",
                    "id": "efy8le1",
                    "parent_id": "t1_efssb7t",
                    "score": 1,
                    "created_utc": 1549555557.0,
                    "replies": []
                },
                {
                    "body": "You make excellent points about the lack of options for young men. However, as shown by the commenter below, your points will fall on deaf ears. Young men will get zero sympathy and will just be told to “man up.”  The gender equality movement only cares about one gender. ",
                    "author": "sd_90210",
                    "id": "eftgdav",
                    "parent_id": "t1_efssb7t",
                    "score": 0,
                    "created_utc": 1549396698.0,
                    "replies": [
                        {
                            "body": "\"The gender equality movement only cares about one gender\"   \n\nTHIS.  So much this.",
                            "author": "capsfan80",
                            "id": "eftkid2",
                            "parent_id": "t1_eftgdav",
                            "score": 0,
                            "created_utc": 1549399550.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What thread was that? I believe almost everyone should be given some level of respect unless they lose it, and everyone should be given the benefit of the doubt. This sub can definitely be snarky and rude to certain opinions, and I try to defend the person when I see it. ",
            "author": "sexviewer",
            "id": "efrcng1",
            "parent_id": "t3_an7q4t",
            "score": 1,
            "created_utc": 1549323296.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efre0ww",
            "parent_id": "t3_an7q4t",
            "score": 1,
            "created_utc": 1549324403.0,
            "replies": [
                {
                    "body": "Comment on article post I believe",
                    "author": "CentralUSGal",
                    "id": "efre89t",
                    "parent_id": "t1_efre0ww",
                    "score": 3,
                    "created_utc": 1549324568.0,
                    "replies": []
                },
                {
                    "body": "I don't think there is any thread. The article suggested has no comments like she describes in her post (and the article was shared by someone else. She has ignored any questions regarding the post). I think it was all made up.",
                    "author": "sexviewer",
                    "id": "eftplvo",
                    "parent_id": "t1_efre0ww",
                    "score": 1,
                    "created_utc": 1549403196.0,
                    "replies": []
                },
                {
                    "body": ">https://www.reddit.com/r/sugarlifestyleforum/comments/an17lw/the\\_intern\\_who\\_doesnt\\_have\\_time\\_for\\_real\\_dates/\n\n&#x200B;\n\nShe responded to me with this link.  ",
                    "author": null,
                    "id": "efrpwdm",
                    "parent_id": "t1_efre0ww",
                    "score": 1,
                    "created_utc": 1549334248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efrf592",
            "parent_id": "t3_an7q4t",
            "score": 1,
            "created_utc": 1549325322.0,
            "replies": [
                {
                    "body": "Curious which part you are most bothered by?",
                    "author": "CentralUSGal",
                    "id": "efrfidg",
                    "parent_id": "t1_efrf592",
                    "score": 8,
                    "created_utc": 1549325625.0,
                    "replies": [
                        {
                            "body": "Right to the gut!",
                            "author": "FromageQueso",
                            "id": "efrtyk5",
                            "parent_id": "t1_efrfidg",
                            "score": 2,
                            "created_utc": 1549337620.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hope I meet someone like you! Your post is wonderful reading. Thank you.",
            "author": "Haffbad",
            "id": "eft85g5",
            "parent_id": "t3_an7q4t",
            "score": 1,
            "created_utc": 1549390973.0,
            "replies": []
        },
        {
            "body": "I can’t fathom how scary it is to jump into the bowl for the first time.   I am sure there is a learning curve and that is why I don’t deal with newbies.  They can learn the ropes on someone else’s dime.  \n\nI also can’t fathom being able to go on a few dates and receiving several thousand dollars a month.  It’s hard to ask for patience and grace when you have priced yourself at the elite level.  It’s kind of like a highly paid professional athlete being shocked when the team that drafted him has high expectations.  Girls don’t want to slowly work their way into the money part but they want to ease into the physical aspect.  And I’m not taking about sleeping together on the first meeting,  but if you take a guys money you should be prepared for the relationship to be mutually beneficial fairly quickly.  ",
            "author": "LotBuilder",
            "id": "efrywjg",
            "parent_id": "t3_an7q4t",
            "score": -3,
            "created_utc": 1549342160.0,
            "replies": [
                {
                    "body": "\n\n>Girls don’t want to slowly work their way into the money part but they want to ease into the physical aspect. And I’m not taking about sleeping together on the first meeting, but if you take a guys money you should be prepared for the relationship to be mutually beneficial fairly quickly. \n\nOP used the term \"some\" guys (or some men I forget), but the point is, have compassion and understanding for the shit we don't sign up for.  I don't expect money until beginning an arrangement. But if we meet on SA and talked about an arrangment and I follow through on my end, I expect the man to follow through.  Have compassion that while you may be scammed out of some money, we are also scammed out of money (the promise of) but also feel very violated.  Even if it hasn't happened to you it weighs on you as a potential nearly every time.\n\nI would appreciate especially on a thread like this that you don't generalize a few bad experiences to everyone.  Some girls suck.  Some men suck.  We aren't all evil.",
                    "author": "CentralUSGal",
                    "id": "efs1b4p",
                    "parent_id": "t1_efrywjg",
                    "score": 15,
                    "created_utc": 1549344677.0,
                    "replies": [
                        {
                            "body": "For sure.  Over the years I have learned that things are a lot easier and more enjoyable for everyone if the financial agreements have been met prior to the date.   That might mean sending a Venmo or cash app when she’s arriving but it needs to be done so she can relax about that part. ",
                            "author": "LotBuilder",
                            "id": "efs1m7n",
                            "parent_id": "t1_efs1b4p",
                            "score": 2,
                            "created_utc": 1549345022.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let me suggest that you look for something else.  There is much more opportunity out there than having sex that you find disgusting for money.  You need to find something in life that you enjoy.  ",
            "author": "HappyBear1952",
            "id": "efs5s97",
            "parent_id": "t3_an7q4t",
            "score": -3,
            "created_utc": 1549350294.0,
            "replies": [
                {
                    "body": "Thank you, dad. I appreciate the advice. And I’m doing fine.",
                    "author": "ThatKGirl",
                    "id": "efsqkbq",
                    "parent_id": "t1_efs5s97",
                    "score": 0,
                    "created_utc": 1549378383.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "K Girl added to her post \n\n\"\"I just wanted us to be nice to each other. This is fun and exciting! Or, it’s supposed to be. ......... but the learning curve is steep.\"\"",
            "author": "pinotandsugar",
            "id": "efsrbb7",
            "parent_id": "t3_an7q4t",
            "score": 0,
            "created_utc": 1549378960.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efwjcod",
            "parent_id": "t3_an7q4t",
            "score": 0,
            "created_utc": 1549492845.0,
            "replies": [
                {
                    "body": "That first time though.  No matter how long the SR is, when it begins it was the first time.  And we don't know what will happen.  We do our best to screen, vet, meet in public before scheduling an intimate date, and yet we are putting ourselves at risk.  Sure, if the first time goes well, odds are so will future times.  But this is a risk and fear regardless, with each SR (whether it be one week or 10 years), there is a first time.    ",
                    "author": "CentralUSGal",
                    "id": "efytoq2",
                    "parent_id": "t1_efwjcod",
                    "score": 1,
                    "created_utc": 1549569521.0,
                    "replies": []
                },
                {
                    "body": "Lol. So you’re saying it’s the girl’s fault if a guy smacks her around? Uh huh...",
                    "author": "ThatKGirl",
                    "id": "efwo8aq",
                    "parent_id": "t1_efwjcod",
                    "score": 1,
                    "created_utc": 1549496498.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "efycap6",
                            "parent_id": "t1_efwo8aq",
                            "score": 1,
                            "created_utc": 1549558098.0,
                            "replies": [
                                {
                                    "body": ">WTF? How did you get that from what I wrote?\n\nUmmmm. Let's see... You said...\n\n&#x200B;\n\n>  If you are in a SR with someone who is effectively your boyfriend, who you know intimately, there is a lot less chance of \\[bad things that are done by men to women\\]\n\n&#x200B;\n\nYah, so, um, you're kinda saying \"it's her fault for acting like an escort\" which sounds a lot like saying \"look at how she was dressed, she asked for it!\" Right?\n\nYou also seem to be saying that a girl who wants to explore sugaring should only do it with guys who are already effectively her boyfriend? Wow! That's a great idea! I'm sure every girl who steps into the bowl has a boyfriend-quality guy in her back pocket just aching to help her out, right? Because if we did, would be be posting a profile?\n\n&#x200B;\n\n> Of course there is risk to both parties in any relationship but if you  are seeing one man regularly, you have built up trust and respect, then a  lot of what you are describing is no longer a worry. \n\n&#x200B;\n\nRisk to the guy=being laughed at? Catching something? Being outed to his wife? All bad, for sure! But...\n\nRisk to the girl: Rape, death, pregnancy, being laughed at, catching something, and being outed to the real world.\n\nHow is it that you think a new SB should get to the point where she is \"seeing one man regularly\" who \"is effectively her boyfriend\"? Ya have to start somewhere. And, trust me, if I tell a guy on SA I want to date him for a while so that we feel like boy/girlfriends, ask yourself, how many stick around? (Hint: almost none.) You men want to move quickly - and that's not bad, but let's just not get all high and mighty and say it's the girl's fault.\n\nIf a human doesn't wait for consent, or hurts without permission, or stealths, or forces himself on her, then that is his crime. FULL STOP. I don't give a crap what she did beforehand. She always has the right to say \"No. Stop.\"\n\n> It's when SBs see a lot of different men, with little screening, and  with little time between the M&G and the first date that the  experience is more like what you describe. \n\n&#x200B;\n\nOh my god! You're right. I had never thought of it this way. Totally, because the girl chose to a different guy yesterday that some guy today thinks he can smack her around? That makes her less worthy of protection? Compassion? Human rights? \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
                                    "author": "ThatKGirl",
                                    "id": "efyf1ux",
                                    "parent_id": "t1_efycap6",
                                    "score": 1,
                                    "created_utc": 1549559960.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efrfync",
            "parent_id": "t3_an7q4t",
            "score": -2,
            "created_utc": 1549326028.0,
            "replies": [
                {
                    "body": ">But still head to the big City WITHOUT a support network.....you are headed for failure\n\nI get what you're trying to get at, but this comment is very narrow minded. A lot of people don't have any support network at all. So what are they to do? Never attempt to do anything with their lives because there's a change of failure? ",
                    "author": "MASugarBaby",
                    "id": "efrinmg",
                    "parent_id": "t1_efrfync",
                    "score": 14,
                    "created_utc": 1549328307.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "efrix3a",
                            "parent_id": "t1_efrinmg",
                            "score": -2,
                            "created_utc": 1549328531.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "efrlmef",
                                    "parent_id": "t1_efrix3a",
                                    "score": 9,
                                    "created_utc": 1549330739.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">she started sobbing\n\nbeen there, the next week I helped her with a resume and to get a job. Her kid just needed to get a bed and some Christmas presents.  He had a nice Christmas and slept better. She was 29 :)",
            "author": "TooOldForSD",
            "id": "eft67kd",
            "parent_id": "t1_efs69zj",
            "score": 32,
            "created_utc": 1549389638.0,
            "replies": []
        },
        {
            "body": "Man... such a sad story... Feel genuinely for her... to be at the risk of losing her Baby :'( So sad... No one following this lifestyle should be because they have to (or feel like they have to).",
            "author": null,
            "id": "ei78a01",
            "parent_id": "t1_efs69zj",
            "score": 4,
            "created_utc": 1552215736.0,
            "replies": []
        },
        {
            "body": ">Even a not so naive, \"old\" SB deals with the same shit.\n\n\\+1\n\n&#x200B;",
            "author": "MASugarBaby",
            "id": "efrg9xe",
            "parent_id": "t1_efreiw0",
            "score": 24,
            "created_utc": 1549326305.0,
            "replies": []
        },
        {
            "body": "I think for a lot of SBs and SRs it can get to that place, but it takes a minute. \n\nI know personally I’m not necessarily fully comfortable with a guy until we’ve had a few dates. And that’s vanilla guys - that I’m conditioned to trust more than old men and who I readily swap real information with, and who are not in charge of the situation because they’re paying me.  In sugar there are an abundance of factors that point towards running away, but instead I’m expected to jump into bed the second time I lay eyes on the man. It’s like you’ve skipped ten steps. Eventually you make that ground up, but you still have to be past the finish line immediately. \n\nIt’s a choice we make for a variety of reasons. But it’s not an easy one. ",
            "author": "MASugarBaby",
            "id": "efrhtza",
            "parent_id": "t1_efrgoo1",
            "score": 43,
            "created_utc": 1549327611.0,
            "replies": []
        },
        {
            "body": "Just remember, if you're a good man, you're a good man.  Find the right woman for this and it's not scary or creepy or distorted or dysfunctional. On her side of the table, in the right circumstances, it's \"fun and games, a decent gentleman, good meals, sex and adventure for fundamentally a life changing amount of money.\"\n\nI'm proud of my SRs and I have put a lot of effort into the comfort and well-being of my partner.  I'm protective, considerate and thoughtful.  So don't let the broad brush make it appear that every time someone enters into this, it's some scary sex-trafficking type of situation.  Some women are excited, eager and enthusiastic about these relationships and the opportunities they provide.\n\nIf you're good to your girl, the last paragraph of the OP and the Edit are where you should focus.  If you're not one of the \"some guys,\" then there's no reason to feel like shit.",
            "author": null,
            "id": "efsq396",
            "parent_id": "t1_efrgoo1",
            "score": 4,
            "created_utc": 1549378016.0,
            "replies": []
        },
        {
            "body": "At the risk of 10^6 downvotes ...... in today's world most young women who are participating in arrangements have walked into a room intending to have sex with a man (or boy) whom she met that evening at a party, bar, social event, internet hookup or other. Where sugaring gets damaging is where there is manipulation, desperation, deceit or threats. Yes it has become much more of a jungle with the rise of an army of scam artists using SA as a source of victims where they had no intent other than to leverage false promises into sexual fraud.",
            "author": "pinotandsugar",
            "id": "efs69ig",
            "parent_id": "t1_efrnhgv",
            "score": 4,
            "created_utc": 1549350994.0,
            "replies": [
                {
                    "body": "You really don't get the whole consent concept, do you? ",
                    "author": "earthlingfemale",
                    "id": "efsbmme",
                    "parent_id": "t1_efs69ig",
                    "score": 20,
                    "created_utc": 1549360074.0,
                    "replies": [
                        {
                            "body": "Not sure where that came from......... I absolutely believe in and practice that not only is consent a foundational requirement but that it is also a revokable and subject to such limits as the SB wishes to impose.  without question or negotiation...  It's something that's important in itself but also leads to long term relationships both as sugar partners and often later as friends as they move to a different phase of their lives. I'm sorry if it was interpreted it differently . ",
                            "author": "pinotandsugar",
                            "id": "efsqu9m",
                            "parent_id": "t1_efsbmme",
                            "score": 5,
                            "created_utc": 1549378594.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You're right and why worry about down votes? It's a forum to voice yourself. That said the need increases, age difference (in most cases) as well as nervousness. Do you want to be used by a particular kind of guy...?? There's a bit of Difference between middle aged banker/lawyer/business man and college guy I've got a crush on. Just for perspective as both serve different purposes 😊",
                    "author": "absthaw",
                    "id": "efskfo7",
                    "parent_id": "t1_efs69ig",
                    "score": 7,
                    "created_utc": 1549372890.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Including those who hookup on tinder!!",
            "author": null,
            "id": "efu3rjm",
            "parent_id": "t1_efrnhgv",
            "score": 2,
            "created_utc": 1549414090.0,
            "replies": []
        },
        {
            "body": "True but dramatic.  Participation is voluntary.  Girls don’t just find themselves in that situation,  they sign up for it and follow through with 1-2 meetings.    I always do a no contact meet and greet because I never want a girl to feel rushed or uncomfortable.  If we don’t click at the M&G then it’s not really a big investment or loss on either side.   Pushing for intimacy on the first date is a huge red flag on both sides.  Pushiness on his and desperation on hers.  ",
            "author": "LotBuilder",
            "id": "efrzlcx",
            "parent_id": "t1_efrnhgv",
            "score": -3,
            "created_utc": 1549342856.0,
            "replies": [
                {
                    "body": "You’re wrong to assume that even after 1-2 platonic dates a SD won’t become aggressive suddenly. I’ve seen it firsthand. Sometimes they change the second the door is locked and you’re alone. \nWomen have a very different experience. If he decides to be violent or not listen to your limits, how can a woman fight off a man 2-3 times her size? It’s almost impossible. ",
                    "author": "babe__ruthless",
                    "id": "efs5mlx",
                    "parent_id": "t1_efrzlcx",
                    "score": 30,
                    "created_utc": 1549350072.0,
                    "replies": [
                        {
                            "body": "It's how the bowl plays. A girl has to educate herself before stepping in. That's just the truth. \n\nSome women aren't into sex yet they step in the bowl with Daddies twice or triple their age and sometimes so ugly inside out that they shiver at his touch. Yet, that's not the point. Those ladies are in for the goodies but forget the \"rules\" and when comes the time to speak up, they clam up and shove his dick wherever, thinking it'll be easy. It's not for the faint of heart.  It's not easy and it can produce very bad long term traumatisms.\n\nThe bowl is not a game. Even for a woman who think she knows how to do it, she can realize very quick that it won't work but \"MONEY\"! That's the problem.  If you're not desperate, you can quit as per your judgment. If not, the relationship will most certainly get worse.\n\nBut that's been said over and over. \n\nI still understand the OP's plea and wish her well.",
                            "author": "KishiKawaii",
                            "id": "efsiimn",
                            "parent_id": "t1_efs5mlx",
                            "score": 0,
                            "created_utc": 1549370773.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As a man how can you say it doesn’t apply to women? How do you know what truly goes on in their lives? ",
                    "author": "danger0usw0man",
                    "id": "efs5xav",
                    "parent_id": "t1_efrzlcx",
                    "score": 17,
                    "created_utc": 1549350499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "yourgirlfriday99",
            "id": "efsadii",
            "parent_id": "t1_efrxjr1",
            "score": 5,
            "created_utc": 1549357743.0,
            "replies": []
        },
        {
            "body": "How does this map to hooking up with a guy on tinder and ending up at his house? ",
            "author": null,
            "id": "efu3q0k",
            "parent_id": "t1_efribuo",
            "score": 1,
            "created_utc": 1549414055.0,
            "replies": []
        },
        {
            "body": "So all old men are overweight, bald, alcoholic, cigar-smoking geezers who are also dangerous predators.... give me a break ",
            "author": "Sparkledork1",
            "id": "eftcjgf",
            "parent_id": "t1_efsourg",
            "score": 2,
            "created_utc": 1549394012.0,
            "replies": [
                {
                    "body": "except for me of course! ",
                    "author": "GSSD",
                    "id": "eftd3in",
                    "parent_id": "t1_eftcjgf",
                    "score": 4,
                    "created_utc": 1549394398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Never Sugar Out of Despair ! EVER ! \n\nI think it's been established that while this is great advice theoretically, it's just way too idealistic and to be honest, a bit rich coming from someone who *isn't* in despair. I'm not personally but I can empathize with how tough this world can be when you're young and in a tricky situation in need of a helping hand. \n\nThat's why the above advice will always be ignored and that's why instead of sanctimoniously telling them to stay out of the bowl (which they won't), we should focus on empowering them to remember and giving them tools to enforce their boundaries despite their desperation. ",
            "author": "yourgirlfriday99",
            "id": "efsal8e",
            "parent_id": "t1_efrkp9w",
            "score": 19,
            "created_utc": 1549358132.0,
            "replies": [
                {
                    "body": "Indeed, \n\nI also mentioned the importance of empowering oneself in my very long post. It would take another post to explain how to do that though. You are welcome to provide those tools anytime.\n\nI've been there too and got fairly out of the rabbit hole. I still think that desparation is not the key to Sugaring. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\nToday, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to.  I didn't always think that way and learned my lesson. Some are lucky and never get to learn, and I'm truly happy for them. Again, life is not fair.\n\nEither I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.",
                    "author": "KishiKawaii",
                    "id": "efshwog",
                    "parent_id": "t1_efsal8e",
                    "score": 2,
                    "created_utc": 1549370054.0,
                    "replies": [
                        {
                            "body": "Of course desperation is not the key to Sugaring. I just think we need to recognize the complete and utter futility of a statement like 'Never ever sugar out of desperation!'\n\n>I've been there too and got fairly out of the rabbit hole. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\n>Today, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to. I didn't always think that way and learned my lesson. \n\n>Either I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.\n\nSo with respect, it's not really about *you*... Your experiences are not necessarily the experiences of others and especially those your comment seems to be directed at; if your advice is coming directly from your own perspective, the scope of its benefit is limited. Much of your original comment contains helpful advice! But your oversimplified world view (and as an older SB, I'm assuming?) is shown in idealistic statements like 'If every SB would join the bowl with a clear mindset, goals already established and a good opinion of herself, the struggles would definitely lessen.' That would be great but it is simply not the world we live in, particularly in a bowl that attracts young and naive teenagers, people with little self worth and people in precarious financial situations - whether we like it or not. ",
                            "author": "yourgirlfriday99",
                            "id": "efsl9ai",
                            "parent_id": "t1_efshwog",
                            "score": 6,
                            "created_utc": 1549373738.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efsjws5",
                    "parent_id": "t1_efsal8e",
                    "score": 0,
                    "created_utc": 1549372329.0,
                    "replies": [
                        {
                            "body": "I know it's true. It's really not ideal - but unfortunately lots of people in this world aren't living in ideal situations. \n\n>Maybe this should be rewritten to... \"you should not sugar out of despair.  And if you have to - you should understand why you shouldn't, so you can try to avoid the same mistakes\".\n\nAnd this is my point exactly. Does anyone really think someone in a desperate situation and entering the bowl is going to read the statement 'you should not sugar out of despair' and think 'Oh gee, I guess that's true. Now I'm going to stay out of the bowl until I'm financially stable!'. Of course not. It's like telling a drug addict 'Don't do drugs' vs 'Don't do drugs but if you must, here's how to use needles safely etc'. (Bad analogy but I'm in class and multitasking lol)\n\nWith your revision above, yes they're going to skip straight past the first sentence but maybe actually gain something useful by understanding *why* they will be vulnerable and how they can take steps to minimize it.",
                            "author": "yourgirlfriday99",
                            "id": "efsl0ic",
                            "parent_id": "t1_efsjws5",
                            "score": 6,
                            "created_utc": 1549373489.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks Kish you said what none of SDs would be allowed to say here risk of the down vote cascade.\n\nYou have to say it long....because so many will take just one thing out of context because you didn't make it long.\n\nA++ and a million upvotes",
            "author": "Momopllc",
            "id": "efrojt1",
            "parent_id": "t1_efrkp9w",
            "score": 5,
            "created_utc": 1549333146.0,
            "replies": []
        },
        {
            "body": "*perils",
            "author": "Cookie_Duchess",
            "id": "efsned6",
            "parent_id": "t1_efsmhih",
            "score": 1,
            "created_utc": 1549375791.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efre600",
            "parent_id": "t1_efrcxfn",
            "score": 7,
            "created_utc": 1549324517.0,
            "replies": [
                {
                    "body": "If that's it, then it changes things dramatically. There is a big difference between saying things like that to someone and talking about someone when they just wrote an autobiographical article.",
                    "author": "sexviewer",
                    "id": "efrf7f7",
                    "parent_id": "t1_efre600",
                    "score": 4,
                    "created_utc": 1549325373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efrxgmy",
            "parent_id": "t1_efro6hd",
            "score": 20,
            "created_utc": 1549340755.0,
            "replies": [
                {
                    "body": "Indeed. The older than your dad is something I picked up in the original post that the SB says she has to deal with. I did not see a point for her to mention that. Yes the bowl is about older guys and if you meet the right one, he will treat you better than any of the younger ones. Fact is there was no need for her to mention that guys are older etc. Hence I picked it up and responded to it. I was no shaming but I felt she was shaming!",
                    "author": null,
                    "id": "efsff7g",
                    "parent_id": "t1_efrxgmy",
                    "score": -5,
                    "created_utc": 1549366666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Sorry WTF. Naive seriously. I have to disagree. \n\n>When I was a naive 20’yo, I worked 3 jobs and did an unpaid internship during the week. Then I used to work as a server at wedding parties on Sundays. All this carrying a high GPA with a full course load. Yup 4 hours of sleep on most nights thanks to the crazy homework assignments!!!!!!\n\n>I remember piling on with 4 roommates and eating tons of ramen. I NEVER got in debt. Not then and not now. Why!!!!! I lived well within my means. \n\n>YOLO, You are young only once etc so go fuck make crap stinky choices, buy stuff, keep up with the joneses, spend endless hours on social media, sign up for the towns most expensive gym even if one cant make the rent !!!!!!!!!!!!!!!!!!’ Ask any SB, she is perpetually young and naive, even the 36 yo (who in reality is 43)!!! Bull crap. By 25, many of us had professional jobs. By 27, many of us were home owners!!!!\n\n>Seriously WTF!!!\n\n>We are not evil devils. We just walked the right path, made a lot of sacrifices and still do. We respect women even if they are SBs. I don’t side with the creep SDs but as SDs we deal with shady women all the time. Still there is no excuse to mistreat a woman or do things without her consent. That said, there is no way there won’t be creeps in the bowl. Question is can you filter or even better just stay the fuck away from the “older than your dad” guys. Many women deliberately pick older and uglier guys because they can wield “looks power” over them. Well it comes with a double edged sword!!!\n\n>You are no naive !! No woman who walks into sugaring is naive!!!\n\n\nWhy are you so angry (that's how this seems)?  Her post doesn't mean every guy is bad, but some are, and bad things happen, and we worry about that.  And try not to project that concern. \n\nP.s.  I owned my first house well before sugaring at 24, after graduating college with a high GPA in a male dominated STEM major.   Not all SBs are the same either.  I didn't become an SB until mid 30s (and no, I'm still not 43, I use my real age)",
            "author": "CentralUSGal",
            "id": "efrqeq0",
            "parent_id": "t1_efro6hd",
            "score": 21,
            "created_utc": 1549334654.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efrupmf",
                    "parent_id": "t1_efrqeq0",
                    "score": 2,
                    "created_utc": 1549338267.0,
                    "replies": [
                        {
                            "body": "Fortunately every move I've made comes with a full relo package, so it makes it an easier decision.   I've also mostly lived in Midwest, so makes a difference I'm sure.",
                            "author": "CentralUSGal",
                            "id": "efrv8ao",
                            "parent_id": "t1_efrupmf",
                            "score": 4,
                            "created_utc": 1549338720.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I like your story of being a homeowner at a young age. Well done.\n\nMy point to the OP is the bowl does not always invite good intentions from both sides. We all walk into it with our eyes wide open. Not every SD is a bad guy or a creep. Not every SD is a predator. No SB is naive nor is any SD. \n",
                    "author": null,
                    "id": "efsengy",
                    "parent_id": "t1_efrqeq0",
                    "score": -2,
                    "created_utc": 1549365452.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "YOLO ! I die 🤣. This would be great on Rant Friday! \n\nJoke aside, I agree with you 100%. My reply was a tad more balanced, but the point I made is similar to the one you're making. \n\nCongrats on making it through your youth somewhat unscathed... or in one piece! ",
            "author": "KishiKawaii",
            "id": "efrqcnc",
            "parent_id": "t1_efro6hd",
            "score": 0,
            "created_utc": 1549334608.0,
            "replies": [
                {
                    "body": "It was not an easy journey. Frankly in my 40s, I have no desire to go back and live my 20s. I walked thru fire but it helped build an amazing foundation for my life. I don’t think many young people especially in the bowl realize that it takes sacrifice and hard work to get further in life. It’s a bit too much about “I am young, I am broke and so I am entitled”! ",
                    "author": null,
                    "id": "efsfj8r",
                    "parent_id": "t1_efrqcnc",
                    "score": 0,
                    "created_utc": 1549366833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Since I come up in your comment,  I will reply where I would usually hold my tongue.  \n\nWhen you turn on that app to do deliveries,  are you afraid that next customer is going to lock you in their basement and rape you? No? Every woman doing that same gig fears exactly that.\n\nWhen you get a job,  are you wondering how long it will be until your boss grabs your ass or makes some inappropriate request with a veiled implication that your response will impact your future there? Every woman does.\n\nWhen you walk down the street,  do strangers approach you,  demanding your number and make you wonder if your safety is at risk if you reject them?  Every woman does. \n\nYou overlook the glorious luxury of feeling safe most of the time in almost everything you do. Every woman has a plan for when shit goes bad, because every woman at least knows someone that has seen shit go bad.\n\nConsider what you are actually complaining about before you complain that I paid some poor girl's electric bill. You sob at my feet,  naked,  with my dick still wet with your saliva,  about losing your infant child and I may pay your electric bill as well. ",
            "author": "SDvegas",
            "id": "efthcua",
            "parent_id": "t1_efssb7t",
            "score": 12,
            "created_utc": 1549397376.0,
            "replies": [
                {
                    "body": "Well said. Empathy level on 100! ",
                    "author": "blonde-throwaway",
                    "id": "efuzbvk",
                    "parent_id": "t1_efthcua",
                    "score": 2,
                    "created_utc": 1549445847.0,
                    "replies": []
                },
                {
                    "body": "Eh,  you have what i describe as white knight mentality.  You see that quite a bit on webcam sites where men try to \"save\" every girl. Honestly a quick way to go broke.\nWhen i do deliveries.  There is a risk of being robbed, killed or anything else, especially in a bad neighborhood. I have a concealed gun permit. I don't think being male is going to make the money in my wallet less attractive to a robber.\n\nI would argue based on my 20+ years of corporate that women have 100% power. If any woman at my workplace walked into an HR office and even said i made them feel uncomfortable for any reason, I would be fired without proof or any real reason, because its cheaper to find a replacement for me than a possible lawsuit.  It has actually happened to me already and cost me many thousands of dollars frivolously. I only talk about business with women in business and keep a distance, making no friends. Workplaces gave gotten fairly hostile towards men and I don't bother making women friends under 50 in the workplace anymore. Insecure 20 somethings are a disaster. If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not.  \n\nNot every woman gets asked for her number or catcalled. I think most obese women would be the first to tell you that they are virtual ghosts... But you aren't trying to \"save\" those girls, are you?\nYou act like every woman is a potential victim waiting to happen. I just understand that there is an acceptance of risk just even walking out the front door each day. Most people do.\nIt is fine to be charitable. I buy my broke neighbor groceries all the time asking nothing in return. But that is what it is.. Charity.  Charity and compassion only go so far.  If she really has no money, she qualifies for SNAP, WIC, and a number of other programs, plus she should be collecting child support from her baby daddy, since she decided to have kids prior to an education or a real income. \n\nBut my points about her enhanced earning ability still remain.  She is not a victim. She put herself exactly in the circumstances she chose, based on her own decisions.\n",
                    "author": "capsfan80",
                    "id": "eftk4ue",
                    "parent_id": "t1_efthcua",
                    "score": 1,
                    "created_utc": 1549399250.0,
                    "replies": [
                        {
                            "body": "You are a victim of your own thinking. ",
                            "author": "SDvegas",
                            "id": "eftlju2",
                            "parent_id": "t1_eftk4ue",
                            "score": 7,
                            "created_utc": 1549400362.0,
                            "replies": [
                                {
                                    "body": "No, I'm just a victim of having to read that lame response.  Please go save another 19 year old.  She is a girl... she needs you.  :-) :-)",
                                    "author": "capsfan80",
                                    "id": "eftmcsw",
                                    "parent_id": "t1_eftlju2",
                                    "score": 0,
                                    "created_utc": 1549400934.0,
                                    "replies": [
                                        {
                                            "body": "Lame response?  I read your verbose,  but delusional,  reply. If you want a more voluminous response,  you will need to include something with some objective validity. I am not about to validate your delusions. \n\nOf note however,  is your failure to address the help I offered.",
                                            "author": "SDvegas",
                                            "id": "efu2awp",
                                            "parent_id": "t1_eftmcsw",
                                            "score": 5,
                                            "created_utc": 1549412908.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not. \n\nThis stuff angers me, I will try to be non-emotional in my response.  I want to preface this with I was not a sugar baby until very recently, nor did I sleep with anyone even remotely related to work ever.  So please remove that lens from your judgement.\n\nI worked my ass off to get where I am.  I made conscious decisions to not be note taker in meetings, make coffee (I don't drink it), bring homemade treats, or look overtly feminine so I would be treated equally, and not as a \"girl\".  You have any idea what it's like to be accused of sleeping your way there, or it being insinuated you got where you were because of your gender or race?\n\nI'm not naive, it makes it easier to get an interview, I'm sure.  I would argue though, that no high level manager in their right mind would hire someone at my level who wasn't the best for the job.\n\nAnd as I hiring manager, I have NEVER considered anything other than if the person was best for the job.  I remember hiring an older gentleman one time and later someone saying, why did you hire someone so close to retirement?  It hadn't even occurred to me, he was the best qualified.\n\nMost of the men who I know that complain are either not as smart, skilled, or have a personality issue that prevents them from being more successful.  Not because they are a man. \n\nI'm going to leave all your other points alone for now.",
                            "author": "CentralUSGal",
                            "id": "eftn0xp",
                            "parent_id": "t1_eftk4ue",
                            "score": 5,
                            "created_utc": 1549401401.0,
                            "replies": [
                                {
                                    "body": "When it comes to work, I'm speaking mostly from a technical/IT lens. Not sure what industry you work in. I cannot speak to your hiring practices and I commend you on hiring based on talent. I'm sure you do work hard, but it does not mean that HR didn't get to check off a box in interviewing you and they are still reporting all of those statistics annually, patting themselves on the back for being so inclusive regardless of merit.\nNot sure what field you work in that required you to dress so neutral. Men appreciate a well dressed woman, I would argue your biggest enemies on that will be other women. :-)\nAs for the insinuations, I can only tell you that in many IT jobs, they do not even interview you (see government) unless you are a woman or minority unless you have a special skill that they cannot find anywhere else. Don't believe me? Go apply for any IT job on USAjobs that pays under 150K. Some hiring managers say \"hire the next woman that walks thru the door\", that is not your fault or say anything to the merits of how qualified you are, it just is the way it is with the world today.\n\nHow do you define success? Lots of money? A gratefulness to wake up each day and breathe fresh air? A job you enjoy and a roof overhead?\n\nI am not complaining, I am just telling you the way it is. There is a difference. Your statement about men \"not being as smart, skilled or having a personality issue\" for pointing out the differences is just garbage. If it makes you feel better, you should keep believing it... I had a work permit the day i turned 14, worked at an internet provider 2 years later and worked at a firm in DC at age 18 when everyone else started off college. I went to college at night and paid cash.  I earned everything I have in this life, there was no shortcuts. So I know you most certainly couldn't be talking about me. :-) :-)\n",
                                    "author": "capsfan80",
                                    "id": "eftpwog",
                                    "parent_id": "t1_eftn0xp",
                                    "score": 1,
                                    "created_utc": 1549403404.0,
                                    "replies": [
                                        {
                                            "body": "I didn't make that statement because they pointed out the issues, I said that of \"most of the men I know who complain\".  I didn't say you, I will emphasize the statement was about men I personally know who have complained to me.\n\nHard work does not equal smart or skilled.  And by personality issues, I mean they literally have faults that prevent them from getting the next promotion.  This isn't really what I'm talking about, but to be honest and frank, I wouldn't want a manager who has a chip on his shoulder about women having it so \"easy\" or whatever word/phrase fits. \n\nIf you are open to hearing some of the things I have dealt with that more women than men deal with by far (always exceptions), I'd be happy to share to help perhaps provide a different perspective.  The things that are perceived by some white men as so unfair came about because of the disparity in how women or minorities have often been treated.  Often unintentionally.  So many don't even realize they are doing it.\n\nAgain, some and often - not all or always.\n\nI have worked with many amazing men, have had friendships with many more.  Until sugaring recently, I'll be honest that I was naive about how many probably wanted to sleep with me.  But I never realized it because they treated me like a human and not a sex object.  And in the end, isn't that what we all want, to be treated fairly?  Or at least not treated differently because of something we have no control over.    \n\nSometimes people use policies and programs inappropriately, but that doesn't mean the intent behind them was malicious.  It was to help one portion of people, not to harm anyone, despite what some seem to believe.  And to be very clear, the vast majority of the men I've worked with and the experiences I've had are good and positive.  The exceptions are unfortunate, and suck, and hopefully over time the frequency with which those things happen will continue to reduce.  The things that frustrate you so much have been implemented with that intention.",
                                            "author": "CentralUSGal",
                                            "id": "eftuxmp",
                                            "parent_id": "t1_eftpwog",
                                            "score": 5,
                                            "created_utc": 1549407083.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You do know that male escorts/ SB's exist right? Albeit with a mostly male clientele. So men are also free to leverage sex with people they would otherwise not be sleeping with. Something you may want to consider? All the best. ",
            "author": "blonde-throwaway",
            "id": "efsxlew",
            "parent_id": "t1_efssb7t",
            "score": 5,
            "created_utc": 1549383556.0,
            "replies": [
                {
                    "body": "Yes, but it is not really an apples to apples comparison.  You aren't sugaring or escorting with women as a straight woman or being asked to, your default client falls in line with your sexual orientation.  Sure I'm sure there are lesbians offering services to men,  but they are the exception.\n\n&#x200B;",
                    "author": "capsfan80",
                    "id": "eft7vcf",
                    "parent_id": "t1_efsxlew",
                    "score": 1,
                    "created_utc": 1549390779.0,
                    "replies": [
                        {
                            "body": "Sexuality is not relevant. You are still free to leverage sex with people you otherwise not be sleeping with, as sex workers do. Whether they align with their sexuality or not does not make them partners they would sleep without with money being involved.\n\nMy point is that you have options yet are purporting that you have none.",
                            "author": "blonde-throwaway",
                            "id": "eft7y94",
                            "parent_id": "t1_eft7vcf",
                            "score": 3,
                            "created_utc": 1549390834.0,
                            "replies": [
                                {
                                    "body": "Of course sexuality and gender are relevant and clearly this isn't getting thru to you...Probably 98% of sugar is straight women serving straight men because that is the demand. You aren't asking women to go gay.\n\nMy argument and statements above still hold.  Let me know if you have an actual viable alternative.   I don't think I'll be seeing any attractive or even average looking homeless women on the streets of DC today.  \n\nMy point has been made.\n\n&#x200B;\n\n&#x200B;",
                                    "author": "capsfan80",
                                    "id": "eft9s6d",
                                    "parent_id": "t1_eft7y94",
                                    "score": 3,
                                    "created_utc": 1549392100.0,
                                    "replies": [
                                        {
                                            "body": "You have options, if you don't want to pursue those options then that is *your* choice. All the best anyway. ",
                                            "author": "blonde-throwaway",
                                            "id": "eft9xr4",
                                            "parent_id": "t1_eft9s6d",
                                            "score": 3,
                                            "created_utc": 1549392205.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is an irrelevant comment. The market for male escorts / SB’s is tiny. Few people pay for dick, whether they are straight women or gay men. So your comment was nothing more than a red herring argument that added nothing to the conversation.",
                    "author": "sd_90210",
                    "id": "eftg2f7",
                    "parent_id": "t1_efsxlew",
                    "score": 0,
                    "created_utc": 1549396487.0,
                    "replies": [
                        {
                            "body": "His comment was also irrelevant. Like attracts like.",
                            "author": "blonde-throwaway",
                            "id": "eftx3z2",
                            "parent_id": "t1_eftg2f7",
                            "score": 2,
                            "created_utc": 1549408787.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% truth bro\n\n&#x200B;\n\nDont worry about the downvotes considering the SB ratio is 10:1 on this reddit. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
            "author": "alphadawg26",
            "id": "efy8le1",
            "parent_id": "t1_efssb7t",
            "score": 1,
            "created_utc": 1549555557.0,
            "replies": []
        },
        {
            "body": "You make excellent points about the lack of options for young men. However, as shown by the commenter below, your points will fall on deaf ears. Young men will get zero sympathy and will just be told to “man up.”  The gender equality movement only cares about one gender. ",
            "author": "sd_90210",
            "id": "eftgdav",
            "parent_id": "t1_efssb7t",
            "score": 0,
            "created_utc": 1549396698.0,
            "replies": [
                {
                    "body": "\"The gender equality movement only cares about one gender\"   \n\nTHIS.  So much this.",
                    "author": "capsfan80",
                    "id": "eftkid2",
                    "parent_id": "t1_eftgdav",
                    "score": 0,
                    "created_utc": 1549399550.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Comment on article post I believe",
            "author": "CentralUSGal",
            "id": "efre89t",
            "parent_id": "t1_efre0ww",
            "score": 3,
            "created_utc": 1549324568.0,
            "replies": []
        },
        {
            "body": "I don't think there is any thread. The article suggested has no comments like she describes in her post (and the article was shared by someone else. She has ignored any questions regarding the post). I think it was all made up.",
            "author": "sexviewer",
            "id": "eftplvo",
            "parent_id": "t1_efre0ww",
            "score": 1,
            "created_utc": 1549403196.0,
            "replies": []
        },
        {
            "body": ">https://www.reddit.com/r/sugarlifestyleforum/comments/an17lw/the\\_intern\\_who\\_doesnt\\_have\\_time\\_for\\_real\\_dates/\n\n&#x200B;\n\nShe responded to me with this link.  ",
            "author": null,
            "id": "efrpwdm",
            "parent_id": "t1_efre0ww",
            "score": 1,
            "created_utc": 1549334248.0,
            "replies": []
        },
        {
            "body": "Curious which part you are most bothered by?",
            "author": "CentralUSGal",
            "id": "efrfidg",
            "parent_id": "t1_efrf592",
            "score": 8,
            "created_utc": 1549325625.0,
            "replies": [
                {
                    "body": "Right to the gut!",
                    "author": "FromageQueso",
                    "id": "efrtyk5",
                    "parent_id": "t1_efrfidg",
                    "score": 2,
                    "created_utc": 1549337620.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\n\n>Girls don’t want to slowly work their way into the money part but they want to ease into the physical aspect. And I’m not taking about sleeping together on the first meeting, but if you take a guys money you should be prepared for the relationship to be mutually beneficial fairly quickly. \n\nOP used the term \"some\" guys (or some men I forget), but the point is, have compassion and understanding for the shit we don't sign up for.  I don't expect money until beginning an arrangement. But if we meet on SA and talked about an arrangment and I follow through on my end, I expect the man to follow through.  Have compassion that while you may be scammed out of some money, we are also scammed out of money (the promise of) but also feel very violated.  Even if it hasn't happened to you it weighs on you as a potential nearly every time.\n\nI would appreciate especially on a thread like this that you don't generalize a few bad experiences to everyone.  Some girls suck.  Some men suck.  We aren't all evil.",
            "author": "CentralUSGal",
            "id": "efs1b4p",
            "parent_id": "t1_efrywjg",
            "score": 15,
            "created_utc": 1549344677.0,
            "replies": [
                {
                    "body": "For sure.  Over the years I have learned that things are a lot easier and more enjoyable for everyone if the financial agreements have been met prior to the date.   That might mean sending a Venmo or cash app when she’s arriving but it needs to be done so she can relax about that part. ",
                    "author": "LotBuilder",
                    "id": "efs1m7n",
                    "parent_id": "t1_efs1b4p",
                    "score": 2,
                    "created_utc": 1549345022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you, dad. I appreciate the advice. And I’m doing fine.",
            "author": "ThatKGirl",
            "id": "efsqkbq",
            "parent_id": "t1_efs5s97",
            "score": 0,
            "created_utc": 1549378383.0,
            "replies": []
        },
        {
            "body": "That first time though.  No matter how long the SR is, when it begins it was the first time.  And we don't know what will happen.  We do our best to screen, vet, meet in public before scheduling an intimate date, and yet we are putting ourselves at risk.  Sure, if the first time goes well, odds are so will future times.  But this is a risk and fear regardless, with each SR (whether it be one week or 10 years), there is a first time.    ",
            "author": "CentralUSGal",
            "id": "efytoq2",
            "parent_id": "t1_efwjcod",
            "score": 1,
            "created_utc": 1549569521.0,
            "replies": []
        },
        {
            "body": "Lol. So you’re saying it’s the girl’s fault if a guy smacks her around? Uh huh...",
            "author": "ThatKGirl",
            "id": "efwo8aq",
            "parent_id": "t1_efwjcod",
            "score": 1,
            "created_utc": 1549496498.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efycap6",
                    "parent_id": "t1_efwo8aq",
                    "score": 1,
                    "created_utc": 1549558098.0,
                    "replies": [
                        {
                            "body": ">WTF? How did you get that from what I wrote?\n\nUmmmm. Let's see... You said...\n\n&#x200B;\n\n>  If you are in a SR with someone who is effectively your boyfriend, who you know intimately, there is a lot less chance of \\[bad things that are done by men to women\\]\n\n&#x200B;\n\nYah, so, um, you're kinda saying \"it's her fault for acting like an escort\" which sounds a lot like saying \"look at how she was dressed, she asked for it!\" Right?\n\nYou also seem to be saying that a girl who wants to explore sugaring should only do it with guys who are already effectively her boyfriend? Wow! That's a great idea! I'm sure every girl who steps into the bowl has a boyfriend-quality guy in her back pocket just aching to help her out, right? Because if we did, would be be posting a profile?\n\n&#x200B;\n\n> Of course there is risk to both parties in any relationship but if you  are seeing one man regularly, you have built up trust and respect, then a  lot of what you are describing is no longer a worry. \n\n&#x200B;\n\nRisk to the guy=being laughed at? Catching something? Being outed to his wife? All bad, for sure! But...\n\nRisk to the girl: Rape, death, pregnancy, being laughed at, catching something, and being outed to the real world.\n\nHow is it that you think a new SB should get to the point where she is \"seeing one man regularly\" who \"is effectively her boyfriend\"? Ya have to start somewhere. And, trust me, if I tell a guy on SA I want to date him for a while so that we feel like boy/girlfriends, ask yourself, how many stick around? (Hint: almost none.) You men want to move quickly - and that's not bad, but let's just not get all high and mighty and say it's the girl's fault.\n\nIf a human doesn't wait for consent, or hurts without permission, or stealths, or forces himself on her, then that is his crime. FULL STOP. I don't give a crap what she did beforehand. She always has the right to say \"No. Stop.\"\n\n> It's when SBs see a lot of different men, with little screening, and  with little time between the M&G and the first date that the  experience is more like what you describe. \n\n&#x200B;\n\nOh my god! You're right. I had never thought of it this way. Totally, because the girl chose to a different guy yesterday that some guy today thinks he can smack her around? That makes her less worthy of protection? Compassion? Human rights? \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
                            "author": "ThatKGirl",
                            "id": "efyf1ux",
                            "parent_id": "t1_efycap6",
                            "score": 1,
                            "created_utc": 1549559960.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">But still head to the big City WITHOUT a support network.....you are headed for failure\n\nI get what you're trying to get at, but this comment is very narrow minded. A lot of people don't have any support network at all. So what are they to do? Never attempt to do anything with their lives because there's a change of failure? ",
            "author": "MASugarBaby",
            "id": "efrinmg",
            "parent_id": "t1_efrfync",
            "score": 14,
            "created_utc": 1549328307.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efrix3a",
                    "parent_id": "t1_efrinmg",
                    "score": -2,
                    "created_utc": 1549328531.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "efrlmef",
                            "parent_id": "t1_efrix3a",
                            "score": 9,
                            "created_utc": 1549330739.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You really don't get the whole consent concept, do you? ",
            "author": "earthlingfemale",
            "id": "efsbmme",
            "parent_id": "t1_efs69ig",
            "score": 20,
            "created_utc": 1549360074.0,
            "replies": [
                {
                    "body": "Not sure where that came from......... I absolutely believe in and practice that not only is consent a foundational requirement but that it is also a revokable and subject to such limits as the SB wishes to impose.  without question or negotiation...  It's something that's important in itself but also leads to long term relationships both as sugar partners and often later as friends as they move to a different phase of their lives. I'm sorry if it was interpreted it differently . ",
                    "author": "pinotandsugar",
                    "id": "efsqu9m",
                    "parent_id": "t1_efsbmme",
                    "score": 5,
                    "created_utc": 1549378594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right and why worry about down votes? It's a forum to voice yourself. That said the need increases, age difference (in most cases) as well as nervousness. Do you want to be used by a particular kind of guy...?? There's a bit of Difference between middle aged banker/lawyer/business man and college guy I've got a crush on. Just for perspective as both serve different purposes 😊",
            "author": "absthaw",
            "id": "efskfo7",
            "parent_id": "t1_efs69ig",
            "score": 7,
            "created_utc": 1549372890.0,
            "replies": []
        },
        {
            "body": "You’re wrong to assume that even after 1-2 platonic dates a SD won’t become aggressive suddenly. I’ve seen it firsthand. Sometimes they change the second the door is locked and you’re alone. \nWomen have a very different experience. If he decides to be violent or not listen to your limits, how can a woman fight off a man 2-3 times her size? It’s almost impossible. ",
            "author": "babe__ruthless",
            "id": "efs5mlx",
            "parent_id": "t1_efrzlcx",
            "score": 30,
            "created_utc": 1549350072.0,
            "replies": [
                {
                    "body": "It's how the bowl plays. A girl has to educate herself before stepping in. That's just the truth. \n\nSome women aren't into sex yet they step in the bowl with Daddies twice or triple their age and sometimes so ugly inside out that they shiver at his touch. Yet, that's not the point. Those ladies are in for the goodies but forget the \"rules\" and when comes the time to speak up, they clam up and shove his dick wherever, thinking it'll be easy. It's not for the faint of heart.  It's not easy and it can produce very bad long term traumatisms.\n\nThe bowl is not a game. Even for a woman who think she knows how to do it, she can realize very quick that it won't work but \"MONEY\"! That's the problem.  If you're not desperate, you can quit as per your judgment. If not, the relationship will most certainly get worse.\n\nBut that's been said over and over. \n\nI still understand the OP's plea and wish her well.",
                    "author": "KishiKawaii",
                    "id": "efsiimn",
                    "parent_id": "t1_efs5mlx",
                    "score": 0,
                    "created_utc": 1549370773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a man how can you say it doesn’t apply to women? How do you know what truly goes on in their lives? ",
            "author": "danger0usw0man",
            "id": "efs5xav",
            "parent_id": "t1_efrzlcx",
            "score": 17,
            "created_utc": 1549350499.0,
            "replies": []
        },
        {
            "body": "except for me of course! ",
            "author": "GSSD",
            "id": "eftd3in",
            "parent_id": "t1_eftcjgf",
            "score": 4,
            "created_utc": 1549394398.0,
            "replies": []
        },
        {
            "body": "Indeed, \n\nI also mentioned the importance of empowering oneself in my very long post. It would take another post to explain how to do that though. You are welcome to provide those tools anytime.\n\nI've been there too and got fairly out of the rabbit hole. I still think that desparation is not the key to Sugaring. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\nToday, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to.  I didn't always think that way and learned my lesson. Some are lucky and never get to learn, and I'm truly happy for them. Again, life is not fair.\n\nEither I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.",
            "author": "KishiKawaii",
            "id": "efshwog",
            "parent_id": "t1_efsal8e",
            "score": 2,
            "created_utc": 1549370054.0,
            "replies": [
                {
                    "body": "Of course desperation is not the key to Sugaring. I just think we need to recognize the complete and utter futility of a statement like 'Never ever sugar out of desperation!'\n\n>I've been there too and got fairly out of the rabbit hole. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\n>Today, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to. I didn't always think that way and learned my lesson. \n\n>Either I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.\n\nSo with respect, it's not really about *you*... Your experiences are not necessarily the experiences of others and especially those your comment seems to be directed at; if your advice is coming directly from your own perspective, the scope of its benefit is limited. Much of your original comment contains helpful advice! But your oversimplified world view (and as an older SB, I'm assuming?) is shown in idealistic statements like 'If every SB would join the bowl with a clear mindset, goals already established and a good opinion of herself, the struggles would definitely lessen.' That would be great but it is simply not the world we live in, particularly in a bowl that attracts young and naive teenagers, people with little self worth and people in precarious financial situations - whether we like it or not. ",
                    "author": "yourgirlfriday99",
                    "id": "efsl9ai",
                    "parent_id": "t1_efshwog",
                    "score": 6,
                    "created_utc": 1549373738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efsjws5",
            "parent_id": "t1_efsal8e",
            "score": 0,
            "created_utc": 1549372329.0,
            "replies": [
                {
                    "body": "I know it's true. It's really not ideal - but unfortunately lots of people in this world aren't living in ideal situations. \n\n>Maybe this should be rewritten to... \"you should not sugar out of despair.  And if you have to - you should understand why you shouldn't, so you can try to avoid the same mistakes\".\n\nAnd this is my point exactly. Does anyone really think someone in a desperate situation and entering the bowl is going to read the statement 'you should not sugar out of despair' and think 'Oh gee, I guess that's true. Now I'm going to stay out of the bowl until I'm financially stable!'. Of course not. It's like telling a drug addict 'Don't do drugs' vs 'Don't do drugs but if you must, here's how to use needles safely etc'. (Bad analogy but I'm in class and multitasking lol)\n\nWith your revision above, yes they're going to skip straight past the first sentence but maybe actually gain something useful by understanding *why* they will be vulnerable and how they can take steps to minimize it.",
                    "author": "yourgirlfriday99",
                    "id": "efsl0ic",
                    "parent_id": "t1_efsjws5",
                    "score": 6,
                    "created_utc": 1549373489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If that's it, then it changes things dramatically. There is a big difference between saying things like that to someone and talking about someone when they just wrote an autobiographical article.",
            "author": "sexviewer",
            "id": "efrf7f7",
            "parent_id": "t1_efre600",
            "score": 4,
            "created_utc": 1549325373.0,
            "replies": []
        },
        {
            "body": "Indeed. The older than your dad is something I picked up in the original post that the SB says she has to deal with. I did not see a point for her to mention that. Yes the bowl is about older guys and if you meet the right one, he will treat you better than any of the younger ones. Fact is there was no need for her to mention that guys are older etc. Hence I picked it up and responded to it. I was no shaming but I felt she was shaming!",
            "author": null,
            "id": "efsff7g",
            "parent_id": "t1_efrxgmy",
            "score": -5,
            "created_utc": 1549366666.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efrupmf",
            "parent_id": "t1_efrqeq0",
            "score": 2,
            "created_utc": 1549338267.0,
            "replies": [
                {
                    "body": "Fortunately every move I've made comes with a full relo package, so it makes it an easier decision.   I've also mostly lived in Midwest, so makes a difference I'm sure.",
                    "author": "CentralUSGal",
                    "id": "efrv8ao",
                    "parent_id": "t1_efrupmf",
                    "score": 4,
                    "created_utc": 1549338720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like your story of being a homeowner at a young age. Well done.\n\nMy point to the OP is the bowl does not always invite good intentions from both sides. We all walk into it with our eyes wide open. Not every SD is a bad guy or a creep. Not every SD is a predator. No SB is naive nor is any SD. \n",
            "author": null,
            "id": "efsengy",
            "parent_id": "t1_efrqeq0",
            "score": -2,
            "created_utc": 1549365452.0,
            "replies": []
        },
        {
            "body": "It was not an easy journey. Frankly in my 40s, I have no desire to go back and live my 20s. I walked thru fire but it helped build an amazing foundation for my life. I don’t think many young people especially in the bowl realize that it takes sacrifice and hard work to get further in life. It’s a bit too much about “I am young, I am broke and so I am entitled”! ",
            "author": null,
            "id": "efsfj8r",
            "parent_id": "t1_efrqcnc",
            "score": 0,
            "created_utc": 1549366833.0,
            "replies": []
        },
        {
            "body": "Well said. Empathy level on 100! ",
            "author": "blonde-throwaway",
            "id": "efuzbvk",
            "parent_id": "t1_efthcua",
            "score": 2,
            "created_utc": 1549445847.0,
            "replies": []
        },
        {
            "body": "Eh,  you have what i describe as white knight mentality.  You see that quite a bit on webcam sites where men try to \"save\" every girl. Honestly a quick way to go broke.\nWhen i do deliveries.  There is a risk of being robbed, killed or anything else, especially in a bad neighborhood. I have a concealed gun permit. I don't think being male is going to make the money in my wallet less attractive to a robber.\n\nI would argue based on my 20+ years of corporate that women have 100% power. If any woman at my workplace walked into an HR office and even said i made them feel uncomfortable for any reason, I would be fired without proof or any real reason, because its cheaper to find a replacement for me than a possible lawsuit.  It has actually happened to me already and cost me many thousands of dollars frivolously. I only talk about business with women in business and keep a distance, making no friends. Workplaces gave gotten fairly hostile towards men and I don't bother making women friends under 50 in the workplace anymore. Insecure 20 somethings are a disaster. If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not.  \n\nNot every woman gets asked for her number or catcalled. I think most obese women would be the first to tell you that they are virtual ghosts... But you aren't trying to \"save\" those girls, are you?\nYou act like every woman is a potential victim waiting to happen. I just understand that there is an acceptance of risk just even walking out the front door each day. Most people do.\nIt is fine to be charitable. I buy my broke neighbor groceries all the time asking nothing in return. But that is what it is.. Charity.  Charity and compassion only go so far.  If she really has no money, she qualifies for SNAP, WIC, and a number of other programs, plus she should be collecting child support from her baby daddy, since she decided to have kids prior to an education or a real income. \n\nBut my points about her enhanced earning ability still remain.  She is not a victim. She put herself exactly in the circumstances she chose, based on her own decisions.\n",
            "author": "capsfan80",
            "id": "eftk4ue",
            "parent_id": "t1_efthcua",
            "score": 1,
            "created_utc": 1549399250.0,
            "replies": [
                {
                    "body": "You are a victim of your own thinking. ",
                    "author": "SDvegas",
                    "id": "eftlju2",
                    "parent_id": "t1_eftk4ue",
                    "score": 7,
                    "created_utc": 1549400362.0,
                    "replies": [
                        {
                            "body": "No, I'm just a victim of having to read that lame response.  Please go save another 19 year old.  She is a girl... she needs you.  :-) :-)",
                            "author": "capsfan80",
                            "id": "eftmcsw",
                            "parent_id": "t1_eftlju2",
                            "score": 0,
                            "created_utc": 1549400934.0,
                            "replies": [
                                {
                                    "body": "Lame response?  I read your verbose,  but delusional,  reply. If you want a more voluminous response,  you will need to include something with some objective validity. I am not about to validate your delusions. \n\nOf note however,  is your failure to address the help I offered.",
                                    "author": "SDvegas",
                                    "id": "efu2awp",
                                    "parent_id": "t1_eftmcsw",
                                    "score": 5,
                                    "created_utc": 1549412908.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not. \n\nThis stuff angers me, I will try to be non-emotional in my response.  I want to preface this with I was not a sugar baby until very recently, nor did I sleep with anyone even remotely related to work ever.  So please remove that lens from your judgement.\n\nI worked my ass off to get where I am.  I made conscious decisions to not be note taker in meetings, make coffee (I don't drink it), bring homemade treats, or look overtly feminine so I would be treated equally, and not as a \"girl\".  You have any idea what it's like to be accused of sleeping your way there, or it being insinuated you got where you were because of your gender or race?\n\nI'm not naive, it makes it easier to get an interview, I'm sure.  I would argue though, that no high level manager in their right mind would hire someone at my level who wasn't the best for the job.\n\nAnd as I hiring manager, I have NEVER considered anything other than if the person was best for the job.  I remember hiring an older gentleman one time and later someone saying, why did you hire someone so close to retirement?  It hadn't even occurred to me, he was the best qualified.\n\nMost of the men who I know that complain are either not as smart, skilled, or have a personality issue that prevents them from being more successful.  Not because they are a man. \n\nI'm going to leave all your other points alone for now.",
                    "author": "CentralUSGal",
                    "id": "eftn0xp",
                    "parent_id": "t1_eftk4ue",
                    "score": 5,
                    "created_utc": 1549401401.0,
                    "replies": [
                        {
                            "body": "When it comes to work, I'm speaking mostly from a technical/IT lens. Not sure what industry you work in. I cannot speak to your hiring practices and I commend you on hiring based on talent. I'm sure you do work hard, but it does not mean that HR didn't get to check off a box in interviewing you and they are still reporting all of those statistics annually, patting themselves on the back for being so inclusive regardless of merit.\nNot sure what field you work in that required you to dress so neutral. Men appreciate a well dressed woman, I would argue your biggest enemies on that will be other women. :-)\nAs for the insinuations, I can only tell you that in many IT jobs, they do not even interview you (see government) unless you are a woman or minority unless you have a special skill that they cannot find anywhere else. Don't believe me? Go apply for any IT job on USAjobs that pays under 150K. Some hiring managers say \"hire the next woman that walks thru the door\", that is not your fault or say anything to the merits of how qualified you are, it just is the way it is with the world today.\n\nHow do you define success? Lots of money? A gratefulness to wake up each day and breathe fresh air? A job you enjoy and a roof overhead?\n\nI am not complaining, I am just telling you the way it is. There is a difference. Your statement about men \"not being as smart, skilled or having a personality issue\" for pointing out the differences is just garbage. If it makes you feel better, you should keep believing it... I had a work permit the day i turned 14, worked at an internet provider 2 years later and worked at a firm in DC at age 18 when everyone else started off college. I went to college at night and paid cash.  I earned everything I have in this life, there was no shortcuts. So I know you most certainly couldn't be talking about me. :-) :-)\n",
                            "author": "capsfan80",
                            "id": "eftpwog",
                            "parent_id": "t1_eftn0xp",
                            "score": 1,
                            "created_utc": 1549403404.0,
                            "replies": [
                                {
                                    "body": "I didn't make that statement because they pointed out the issues, I said that of \"most of the men I know who complain\".  I didn't say you, I will emphasize the statement was about men I personally know who have complained to me.\n\nHard work does not equal smart or skilled.  And by personality issues, I mean they literally have faults that prevent them from getting the next promotion.  This isn't really what I'm talking about, but to be honest and frank, I wouldn't want a manager who has a chip on his shoulder about women having it so \"easy\" or whatever word/phrase fits. \n\nIf you are open to hearing some of the things I have dealt with that more women than men deal with by far (always exceptions), I'd be happy to share to help perhaps provide a different perspective.  The things that are perceived by some white men as so unfair came about because of the disparity in how women or minorities have often been treated.  Often unintentionally.  So many don't even realize they are doing it.\n\nAgain, some and often - not all or always.\n\nI have worked with many amazing men, have had friendships with many more.  Until sugaring recently, I'll be honest that I was naive about how many probably wanted to sleep with me.  But I never realized it because they treated me like a human and not a sex object.  And in the end, isn't that what we all want, to be treated fairly?  Or at least not treated differently because of something we have no control over.    \n\nSometimes people use policies and programs inappropriately, but that doesn't mean the intent behind them was malicious.  It was to help one portion of people, not to harm anyone, despite what some seem to believe.  And to be very clear, the vast majority of the men I've worked with and the experiences I've had are good and positive.  The exceptions are unfortunate, and suck, and hopefully over time the frequency with which those things happen will continue to reduce.  The things that frustrate you so much have been implemented with that intention.",
                                    "author": "CentralUSGal",
                                    "id": "eftuxmp",
                                    "parent_id": "t1_eftpwog",
                                    "score": 5,
                                    "created_utc": 1549407083.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, but it is not really an apples to apples comparison.  You aren't sugaring or escorting with women as a straight woman or being asked to, your default client falls in line with your sexual orientation.  Sure I'm sure there are lesbians offering services to men,  but they are the exception.\n\n&#x200B;",
            "author": "capsfan80",
            "id": "eft7vcf",
            "parent_id": "t1_efsxlew",
            "score": 1,
            "created_utc": 1549390779.0,
            "replies": [
                {
                    "body": "Sexuality is not relevant. You are still free to leverage sex with people you otherwise not be sleeping with, as sex workers do. Whether they align with their sexuality or not does not make them partners they would sleep without with money being involved.\n\nMy point is that you have options yet are purporting that you have none.",
                    "author": "blonde-throwaway",
                    "id": "eft7y94",
                    "parent_id": "t1_eft7vcf",
                    "score": 3,
                    "created_utc": 1549390834.0,
                    "replies": [
                        {
                            "body": "Of course sexuality and gender are relevant and clearly this isn't getting thru to you...Probably 98% of sugar is straight women serving straight men because that is the demand. You aren't asking women to go gay.\n\nMy argument and statements above still hold.  Let me know if you have an actual viable alternative.   I don't think I'll be seeing any attractive or even average looking homeless women on the streets of DC today.  \n\nMy point has been made.\n\n&#x200B;\n\n&#x200B;",
                            "author": "capsfan80",
                            "id": "eft9s6d",
                            "parent_id": "t1_eft7y94",
                            "score": 3,
                            "created_utc": 1549392100.0,
                            "replies": [
                                {
                                    "body": "You have options, if you don't want to pursue those options then that is *your* choice. All the best anyway. ",
                                    "author": "blonde-throwaway",
                                    "id": "eft9xr4",
                                    "parent_id": "t1_eft9s6d",
                                    "score": 3,
                                    "created_utc": 1549392205.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is an irrelevant comment. The market for male escorts / SB’s is tiny. Few people pay for dick, whether they are straight women or gay men. So your comment was nothing more than a red herring argument that added nothing to the conversation.",
            "author": "sd_90210",
            "id": "eftg2f7",
            "parent_id": "t1_efsxlew",
            "score": 0,
            "created_utc": 1549396487.0,
            "replies": [
                {
                    "body": "His comment was also irrelevant. Like attracts like.",
                    "author": "blonde-throwaway",
                    "id": "eftx3z2",
                    "parent_id": "t1_eftg2f7",
                    "score": 2,
                    "created_utc": 1549408787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"The gender equality movement only cares about one gender\"   \n\nTHIS.  So much this.",
            "author": "capsfan80",
            "id": "eftkid2",
            "parent_id": "t1_eftgdav",
            "score": 0,
            "created_utc": 1549399550.0,
            "replies": []
        },
        {
            "body": "Right to the gut!",
            "author": "FromageQueso",
            "id": "efrtyk5",
            "parent_id": "t1_efrfidg",
            "score": 2,
            "created_utc": 1549337620.0,
            "replies": []
        },
        {
            "body": "For sure.  Over the years I have learned that things are a lot easier and more enjoyable for everyone if the financial agreements have been met prior to the date.   That might mean sending a Venmo or cash app when she’s arriving but it needs to be done so she can relax about that part. ",
            "author": "LotBuilder",
            "id": "efs1m7n",
            "parent_id": "t1_efs1b4p",
            "score": 2,
            "created_utc": 1549345022.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efycap6",
            "parent_id": "t1_efwo8aq",
            "score": 1,
            "created_utc": 1549558098.0,
            "replies": [
                {
                    "body": ">WTF? How did you get that from what I wrote?\n\nUmmmm. Let's see... You said...\n\n&#x200B;\n\n>  If you are in a SR with someone who is effectively your boyfriend, who you know intimately, there is a lot less chance of \\[bad things that are done by men to women\\]\n\n&#x200B;\n\nYah, so, um, you're kinda saying \"it's her fault for acting like an escort\" which sounds a lot like saying \"look at how she was dressed, she asked for it!\" Right?\n\nYou also seem to be saying that a girl who wants to explore sugaring should only do it with guys who are already effectively her boyfriend? Wow! That's a great idea! I'm sure every girl who steps into the bowl has a boyfriend-quality guy in her back pocket just aching to help her out, right? Because if we did, would be be posting a profile?\n\n&#x200B;\n\n> Of course there is risk to both parties in any relationship but if you  are seeing one man regularly, you have built up trust and respect, then a  lot of what you are describing is no longer a worry. \n\n&#x200B;\n\nRisk to the guy=being laughed at? Catching something? Being outed to his wife? All bad, for sure! But...\n\nRisk to the girl: Rape, death, pregnancy, being laughed at, catching something, and being outed to the real world.\n\nHow is it that you think a new SB should get to the point where she is \"seeing one man regularly\" who \"is effectively her boyfriend\"? Ya have to start somewhere. And, trust me, if I tell a guy on SA I want to date him for a while so that we feel like boy/girlfriends, ask yourself, how many stick around? (Hint: almost none.) You men want to move quickly - and that's not bad, but let's just not get all high and mighty and say it's the girl's fault.\n\nIf a human doesn't wait for consent, or hurts without permission, or stealths, or forces himself on her, then that is his crime. FULL STOP. I don't give a crap what she did beforehand. She always has the right to say \"No. Stop.\"\n\n> It's when SBs see a lot of different men, with little screening, and  with little time between the M&G and the first date that the  experience is more like what you describe. \n\n&#x200B;\n\nOh my god! You're right. I had never thought of it this way. Totally, because the girl chose to a different guy yesterday that some guy today thinks he can smack her around? That makes her less worthy of protection? Compassion? Human rights? \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
                    "author": "ThatKGirl",
                    "id": "efyf1ux",
                    "parent_id": "t1_efycap6",
                    "score": 1,
                    "created_utc": 1549559960.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efrix3a",
            "parent_id": "t1_efrinmg",
            "score": -2,
            "created_utc": 1549328531.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "efrlmef",
                    "parent_id": "t1_efrix3a",
                    "score": 9,
                    "created_utc": 1549330739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not sure where that came from......... I absolutely believe in and practice that not only is consent a foundational requirement but that it is also a revokable and subject to such limits as the SB wishes to impose.  without question or negotiation...  It's something that's important in itself but also leads to long term relationships both as sugar partners and often later as friends as they move to a different phase of their lives. I'm sorry if it was interpreted it differently . ",
            "author": "pinotandsugar",
            "id": "efsqu9m",
            "parent_id": "t1_efsbmme",
            "score": 5,
            "created_utc": 1549378594.0,
            "replies": []
        },
        {
            "body": "It's how the bowl plays. A girl has to educate herself before stepping in. That's just the truth. \n\nSome women aren't into sex yet they step in the bowl with Daddies twice or triple their age and sometimes so ugly inside out that they shiver at his touch. Yet, that's not the point. Those ladies are in for the goodies but forget the \"rules\" and when comes the time to speak up, they clam up and shove his dick wherever, thinking it'll be easy. It's not for the faint of heart.  It's not easy and it can produce very bad long term traumatisms.\n\nThe bowl is not a game. Even for a woman who think she knows how to do it, she can realize very quick that it won't work but \"MONEY\"! That's the problem.  If you're not desperate, you can quit as per your judgment. If not, the relationship will most certainly get worse.\n\nBut that's been said over and over. \n\nI still understand the OP's plea and wish her well.",
            "author": "KishiKawaii",
            "id": "efsiimn",
            "parent_id": "t1_efs5mlx",
            "score": 0,
            "created_utc": 1549370773.0,
            "replies": []
        },
        {
            "body": "Of course desperation is not the key to Sugaring. I just think we need to recognize the complete and utter futility of a statement like 'Never ever sugar out of desperation!'\n\n>I've been there too and got fairly out of the rabbit hole. Money never comes easy, regrets and disgust are destructive feelings, life is not fair.\n\n>Today, I personally prefer to die poor and alone, even if that scares me, than to feel sick about myself for doing things I really don't want to. I didn't always think that way and learned my lesson. \n\n>Either I kick myself in the ass, either I do nothing and look at life passing by, but I won't step into a dark hole just to grab the shiny piece at the bottom. No more.\n\nSo with respect, it's not really about *you*... Your experiences are not necessarily the experiences of others and especially those your comment seems to be directed at; if your advice is coming directly from your own perspective, the scope of its benefit is limited. Much of your original comment contains helpful advice! But your oversimplified world view (and as an older SB, I'm assuming?) is shown in idealistic statements like 'If every SB would join the bowl with a clear mindset, goals already established and a good opinion of herself, the struggles would definitely lessen.' That would be great but it is simply not the world we live in, particularly in a bowl that attracts young and naive teenagers, people with little self worth and people in precarious financial situations - whether we like it or not. ",
            "author": "yourgirlfriday99",
            "id": "efsl9ai",
            "parent_id": "t1_efshwog",
            "score": 6,
            "created_utc": 1549373738.0,
            "replies": []
        },
        {
            "body": "I know it's true. It's really not ideal - but unfortunately lots of people in this world aren't living in ideal situations. \n\n>Maybe this should be rewritten to... \"you should not sugar out of despair.  And if you have to - you should understand why you shouldn't, so you can try to avoid the same mistakes\".\n\nAnd this is my point exactly. Does anyone really think someone in a desperate situation and entering the bowl is going to read the statement 'you should not sugar out of despair' and think 'Oh gee, I guess that's true. Now I'm going to stay out of the bowl until I'm financially stable!'. Of course not. It's like telling a drug addict 'Don't do drugs' vs 'Don't do drugs but if you must, here's how to use needles safely etc'. (Bad analogy but I'm in class and multitasking lol)\n\nWith your revision above, yes they're going to skip straight past the first sentence but maybe actually gain something useful by understanding *why* they will be vulnerable and how they can take steps to minimize it.",
            "author": "yourgirlfriday99",
            "id": "efsl0ic",
            "parent_id": "t1_efsjws5",
            "score": 6,
            "created_utc": 1549373489.0,
            "replies": []
        },
        {
            "body": "Fortunately every move I've made comes with a full relo package, so it makes it an easier decision.   I've also mostly lived in Midwest, so makes a difference I'm sure.",
            "author": "CentralUSGal",
            "id": "efrv8ao",
            "parent_id": "t1_efrupmf",
            "score": 4,
            "created_utc": 1549338720.0,
            "replies": []
        },
        {
            "body": "You are a victim of your own thinking. ",
            "author": "SDvegas",
            "id": "eftlju2",
            "parent_id": "t1_eftk4ue",
            "score": 7,
            "created_utc": 1549400362.0,
            "replies": [
                {
                    "body": "No, I'm just a victim of having to read that lame response.  Please go save another 19 year old.  She is a girl... she needs you.  :-) :-)",
                    "author": "capsfan80",
                    "id": "eftmcsw",
                    "parent_id": "t1_eftlju2",
                    "score": 0,
                    "created_utc": 1549400934.0,
                    "replies": [
                        {
                            "body": "Lame response?  I read your verbose,  but delusional,  reply. If you want a more voluminous response,  you will need to include something with some objective validity. I am not about to validate your delusions. \n\nOf note however,  is your failure to address the help I offered.",
                            "author": "SDvegas",
                            "id": "efu2awp",
                            "parent_id": "t1_eftmcsw",
                            "score": 5,
                            "created_utc": 1549412908.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">If i was a woman in my industry, i could have less skills, and get a 25% raise to help boost some companies EEOC/sex quota for hiring minorities in IT (my field). As of recently, California is REQUIRING women to be on corporate boards, qualified or not. \n\nThis stuff angers me, I will try to be non-emotional in my response.  I want to preface this with I was not a sugar baby until very recently, nor did I sleep with anyone even remotely related to work ever.  So please remove that lens from your judgement.\n\nI worked my ass off to get where I am.  I made conscious decisions to not be note taker in meetings, make coffee (I don't drink it), bring homemade treats, or look overtly feminine so I would be treated equally, and not as a \"girl\".  You have any idea what it's like to be accused of sleeping your way there, or it being insinuated you got where you were because of your gender or race?\n\nI'm not naive, it makes it easier to get an interview, I'm sure.  I would argue though, that no high level manager in their right mind would hire someone at my level who wasn't the best for the job.\n\nAnd as I hiring manager, I have NEVER considered anything other than if the person was best for the job.  I remember hiring an older gentleman one time and later someone saying, why did you hire someone so close to retirement?  It hadn't even occurred to me, he was the best qualified.\n\nMost of the men who I know that complain are either not as smart, skilled, or have a personality issue that prevents them from being more successful.  Not because they are a man. \n\nI'm going to leave all your other points alone for now.",
            "author": "CentralUSGal",
            "id": "eftn0xp",
            "parent_id": "t1_eftk4ue",
            "score": 5,
            "created_utc": 1549401401.0,
            "replies": [
                {
                    "body": "When it comes to work, I'm speaking mostly from a technical/IT lens. Not sure what industry you work in. I cannot speak to your hiring practices and I commend you on hiring based on talent. I'm sure you do work hard, but it does not mean that HR didn't get to check off a box in interviewing you and they are still reporting all of those statistics annually, patting themselves on the back for being so inclusive regardless of merit.\nNot sure what field you work in that required you to dress so neutral. Men appreciate a well dressed woman, I would argue your biggest enemies on that will be other women. :-)\nAs for the insinuations, I can only tell you that in many IT jobs, they do not even interview you (see government) unless you are a woman or minority unless you have a special skill that they cannot find anywhere else. Don't believe me? Go apply for any IT job on USAjobs that pays under 150K. Some hiring managers say \"hire the next woman that walks thru the door\", that is not your fault or say anything to the merits of how qualified you are, it just is the way it is with the world today.\n\nHow do you define success? Lots of money? A gratefulness to wake up each day and breathe fresh air? A job you enjoy and a roof overhead?\n\nI am not complaining, I am just telling you the way it is. There is a difference. Your statement about men \"not being as smart, skilled or having a personality issue\" for pointing out the differences is just garbage. If it makes you feel better, you should keep believing it... I had a work permit the day i turned 14, worked at an internet provider 2 years later and worked at a firm in DC at age 18 when everyone else started off college. I went to college at night and paid cash.  I earned everything I have in this life, there was no shortcuts. So I know you most certainly couldn't be talking about me. :-) :-)\n",
                    "author": "capsfan80",
                    "id": "eftpwog",
                    "parent_id": "t1_eftn0xp",
                    "score": 1,
                    "created_utc": 1549403404.0,
                    "replies": [
                        {
                            "body": "I didn't make that statement because they pointed out the issues, I said that of \"most of the men I know who complain\".  I didn't say you, I will emphasize the statement was about men I personally know who have complained to me.\n\nHard work does not equal smart or skilled.  And by personality issues, I mean they literally have faults that prevent them from getting the next promotion.  This isn't really what I'm talking about, but to be honest and frank, I wouldn't want a manager who has a chip on his shoulder about women having it so \"easy\" or whatever word/phrase fits. \n\nIf you are open to hearing some of the things I have dealt with that more women than men deal with by far (always exceptions), I'd be happy to share to help perhaps provide a different perspective.  The things that are perceived by some white men as so unfair came about because of the disparity in how women or minorities have often been treated.  Often unintentionally.  So many don't even realize they are doing it.\n\nAgain, some and often - not all or always.\n\nI have worked with many amazing men, have had friendships with many more.  Until sugaring recently, I'll be honest that I was naive about how many probably wanted to sleep with me.  But I never realized it because they treated me like a human and not a sex object.  And in the end, isn't that what we all want, to be treated fairly?  Or at least not treated differently because of something we have no control over.    \n\nSometimes people use policies and programs inappropriately, but that doesn't mean the intent behind them was malicious.  It was to help one portion of people, not to harm anyone, despite what some seem to believe.  And to be very clear, the vast majority of the men I've worked with and the experiences I've had are good and positive.  The exceptions are unfortunate, and suck, and hopefully over time the frequency with which those things happen will continue to reduce.  The things that frustrate you so much have been implemented with that intention.",
                            "author": "CentralUSGal",
                            "id": "eftuxmp",
                            "parent_id": "t1_eftpwog",
                            "score": 5,
                            "created_utc": 1549407083.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sexuality is not relevant. You are still free to leverage sex with people you otherwise not be sleeping with, as sex workers do. Whether they align with their sexuality or not does not make them partners they would sleep without with money being involved.\n\nMy point is that you have options yet are purporting that you have none.",
            "author": "blonde-throwaway",
            "id": "eft7y94",
            "parent_id": "t1_eft7vcf",
            "score": 3,
            "created_utc": 1549390834.0,
            "replies": [
                {
                    "body": "Of course sexuality and gender are relevant and clearly this isn't getting thru to you...Probably 98% of sugar is straight women serving straight men because that is the demand. You aren't asking women to go gay.\n\nMy argument and statements above still hold.  Let me know if you have an actual viable alternative.   I don't think I'll be seeing any attractive or even average looking homeless women on the streets of DC today.  \n\nMy point has been made.\n\n&#x200B;\n\n&#x200B;",
                    "author": "capsfan80",
                    "id": "eft9s6d",
                    "parent_id": "t1_eft7y94",
                    "score": 3,
                    "created_utc": 1549392100.0,
                    "replies": [
                        {
                            "body": "You have options, if you don't want to pursue those options then that is *your* choice. All the best anyway. ",
                            "author": "blonde-throwaway",
                            "id": "eft9xr4",
                            "parent_id": "t1_eft9s6d",
                            "score": 3,
                            "created_utc": 1549392205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His comment was also irrelevant. Like attracts like.",
            "author": "blonde-throwaway",
            "id": "eftx3z2",
            "parent_id": "t1_eftg2f7",
            "score": 2,
            "created_utc": 1549408787.0,
            "replies": []
        },
        {
            "body": ">WTF? How did you get that from what I wrote?\n\nUmmmm. Let's see... You said...\n\n&#x200B;\n\n>  If you are in a SR with someone who is effectively your boyfriend, who you know intimately, there is a lot less chance of \\[bad things that are done by men to women\\]\n\n&#x200B;\n\nYah, so, um, you're kinda saying \"it's her fault for acting like an escort\" which sounds a lot like saying \"look at how she was dressed, she asked for it!\" Right?\n\nYou also seem to be saying that a girl who wants to explore sugaring should only do it with guys who are already effectively her boyfriend? Wow! That's a great idea! I'm sure every girl who steps into the bowl has a boyfriend-quality guy in her back pocket just aching to help her out, right? Because if we did, would be be posting a profile?\n\n&#x200B;\n\n> Of course there is risk to both parties in any relationship but if you  are seeing one man regularly, you have built up trust and respect, then a  lot of what you are describing is no longer a worry. \n\n&#x200B;\n\nRisk to the guy=being laughed at? Catching something? Being outed to his wife? All bad, for sure! But...\n\nRisk to the girl: Rape, death, pregnancy, being laughed at, catching something, and being outed to the real world.\n\nHow is it that you think a new SB should get to the point where she is \"seeing one man regularly\" who \"is effectively her boyfriend\"? Ya have to start somewhere. And, trust me, if I tell a guy on SA I want to date him for a while so that we feel like boy/girlfriends, ask yourself, how many stick around? (Hint: almost none.) You men want to move quickly - and that's not bad, but let's just not get all high and mighty and say it's the girl's fault.\n\nIf a human doesn't wait for consent, or hurts without permission, or stealths, or forces himself on her, then that is his crime. FULL STOP. I don't give a crap what she did beforehand. She always has the right to say \"No. Stop.\"\n\n> It's when SBs see a lot of different men, with little screening, and  with little time between the M&G and the first date that the  experience is more like what you describe. \n\n&#x200B;\n\nOh my god! You're right. I had never thought of it this way. Totally, because the girl chose to a different guy yesterday that some guy today thinks he can smack her around? That makes her less worthy of protection? Compassion? Human rights? \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
            "author": "ThatKGirl",
            "id": "efyf1ux",
            "parent_id": "t1_efycap6",
            "score": 1,
            "created_utc": 1549559960.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "efrlmef",
            "parent_id": "t1_efrix3a",
            "score": 9,
            "created_utc": 1549330739.0,
            "replies": []
        },
        {
            "body": "No, I'm just a victim of having to read that lame response.  Please go save another 19 year old.  She is a girl... she needs you.  :-) :-)",
            "author": "capsfan80",
            "id": "eftmcsw",
            "parent_id": "t1_eftlju2",
            "score": 0,
            "created_utc": 1549400934.0,
            "replies": [
                {
                    "body": "Lame response?  I read your verbose,  but delusional,  reply. If you want a more voluminous response,  you will need to include something with some objective validity. I am not about to validate your delusions. \n\nOf note however,  is your failure to address the help I offered.",
                    "author": "SDvegas",
                    "id": "efu2awp",
                    "parent_id": "t1_eftmcsw",
                    "score": 5,
                    "created_utc": 1549412908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When it comes to work, I'm speaking mostly from a technical/IT lens. Not sure what industry you work in. I cannot speak to your hiring practices and I commend you on hiring based on talent. I'm sure you do work hard, but it does not mean that HR didn't get to check off a box in interviewing you and they are still reporting all of those statistics annually, patting themselves on the back for being so inclusive regardless of merit.\nNot sure what field you work in that required you to dress so neutral. Men appreciate a well dressed woman, I would argue your biggest enemies on that will be other women. :-)\nAs for the insinuations, I can only tell you that in many IT jobs, they do not even interview you (see government) unless you are a woman or minority unless you have a special skill that they cannot find anywhere else. Don't believe me? Go apply for any IT job on USAjobs that pays under 150K. Some hiring managers say \"hire the next woman that walks thru the door\", that is not your fault or say anything to the merits of how qualified you are, it just is the way it is with the world today.\n\nHow do you define success? Lots of money? A gratefulness to wake up each day and breathe fresh air? A job you enjoy and a roof overhead?\n\nI am not complaining, I am just telling you the way it is. There is a difference. Your statement about men \"not being as smart, skilled or having a personality issue\" for pointing out the differences is just garbage. If it makes you feel better, you should keep believing it... I had a work permit the day i turned 14, worked at an internet provider 2 years later and worked at a firm in DC at age 18 when everyone else started off college. I went to college at night and paid cash.  I earned everything I have in this life, there was no shortcuts. So I know you most certainly couldn't be talking about me. :-) :-)\n",
            "author": "capsfan80",
            "id": "eftpwog",
            "parent_id": "t1_eftn0xp",
            "score": 1,
            "created_utc": 1549403404.0,
            "replies": [
                {
                    "body": "I didn't make that statement because they pointed out the issues, I said that of \"most of the men I know who complain\".  I didn't say you, I will emphasize the statement was about men I personally know who have complained to me.\n\nHard work does not equal smart or skilled.  And by personality issues, I mean they literally have faults that prevent them from getting the next promotion.  This isn't really what I'm talking about, but to be honest and frank, I wouldn't want a manager who has a chip on his shoulder about women having it so \"easy\" or whatever word/phrase fits. \n\nIf you are open to hearing some of the things I have dealt with that more women than men deal with by far (always exceptions), I'd be happy to share to help perhaps provide a different perspective.  The things that are perceived by some white men as so unfair came about because of the disparity in how women or minorities have often been treated.  Often unintentionally.  So many don't even realize they are doing it.\n\nAgain, some and often - not all or always.\n\nI have worked with many amazing men, have had friendships with many more.  Until sugaring recently, I'll be honest that I was naive about how many probably wanted to sleep with me.  But I never realized it because they treated me like a human and not a sex object.  And in the end, isn't that what we all want, to be treated fairly?  Or at least not treated differently because of something we have no control over.    \n\nSometimes people use policies and programs inappropriately, but that doesn't mean the intent behind them was malicious.  It was to help one portion of people, not to harm anyone, despite what some seem to believe.  And to be very clear, the vast majority of the men I've worked with and the experiences I've had are good and positive.  The exceptions are unfortunate, and suck, and hopefully over time the frequency with which those things happen will continue to reduce.  The things that frustrate you so much have been implemented with that intention.",
                    "author": "CentralUSGal",
                    "id": "eftuxmp",
                    "parent_id": "t1_eftpwog",
                    "score": 5,
                    "created_utc": 1549407083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Of course sexuality and gender are relevant and clearly this isn't getting thru to you...Probably 98% of sugar is straight women serving straight men because that is the demand. You aren't asking women to go gay.\n\nMy argument and statements above still hold.  Let me know if you have an actual viable alternative.   I don't think I'll be seeing any attractive or even average looking homeless women on the streets of DC today.  \n\nMy point has been made.\n\n&#x200B;\n\n&#x200B;",
            "author": "capsfan80",
            "id": "eft9s6d",
            "parent_id": "t1_eft7y94",
            "score": 3,
            "created_utc": 1549392100.0,
            "replies": [
                {
                    "body": "You have options, if you don't want to pursue those options then that is *your* choice. All the best anyway. ",
                    "author": "blonde-throwaway",
                    "id": "eft9xr4",
                    "parent_id": "t1_eft9s6d",
                    "score": 3,
                    "created_utc": 1549392205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lame response?  I read your verbose,  but delusional,  reply. If you want a more voluminous response,  you will need to include something with some objective validity. I am not about to validate your delusions. \n\nOf note however,  is your failure to address the help I offered.",
            "author": "SDvegas",
            "id": "efu2awp",
            "parent_id": "t1_eftmcsw",
            "score": 5,
            "created_utc": 1549412908.0,
            "replies": []
        },
        {
            "body": "I didn't make that statement because they pointed out the issues, I said that of \"most of the men I know who complain\".  I didn't say you, I will emphasize the statement was about men I personally know who have complained to me.\n\nHard work does not equal smart or skilled.  And by personality issues, I mean they literally have faults that prevent them from getting the next promotion.  This isn't really what I'm talking about, but to be honest and frank, I wouldn't want a manager who has a chip on his shoulder about women having it so \"easy\" or whatever word/phrase fits. \n\nIf you are open to hearing some of the things I have dealt with that more women than men deal with by far (always exceptions), I'd be happy to share to help perhaps provide a different perspective.  The things that are perceived by some white men as so unfair came about because of the disparity in how women or minorities have often been treated.  Often unintentionally.  So many don't even realize they are doing it.\n\nAgain, some and often - not all or always.\n\nI have worked with many amazing men, have had friendships with many more.  Until sugaring recently, I'll be honest that I was naive about how many probably wanted to sleep with me.  But I never realized it because they treated me like a human and not a sex object.  And in the end, isn't that what we all want, to be treated fairly?  Or at least not treated differently because of something we have no control over.    \n\nSometimes people use policies and programs inappropriately, but that doesn't mean the intent behind them was malicious.  It was to help one portion of people, not to harm anyone, despite what some seem to believe.  And to be very clear, the vast majority of the men I've worked with and the experiences I've had are good and positive.  The exceptions are unfortunate, and suck, and hopefully over time the frequency with which those things happen will continue to reduce.  The things that frustrate you so much have been implemented with that intention.",
            "author": "CentralUSGal",
            "id": "eftuxmp",
            "parent_id": "t1_eftpwog",
            "score": 5,
            "created_utc": 1549407083.0,
            "replies": []
        },
        {
            "body": "You have options, if you don't want to pursue those options then that is *your* choice. All the best anyway. ",
            "author": "blonde-throwaway",
            "id": "eft9xr4",
            "parent_id": "t1_eft9s6d",
            "score": 3,
            "created_utc": 1549392205.0,
            "replies": []
        }
    ]
}