{
    "title": "Guy offered to fly me to New York and then said there would be no allowance LMAO",
    "post_id": "rnrywa",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rnrywa/guy_offered_to_fly_me_to_new_york_and_then_said/",
    "author": "delidoll",
    "body": "I don't know what goes through some of these guys' heads. I live in Chicago and this guy messaged me on SA asking if I would be open to going to New York to meet him. Red flag in itself because we BOTH live in sugar oasis' and there are plenty of SDs and SBs for us to choose from in our own cities but I went along with it just to see his offer. He then proceeded to tell me there would be no allowance since he would be paying for my flight and expenses while I was there. I'm sorry lol what? no? That would ENTIRELY benefit him. I would have to take time off work, fly to see him, stop my life for a week...all for what lmao? I said no, I'm not cool with that and he called me entitled. Don't fall for this kind of stuff, ladies. It's called a mutually beneficial arrangement for a reason and this guy was either a scammer of some sort or a guy who is just looking for a naive girl to give him free sugar. Absolutely ridiculous.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rnrywa/guy_offered_to_fly_me_to_new_york_and_then_said/",
    "score": 132,
    "upvote_ratio": 0.89,
    "created_utc": 1640370565.0,
    "num_comments": 51,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Every time a guy throws an insult on the way out look in the mirror and say “I am incredibly lucky today” because you just dodged a mega bullet.  It just speaks to the darkest things in someone’s soul.\n\nOf course if you deeply insult him first that’s a fair fight and may the best man win.",
            "author": "JosephJohnPEEPS",
            "id": "hpu763n",
            "parent_id": "t3_rnrywa",
            "score": 46,
            "created_utc": 1640373163.0,
            "replies": [
                {
                    "body": "Yeah lmao Ive been called a sloot after they asked for a ppm in a hotel and I told them I dont do that LMAO. I called him a ugly  fat as... and called him the hoe. These guys are crazy",
                    "author": "VExistence",
                    "id": "hq47rzr",
                    "parent_id": "t1_hpu763n",
                    "score": 1,
                    "created_utc": 1640584609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like you said..he's in a SB oasis .. honestly, it sounds like a possible human trafficking situation.",
            "author": "vince539839",
            "id": "hpuhho3",
            "parent_id": "t3_rnrywa",
            "score": 36,
            "created_utc": 1640378084.0,
            "replies": [
                {
                    "body": "This is part of why I think that if anyone is going to fly out it should be the sugar daddy.  A sugar baby flying out to meet a stranger runs the risk of running into a human trafficking scam.  Better to have the SD fly out to you.",
                    "author": "RTManson",
                    "id": "hpvn5df",
                    "parent_id": "t1_hpuhho3",
                    "score": 23,
                    "created_utc": 1640401288.0,
                    "replies": [
                        {
                            "body": "Agreed. Home turf advantage is so important. This guy just sounds shady .. why spend so much money flying someone out, when he could find someone local. Makes no sense.",
                            "author": "vince539839",
                            "id": "hpwcm81",
                            "parent_id": "t1_hpvn5df",
                            "score": 6,
                            "created_utc": 1640419528.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorta ties into the post earlier today about hunky guys on SA. If they're coming at your with an offer, and you can't understand why they're on SA, or why they'd offer sugar, or why they can't find a match that's more convenient or whatever - if it's not adding up, mostly it will all make more sense when you ask for sugar and he freaks out lol\n\nI did have a convo a while back with a guy that cited flight expenses as a reason for a lower allowance, and I told him that if he had to drop down to commercial to afford my full allowance that was fine lol",
            "author": "NoLimitLexa",
            "id": "hpu5co6",
            "parent_id": "t3_rnrywa",
            "score": 43,
            "created_utc": 1640372310.0,
            "replies": []
        },
        {
            "body": "I had him offer me the same thing a while back (I’m also in Chicago, and I have no idea if they are the same person) ! And when I asked what my allowance would be, he called me immature and said that while he wouldn’t be paying for me to meet him or stay with him, that the experience should be enough.",
            "author": "Then-Attention19",
            "id": "hpvbw08",
            "parent_id": "t3_rnrywa",
            "score": 14,
            "created_utc": 1640394189.0,
            "replies": []
        },
        {
            "body": "He's an \"experience daddy.\" Lol",
            "author": "bonafideSugar",
            "id": "hpu7vzn",
            "parent_id": "t3_rnrywa",
            "score": 29,
            "created_utc": 1640373505.0,
            "replies": [
                {
                    "body": "Lol\n\nI’m an experience SD who also pays PPM so I am the best of both worlds 😉",
                    "author": "UnearthlyDinosaur",
                    "id": "hpuesfn",
                    "parent_id": "t1_hpu7vzn",
                    "score": 8,
                    "created_utc": 1640376782.0,
                    "replies": [
                        {
                            "body": "You are the real SD period. Not salt not Splenda (if you’re generous). Congrats.",
                            "author": "whatifitdoescometrue",
                            "id": "hpv5umr",
                            "parent_id": "t1_hpuesfn",
                            "score": 1,
                            "created_utc": 1640390610.0,
                            "replies": []
                        },
                        {
                            "body": "Absolutely!",
                            "author": "bonafideSugar",
                            "id": "hpuksmh",
                            "parent_id": "t1_hpuesfn",
                            "score": 1,
                            "created_utc": 1640379705.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Which is called being cheap",
                    "author": "Bbygirlxxxx",
                    "id": "hpuo0pg",
                    "parent_id": "t1_hpu7vzn",
                    "score": 7,
                    "created_utc": 1640381302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just like there are girls on Tiktok telling women that they can be a sugar baby without having sex there are a few guys on YouTube that I have run across that advocate using SA as a regular dating site and not offering any allowance.\n\nUnfortunately SA seems to be encouraging the attitude that the site is a vanilla dating site more and more.",
            "author": "RTManson",
            "id": "hpvmxig",
            "parent_id": "t3_rnrywa",
            "score": 9,
            "created_utc": 1640401148.0,
            "replies": [
                {
                    "body": "You can actually find sugar daddies looking for platonic arrangements with issues such as ED Now I prefer ones that do involve intimacy but I have had platonic arrangements and often times these guys do offer more in terms of ppm and experiences than guys wanting Intimacy often offer. The highest ppm arrangement I ever received was from a guy who simply couldn’t get an erection through Severe ED snd we did try several times and he offered amazing experiences on top of that. The catch is often that these arrangements are short term only. Also a lot of sugar daddies are willing to offer some £££ for the meet and greet. I know this isn’t what most of the guys here on this forum want to believe or advocate but they are there.",
                    "author": "cccamilla775",
                    "id": "hpx5kqh",
                    "parent_id": "t1_hpvmxig",
                    "score": 3,
                    "created_utc": 1640444072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He might have been a Nigerian prince....lmao",
            "author": "Dmk3955",
            "id": "hpwwlye",
            "parent_id": "t3_rnrywa",
            "score": 3,
            "created_utc": 1640438048.0,
            "replies": []
        },
        {
            "body": "The assumption from a lot of sugar daddies is that they assume young SBs cannot have these type of experiences off their own back. This simply isn’t true at all. A lot of SBs myself included have well paying jobs, their own homes and regularly eat in nice restaurants, go on amazing vacations and can afford a lot of the things that SDs offer. Or have a vanilla partner that they do those things with. Maybe both, a lot of us are here looking for play money or sugar for the thrill of it and not to pay bills/gain experiences.",
            "author": "cccamilla775",
            "id": "hpx6ij3",
            "parent_id": "t3_rnrywa",
            "score": 3,
            "created_utc": 1640444646.0,
            "replies": []
        },
        {
            "body": "I’ve done something similar with flying an SB out to Florida for a long weekend at Disney.  We both had an awesome time!\n\nLike many things in life - sugar dating is highly variable. \n\nAn SB in LA or SF may want strictly an allowance b/c she’s upper middle class and used to dating strictly bankers / PE guys / hedge fund managers who provide high end experiences as part of vanilla dating. \n\nWhereas another SB from BFE, Alabama may have never been on a plane before and would be thrilled by a weekend in NYC seeing Hamilton for the first time ever.",
            "author": "Raven_runner",
            "id": "hpxqllk",
            "parent_id": "t3_rnrywa",
            "score": 3,
            "created_utc": 1640455270.0,
            "replies": [
                {
                    "body": "This is exactly it. I feel like this offer would be way more enticing for a woman in the middle of nowhere midwest (which is literally everywhere in the midwest BUT chicago). I’m certainly not hating on women who want to experience these kinds of things if thats what they’re looking for, clearly theres a market for it with SDs but offering that to a woman who lives in a big city and frequently gets asked out by men in her own age bracket making $100k+ just…doesnt make sense??",
                    "author": "delidoll",
                    "id": "hpyafjp",
                    "parent_id": "t1_hpxqllk",
                    "score": 2,
                    "created_utc": 1640465687.0,
                    "replies": [
                        {
                            "body": "It also depends on age / attraction level / etc.   \n\n\nIf George Clooney (pick the attractive famous older gent you prefer) invited you to NYC for an \"experience\" weekend you \\*might\\* say yes!  \n\n\nFor me the vanilla / sugar sliding scale is really variable.  For my first few yrs of sugar dating I was almost exclusively an experience SD and ended up conventionally dating a non-trivial % of my SBs.    \n\n\nAs I've gotten older this % has gone down and the proportion of allowance-focused arrangements has gone up b/c: 1) I'm worth more/my time is more valuable 2) I'm less attractive (older)",
                            "author": "Raven_runner",
                            "id": "hpybd0p",
                            "parent_id": "t1_hpyafjp",
                            "score": 1,
                            "created_utc": 1640466170.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was just throwing it out there. Truth be told NY is the best city to sugar and vanilla date bar none. There are options every where. Why would I want to fly someone out of town is beyond me. That in itself should be a major red flag.",
            "author": null,
            "id": "hpufzcb",
            "parent_id": "t3_rnrywa",
            "score": 7,
            "created_utc": 1640377356.0,
            "replies": []
        },
        {
            "body": "Most SD's are cheap fu\\*\\*s (who are really just Johns), and tire-kickers. It's common in the bowl.\n\nBlock and move on.",
            "author": "Nomad_Bill",
            "id": "hpu836d",
            "parent_id": "t3_rnrywa",
            "score": 13,
            "created_utc": 1640373598.0,
            "replies": []
        },
        {
            "body": "Was this a first date? Or had you already seen each other and agreed on an allowance? That doesn't change the issues with what he wanted, but it is a crazy proposition if you haven't even met \n\nNot surprising either. It's okay, imo, for him to ask for this, if not totally reasonable or considerate. But when he attacked you for telling him what you wanted he crossed a line for me into asshole. After all, if he can tell you what he wants, why can't you do the same?",
            "author": "ziggy440",
            "id": "hpu3al3",
            "parent_id": "t3_rnrywa",
            "score": 3,
            "created_utc": 1640371346.0,
            "replies": []
        },
        {
            "body": "I took a SB to NY once over a three-day weekend. Business class. We stayed at a luxury hotel on the edge of Central Park and ate dinner every night at Michelin Starred restaurants, three of which are a stone's throw away from that hotel. We walked in the park, we saw some shows, strolled a museum and she did some serious shopping at Saks 5th Ave and some other nearby stores.   \n\n\nHowever, there was no PPM on top of any of that. Or allowance. Not sure the shopping counts... I wouldn't count it as it's something I offer always \"on top\" of everything else, even if everything else is zero.    \n\n\nI guess I took advantage of her.  \n\n\nFWIW, she and I are no longer together, though we keep in touch as she is now engaged... you know, a \"real\" relationship. And she often brings this trip up as one of the greatest experiences of her life, and to some extent acknowledging that it'll be many years, if ever, that she gets to experience something like that again. She's engaged to a very nice guy, but they're just starting out.   \n\n\nDon't totally slag the \"experience daddies\", nor some of the women on here who would in no way consider what I described as being taken advantage of. Different people are after different things.",
            "author": "SD_throwaway222",
            "id": "hpuv0s0",
            "parent_id": "t3_rnrywa",
            "score": 3,
            "created_utc": 1640384810.0,
            "replies": [
                {
                    "body": "> ate dinner every night at Michelin Starred restaurants, three of which are a stone's throw away from that hotel. We walked in the park, we saw some shows, strolled a museum and she did some serious shopping at Saks 5th Ave and some other nearby stores.\n\nSeriously, that sounds like my idea of hell.  If I don't clean up my act I fully expect to be forced to watch shows on Broadway, visit museums, and go shopping in NY every day until the end of time.",
                    "author": "RTManson",
                    "id": "hpvnfu9",
                    "parent_id": "t1_hpuv0s0",
                    "score": 7,
                    "created_utc": 1640401472.0,
                    "replies": [
                        {
                            "body": "Good thing there are seven point eight billion people in the world, all of them with a different idea with respect to what life is all about!",
                            "author": "SD_throwaway222",
                            "id": "hpvox76",
                            "parent_id": "t1_hpvnfu9",
                            "score": 2,
                            "created_utc": 1640402409.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My BF who’s a similar age to me offers this kind of ‘experience’, not sure why would I sign up for this with a man double my age. This is very vanilla to me. A real man, a good BF offers such experiences by default. It’s not a SD. SD offers you financial freedom to not have to worry about bills and daily expenses.",
                    "author": "whatifitdoescometrue",
                    "id": "hpv6aru",
                    "parent_id": "t1_hpuv0s0",
                    "score": 15,
                    "created_utc": 1640390863.0,
                    "replies": [
                        {
                            "body": "exactly. Like he just wants a hot young girl next to him while he does all these things he would regularly do. I dont really get why this is so controversial lmao.",
                            "author": "delidoll",
                            "id": "hpv8rga",
                            "parent_id": "t1_hpv6aru",
                            "score": 12,
                            "created_utc": 1640392296.0,
                            "replies": [
                                {
                                    "body": "I'll reply to this, and your message above -- though my reply just above this pretty much covers it. You never said you have a 'real' bf on the side providing all of these experiences \"for free\" -- of course that changes things. But for girls who aren't into the SR lifestyle exclusively for the money, but hope to experience something else -- well, that's all I was saying. Don't paint everyone with the same brush and assume if it doesn't work for you it's ridiculous. And attitude thinking nobody is after experiences, just money... is.... well, shall we simply call it \"shallow\" ?",
                                    "author": "SD_throwaway222",
                                    "id": "hpvas2e",
                                    "parent_id": "t1_hpv8rga",
                                    "score": -3,
                                    "created_utc": 1640393508.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Because not all SBs are also vanilla dating. Because not all SDs want vanilla relationships. The fact that you and OP also have vanilla relationships on the side kind of backs what I was saying; neither of you are the type that are after experiences if you already have \"real\" BFs that treat you to all of that. Accordingly, that being the case, of course all you're after from a SD is good old-fashioned hard cash, and therefore, none of what I suggested applies to you.   \n\n\nBut if you're not in it just for the money... if, in fact, you don't really need the money but are into it exclusively for the lifestyle... then, when a SB or whatever you want to call him spends $15k to treat you for a luxury weekend, you manage to appreciate the inherent value in the experience and don't feel ripped off that he's not throwing in a meaningless PPM on top of it.  \n\n\nYou're not even the OP and you're telling us all why the hell would you sign up for something like this? The degree of entitlement around here is reflective of what's happened to SA in general. You (as in OP and yourself) aren't that interested in a true SR... it seems like mOnEy is the starting point and end point for you. That's terrific; I'm so happy you've found both types of relationships (let's call them \"real\" and \"fake\") to suit your needs. But to act bewildered like this is the only thing anyone is looking for... lol... come on.",
                            "author": "SD_throwaway222",
                            "id": "hpvajvi",
                            "parent_id": "t1_hpv6aru",
                            "score": -4,
                            "created_utc": 1640393371.0,
                            "replies": [
                                {
                                    "body": "I respect your opinion and I genuinely do not mean to insult you or what you offer to SBs as at the end of the day we will all continue doing our thing but I do not see how these type of experiences correlate to SDs. This is vanilla BF type of thing, it’s not a mutual benefit. Shopping, luxury travel first class, fanciest hotels - that’s what a rich BF can offer, I mean I’m sorry I don’t understand how can you call yourself a SD and not a vanilla BF or FWB if all you offer is this. And don’t get me wrong, treating a woman to luxury is an amazing thing and generous of you, but this is not sugar. Sugar is there for me to invest in my business, my future, my hobbies. All the shopping in the world will not compare. The kind of things I do with allowance, - I don’t buy shoes, handbags, jewellery, - I invest it into my future, therefore, I agree to disagree but shopping and first class experience will not advance me or benefit me in any way, shape or form and I feel like that is the epitome of shallow. We’re in this lifetime for shallow reasons anyway, - one is for looks, the other is for money, so why pretend?",
                                    "author": "whatifitdoescometrue",
                                    "id": "hpwew57",
                                    "parent_id": "t1_hpvajvi",
                                    "score": 6,
                                    "created_utc": 1640421614.0,
                                    "replies": [
                                        {
                                            "body": "Two months ago, in turning down a proposal from some POT, you wrote this:   \n\n\n\"I was able to turn it down because I am in a position where I support myself and do not need the money...\"\n\n... which is perfectly fine, but it begs a few questions, the first one being: If you're not here for the money, what are you here for? And all I am saying is that for a lot of women, possibly more than you might imagine, it's not all about the money... and \"experience\" is among those top other reasons, along with true mentoring and networking and a bunch of others.\n\nI was going to try to convince you that it's not all about money, but it seems you -- two months ago -- would've already been agreeing with me.\n\nMerry Xmas!",
                                            "author": "SD_throwaway222",
                                            "id": "hpygrgw",
                                            "parent_id": "t1_hpwew57",
                                            "score": 1,
                                            "created_utc": 1640468949.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you! \nI am extremely lucky to be in a position where I am not struggling but I am nowhere near where I’d like to be yet and I totally benefit from the extra money. When I had no money, an allowance provided by my SD allowed me to get a degree, to pay rent, etc. and that has changed my life. I am forever grateful to him. No amount of shopping or experiences could ever compare to that, and I am fortunate to have had many of those. If you truly want to make a positive impact on a young woman’s life, - cold hard cash might be the best bet. But I cannot speak for all so I will just leave it at that.",
                                                    "author": "whatifitdoescometrue",
                                                    "id": "hpyilpe",
                                                    "parent_id": "t1_hpygrgw",
                                                    "score": 3,
                                                    "created_utc": 1640469871.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I literally said “do your thing” why are you typing out a whole paragraph lol stick to your market and I’ll stick to mine its not that deep. happy holidays dude.",
                                    "author": "delidoll",
                                    "id": "hpve63k",
                                    "parent_id": "t1_hpvajvi",
                                    "score": 7,
                                    "created_utc": 1640395590.0,
                                    "replies": [
                                        {
                                            "body": "Happy Holidays 😊",
                                            "author": "SD_throwaway222",
                                            "id": "hpvosgx",
                                            "parent_id": "t1_hpve63k",
                                            "score": 0,
                                            "created_utc": 1640402326.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m not slagging experience daddies. Do your thing. But I have men in my vanilla dating life that do those things for me. My ex boyfriend is an investment banker who lives in Midtown. He would fly me from Chi to NYC almost every weekend. I’ve done those things before. I eat at Michelin star restaurants and regularly get gifts from the men I vanilla date that some SDs give their SBs (like shopping sprees). I’m not hating on women who get these things from SDs but its pretty clearly stated in my profile I’m not looking for material gifts/experiences. I probably should have stated that in the original post but. Yeah. I do have my reasons for feeling like this isnt a good deal.",
                    "author": "delidoll",
                    "id": "hpuy05f",
                    "parent_id": "t1_hpuv0s0",
                    "score": 14,
                    "created_utc": 1640386340.0,
                    "replies": [
                        {
                            "body": "You are completely right, I agree with you completely. These ‘experience’ I leave for vanilla men. These men are tripping.",
                            "author": "whatifitdoescometrue",
                            "id": "hpv6g5k",
                            "parent_id": "t1_hpuy05f",
                            "score": 6,
                            "created_utc": 1640390948.0,
                            "replies": []
                        },
                        {
                            "body": "Also what might be an amazing 15k vacation experience could quickly be soured by someone who really isn’t a good person to be around and then you’re stuck with a shitty person and a shitty experience for an extended amount of time. Or you have to foot the bill for your own room and flights home. \nAlso let’s be clear that a lot of experience SDs simply aren’t offering a 15k all expenses paid vacation or luxury trip to the Maldives. They’re offering a bare minimum trip. With zero thought for the SBs expenses. \nOf course if you’re in an established SR then by all means travel together. But it’s extremely strange when a guy you have never met before wants to fly you out to meet them and doesn’t want to compensate you at all. \nIt’s too high risk. Of course that’ll be expecting 24/7 intimacy on top of that as well x",
                            "author": "cccamilla775",
                            "id": "hpxzers",
                            "parent_id": "t1_hpuy05f",
                            "score": 1,
                            "created_utc": 1640460058.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "ppm/allowance is a thing of the past lets move forward and just sugar date by accommodating",
            "author": "doudaleus",
            "id": "hpvnn41",
            "parent_id": "t3_rnrywa",
            "score": 2,
            "created_utc": 1640401601.0,
            "replies": []
        },
        {
            "body": "I’m sure he’ll find takers. \n\nI’ve come across many SBs who would be happy to fly out to New York without an expectation of an allowance. \n\nI’ve never really done that since I can’t give them much time, and it’s just easier and costs less to meet someone local and offer them a PPM.\n\nAn all expense paid trip to NYC costs way more than a PPM, so someone offering that isn’t necessarily cheap.",
            "author": "geekxp",
            "id": "hpuv8b1",
            "parent_id": "t3_rnrywa",
            "score": 1,
            "created_utc": 1640384918.0,
            "replies": [
                {
                    "body": "You're right, of course, but it's an interesting reply thread above... many guys seems to get it, and many girls don't... like, if there isn't $$$$ $ $ $$$ $ $ $ $ $ to be had, obviously it's a complete waste of time. It's sad to see how the bowl is devolving to this, but just like I don't speak for all SDs who want nothing more than get laid for a PPM, the girls trashing this entire \"experience\" SR are also not speaking for everyone; just a narrow group whose primary focus is money, not experience. Nothing wrong with that; just makes sense to acknowledge that everyone, on both sides of the coin, may be looking for something different.",
                    "author": "SD_throwaway222",
                    "id": "hpvb15f",
                    "parent_id": "t1_hpuv8b1",
                    "score": 2,
                    "created_utc": 1640393663.0,
                    "replies": [
                        {
                            "body": "You’re right, it is a waste of time. Objectively.",
                            "author": "mariannacrosss",
                            "id": "hpvccoj",
                            "parent_id": "t1_hpvb15f",
                            "score": 1,
                            "created_utc": 1640394469.0,
                            "replies": [
                                {
                                    "body": "Time is money after all 🤷🏾‍♀️",
                                    "author": "lenaanabelle",
                                    "id": "hpwd4z7",
                                    "parent_id": "t1_hpvccoj",
                                    "score": 2,
                                    "created_utc": 1640420000.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> like, if there isn't $$$$ $ $ $$$ $ $ $ $ $ to be had, obviously it's a complete waste of time. It's sad to see how the bowl is devolving to this...\n\nNot a surprising outcome, TBH. This is just efficiency being squeezed out.",
                            "author": "bonafideSugar",
                            "id": "hpvdccz",
                            "parent_id": "t1_hpvb15f",
                            "score": 1,
                            "created_utc": 1640395081.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It’s an all expense paid trip where you have to hang out with a literal stranger and have sex with them and stay in their home . Would you do\nthat ??",
                    "author": "Disastrous_Author638",
                    "id": "hpxnniw",
                    "parent_id": "t1_hpuv8b1",
                    "score": 1,
                    "created_utc": 1640453801.0,
                    "replies": [
                        {
                            "body": "My idea is more like this..\n\nAll expense trip to one of the most desirable cities, you stay in a 4 or 5 start hotel by yourself and enjoy the Spa. We go out for one or two date nights at a nice restaurant / show / club and enjoy some intimate time. For the rest of the trip she’ll be by herself and do whatever she wants. \n\nI get a lot of messages from SBs asking me to fly them out to NYC. This can cost me 4-5k, so I wouldn’t do this for a stranger and I don’t know if we would even like each other. PPM is way cheaper and easier. \n\nI’ve done this for an ex-SB and she also brought her girlfriend for the New Year. They did not expect an allowance.",
                            "author": "geekxp",
                            "id": "hpxysnn",
                            "parent_id": "t1_hpxnniw",
                            "score": 0,
                            "created_utc": 1640459756.0,
                            "replies": [
                                {
                                    "body": "Ok cool you made up a random scenario",
                                    "author": "Disastrous_Author638",
                                    "id": "hpxzytb",
                                    "parent_id": "t1_hpxysnn",
                                    "score": 1,
                                    "created_utc": 1640460338.0,
                                    "replies": [
                                        {
                                            "body": "Sour 🍇",
                                            "author": "geekxp",
                                            "id": "hpy0x2k",
                                            "parent_id": "t1_hpxzytb",
                                            "score": 1,
                                            "created_utc": 1640460821.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It can be a turn on to fly a girl in from another city in a light dom/sub experience (She's alone, not nearby home or anyone she knows, not for everyone, but works well in trusted situations). The no allowance makes no sense, but just because nyc is a sugar oasis isn't a good reason to say no, maybe just more cautious.",
            "author": "sfillymnyc",
            "id": "hpvf0oj",
            "parent_id": "t3_rnrywa",
            "score": 1,
            "created_utc": 1640396128.0,
            "replies": [
                {
                    "body": "It’s more so a red flag because there isn’t a shortage of women to do this with in NYC. He could have “good” intentions, but as a New Yorker, the first thing I thought was either this is a scam or trafficking.",
                    "author": "lenaanabelle",
                    "id": "hpwdfjv",
                    "parent_id": "t1_hpvf0oj",
                    "score": 3,
                    "created_utc": 1640420273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this is why so many sbs wind up deleting the site",
            "author": "vtec__",
            "id": "hpvr3cs",
            "parent_id": "t3_rnrywa",
            "score": 1,
            "created_utc": 1640403756.0,
            "replies": []
        },
        {
            "body": "So... FWB without benefits. LOL.",
            "author": "chairman212121",
            "id": "hpxh4hd",
            "parent_id": "t3_rnrywa",
            "score": 1,
            "created_utc": 1640450490.0,
            "replies": []
        },
        {
            "body": "Yeah lmao Ive been called a sloot after they asked for a ppm in a hotel and I told them I dont do that LMAO. I called him a ugly  fat as... and called him the hoe. These guys are crazy",
            "author": "VExistence",
            "id": "hq47rzr",
            "parent_id": "t1_hpu763n",
            "score": 1,
            "created_utc": 1640584609.0,
            "replies": []
        },
        {
            "body": "This is part of why I think that if anyone is going to fly out it should be the sugar daddy.  A sugar baby flying out to meet a stranger runs the risk of running into a human trafficking scam.  Better to have the SD fly out to you.",
            "author": "RTManson",
            "id": "hpvn5df",
            "parent_id": "t1_hpuhho3",
            "score": 23,
            "created_utc": 1640401288.0,
            "replies": [
                {
                    "body": "Agreed. Home turf advantage is so important. This guy just sounds shady .. why spend so much money flying someone out, when he could find someone local. Makes no sense.",
                    "author": "vince539839",
                    "id": "hpwcm81",
                    "parent_id": "t1_hpvn5df",
                    "score": 6,
                    "created_utc": 1640419528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol\n\nI’m an experience SD who also pays PPM so I am the best of both worlds 😉",
            "author": "UnearthlyDinosaur",
            "id": "hpuesfn",
            "parent_id": "t1_hpu7vzn",
            "score": 8,
            "created_utc": 1640376782.0,
            "replies": [
                {
                    "body": "You are the real SD period. Not salt not Splenda (if you’re generous). Congrats.",
                    "author": "whatifitdoescometrue",
                    "id": "hpv5umr",
                    "parent_id": "t1_hpuesfn",
                    "score": 1,
                    "created_utc": 1640390610.0,
                    "replies": []
                },
                {
                    "body": "Absolutely!",
                    "author": "bonafideSugar",
                    "id": "hpuksmh",
                    "parent_id": "t1_hpuesfn",
                    "score": 1,
                    "created_utc": 1640379705.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which is called being cheap",
            "author": "Bbygirlxxxx",
            "id": "hpuo0pg",
            "parent_id": "t1_hpu7vzn",
            "score": 7,
            "created_utc": 1640381302.0,
            "replies": []
        },
        {
            "body": "You can actually find sugar daddies looking for platonic arrangements with issues such as ED Now I prefer ones that do involve intimacy but I have had platonic arrangements and often times these guys do offer more in terms of ppm and experiences than guys wanting Intimacy often offer. The highest ppm arrangement I ever received was from a guy who simply couldn’t get an erection through Severe ED snd we did try several times and he offered amazing experiences on top of that. The catch is often that these arrangements are short term only. Also a lot of sugar daddies are willing to offer some £££ for the meet and greet. I know this isn’t what most of the guys here on this forum want to believe or advocate but they are there.",
            "author": "cccamilla775",
            "id": "hpx5kqh",
            "parent_id": "t1_hpvmxig",
            "score": 3,
            "created_utc": 1640444072.0,
            "replies": []
        },
        {
            "body": "This is exactly it. I feel like this offer would be way more enticing for a woman in the middle of nowhere midwest (which is literally everywhere in the midwest BUT chicago). I’m certainly not hating on women who want to experience these kinds of things if thats what they’re looking for, clearly theres a market for it with SDs but offering that to a woman who lives in a big city and frequently gets asked out by men in her own age bracket making $100k+ just…doesnt make sense??",
            "author": "delidoll",
            "id": "hpyafjp",
            "parent_id": "t1_hpxqllk",
            "score": 2,
            "created_utc": 1640465687.0,
            "replies": [
                {
                    "body": "It also depends on age / attraction level / etc.   \n\n\nIf George Clooney (pick the attractive famous older gent you prefer) invited you to NYC for an \"experience\" weekend you \\*might\\* say yes!  \n\n\nFor me the vanilla / sugar sliding scale is really variable.  For my first few yrs of sugar dating I was almost exclusively an experience SD and ended up conventionally dating a non-trivial % of my SBs.    \n\n\nAs I've gotten older this % has gone down and the proportion of allowance-focused arrangements has gone up b/c: 1) I'm worth more/my time is more valuable 2) I'm less attractive (older)",
                    "author": "Raven_runner",
                    "id": "hpybd0p",
                    "parent_id": "t1_hpyafjp",
                    "score": 1,
                    "created_utc": 1640466170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> ate dinner every night at Michelin Starred restaurants, three of which are a stone's throw away from that hotel. We walked in the park, we saw some shows, strolled a museum and she did some serious shopping at Saks 5th Ave and some other nearby stores.\n\nSeriously, that sounds like my idea of hell.  If I don't clean up my act I fully expect to be forced to watch shows on Broadway, visit museums, and go shopping in NY every day until the end of time.",
            "author": "RTManson",
            "id": "hpvnfu9",
            "parent_id": "t1_hpuv0s0",
            "score": 7,
            "created_utc": 1640401472.0,
            "replies": [
                {
                    "body": "Good thing there are seven point eight billion people in the world, all of them with a different idea with respect to what life is all about!",
                    "author": "SD_throwaway222",
                    "id": "hpvox76",
                    "parent_id": "t1_hpvnfu9",
                    "score": 2,
                    "created_utc": 1640402409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My BF who’s a similar age to me offers this kind of ‘experience’, not sure why would I sign up for this with a man double my age. This is very vanilla to me. A real man, a good BF offers such experiences by default. It’s not a SD. SD offers you financial freedom to not have to worry about bills and daily expenses.",
            "author": "whatifitdoescometrue",
            "id": "hpv6aru",
            "parent_id": "t1_hpuv0s0",
            "score": 15,
            "created_utc": 1640390863.0,
            "replies": [
                {
                    "body": "exactly. Like he just wants a hot young girl next to him while he does all these things he would regularly do. I dont really get why this is so controversial lmao.",
                    "author": "delidoll",
                    "id": "hpv8rga",
                    "parent_id": "t1_hpv6aru",
                    "score": 12,
                    "created_utc": 1640392296.0,
                    "replies": [
                        {
                            "body": "I'll reply to this, and your message above -- though my reply just above this pretty much covers it. You never said you have a 'real' bf on the side providing all of these experiences \"for free\" -- of course that changes things. But for girls who aren't into the SR lifestyle exclusively for the money, but hope to experience something else -- well, that's all I was saying. Don't paint everyone with the same brush and assume if it doesn't work for you it's ridiculous. And attitude thinking nobody is after experiences, just money... is.... well, shall we simply call it \"shallow\" ?",
                            "author": "SD_throwaway222",
                            "id": "hpvas2e",
                            "parent_id": "t1_hpv8rga",
                            "score": -3,
                            "created_utc": 1640393508.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Because not all SBs are also vanilla dating. Because not all SDs want vanilla relationships. The fact that you and OP also have vanilla relationships on the side kind of backs what I was saying; neither of you are the type that are after experiences if you already have \"real\" BFs that treat you to all of that. Accordingly, that being the case, of course all you're after from a SD is good old-fashioned hard cash, and therefore, none of what I suggested applies to you.   \n\n\nBut if you're not in it just for the money... if, in fact, you don't really need the money but are into it exclusively for the lifestyle... then, when a SB or whatever you want to call him spends $15k to treat you for a luxury weekend, you manage to appreciate the inherent value in the experience and don't feel ripped off that he's not throwing in a meaningless PPM on top of it.  \n\n\nYou're not even the OP and you're telling us all why the hell would you sign up for something like this? The degree of entitlement around here is reflective of what's happened to SA in general. You (as in OP and yourself) aren't that interested in a true SR... it seems like mOnEy is the starting point and end point for you. That's terrific; I'm so happy you've found both types of relationships (let's call them \"real\" and \"fake\") to suit your needs. But to act bewildered like this is the only thing anyone is looking for... lol... come on.",
                    "author": "SD_throwaway222",
                    "id": "hpvajvi",
                    "parent_id": "t1_hpv6aru",
                    "score": -4,
                    "created_utc": 1640393371.0,
                    "replies": [
                        {
                            "body": "I respect your opinion and I genuinely do not mean to insult you or what you offer to SBs as at the end of the day we will all continue doing our thing but I do not see how these type of experiences correlate to SDs. This is vanilla BF type of thing, it’s not a mutual benefit. Shopping, luxury travel first class, fanciest hotels - that’s what a rich BF can offer, I mean I’m sorry I don’t understand how can you call yourself a SD and not a vanilla BF or FWB if all you offer is this. And don’t get me wrong, treating a woman to luxury is an amazing thing and generous of you, but this is not sugar. Sugar is there for me to invest in my business, my future, my hobbies. All the shopping in the world will not compare. The kind of things I do with allowance, - I don’t buy shoes, handbags, jewellery, - I invest it into my future, therefore, I agree to disagree but shopping and first class experience will not advance me or benefit me in any way, shape or form and I feel like that is the epitome of shallow. We’re in this lifetime for shallow reasons anyway, - one is for looks, the other is for money, so why pretend?",
                            "author": "whatifitdoescometrue",
                            "id": "hpwew57",
                            "parent_id": "t1_hpvajvi",
                            "score": 6,
                            "created_utc": 1640421614.0,
                            "replies": [
                                {
                                    "body": "Two months ago, in turning down a proposal from some POT, you wrote this:   \n\n\n\"I was able to turn it down because I am in a position where I support myself and do not need the money...\"\n\n... which is perfectly fine, but it begs a few questions, the first one being: If you're not here for the money, what are you here for? And all I am saying is that for a lot of women, possibly more than you might imagine, it's not all about the money... and \"experience\" is among those top other reasons, along with true mentoring and networking and a bunch of others.\n\nI was going to try to convince you that it's not all about money, but it seems you -- two months ago -- would've already been agreeing with me.\n\nMerry Xmas!",
                                    "author": "SD_throwaway222",
                                    "id": "hpygrgw",
                                    "parent_id": "t1_hpwew57",
                                    "score": 1,
                                    "created_utc": 1640468949.0,
                                    "replies": [
                                        {
                                            "body": "Thank you! \nI am extremely lucky to be in a position where I am not struggling but I am nowhere near where I’d like to be yet and I totally benefit from the extra money. When I had no money, an allowance provided by my SD allowed me to get a degree, to pay rent, etc. and that has changed my life. I am forever grateful to him. No amount of shopping or experiences could ever compare to that, and I am fortunate to have had many of those. If you truly want to make a positive impact on a young woman’s life, - cold hard cash might be the best bet. But I cannot speak for all so I will just leave it at that.",
                                            "author": "whatifitdoescometrue",
                                            "id": "hpyilpe",
                                            "parent_id": "t1_hpygrgw",
                                            "score": 3,
                                            "created_utc": 1640469871.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I literally said “do your thing” why are you typing out a whole paragraph lol stick to your market and I’ll stick to mine its not that deep. happy holidays dude.",
                            "author": "delidoll",
                            "id": "hpve63k",
                            "parent_id": "t1_hpvajvi",
                            "score": 7,
                            "created_utc": 1640395590.0,
                            "replies": [
                                {
                                    "body": "Happy Holidays 😊",
                                    "author": "SD_throwaway222",
                                    "id": "hpvosgx",
                                    "parent_id": "t1_hpve63k",
                                    "score": 0,
                                    "created_utc": 1640402326.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not slagging experience daddies. Do your thing. But I have men in my vanilla dating life that do those things for me. My ex boyfriend is an investment banker who lives in Midtown. He would fly me from Chi to NYC almost every weekend. I’ve done those things before. I eat at Michelin star restaurants and regularly get gifts from the men I vanilla date that some SDs give their SBs (like shopping sprees). I’m not hating on women who get these things from SDs but its pretty clearly stated in my profile I’m not looking for material gifts/experiences. I probably should have stated that in the original post but. Yeah. I do have my reasons for feeling like this isnt a good deal.",
            "author": "delidoll",
            "id": "hpuy05f",
            "parent_id": "t1_hpuv0s0",
            "score": 14,
            "created_utc": 1640386340.0,
            "replies": [
                {
                    "body": "You are completely right, I agree with you completely. These ‘experience’ I leave for vanilla men. These men are tripping.",
                    "author": "whatifitdoescometrue",
                    "id": "hpv6g5k",
                    "parent_id": "t1_hpuy05f",
                    "score": 6,
                    "created_utc": 1640390948.0,
                    "replies": []
                },
                {
                    "body": "Also what might be an amazing 15k vacation experience could quickly be soured by someone who really isn’t a good person to be around and then you’re stuck with a shitty person and a shitty experience for an extended amount of time. Or you have to foot the bill for your own room and flights home. \nAlso let’s be clear that a lot of experience SDs simply aren’t offering a 15k all expenses paid vacation or luxury trip to the Maldives. They’re offering a bare minimum trip. With zero thought for the SBs expenses. \nOf course if you’re in an established SR then by all means travel together. But it’s extremely strange when a guy you have never met before wants to fly you out to meet them and doesn’t want to compensate you at all. \nIt’s too high risk. Of course that’ll be expecting 24/7 intimacy on top of that as well x",
                    "author": "cccamilla775",
                    "id": "hpxzers",
                    "parent_id": "t1_hpuy05f",
                    "score": 1,
                    "created_utc": 1640460058.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right, of course, but it's an interesting reply thread above... many guys seems to get it, and many girls don't... like, if there isn't $$$$ $ $ $$$ $ $ $ $ $ to be had, obviously it's a complete waste of time. It's sad to see how the bowl is devolving to this, but just like I don't speak for all SDs who want nothing more than get laid for a PPM, the girls trashing this entire \"experience\" SR are also not speaking for everyone; just a narrow group whose primary focus is money, not experience. Nothing wrong with that; just makes sense to acknowledge that everyone, on both sides of the coin, may be looking for something different.",
            "author": "SD_throwaway222",
            "id": "hpvb15f",
            "parent_id": "t1_hpuv8b1",
            "score": 2,
            "created_utc": 1640393663.0,
            "replies": [
                {
                    "body": "You’re right, it is a waste of time. Objectively.",
                    "author": "mariannacrosss",
                    "id": "hpvccoj",
                    "parent_id": "t1_hpvb15f",
                    "score": 1,
                    "created_utc": 1640394469.0,
                    "replies": [
                        {
                            "body": "Time is money after all 🤷🏾‍♀️",
                            "author": "lenaanabelle",
                            "id": "hpwd4z7",
                            "parent_id": "t1_hpvccoj",
                            "score": 2,
                            "created_utc": 1640420000.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> like, if there isn't $$$$ $ $ $$$ $ $ $ $ $ to be had, obviously it's a complete waste of time. It's sad to see how the bowl is devolving to this...\n\nNot a surprising outcome, TBH. This is just efficiency being squeezed out.",
                    "author": "bonafideSugar",
                    "id": "hpvdccz",
                    "parent_id": "t1_hpvb15f",
                    "score": 1,
                    "created_utc": 1640395081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s an all expense paid trip where you have to hang out with a literal stranger and have sex with them and stay in their home . Would you do\nthat ??",
            "author": "Disastrous_Author638",
            "id": "hpxnniw",
            "parent_id": "t1_hpuv8b1",
            "score": 1,
            "created_utc": 1640453801.0,
            "replies": [
                {
                    "body": "My idea is more like this..\n\nAll expense trip to one of the most desirable cities, you stay in a 4 or 5 start hotel by yourself and enjoy the Spa. We go out for one or two date nights at a nice restaurant / show / club and enjoy some intimate time. For the rest of the trip she’ll be by herself and do whatever she wants. \n\nI get a lot of messages from SBs asking me to fly them out to NYC. This can cost me 4-5k, so I wouldn’t do this for a stranger and I don’t know if we would even like each other. PPM is way cheaper and easier. \n\nI’ve done this for an ex-SB and she also brought her girlfriend for the New Year. They did not expect an allowance.",
                    "author": "geekxp",
                    "id": "hpxysnn",
                    "parent_id": "t1_hpxnniw",
                    "score": 0,
                    "created_utc": 1640459756.0,
                    "replies": [
                        {
                            "body": "Ok cool you made up a random scenario",
                            "author": "Disastrous_Author638",
                            "id": "hpxzytb",
                            "parent_id": "t1_hpxysnn",
                            "score": 1,
                            "created_utc": 1640460338.0,
                            "replies": [
                                {
                                    "body": "Sour 🍇",
                                    "author": "geekxp",
                                    "id": "hpy0x2k",
                                    "parent_id": "t1_hpxzytb",
                                    "score": 1,
                                    "created_utc": 1640460821.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s more so a red flag because there isn’t a shortage of women to do this with in NYC. He could have “good” intentions, but as a New Yorker, the first thing I thought was either this is a scam or trafficking.",
            "author": "lenaanabelle",
            "id": "hpwdfjv",
            "parent_id": "t1_hpvf0oj",
            "score": 3,
            "created_utc": 1640420273.0,
            "replies": []
        },
        {
            "body": "Agreed. Home turf advantage is so important. This guy just sounds shady .. why spend so much money flying someone out, when he could find someone local. Makes no sense.",
            "author": "vince539839",
            "id": "hpwcm81",
            "parent_id": "t1_hpvn5df",
            "score": 6,
            "created_utc": 1640419528.0,
            "replies": []
        },
        {
            "body": "You are the real SD period. Not salt not Splenda (if you’re generous). Congrats.",
            "author": "whatifitdoescometrue",
            "id": "hpv5umr",
            "parent_id": "t1_hpuesfn",
            "score": 1,
            "created_utc": 1640390610.0,
            "replies": []
        },
        {
            "body": "Absolutely!",
            "author": "bonafideSugar",
            "id": "hpuksmh",
            "parent_id": "t1_hpuesfn",
            "score": 1,
            "created_utc": 1640379705.0,
            "replies": []
        },
        {
            "body": "It also depends on age / attraction level / etc.   \n\n\nIf George Clooney (pick the attractive famous older gent you prefer) invited you to NYC for an \"experience\" weekend you \\*might\\* say yes!  \n\n\nFor me the vanilla / sugar sliding scale is really variable.  For my first few yrs of sugar dating I was almost exclusively an experience SD and ended up conventionally dating a non-trivial % of my SBs.    \n\n\nAs I've gotten older this % has gone down and the proportion of allowance-focused arrangements has gone up b/c: 1) I'm worth more/my time is more valuable 2) I'm less attractive (older)",
            "author": "Raven_runner",
            "id": "hpybd0p",
            "parent_id": "t1_hpyafjp",
            "score": 1,
            "created_utc": 1640466170.0,
            "replies": []
        },
        {
            "body": "Good thing there are seven point eight billion people in the world, all of them with a different idea with respect to what life is all about!",
            "author": "SD_throwaway222",
            "id": "hpvox76",
            "parent_id": "t1_hpvnfu9",
            "score": 2,
            "created_utc": 1640402409.0,
            "replies": []
        },
        {
            "body": "exactly. Like he just wants a hot young girl next to him while he does all these things he would regularly do. I dont really get why this is so controversial lmao.",
            "author": "delidoll",
            "id": "hpv8rga",
            "parent_id": "t1_hpv6aru",
            "score": 12,
            "created_utc": 1640392296.0,
            "replies": [
                {
                    "body": "I'll reply to this, and your message above -- though my reply just above this pretty much covers it. You never said you have a 'real' bf on the side providing all of these experiences \"for free\" -- of course that changes things. But for girls who aren't into the SR lifestyle exclusively for the money, but hope to experience something else -- well, that's all I was saying. Don't paint everyone with the same brush and assume if it doesn't work for you it's ridiculous. And attitude thinking nobody is after experiences, just money... is.... well, shall we simply call it \"shallow\" ?",
                    "author": "SD_throwaway222",
                    "id": "hpvas2e",
                    "parent_id": "t1_hpv8rga",
                    "score": -3,
                    "created_utc": 1640393508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because not all SBs are also vanilla dating. Because not all SDs want vanilla relationships. The fact that you and OP also have vanilla relationships on the side kind of backs what I was saying; neither of you are the type that are after experiences if you already have \"real\" BFs that treat you to all of that. Accordingly, that being the case, of course all you're after from a SD is good old-fashioned hard cash, and therefore, none of what I suggested applies to you.   \n\n\nBut if you're not in it just for the money... if, in fact, you don't really need the money but are into it exclusively for the lifestyle... then, when a SB or whatever you want to call him spends $15k to treat you for a luxury weekend, you manage to appreciate the inherent value in the experience and don't feel ripped off that he's not throwing in a meaningless PPM on top of it.  \n\n\nYou're not even the OP and you're telling us all why the hell would you sign up for something like this? The degree of entitlement around here is reflective of what's happened to SA in general. You (as in OP and yourself) aren't that interested in a true SR... it seems like mOnEy is the starting point and end point for you. That's terrific; I'm so happy you've found both types of relationships (let's call them \"real\" and \"fake\") to suit your needs. But to act bewildered like this is the only thing anyone is looking for... lol... come on.",
            "author": "SD_throwaway222",
            "id": "hpvajvi",
            "parent_id": "t1_hpv6aru",
            "score": -4,
            "created_utc": 1640393371.0,
            "replies": [
                {
                    "body": "I respect your opinion and I genuinely do not mean to insult you or what you offer to SBs as at the end of the day we will all continue doing our thing but I do not see how these type of experiences correlate to SDs. This is vanilla BF type of thing, it’s not a mutual benefit. Shopping, luxury travel first class, fanciest hotels - that’s what a rich BF can offer, I mean I’m sorry I don’t understand how can you call yourself a SD and not a vanilla BF or FWB if all you offer is this. And don’t get me wrong, treating a woman to luxury is an amazing thing and generous of you, but this is not sugar. Sugar is there for me to invest in my business, my future, my hobbies. All the shopping in the world will not compare. The kind of things I do with allowance, - I don’t buy shoes, handbags, jewellery, - I invest it into my future, therefore, I agree to disagree but shopping and first class experience will not advance me or benefit me in any way, shape or form and I feel like that is the epitome of shallow. We’re in this lifetime for shallow reasons anyway, - one is for looks, the other is for money, so why pretend?",
                    "author": "whatifitdoescometrue",
                    "id": "hpwew57",
                    "parent_id": "t1_hpvajvi",
                    "score": 6,
                    "created_utc": 1640421614.0,
                    "replies": [
                        {
                            "body": "Two months ago, in turning down a proposal from some POT, you wrote this:   \n\n\n\"I was able to turn it down because I am in a position where I support myself and do not need the money...\"\n\n... which is perfectly fine, but it begs a few questions, the first one being: If you're not here for the money, what are you here for? And all I am saying is that for a lot of women, possibly more than you might imagine, it's not all about the money... and \"experience\" is among those top other reasons, along with true mentoring and networking and a bunch of others.\n\nI was going to try to convince you that it's not all about money, but it seems you -- two months ago -- would've already been agreeing with me.\n\nMerry Xmas!",
                            "author": "SD_throwaway222",
                            "id": "hpygrgw",
                            "parent_id": "t1_hpwew57",
                            "score": 1,
                            "created_utc": 1640468949.0,
                            "replies": [
                                {
                                    "body": "Thank you! \nI am extremely lucky to be in a position where I am not struggling but I am nowhere near where I’d like to be yet and I totally benefit from the extra money. When I had no money, an allowance provided by my SD allowed me to get a degree, to pay rent, etc. and that has changed my life. I am forever grateful to him. No amount of shopping or experiences could ever compare to that, and I am fortunate to have had many of those. If you truly want to make a positive impact on a young woman’s life, - cold hard cash might be the best bet. But I cannot speak for all so I will just leave it at that.",
                                    "author": "whatifitdoescometrue",
                                    "id": "hpyilpe",
                                    "parent_id": "t1_hpygrgw",
                                    "score": 3,
                                    "created_utc": 1640469871.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I literally said “do your thing” why are you typing out a whole paragraph lol stick to your market and I’ll stick to mine its not that deep. happy holidays dude.",
                    "author": "delidoll",
                    "id": "hpve63k",
                    "parent_id": "t1_hpvajvi",
                    "score": 7,
                    "created_utc": 1640395590.0,
                    "replies": [
                        {
                            "body": "Happy Holidays 😊",
                            "author": "SD_throwaway222",
                            "id": "hpvosgx",
                            "parent_id": "t1_hpve63k",
                            "score": 0,
                            "created_utc": 1640402326.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are completely right, I agree with you completely. These ‘experience’ I leave for vanilla men. These men are tripping.",
            "author": "whatifitdoescometrue",
            "id": "hpv6g5k",
            "parent_id": "t1_hpuy05f",
            "score": 6,
            "created_utc": 1640390948.0,
            "replies": []
        },
        {
            "body": "Also what might be an amazing 15k vacation experience could quickly be soured by someone who really isn’t a good person to be around and then you’re stuck with a shitty person and a shitty experience for an extended amount of time. Or you have to foot the bill for your own room and flights home. \nAlso let’s be clear that a lot of experience SDs simply aren’t offering a 15k all expenses paid vacation or luxury trip to the Maldives. They’re offering a bare minimum trip. With zero thought for the SBs expenses. \nOf course if you’re in an established SR then by all means travel together. But it’s extremely strange when a guy you have never met before wants to fly you out to meet them and doesn’t want to compensate you at all. \nIt’s too high risk. Of course that’ll be expecting 24/7 intimacy on top of that as well x",
            "author": "cccamilla775",
            "id": "hpxzers",
            "parent_id": "t1_hpuy05f",
            "score": 1,
            "created_utc": 1640460058.0,
            "replies": []
        },
        {
            "body": "You’re right, it is a waste of time. Objectively.",
            "author": "mariannacrosss",
            "id": "hpvccoj",
            "parent_id": "t1_hpvb15f",
            "score": 1,
            "created_utc": 1640394469.0,
            "replies": [
                {
                    "body": "Time is money after all 🤷🏾‍♀️",
                    "author": "lenaanabelle",
                    "id": "hpwd4z7",
                    "parent_id": "t1_hpvccoj",
                    "score": 2,
                    "created_utc": 1640420000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> like, if there isn't $$$$ $ $ $$$ $ $ $ $ $ to be had, obviously it's a complete waste of time. It's sad to see how the bowl is devolving to this...\n\nNot a surprising outcome, TBH. This is just efficiency being squeezed out.",
            "author": "bonafideSugar",
            "id": "hpvdccz",
            "parent_id": "t1_hpvb15f",
            "score": 1,
            "created_utc": 1640395081.0,
            "replies": []
        },
        {
            "body": "My idea is more like this..\n\nAll expense trip to one of the most desirable cities, you stay in a 4 or 5 start hotel by yourself and enjoy the Spa. We go out for one or two date nights at a nice restaurant / show / club and enjoy some intimate time. For the rest of the trip she’ll be by herself and do whatever she wants. \n\nI get a lot of messages from SBs asking me to fly them out to NYC. This can cost me 4-5k, so I wouldn’t do this for a stranger and I don’t know if we would even like each other. PPM is way cheaper and easier. \n\nI’ve done this for an ex-SB and she also brought her girlfriend for the New Year. They did not expect an allowance.",
            "author": "geekxp",
            "id": "hpxysnn",
            "parent_id": "t1_hpxnniw",
            "score": 0,
            "created_utc": 1640459756.0,
            "replies": [
                {
                    "body": "Ok cool you made up a random scenario",
                    "author": "Disastrous_Author638",
                    "id": "hpxzytb",
                    "parent_id": "t1_hpxysnn",
                    "score": 1,
                    "created_utc": 1640460338.0,
                    "replies": [
                        {
                            "body": "Sour 🍇",
                            "author": "geekxp",
                            "id": "hpy0x2k",
                            "parent_id": "t1_hpxzytb",
                            "score": 1,
                            "created_utc": 1640460821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'll reply to this, and your message above -- though my reply just above this pretty much covers it. You never said you have a 'real' bf on the side providing all of these experiences \"for free\" -- of course that changes things. But for girls who aren't into the SR lifestyle exclusively for the money, but hope to experience something else -- well, that's all I was saying. Don't paint everyone with the same brush and assume if it doesn't work for you it's ridiculous. And attitude thinking nobody is after experiences, just money... is.... well, shall we simply call it \"shallow\" ?",
            "author": "SD_throwaway222",
            "id": "hpvas2e",
            "parent_id": "t1_hpv8rga",
            "score": -3,
            "created_utc": 1640393508.0,
            "replies": []
        },
        {
            "body": "I respect your opinion and I genuinely do not mean to insult you or what you offer to SBs as at the end of the day we will all continue doing our thing but I do not see how these type of experiences correlate to SDs. This is vanilla BF type of thing, it’s not a mutual benefit. Shopping, luxury travel first class, fanciest hotels - that’s what a rich BF can offer, I mean I’m sorry I don’t understand how can you call yourself a SD and not a vanilla BF or FWB if all you offer is this. And don’t get me wrong, treating a woman to luxury is an amazing thing and generous of you, but this is not sugar. Sugar is there for me to invest in my business, my future, my hobbies. All the shopping in the world will not compare. The kind of things I do with allowance, - I don’t buy shoes, handbags, jewellery, - I invest it into my future, therefore, I agree to disagree but shopping and first class experience will not advance me or benefit me in any way, shape or form and I feel like that is the epitome of shallow. We’re in this lifetime for shallow reasons anyway, - one is for looks, the other is for money, so why pretend?",
            "author": "whatifitdoescometrue",
            "id": "hpwew57",
            "parent_id": "t1_hpvajvi",
            "score": 6,
            "created_utc": 1640421614.0,
            "replies": [
                {
                    "body": "Two months ago, in turning down a proposal from some POT, you wrote this:   \n\n\n\"I was able to turn it down because I am in a position where I support myself and do not need the money...\"\n\n... which is perfectly fine, but it begs a few questions, the first one being: If you're not here for the money, what are you here for? And all I am saying is that for a lot of women, possibly more than you might imagine, it's not all about the money... and \"experience\" is among those top other reasons, along with true mentoring and networking and a bunch of others.\n\nI was going to try to convince you that it's not all about money, but it seems you -- two months ago -- would've already been agreeing with me.\n\nMerry Xmas!",
                    "author": "SD_throwaway222",
                    "id": "hpygrgw",
                    "parent_id": "t1_hpwew57",
                    "score": 1,
                    "created_utc": 1640468949.0,
                    "replies": [
                        {
                            "body": "Thank you! \nI am extremely lucky to be in a position where I am not struggling but I am nowhere near where I’d like to be yet and I totally benefit from the extra money. When I had no money, an allowance provided by my SD allowed me to get a degree, to pay rent, etc. and that has changed my life. I am forever grateful to him. No amount of shopping or experiences could ever compare to that, and I am fortunate to have had many of those. If you truly want to make a positive impact on a young woman’s life, - cold hard cash might be the best bet. But I cannot speak for all so I will just leave it at that.",
                            "author": "whatifitdoescometrue",
                            "id": "hpyilpe",
                            "parent_id": "t1_hpygrgw",
                            "score": 3,
                            "created_utc": 1640469871.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I literally said “do your thing” why are you typing out a whole paragraph lol stick to your market and I’ll stick to mine its not that deep. happy holidays dude.",
            "author": "delidoll",
            "id": "hpve63k",
            "parent_id": "t1_hpvajvi",
            "score": 7,
            "created_utc": 1640395590.0,
            "replies": [
                {
                    "body": "Happy Holidays 😊",
                    "author": "SD_throwaway222",
                    "id": "hpvosgx",
                    "parent_id": "t1_hpve63k",
                    "score": 0,
                    "created_utc": 1640402326.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Time is money after all 🤷🏾‍♀️",
            "author": "lenaanabelle",
            "id": "hpwd4z7",
            "parent_id": "t1_hpvccoj",
            "score": 2,
            "created_utc": 1640420000.0,
            "replies": []
        },
        {
            "body": "Ok cool you made up a random scenario",
            "author": "Disastrous_Author638",
            "id": "hpxzytb",
            "parent_id": "t1_hpxysnn",
            "score": 1,
            "created_utc": 1640460338.0,
            "replies": [
                {
                    "body": "Sour 🍇",
                    "author": "geekxp",
                    "id": "hpy0x2k",
                    "parent_id": "t1_hpxzytb",
                    "score": 1,
                    "created_utc": 1640460821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Two months ago, in turning down a proposal from some POT, you wrote this:   \n\n\n\"I was able to turn it down because I am in a position where I support myself and do not need the money...\"\n\n... which is perfectly fine, but it begs a few questions, the first one being: If you're not here for the money, what are you here for? And all I am saying is that for a lot of women, possibly more than you might imagine, it's not all about the money... and \"experience\" is among those top other reasons, along with true mentoring and networking and a bunch of others.\n\nI was going to try to convince you that it's not all about money, but it seems you -- two months ago -- would've already been agreeing with me.\n\nMerry Xmas!",
            "author": "SD_throwaway222",
            "id": "hpygrgw",
            "parent_id": "t1_hpwew57",
            "score": 1,
            "created_utc": 1640468949.0,
            "replies": [
                {
                    "body": "Thank you! \nI am extremely lucky to be in a position where I am not struggling but I am nowhere near where I’d like to be yet and I totally benefit from the extra money. When I had no money, an allowance provided by my SD allowed me to get a degree, to pay rent, etc. and that has changed my life. I am forever grateful to him. No amount of shopping or experiences could ever compare to that, and I am fortunate to have had many of those. If you truly want to make a positive impact on a young woman’s life, - cold hard cash might be the best bet. But I cannot speak for all so I will just leave it at that.",
                    "author": "whatifitdoescometrue",
                    "id": "hpyilpe",
                    "parent_id": "t1_hpygrgw",
                    "score": 3,
                    "created_utc": 1640469871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Happy Holidays 😊",
            "author": "SD_throwaway222",
            "id": "hpvosgx",
            "parent_id": "t1_hpve63k",
            "score": 0,
            "created_utc": 1640402326.0,
            "replies": []
        },
        {
            "body": "Sour 🍇",
            "author": "geekxp",
            "id": "hpy0x2k",
            "parent_id": "t1_hpxzytb",
            "score": 1,
            "created_utc": 1640460821.0,
            "replies": []
        },
        {
            "body": "Thank you! \nI am extremely lucky to be in a position where I am not struggling but I am nowhere near where I’d like to be yet and I totally benefit from the extra money. When I had no money, an allowance provided by my SD allowed me to get a degree, to pay rent, etc. and that has changed my life. I am forever grateful to him. No amount of shopping or experiences could ever compare to that, and I am fortunate to have had many of those. If you truly want to make a positive impact on a young woman’s life, - cold hard cash might be the best bet. But I cannot speak for all so I will just leave it at that.",
            "author": "whatifitdoescometrue",
            "id": "hpyilpe",
            "parent_id": "t1_hpygrgw",
            "score": 3,
            "created_utc": 1640469871.0,
            "replies": []
        }
    ]
}