{
    "title": "My current collection, got a product for almost every style.",
    "post_id": "awksjz",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/awksjz/my_current_collection_got_a_product_for_almost/",
    "author": "actstunt",
    "body": "",
    "url": "https://imgur.com/mqturAn.jpg",
    "score": 322,
    "upvote_ratio": 0.97,
    "created_utc": 1551552000.0,
    "num_comments": 46,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is my current collection. I like taking care of my hair and this sub helped me a lot (among other YouTube videos).\n\nI'll try to write a little review for each one of them.\n\nMy hair is thick, around 4 inches in front 2.5 on the back. I do the nopoo no conditioner method (I shampoo and condition my hair every sunday)\n\nMy main style is faded undercut, and I style it in quiffs, pompadours or slick back.\n\nAbout the products, first from left to right:\n\n1.-John Frieda Beach blonde sea salt water (I'm not blonde) it's a pretty good product to get texture on my hair, the smell is nice but it doesn't have much hold power, pretty cheap tho.\n\n2.-Blumaan original meraki: it´s a good prestyler (I always use it as a prestyler) it has good hold power but for my hair thickness and length I need to couple it with other products on this list.\n\n3.- Suavecito matte pomade: the first thin I want to say about this one is that it has a pretty good masculine smell, I've received compliments from other girls when wearing it. It has a nice matte finishing kinda like a clay but it's a water based pomade, it has strong hold, great for pomps.\n\n4.-Reuzel blue: it's a water based pomade, it has a pretty nice and sweet tobbaco smell, that lasts for a while when you apply it, it has a great hold, medium shine and it can last for all day with a small product application, ideal for slick back hairstyles with or without volume (think the infamous Brad Pitt fury hairstyle or the hairstyle Zack Effron wore on baywatch).\n\n5.-Hanz de fuko Claymation: one of the best clays in the market, it doesn't have any smell, but the texture you get is marvelous, easy to apply too.\n\n6.-You can't see it but below claymation is Quicksand: At first I didn't like it because it leaved my hair with a messy feeling, and without structure, but after experimenting a lot with my hair dryer and different products I nailed it. You got to apply it evenly on your dry hair and from there give it structure with your hand and fingers, rework after a few minutes and then the product sets itself.\n\n7.- The cotton like color bottle you see back there its called sugar rush, it's from a sephora wannabe called sally beauty, but what I liked about this is that it's a sugar spray that works similar to sea salt spray but it's less harsh on your hair, smells like candy too, great for messy hayrstiles coupled with a good wax.\n\n8.- Baracuda water based pomade - it's from Guadalajara Mexico but it's a great water based pomade, with medium shine and high hold, it's pretty expensive too! around 3 bucks.\n\n9.-Reuzel Green - oil based pomade, it has a good smell, kinda citrusy I need to apply a little bit more of product when I use it If I want it to hold my style all day, not much tho. I use it on formal ocasions with a good quiff or slicked back.\n\n10.- Back there is not your mother's sea salt spray: it's often recommended in here and I can see why, it has a pretty good hold even when used it alone, it smells pretty good and has good quantity for the price too.\n\n11.-Marula Oil: I told you that I use the nopoo method but  every day before taking a shower I comb my hair with a boar bristle  brush, and then I apply a few drops of this oil on my hair after shower.\n\n12.- Reuzel grooming tonic: it's a tonic that features heat protection and gives good volume to my hair, it smells like an old cologne and has good hold on its own, I use it when I don't want to use bluuman original meraki, both are great.\n\n13.- Cavalier by blumaan: it's a hard clay gives great texture to my hair, but the only draw back is that even after emulsifing it it's pretty hard to apply on my hair, I always end with individual hairs on my hand, has great duration too, sometimes too much imo. I prefer HDF claymation.\n\n14.- The last product I bought,  layrite super hold pomade, it's water based has great hold that lasts all day and what I loved more from this one was its smell, it's kinda like a soda, smells great and lasts all day! Seriously yesterday when I was preparing to sleep I could still smell it, maybe if you don't like the smeel this'll be a drawback.\n\nAnd that's all, I wanted to share it with you, if you have any more questions I'll answer them gladly.\n",
            "author": "actstunt",
            "id": "ehn7cz0",
            "parent_id": "t3_awksjz",
            "score": 33,
            "created_utc": 1551552070.0,
            "replies": [
                {
                    "body": "Would you recommend someone who uses Cavalier Clay right now try Claymation and/or Quicksand?",
                    "author": "Nexavus",
                    "id": "ehneuok",
                    "parent_id": "t1_ehn7cz0",
                    "score": 7,
                    "created_utc": 1551557574.0,
                    "replies": [
                        {
                            "body": "I like claymation more than cavalier, the texture and separation is better imo, the only department cavalier wins is in the duration.\n\nAbout quicksand I think it depends on the texture you like, it's more than matte and the finishing it gives is similar to using sea salt spray, leaves your hair dry and coarse but if you apply and style it correctly you get a pretty nice texture ",
                            "author": "actstunt",
                            "id": "ehnfr8p",
                            "parent_id": "t1_ehneuok",
                            "score": 4,
                            "created_utc": 1551558265.0,
                            "replies": [
                                {
                                    "body": "I currently use sea salt spray on towel dried hair and cavalier clay on blow dried hair. Would you recommend styling differently?",
                                    "author": "Nexavus",
                                    "id": "ehnfx2v",
                                    "parent_id": "t1_ehnfr8p",
                                    "score": 3,
                                    "created_utc": 1551558391.0,
                                    "replies": [
                                        {
                                            "body": "Nah, the first one coupled with a good wb pomade is my go-to method in spring and summer.",
                                            "author": "actstunt",
                                            "id": "ehngjop",
                                            "parent_id": "t1_ehnfx2v",
                                            "score": 2,
                                            "created_utc": 1551558859.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "For me claymation leaves a bit pf shine making my hair look a bit greasy. Is it the same for you?",
                                    "author": "Terramine1240",
                                    "id": "ehowz12",
                                    "parent_id": "t1_ehnfr8p",
                                    "score": 1,
                                    "created_utc": 1551608815.0,
                                    "replies": [
                                        {
                                            "body": "I've got no problem with the shine, it's semi matte, maybe you're using too much product? Quick sand will give you a totally matte look but it's not so good on wild hair.",
                                            "author": "actstunt",
                                            "id": "ehpbpo0",
                                            "parent_id": "t1_ehowz12",
                                            "score": 1,
                                            "created_utc": 1551627709.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehnjt8b",
                    "parent_id": "t1_ehn7cz0",
                    "score": 2,
                    "created_utc": 1551561387.0,
                    "replies": [
                        {
                            "body": "After shower I gently pat my hair with a towel to dry it, then I emulsify a little bit of original by blumaan and apply it on the dampened hair. Then proceed to blow dry and finish my style with any other pomade or clay or you could repeat blumaan. \n\nIt's supposed to have heat resistant properties.",
                            "author": "actstunt",
                            "id": "ehnpfl6",
                            "parent_id": "t1_ehnjt8b",
                            "score": 3,
                            "created_utc": 1551565630.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehnwpkj",
                    "parent_id": "t1_ehn7cz0",
                    "score": 1,
                    "created_utc": 1551571499.0,
                    "replies": [
                        {
                            "body": "Nope, I shower daily on the morning, from Monday to Saturday I rinse wash my scalp with hot water and rinse it with cold water (the best method to wake up quickly) then on Sunday I wash my hair with argan shampoo and conditioner. Every three days I use the marula oil after shower and twice a month I use a hask (hair mask) of coconut oil.",
                            "author": "actstunt",
                            "id": "eho31my",
                            "parent_id": "t1_ehnwpkj",
                            "score": 3,
                            "created_utc": 1551576677.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think Original by BluMaan isn't that good. It rips my hair out and is hard to apply. Claymation > Cavalier too. Have you tried Pete and Pedro? What about Original as a post-styler?",
                    "author": "Brenan008",
                    "id": "ejd3ykx",
                    "parent_id": "t1_ehn7cz0",
                    "score": 1,
                    "created_utc": 1553544467.0,
                    "replies": [
                        {
                            "body": "3 weeks ago I made that post, and since then and two haircuts later I can attest that reuzel grooming tonic + red/blue/green/pink is my new go-to combo. And yes sir you're so right, today I used grooming tonic+original by bluuman and my the finishing in my hair felt like gel, I think is not so great after RGT. Also claymation>than almost anything.\n\nSadly Pete and Pedro doesn't deliver to Mexico but it's a product id like to test.",
                            "author": "actstunt",
                            "id": "eje1692",
                            "parent_id": "t1_ejd3ykx",
                            "score": 1,
                            "created_utc": 1553567648.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reuzel is great stuff!",
            "author": "hbs2018",
            "id": "ehngzz7",
            "parent_id": "t3_awksjz",
            "score": 7,
            "created_utc": 1551559207.0,
            "replies": [
                {
                    "body": "I second this!\n\nIf you're looking for a pomade that holds **all day** Reuzel Pink is the best. Been using it for two years now.",
                    "author": "adamsmith93",
                    "id": "eho0h8c",
                    "parent_id": "t1_ehngzz7",
                    "score": 2,
                    "created_utc": 1551574633.0,
                    "replies": [
                        {
                            "body": "Personally a red fan but all of the products are great! ",
                            "author": "hbs2018",
                            "id": "eho0lb3",
                            "parent_id": "t1_eho0h8c",
                            "score": 2,
                            "created_utc": 1551574726.0,
                            "replies": [
                                {
                                    "body": "Just looked it up. \"High Sheen\". What does that do for you hair?\n\nEdit: I'm pretty sure it means high shine.",
                                    "author": "adamsmith93",
                                    "id": "ehoam8u",
                                    "parent_id": "t1_eho0lb3",
                                    "score": 2,
                                    "created_utc": 1551582966.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehnkjvy",
            "parent_id": "t3_awksjz",
            "score": 2,
            "created_utc": 1551561936.0,
            "replies": [
                {
                    "body": "Which one did you use? Do you apply it with dry or wet hair? I usually apply to lock my style after blow drying, just dampen my hair with a little bit of water from a spray bottle, a little bit just to apply my favourite pomade, then comb it with my hands or a comb and I'm ready to go.",
                    "author": "actstunt",
                    "id": "ehnp9lo",
                    "parent_id": "t1_ehnkjvy",
                    "score": 2,
                    "created_utc": 1551565502.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ehnutrc",
                            "parent_id": "t1_ehnp9lo",
                            "score": 1,
                            "created_utc": 1551569935.0,
                            "replies": [
                                {
                                    "body": "When I towel dry and my hair is still moist I got problems to get good hold. I completely dry my hair with a blowdrier and two or three spitz of water are enough to allow me to distribute pomades or clays on my hair.\n\nEven in the product description of layrite they say that you get the strongest hold on dry hair.\n\nAlso emulsify! ",
                                    "author": "actstunt",
                                    "id": "eho38pg",
                                    "parent_id": "t1_ehnutrc",
                                    "score": 3,
                                    "created_utc": 1551576834.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eho4c9n",
                                            "parent_id": "t1_eho38pg",
                                            "score": 1,
                                            "created_utc": 1551577735.0,
                                            "replies": [
                                                {
                                                    "body": "Reuzel grooming tonic is an excellent pre styler trust me and a bottle will last for months.\n\nI emulsify clays only for a little bit, 3 to 5 seconds when you feel the product hot in your hands it's the signal to spread it on your hair.\n\nI use a dab the size of a quarter or the top of mi index finger and if I need to be more precise when finishing my style I took a little bit of product on mi fingertips and apply it on the strands I want to arrange. Pretty easy.\n\nIf you got more questions feel free to ask! This is why I posted and I'm glad to help.\n\n",
                                                    "author": "actstunt",
                                                    "id": "eho6pv4",
                                                    "parent_id": "t1_eho4c9n",
                                                    "score": 3,
                                                    "created_utc": 1551579726.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Could you explain the use of the marula oil a bit more? I don't necessarily go no poo, but I use all sulfate free products - not opposed to trying no poo tho. You said in the post you use the oil after showering. How does the order of the oil usually go for you if you are using tonic/blumaan as prestyler on towel dried hair, blow drying, and then using pomade/clay?\n\nEdit: as I'm reading up on the oil, it seems that it's recommended to wash the oil out after using. Have you experienced any negative effects from not washing it out?",
            "author": "Spardinal",
            "id": "ehohrd7",
            "parent_id": "t3_awksjz",
            "score": 2,
            "created_utc": 1551588789.0,
            "replies": [
                {
                    "body": "https://imgur.com/Qi6uDd1.jpg mines not pure marula oil I just followed the instructions on the bottle and so far I've got zero problems I just noticed that it leaves the hair a little more soft, what I do is apply it as the bottle says and comb it again with a boar bristle brush then I blow dry and apply my finishing product ",
                    "author": "actstunt",
                    "id": "ehpaqhv",
                    "parent_id": "t1_ehohrd7",
                    "score": 2,
                    "created_utc": 1551626858.0,
                    "replies": [
                        {
                            "body": "Okay, so on the days you use marula oil you don't prestyle then? I just bought some marula + tonic and gonna try using them. I normally shampoo/condition everyday. Then towel dry, blow dry, and use pomade. I've been dealing with white specks in my hair and can't figure out the cause (shampoo is natural anti dandruff). Hoping this oil + use of tonic helps. Also gonna cut back on washing hair to couple times a week.",
                            "author": "Spardinal",
                            "id": "ehq28a8",
                            "parent_id": "t1_ehpaqhv",
                            "score": 1,
                            "created_utc": 1551648111.0,
                            "replies": [
                                {
                                    "body": "Nope, I wait a few minutes and style my hair as always I have not any problems so far. It is adviced to wash and condition your hair less frequently, just use hot/cold water. Maybe that's the cause of the white specks you mention (I've also seen those when using gel).",
                                    "author": "actstunt",
                                    "id": "ehqdxx9",
                                    "parent_id": "t1_ehq28a8",
                                    "score": 1,
                                    "created_utc": 1551657154.0,
                                    "replies": [
                                        {
                                            "body": "Okay cool, thanks for the advice!",
                                            "author": "Spardinal",
                                            "id": "ehqelid",
                                            "parent_id": "t1_ehqdxx9",
                                            "score": 1,
                                            "created_utc": 1551657700.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nice collection!\n\nOut of all of those I've only tried Suavecito, which I enjoyed.",
            "author": "Gorgoleon",
            "id": "ehnfl4w",
            "parent_id": "t3_awksjz",
            "score": 2,
            "created_utc": 1551558137.0,
            "replies": [
                {
                    "body": "It's a pretty good brand, dunno why the hate sometimes in here.",
                    "author": "actstunt",
                    "id": "ehnp3a0",
                    "parent_id": "t1_ehnfl4w",
                    "score": 1,
                    "created_utc": 1551565365.0,
                    "replies": [
                        {
                            "body": "I don't know why either, but I too have seen the anti-pomade crew come swooping in whenever someone recommends it.\n\nI saw you post about looking for Uppercut and I'd recommend it. I like it's coconut smell better than Suavecito, had a good hold, and washed out instantly.",
                            "author": "Gorgoleon",
                            "id": "ehnynzu",
                            "parent_id": "t1_ehnp3a0",
                            "score": 1,
                            "created_utc": 1551573140.0,
                            "replies": [
                                {
                                    "body": "Thank you! Definitely gonna test it!",
                                    "author": "actstunt",
                                    "id": "eho337g",
                                    "parent_id": "t1_ehnynzu",
                                    "score": 1,
                                    "created_utc": 1551576712.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m a dapper dan man! ",
            "author": null,
            "id": "ehno1pz",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551564555.0,
            "replies": [
                {
                    "body": "It's on my wishlist among uper cut!",
                    "author": "actstunt",
                    "id": "ehnp1i3",
                    "parent_id": "t1_ehno1pz",
                    "score": 2,
                    "created_utc": 1551565326.0,
                    "replies": [
                        {
                            "body": "I hope it gets granted. ",
                            "author": null,
                            "id": "ehnprv8",
                            "parent_id": "t1_ehnp1i3",
                            "score": 1,
                            "created_utc": 1551565893.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used to use the green one, I liked it, but it the hold was just so, sticky? then I found a more cream one ,different brand, which gives my hair the shape and texture I like (kinda wet greasy and loose, but not hard holding or sticky). however the quality of this brand is bad, and it doesn't stay in long.  Do ya know if reuzel or any of those sound like what im talking about? Sticky hard hair is my worst enemy next only to my natural wiry dry hair. ",
            "author": "Juvenileplayboy",
            "id": "ehnrf3m",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551567191.0,
            "replies": [
                {
                    "body": "It's because is oil based, whenever I use an oil based pomade I even got trouble removing the excess product from my hands after applying. What you need is a water based pomade, reuzel blue or red are the wb ones and as you can see I can testify about the excelent performance of blue. Zero sticky feeling maximum performance, amazing smell.",
                    "author": "actstunt",
                    "id": "eho6cro",
                    "parent_id": "t1_ehnrf3m",
                    "score": 2,
                    "created_utc": 1551579418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awesome collection! \n\nYou're a lucky dude, my hair is extremely straight and thick, it grows straight up so it can only be tamed by the Reuzal Pink.",
            "author": "Iamnotacroom76",
            "id": "ehnvbfj",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551570344.0,
            "replies": []
        },
        {
            "body": "That is a nice collection.",
            "author": "Advicelol",
            "id": "ehnym94",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551573105.0,
            "replies": []
        },
        {
            "body": "I'm the same as you - I've tried maybe 75% of what's in the picture, half of which I bought, the other half barbers use on me.\n\n&#x200B;\n\nOf the lot, Suavecito is the only one that suits my spikey-stiff-when-short; flowy-when-long asian hair. The rest lose hold easily due to humidity or is disgustingly difficult to wash off.",
            "author": "lunarwolfspirit",
            "id": "ehnz18f",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551573433.0,
            "replies": []
        },
        {
            "body": "I always have trouble spreading Suavecito. I use the firm variation. Feels like it doesn’t spread as easily as other stuff I’ve used.",
            "author": "ajhinius",
            "id": "ehojbki",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551590146.0,
            "replies": []
        },
        {
            "body": "Thank you for this! I currently use Big Sexy Hair's Blow Dry Volumizing Gel as a pre styler but have been looking for alternatives. BSH works great but I literally can't find it anywhere other than Ulta.\n\nI think I'm gonna try  Blumaan Original Meraki",
            "author": "VintageJustice",
            "id": "ehom5nn",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551592820.0,
            "replies": []
        },
        {
            "body": "I'm in the awkward stages of growing my hair out. I've been using American Crew Fiber to get a high hold with a slick back look. I'm fine with my hair getting a little messy as the day goes on. My main issue is how much product I'm using to get the look, like a noticeable amount of the tub per day. It's a bit much. Any recommendations?",
            "author": "HardTea",
            "id": "ehot03k",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551602029.0,
            "replies": []
        },
        {
            "body": "I've always ended up with too many hair products and the oils go rancid :( ",
            "author": null,
            "id": "ehot232",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551602119.0,
            "replies": []
        },
        {
            "body": "Nice collection bro! Too bad you don't have Da'Dude products there. I really like their products. ",
            "author": "Kr4mS",
            "id": "ehp1fis",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551616251.0,
            "replies": [
                {
                    "body": "I haven't seen them mentioned before, I'll try to look'hem up.",
                    "author": "actstunt",
                    "id": "ehpblyb",
                    "parent_id": "t1_ehp1fis",
                    "score": 1,
                    "created_utc": 1551627623.0,
                    "replies": [
                        {
                            "body": "You definitely should, they have the best products out there and the most awesome customer service as well. Check them out! ",
                            "author": "Kr4mS",
                            "id": "ehtqmne",
                            "parent_id": "t1_ehpblyb",
                            "score": 1,
                            "created_utc": 1551769141.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lucky... It's so hard having these products in my country.",
            "author": "elias2tife",
            "id": "ehp6u1n",
            "parent_id": "t3_awksjz",
            "score": 1,
            "created_utc": 1551623130.0,
            "replies": [
                {
                    "body": "Where ere you from? I'm from Mexico and it's also too hard to get these products, sometimes they take 5 months to arrive that's why a bought a lot specially the hanz de fuko line, what amazes me is that they last a fricking lot. I've yet to finish a tin of claymation after almost 2 years (not daily use tho)",
                    "author": "actstunt",
                    "id": "ehp848m",
                    "parent_id": "t1_ehp6u1n",
                    "score": 1,
                    "created_utc": 1551624414.0,
                    "replies": [
                        {
                            "body": "Morocco...",
                            "author": "elias2tife",
                            "id": "ei0waip",
                            "parent_id": "t1_ehp848m",
                            "score": 1,
                            "created_utc": 1551994545.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Would you recommend someone who uses Cavalier Clay right now try Claymation and/or Quicksand?",
            "author": "Nexavus",
            "id": "ehneuok",
            "parent_id": "t1_ehn7cz0",
            "score": 7,
            "created_utc": 1551557574.0,
            "replies": [
                {
                    "body": "I like claymation more than cavalier, the texture and separation is better imo, the only department cavalier wins is in the duration.\n\nAbout quicksand I think it depends on the texture you like, it's more than matte and the finishing it gives is similar to using sea salt spray, leaves your hair dry and coarse but if you apply and style it correctly you get a pretty nice texture ",
                    "author": "actstunt",
                    "id": "ehnfr8p",
                    "parent_id": "t1_ehneuok",
                    "score": 4,
                    "created_utc": 1551558265.0,
                    "replies": [
                        {
                            "body": "I currently use sea salt spray on towel dried hair and cavalier clay on blow dried hair. Would you recommend styling differently?",
                            "author": "Nexavus",
                            "id": "ehnfx2v",
                            "parent_id": "t1_ehnfr8p",
                            "score": 3,
                            "created_utc": 1551558391.0,
                            "replies": [
                                {
                                    "body": "Nah, the first one coupled with a good wb pomade is my go-to method in spring and summer.",
                                    "author": "actstunt",
                                    "id": "ehngjop",
                                    "parent_id": "t1_ehnfx2v",
                                    "score": 2,
                                    "created_utc": 1551558859.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "For me claymation leaves a bit pf shine making my hair look a bit greasy. Is it the same for you?",
                            "author": "Terramine1240",
                            "id": "ehowz12",
                            "parent_id": "t1_ehnfr8p",
                            "score": 1,
                            "created_utc": 1551608815.0,
                            "replies": [
                                {
                                    "body": "I've got no problem with the shine, it's semi matte, maybe you're using too much product? Quick sand will give you a totally matte look but it's not so good on wild hair.",
                                    "author": "actstunt",
                                    "id": "ehpbpo0",
                                    "parent_id": "t1_ehowz12",
                                    "score": 1,
                                    "created_utc": 1551627709.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehnjt8b",
            "parent_id": "t1_ehn7cz0",
            "score": 2,
            "created_utc": 1551561387.0,
            "replies": [
                {
                    "body": "After shower I gently pat my hair with a towel to dry it, then I emulsify a little bit of original by blumaan and apply it on the dampened hair. Then proceed to blow dry and finish my style with any other pomade or clay or you could repeat blumaan. \n\nIt's supposed to have heat resistant properties.",
                    "author": "actstunt",
                    "id": "ehnpfl6",
                    "parent_id": "t1_ehnjt8b",
                    "score": 3,
                    "created_utc": 1551565630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehnwpkj",
            "parent_id": "t1_ehn7cz0",
            "score": 1,
            "created_utc": 1551571499.0,
            "replies": [
                {
                    "body": "Nope, I shower daily on the morning, from Monday to Saturday I rinse wash my scalp with hot water and rinse it with cold water (the best method to wake up quickly) then on Sunday I wash my hair with argan shampoo and conditioner. Every three days I use the marula oil after shower and twice a month I use a hask (hair mask) of coconut oil.",
                    "author": "actstunt",
                    "id": "eho31my",
                    "parent_id": "t1_ehnwpkj",
                    "score": 3,
                    "created_utc": 1551576677.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think Original by BluMaan isn't that good. It rips my hair out and is hard to apply. Claymation > Cavalier too. Have you tried Pete and Pedro? What about Original as a post-styler?",
            "author": "Brenan008",
            "id": "ejd3ykx",
            "parent_id": "t1_ehn7cz0",
            "score": 1,
            "created_utc": 1553544467.0,
            "replies": [
                {
                    "body": "3 weeks ago I made that post, and since then and two haircuts later I can attest that reuzel grooming tonic + red/blue/green/pink is my new go-to combo. And yes sir you're so right, today I used grooming tonic+original by bluuman and my the finishing in my hair felt like gel, I think is not so great after RGT. Also claymation>than almost anything.\n\nSadly Pete and Pedro doesn't deliver to Mexico but it's a product id like to test.",
                    "author": "actstunt",
                    "id": "eje1692",
                    "parent_id": "t1_ejd3ykx",
                    "score": 1,
                    "created_utc": 1553567648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I second this!\n\nIf you're looking for a pomade that holds **all day** Reuzel Pink is the best. Been using it for two years now.",
            "author": "adamsmith93",
            "id": "eho0h8c",
            "parent_id": "t1_ehngzz7",
            "score": 2,
            "created_utc": 1551574633.0,
            "replies": [
                {
                    "body": "Personally a red fan but all of the products are great! ",
                    "author": "hbs2018",
                    "id": "eho0lb3",
                    "parent_id": "t1_eho0h8c",
                    "score": 2,
                    "created_utc": 1551574726.0,
                    "replies": [
                        {
                            "body": "Just looked it up. \"High Sheen\". What does that do for you hair?\n\nEdit: I'm pretty sure it means high shine.",
                            "author": "adamsmith93",
                            "id": "ehoam8u",
                            "parent_id": "t1_eho0lb3",
                            "score": 2,
                            "created_utc": 1551582966.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which one did you use? Do you apply it with dry or wet hair? I usually apply to lock my style after blow drying, just dampen my hair with a little bit of water from a spray bottle, a little bit just to apply my favourite pomade, then comb it with my hands or a comb and I'm ready to go.",
            "author": "actstunt",
            "id": "ehnp9lo",
            "parent_id": "t1_ehnkjvy",
            "score": 2,
            "created_utc": 1551565502.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehnutrc",
                    "parent_id": "t1_ehnp9lo",
                    "score": 1,
                    "created_utc": 1551569935.0,
                    "replies": [
                        {
                            "body": "When I towel dry and my hair is still moist I got problems to get good hold. I completely dry my hair with a blowdrier and two or three spitz of water are enough to allow me to distribute pomades or clays on my hair.\n\nEven in the product description of layrite they say that you get the strongest hold on dry hair.\n\nAlso emulsify! ",
                            "author": "actstunt",
                            "id": "eho38pg",
                            "parent_id": "t1_ehnutrc",
                            "score": 3,
                            "created_utc": 1551576834.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eho4c9n",
                                    "parent_id": "t1_eho38pg",
                                    "score": 1,
                                    "created_utc": 1551577735.0,
                                    "replies": [
                                        {
                                            "body": "Reuzel grooming tonic is an excellent pre styler trust me and a bottle will last for months.\n\nI emulsify clays only for a little bit, 3 to 5 seconds when you feel the product hot in your hands it's the signal to spread it on your hair.\n\nI use a dab the size of a quarter or the top of mi index finger and if I need to be more precise when finishing my style I took a little bit of product on mi fingertips and apply it on the strands I want to arrange. Pretty easy.\n\nIf you got more questions feel free to ask! This is why I posted and I'm glad to help.\n\n",
                                            "author": "actstunt",
                                            "id": "eho6pv4",
                                            "parent_id": "t1_eho4c9n",
                                            "score": 3,
                                            "created_utc": 1551579726.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "https://imgur.com/Qi6uDd1.jpg mines not pure marula oil I just followed the instructions on the bottle and so far I've got zero problems I just noticed that it leaves the hair a little more soft, what I do is apply it as the bottle says and comb it again with a boar bristle brush then I blow dry and apply my finishing product ",
            "author": "actstunt",
            "id": "ehpaqhv",
            "parent_id": "t1_ehohrd7",
            "score": 2,
            "created_utc": 1551626858.0,
            "replies": [
                {
                    "body": "Okay, so on the days you use marula oil you don't prestyle then? I just bought some marula + tonic and gonna try using them. I normally shampoo/condition everyday. Then towel dry, blow dry, and use pomade. I've been dealing with white specks in my hair and can't figure out the cause (shampoo is natural anti dandruff). Hoping this oil + use of tonic helps. Also gonna cut back on washing hair to couple times a week.",
                    "author": "Spardinal",
                    "id": "ehq28a8",
                    "parent_id": "t1_ehpaqhv",
                    "score": 1,
                    "created_utc": 1551648111.0,
                    "replies": [
                        {
                            "body": "Nope, I wait a few minutes and style my hair as always I have not any problems so far. It is adviced to wash and condition your hair less frequently, just use hot/cold water. Maybe that's the cause of the white specks you mention (I've also seen those when using gel).",
                            "author": "actstunt",
                            "id": "ehqdxx9",
                            "parent_id": "t1_ehq28a8",
                            "score": 1,
                            "created_utc": 1551657154.0,
                            "replies": [
                                {
                                    "body": "Okay cool, thanks for the advice!",
                                    "author": "Spardinal",
                                    "id": "ehqelid",
                                    "parent_id": "t1_ehqdxx9",
                                    "score": 1,
                                    "created_utc": 1551657700.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's a pretty good brand, dunno why the hate sometimes in here.",
            "author": "actstunt",
            "id": "ehnp3a0",
            "parent_id": "t1_ehnfl4w",
            "score": 1,
            "created_utc": 1551565365.0,
            "replies": [
                {
                    "body": "I don't know why either, but I too have seen the anti-pomade crew come swooping in whenever someone recommends it.\n\nI saw you post about looking for Uppercut and I'd recommend it. I like it's coconut smell better than Suavecito, had a good hold, and washed out instantly.",
                    "author": "Gorgoleon",
                    "id": "ehnynzu",
                    "parent_id": "t1_ehnp3a0",
                    "score": 1,
                    "created_utc": 1551573140.0,
                    "replies": [
                        {
                            "body": "Thank you! Definitely gonna test it!",
                            "author": "actstunt",
                            "id": "eho337g",
                            "parent_id": "t1_ehnynzu",
                            "score": 1,
                            "created_utc": 1551576712.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's on my wishlist among uper cut!",
            "author": "actstunt",
            "id": "ehnp1i3",
            "parent_id": "t1_ehno1pz",
            "score": 2,
            "created_utc": 1551565326.0,
            "replies": [
                {
                    "body": "I hope it gets granted. ",
                    "author": null,
                    "id": "ehnprv8",
                    "parent_id": "t1_ehnp1i3",
                    "score": 1,
                    "created_utc": 1551565893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's because is oil based, whenever I use an oil based pomade I even got trouble removing the excess product from my hands after applying. What you need is a water based pomade, reuzel blue or red are the wb ones and as you can see I can testify about the excelent performance of blue. Zero sticky feeling maximum performance, amazing smell.",
            "author": "actstunt",
            "id": "eho6cro",
            "parent_id": "t1_ehnrf3m",
            "score": 2,
            "created_utc": 1551579418.0,
            "replies": []
        },
        {
            "body": "I haven't seen them mentioned before, I'll try to look'hem up.",
            "author": "actstunt",
            "id": "ehpblyb",
            "parent_id": "t1_ehp1fis",
            "score": 1,
            "created_utc": 1551627623.0,
            "replies": [
                {
                    "body": "You definitely should, they have the best products out there and the most awesome customer service as well. Check them out! ",
                    "author": "Kr4mS",
                    "id": "ehtqmne",
                    "parent_id": "t1_ehpblyb",
                    "score": 1,
                    "created_utc": 1551769141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where ere you from? I'm from Mexico and it's also too hard to get these products, sometimes they take 5 months to arrive that's why a bought a lot specially the hanz de fuko line, what amazes me is that they last a fricking lot. I've yet to finish a tin of claymation after almost 2 years (not daily use tho)",
            "author": "actstunt",
            "id": "ehp848m",
            "parent_id": "t1_ehp6u1n",
            "score": 1,
            "created_utc": 1551624414.0,
            "replies": [
                {
                    "body": "Morocco...",
                    "author": "elias2tife",
                    "id": "ei0waip",
                    "parent_id": "t1_ehp848m",
                    "score": 1,
                    "created_utc": 1551994545.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like claymation more than cavalier, the texture and separation is better imo, the only department cavalier wins is in the duration.\n\nAbout quicksand I think it depends on the texture you like, it's more than matte and the finishing it gives is similar to using sea salt spray, leaves your hair dry and coarse but if you apply and style it correctly you get a pretty nice texture ",
            "author": "actstunt",
            "id": "ehnfr8p",
            "parent_id": "t1_ehneuok",
            "score": 4,
            "created_utc": 1551558265.0,
            "replies": [
                {
                    "body": "I currently use sea salt spray on towel dried hair and cavalier clay on blow dried hair. Would you recommend styling differently?",
                    "author": "Nexavus",
                    "id": "ehnfx2v",
                    "parent_id": "t1_ehnfr8p",
                    "score": 3,
                    "created_utc": 1551558391.0,
                    "replies": [
                        {
                            "body": "Nah, the first one coupled with a good wb pomade is my go-to method in spring and summer.",
                            "author": "actstunt",
                            "id": "ehngjop",
                            "parent_id": "t1_ehnfx2v",
                            "score": 2,
                            "created_utc": 1551558859.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "For me claymation leaves a bit pf shine making my hair look a bit greasy. Is it the same for you?",
                    "author": "Terramine1240",
                    "id": "ehowz12",
                    "parent_id": "t1_ehnfr8p",
                    "score": 1,
                    "created_utc": 1551608815.0,
                    "replies": [
                        {
                            "body": "I've got no problem with the shine, it's semi matte, maybe you're using too much product? Quick sand will give you a totally matte look but it's not so good on wild hair.",
                            "author": "actstunt",
                            "id": "ehpbpo0",
                            "parent_id": "t1_ehowz12",
                            "score": 1,
                            "created_utc": 1551627709.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "After shower I gently pat my hair with a towel to dry it, then I emulsify a little bit of original by blumaan and apply it on the dampened hair. Then proceed to blow dry and finish my style with any other pomade or clay or you could repeat blumaan. \n\nIt's supposed to have heat resistant properties.",
            "author": "actstunt",
            "id": "ehnpfl6",
            "parent_id": "t1_ehnjt8b",
            "score": 3,
            "created_utc": 1551565630.0,
            "replies": []
        },
        {
            "body": "Nope, I shower daily on the morning, from Monday to Saturday I rinse wash my scalp with hot water and rinse it with cold water (the best method to wake up quickly) then on Sunday I wash my hair with argan shampoo and conditioner. Every three days I use the marula oil after shower and twice a month I use a hask (hair mask) of coconut oil.",
            "author": "actstunt",
            "id": "eho31my",
            "parent_id": "t1_ehnwpkj",
            "score": 3,
            "created_utc": 1551576677.0,
            "replies": []
        },
        {
            "body": "3 weeks ago I made that post, and since then and two haircuts later I can attest that reuzel grooming tonic + red/blue/green/pink is my new go-to combo. And yes sir you're so right, today I used grooming tonic+original by bluuman and my the finishing in my hair felt like gel, I think is not so great after RGT. Also claymation>than almost anything.\n\nSadly Pete and Pedro doesn't deliver to Mexico but it's a product id like to test.",
            "author": "actstunt",
            "id": "eje1692",
            "parent_id": "t1_ejd3ykx",
            "score": 1,
            "created_utc": 1553567648.0,
            "replies": []
        },
        {
            "body": "Personally a red fan but all of the products are great! ",
            "author": "hbs2018",
            "id": "eho0lb3",
            "parent_id": "t1_eho0h8c",
            "score": 2,
            "created_utc": 1551574726.0,
            "replies": [
                {
                    "body": "Just looked it up. \"High Sheen\". What does that do for you hair?\n\nEdit: I'm pretty sure it means high shine.",
                    "author": "adamsmith93",
                    "id": "ehoam8u",
                    "parent_id": "t1_eho0lb3",
                    "score": 2,
                    "created_utc": 1551582966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehnutrc",
            "parent_id": "t1_ehnp9lo",
            "score": 1,
            "created_utc": 1551569935.0,
            "replies": [
                {
                    "body": "When I towel dry and my hair is still moist I got problems to get good hold. I completely dry my hair with a blowdrier and two or three spitz of water are enough to allow me to distribute pomades or clays on my hair.\n\nEven in the product description of layrite they say that you get the strongest hold on dry hair.\n\nAlso emulsify! ",
                    "author": "actstunt",
                    "id": "eho38pg",
                    "parent_id": "t1_ehnutrc",
                    "score": 3,
                    "created_utc": 1551576834.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eho4c9n",
                            "parent_id": "t1_eho38pg",
                            "score": 1,
                            "created_utc": 1551577735.0,
                            "replies": [
                                {
                                    "body": "Reuzel grooming tonic is an excellent pre styler trust me and a bottle will last for months.\n\nI emulsify clays only for a little bit, 3 to 5 seconds when you feel the product hot in your hands it's the signal to spread it on your hair.\n\nI use a dab the size of a quarter or the top of mi index finger and if I need to be more precise when finishing my style I took a little bit of product on mi fingertips and apply it on the strands I want to arrange. Pretty easy.\n\nIf you got more questions feel free to ask! This is why I posted and I'm glad to help.\n\n",
                                    "author": "actstunt",
                                    "id": "eho6pv4",
                                    "parent_id": "t1_eho4c9n",
                                    "score": 3,
                                    "created_utc": 1551579726.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay, so on the days you use marula oil you don't prestyle then? I just bought some marula + tonic and gonna try using them. I normally shampoo/condition everyday. Then towel dry, blow dry, and use pomade. I've been dealing with white specks in my hair and can't figure out the cause (shampoo is natural anti dandruff). Hoping this oil + use of tonic helps. Also gonna cut back on washing hair to couple times a week.",
            "author": "Spardinal",
            "id": "ehq28a8",
            "parent_id": "t1_ehpaqhv",
            "score": 1,
            "created_utc": 1551648111.0,
            "replies": [
                {
                    "body": "Nope, I wait a few minutes and style my hair as always I have not any problems so far. It is adviced to wash and condition your hair less frequently, just use hot/cold water. Maybe that's the cause of the white specks you mention (I've also seen those when using gel).",
                    "author": "actstunt",
                    "id": "ehqdxx9",
                    "parent_id": "t1_ehq28a8",
                    "score": 1,
                    "created_utc": 1551657154.0,
                    "replies": [
                        {
                            "body": "Okay cool, thanks for the advice!",
                            "author": "Spardinal",
                            "id": "ehqelid",
                            "parent_id": "t1_ehqdxx9",
                            "score": 1,
                            "created_utc": 1551657700.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know why either, but I too have seen the anti-pomade crew come swooping in whenever someone recommends it.\n\nI saw you post about looking for Uppercut and I'd recommend it. I like it's coconut smell better than Suavecito, had a good hold, and washed out instantly.",
            "author": "Gorgoleon",
            "id": "ehnynzu",
            "parent_id": "t1_ehnp3a0",
            "score": 1,
            "created_utc": 1551573140.0,
            "replies": [
                {
                    "body": "Thank you! Definitely gonna test it!",
                    "author": "actstunt",
                    "id": "eho337g",
                    "parent_id": "t1_ehnynzu",
                    "score": 1,
                    "created_utc": 1551576712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope it gets granted. ",
            "author": null,
            "id": "ehnprv8",
            "parent_id": "t1_ehnp1i3",
            "score": 1,
            "created_utc": 1551565893.0,
            "replies": []
        },
        {
            "body": "You definitely should, they have the best products out there and the most awesome customer service as well. Check them out! ",
            "author": "Kr4mS",
            "id": "ehtqmne",
            "parent_id": "t1_ehpblyb",
            "score": 1,
            "created_utc": 1551769141.0,
            "replies": []
        },
        {
            "body": "Morocco...",
            "author": "elias2tife",
            "id": "ei0waip",
            "parent_id": "t1_ehp848m",
            "score": 1,
            "created_utc": 1551994545.0,
            "replies": []
        },
        {
            "body": "I currently use sea salt spray on towel dried hair and cavalier clay on blow dried hair. Would you recommend styling differently?",
            "author": "Nexavus",
            "id": "ehnfx2v",
            "parent_id": "t1_ehnfr8p",
            "score": 3,
            "created_utc": 1551558391.0,
            "replies": [
                {
                    "body": "Nah, the first one coupled with a good wb pomade is my go-to method in spring and summer.",
                    "author": "actstunt",
                    "id": "ehngjop",
                    "parent_id": "t1_ehnfx2v",
                    "score": 2,
                    "created_utc": 1551558859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For me claymation leaves a bit pf shine making my hair look a bit greasy. Is it the same for you?",
            "author": "Terramine1240",
            "id": "ehowz12",
            "parent_id": "t1_ehnfr8p",
            "score": 1,
            "created_utc": 1551608815.0,
            "replies": [
                {
                    "body": "I've got no problem with the shine, it's semi matte, maybe you're using too much product? Quick sand will give you a totally matte look but it's not so good on wild hair.",
                    "author": "actstunt",
                    "id": "ehpbpo0",
                    "parent_id": "t1_ehowz12",
                    "score": 1,
                    "created_utc": 1551627709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just looked it up. \"High Sheen\". What does that do for you hair?\n\nEdit: I'm pretty sure it means high shine.",
            "author": "adamsmith93",
            "id": "ehoam8u",
            "parent_id": "t1_eho0lb3",
            "score": 2,
            "created_utc": 1551582966.0,
            "replies": []
        },
        {
            "body": "When I towel dry and my hair is still moist I got problems to get good hold. I completely dry my hair with a blowdrier and two or three spitz of water are enough to allow me to distribute pomades or clays on my hair.\n\nEven in the product description of layrite they say that you get the strongest hold on dry hair.\n\nAlso emulsify! ",
            "author": "actstunt",
            "id": "eho38pg",
            "parent_id": "t1_ehnutrc",
            "score": 3,
            "created_utc": 1551576834.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eho4c9n",
                    "parent_id": "t1_eho38pg",
                    "score": 1,
                    "created_utc": 1551577735.0,
                    "replies": [
                        {
                            "body": "Reuzel grooming tonic is an excellent pre styler trust me and a bottle will last for months.\n\nI emulsify clays only for a little bit, 3 to 5 seconds when you feel the product hot in your hands it's the signal to spread it on your hair.\n\nI use a dab the size of a quarter or the top of mi index finger and if I need to be more precise when finishing my style I took a little bit of product on mi fingertips and apply it on the strands I want to arrange. Pretty easy.\n\nIf you got more questions feel free to ask! This is why I posted and I'm glad to help.\n\n",
                            "author": "actstunt",
                            "id": "eho6pv4",
                            "parent_id": "t1_eho4c9n",
                            "score": 3,
                            "created_utc": 1551579726.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope, I wait a few minutes and style my hair as always I have not any problems so far. It is adviced to wash and condition your hair less frequently, just use hot/cold water. Maybe that's the cause of the white specks you mention (I've also seen those when using gel).",
            "author": "actstunt",
            "id": "ehqdxx9",
            "parent_id": "t1_ehq28a8",
            "score": 1,
            "created_utc": 1551657154.0,
            "replies": [
                {
                    "body": "Okay cool, thanks for the advice!",
                    "author": "Spardinal",
                    "id": "ehqelid",
                    "parent_id": "t1_ehqdxx9",
                    "score": 1,
                    "created_utc": 1551657700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! Definitely gonna test it!",
            "author": "actstunt",
            "id": "eho337g",
            "parent_id": "t1_ehnynzu",
            "score": 1,
            "created_utc": 1551576712.0,
            "replies": []
        },
        {
            "body": "Nah, the first one coupled with a good wb pomade is my go-to method in spring and summer.",
            "author": "actstunt",
            "id": "ehngjop",
            "parent_id": "t1_ehnfx2v",
            "score": 2,
            "created_utc": 1551558859.0,
            "replies": []
        },
        {
            "body": "I've got no problem with the shine, it's semi matte, maybe you're using too much product? Quick sand will give you a totally matte look but it's not so good on wild hair.",
            "author": "actstunt",
            "id": "ehpbpo0",
            "parent_id": "t1_ehowz12",
            "score": 1,
            "created_utc": 1551627709.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eho4c9n",
            "parent_id": "t1_eho38pg",
            "score": 1,
            "created_utc": 1551577735.0,
            "replies": [
                {
                    "body": "Reuzel grooming tonic is an excellent pre styler trust me and a bottle will last for months.\n\nI emulsify clays only for a little bit, 3 to 5 seconds when you feel the product hot in your hands it's the signal to spread it on your hair.\n\nI use a dab the size of a quarter or the top of mi index finger and if I need to be more precise when finishing my style I took a little bit of product on mi fingertips and apply it on the strands I want to arrange. Pretty easy.\n\nIf you got more questions feel free to ask! This is why I posted and I'm glad to help.\n\n",
                    "author": "actstunt",
                    "id": "eho6pv4",
                    "parent_id": "t1_eho4c9n",
                    "score": 3,
                    "created_utc": 1551579726.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay cool, thanks for the advice!",
            "author": "Spardinal",
            "id": "ehqelid",
            "parent_id": "t1_ehqdxx9",
            "score": 1,
            "created_utc": 1551657700.0,
            "replies": []
        },
        {
            "body": "Reuzel grooming tonic is an excellent pre styler trust me and a bottle will last for months.\n\nI emulsify clays only for a little bit, 3 to 5 seconds when you feel the product hot in your hands it's the signal to spread it on your hair.\n\nI use a dab the size of a quarter or the top of mi index finger and if I need to be more precise when finishing my style I took a little bit of product on mi fingertips and apply it on the strands I want to arrange. Pretty easy.\n\nIf you got more questions feel free to ask! This is why I posted and I'm glad to help.\n\n",
            "author": "actstunt",
            "id": "eho6pv4",
            "parent_id": "t1_eho4c9n",
            "score": 3,
            "created_utc": 1551579726.0,
            "replies": []
        }
    ]
}