{
    "title": "He is showing he cares",
    "post_id": "enhy4b",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/enhy4b/he_is_showing_he_cares/",
    "author": null,
    "body": "So, I just got home from an amazing date with my new SD. This was our 3rd intimate date for reference. And I just had to post about how amazing he has been.\n\nMeet&Greet: Casual dinner at a restaurant. Conversation flows naturally. Next day, we talk sugar and he makes his offer of ppm plus shopping which I accept.\n\nFirst Date: Fun time at the zoo! We spent hours walking around. Highlights: got to see a massive snake devour a rabbit, someone dropped their phone right in front of us into the giraffe enclosure, and he insisted on getting me a cute little turtle ring in the gift shop (which I now wear almost everyday).\n\nSecond date: NYE, he picks me up and takes me to Best Buy because he wants to get me the laptop I mentioned I had wanted to help with my Korean studies. Go to dinner, then hotel and miss the fireworks but created plenty ourselves ;)\n\nThird date: tonight, we drove to a nearby city (less than an hour) and did a historical tour of a fort (he again insisted I get something from the gift shop so I got a mug). Walked around downtown, got lunch at an amazing place that he had been to before and had vegetarian options for me. Went to the hotel, had fun, cuddled. While cuddling he mentions he wants to take me grocery shopping since he had been thinking it must be hard for me to do without a car (so thoughtful!). So we head to target and he is putting tons of stuff he thinks i'll like into the cart. He also gets me a Keurig for my office since I just started drinking coffee. \n\nSo, there we have it. Brief summary of how caring my SD is and how compatible we are. We never have to think about what we want to do together next, because when we are out and talking we inevitably find something else we want to do together. I am going to start brainstorming what I can do for Valentine's Day to show him my appreciation.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/enhy4b/he_is_showing_he_cares/",
    "score": 118,
    "upvote_ratio": 0.96,
    "created_utc": 1578798363.0,
    "num_comments": 68,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You are so right to notice the small things that show how much he cares. It's a mistake to judge the quality of the relationship based on just money or sex, its how you enjoy seeing each other and how you put the other person first.\n\nIf you are both catching feelings, have you discussed where you see this building up to? It may be something that is more than just s sugar relationship.",
            "author": "BusddhistDSM",
            "id": "fe02b2p",
            "parent_id": "t3_enhy4b",
            "score": 19,
            "created_utc": 1578801301.0,
            "replies": [
                {
                    "body": "Small things make big waves. He always notices the small things I do and verbally acknowledges his gratefulness for them. As for catching feelings, I have not and as far as I know neither has he. We are both enjoying what we do for each other in the context of an arrangement. However, we are both single and neither of us are seeing anyone else (we did not have an exclusive talk, just so happens we are only seeing each other) so it kinda scares me that feelings could develop.",
                    "author": null,
                    "id": "fe02tks",
                    "parent_id": "t1_fe02b2p",
                    "score": 12,
                    "created_utc": 1578801666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Grocery shopping is such an underrated activity.\n\nI’m glad you found someone so caring, he sounds really sweet!! I’m sure he’d love whatever you get him on Valentines Day",
            "author": null,
            "id": "fdzzh6f",
            "parent_id": "t3_enhy4b",
            "score": 13,
            "created_utc": 1578799492.0,
            "replies": [
                {
                    "body": "Thank you! I agree, who doesn't love food? Lol. I am all stocked up now. I will definitely have to send him a pic of me enjoying a coffee I made with the Keurig he got me. He is so sweet, I already have a few ideas for a Valentine's gift that I think he'll enjoy based off his profession and personality.",
                    "author": null,
                    "id": "fe00092",
                    "parent_id": "t1_fdzzh6f",
                    "score": 8,
                    "created_utc": 1578799805.0,
                    "replies": [
                        {
                            "body": "The pic is a great idea! It’s always nice to show your appreciation.\n\nAlso what got you into coffee? Idk if you like yours with cream, but hazelnut creamer is honestly a godsend",
                            "author": null,
                            "id": "fe062nb",
                            "parent_id": "t1_fe00092",
                            "score": 3,
                            "created_utc": 1578803973.0,
                            "replies": [
                                {
                                    "body": "I drink it black. I am trying to cut back on dairy. And I like it bitter lol. I started drinking it because I get up at 4 a.m for work and even though i'm a morning person that is just so gosh darn early lol.",
                                    "author": null,
                                    "id": "fe06cz6",
                                    "parent_id": "t1_fe062nb",
                                    "score": 6,
                                    "created_utc": 1578804190.0,
                                    "replies": [
                                        {
                                            "body": "Oh dang. I consider myself a morning person too, but 4:00 a.m is an ugly hour to have to wake up. You deserve that coffee",
                                            "author": null,
                                            "id": "fe07odz",
                                            "parent_id": "t1_fe06cz6",
                                            "score": 4,
                                            "created_utc": 1578805254.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Please share some ideas with me. I'm thinking ahead as well.",
                            "author": null,
                            "id": "fe044b5",
                            "parent_id": "t1_fe00092",
                            "score": 2,
                            "created_utc": 1578802597.0,
                            "replies": [
                                {
                                    "body": "Well, my idea is specific to his profession. He is a pharmacist and I found a mug that looks like a google search for \"Best Pharmacist: We have 1 result for Best Pharmacist. Search Result: insert his name here (you customize the mug with his name). But i'm sure you could do the same thing with any profession really. I already have a sexy red VS teddy to wear. But i'm still brainstorming.",
                                    "author": null,
                                    "id": "fe04i2u",
                                    "parent_id": "t1_fe044b5",
                                    "score": 8,
                                    "created_utc": 1578802863.0,
                                    "replies": [
                                        {
                                            "body": "Love the idea",
                                            "author": null,
                                            "id": "fe0m3qy",
                                            "parent_id": "t1_fe04i2u",
                                            "score": 1,
                                            "created_utc": 1578815888.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow! If only my last one was like this! He was soooooo cheap! I told him I was going grocery shopping later that day and he said \"I could let you use my 10% employee discount if you want\"...WTF?!?! \nThis was the straw that broke the camels back and I broke up with him. Jeez! \nI need a generous SD like yours!  He sounds super duper!",
            "author": "lovestolaugh11",
            "id": "fe01d69",
            "parent_id": "t3_enhy4b",
            "score": 37,
            "created_utc": 1578800659.0,
            "replies": [
                {
                    "body": "He really is! I remember reading your post about that and had wondered why he hadn't just offered to buy your groceries, or send you some money towards them. Yes, he is under no obligation to do so, but it would have been a nice gesture. I hope you find someone better!",
                    "author": null,
                    "id": "fe01pnx",
                    "parent_id": "t1_fe01d69",
                    "score": 15,
                    "created_utc": 1578800888.0,
                    "replies": [
                        {
                            "body": "Exactly… It doesn’t have to be written into the agreement, but if someone doesn’t have a lot of money for food and you are in an arrangement with them, you’re supposed to care about them... and the right thing to do would’ve been to buy groceries. I mean, that’s pretty basic. \n\nAnd I personally think there’s an unwritten rule that extras are naturally part of any arrangement. Of course, I don’t do PPM, only monthly, so perhaps that makes a difference somehow. But it just seems to me that if you’re in this type of relationship/arrangement with someone, the extras come out of a sense of caring and kindness… And if you’re not offering caring and kindness to the person you’re being intimate with, there really isn’t much intimacy.",
                            "author": "RealEarthAngel",
                            "id": "fe2xhwn",
                            "parent_id": "t1_fe01pnx",
                            "score": 5,
                            "created_utc": 1578843985.0,
                            "replies": []
                        },
                        {
                            "body": "What if there arrangement wasn't like that? Meaning what if he agreed to PPM or allowance and only met that?",
                            "author": "TexasSD",
                            "id": "fe0havb",
                            "parent_id": "t1_fe01pnx",
                            "score": 1,
                            "created_utc": 1578813431.0,
                            "replies": [
                                {
                                    "body": "People want different things. If the girl wants more generosity than the ppm, I'm sure you agree that breaking up was the right thing to do.",
                                    "author": null,
                                    "id": "fe19xn4",
                                    "parent_id": "t1_fe0havb",
                                    "score": 6,
                                    "created_utc": 1578824215.0,
                                    "replies": [
                                        {
                                            "body": "This. Like I said he wasn't under obligation to do that, but it would have been a nice gesture. If the SB felt uncared for because he's not willing (or can't) provide extra from the ppm than she should find another SD. Just like the SD can find another SB if he doesn't want a SB that desires extras.",
                                            "author": null,
                                            "id": "fe23idi",
                                            "parent_id": "t1_fe19xn4",
                                            "score": 2,
                                            "created_utc": 1578834061.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If the girl agreed to a PPM and then wants more ... that's on her.\n\nIf I enter to an agreement, we come to terms on the arrangement and then you try to change the arrangement and get mad at me for not providing the \"extras\", who is at \"fault\" here?\n\nWho didn't hold up their end of the agreement?",
                                            "author": "TexasSD",
                                            "id": "fe2t9xs",
                                            "parent_id": "t1_fe19xn4",
                                            "score": -1,
                                            "created_utc": 1578842618.0,
                                            "replies": [
                                                {
                                                    "body": "It all comes down to how many details it's possible to nail down beforehand. Would you prefer if she asked for xxx ppm + groceries every once in a while? And help out two times a year because her cat can get sick? And also have a contract stating that you will give her 100$ each year for Christmas?\n\nSome extras are not appropriate to ask for. Like during the negotiations, it would be a dealbreaker for me if a POT asked me about details around intimacy. Like, for how long do you want to fuck, will you give me oral, will you suck my balls, are you open to have a finger in your butt etc. Some things just have to be \"extras\" and I would say it's okay to expect them without asking for them beforehand. It's all part of the dating experience",
                                                    "author": null,
                                                    "id": "fe2ukri",
                                                    "parent_id": "t1_fe2t9xs",
                                                    "score": 4,
                                                    "created_utc": 1578843007.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "He could still have been caring enough to let common sense dictate by offering her grocery money.",
                                    "author": "RealEarthAngel",
                                    "id": "fe2yh4v",
                                    "parent_id": "t1_fe0havb",
                                    "score": 3,
                                    "created_utc": 1578844241.0,
                                    "replies": []
                                },
                                {
                                    "body": "the SB is clearly attracted to generosity but isnt transactional. its a feedforward mechanism",
                                    "author": null,
                                    "id": "fe4k537",
                                    "parent_id": "t1_fe0havb",
                                    "score": 1,
                                    "created_utc": 1578860196.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I also went to Walmart with a POT, and he knew I was getting some things for Christmas, and he didn't even offer to buy it for me.  He was buying some things for himself,  and he separated or items on the conveyor belt and everything! What a cheap loser! My items came to like $80! Its not like I was buying some laptop or something!  It was stocking stuffers for my sons. SMH...some people! He's no sugar daddy....",
                    "author": "lovestolaugh11",
                    "id": "fe06mdu",
                    "parent_id": "t1_fe01d69",
                    "score": 14,
                    "created_utc": 1578804392.0,
                    "replies": [
                        {
                            "body": "Wow. If you are (supposed to be) a SD and we go to a store together, I'm going to be under the assumption you are paying. Otherwise, why would we go together?",
                            "author": null,
                            "id": "fe08nlj",
                            "parent_id": "t1_fe06mdu",
                            "score": 12,
                            "created_utc": 1578806092.0,
                            "replies": []
                        },
                        {
                            "body": "That's actually painful to read. And for your sons as well? The guy wasn't in his right christmas spirit",
                            "author": null,
                            "id": "fe1a5sx",
                            "parent_id": "t1_fe06mdu",
                            "score": 8,
                            "created_utc": 1578824298.0,
                            "replies": []
                        },
                        {
                            "body": "Disgusting",
                            "author": "Lilipuss25",
                            "id": "fe60jll",
                            "parent_id": "t1_fe06mdu",
                            "score": 1,
                            "created_utc": 1578879078.0,
                            "replies": [
                                {
                                    "body": "Agreed",
                                    "author": "lovestolaugh11",
                                    "id": "fe6bucs",
                                    "parent_id": "t1_fe60jll",
                                    "score": 1,
                                    "created_utc": 1578886460.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Did he pay you the correct amount for PPM or allowance when you guys met up?",
                            "author": "TexasSD",
                            "id": "fe0he90",
                            "parent_id": "t1_fe06mdu",
                            "score": -6,
                            "created_utc": 1578813470.0,
                            "replies": [
                                {
                                    "body": "No he did not.",
                                    "author": "lovestolaugh11",
                                    "id": "fe4o8ct",
                                    "parent_id": "t1_fe0he90",
                                    "score": 1,
                                    "created_utc": 1578861288.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not sure why this is downvoted, its an honest question. If he paid his part of the agreement he's under no obligation to do more than that.  \n\n\nWould it be nice, yes.\n\nIs it required, no.",
                                    "author": "TexasSD",
                                    "id": "fe2tv9r",
                                    "parent_id": "t1_fe0he90",
                                    "score": 0,
                                    "created_utc": 1578842744.0,
                                    "replies": [
                                        {
                                            "body": "I suspect this is an age-old issue that will never be resolved.\n\nSDs don't want to feel manipulated and also fear a slippery slope.  Pay for it once and it becomes he will always pay for that every time or he looks like a schmuck.   Some SDs are upper-middle class and they don't mind.  Others are very wealthy but also so careful with money they do mind.  They have a sugar budget and that's it.\n\nSBs see it as he has so much money.  This is nothing for him.  Why am I spending my hard-earned money when he could easily afford it.  And they can't help but get insulted.\n\nIts a problem in vanilla dating too.  I had it happen twice in LTRs after I first got divorced.",
                                            "author": "soicansaywhatiwant",
                                            "id": "fe3ews6",
                                            "parent_id": "t1_fe2tv9r",
                                            "score": 2,
                                            "created_utc": 1578848678.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ".... employee??",
                    "author": null,
                    "id": "fe19ph6",
                    "parent_id": "t1_fe01d69",
                    "score": 4,
                    "created_utc": 1578824118.0,
                    "replies": [
                        {
                            "body": "No he didn't work at walmart, just suggested we meet there so I told him ok, since I needed to get some Christmas stuff. Then he separated the items on the conveyor and I'm like NEXT! Smh...He was obviously into more of a vanilla relationship and since we hadn't been together that long, he didn't buy my Christmas stuff for me. Definitely not what I was thinking would happen.",
                            "author": "lovestolaugh11",
                            "id": "fe4nbke",
                            "parent_id": "t1_fe19ph6",
                            "score": 1,
                            "created_utc": 1578861078.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sounds amazing!! I love how engaged and hands on he is. I’m so glad you’re happy 🥰",
            "author": null,
            "id": "fe06blo",
            "parent_id": "t3_enhy4b",
            "score": 7,
            "created_utc": 1578804160.0,
            "replies": [
                {
                    "body": "Thank you!! Yes, he is also blessed with a near-perfect memory. So if I mention something even in passing he remembers it. He'll be telling stories that happened decades ago and using people's actual names. Meanwhile, i'm over here like...did I remember to eat breakfast this morning???",
                    "author": null,
                    "id": "fe06i0b",
                    "parent_id": "t1_fe06blo",
                    "score": 3,
                    "created_utc": 1578804297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aww, this is so wholesome and awesome! I’m happy for you and the both of you sound like an amazing match for each other!",
            "author": "Nart317",
            "id": "fdzz08t",
            "parent_id": "t3_enhy4b",
            "score": 3,
            "created_utc": 1578799201.0,
            "replies": [
                {
                    "body": "Thank you!!",
                    "author": null,
                    "id": "fdzzdv0",
                    "parent_id": "t1_fdzz08t",
                    "score": 1,
                    "created_utc": 1578799429.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fe01hlb",
            "parent_id": "t3_enhy4b",
            "score": 3,
            "created_utc": 1578800740.0,
            "replies": [
                {
                    "body": "Thank you!!",
                    "author": null,
                    "id": "fe01qg9",
                    "parent_id": "t1_fe01hlb",
                    "score": 2,
                    "created_utc": 1578800902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very happy for you.  👏👏 for sweet arrangements.",
            "author": "dade_murphy1",
            "id": "fe05f0y",
            "parent_id": "t3_enhy4b",
            "score": 3,
            "created_utc": 1578803489.0,
            "replies": [
                {
                    "body": "Thank you!!",
                    "author": null,
                    "id": "fe05gv5",
                    "parent_id": "t1_fe05f0y",
                    "score": 1,
                    "created_utc": 1578803523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats!\n\nWe've heard some true horror stories about the behavior of men on SA lately (I hesitate to even give some of them the title of SD) -- it's nice to hear about a guy doing it the old fashioned way, winning a girl with generosity and kindness.",
            "author": "sugarthrowSD",
            "id": "fe1jmry",
            "parent_id": "t3_enhy4b",
            "score": 3,
            "created_utc": 1578827352.0,
            "replies": [
                {
                    "body": "Thank you!! Yes, he is truly amazing and generous. I am doing my best to make sure he takes the lead on things when it comes to gifts so that he is only doing what he is comfortable with, and so far it's working out really great!",
                    "author": null,
                    "id": "fe24imq",
                    "parent_id": "t1_fe1jmry",
                    "score": 2,
                    "created_utc": 1578834386.0,
                    "replies": []
                },
                {
                    "body": ">\\-- it's nice to hear about a guy doing it the old fashioned way, winning a girl with generosity and kindness.\n\nits nice when you're given the opportunity to do things the old fashioned way, if / when you find a worthy woman deserving of such treatment. Unfortunately as you may or may not know, SA is a cesspool of wannabe SB that would fully take advantage of the SD kindness and generosity when given this treatment.",
                    "author": "ruphun",
                    "id": "fe1uns1",
                    "parent_id": "t1_fe1jmry",
                    "score": -1,
                    "created_utc": 1578831089.0,
                    "replies": [
                        {
                            "body": "SA is surely a two way street. I think you are breaking out the haterade at this picnic a little too hastily.",
                            "author": "sugarthrowSD",
                            "id": "fe2fm54",
                            "parent_id": "t1_fe1uns1",
                            "score": 2,
                            "created_utc": 1578837807.0,
                            "replies": [
                                {
                                    "body": "Sure it is but it’s also has a ton of time wasters, entitled people, rinsers and scammers. Wasn’t saying it was impose it but it’s much harder to find gems",
                                    "author": "ruphun",
                                    "id": "fe2lsmv",
                                    "parent_id": "t1_fe2fm54",
                                    "score": 0,
                                    "created_utc": 1578840159.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This makes me sad since I know you speak the truth. I really appreciate everything he is doing for me, and I let him take the lead on gifts so that he is only doing what he is comfortable with. And it may be easier for me to convey what he does for me since it involves material things, but I do my best to provide for him as well.",
                            "author": null,
                            "id": "fe24xtt",
                            "parent_id": "t1_fe1uns1",
                            "score": 0,
                            "created_utc": 1578834528.0,
                            "replies": [
                                {
                                    "body": "I appreciate you're ability to see its rarity, and know you will value and cherish what you're SD does for you.",
                                    "author": "ruphun",
                                    "id": "fe2d714",
                                    "parent_id": "t1_fe24xtt",
                                    "score": 0,
                                    "created_utc": 1578837095.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fdzzuh5",
            "parent_id": "t3_enhy4b",
            "score": 2,
            "created_utc": 1578799709.0,
            "replies": [
                {
                    "body": "Thank you!! He is, and I am :)",
                    "author": null,
                    "id": "fe0047f",
                    "parent_id": "t1_fdzzuh5",
                    "score": 1,
                    "created_utc": 1578799875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fe0dyfi",
            "parent_id": "t3_enhy4b",
            "score": 2,
            "created_utc": 1578811348.0,
            "replies": [
                {
                    "body": "Thank you!!",
                    "author": null,
                    "id": "fe23m7r",
                    "parent_id": "t1_fe0dyfi",
                    "score": 2,
                    "created_utc": 1578834080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He sounds so sweet! And that historical tour! 😍 Key to my heart right there haha! I’m happy for you!",
            "author": "cjkit",
            "id": "fe0epfe",
            "parent_id": "t3_enhy4b",
            "score": 2,
            "created_utc": 1578812049.0,
            "replies": [
                {
                    "body": "Thank you!! Yes, one of my major's was historical preservation so that was literally my cup of tea.",
                    "author": null,
                    "id": "fe23tlu",
                    "parent_id": "t1_fe0epfe",
                    "score": 2,
                    "created_utc": 1578834163.0,
                    "replies": [
                        {
                            "body": "A+ for tailored dates. We're going to museums this week on our trip. :D I love that yours knows you so well too!",
                            "author": "Sweettooth_dragon",
                            "id": "fe4fvo7",
                            "parent_id": "t1_fe23tlu",
                            "score": 1,
                            "created_utc": 1578858843.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fe34p5u",
            "parent_id": "t3_enhy4b",
            "score": 2,
            "created_utc": 1578845864.0,
            "replies": [
                {
                    "body": "Thank you!! And aw that is so sweet! Small actions make big waves <3",
                    "author": null,
                    "id": "fe35pvr",
                    "parent_id": "t1_fe34p5u",
                    "score": 2,
                    "created_utc": 1578846158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ya, i had some anxiety over it, for sure! I dumped him shortly after that. He was not a true SD by any stretch of the imagination.  I was super sad that he did that. I mean, he was the one that suggested we go shopping together!",
            "author": "lovestolaugh11",
            "id": "fe43xoz",
            "parent_id": "t3_enhy4b",
            "score": 1,
            "created_utc": 1578855586.0,
            "replies": [
                {
                    "body": "That is very strange that going shopping together was his idea, but he didn't pay for your stuff? It's not like you dragged him into LV and demanded a purse.",
                    "author": null,
                    "id": "fe4i15v",
                    "parent_id": "t1_fe43xoz",
                    "score": 1,
                    "created_utc": 1578859542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thanks for sharing <3",
            "author": null,
            "id": "fe4jz1a",
            "parent_id": "t3_enhy4b",
            "score": 1,
            "created_utc": 1578860147.0,
            "replies": [
                {
                    "body": "I had to, because I knew people here could appreciate it and be happy for me :)",
                    "author": null,
                    "id": "fe4kx4a",
                    "parent_id": "t1_fe4jz1a",
                    "score": 1,
                    "created_utc": 1578860414.0,
                    "replies": [
                        {
                            "body": "good girl! <3",
                            "author": null,
                            "id": "fe4lup7",
                            "parent_id": "t1_fe4kx4a",
                            "score": 1,
                            "created_utc": 1578860648.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fe5cug7",
            "parent_id": "t3_enhy4b",
            "score": 1,
            "created_utc": 1578867767.0,
            "replies": [
                {
                    "body": "I met him on SA (seeking arrangements) it is the recommended site of this sub. But keep in mind it's still full of scammers and time wasters. Also, you are definitely not too old. I used to know a very successful SB in her 50s. You are already doing well by reading up on this forum. I would say the most important factor in the sugar bowl is location, after that everything is really personal preference.",
                    "author": null,
                    "id": "fe5dabn",
                    "parent_id": "t1_fe5cug7",
                    "score": 1,
                    "created_utc": 1578867986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn this guy sounds amazing. I'm taking notes. In my last SR, I took my SB grocery shopping one day and I could really tell she appreciated it. Happy to see others appreciate it too. It really is the little things.",
            "author": null,
            "id": "fe6bdib",
            "parent_id": "t3_enhy4b",
            "score": 1,
            "created_utc": 1578886117.0,
            "replies": [
                {
                    "body": "I think he is amazing! Being taken grocery shopping was just so thoughtful of him. It was also so nice that he was picking out a bunch of new food that he liked that are vegetarian friendly for me. It really showed me how attentive and caring he is.",
                    "author": null,
                    "id": "fe7103z",
                    "parent_id": "t1_fe6bdib",
                    "score": 1,
                    "created_utc": 1578908555.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fe07mte",
            "parent_id": "t3_enhy4b",
            "score": -6,
            "created_utc": 1578805219.0,
            "replies": [
                {
                    "body": "I’m sure highlight in this case meant most memorable. And all animals eat food. Sometimes it just happens to be another animal 🤷🏾‍♀️",
                    "author": null,
                    "id": "fe07y77",
                    "parent_id": "t1_fe07mte",
                    "score": 3,
                    "created_utc": 1578805481.0,
                    "replies": []
                },
                {
                    "body": "You sound like a fun gal",
                    "author": null,
                    "id": "fe1ar03",
                    "parent_id": "t1_fe07mte",
                    "score": 3,
                    "created_utc": 1578824412.0,
                    "replies": []
                },
                {
                    "body": "The rabbit was already dead, and the animal has to eat. Just like it would in the wild. And the person dropped their phone which was funny, they got it back. I would have thought it hilarious if I had been the one to drop my phone as well.",
                    "author": null,
                    "id": "fe07vfc",
                    "parent_id": "t1_fe07mte",
                    "score": 2,
                    "created_utc": 1578805416.0,
                    "replies": []
                },
                {
                    "body": "is this all you got out of this sweet story..?\n\nWhat is it with all women that have cat in their username on this sub...? 🤯",
                    "author": "ruphun",
                    "id": "fe1u6lx",
                    "parent_id": "t1_fe07mte",
                    "score": 1,
                    "created_utc": 1578830888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who cares? This forum is becoming unbearable.",
            "author": null,
            "id": "fe27hom",
            "parent_id": "t3_enhy4b",
            "score": -2,
            "created_utc": 1578835294.0,
            "replies": [
                {
                    "body": "You’re...upset that a SB is sharing a good experience with a generous SD? This is one of the most innocuous things to find unbearable.",
                    "author": "ToxicGrad",
                    "id": "fe2o1pw",
                    "parent_id": "t1_fe27hom",
                    "score": 2,
                    "created_utc": 1578841048.0,
                    "replies": [
                        {
                            "body": "Yes. It is either bitching, bragging, or long posts that do not follow a single direction making them hard to read. \n\nI should set my expectations lower.",
                            "author": null,
                            "id": "fe2t33v",
                            "parent_id": "t1_fe2o1pw",
                            "score": -1,
                            "created_utc": 1578842545.0,
                            "replies": [
                                {
                                    "body": "I don’t see how a woman sharing a good experience with a SD is bragging. She’s sharing something that has brought her joy, and, by doing so, she’s showing other SBs that it is possible to have a good SR with a SD who is caring, thoughtful, and generous. I see absolutely no problems with that.\n\nIf a person has a bad experience, and “bitches” about it here, sharing that educates the community on, perhaps, red flags, or warning signs, and gives the OP chance for feedback on whatever their experience had been. \n\nAnd if a person isn’t great at writing, perhaps their educational background wasn’t top-notch. Perhaps they never thrived in English classes, or never had a teacher who helped them to learn the importance of topic sentences, paragraph structure, etc.\n\nI can’t imagine being irritated by people being happy when their SR experiences are good, unhappy when their SR experiences are unpleasant, and not writing to your standards. You’ve shown me a level of misanthropy that, perhaps, exceeds (and contributes to) my own.",
                                    "author": "ToxicGrad",
                                    "id": "fe2v5a3",
                                    "parent_id": "t1_fe2t33v",
                                    "score": 3,
                                    "created_utc": 1578843208.0,
                                    "replies": [
                                        {
                                            "body": "👍🏻",
                                            "author": "ruphun",
                                            "id": "fe4zkzu",
                                            "parent_id": "t1_fe2v5a3",
                                            "score": 1,
                                            "created_utc": 1578864246.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Small things make big waves. He always notices the small things I do and verbally acknowledges his gratefulness for them. As for catching feelings, I have not and as far as I know neither has he. We are both enjoying what we do for each other in the context of an arrangement. However, we are both single and neither of us are seeing anyone else (we did not have an exclusive talk, just so happens we are only seeing each other) so it kinda scares me that feelings could develop.",
            "author": null,
            "id": "fe02tks",
            "parent_id": "t1_fe02b2p",
            "score": 12,
            "created_utc": 1578801666.0,
            "replies": []
        },
        {
            "body": "Thank you! I agree, who doesn't love food? Lol. I am all stocked up now. I will definitely have to send him a pic of me enjoying a coffee I made with the Keurig he got me. He is so sweet, I already have a few ideas for a Valentine's gift that I think he'll enjoy based off his profession and personality.",
            "author": null,
            "id": "fe00092",
            "parent_id": "t1_fdzzh6f",
            "score": 8,
            "created_utc": 1578799805.0,
            "replies": [
                {
                    "body": "The pic is a great idea! It’s always nice to show your appreciation.\n\nAlso what got you into coffee? Idk if you like yours with cream, but hazelnut creamer is honestly a godsend",
                    "author": null,
                    "id": "fe062nb",
                    "parent_id": "t1_fe00092",
                    "score": 3,
                    "created_utc": 1578803973.0,
                    "replies": [
                        {
                            "body": "I drink it black. I am trying to cut back on dairy. And I like it bitter lol. I started drinking it because I get up at 4 a.m for work and even though i'm a morning person that is just so gosh darn early lol.",
                            "author": null,
                            "id": "fe06cz6",
                            "parent_id": "t1_fe062nb",
                            "score": 6,
                            "created_utc": 1578804190.0,
                            "replies": [
                                {
                                    "body": "Oh dang. I consider myself a morning person too, but 4:00 a.m is an ugly hour to have to wake up. You deserve that coffee",
                                    "author": null,
                                    "id": "fe07odz",
                                    "parent_id": "t1_fe06cz6",
                                    "score": 4,
                                    "created_utc": 1578805254.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Please share some ideas with me. I'm thinking ahead as well.",
                    "author": null,
                    "id": "fe044b5",
                    "parent_id": "t1_fe00092",
                    "score": 2,
                    "created_utc": 1578802597.0,
                    "replies": [
                        {
                            "body": "Well, my idea is specific to his profession. He is a pharmacist and I found a mug that looks like a google search for \"Best Pharmacist: We have 1 result for Best Pharmacist. Search Result: insert his name here (you customize the mug with his name). But i'm sure you could do the same thing with any profession really. I already have a sexy red VS teddy to wear. But i'm still brainstorming.",
                            "author": null,
                            "id": "fe04i2u",
                            "parent_id": "t1_fe044b5",
                            "score": 8,
                            "created_utc": 1578802863.0,
                            "replies": [
                                {
                                    "body": "Love the idea",
                                    "author": null,
                                    "id": "fe0m3qy",
                                    "parent_id": "t1_fe04i2u",
                                    "score": 1,
                                    "created_utc": 1578815888.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He really is! I remember reading your post about that and had wondered why he hadn't just offered to buy your groceries, or send you some money towards them. Yes, he is under no obligation to do so, but it would have been a nice gesture. I hope you find someone better!",
            "author": null,
            "id": "fe01pnx",
            "parent_id": "t1_fe01d69",
            "score": 15,
            "created_utc": 1578800888.0,
            "replies": [
                {
                    "body": "Exactly… It doesn’t have to be written into the agreement, but if someone doesn’t have a lot of money for food and you are in an arrangement with them, you’re supposed to care about them... and the right thing to do would’ve been to buy groceries. I mean, that’s pretty basic. \n\nAnd I personally think there’s an unwritten rule that extras are naturally part of any arrangement. Of course, I don’t do PPM, only monthly, so perhaps that makes a difference somehow. But it just seems to me that if you’re in this type of relationship/arrangement with someone, the extras come out of a sense of caring and kindness… And if you’re not offering caring and kindness to the person you’re being intimate with, there really isn’t much intimacy.",
                    "author": "RealEarthAngel",
                    "id": "fe2xhwn",
                    "parent_id": "t1_fe01pnx",
                    "score": 5,
                    "created_utc": 1578843985.0,
                    "replies": []
                },
                {
                    "body": "What if there arrangement wasn't like that? Meaning what if he agreed to PPM or allowance and only met that?",
                    "author": "TexasSD",
                    "id": "fe0havb",
                    "parent_id": "t1_fe01pnx",
                    "score": 1,
                    "created_utc": 1578813431.0,
                    "replies": [
                        {
                            "body": "People want different things. If the girl wants more generosity than the ppm, I'm sure you agree that breaking up was the right thing to do.",
                            "author": null,
                            "id": "fe19xn4",
                            "parent_id": "t1_fe0havb",
                            "score": 6,
                            "created_utc": 1578824215.0,
                            "replies": [
                                {
                                    "body": "This. Like I said he wasn't under obligation to do that, but it would have been a nice gesture. If the SB felt uncared for because he's not willing (or can't) provide extra from the ppm than she should find another SD. Just like the SD can find another SB if he doesn't want a SB that desires extras.",
                                    "author": null,
                                    "id": "fe23idi",
                                    "parent_id": "t1_fe19xn4",
                                    "score": 2,
                                    "created_utc": 1578834061.0,
                                    "replies": []
                                },
                                {
                                    "body": "If the girl agreed to a PPM and then wants more ... that's on her.\n\nIf I enter to an agreement, we come to terms on the arrangement and then you try to change the arrangement and get mad at me for not providing the \"extras\", who is at \"fault\" here?\n\nWho didn't hold up their end of the agreement?",
                                    "author": "TexasSD",
                                    "id": "fe2t9xs",
                                    "parent_id": "t1_fe19xn4",
                                    "score": -1,
                                    "created_utc": 1578842618.0,
                                    "replies": [
                                        {
                                            "body": "It all comes down to how many details it's possible to nail down beforehand. Would you prefer if she asked for xxx ppm + groceries every once in a while? And help out two times a year because her cat can get sick? And also have a contract stating that you will give her 100$ each year for Christmas?\n\nSome extras are not appropriate to ask for. Like during the negotiations, it would be a dealbreaker for me if a POT asked me about details around intimacy. Like, for how long do you want to fuck, will you give me oral, will you suck my balls, are you open to have a finger in your butt etc. Some things just have to be \"extras\" and I would say it's okay to expect them without asking for them beforehand. It's all part of the dating experience",
                                            "author": null,
                                            "id": "fe2ukri",
                                            "parent_id": "t1_fe2t9xs",
                                            "score": 4,
                                            "created_utc": 1578843007.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "He could still have been caring enough to let common sense dictate by offering her grocery money.",
                            "author": "RealEarthAngel",
                            "id": "fe2yh4v",
                            "parent_id": "t1_fe0havb",
                            "score": 3,
                            "created_utc": 1578844241.0,
                            "replies": []
                        },
                        {
                            "body": "the SB is clearly attracted to generosity but isnt transactional. its a feedforward mechanism",
                            "author": null,
                            "id": "fe4k537",
                            "parent_id": "t1_fe0havb",
                            "score": 1,
                            "created_utc": 1578860196.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I also went to Walmart with a POT, and he knew I was getting some things for Christmas, and he didn't even offer to buy it for me.  He was buying some things for himself,  and he separated or items on the conveyor belt and everything! What a cheap loser! My items came to like $80! Its not like I was buying some laptop or something!  It was stocking stuffers for my sons. SMH...some people! He's no sugar daddy....",
            "author": "lovestolaugh11",
            "id": "fe06mdu",
            "parent_id": "t1_fe01d69",
            "score": 14,
            "created_utc": 1578804392.0,
            "replies": [
                {
                    "body": "Wow. If you are (supposed to be) a SD and we go to a store together, I'm going to be under the assumption you are paying. Otherwise, why would we go together?",
                    "author": null,
                    "id": "fe08nlj",
                    "parent_id": "t1_fe06mdu",
                    "score": 12,
                    "created_utc": 1578806092.0,
                    "replies": []
                },
                {
                    "body": "That's actually painful to read. And for your sons as well? The guy wasn't in his right christmas spirit",
                    "author": null,
                    "id": "fe1a5sx",
                    "parent_id": "t1_fe06mdu",
                    "score": 8,
                    "created_utc": 1578824298.0,
                    "replies": []
                },
                {
                    "body": "Disgusting",
                    "author": "Lilipuss25",
                    "id": "fe60jll",
                    "parent_id": "t1_fe06mdu",
                    "score": 1,
                    "created_utc": 1578879078.0,
                    "replies": [
                        {
                            "body": "Agreed",
                            "author": "lovestolaugh11",
                            "id": "fe6bucs",
                            "parent_id": "t1_fe60jll",
                            "score": 1,
                            "created_utc": 1578886460.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Did he pay you the correct amount for PPM or allowance when you guys met up?",
                    "author": "TexasSD",
                    "id": "fe0he90",
                    "parent_id": "t1_fe06mdu",
                    "score": -6,
                    "created_utc": 1578813470.0,
                    "replies": [
                        {
                            "body": "No he did not.",
                            "author": "lovestolaugh11",
                            "id": "fe4o8ct",
                            "parent_id": "t1_fe0he90",
                            "score": 1,
                            "created_utc": 1578861288.0,
                            "replies": []
                        },
                        {
                            "body": "Not sure why this is downvoted, its an honest question. If he paid his part of the agreement he's under no obligation to do more than that.  \n\n\nWould it be nice, yes.\n\nIs it required, no.",
                            "author": "TexasSD",
                            "id": "fe2tv9r",
                            "parent_id": "t1_fe0he90",
                            "score": 0,
                            "created_utc": 1578842744.0,
                            "replies": [
                                {
                                    "body": "I suspect this is an age-old issue that will never be resolved.\n\nSDs don't want to feel manipulated and also fear a slippery slope.  Pay for it once and it becomes he will always pay for that every time or he looks like a schmuck.   Some SDs are upper-middle class and they don't mind.  Others are very wealthy but also so careful with money they do mind.  They have a sugar budget and that's it.\n\nSBs see it as he has so much money.  This is nothing for him.  Why am I spending my hard-earned money when he could easily afford it.  And they can't help but get insulted.\n\nIts a problem in vanilla dating too.  I had it happen twice in LTRs after I first got divorced.",
                                    "author": "soicansaywhatiwant",
                                    "id": "fe3ews6",
                                    "parent_id": "t1_fe2tv9r",
                                    "score": 2,
                                    "created_utc": 1578848678.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ".... employee??",
            "author": null,
            "id": "fe19ph6",
            "parent_id": "t1_fe01d69",
            "score": 4,
            "created_utc": 1578824118.0,
            "replies": [
                {
                    "body": "No he didn't work at walmart, just suggested we meet there so I told him ok, since I needed to get some Christmas stuff. Then he separated the items on the conveyor and I'm like NEXT! Smh...He was obviously into more of a vanilla relationship and since we hadn't been together that long, he didn't buy my Christmas stuff for me. Definitely not what I was thinking would happen.",
                    "author": "lovestolaugh11",
                    "id": "fe4nbke",
                    "parent_id": "t1_fe19ph6",
                    "score": 1,
                    "created_utc": 1578861078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!! Yes, he is also blessed with a near-perfect memory. So if I mention something even in passing he remembers it. He'll be telling stories that happened decades ago and using people's actual names. Meanwhile, i'm over here like...did I remember to eat breakfast this morning???",
            "author": null,
            "id": "fe06i0b",
            "parent_id": "t1_fe06blo",
            "score": 3,
            "created_utc": 1578804297.0,
            "replies": []
        },
        {
            "body": "Thank you!!",
            "author": null,
            "id": "fdzzdv0",
            "parent_id": "t1_fdzz08t",
            "score": 1,
            "created_utc": 1578799429.0,
            "replies": []
        },
        {
            "body": "Thank you!!",
            "author": null,
            "id": "fe01qg9",
            "parent_id": "t1_fe01hlb",
            "score": 2,
            "created_utc": 1578800902.0,
            "replies": []
        },
        {
            "body": "Thank you!!",
            "author": null,
            "id": "fe05gv5",
            "parent_id": "t1_fe05f0y",
            "score": 1,
            "created_utc": 1578803523.0,
            "replies": []
        },
        {
            "body": "Thank you!! Yes, he is truly amazing and generous. I am doing my best to make sure he takes the lead on things when it comes to gifts so that he is only doing what he is comfortable with, and so far it's working out really great!",
            "author": null,
            "id": "fe24imq",
            "parent_id": "t1_fe1jmry",
            "score": 2,
            "created_utc": 1578834386.0,
            "replies": []
        },
        {
            "body": ">\\-- it's nice to hear about a guy doing it the old fashioned way, winning a girl with generosity and kindness.\n\nits nice when you're given the opportunity to do things the old fashioned way, if / when you find a worthy woman deserving of such treatment. Unfortunately as you may or may not know, SA is a cesspool of wannabe SB that would fully take advantage of the SD kindness and generosity when given this treatment.",
            "author": "ruphun",
            "id": "fe1uns1",
            "parent_id": "t1_fe1jmry",
            "score": -1,
            "created_utc": 1578831089.0,
            "replies": [
                {
                    "body": "SA is surely a two way street. I think you are breaking out the haterade at this picnic a little too hastily.",
                    "author": "sugarthrowSD",
                    "id": "fe2fm54",
                    "parent_id": "t1_fe1uns1",
                    "score": 2,
                    "created_utc": 1578837807.0,
                    "replies": [
                        {
                            "body": "Sure it is but it’s also has a ton of time wasters, entitled people, rinsers and scammers. Wasn’t saying it was impose it but it’s much harder to find gems",
                            "author": "ruphun",
                            "id": "fe2lsmv",
                            "parent_id": "t1_fe2fm54",
                            "score": 0,
                            "created_utc": 1578840159.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This makes me sad since I know you speak the truth. I really appreciate everything he is doing for me, and I let him take the lead on gifts so that he is only doing what he is comfortable with. And it may be easier for me to convey what he does for me since it involves material things, but I do my best to provide for him as well.",
                    "author": null,
                    "id": "fe24xtt",
                    "parent_id": "t1_fe1uns1",
                    "score": 0,
                    "created_utc": 1578834528.0,
                    "replies": [
                        {
                            "body": "I appreciate you're ability to see its rarity, and know you will value and cherish what you're SD does for you.",
                            "author": "ruphun",
                            "id": "fe2d714",
                            "parent_id": "t1_fe24xtt",
                            "score": 0,
                            "created_utc": 1578837095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!! He is, and I am :)",
            "author": null,
            "id": "fe0047f",
            "parent_id": "t1_fdzzuh5",
            "score": 1,
            "created_utc": 1578799875.0,
            "replies": []
        },
        {
            "body": "Thank you!!",
            "author": null,
            "id": "fe23m7r",
            "parent_id": "t1_fe0dyfi",
            "score": 2,
            "created_utc": 1578834080.0,
            "replies": []
        },
        {
            "body": "Thank you!! Yes, one of my major's was historical preservation so that was literally my cup of tea.",
            "author": null,
            "id": "fe23tlu",
            "parent_id": "t1_fe0epfe",
            "score": 2,
            "created_utc": 1578834163.0,
            "replies": [
                {
                    "body": "A+ for tailored dates. We're going to museums this week on our trip. :D I love that yours knows you so well too!",
                    "author": "Sweettooth_dragon",
                    "id": "fe4fvo7",
                    "parent_id": "t1_fe23tlu",
                    "score": 1,
                    "created_utc": 1578858843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!! And aw that is so sweet! Small actions make big waves <3",
            "author": null,
            "id": "fe35pvr",
            "parent_id": "t1_fe34p5u",
            "score": 2,
            "created_utc": 1578846158.0,
            "replies": []
        },
        {
            "body": "That is very strange that going shopping together was his idea, but he didn't pay for your stuff? It's not like you dragged him into LV and demanded a purse.",
            "author": null,
            "id": "fe4i15v",
            "parent_id": "t1_fe43xoz",
            "score": 1,
            "created_utc": 1578859542.0,
            "replies": []
        },
        {
            "body": "I had to, because I knew people here could appreciate it and be happy for me :)",
            "author": null,
            "id": "fe4kx4a",
            "parent_id": "t1_fe4jz1a",
            "score": 1,
            "created_utc": 1578860414.0,
            "replies": [
                {
                    "body": "good girl! <3",
                    "author": null,
                    "id": "fe4lup7",
                    "parent_id": "t1_fe4kx4a",
                    "score": 1,
                    "created_utc": 1578860648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I met him on SA (seeking arrangements) it is the recommended site of this sub. But keep in mind it's still full of scammers and time wasters. Also, you are definitely not too old. I used to know a very successful SB in her 50s. You are already doing well by reading up on this forum. I would say the most important factor in the sugar bowl is location, after that everything is really personal preference.",
            "author": null,
            "id": "fe5dabn",
            "parent_id": "t1_fe5cug7",
            "score": 1,
            "created_utc": 1578867986.0,
            "replies": []
        },
        {
            "body": "I think he is amazing! Being taken grocery shopping was just so thoughtful of him. It was also so nice that he was picking out a bunch of new food that he liked that are vegetarian friendly for me. It really showed me how attentive and caring he is.",
            "author": null,
            "id": "fe7103z",
            "parent_id": "t1_fe6bdib",
            "score": 1,
            "created_utc": 1578908555.0,
            "replies": []
        },
        {
            "body": "I’m sure highlight in this case meant most memorable. And all animals eat food. Sometimes it just happens to be another animal 🤷🏾‍♀️",
            "author": null,
            "id": "fe07y77",
            "parent_id": "t1_fe07mte",
            "score": 3,
            "created_utc": 1578805481.0,
            "replies": []
        },
        {
            "body": "You sound like a fun gal",
            "author": null,
            "id": "fe1ar03",
            "parent_id": "t1_fe07mte",
            "score": 3,
            "created_utc": 1578824412.0,
            "replies": []
        },
        {
            "body": "The rabbit was already dead, and the animal has to eat. Just like it would in the wild. And the person dropped their phone which was funny, they got it back. I would have thought it hilarious if I had been the one to drop my phone as well.",
            "author": null,
            "id": "fe07vfc",
            "parent_id": "t1_fe07mte",
            "score": 2,
            "created_utc": 1578805416.0,
            "replies": []
        },
        {
            "body": "is this all you got out of this sweet story..?\n\nWhat is it with all women that have cat in their username on this sub...? 🤯",
            "author": "ruphun",
            "id": "fe1u6lx",
            "parent_id": "t1_fe07mte",
            "score": 1,
            "created_utc": 1578830888.0,
            "replies": []
        },
        {
            "body": "You’re...upset that a SB is sharing a good experience with a generous SD? This is one of the most innocuous things to find unbearable.",
            "author": "ToxicGrad",
            "id": "fe2o1pw",
            "parent_id": "t1_fe27hom",
            "score": 2,
            "created_utc": 1578841048.0,
            "replies": [
                {
                    "body": "Yes. It is either bitching, bragging, or long posts that do not follow a single direction making them hard to read. \n\nI should set my expectations lower.",
                    "author": null,
                    "id": "fe2t33v",
                    "parent_id": "t1_fe2o1pw",
                    "score": -1,
                    "created_utc": 1578842545.0,
                    "replies": [
                        {
                            "body": "I don’t see how a woman sharing a good experience with a SD is bragging. She’s sharing something that has brought her joy, and, by doing so, she’s showing other SBs that it is possible to have a good SR with a SD who is caring, thoughtful, and generous. I see absolutely no problems with that.\n\nIf a person has a bad experience, and “bitches” about it here, sharing that educates the community on, perhaps, red flags, or warning signs, and gives the OP chance for feedback on whatever their experience had been. \n\nAnd if a person isn’t great at writing, perhaps their educational background wasn’t top-notch. Perhaps they never thrived in English classes, or never had a teacher who helped them to learn the importance of topic sentences, paragraph structure, etc.\n\nI can’t imagine being irritated by people being happy when their SR experiences are good, unhappy when their SR experiences are unpleasant, and not writing to your standards. You’ve shown me a level of misanthropy that, perhaps, exceeds (and contributes to) my own.",
                            "author": "ToxicGrad",
                            "id": "fe2v5a3",
                            "parent_id": "t1_fe2t33v",
                            "score": 3,
                            "created_utc": 1578843208.0,
                            "replies": [
                                {
                                    "body": "👍🏻",
                                    "author": "ruphun",
                                    "id": "fe4zkzu",
                                    "parent_id": "t1_fe2v5a3",
                                    "score": 1,
                                    "created_utc": 1578864246.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The pic is a great idea! It’s always nice to show your appreciation.\n\nAlso what got you into coffee? Idk if you like yours with cream, but hazelnut creamer is honestly a godsend",
            "author": null,
            "id": "fe062nb",
            "parent_id": "t1_fe00092",
            "score": 3,
            "created_utc": 1578803973.0,
            "replies": [
                {
                    "body": "I drink it black. I am trying to cut back on dairy. And I like it bitter lol. I started drinking it because I get up at 4 a.m for work and even though i'm a morning person that is just so gosh darn early lol.",
                    "author": null,
                    "id": "fe06cz6",
                    "parent_id": "t1_fe062nb",
                    "score": 6,
                    "created_utc": 1578804190.0,
                    "replies": [
                        {
                            "body": "Oh dang. I consider myself a morning person too, but 4:00 a.m is an ugly hour to have to wake up. You deserve that coffee",
                            "author": null,
                            "id": "fe07odz",
                            "parent_id": "t1_fe06cz6",
                            "score": 4,
                            "created_utc": 1578805254.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please share some ideas with me. I'm thinking ahead as well.",
            "author": null,
            "id": "fe044b5",
            "parent_id": "t1_fe00092",
            "score": 2,
            "created_utc": 1578802597.0,
            "replies": [
                {
                    "body": "Well, my idea is specific to his profession. He is a pharmacist and I found a mug that looks like a google search for \"Best Pharmacist: We have 1 result for Best Pharmacist. Search Result: insert his name here (you customize the mug with his name). But i'm sure you could do the same thing with any profession really. I already have a sexy red VS teddy to wear. But i'm still brainstorming.",
                    "author": null,
                    "id": "fe04i2u",
                    "parent_id": "t1_fe044b5",
                    "score": 8,
                    "created_utc": 1578802863.0,
                    "replies": [
                        {
                            "body": "Love the idea",
                            "author": null,
                            "id": "fe0m3qy",
                            "parent_id": "t1_fe04i2u",
                            "score": 1,
                            "created_utc": 1578815888.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly… It doesn’t have to be written into the agreement, but if someone doesn’t have a lot of money for food and you are in an arrangement with them, you’re supposed to care about them... and the right thing to do would’ve been to buy groceries. I mean, that’s pretty basic. \n\nAnd I personally think there’s an unwritten rule that extras are naturally part of any arrangement. Of course, I don’t do PPM, only monthly, so perhaps that makes a difference somehow. But it just seems to me that if you’re in this type of relationship/arrangement with someone, the extras come out of a sense of caring and kindness… And if you’re not offering caring and kindness to the person you’re being intimate with, there really isn’t much intimacy.",
            "author": "RealEarthAngel",
            "id": "fe2xhwn",
            "parent_id": "t1_fe01pnx",
            "score": 5,
            "created_utc": 1578843985.0,
            "replies": []
        },
        {
            "body": "What if there arrangement wasn't like that? Meaning what if he agreed to PPM or allowance and only met that?",
            "author": "TexasSD",
            "id": "fe0havb",
            "parent_id": "t1_fe01pnx",
            "score": 1,
            "created_utc": 1578813431.0,
            "replies": [
                {
                    "body": "People want different things. If the girl wants more generosity than the ppm, I'm sure you agree that breaking up was the right thing to do.",
                    "author": null,
                    "id": "fe19xn4",
                    "parent_id": "t1_fe0havb",
                    "score": 6,
                    "created_utc": 1578824215.0,
                    "replies": [
                        {
                            "body": "This. Like I said he wasn't under obligation to do that, but it would have been a nice gesture. If the SB felt uncared for because he's not willing (or can't) provide extra from the ppm than she should find another SD. Just like the SD can find another SB if he doesn't want a SB that desires extras.",
                            "author": null,
                            "id": "fe23idi",
                            "parent_id": "t1_fe19xn4",
                            "score": 2,
                            "created_utc": 1578834061.0,
                            "replies": []
                        },
                        {
                            "body": "If the girl agreed to a PPM and then wants more ... that's on her.\n\nIf I enter to an agreement, we come to terms on the arrangement and then you try to change the arrangement and get mad at me for not providing the \"extras\", who is at \"fault\" here?\n\nWho didn't hold up their end of the agreement?",
                            "author": "TexasSD",
                            "id": "fe2t9xs",
                            "parent_id": "t1_fe19xn4",
                            "score": -1,
                            "created_utc": 1578842618.0,
                            "replies": [
                                {
                                    "body": "It all comes down to how many details it's possible to nail down beforehand. Would you prefer if she asked for xxx ppm + groceries every once in a while? And help out two times a year because her cat can get sick? And also have a contract stating that you will give her 100$ each year for Christmas?\n\nSome extras are not appropriate to ask for. Like during the negotiations, it would be a dealbreaker for me if a POT asked me about details around intimacy. Like, for how long do you want to fuck, will you give me oral, will you suck my balls, are you open to have a finger in your butt etc. Some things just have to be \"extras\" and I would say it's okay to expect them without asking for them beforehand. It's all part of the dating experience",
                                    "author": null,
                                    "id": "fe2ukri",
                                    "parent_id": "t1_fe2t9xs",
                                    "score": 4,
                                    "created_utc": 1578843007.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He could still have been caring enough to let common sense dictate by offering her grocery money.",
                    "author": "RealEarthAngel",
                    "id": "fe2yh4v",
                    "parent_id": "t1_fe0havb",
                    "score": 3,
                    "created_utc": 1578844241.0,
                    "replies": []
                },
                {
                    "body": "the SB is clearly attracted to generosity but isnt transactional. its a feedforward mechanism",
                    "author": null,
                    "id": "fe4k537",
                    "parent_id": "t1_fe0havb",
                    "score": 1,
                    "created_utc": 1578860196.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. If you are (supposed to be) a SD and we go to a store together, I'm going to be under the assumption you are paying. Otherwise, why would we go together?",
            "author": null,
            "id": "fe08nlj",
            "parent_id": "t1_fe06mdu",
            "score": 12,
            "created_utc": 1578806092.0,
            "replies": []
        },
        {
            "body": "That's actually painful to read. And for your sons as well? The guy wasn't in his right christmas spirit",
            "author": null,
            "id": "fe1a5sx",
            "parent_id": "t1_fe06mdu",
            "score": 8,
            "created_utc": 1578824298.0,
            "replies": []
        },
        {
            "body": "Disgusting",
            "author": "Lilipuss25",
            "id": "fe60jll",
            "parent_id": "t1_fe06mdu",
            "score": 1,
            "created_utc": 1578879078.0,
            "replies": [
                {
                    "body": "Agreed",
                    "author": "lovestolaugh11",
                    "id": "fe6bucs",
                    "parent_id": "t1_fe60jll",
                    "score": 1,
                    "created_utc": 1578886460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did he pay you the correct amount for PPM or allowance when you guys met up?",
            "author": "TexasSD",
            "id": "fe0he90",
            "parent_id": "t1_fe06mdu",
            "score": -6,
            "created_utc": 1578813470.0,
            "replies": [
                {
                    "body": "No he did not.",
                    "author": "lovestolaugh11",
                    "id": "fe4o8ct",
                    "parent_id": "t1_fe0he90",
                    "score": 1,
                    "created_utc": 1578861288.0,
                    "replies": []
                },
                {
                    "body": "Not sure why this is downvoted, its an honest question. If he paid his part of the agreement he's under no obligation to do more than that.  \n\n\nWould it be nice, yes.\n\nIs it required, no.",
                    "author": "TexasSD",
                    "id": "fe2tv9r",
                    "parent_id": "t1_fe0he90",
                    "score": 0,
                    "created_utc": 1578842744.0,
                    "replies": [
                        {
                            "body": "I suspect this is an age-old issue that will never be resolved.\n\nSDs don't want to feel manipulated and also fear a slippery slope.  Pay for it once and it becomes he will always pay for that every time or he looks like a schmuck.   Some SDs are upper-middle class and they don't mind.  Others are very wealthy but also so careful with money they do mind.  They have a sugar budget and that's it.\n\nSBs see it as he has so much money.  This is nothing for him.  Why am I spending my hard-earned money when he could easily afford it.  And they can't help but get insulted.\n\nIts a problem in vanilla dating too.  I had it happen twice in LTRs after I first got divorced.",
                            "author": "soicansaywhatiwant",
                            "id": "fe3ews6",
                            "parent_id": "t1_fe2tv9r",
                            "score": 2,
                            "created_utc": 1578848678.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No he didn't work at walmart, just suggested we meet there so I told him ok, since I needed to get some Christmas stuff. Then he separated the items on the conveyor and I'm like NEXT! Smh...He was obviously into more of a vanilla relationship and since we hadn't been together that long, he didn't buy my Christmas stuff for me. Definitely not what I was thinking would happen.",
            "author": "lovestolaugh11",
            "id": "fe4nbke",
            "parent_id": "t1_fe19ph6",
            "score": 1,
            "created_utc": 1578861078.0,
            "replies": []
        },
        {
            "body": "SA is surely a two way street. I think you are breaking out the haterade at this picnic a little too hastily.",
            "author": "sugarthrowSD",
            "id": "fe2fm54",
            "parent_id": "t1_fe1uns1",
            "score": 2,
            "created_utc": 1578837807.0,
            "replies": [
                {
                    "body": "Sure it is but it’s also has a ton of time wasters, entitled people, rinsers and scammers. Wasn’t saying it was impose it but it’s much harder to find gems",
                    "author": "ruphun",
                    "id": "fe2lsmv",
                    "parent_id": "t1_fe2fm54",
                    "score": 0,
                    "created_utc": 1578840159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This makes me sad since I know you speak the truth. I really appreciate everything he is doing for me, and I let him take the lead on gifts so that he is only doing what he is comfortable with. And it may be easier for me to convey what he does for me since it involves material things, but I do my best to provide for him as well.",
            "author": null,
            "id": "fe24xtt",
            "parent_id": "t1_fe1uns1",
            "score": 0,
            "created_utc": 1578834528.0,
            "replies": [
                {
                    "body": "I appreciate you're ability to see its rarity, and know you will value and cherish what you're SD does for you.",
                    "author": "ruphun",
                    "id": "fe2d714",
                    "parent_id": "t1_fe24xtt",
                    "score": 0,
                    "created_utc": 1578837095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A+ for tailored dates. We're going to museums this week on our trip. :D I love that yours knows you so well too!",
            "author": "Sweettooth_dragon",
            "id": "fe4fvo7",
            "parent_id": "t1_fe23tlu",
            "score": 1,
            "created_utc": 1578858843.0,
            "replies": []
        },
        {
            "body": "good girl! <3",
            "author": null,
            "id": "fe4lup7",
            "parent_id": "t1_fe4kx4a",
            "score": 1,
            "created_utc": 1578860648.0,
            "replies": []
        },
        {
            "body": "Yes. It is either bitching, bragging, or long posts that do not follow a single direction making them hard to read. \n\nI should set my expectations lower.",
            "author": null,
            "id": "fe2t33v",
            "parent_id": "t1_fe2o1pw",
            "score": -1,
            "created_utc": 1578842545.0,
            "replies": [
                {
                    "body": "I don’t see how a woman sharing a good experience with a SD is bragging. She’s sharing something that has brought her joy, and, by doing so, she’s showing other SBs that it is possible to have a good SR with a SD who is caring, thoughtful, and generous. I see absolutely no problems with that.\n\nIf a person has a bad experience, and “bitches” about it here, sharing that educates the community on, perhaps, red flags, or warning signs, and gives the OP chance for feedback on whatever their experience had been. \n\nAnd if a person isn’t great at writing, perhaps their educational background wasn’t top-notch. Perhaps they never thrived in English classes, or never had a teacher who helped them to learn the importance of topic sentences, paragraph structure, etc.\n\nI can’t imagine being irritated by people being happy when their SR experiences are good, unhappy when their SR experiences are unpleasant, and not writing to your standards. You’ve shown me a level of misanthropy that, perhaps, exceeds (and contributes to) my own.",
                    "author": "ToxicGrad",
                    "id": "fe2v5a3",
                    "parent_id": "t1_fe2t33v",
                    "score": 3,
                    "created_utc": 1578843208.0,
                    "replies": [
                        {
                            "body": "👍🏻",
                            "author": "ruphun",
                            "id": "fe4zkzu",
                            "parent_id": "t1_fe2v5a3",
                            "score": 1,
                            "created_utc": 1578864246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I drink it black. I am trying to cut back on dairy. And I like it bitter lol. I started drinking it because I get up at 4 a.m for work and even though i'm a morning person that is just so gosh darn early lol.",
            "author": null,
            "id": "fe06cz6",
            "parent_id": "t1_fe062nb",
            "score": 6,
            "created_utc": 1578804190.0,
            "replies": [
                {
                    "body": "Oh dang. I consider myself a morning person too, but 4:00 a.m is an ugly hour to have to wake up. You deserve that coffee",
                    "author": null,
                    "id": "fe07odz",
                    "parent_id": "t1_fe06cz6",
                    "score": 4,
                    "created_utc": 1578805254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, my idea is specific to his profession. He is a pharmacist and I found a mug that looks like a google search for \"Best Pharmacist: We have 1 result for Best Pharmacist. Search Result: insert his name here (you customize the mug with his name). But i'm sure you could do the same thing with any profession really. I already have a sexy red VS teddy to wear. But i'm still brainstorming.",
            "author": null,
            "id": "fe04i2u",
            "parent_id": "t1_fe044b5",
            "score": 8,
            "created_utc": 1578802863.0,
            "replies": [
                {
                    "body": "Love the idea",
                    "author": null,
                    "id": "fe0m3qy",
                    "parent_id": "t1_fe04i2u",
                    "score": 1,
                    "created_utc": 1578815888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People want different things. If the girl wants more generosity than the ppm, I'm sure you agree that breaking up was the right thing to do.",
            "author": null,
            "id": "fe19xn4",
            "parent_id": "t1_fe0havb",
            "score": 6,
            "created_utc": 1578824215.0,
            "replies": [
                {
                    "body": "This. Like I said he wasn't under obligation to do that, but it would have been a nice gesture. If the SB felt uncared for because he's not willing (or can't) provide extra from the ppm than she should find another SD. Just like the SD can find another SB if he doesn't want a SB that desires extras.",
                    "author": null,
                    "id": "fe23idi",
                    "parent_id": "t1_fe19xn4",
                    "score": 2,
                    "created_utc": 1578834061.0,
                    "replies": []
                },
                {
                    "body": "If the girl agreed to a PPM and then wants more ... that's on her.\n\nIf I enter to an agreement, we come to terms on the arrangement and then you try to change the arrangement and get mad at me for not providing the \"extras\", who is at \"fault\" here?\n\nWho didn't hold up their end of the agreement?",
                    "author": "TexasSD",
                    "id": "fe2t9xs",
                    "parent_id": "t1_fe19xn4",
                    "score": -1,
                    "created_utc": 1578842618.0,
                    "replies": [
                        {
                            "body": "It all comes down to how many details it's possible to nail down beforehand. Would you prefer if she asked for xxx ppm + groceries every once in a while? And help out two times a year because her cat can get sick? And also have a contract stating that you will give her 100$ each year for Christmas?\n\nSome extras are not appropriate to ask for. Like during the negotiations, it would be a dealbreaker for me if a POT asked me about details around intimacy. Like, for how long do you want to fuck, will you give me oral, will you suck my balls, are you open to have a finger in your butt etc. Some things just have to be \"extras\" and I would say it's okay to expect them without asking for them beforehand. It's all part of the dating experience",
                            "author": null,
                            "id": "fe2ukri",
                            "parent_id": "t1_fe2t9xs",
                            "score": 4,
                            "created_utc": 1578843007.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He could still have been caring enough to let common sense dictate by offering her grocery money.",
            "author": "RealEarthAngel",
            "id": "fe2yh4v",
            "parent_id": "t1_fe0havb",
            "score": 3,
            "created_utc": 1578844241.0,
            "replies": []
        },
        {
            "body": "the SB is clearly attracted to generosity but isnt transactional. its a feedforward mechanism",
            "author": null,
            "id": "fe4k537",
            "parent_id": "t1_fe0havb",
            "score": 1,
            "created_utc": 1578860196.0,
            "replies": []
        },
        {
            "body": "Agreed",
            "author": "lovestolaugh11",
            "id": "fe6bucs",
            "parent_id": "t1_fe60jll",
            "score": 1,
            "created_utc": 1578886460.0,
            "replies": []
        },
        {
            "body": "No he did not.",
            "author": "lovestolaugh11",
            "id": "fe4o8ct",
            "parent_id": "t1_fe0he90",
            "score": 1,
            "created_utc": 1578861288.0,
            "replies": []
        },
        {
            "body": "Not sure why this is downvoted, its an honest question. If he paid his part of the agreement he's under no obligation to do more than that.  \n\n\nWould it be nice, yes.\n\nIs it required, no.",
            "author": "TexasSD",
            "id": "fe2tv9r",
            "parent_id": "t1_fe0he90",
            "score": 0,
            "created_utc": 1578842744.0,
            "replies": [
                {
                    "body": "I suspect this is an age-old issue that will never be resolved.\n\nSDs don't want to feel manipulated and also fear a slippery slope.  Pay for it once and it becomes he will always pay for that every time or he looks like a schmuck.   Some SDs are upper-middle class and they don't mind.  Others are very wealthy but also so careful with money they do mind.  They have a sugar budget and that's it.\n\nSBs see it as he has so much money.  This is nothing for him.  Why am I spending my hard-earned money when he could easily afford it.  And they can't help but get insulted.\n\nIts a problem in vanilla dating too.  I had it happen twice in LTRs after I first got divorced.",
                    "author": "soicansaywhatiwant",
                    "id": "fe3ews6",
                    "parent_id": "t1_fe2tv9r",
                    "score": 2,
                    "created_utc": 1578848678.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure it is but it’s also has a ton of time wasters, entitled people, rinsers and scammers. Wasn’t saying it was impose it but it’s much harder to find gems",
            "author": "ruphun",
            "id": "fe2lsmv",
            "parent_id": "t1_fe2fm54",
            "score": 0,
            "created_utc": 1578840159.0,
            "replies": []
        },
        {
            "body": "I appreciate you're ability to see its rarity, and know you will value and cherish what you're SD does for you.",
            "author": "ruphun",
            "id": "fe2d714",
            "parent_id": "t1_fe24xtt",
            "score": 0,
            "created_utc": 1578837095.0,
            "replies": []
        },
        {
            "body": "I don’t see how a woman sharing a good experience with a SD is bragging. She’s sharing something that has brought her joy, and, by doing so, she’s showing other SBs that it is possible to have a good SR with a SD who is caring, thoughtful, and generous. I see absolutely no problems with that.\n\nIf a person has a bad experience, and “bitches” about it here, sharing that educates the community on, perhaps, red flags, or warning signs, and gives the OP chance for feedback on whatever their experience had been. \n\nAnd if a person isn’t great at writing, perhaps their educational background wasn’t top-notch. Perhaps they never thrived in English classes, or never had a teacher who helped them to learn the importance of topic sentences, paragraph structure, etc.\n\nI can’t imagine being irritated by people being happy when their SR experiences are good, unhappy when their SR experiences are unpleasant, and not writing to your standards. You’ve shown me a level of misanthropy that, perhaps, exceeds (and contributes to) my own.",
            "author": "ToxicGrad",
            "id": "fe2v5a3",
            "parent_id": "t1_fe2t33v",
            "score": 3,
            "created_utc": 1578843208.0,
            "replies": [
                {
                    "body": "👍🏻",
                    "author": "ruphun",
                    "id": "fe4zkzu",
                    "parent_id": "t1_fe2v5a3",
                    "score": 1,
                    "created_utc": 1578864246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh dang. I consider myself a morning person too, but 4:00 a.m is an ugly hour to have to wake up. You deserve that coffee",
            "author": null,
            "id": "fe07odz",
            "parent_id": "t1_fe06cz6",
            "score": 4,
            "created_utc": 1578805254.0,
            "replies": []
        },
        {
            "body": "Love the idea",
            "author": null,
            "id": "fe0m3qy",
            "parent_id": "t1_fe04i2u",
            "score": 1,
            "created_utc": 1578815888.0,
            "replies": []
        },
        {
            "body": "This. Like I said he wasn't under obligation to do that, but it would have been a nice gesture. If the SB felt uncared for because he's not willing (or can't) provide extra from the ppm than she should find another SD. Just like the SD can find another SB if he doesn't want a SB that desires extras.",
            "author": null,
            "id": "fe23idi",
            "parent_id": "t1_fe19xn4",
            "score": 2,
            "created_utc": 1578834061.0,
            "replies": []
        },
        {
            "body": "If the girl agreed to a PPM and then wants more ... that's on her.\n\nIf I enter to an agreement, we come to terms on the arrangement and then you try to change the arrangement and get mad at me for not providing the \"extras\", who is at \"fault\" here?\n\nWho didn't hold up their end of the agreement?",
            "author": "TexasSD",
            "id": "fe2t9xs",
            "parent_id": "t1_fe19xn4",
            "score": -1,
            "created_utc": 1578842618.0,
            "replies": [
                {
                    "body": "It all comes down to how many details it's possible to nail down beforehand. Would you prefer if she asked for xxx ppm + groceries every once in a while? And help out two times a year because her cat can get sick? And also have a contract stating that you will give her 100$ each year for Christmas?\n\nSome extras are not appropriate to ask for. Like during the negotiations, it would be a dealbreaker for me if a POT asked me about details around intimacy. Like, for how long do you want to fuck, will you give me oral, will you suck my balls, are you open to have a finger in your butt etc. Some things just have to be \"extras\" and I would say it's okay to expect them without asking for them beforehand. It's all part of the dating experience",
                    "author": null,
                    "id": "fe2ukri",
                    "parent_id": "t1_fe2t9xs",
                    "score": 4,
                    "created_utc": 1578843007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I suspect this is an age-old issue that will never be resolved.\n\nSDs don't want to feel manipulated and also fear a slippery slope.  Pay for it once and it becomes he will always pay for that every time or he looks like a schmuck.   Some SDs are upper-middle class and they don't mind.  Others are very wealthy but also so careful with money they do mind.  They have a sugar budget and that's it.\n\nSBs see it as he has so much money.  This is nothing for him.  Why am I spending my hard-earned money when he could easily afford it.  And they can't help but get insulted.\n\nIts a problem in vanilla dating too.  I had it happen twice in LTRs after I first got divorced.",
            "author": "soicansaywhatiwant",
            "id": "fe3ews6",
            "parent_id": "t1_fe2tv9r",
            "score": 2,
            "created_utc": 1578848678.0,
            "replies": []
        },
        {
            "body": "👍🏻",
            "author": "ruphun",
            "id": "fe4zkzu",
            "parent_id": "t1_fe2v5a3",
            "score": 1,
            "created_utc": 1578864246.0,
            "replies": []
        },
        {
            "body": "It all comes down to how many details it's possible to nail down beforehand. Would you prefer if she asked for xxx ppm + groceries every once in a while? And help out two times a year because her cat can get sick? And also have a contract stating that you will give her 100$ each year for Christmas?\n\nSome extras are not appropriate to ask for. Like during the negotiations, it would be a dealbreaker for me if a POT asked me about details around intimacy. Like, for how long do you want to fuck, will you give me oral, will you suck my balls, are you open to have a finger in your butt etc. Some things just have to be \"extras\" and I would say it's okay to expect them without asking for them beforehand. It's all part of the dating experience",
            "author": null,
            "id": "fe2ukri",
            "parent_id": "t1_fe2t9xs",
            "score": 4,
            "created_utc": 1578843007.0,
            "replies": []
        }
    ]
}