{
    "title": "I think my SUgar bf (34) is dead",
    "post_id": "hbhpip",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hbhpip/i_think_my_sugar_bf_34_is_dead/",
    "author": "throwswayyyyhh",
    "body": "He hasn’t answered the phone in days — I thought he might’ve ghosted me but he really loves me. We didn’t have any issues. Today one of his co-workers called me saying everyone is calling him, saying he hasn’t signed on for work and his family can’t reach him. Messages don’t deliver to him. His whole family is in India abroad. I went to his apartment and he wouldn’t answer the door. I’m waiting for the police right now. I’m the last person to have contact with him, on Monday morning. Super  is giving me a hard time even though i said I was his girlfriend. Idk.\n\n\nUpdate: it’s almost midnight in NY. The police said him & his laptop are gone but his car is still there. There have been no updates from his co-workers. My messages still won’t send to him on WhatsApp, Facebook or imsg. I don’t want to make it about me but I’m honestly so scared and worried. He has been so kind and understanding towards me, all this time I’ve been able to rely on him and now he’s gone. I don’t know what to do and there is nothing I can do. His family needs to arrange an official missing persons report from abroad or something of that sort....\n\nUpdate: his co-worker just messaged me “Some one PA sent email that he is ok, but upset”, I’m glad to hear he’s okay. I think just disappearing on everyone when there’s so many people who are going to freak out is just so irresponsible.... idk. This whole situation has made me feel like I really don’t know him as well as I thought I did. Thank you to everyone who was kind. I feel dumb now, but I honestly expected the worst. He’s probably going to be upset with me for calling the police",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hbhpip/i_think_my_sugar_bf_34_is_dead/",
    "score": 102,
    "upvote_ratio": 0.96,
    "created_utc": 1592496993.0,
    "num_comments": 94,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I called the police 45 minutes ago and they’re still not here.",
            "author": "throwswayyyyhh",
            "id": "fv8vhn8",
            "parent_id": "t3_hbhpip",
            "score": 37,
            "created_utc": 1592497749.0,
            "replies": [
                {
                    "body": "Call the police again and ask again when you can expect an officer to arrive.\n\nRegarding the superintendent, sorry he wouldn't let you in, but that's for the resident's safety.  I'm sure you wouldn't be happy if some bitter ex or crazy guy went to your superintendent (if/when you ever rented) and asked to be let in because he's your bf and was.",
                    "author": "Church42",
                    "id": "fv9amwq",
                    "parent_id": "t1_fv8vhn8",
                    "score": 32,
                    "created_utc": 1592505653.0,
                    "replies": [
                        {
                            "body": "Update... police got here, were more concerned about identifying me. After an hour they finally decided to go on (they banged on his door and no response), they went in and he wasn’t there. Neither was his laptop. everything else is just as it was, his clothes seemed like they were there. More concerning is his car is still parked in the parking lot. His family has no idea where he is and messages can’t be delivered to him.",
                            "author": "throwswayyyyhh",
                            "id": "fv9bwso",
                            "parent_id": "t1_fv9amwq",
                            "score": 39,
                            "created_utc": 1592506422.0,
                            "replies": [
                                {
                                    "body": "If they performed a wellness check they would have to notify his family and inquire if they want a missing persons case opened.\n\nThat would allow them to track his phone, credit cards, etc. if you said his phone is still ringing then it’s charged and still receiving signal from a cell tower. They could find its location in less than an hour\n\nEdit: they would also immediately be able to rule out hospitals and morgues",
                                    "author": "KnocDown",
                                    "id": "fv9h2k8",
                                    "parent_id": "t1_fv9bwso",
                                    "score": 19,
                                    "created_utc": 1592509027.0,
                                    "replies": [
                                        {
                                            "body": "He’s international so he actually has no family over here. He doesn’t really talk to anyone so he doesn’t have a lot of friends either.. his phone stopped ringing (last night it did but today morning it goes right to voice mail)... they’re not treating it like a missing persons case though. So I just hope he will return. I was prepared for the worst when I went to his apartment today",
                                            "author": "throwswayyyyhh",
                                            "id": "fv9jddq",
                                            "parent_id": "t1_fv9h2k8",
                                            "score": 22,
                                            "created_utc": 1592510157.0,
                                            "replies": [
                                                {
                                                    "body": "> they’re not treating it like a missing persons case though.\n\nrequest an official wellness check on him, if the last encounter wasn't one already.\n\nThen they'll have to get a papertrail on it and have to notify family, if they then tell the police that the person is indeed missing they'll have all the ressources available to pursue it further with gps tracking etc.\n\nJust make it official and declare that you want a **wellness check**, if a colleague of him called you already, he can manage that through his next up as well.",
                                                    "author": "Nhiyla",
                                                    "id": "fva7dee",
                                                    "parent_id": "t1_fv9jddq",
                                                    "score": 5,
                                                    "created_utc": 1592522500.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Are you in Atlanta perchance?  If so, you might be waiting a while.",
                    "author": "dpark80",
                    "id": "fv9dsd9",
                    "parent_id": "t1_fv8vhn8",
                    "score": 3,
                    "created_utc": 1592507384.0,
                    "replies": [
                        {
                            "body": "Bronx. They did really take an hour lol",
                            "author": "throwswayyyyhh",
                            "id": "fv9jha6",
                            "parent_id": "t1_fv9dsd9",
                            "score": 10,
                            "created_utc": 1592510210.0,
                            "replies": [
                                {
                                    "body": "Good thing it wasn't an emergency!",
                                    "author": "dpark80",
                                    "id": "fv9l9jx",
                                    "parent_id": "t1_fv9jha6",
                                    "score": 2,
                                    "created_utc": 1592511083.0,
                                    "replies": [
                                        {
                                            "body": "Thats why it took an hour tho, they sort through priorities.",
                                            "author": "Nhiyla",
                                            "id": "fva7f43",
                                            "parent_id": "t1_fv9l9jx",
                                            "score": 9,
                                            "created_utc": 1592522526.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This seems like big city police SOP. They can't be bothered most of the time.",
                            "author": "WestSugarer",
                            "id": "fvakmmw",
                            "parent_id": "t1_fv9dsd9",
                            "score": 2,
                            "created_utc": 1592530249.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Does the super have a master key to go in the apartment?",
                    "author": "DramaticStruggle0",
                    "id": "fv9di16",
                    "parent_id": "t1_fv8vhn8",
                    "score": 1,
                    "created_utc": 1592507240.0,
                    "replies": []
                },
                {
                    "body": "Did they ever show up?",
                    "author": null,
                    "id": "fv9dqho",
                    "parent_id": "t1_fv8vhn8",
                    "score": 1,
                    "created_utc": 1592507357.0,
                    "replies": [
                        {
                            "body": "Yes, he wasn’t in his apartment. Neither was his laptop but his car was still there",
                            "author": "throwswayyyyhh",
                            "id": "fv9jf5m",
                            "parent_id": "t1_fv9dqho",
                            "score": 6,
                            "created_utc": 1592510181.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fv9xtrz",
                                    "parent_id": "t1_fv9jf5m",
                                    "score": 4,
                                    "created_utc": 1592517352.0,
                                    "replies": [
                                        {
                                            "body": ">  Today one of his co-workers called me saying everyone is calling him, saying he hasn’t signed on for work\n\nDoubt a min wage target worker with no ties is going to afford sugar.\n\nAnd someone up the chain typically won't bounce like that, so an international work trip is out of question already.",
                                            "author": "Nhiyla",
                                            "id": "fva7l44",
                                            "parent_id": "t1_fv9xtrz",
                                            "score": 2,
                                            "created_utc": 1592522621.0,
                                            "replies": [
                                                {
                                                    "body": "Target?!",
                                                    "author": "mraspencer",
                                                    "id": "fvac19m",
                                                    "parent_id": "t1_fva7l44",
                                                    "score": 2,
                                                    "created_utc": 1592525131.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If he works for a substantial company they can probably pressure to have his cell pinged and also recover any data from tracking .  However, in most of the large cities the police are overwhelmed with all of the BS going on.",
                    "author": "pinotandsugar",
                    "id": "fvb7f1k",
                    "parent_id": "t1_fv8vhn8",
                    "score": 1,
                    "created_utc": 1592545284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A wellness check by the police is necessary. You're doing the right thing.",
            "author": "ICN888",
            "id": "fv98wpv",
            "parent_id": "t3_hbhpip",
            "score": 11,
            "created_utc": 1592504220.0,
            "replies": []
        },
        {
            "body": "I hope he is OK 🤞🏼",
            "author": "ImaginaryBullfrog5",
            "id": "fv9amgx",
            "parent_id": "t3_hbhpip",
            "score": 7,
            "created_utc": 1592505642.0,
            "replies": []
        },
        {
            "body": "Shit I’m so sorry. Keep us updated please",
            "author": "absthaw",
            "id": "fv9itmo",
            "parent_id": "t3_hbhpip",
            "score": 6,
            "created_utc": 1592509888.0,
            "replies": []
        },
        {
            "body": "I’m sorry you are going through this. He might be depressed or sick and might have had to be admitted. Without phone, no way to contact you. I hope he’s fine and you guys are reunited soon.",
            "author": "supportiveceo",
            "id": "fv9khwz",
            "parent_id": "t3_hbhpip",
            "score": 5,
            "created_utc": 1592510706.0,
            "replies": [
                {
                    "body": "The police checked if he had been arrested or hospitalized.. none of that.",
                    "author": "throwswayyyyhh",
                    "id": "fvawpo7",
                    "parent_id": "t1_fv9khwz",
                    "score": 2,
                    "created_utc": 1592537712.0,
                    "replies": [
                        {
                            "body": "Glad to hear that. Hopefully he’s just drunk at some unknown friends home. Praying for his safe return soon",
                            "author": "supportiveceo",
                            "id": "fvb10bm",
                            "parent_id": "t1_fvawpo7",
                            "score": 1,
                            "created_utc": 1592540584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "RemindMe! Tomorrow",
            "author": "nthcoming",
            "id": "fv9u0fj",
            "parent_id": "t3_hbhpip",
            "score": 7,
            "created_utc": 1592515416.0,
            "replies": []
        },
        {
            "body": "Have you tried calling the hospitals? Do you have recent pictures of him? If so, use them in your search. And does he have hang out spots?\n\nHappy that you’re doing your own investigative work. \n\n——\n\nOnce upon a time, there was a woman who passed away on her couch. It took 3 years before someone thought to enter her apartment. That someone was her utilities company.",
            "author": "BeautyGr8ce",
            "id": "fv9snzs",
            "parent_id": "t3_hbhpip",
            "score": 6,
            "created_utc": 1592514738.0,
            "replies": [
                {
                    "body": "Unpaid rent actually: https://en.wikipedia.org/wiki/Joyce_Vincent\n\nThe TV was on the entire time!",
                    "author": "SeattleLaserMeteor",
                    "id": "fvaqcu1",
                    "parent_id": "t1_fv9snzs",
                    "score": 2,
                    "created_utc": 1592533765.0,
                    "replies": [
                        {
                            "body": "Hey, Thanks! 😃",
                            "author": "BeautyGr8ce",
                            "id": "fvaqnlu",
                            "parent_id": "t1_fvaqcu1",
                            "score": 1,
                            "created_utc": 1592533947.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He doesn’t leave his apartment unless it’s for groceries. He’s really paranoid of protests and corona",
                    "author": "throwswayyyyhh",
                    "id": "fvawsjp",
                    "parent_id": "t1_fv9snzs",
                    "score": 1,
                    "created_utc": 1592537763.0,
                    "replies": [
                        {
                            "body": "😳 ...surveillance cameras? You can ask the police to check this, or you can use whatever skills you can muster at this time and ask persons/businesses in the vicinity of his apartment. When asking, let them know how overwhelmed the police departments may be and that you want to ensure your friend is safe.\n\nDoes he use prescribed medications? If so, check nearby pharmacies. \n\nCheck on the rooftop of the apartment also. All elevators...\n\nMost importantly, do you have a support system right now...best friend, family, etc? Have someone who’s in physical reach to be a shoulder for you and anyone else’s who can help you in the search.",
                            "author": "BeautyGr8ce",
                            "id": "fvb31se",
                            "parent_id": "t1_fvawsjp",
                            "score": 2,
                            "created_utc": 1592542017.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is it possible he drove with one of his friends that his colleagues are not aware of? Is he on a work visa? Due to covid 19 there it's tough to get flights in and out of major cities in India right now so it will be hard for his family if they need to travel. Hope everything turns out fine.",
            "author": "zsum555",
            "id": "fv9xqd7",
            "parent_id": "t3_hbhpip",
            "score": 3,
            "created_utc": 1592517304.0,
            "replies": [
                {
                    "body": "I don’t think so. For him to not log into work is very not like him, his work is his most important thing. His coworker told me that everyone is calling asking where he is, clients included",
                    "author": "throwswayyyyhh",
                    "id": "fvawxur",
                    "parent_id": "t1_fv9xqd7",
                    "score": 1,
                    "created_utc": 1592537858.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so sorry this is happening to you ❤️ I'm sure you're really worried. Make sure to eat something and get some sleep if you haven't already. Maybe take a nice long bath. I hope everything turns out okay!",
            "author": "Actually_a_bot_accnt",
            "id": "fva4niz",
            "parent_id": "t3_hbhpip",
            "score": 3,
            "created_utc": 1592520978.0,
            "replies": []
        },
        {
            "body": "So what happened finally ? Did you find him ?",
            "author": "zenpelican",
            "id": "fvf9bwa",
            "parent_id": "t3_hbhpip",
            "score": 3,
            "created_utc": 1592641697.0,
            "replies": [
                {
                    "body": "His coworker got sent an email by another one saying he’s okay just upset. Still haven’t heard from him",
                    "author": "throwswayyyyhh",
                    "id": "fvfonx0",
                    "parent_id": "t1_fvf9bwa",
                    "score": 3,
                    "created_utc": 1592656778.0,
                    "replies": [
                        {
                            "body": "Omg wtf?!?! Is he for real?! 😳",
                            "author": "angiemama801",
                            "id": "fvh1auy",
                            "parent_id": "t1_fvfonx0",
                            "score": 1,
                            "created_utc": 1592685287.0,
                            "replies": [
                                {
                                    "body": "He is feeding her information through them.",
                                    "author": "garret6758",
                                    "id": "fvhvebr",
                                    "parent_id": "t1_fvh1auy",
                                    "score": 1,
                                    "created_utc": 1592702767.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How do I follow this story?Curious to know he is found .",
            "author": "InfiniteTemptation",
            "id": "fv9ocnl",
            "parent_id": "t3_hbhpip",
            "score": 5,
            "created_utc": 1592512602.0,
            "replies": [
                {
                    "body": "Me too!",
                    "author": "LikeHoney99",
                    "id": "fv9r0gc",
                    "parent_id": "t1_fv9ocnl",
                    "score": 1,
                    "created_utc": 1592513917.0,
                    "replies": [
                        {
                            "body": "Comment with \"Remind me! 24 hours\"\n\n(Or however many hours you want to be reminded to check this post)",
                            "author": "lofabread85",
                            "id": "fv9vj4n",
                            "parent_id": "t1_fv9r0gc",
                            "score": 3,
                            "created_utc": 1592516182.0,
                            "replies": [
                                {
                                    "body": "Does this work?",
                                    "author": "PioneerExperience",
                                    "id": "fval222",
                                    "parent_id": "t1_fv9vj4n",
                                    "score": 1,
                                    "created_utc": 1592530509.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my god this is terrifying. Keep us posted.\n\nSending prayers up for ya.",
            "author": "_Fortuna_",
            "id": "fv9z3im",
            "parent_id": "t3_hbhpip",
            "score": 2,
            "created_utc": 1592518005.0,
            "replies": []
        },
        {
            "body": "Its still too early to tell, but im sorry this is happening to you.",
            "author": "dade_murphy1",
            "id": "fva6zyv",
            "parent_id": "t3_hbhpip",
            "score": 2,
            "created_utc": 1592522293.0,
            "replies": []
        },
        {
            "body": "He’s probably going to be upset with me for calling the police\n\nWell, maybe he shouldn't have disappeared without letting people know. His action was irresponsible when you have loved ones.",
            "author": "GSSD",
            "id": "fvc63ph",
            "parent_id": "t3_hbhpip",
            "score": 2,
            "created_utc": 1592574940.0,
            "replies": [
                {
                    "body": "Oh, he let people know probably, she’s just out of that loop.",
                    "author": "garret6758",
                    "id": "fvd52zc",
                    "parent_id": "t1_fvc63ph",
                    "score": 2,
                    "created_utc": 1592592677.0,
                    "replies": []
                },
                {
                    "body": "It’s irresponsible, especially when it comes to work and given the current climate of things. Poor communication. I hope he wasn’t feeling suicidal. Now, the outcome of this audition will make it hard the next time OP has someone gone missing. This experience is a form of trauma. We all need to realize that being human means we are undeniably connected to someone...Unless we choose the hermit life\n\nHow old is this SD?",
                    "author": "BeautyGr8ce",
                    "id": "fvcs330",
                    "parent_id": "t1_fvc63ph",
                    "score": 1,
                    "created_utc": 1592586268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope he is okay. This must be rough, I hope you're okay too.",
            "author": "Ultrawenis",
            "id": "fvadbaa",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592525865.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "VikrantPatel",
            "id": "fvagj9z",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592527767.0,
            "replies": []
        },
        {
            "body": "Remind Me! 24 hours",
            "author": null,
            "id": "fvam9ft",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592531250.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "vswartz23",
            "id": "fvamq47",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592531537.0,
            "replies": []
        },
        {
            "body": "Remind me! 24 hours.\n\n\nI hope he’s okay 💞",
            "author": "spoopyghoul",
            "id": "fvap7xj",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592533061.0,
            "replies": []
        },
        {
            "body": "Remind Me! 12 hours",
            "author": "Aphrodisiatic922",
            "id": "fvawmw9",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592537662.0,
            "replies": []
        },
        {
            "body": "Remind me! 24 hours",
            "author": null,
            "id": "fvb1n3w",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592541021.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "thr2017b",
            "id": "fvb73ei",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592545031.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 Hours",
            "author": "bum_stabber",
            "id": "fvb9jw9",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592547025.0,
            "replies": []
        },
        {
            "body": "Remindme! 48 hours",
            "author": "phersephoneia",
            "id": "fvbb6n9",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592548411.0,
            "replies": []
        },
        {
            "body": "I hope everything is all right! Lots of big hugs and love sent to you <3 Stay strong and I hope he’s doing fine!",
            "author": null,
            "id": "fvbmnkr",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592559745.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "mariposam98",
            "id": "fvboj68",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592561676.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": null,
            "id": "fvc07gv",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592571321.0,
            "replies": []
        },
        {
            "body": "Remindme 24 hrs",
            "author": "DamselLilLadii",
            "id": "fvc35xl",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592573194.0,
            "replies": []
        },
        {
            "body": " RemindMe! 24hours",
            "author": "pintodinosaur",
            "id": "fvckxlx",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592582730.0,
            "replies": []
        },
        {
            "body": "RemindMe! 3 days",
            "author": "bum_stabber",
            "id": "fvgm8on",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592676867.0,
            "replies": []
        },
        {
            "body": "I hope you hear from him soon and he explains everything.  How are you holding up?",
            "author": "Greymattergone",
            "id": "fvhqyis",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592700062.0,
            "replies": []
        },
        {
            "body": "So.. just curious.. Any word on him yet?",
            "author": "ffreshindo",
            "id": "fvrmwqd",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592935991.0,
            "replies": [
                {
                    "body": "Nope. None of my messages deliver",
                    "author": "throwswayyyyhh",
                    "id": "fvwlf4x",
                    "parent_id": "t1_fvrmwqd",
                    "score": 1,
                    "created_utc": 1593041927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "RemindMe! 24hours",
            "author": "theneptunequeen",
            "id": "fv9wytq",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592516916.0,
            "replies": []
        },
        {
            "body": "Remindme! 24 hours",
            "author": "JurassicPark4ever",
            "id": "fva1fii",
            "parent_id": "t3_hbhpip",
            "score": 1,
            "created_utc": 1592519228.0,
            "replies": [
                {
                    "body": "Come back!",
                    "author": null,
                    "id": "fvac0od",
                    "parent_id": "t1_fva1fii",
                    "score": 2,
                    "created_utc": 1592525121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fvbv70q",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592567689.0,
            "replies": [
                {
                    "body": "This is just not true, no one can contact him, which I said. No ones messages deliver to him. I messaged him on FB when we never even had each other added, I could still see his profile so I doubt I’m blocked... He hasn’t signed onto work (he’s been working remotely), his family has no idea where he is..his co-workers are trying to find him. I wouldn’t have gone to his apartment to check on him if his co-worker didn’t call me, tell me this, and even asked me to. He has no one he communicates with in the area besides me, after all.",
                    "author": "throwswayyyyhh",
                    "id": "fvbz80r",
                    "parent_id": "t1_fvbv70q",
                    "score": 1,
                    "created_utc": 1592570654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Home boy bugged out. He’ll contact you when he wants to.",
            "author": "SebastianArnault",
            "id": "fva9a02",
            "parent_id": "t3_hbhpip",
            "score": -1,
            "created_utc": 1592523567.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24hours",
            "author": "shazzzaa",
            "id": "fv9ynr6",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592517779.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "sukh44",
            "id": "fva07pb",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592518587.0,
            "replies": []
        },
        {
            "body": "Remindme! 3days",
            "author": "grayvi2",
            "id": "fva14wa",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592519073.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "elainamurray",
            "id": "fva4hvw",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592520890.0,
            "replies": []
        },
        {
            "body": "RemindMe! 3 days",
            "author": null,
            "id": "fva5f87",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592521406.0,
            "replies": []
        },
        {
            "body": "RemindMe! 3 days",
            "author": "alleycat5703",
            "id": "fva5yqs",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592521714.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "topazreich",
            "id": "fva8vem",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592523337.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "cybernev",
            "id": "fva91ud",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592523437.0,
            "replies": []
        },
        {
            "body": "Remind me! 24 hours",
            "author": "2K4U",
            "id": "fva9e1t",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592523632.0,
            "replies": []
        },
        {
            "body": "Remindme! 24 hours",
            "author": "essentialcitrus",
            "id": "fva9sit",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592523863.0,
            "replies": []
        },
        {
            "body": "Checked jails and hospitals?",
            "author": "katyana77",
            "id": "fvacsqi",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592525568.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "kta-na",
            "id": "fvad5as",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592525769.0,
            "replies": []
        },
        {
            "body": "Remind Me! 24 hours",
            "author": "Royal-Progress",
            "id": "fvadvaj",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592526193.0,
            "replies": []
        },
        {
            "body": "RemindMe! 24 hours",
            "author": "Lyx_Chai",
            "id": "fvaedip",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592526489.0,
            "replies": []
        },
        {
            "body": "remind me! 24 hours",
            "author": "ale543girl",
            "id": "fvaeij2",
            "parent_id": "t3_hbhpip",
            "score": 0,
            "created_utc": 1592526571.0,
            "replies": []
        },
        {
            "body": "He ran off with his other SGF.",
            "author": "garret6758",
            "id": "fv9g0c2",
            "parent_id": "t3_hbhpip",
            "score": -13,
            "created_utc": 1592508499.0,
            "replies": [
                {
                    "body": "Without his car?",
                    "author": "sdphilly",
                    "id": "fv9gee2",
                    "parent_id": "t1_fv9g0c2",
                    "score": 4,
                    "created_utc": 1592508693.0,
                    "replies": [
                        {
                            "body": "He doesn't need his car if he left with someone with a car",
                            "author": "Church42",
                            "id": "fv9hsfd",
                            "parent_id": "t1_fv9gee2",
                            "score": 3,
                            "created_utc": 1592509378.0,
                            "replies": [
                                {
                                    "body": "Without notifying his job that allows him to sugar?\n\nNo one just vanishes like that lol\n\nNo information given to family, job, friends. Shady af.",
                                    "author": "Nhiyla",
                                    "id": "fva7nrh",
                                    "parent_id": "t1_fv9hsfd",
                                    "score": 5,
                                    "created_utc": 1592522663.0,
                                    "replies": [
                                        {
                                            "body": ">Without notifying his job that allows him to sugar?\n\nMaybe the job is just a job.  SDs often have active and passive sources of income.\n\nMy sugar money isn't dependent on me being employed.",
                                            "author": "Church42",
                                            "id": "fva82ks",
                                            "parent_id": "t1_fva7nrh",
                                            "score": 0,
                                            "created_utc": 1592522890.0,
                                            "replies": [
                                                {
                                                    "body": "Haha, I was mainly joking!\n\nHe could have easily had a coworker call you, it’s not like you called his workplace and is missing. There’s many details here that sound fishy.\n\nWhat are the real chances he’s 34 and dead.\n\nStill, I’m curious as to what happened. He could easily be out of town with his family.",
                                                    "author": "garret6758",
                                                    "id": "fvazp87",
                                                    "parent_id": "t1_fva82ks",
                                                    "score": -1,
                                                    "created_utc": 1592539684.0,
                                                    "replies": [
                                                        {
                                                            "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
                                                            "author": "garret6758",
                                                            "id": "fvhvlg7",
                                                            "parent_id": "t1_fvazp87",
                                                            "score": 2,
                                                            "created_utc": 1592702887.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like he may been deported",
            "author": "Agent_3w",
            "id": "fvaf4v7",
            "parent_id": "t3_hbhpip",
            "score": -2,
            "created_utc": 1592526934.0,
            "replies": [
                {
                    "body": "😒",
                    "author": "bsbdfw",
                    "id": "fvavtd5",
                    "parent_id": "t1_fvaf4v7",
                    "score": 0,
                    "created_utc": 1592537145.0,
                    "replies": [
                        {
                            "body": "Better than being dead",
                            "author": "Agent_3w",
                            "id": "fvaw41f",
                            "parent_id": "t1_fvavtd5",
                            "score": 0,
                            "created_utc": 1592537331.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Call the police again and ask again when you can expect an officer to arrive.\n\nRegarding the superintendent, sorry he wouldn't let you in, but that's for the resident's safety.  I'm sure you wouldn't be happy if some bitter ex or crazy guy went to your superintendent (if/when you ever rented) and asked to be let in because he's your bf and was.",
            "author": "Church42",
            "id": "fv9amwq",
            "parent_id": "t1_fv8vhn8",
            "score": 32,
            "created_utc": 1592505653.0,
            "replies": [
                {
                    "body": "Update... police got here, were more concerned about identifying me. After an hour they finally decided to go on (they banged on his door and no response), they went in and he wasn’t there. Neither was his laptop. everything else is just as it was, his clothes seemed like they were there. More concerning is his car is still parked in the parking lot. His family has no idea where he is and messages can’t be delivered to him.",
                    "author": "throwswayyyyhh",
                    "id": "fv9bwso",
                    "parent_id": "t1_fv9amwq",
                    "score": 39,
                    "created_utc": 1592506422.0,
                    "replies": [
                        {
                            "body": "If they performed a wellness check they would have to notify his family and inquire if they want a missing persons case opened.\n\nThat would allow them to track his phone, credit cards, etc. if you said his phone is still ringing then it’s charged and still receiving signal from a cell tower. They could find its location in less than an hour\n\nEdit: they would also immediately be able to rule out hospitals and morgues",
                            "author": "KnocDown",
                            "id": "fv9h2k8",
                            "parent_id": "t1_fv9bwso",
                            "score": 19,
                            "created_utc": 1592509027.0,
                            "replies": [
                                {
                                    "body": "He’s international so he actually has no family over here. He doesn’t really talk to anyone so he doesn’t have a lot of friends either.. his phone stopped ringing (last night it did but today morning it goes right to voice mail)... they’re not treating it like a missing persons case though. So I just hope he will return. I was prepared for the worst when I went to his apartment today",
                                    "author": "throwswayyyyhh",
                                    "id": "fv9jddq",
                                    "parent_id": "t1_fv9h2k8",
                                    "score": 22,
                                    "created_utc": 1592510157.0,
                                    "replies": [
                                        {
                                            "body": "> they’re not treating it like a missing persons case though.\n\nrequest an official wellness check on him, if the last encounter wasn't one already.\n\nThen they'll have to get a papertrail on it and have to notify family, if they then tell the police that the person is indeed missing they'll have all the ressources available to pursue it further with gps tracking etc.\n\nJust make it official and declare that you want a **wellness check**, if a colleague of him called you already, he can manage that through his next up as well.",
                                            "author": "Nhiyla",
                                            "id": "fva7dee",
                                            "parent_id": "t1_fv9jddq",
                                            "score": 5,
                                            "created_utc": 1592522500.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you in Atlanta perchance?  If so, you might be waiting a while.",
            "author": "dpark80",
            "id": "fv9dsd9",
            "parent_id": "t1_fv8vhn8",
            "score": 3,
            "created_utc": 1592507384.0,
            "replies": [
                {
                    "body": "Bronx. They did really take an hour lol",
                    "author": "throwswayyyyhh",
                    "id": "fv9jha6",
                    "parent_id": "t1_fv9dsd9",
                    "score": 10,
                    "created_utc": 1592510210.0,
                    "replies": [
                        {
                            "body": "Good thing it wasn't an emergency!",
                            "author": "dpark80",
                            "id": "fv9l9jx",
                            "parent_id": "t1_fv9jha6",
                            "score": 2,
                            "created_utc": 1592511083.0,
                            "replies": [
                                {
                                    "body": "Thats why it took an hour tho, they sort through priorities.",
                                    "author": "Nhiyla",
                                    "id": "fva7f43",
                                    "parent_id": "t1_fv9l9jx",
                                    "score": 9,
                                    "created_utc": 1592522526.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This seems like big city police SOP. They can't be bothered most of the time.",
                    "author": "WestSugarer",
                    "id": "fvakmmw",
                    "parent_id": "t1_fv9dsd9",
                    "score": 2,
                    "created_utc": 1592530249.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Does the super have a master key to go in the apartment?",
            "author": "DramaticStruggle0",
            "id": "fv9di16",
            "parent_id": "t1_fv8vhn8",
            "score": 1,
            "created_utc": 1592507240.0,
            "replies": []
        },
        {
            "body": "Did they ever show up?",
            "author": null,
            "id": "fv9dqho",
            "parent_id": "t1_fv8vhn8",
            "score": 1,
            "created_utc": 1592507357.0,
            "replies": [
                {
                    "body": "Yes, he wasn’t in his apartment. Neither was his laptop but his car was still there",
                    "author": "throwswayyyyhh",
                    "id": "fv9jf5m",
                    "parent_id": "t1_fv9dqho",
                    "score": 6,
                    "created_utc": 1592510181.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fv9xtrz",
                            "parent_id": "t1_fv9jf5m",
                            "score": 4,
                            "created_utc": 1592517352.0,
                            "replies": [
                                {
                                    "body": ">  Today one of his co-workers called me saying everyone is calling him, saying he hasn’t signed on for work\n\nDoubt a min wage target worker with no ties is going to afford sugar.\n\nAnd someone up the chain typically won't bounce like that, so an international work trip is out of question already.",
                                    "author": "Nhiyla",
                                    "id": "fva7l44",
                                    "parent_id": "t1_fv9xtrz",
                                    "score": 2,
                                    "created_utc": 1592522621.0,
                                    "replies": [
                                        {
                                            "body": "Target?!",
                                            "author": "mraspencer",
                                            "id": "fvac19m",
                                            "parent_id": "t1_fva7l44",
                                            "score": 2,
                                            "created_utc": 1592525131.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If he works for a substantial company they can probably pressure to have his cell pinged and also recover any data from tracking .  However, in most of the large cities the police are overwhelmed with all of the BS going on.",
            "author": "pinotandsugar",
            "id": "fvb7f1k",
            "parent_id": "t1_fv8vhn8",
            "score": 1,
            "created_utc": 1592545284.0,
            "replies": []
        },
        {
            "body": "The police checked if he had been arrested or hospitalized.. none of that.",
            "author": "throwswayyyyhh",
            "id": "fvawpo7",
            "parent_id": "t1_fv9khwz",
            "score": 2,
            "created_utc": 1592537712.0,
            "replies": [
                {
                    "body": "Glad to hear that. Hopefully he’s just drunk at some unknown friends home. Praying for his safe return soon",
                    "author": "supportiveceo",
                    "id": "fvb10bm",
                    "parent_id": "t1_fvawpo7",
                    "score": 1,
                    "created_utc": 1592540584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unpaid rent actually: https://en.wikipedia.org/wiki/Joyce_Vincent\n\nThe TV was on the entire time!",
            "author": "SeattleLaserMeteor",
            "id": "fvaqcu1",
            "parent_id": "t1_fv9snzs",
            "score": 2,
            "created_utc": 1592533765.0,
            "replies": [
                {
                    "body": "Hey, Thanks! 😃",
                    "author": "BeautyGr8ce",
                    "id": "fvaqnlu",
                    "parent_id": "t1_fvaqcu1",
                    "score": 1,
                    "created_utc": 1592533947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He doesn’t leave his apartment unless it’s for groceries. He’s really paranoid of protests and corona",
            "author": "throwswayyyyhh",
            "id": "fvawsjp",
            "parent_id": "t1_fv9snzs",
            "score": 1,
            "created_utc": 1592537763.0,
            "replies": [
                {
                    "body": "😳 ...surveillance cameras? You can ask the police to check this, or you can use whatever skills you can muster at this time and ask persons/businesses in the vicinity of his apartment. When asking, let them know how overwhelmed the police departments may be and that you want to ensure your friend is safe.\n\nDoes he use prescribed medications? If so, check nearby pharmacies. \n\nCheck on the rooftop of the apartment also. All elevators...\n\nMost importantly, do you have a support system right now...best friend, family, etc? Have someone who’s in physical reach to be a shoulder for you and anyone else’s who can help you in the search.",
                    "author": "BeautyGr8ce",
                    "id": "fvb31se",
                    "parent_id": "t1_fvawsjp",
                    "score": 2,
                    "created_utc": 1592542017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think so. For him to not log into work is very not like him, his work is his most important thing. His coworker told me that everyone is calling asking where he is, clients included",
            "author": "throwswayyyyhh",
            "id": "fvawxur",
            "parent_id": "t1_fv9xqd7",
            "score": 1,
            "created_utc": 1592537858.0,
            "replies": []
        },
        {
            "body": "His coworker got sent an email by another one saying he’s okay just upset. Still haven’t heard from him",
            "author": "throwswayyyyhh",
            "id": "fvfonx0",
            "parent_id": "t1_fvf9bwa",
            "score": 3,
            "created_utc": 1592656778.0,
            "replies": [
                {
                    "body": "Omg wtf?!?! Is he for real?! 😳",
                    "author": "angiemama801",
                    "id": "fvh1auy",
                    "parent_id": "t1_fvfonx0",
                    "score": 1,
                    "created_utc": 1592685287.0,
                    "replies": [
                        {
                            "body": "He is feeding her information through them.",
                            "author": "garret6758",
                            "id": "fvhvebr",
                            "parent_id": "t1_fvh1auy",
                            "score": 1,
                            "created_utc": 1592702767.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me too!",
            "author": "LikeHoney99",
            "id": "fv9r0gc",
            "parent_id": "t1_fv9ocnl",
            "score": 1,
            "created_utc": 1592513917.0,
            "replies": [
                {
                    "body": "Comment with \"Remind me! 24 hours\"\n\n(Or however many hours you want to be reminded to check this post)",
                    "author": "lofabread85",
                    "id": "fv9vj4n",
                    "parent_id": "t1_fv9r0gc",
                    "score": 3,
                    "created_utc": 1592516182.0,
                    "replies": [
                        {
                            "body": "Does this work?",
                            "author": "PioneerExperience",
                            "id": "fval222",
                            "parent_id": "t1_fv9vj4n",
                            "score": 1,
                            "created_utc": 1592530509.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh, he let people know probably, she’s just out of that loop.",
            "author": "garret6758",
            "id": "fvd52zc",
            "parent_id": "t1_fvc63ph",
            "score": 2,
            "created_utc": 1592592677.0,
            "replies": []
        },
        {
            "body": "It’s irresponsible, especially when it comes to work and given the current climate of things. Poor communication. I hope he wasn’t feeling suicidal. Now, the outcome of this audition will make it hard the next time OP has someone gone missing. This experience is a form of trauma. We all need to realize that being human means we are undeniably connected to someone...Unless we choose the hermit life\n\nHow old is this SD?",
            "author": "BeautyGr8ce",
            "id": "fvcs330",
            "parent_id": "t1_fvc63ph",
            "score": 1,
            "created_utc": 1592586268.0,
            "replies": []
        },
        {
            "body": "Nope. None of my messages deliver",
            "author": "throwswayyyyhh",
            "id": "fvwlf4x",
            "parent_id": "t1_fvrmwqd",
            "score": 1,
            "created_utc": 1593041927.0,
            "replies": []
        },
        {
            "body": "Come back!",
            "author": null,
            "id": "fvac0od",
            "parent_id": "t1_fva1fii",
            "score": 2,
            "created_utc": 1592525121.0,
            "replies": []
        },
        {
            "body": "This is just not true, no one can contact him, which I said. No ones messages deliver to him. I messaged him on FB when we never even had each other added, I could still see his profile so I doubt I’m blocked... He hasn’t signed onto work (he’s been working remotely), his family has no idea where he is..his co-workers are trying to find him. I wouldn’t have gone to his apartment to check on him if his co-worker didn’t call me, tell me this, and even asked me to. He has no one he communicates with in the area besides me, after all.",
            "author": "throwswayyyyhh",
            "id": "fvbz80r",
            "parent_id": "t1_fvbv70q",
            "score": 1,
            "created_utc": 1592570654.0,
            "replies": []
        },
        {
            "body": "Without his car?",
            "author": "sdphilly",
            "id": "fv9gee2",
            "parent_id": "t1_fv9g0c2",
            "score": 4,
            "created_utc": 1592508693.0,
            "replies": [
                {
                    "body": "He doesn't need his car if he left with someone with a car",
                    "author": "Church42",
                    "id": "fv9hsfd",
                    "parent_id": "t1_fv9gee2",
                    "score": 3,
                    "created_utc": 1592509378.0,
                    "replies": [
                        {
                            "body": "Without notifying his job that allows him to sugar?\n\nNo one just vanishes like that lol\n\nNo information given to family, job, friends. Shady af.",
                            "author": "Nhiyla",
                            "id": "fva7nrh",
                            "parent_id": "t1_fv9hsfd",
                            "score": 5,
                            "created_utc": 1592522663.0,
                            "replies": [
                                {
                                    "body": ">Without notifying his job that allows him to sugar?\n\nMaybe the job is just a job.  SDs often have active and passive sources of income.\n\nMy sugar money isn't dependent on me being employed.",
                                    "author": "Church42",
                                    "id": "fva82ks",
                                    "parent_id": "t1_fva7nrh",
                                    "score": 0,
                                    "created_utc": 1592522890.0,
                                    "replies": [
                                        {
                                            "body": "Haha, I was mainly joking!\n\nHe could have easily had a coworker call you, it’s not like you called his workplace and is missing. There’s many details here that sound fishy.\n\nWhat are the real chances he’s 34 and dead.\n\nStill, I’m curious as to what happened. He could easily be out of town with his family.",
                                            "author": "garret6758",
                                            "id": "fvazp87",
                                            "parent_id": "t1_fva82ks",
                                            "score": -1,
                                            "created_utc": 1592539684.0,
                                            "replies": [
                                                {
                                                    "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
                                                    "author": "garret6758",
                                                    "id": "fvhvlg7",
                                                    "parent_id": "t1_fvazp87",
                                                    "score": 2,
                                                    "created_utc": 1592702887.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😒",
            "author": "bsbdfw",
            "id": "fvavtd5",
            "parent_id": "t1_fvaf4v7",
            "score": 0,
            "created_utc": 1592537145.0,
            "replies": [
                {
                    "body": "Better than being dead",
                    "author": "Agent_3w",
                    "id": "fvaw41f",
                    "parent_id": "t1_fvavtd5",
                    "score": 0,
                    "created_utc": 1592537331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Update... police got here, were more concerned about identifying me. After an hour they finally decided to go on (they banged on his door and no response), they went in and he wasn’t there. Neither was his laptop. everything else is just as it was, his clothes seemed like they were there. More concerning is his car is still parked in the parking lot. His family has no idea where he is and messages can’t be delivered to him.",
            "author": "throwswayyyyhh",
            "id": "fv9bwso",
            "parent_id": "t1_fv9amwq",
            "score": 39,
            "created_utc": 1592506422.0,
            "replies": [
                {
                    "body": "If they performed a wellness check they would have to notify his family and inquire if they want a missing persons case opened.\n\nThat would allow them to track his phone, credit cards, etc. if you said his phone is still ringing then it’s charged and still receiving signal from a cell tower. They could find its location in less than an hour\n\nEdit: they would also immediately be able to rule out hospitals and morgues",
                    "author": "KnocDown",
                    "id": "fv9h2k8",
                    "parent_id": "t1_fv9bwso",
                    "score": 19,
                    "created_utc": 1592509027.0,
                    "replies": [
                        {
                            "body": "He’s international so he actually has no family over here. He doesn’t really talk to anyone so he doesn’t have a lot of friends either.. his phone stopped ringing (last night it did but today morning it goes right to voice mail)... they’re not treating it like a missing persons case though. So I just hope he will return. I was prepared for the worst when I went to his apartment today",
                            "author": "throwswayyyyhh",
                            "id": "fv9jddq",
                            "parent_id": "t1_fv9h2k8",
                            "score": 22,
                            "created_utc": 1592510157.0,
                            "replies": [
                                {
                                    "body": "> they’re not treating it like a missing persons case though.\n\nrequest an official wellness check on him, if the last encounter wasn't one already.\n\nThen they'll have to get a papertrail on it and have to notify family, if they then tell the police that the person is indeed missing they'll have all the ressources available to pursue it further with gps tracking etc.\n\nJust make it official and declare that you want a **wellness check**, if a colleague of him called you already, he can manage that through his next up as well.",
                                    "author": "Nhiyla",
                                    "id": "fva7dee",
                                    "parent_id": "t1_fv9jddq",
                                    "score": 5,
                                    "created_utc": 1592522500.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bronx. They did really take an hour lol",
            "author": "throwswayyyyhh",
            "id": "fv9jha6",
            "parent_id": "t1_fv9dsd9",
            "score": 10,
            "created_utc": 1592510210.0,
            "replies": [
                {
                    "body": "Good thing it wasn't an emergency!",
                    "author": "dpark80",
                    "id": "fv9l9jx",
                    "parent_id": "t1_fv9jha6",
                    "score": 2,
                    "created_utc": 1592511083.0,
                    "replies": [
                        {
                            "body": "Thats why it took an hour tho, they sort through priorities.",
                            "author": "Nhiyla",
                            "id": "fva7f43",
                            "parent_id": "t1_fv9l9jx",
                            "score": 9,
                            "created_utc": 1592522526.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This seems like big city police SOP. They can't be bothered most of the time.",
            "author": "WestSugarer",
            "id": "fvakmmw",
            "parent_id": "t1_fv9dsd9",
            "score": 2,
            "created_utc": 1592530249.0,
            "replies": []
        },
        {
            "body": "Yes, he wasn’t in his apartment. Neither was his laptop but his car was still there",
            "author": "throwswayyyyhh",
            "id": "fv9jf5m",
            "parent_id": "t1_fv9dqho",
            "score": 6,
            "created_utc": 1592510181.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fv9xtrz",
                    "parent_id": "t1_fv9jf5m",
                    "score": 4,
                    "created_utc": 1592517352.0,
                    "replies": [
                        {
                            "body": ">  Today one of his co-workers called me saying everyone is calling him, saying he hasn’t signed on for work\n\nDoubt a min wage target worker with no ties is going to afford sugar.\n\nAnd someone up the chain typically won't bounce like that, so an international work trip is out of question already.",
                            "author": "Nhiyla",
                            "id": "fva7l44",
                            "parent_id": "t1_fv9xtrz",
                            "score": 2,
                            "created_utc": 1592522621.0,
                            "replies": [
                                {
                                    "body": "Target?!",
                                    "author": "mraspencer",
                                    "id": "fvac19m",
                                    "parent_id": "t1_fva7l44",
                                    "score": 2,
                                    "created_utc": 1592525131.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Glad to hear that. Hopefully he’s just drunk at some unknown friends home. Praying for his safe return soon",
            "author": "supportiveceo",
            "id": "fvb10bm",
            "parent_id": "t1_fvawpo7",
            "score": 1,
            "created_utc": 1592540584.0,
            "replies": []
        },
        {
            "body": "Hey, Thanks! 😃",
            "author": "BeautyGr8ce",
            "id": "fvaqnlu",
            "parent_id": "t1_fvaqcu1",
            "score": 1,
            "created_utc": 1592533947.0,
            "replies": []
        },
        {
            "body": "😳 ...surveillance cameras? You can ask the police to check this, or you can use whatever skills you can muster at this time and ask persons/businesses in the vicinity of his apartment. When asking, let them know how overwhelmed the police departments may be and that you want to ensure your friend is safe.\n\nDoes he use prescribed medications? If so, check nearby pharmacies. \n\nCheck on the rooftop of the apartment also. All elevators...\n\nMost importantly, do you have a support system right now...best friend, family, etc? Have someone who’s in physical reach to be a shoulder for you and anyone else’s who can help you in the search.",
            "author": "BeautyGr8ce",
            "id": "fvb31se",
            "parent_id": "t1_fvawsjp",
            "score": 2,
            "created_utc": 1592542017.0,
            "replies": []
        },
        {
            "body": "Omg wtf?!?! Is he for real?! 😳",
            "author": "angiemama801",
            "id": "fvh1auy",
            "parent_id": "t1_fvfonx0",
            "score": 1,
            "created_utc": 1592685287.0,
            "replies": [
                {
                    "body": "He is feeding her information through them.",
                    "author": "garret6758",
                    "id": "fvhvebr",
                    "parent_id": "t1_fvh1auy",
                    "score": 1,
                    "created_utc": 1592702767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Comment with \"Remind me! 24 hours\"\n\n(Or however many hours you want to be reminded to check this post)",
            "author": "lofabread85",
            "id": "fv9vj4n",
            "parent_id": "t1_fv9r0gc",
            "score": 3,
            "created_utc": 1592516182.0,
            "replies": [
                {
                    "body": "Does this work?",
                    "author": "PioneerExperience",
                    "id": "fval222",
                    "parent_id": "t1_fv9vj4n",
                    "score": 1,
                    "created_utc": 1592530509.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He doesn't need his car if he left with someone with a car",
            "author": "Church42",
            "id": "fv9hsfd",
            "parent_id": "t1_fv9gee2",
            "score": 3,
            "created_utc": 1592509378.0,
            "replies": [
                {
                    "body": "Without notifying his job that allows him to sugar?\n\nNo one just vanishes like that lol\n\nNo information given to family, job, friends. Shady af.",
                    "author": "Nhiyla",
                    "id": "fva7nrh",
                    "parent_id": "t1_fv9hsfd",
                    "score": 5,
                    "created_utc": 1592522663.0,
                    "replies": [
                        {
                            "body": ">Without notifying his job that allows him to sugar?\n\nMaybe the job is just a job.  SDs often have active and passive sources of income.\n\nMy sugar money isn't dependent on me being employed.",
                            "author": "Church42",
                            "id": "fva82ks",
                            "parent_id": "t1_fva7nrh",
                            "score": 0,
                            "created_utc": 1592522890.0,
                            "replies": [
                                {
                                    "body": "Haha, I was mainly joking!\n\nHe could have easily had a coworker call you, it’s not like you called his workplace and is missing. There’s many details here that sound fishy.\n\nWhat are the real chances he’s 34 and dead.\n\nStill, I’m curious as to what happened. He could easily be out of town with his family.",
                                    "author": "garret6758",
                                    "id": "fvazp87",
                                    "parent_id": "t1_fva82ks",
                                    "score": -1,
                                    "created_utc": 1592539684.0,
                                    "replies": [
                                        {
                                            "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
                                            "author": "garret6758",
                                            "id": "fvhvlg7",
                                            "parent_id": "t1_fvazp87",
                                            "score": 2,
                                            "created_utc": 1592702887.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Better than being dead",
            "author": "Agent_3w",
            "id": "fvaw41f",
            "parent_id": "t1_fvavtd5",
            "score": 0,
            "created_utc": 1592537331.0,
            "replies": []
        },
        {
            "body": "If they performed a wellness check they would have to notify his family and inquire if they want a missing persons case opened.\n\nThat would allow them to track his phone, credit cards, etc. if you said his phone is still ringing then it’s charged and still receiving signal from a cell tower. They could find its location in less than an hour\n\nEdit: they would also immediately be able to rule out hospitals and morgues",
            "author": "KnocDown",
            "id": "fv9h2k8",
            "parent_id": "t1_fv9bwso",
            "score": 19,
            "created_utc": 1592509027.0,
            "replies": [
                {
                    "body": "He’s international so he actually has no family over here. He doesn’t really talk to anyone so he doesn’t have a lot of friends either.. his phone stopped ringing (last night it did but today morning it goes right to voice mail)... they’re not treating it like a missing persons case though. So I just hope he will return. I was prepared for the worst when I went to his apartment today",
                    "author": "throwswayyyyhh",
                    "id": "fv9jddq",
                    "parent_id": "t1_fv9h2k8",
                    "score": 22,
                    "created_utc": 1592510157.0,
                    "replies": [
                        {
                            "body": "> they’re not treating it like a missing persons case though.\n\nrequest an official wellness check on him, if the last encounter wasn't one already.\n\nThen they'll have to get a papertrail on it and have to notify family, if they then tell the police that the person is indeed missing they'll have all the ressources available to pursue it further with gps tracking etc.\n\nJust make it official and declare that you want a **wellness check**, if a colleague of him called you already, he can manage that through his next up as well.",
                            "author": "Nhiyla",
                            "id": "fva7dee",
                            "parent_id": "t1_fv9jddq",
                            "score": 5,
                            "created_utc": 1592522500.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good thing it wasn't an emergency!",
            "author": "dpark80",
            "id": "fv9l9jx",
            "parent_id": "t1_fv9jha6",
            "score": 2,
            "created_utc": 1592511083.0,
            "replies": [
                {
                    "body": "Thats why it took an hour tho, they sort through priorities.",
                    "author": "Nhiyla",
                    "id": "fva7f43",
                    "parent_id": "t1_fv9l9jx",
                    "score": 9,
                    "created_utc": 1592522526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fv9xtrz",
            "parent_id": "t1_fv9jf5m",
            "score": 4,
            "created_utc": 1592517352.0,
            "replies": [
                {
                    "body": ">  Today one of his co-workers called me saying everyone is calling him, saying he hasn’t signed on for work\n\nDoubt a min wage target worker with no ties is going to afford sugar.\n\nAnd someone up the chain typically won't bounce like that, so an international work trip is out of question already.",
                    "author": "Nhiyla",
                    "id": "fva7l44",
                    "parent_id": "t1_fv9xtrz",
                    "score": 2,
                    "created_utc": 1592522621.0,
                    "replies": [
                        {
                            "body": "Target?!",
                            "author": "mraspencer",
                            "id": "fvac19m",
                            "parent_id": "t1_fva7l44",
                            "score": 2,
                            "created_utc": 1592525131.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is feeding her information through them.",
            "author": "garret6758",
            "id": "fvhvebr",
            "parent_id": "t1_fvh1auy",
            "score": 1,
            "created_utc": 1592702767.0,
            "replies": []
        },
        {
            "body": "Does this work?",
            "author": "PioneerExperience",
            "id": "fval222",
            "parent_id": "t1_fv9vj4n",
            "score": 1,
            "created_utc": 1592530509.0,
            "replies": []
        },
        {
            "body": "Without notifying his job that allows him to sugar?\n\nNo one just vanishes like that lol\n\nNo information given to family, job, friends. Shady af.",
            "author": "Nhiyla",
            "id": "fva7nrh",
            "parent_id": "t1_fv9hsfd",
            "score": 5,
            "created_utc": 1592522663.0,
            "replies": [
                {
                    "body": ">Without notifying his job that allows him to sugar?\n\nMaybe the job is just a job.  SDs often have active and passive sources of income.\n\nMy sugar money isn't dependent on me being employed.",
                    "author": "Church42",
                    "id": "fva82ks",
                    "parent_id": "t1_fva7nrh",
                    "score": 0,
                    "created_utc": 1592522890.0,
                    "replies": [
                        {
                            "body": "Haha, I was mainly joking!\n\nHe could have easily had a coworker call you, it’s not like you called his workplace and is missing. There’s many details here that sound fishy.\n\nWhat are the real chances he’s 34 and dead.\n\nStill, I’m curious as to what happened. He could easily be out of town with his family.",
                            "author": "garret6758",
                            "id": "fvazp87",
                            "parent_id": "t1_fva82ks",
                            "score": -1,
                            "created_utc": 1592539684.0,
                            "replies": [
                                {
                                    "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
                                    "author": "garret6758",
                                    "id": "fvhvlg7",
                                    "parent_id": "t1_fvazp87",
                                    "score": 2,
                                    "created_utc": 1592702887.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’s international so he actually has no family over here. He doesn’t really talk to anyone so he doesn’t have a lot of friends either.. his phone stopped ringing (last night it did but today morning it goes right to voice mail)... they’re not treating it like a missing persons case though. So I just hope he will return. I was prepared for the worst when I went to his apartment today",
            "author": "throwswayyyyhh",
            "id": "fv9jddq",
            "parent_id": "t1_fv9h2k8",
            "score": 22,
            "created_utc": 1592510157.0,
            "replies": [
                {
                    "body": "> they’re not treating it like a missing persons case though.\n\nrequest an official wellness check on him, if the last encounter wasn't one already.\n\nThen they'll have to get a papertrail on it and have to notify family, if they then tell the police that the person is indeed missing they'll have all the ressources available to pursue it further with gps tracking etc.\n\nJust make it official and declare that you want a **wellness check**, if a colleague of him called you already, he can manage that through his next up as well.",
                    "author": "Nhiyla",
                    "id": "fva7dee",
                    "parent_id": "t1_fv9jddq",
                    "score": 5,
                    "created_utc": 1592522500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thats why it took an hour tho, they sort through priorities.",
            "author": "Nhiyla",
            "id": "fva7f43",
            "parent_id": "t1_fv9l9jx",
            "score": 9,
            "created_utc": 1592522526.0,
            "replies": []
        },
        {
            "body": ">  Today one of his co-workers called me saying everyone is calling him, saying he hasn’t signed on for work\n\nDoubt a min wage target worker with no ties is going to afford sugar.\n\nAnd someone up the chain typically won't bounce like that, so an international work trip is out of question already.",
            "author": "Nhiyla",
            "id": "fva7l44",
            "parent_id": "t1_fv9xtrz",
            "score": 2,
            "created_utc": 1592522621.0,
            "replies": [
                {
                    "body": "Target?!",
                    "author": "mraspencer",
                    "id": "fvac19m",
                    "parent_id": "t1_fva7l44",
                    "score": 2,
                    "created_utc": 1592525131.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Without notifying his job that allows him to sugar?\n\nMaybe the job is just a job.  SDs often have active and passive sources of income.\n\nMy sugar money isn't dependent on me being employed.",
            "author": "Church42",
            "id": "fva82ks",
            "parent_id": "t1_fva7nrh",
            "score": 0,
            "created_utc": 1592522890.0,
            "replies": [
                {
                    "body": "Haha, I was mainly joking!\n\nHe could have easily had a coworker call you, it’s not like you called his workplace and is missing. There’s many details here that sound fishy.\n\nWhat are the real chances he’s 34 and dead.\n\nStill, I’m curious as to what happened. He could easily be out of town with his family.",
                    "author": "garret6758",
                    "id": "fvazp87",
                    "parent_id": "t1_fva82ks",
                    "score": -1,
                    "created_utc": 1592539684.0,
                    "replies": [
                        {
                            "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
                            "author": "garret6758",
                            "id": "fvhvlg7",
                            "parent_id": "t1_fvazp87",
                            "score": 2,
                            "created_utc": 1592702887.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> they’re not treating it like a missing persons case though.\n\nrequest an official wellness check on him, if the last encounter wasn't one already.\n\nThen they'll have to get a papertrail on it and have to notify family, if they then tell the police that the person is indeed missing they'll have all the ressources available to pursue it further with gps tracking etc.\n\nJust make it official and declare that you want a **wellness check**, if a colleague of him called you already, he can manage that through his next up as well.",
            "author": "Nhiyla",
            "id": "fva7dee",
            "parent_id": "t1_fv9jddq",
            "score": 5,
            "created_utc": 1592522500.0,
            "replies": []
        },
        {
            "body": "Target?!",
            "author": "mraspencer",
            "id": "fvac19m",
            "parent_id": "t1_fva7l44",
            "score": 2,
            "created_utc": 1592525131.0,
            "replies": []
        },
        {
            "body": "Haha, I was mainly joking!\n\nHe could have easily had a coworker call you, it’s not like you called his workplace and is missing. There’s many details here that sound fishy.\n\nWhat are the real chances he’s 34 and dead.\n\nStill, I’m curious as to what happened. He could easily be out of town with his family.",
            "author": "garret6758",
            "id": "fvazp87",
            "parent_id": "t1_fva82ks",
            "score": -1,
            "created_utc": 1592539684.0,
            "replies": [
                {
                    "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
                    "author": "garret6758",
                    "id": "fvhvlg7",
                    "parent_id": "t1_fvazp87",
                    "score": 2,
                    "created_utc": 1592702887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love all the hate!\n\nNo real update to this? \n\nSounds like he isn’t missing from his job and really only ghosted HER, with one person from his work feeding her Information. It’s actually the most likely scenario and a bit predictable.",
            "author": "garret6758",
            "id": "fvhvlg7",
            "parent_id": "t1_fvazp87",
            "score": 2,
            "created_utc": 1592702887.0,
            "replies": []
        }
    ]
}