{
    "title": "My sugar baby (20F) didn't like the phone I gifted her and left the date",
    "post_id": "ia54yz",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ia54yz/my_sugar_baby_20f_didnt_like_the_phone_i_gifted/",
    "author": "hitonce_1919",
    "body": "Hi, I need an advice here \nI'm 30 M and I prefer to date in sugar life because tbh I won't be able to land beautiful girls in vanilla.\n\nSo I have been with this girl for 5 months, she asked me to buy her a gift for our 6 months anniversary, so I bought her a necklace and a galaxy S10 phone..\nWhen I gave her the phone she was upset I could tell.. \n\nI asked her what's wrong she said she was thinking I would giver her a better gift at least an iPhone or galaxy 20, a vacation etc\nThe thing is If she asked properly I would have given her anything she wanted but she asked me to surprise her and then she got upset and said she wanted to go home.\nI gave her the monthly allowance which was due on that day and she left and didn't contact for past 5 days. \nI kinda like her because she is so wild in bedroom but her personality set me off sometimes.\n\nEdit:  thanks for all the responses, I am sorry I can't reply to every comment. But you're all amazing and this forum is great. I have decided not to contact her and look for someone else. I don't mind that she disappeared after taking the allowance as it was due for that month. I reactivated my SA account and already had a few nice potential SB that I will try to set dates with.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ia54yz/my_sugar_baby_20f_didnt_like_the_phone_i_gifted/",
    "score": 122,
    "upvote_ratio": 0.93,
    "created_utc": 1597487810.0,
    "num_comments": 148,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It's a big red flag that she couldn't handle it in a more mature fashion. My SD got me a new phone without asking if I wanted one. My phone may be older but I have everything on it and I'm very comfortable with it. A phone is very personal and becomes like an appendage. The phone he bought me was a different size and manufacturer. The way I handled it was I told him it was the beautiful gesture and very appreciated but that I was very happy with the phone I have and why. We went together to Best Buy to return the phone and exchanged it for a bunch of Nest smart home accessories. Things I didn't know I wanted or needed but I love the convenience and safety and my SD is happy that I'm secure and happy.\n\nI really think your SB should be more appreciative and flexible. Just because it wasn't exactly what she wanted it could easily be exchanged.",
            "author": "tgibook",
            "id": "g1kk58p",
            "parent_id": "t3_ia54yz",
            "score": 128,
            "created_utc": 1597490447.0,
            "replies": [
                {
                    "body": "Thank you for the comment\nWhat bothered me is the lack of communication. She just got upset and left and never said anything. If she had asked for anything else I would give.\nShe gets a handsome amount so I really didn't like her attitude",
                    "author": "hitonce_1919",
                    "id": "g1ktoyf",
                    "parent_id": "t1_g1kk58p",
                    "score": 41,
                    "created_utc": 1597494264.0,
                    "replies": [
                        {
                            "body": "Agreed. I really find her behavior juvenile. You seem like a very giving SD. Gifts aren't always part of the SA. Good SDs are harder to find than exceptional SBs, especially right now. I would attempt to talk with her and see how she handles it. If after 5 days her demeanor hasn't improved maybe it's time to re-evaluate.",
                            "author": "tgibook",
                            "id": "g1kw994",
                            "parent_id": "t1_g1ktoyf",
                            "score": 21,
                            "created_utc": 1597495103.0,
                            "replies": [
                                {
                                    "body": "Thanks, do you think I should text her and ask what's all about?",
                                    "author": "hitonce_1919",
                                    "id": "g1kwqov",
                                    "parent_id": "t1_g1kw994",
                                    "score": 4,
                                    "created_utc": 1597495249.0,
                                    "replies": [
                                        {
                                            "body": "Honestly I don't think you should continue this relationship. I think any relationship can be abusive, manipulative, etc. That seems to me what you are stuck in. You can do better than this. If you can afford to be this generous then you will find a gorgeous sugar baby who will really appreciate this kind of a gesture. Just look at how many awesome people there are in these threads, talking about how much they love their sugar daddy, how he surprised them with some small gift and it made them swoon. Sorry to be a negative person but what's going on here is not going to get better. You can't fix this. And really, the great thing about a sugar relationship is you can just break it off. You paid what you owed, your karma is clean. \n\nThat's my belief. I just really think you can do better and it's not OK to be in a relationship where you're being treated that way. It won't get better.\n\nSorry.",
                                            "author": null,
                                            "id": "g1ma8rw",
                                            "parent_id": "t1_g1kwqov",
                                            "score": 19,
                                            "created_utc": 1597511419.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Dude, maybe i'm a petty asshole but here's what i'd do. Act like you are very sorry for such a cheap gift and ask for the phone back so you can buy her an iphone 11 pro.\n\nThen return it to the store and block her, THAT would be a great lesson.",
                                            "author": null,
                                            "id": "g1ntopj",
                                            "parent_id": "t1_g1kwqov",
                                            "score": 8,
                                            "created_utc": 1597528463.0,
                                            "replies": [
                                                {
                                                    "body": "[maybe i'm a petty asshole]^^\n\nYes u are. Good call.",
                                                    "author": "honey-_bunny",
                                                    "id": "g1pnj68",
                                                    "parent_id": "t1_g1ntopj",
                                                    "score": 6,
                                                    "created_utc": 1597557843.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Is that your primary form of communication? If so yes. Do you ever FaceTime or video chat? In a case like this I would want to see her expressions.",
                                            "author": "tgibook",
                                            "id": "g1kxadd",
                                            "parent_id": "t1_g1kwqov",
                                            "score": 2,
                                            "created_utc": 1597495418.0,
                                            "replies": [
                                                {
                                                    "body": "We video chat sometimes. But I don't feel like looking at her and get disappointed",
                                                    "author": "hitonce_1919",
                                                    "id": "g1kyceh",
                                                    "parent_id": "t1_g1kxadd",
                                                    "score": 1,
                                                    "created_utc": 1597495734.0,
                                                    "replies": [
                                                        {
                                                            "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
                                                            "author": "tgibook",
                                                            "id": "g1kyzlp",
                                                            "parent_id": "t1_g1kyceh",
                                                            "score": 3,
                                                            "created_utc": 1597495914.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Juvenile? She’s 20 years old 😂 she can’t even drink alcohol 🙃",
                                    "author": "Foreignbecky214",
                                    "id": "g1oa3po",
                                    "parent_id": "t1_g1kw994",
                                    "score": 10,
                                    "created_utc": 1597533755.0,
                                    "replies": [
                                        {
                                            "body": "They want the maturity and emotional intelligence of a 50 year old professor yet is  malleable and easily impressed with the body of a 20 yr. old too. \nThe logic is perfectly reasonable. 🙄🙄😂😂",
                                            "author": "honey-_bunny",
                                            "id": "g1pns5h",
                                            "parent_id": "t1_g1oa3po",
                                            "score": 10,
                                            "created_utc": 1597558061.0,
                                            "replies": [
                                                {
                                                    "body": "Lmao the accuracy!!!!",
                                                    "author": "Foreignbecky214",
                                                    "id": "g1pobkw",
                                                    "parent_id": "t1_g1pns5h",
                                                    "score": 9,
                                                    "created_utc": 1597558540.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "just because you are young doesn’t mean you can’t have manners lol. age is weak excuse to be an asshole.",
                                                    "author": "sheabuttersugarbaby",
                                                    "id": "g1q0ywz",
                                                    "parent_id": "t1_g1pns5h",
                                                    "score": 0,
                                                    "created_utc": 1597571368.0,
                                                    "replies": [
                                                        {
                                                            "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
                                                            "author": "honey-_bunny",
                                                            "id": "g1qqjsg",
                                                            "parent_id": "t1_g1q0ywz",
                                                            "score": 6,
                                                            "created_utc": 1597591533.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No lack of communication.......  she took the allowance and disappeared ..............\n\n\ntranslated    ADIOS  \n\n\nas a side note I've been an iPhone user for well over a decade and would not consider changing.  Year ago I   walked into their Santa Monica store and left without a phone but was so impressed by the operation that I bought some stock.",
                            "author": "pinotandsugar",
                            "id": "g1lk5no",
                            "parent_id": "t1_g1ktoyf",
                            "score": 4,
                            "created_utc": 1597503430.0,
                            "replies": [
                                {
                                    "body": "Lol",
                                    "author": null,
                                    "id": "g1onpvo",
                                    "parent_id": "t1_g1lk5no",
                                    "score": 1,
                                    "created_utc": 1597537842.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah that’s not nice 😕 sorry you had to experience that 💝",
                            "author": "TheIncantress",
                            "id": "g1m0w4q",
                            "parent_id": "t1_g1ktoyf",
                            "score": 2,
                            "created_utc": 1597508697.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She sounds like a spoiled brat. If I were you, I'd leave her in the rear-view mirror and find another SB who is more mature, kind, communicative, and appreciative. Her being wild in the bedroom is not reason enough to stick around after pulling something like that.",
            "author": "roscoe7585",
            "id": "g1lqqi9",
            "parent_id": "t3_ia54yz",
            "score": 26,
            "created_utc": 1597505417.0,
            "replies": []
        },
        {
            "body": "Next—she sounds very immature and ungrateful. I don’t think the “baby” in sugar baby means you date someone who acts like a child.",
            "author": null,
            "id": "g1lfm5o",
            "parent_id": "t3_ia54yz",
            "score": 17,
            "created_utc": 1597501942.0,
            "replies": []
        },
        {
            "body": "My SB and I talked through her anniversary gift (1 yr) and agreed on it first.  It almost sounds like your SB was debating whether to stay in the arrangement.  So she asks for more and tells herself she will skate if it’s not sufficiently generous to justify staying with you.  I would be thankful for the dates and move on.",
            "author": "MidwestAmMan",
            "id": "g1lacy0",
            "parent_id": "t3_ia54yz",
            "score": 9,
            "created_utc": 1597499655.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1mmdd6",
            "parent_id": "t3_ia54yz",
            "score": 8,
            "created_utc": 1597514758.0,
            "replies": [
                {
                    "body": ">sHe SoUnDs ImMaTuRe She's fucking 20! \n\nGuess what, plent of girls are way more mature at 20 or even before reaching adulthood.\n\nShe is the kind of woman that will always be a pain in the ass to deal with, be it at 20 or 40.",
                    "author": null,
                    "id": "g1nsljf",
                    "parent_id": "t1_g1mmdd6",
                    "score": 0,
                    "created_utc": 1597528120.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g1orz36",
                            "parent_id": "t1_g1nsljf",
                            "score": 7,
                            "created_utc": 1597539163.0,
                            "replies": [
                                {
                                    "body": ">She's a pain in the ass now because she's a child basically\n\nNope, she is an adult. Most people at her age are way more mature than that so age isn't a excuse.\n\nAnd hell, not even all teenagers are this kind of annoying.",
                                    "author": null,
                                    "id": "g1oskup",
                                    "parent_id": "t1_g1orz36",
                                    "score": 0,
                                    "created_utc": 1597539344.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g1ostvm",
                                            "parent_id": "t1_g1oskup",
                                            "score": 4,
                                            "created_utc": 1597539425.0,
                                            "replies": [
                                                {
                                                    "body": "I was a child and teenager, neither me or my sister were like this. And most people in highschool already knew better than being brats, the few that didn't usually have been getting their way since kids.",
                                                    "author": null,
                                                    "id": "g1otmor",
                                                    "parent_id": "t1_g1ostvm",
                                                    "score": 1,
                                                    "created_utc": 1597539659.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just curious, why didn’t you get her the S20? It’s the latest model. Was it because of the cost? Not that the S10 is a bad phone but if given a choice, most would go for the newer phone unless they can’t afford it.",
            "author": null,
            "id": "g1ltzyd",
            "parent_id": "t3_ia54yz",
            "score": 6,
            "created_utc": 1597506456.0,
            "replies": [
                {
                    "body": "This. The S10 came out years ago. It's like gifting a Iphone 7. There are three newer galaxy models out.",
                    "author": null,
                    "id": "g3bwaew",
                    "parent_id": "t1_g1ltzyd",
                    "score": 1,
                    "created_utc": 1598770682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She sounds like an ungrateful B word. I would move on.",
            "author": "Vixxen887",
            "id": "g1kdttb",
            "parent_id": "t3_ia54yz",
            "score": 35,
            "created_utc": 1597487971.0,
            "replies": [
                {
                    "body": "Unfortunately, I am starting to think like that. I have always spent well on her. this kind of came out of no where",
                    "author": "hitonce_1919",
                    "id": "g1kttu3",
                    "parent_id": "t1_g1kdttb",
                    "score": 4,
                    "created_utc": 1597494311.0,
                    "replies": [
                        {
                            "body": "I always live by the mantra “When someone shows you who they are, believe them the first time.” It may have been the first time she acted that way but if you keep seeing her, I guarantee it won’t be the last.",
                            "author": "Vixxen887",
                            "id": "g1kv45n",
                            "parent_id": "t1_g1kttu3",
                            "score": 20,
                            "created_utc": 1597494733.0,
                            "replies": [
                                {
                                    "body": "> When someone shows you who they are, believe them the first time.”\n\nThat is a classic and unfortunately true.",
                                    "author": "pinotandsugar",
                                    "id": "g1lkmtr",
                                    "parent_id": "t1_g1kv45n",
                                    "score": 10,
                                    "created_utc": 1597503562.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I personally couldn't recover from me going through the effort to get those gifts, and then that reaction.  I wouldn't be able to forgive or forget, I'd just be disgusted, so for me personally, I might have to peace out, as the kids say.\n\nThat said, in a zillion years I never would buy something this substantial for my SB of only 6 months -- especially a 20-year-old SB -- without a discussion.  If she asks me to surprise her, I can tell her \"I really want to get something you'll love and want to discuss together.  I've done surprises before and it worked out badly\".  IME, all you have to do is lightly push back, with a context of \"I want this to be perfect\", and 100% of women will accept it.  I'm not the best gift-buyer in the world, no fucking way I'm putting in this much time and effort, to risk disappointment.\n\nThe one alternative plan I sometimes take, if I have a general idea of what she wants, is to make the gift-buying itself an event.  If I know she'd like a purse, I'll take her out to a fancy dinner, we'll head to YSL (or whatever), I'll give her a budget and we'll go purse shopping together.  A 20-year-old will likely never have been in a YSL shopping for a purse that expensive, getting the posh treatment from the salesperson, feeling fancy, etc.  The entire thing will feel like an amazing luxury experience to her, and now you're part of that memory.  Don't be surprised if she IGs the fuck out of the whole thing.  Easy to do the same thing for the necklace, or even the phone (although the Verizon store is arguably less of a luxury experience lol).  The shopping trip to Dior or Chanel or wherever is itself part of the gift",
            "author": "Azurecole",
            "id": "g1lchaa",
            "parent_id": "t3_ia54yz",
            "score": 10,
            "created_utc": 1597500778.0,
            "replies": [
                {
                    "body": "...and watch “Pretty Woman” For few other basic tips as a short cut. u/hitonce_1919",
                    "author": "BeautyGr8ce",
                    "id": "g1n0irp",
                    "parent_id": "t1_g1lchaa",
                    "score": 3,
                    "created_utc": 1597519539.0,
                    "replies": [
                        {
                            "body": "Confession: I've never seen Pretty Woman!  Sounds like I should watch it for more tips lol",
                            "author": "Azurecole",
                            "id": "g1skhn3",
                            "parent_id": "t1_g1n0irp",
                            "score": 3,
                            "created_utc": 1597627586.0,
                            "replies": [
                                {
                                    "body": "Please do. Mind you, it’s a classic. So the insinuated tips may be basic in application to the present day sugar-babe. However, today’s SLF blowup may show that things haven’t changed.",
                                    "author": "BeautyGr8ce",
                                    "id": "g1sl5ei",
                                    "parent_id": "t1_g1skhn3",
                                    "score": 1,
                                    "created_utc": 1597627994.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hey, I know.\nWhat bothered me is investing into the relationship and getting a terrible response. I didn't want it to look like I am just giving her money for sex I went out of my way to buy the gifts.",
                    "author": "hitonce_1919",
                    "id": "g1n2hnh",
                    "parent_id": "t1_g1lchaa",
                    "score": 2,
                    "created_utc": 1597520111.0,
                    "replies": [
                        {
                            "body": "I think you're a good dude for doing so.  Not your fault she responded the way she did.  In fact, it may be a blessing in disguise that she's outing herself now.  I'm just suggesting there might be a lesson here -- in general, most of us SDs are probably not great at understanding what a young SB wants.  I suggesting avoiding the \"surprise me\" gift strategy whenever possible",
                            "author": "Azurecole",
                            "id": "g1nceqn",
                            "parent_id": "t1_g1n2hnh",
                            "score": 3,
                            "created_utc": 1597523204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you aren't getting the service you want, stop paying for the service. \n\nI think you've been nexted, if you haven't been pull back 100%. No calls texts or other forms of communication. Don't give her another penny. If/when she comes back, prorate her allowance for the time she hasn't communicated and DGAF when she gets mad about it.",
            "author": "princelydeeds",
            "id": "g1kn3op",
            "parent_id": "t3_ia54yz",
            "score": 15,
            "created_utc": 1597491666.0,
            "replies": [
                {
                    "body": "I am not sure what was the problem. She knows I am very generous. If she had asked for a better phone I would have given in a heartbeat",
                    "author": "hitonce_1919",
                    "id": "g1ktzm9",
                    "parent_id": "t1_g1kn3op",
                    "score": 7,
                    "created_utc": 1597494369.0,
                    "replies": [
                        {
                            "body": "She's the problem. She isn't mature enough to communicate like an adult.",
                            "author": "Actually_a_bot_accnt",
                            "id": "g1kzlqj",
                            "parent_id": "t1_g1ktzm9",
                            "score": 20,
                            "created_utc": 1597496091.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g1l8pbd",
                                    "parent_id": "t1_g1kzlqj",
                                    "score": 12,
                                    "created_utc": 1597499023.0,
                                    "replies": [
                                        {
                                            "body": "🤣🤣 right??? they are seriously confused by their own ridiculous expectations and faulty logic. \n\nThey want a mature, logical yet  worldly emotionally mature adult in a teen’s body and easily influenced spirit. U can’t make this up! It’s sad but hilarious.",
                                            "author": "honey-_bunny",
                                            "id": "g1po7jf",
                                            "parent_id": "t1_g1l8pbd",
                                            "score": 12,
                                            "created_utc": 1597558440.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You are attempting to be logical and rational with a 20 yr old female who is used to getting her way.\n\nChasing, offering more money, etc... Won't work. Cut her off completely and don't look back. Some people don't look at your kindness for what it is,they see at as weakness or desperation. In her mind you are no longer an alpha, you are just another clinger who won't say no.",
                            "author": "princelydeeds",
                            "id": "g1lqinq",
                            "parent_id": "t1_g1ktzm9",
                            "score": 9,
                            "created_utc": 1597505341.0,
                            "replies": [
                                {
                                    "body": "True. I appreciate when people do things for me (which is rare) so falsely extrapolated that to SBs with my gestures, with my generosity being directly related to how much I liked her.\n\nNever, not once, failed to get kicked in the very balls of my soul for that. End result, I don't any more.",
                                    "author": "god_sized_cock",
                                    "id": "g1n51bp",
                                    "parent_id": "t1_g1lqinq",
                                    "score": -1,
                                    "created_utc": 1597520952.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "She possibly subconsciously decided to end the arrangement and was looking for an excuse to make it \"your fault\".\n\nLook back on it, and you might find she has been giving other small signs of disinterest as well...that you didn't notice...or discounted.\n\nIf that's happened, then she's decided it's over, or, maybe you are relegated to an occasional meet when and if she wants and on her terms. Is that acceptable to you?  If that's the case, you might consider seeing an experienced domme, rather than your now-ex. I don’t mean that in a nasty or sarcastic way, but it is something you might like to explore as an alternative to taking this one back.",
                            "author": "Mangotingthroneway",
                            "id": "g1p4d6c",
                            "parent_id": "t1_g1ktzm9",
                            "score": 1,
                            "created_utc": 1597544614.0,
                            "replies": []
                        },
                        {
                            "body": "Your best bet is to get a life. 30 years old in the prime of your life and paying for an entitled prostitute.",
                            "author": "paradox501",
                            "id": "g1l9gu0",
                            "parent_id": "t1_g1ktzm9",
                            "score": -17,
                            "created_utc": 1597499305.0,
                            "replies": [
                                {
                                    "body": "Passing judgement on why the OP chooses this lifestyle does not require your opinion.  He explains why he chose this lifestyle in his post. Down voted.",
                                    "author": "rdu4u",
                                    "id": "g1lbkpb",
                                    "parent_id": "t1_g1l9gu0",
                                    "score": 8,
                                    "created_utc": 1597500393.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am an SD, I work in tech, and I am posting this using my S10.\n\nFuck this ungrateful little girl.\n\nYou deserve better. You should know your worth. I hope SA is still doing a special offer for membership.",
            "author": "eurosd",
            "id": "g1ktyrq",
            "parent_id": "t3_ia54yz",
            "score": 20,
            "created_utc": 1597494360.0,
            "replies": [
                {
                    "body": "Hahah, I am using S10 too. That's why I bought it for her because I like it",
                    "author": "hitonce_1919",
                    "id": "g1kx0xb",
                    "parent_id": "t1_g1ktyrq",
                    "score": 11,
                    "created_utc": 1597495342.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like a ten year old throwing a tantrum. Hope you move on and find a mature, respectful SB.",
            "author": "macaroonqueen",
            "id": "g1kvjyc",
            "parent_id": "t3_ia54yz",
            "score": 8,
            "created_utc": 1597494877.0,
            "replies": []
        },
        {
            "body": "Would I be correct this was not the first time something like this happened? If move on, be happy!",
            "author": "cujosdog",
            "id": "g1ksctz",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597493818.0,
            "replies": [
                {
                    "body": "It happened only once before in our 2nd date. Then everything was perfect I have been generous with her. \nWell I wanted to be ask here to see if it's common for SB to behave like this",
                    "author": "hitonce_1919",
                    "id": "g1kv8hw",
                    "parent_id": "t1_g1ksctz",
                    "score": 5,
                    "created_utc": 1597494767.0,
                    "replies": [
                        {
                            "body": "Sounds like you deserve something better and that there are a lot of SB who would be happy to be with you.   Learn  and use the info for screening.",
                            "author": "pinotandsugar",
                            "id": "g1lky2w",
                            "parent_id": "t1_g1kv8hw",
                            "score": 1,
                            "created_utc": 1597503655.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Delete and move on, these are fast pace (sometimes  superficial) relationships. Look for someone who is more mature and appreciative.",
            "author": "vdzz000",
            "id": "g1la51b",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597499538.0,
            "replies": []
        },
        {
            "body": "dodged a bullet.  cut and run.  hit the website dude.  personally i would not date a 20 year old SB.  hell, if i were gay i wouldn't date a 20 year old \"man\" either.",
            "author": "diamond__hands",
            "id": "g1mvad5",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597517999.0,
            "replies": []
        },
        {
            "body": "To be clear - she seems like rather immature... And if I were you I'd likly end it.  BUT that doesn't mean you can't learn better for the future.\n\nwtf dude.  You bought an S10?  (I just started googling to understand what that is)\n\nI'm guessing that although she didn't ask for a phone - there were some types of hint about wanting a phone.  I can understand being frustrated being gifted an old model phone in this type of situation.  You just seem a bit out of touch in this case.  I have 2 cousins about that age.  (22 and 20 actually).  And (at least growing up) they were always pushing their parents to get them the most new iphone, etc.  In some cases having the newest phone is also something of a status symbol.",
            "author": "SDstartingOut",
            "id": "g1ktcen",
            "parent_id": "t3_ia54yz",
            "score": 7,
            "created_utc": 1597494147.0,
            "replies": [
                {
                    "body": "She had hinted in our last meeting about her phone being old etc.\nMy main gift was a necklace, a very beautiful one.",
                    "author": "hitonce_1919",
                    "id": "g1kvtip",
                    "parent_id": "t1_g1ktcen",
                    "score": 3,
                    "created_utc": 1597494963.0,
                    "replies": [
                        {
                            "body": "So you gave her an expensive necklace, an upscale phone and a full month allowance at dinner and she left.........?     You deserve much better  and need to be much wiser",
                            "author": "pinotandsugar",
                            "id": "g1llrb4",
                            "parent_id": "t1_g1kvtip",
                            "score": 4,
                            "created_utc": 1597503900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "NEXT",
            "author": "BGDDDY1",
            "id": "g1klghr",
            "parent_id": "t3_ia54yz",
            "score": 8,
            "created_utc": 1597490977.0,
            "replies": []
        },
        {
            "body": "She’s not the one bro. Plenty of other wild kitties who are also mature.",
            "author": "burritoLovezz",
            "id": "g1kmfta",
            "parent_id": "t3_ia54yz",
            "score": 8,
            "created_utc": 1597491363.0,
            "replies": [
                {
                    "body": "I think you're right. I will reactivate my seeking account today",
                    "author": "hitonce_1919",
                    "id": "g1kuj44",
                    "parent_id": "t1_g1kmfta",
                    "score": 4,
                    "created_utc": 1597494555.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly her loss🤷🏽‍♀️ the s10 is a good phone. in my opinion samsung is ahead of iPhone these days.",
            "author": null,
            "id": "g1kr13s",
            "parent_id": "t3_ia54yz",
            "score": 9,
            "created_utc": 1597493378.0,
            "replies": [
                {
                    "body": "She doesn't know that I bought it because I liked it myself. I didn't think she will get upset for no real reason",
                    "author": "hitonce_1919",
                    "id": "g1ku6vp",
                    "parent_id": "t1_g1kr13s",
                    "score": 5,
                    "created_utc": 1597494442.0,
                    "replies": [
                        {
                            "body": "I would say rather talk to her about it or drop her. Thats alot of money you paid for the phone and if she wanted a specific one I imagine you guys are close enough that she could've asked you directly. There was no reason for her to be rude about it.",
                            "author": null,
                            "id": "g1kwb0e",
                            "parent_id": "t1_g1ku6vp",
                            "score": 3,
                            "created_utc": 1597495119.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She sounds childish and immature. I'd move on if I were you and I definitely wouldn't let someone treat me like that.",
            "author": "gameguystl",
            "id": "g1kofh4",
            "parent_id": "t3_ia54yz",
            "score": 4,
            "created_utc": 1597492421.0,
            "replies": [
                {
                    "body": "Thanks for the advice. I am definitely going to do that",
                    "author": "hitonce_1919",
                    "id": "g1kuw1t",
                    "parent_id": "t1_g1kofh4",
                    "score": 3,
                    "created_utc": 1597494660.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You got the money you have the power - the best thing about being a Sugar daddy is there is a line of hot babes for you to try but there are only so many blokes willing to blow cash on gold diggers - god knows im  one of them",
            "author": "Pastry1",
            "id": "g1ler7m",
            "parent_id": "t3_ia54yz",
            "score": 7,
            "created_utc": 1597501652.0,
            "replies": [
                {
                    "body": "Enough of this corny mentality please. If you think money gives you power in a SB/SD dynamic please do not continue sugaring lol.",
                    "author": "Sweet_Union_8551",
                    "id": "g1mtgbv",
                    "parent_id": "t1_g1ler7m",
                    "score": 10,
                    "created_utc": 1597517414.0,
                    "replies": [
                        {
                            "body": "Their entitled delusion blocks rational thinking.",
                            "author": "honey-_bunny",
                            "id": "g1pocu7",
                            "parent_id": "t1_g1mtgbv",
                            "score": 5,
                            "created_utc": 1597558570.0,
                            "replies": [
                                {
                                    "body": "it’s actually laughable, yes go off about how money is power behind your faceless account and no indication you actually have money lol",
                                    "author": "Sweet_Union_8551",
                                    "id": "g1ry77a",
                                    "parent_id": "t1_g1pocu7",
                                    "score": 6,
                                    "created_utc": 1597614510.0,
                                    "replies": [
                                        {
                                            "body": "90% or more of self-labeled “SDs” like on the forum SLF sugarlifesryleforum are not SDs. I suspect most are misogynists as well. That type lives to be mean to women online as they are cowards in the real world. . \n\nWould an occasional real SD who happened upon this forum stick around for the cruelty and depravity seen here? I think not. 🤔 😒 \n\nFact: Entitled guys like that wear the acronym SD like it’s a badge of honor and stick around for the sport of delusion and cruelty. They take glee in insulting women and brag about treating them as a disposable object.\n\nI’m preaching to the choir but they not only lack wealth but any character or shame  in their bitter stingy souls and bank accounts. . Obviously as they are not hiding their assholery. \n\nThey aren’t even a poor yet kind man one might encounter who pretends to be wealthy online as a form of escapism. Nope: They are TOXIC and cruel. They do not deserve our attention. Just like stupid, u cannot change mean and stingy. They will carry on being this way online unless a mod bans them.\n\nI make fun of them in their own language . Bad grammar and misuse of words as well, so they understand better.",
                                            "author": "honey-_bunny",
                                            "id": "g1shomt",
                                            "parent_id": "t1_g1ry77a",
                                            "score": 8,
                                            "created_utc": 1597625864.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t be so quick to bin the whole relationship. Tell her if she knew what she wanted, she should ask you to avoid disappointment. And explain to her how you didn’t like the way she handled it, in the future she should communicate maturely. If that’s too much of a big ask (which I doubt), then dump her. I hope you can grow through this, miscommunications happen.",
            "author": "topazreich",
            "id": "g1kop7e",
            "parent_id": "t3_ia54yz",
            "score": 5,
            "created_utc": 1597492544.0,
            "replies": [
                {
                    "body": "That’s not a miscommunication, that’s a spoiled brat",
                    "author": "HighOnGoofballs",
                    "id": "g1kriet",
                    "parent_id": "t1_g1kop7e",
                    "score": 7,
                    "created_utc": 1597493540.0,
                    "replies": [
                        {
                            "body": "We don’t know her. We don’t know if this one time is a representation of her character. I’m not defending her behaviour, (or even saying they should continue dating) I’m just saying have a conversation about the way they both feel, so they can understand each other better, and make each other happier. There’s no losses, only gains from communicating.\n\nHappy 5th reddit bday!",
                            "author": "topazreich",
                            "id": "g1kt564",
                            "parent_id": "t1_g1kriet",
                            "score": 5,
                            "created_utc": 1597494082.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm going to text her and I will reactivate my seeking account. If she acts like a bitch I will find someone else",
                    "author": "hitonce_1919",
                    "id": "g1kxv0j",
                    "parent_id": "t1_g1kop7e",
                    "score": 1,
                    "created_utc": 1597495584.0,
                    "replies": [
                        {
                            "body": "I wouldn't contact her, i would let her contact you. If She doesn't reach out , it confirmed that the relationship is over. Next time try to be tougher, manlier and less forgiving, women can sense weak men from a 1000 miles.",
                            "author": "vdzz000",
                            "id": "g1leuwj",
                            "parent_id": "t1_g1kxv0j",
                            "score": 1,
                            "created_utc": 1597501688.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I quit listening to the \"just keep her advice on this forum\", just keeping her has never resulted in anything good. When my gut tells me something it's a instant dump, it never gets better.",
                    "author": null,
                    "id": "g1kzu8g",
                    "parent_id": "t1_g1kop7e",
                    "score": 1,
                    "created_utc": 1597496184.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mate, to keep it seems like you may have been rewarding bad behaviour that has now lead to this sense of entitlement. You have mentioned how much you have spent on her many times throughout the thread. \n\nIn any form of dating, you need to be aware of red flags and never reward bad behaviour, or this is generally the outcome.\n\nYou got her a gift she didn’t like, so perhaps you didn’t ask the right questions to understand what she needed, but irrespective of whether you missed the mark, you should never expect someone takes an allowance you have generously given and ghosts you for 5 days. \n\nI would personally be showing her the door...",
            "author": "Intelli_gent_0601",
            "id": "g1l0lc2",
            "parent_id": "t3_ia54yz",
            "score": 5,
            "created_utc": 1597496460.0,
            "replies": []
        },
        {
            "body": "Part of her issue is her age. It's the truth. She's immature.",
            "author": "BlackBarbie2020",
            "id": "g1mbapj",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597511681.0,
            "replies": []
        },
        {
            "body": "Dodged a bullet!  I’m grateful for anything I receive.",
            "author": "iHeartTylerDurden",
            "id": "g1mrhhj",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597516486.0,
            "replies": []
        },
        {
            "body": "you’re not a mind reader. open communication is key in any relationship, and it’s unrealistic for her to expect you to know exactly what she wants when she specifically asked you to surprise her. sorry she was so rude to you :/",
            "author": "moobunny3",
            "id": "g1mrs0i",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597516643.0,
            "replies": []
        },
        {
            "body": "There's a reason most people refuse to have arrangements with people below 25. I hope you took the phone back! \n\nBetter luck next time, someone more grateful is out there. ♥ I would've loved a Galaxy, my phone is too heavy!",
            "author": "yeehaw_yall",
            "id": "g1nb387",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597522805.0,
            "replies": [
                {
                    "body": ">There's a reason most people refuse to have arrangements with people below 25.\n\nNot true at all, you are just pushing this sub's narrative that older SBs are more mature. In my experience, maturity has little to do with age, i should know, i used to daye a 30 yo trainwreck.",
                    "author": null,
                    "id": "g1nsz5p",
                    "parent_id": "t1_g1nb387",
                    "score": 2,
                    "created_utc": 1597528235.0,
                    "replies": [
                        {
                            "body": "If everyone is saying it, don't you think there's at least a little truth in the sentiment? Yes, there's exceptions to rules, and actually nobody said that older people are inherently more stable. Just more likely to be less flakey the older you go.",
                            "author": "yeehaw_yall",
                            "id": "g1r5e7f",
                            "parent_id": "t1_g1nsz5p",
                            "score": 3,
                            "created_utc": 1597599610.0,
                            "replies": [
                                {
                                    "body": ">If everyone is saying it, don't you think there's at least a little truth in the sentiment?\n\nWho's everyone? You are using weasel words.",
                                    "author": null,
                                    "id": "g1r5prm",
                                    "parent_id": "t1_g1r5e7f",
                                    "score": 0,
                                    "created_utc": 1597599783.0,
                                    "replies": [
                                        {
                                            "body": "1.) Your reply sounds like you're just here to argue.\n\n2.) You're the person who said that it's this \"sub's narrative.\"\n\n3.) Because of #1, this is my last reply to you. Take care.",
                                            "author": "yeehaw_yall",
                                            "id": "g1rizwk",
                                            "parent_id": "t1_g1r5prm",
                                            "score": 2,
                                            "created_utc": 1597606577.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you just need to see more mature women. She handled the situation in a childish manner.",
            "author": "ahhhhhh322",
            "id": "g1nwwho",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597529574.0,
            "replies": []
        },
        {
            "body": "Women prefer iPhones. Just say'n. But there are a lot of \"professional party girls\" on the site now-a-days. Women who make you think they are exclusive but are actually working a lot of SDs at the same time. It's amazing the extent they will go to deceive you. And once they determine you aren't paying enough, it's over for you. For them it's all about money, gifts, and travel. I would take a close look at her social media pages and see how she defines herself before you get to far into her. The Pros know just how to work a man but they cant help but show-off their spoils on Instagram or Snapchat. There are a lot of red-flags to watch out for and most of them on on social media.",
            "author": "AquariiATX",
            "id": "g1t23qc",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597639212.0,
            "replies": []
        },
        {
            "body": "Don’t let someone be so ungrateful like that! You did a kind thing, that’s more than enough. The right phone is a very spoilt thing to get upset about, a phone is a phone they’re expensive and they all do basically the same thing. If you’re looking for a new sugar baby HMU!",
            "author": "butterscotchgurlie",
            "id": "g722oes",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1601386277.0,
            "replies": []
        },
        {
            "body": ">but she asked me to surprise her and then she got upset\n\nSorry, this just makes me laugh.  It's such a stereotype of guy/girl relationships.\n\nAnyhow - not to judge, but just from what I've read here, she almost certainly has you pussy whipped *and* knows it, that's why she's behaving like that.  I think the relationship dynamics are probably already locked in and it'll be too hard to change; either accept it as a tradeoff or move on.",
            "author": "xxnightrain",
            "id": "g1kmfaj",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597491357.0,
            "replies": [
                {
                    "body": "I have been with 4 babies before and this one takes the cake, she is amazing in sex. I have been generous with her and have doubled her allowance. This behavior is really strange",
                    "author": "hitonce_1919",
                    "id": "g1kwf14",
                    "parent_id": "t1_g1kmfaj",
                    "score": 1,
                    "created_utc": 1597495156.0,
                    "replies": [
                        {
                            "body": "Being excessively generous without reciprocation will always blow up in your face plus you might appear desperate which is an unattractive quality. Why did you have to double her allowance unnecessarily? \n\nShe’s going to milk you as much as she can with all this drama. Dump her and find another wild SB. They are out there",
                            "author": "supportiveceo",
                            "id": "g1l43u5",
                            "parent_id": "t1_g1kwf14",
                            "score": 3,
                            "created_utc": 1597497583.0,
                            "replies": [
                                {
                                    "body": "This.",
                                    "author": "xxnightrain",
                                    "id": "g1nz0rh",
                                    "parent_id": "t1_g1l43u5",
                                    "score": 2,
                                    "created_utc": 1597530240.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you know what to do but you’re afraid of losing her.",
            "author": "midwestsweetking",
            "id": "g1kyvog",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597495884.0,
            "replies": []
        },
        {
            "body": "Being a daddy has an unspoken responsibility to help your sb mature reach their goals and teach them a little about life success.  Why in the world would you double her allowance?  Set her up with a crypto account and make some small deposits for her or do something to help her beyond teaching her to be reliant on sex for money.  Have you even talked to her about what she wants out of life beyond someone to but her a nice phone?",
            "author": "supercalc",
            "id": "g1lsxdb",
            "parent_id": "t3_ia54yz",
            "score": 4,
            "created_utc": 1597506109.0,
            "replies": []
        },
        {
            "body": "Don't ever purchase a phone that's not the latest and greatest period.  We all know S20s and S20 ultras are out. Can't be cheap wth someone you've been seeing for over 5 months. That's like purchasing a Lamborghini and trying to fill it with regular gas. Sorry buddy, you get no passes this time.",
            "author": "Cyberplexdc",
            "id": "g1mhpd6",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597513456.0,
            "replies": [
                {
                    "body": "🤣",
                    "author": "BeautyGr8ce",
                    "id": "g1mzg3b",
                    "parent_id": "t1_g1mhpd6",
                    "score": 3,
                    "created_utc": 1597519222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Preface: I’m not a SB and not in the bowl, I just like to read this thread.   My opinion is just that of a girl.  \n\nLots of ppl here telling you to just move on.  Probably true but in case you really like her and want to keep her, that advice is not helpful. \n\nFirst of all, the girls 20.  Dating young girls go hand in hand with immaturity.  Yes there are girls who can handle it better but at 20, they’re the exceptions not her.  \n\nAs for a galaxy S10...it’s not the latest or greatest so I understand her disappointment.   Just cuz she said surprise her didn’t mean she’d be happy with anything, she had expectations... u would run into these situations if she were your vanilla gf anyway.   \n\nIf you want to keep seeing her, act like a vanilla bf would act.  Crawl back, get her what she wants and have some wild makeup sex.   It’s not ur fault and she’s not a B... just unaligned expectations - and that happens in any realm of life.\n\nEdit to add:  I actually think she’s being more “real” to show u her disappointment cuz u can bet she would show her disappointment if u were her real bf too.  If I were you, I’d rather know her true feelings than for her to fake gratitude just cuz You’re paying her for sex.",
            "author": "PinkPingers",
            "id": "g1kv24h",
            "parent_id": "t3_ia54yz",
            "score": 6,
            "created_utc": 1597494715.0,
            "replies": [
                {
                    "body": ">If you want to keep seeing her, act like a vanilla bf would act.  Crawl back, get her what she wants and have some wild makeup sex. \n\nCRAWL BACK??? That's not a bf, that's a doormat. You are just telling OP to reward her shitty behavior. And no, that doesn't fly in vanilla dating either.\n\nBeing so dissapointed by a GIFT that you storm out? Screw that.\n\n&#x200B;\n\n\\> It’s not ur fault and she’s not a B... just unaligned expectations  \n\nShe is a total B.. and the only unaligned expectations is her expecting OP not to man up and kick her to the curb.",
                    "author": null,
                    "id": "g1ns7om",
                    "parent_id": "t1_g1kv24h",
                    "score": 4,
                    "created_utc": 1597527994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Spoiled brat.  Acting like that after 5 months of an arrangement?  Yeah, she's too young and immature to be in the bowl.",
            "author": "thrownawayNEFL",
            "id": "g1kp5vd",
            "parent_id": "t3_ia54yz",
            "score": 4,
            "created_utc": 1597492742.0,
            "replies": []
        },
        {
            "body": "Dang well I’ve been searching for a SD like you for a long time lol",
            "author": "BrooklynBella88",
            "id": "g1lhz3x",
            "parent_id": "t3_ia54yz",
            "score": 4,
            "created_utc": 1597502705.0,
            "replies": []
        },
        {
            "body": "Immaturity.  You can tolerate it or you can't.  The kind of woman you would never, ever want to marry.   \n\nI do agree with her that going with the S10 was a cheap move.  A woman of substance cannot be seen with such a loser phone.  :-)",
            "author": null,
            "id": "g1ksk5x",
            "parent_id": "t3_ia54yz",
            "score": 4,
            "created_utc": 1597493891.0,
            "replies": [
                {
                    "body": "Why are you ignoring the necklace. Idk if I'm allowed to say the cost. It was pretty expensive\nI am thinking it has to be something more than the phone",
                    "author": "hitonce_1919",
                    "id": "g1kvlld",
                    "parent_id": "t1_g1ksk5x",
                    "score": 4,
                    "created_utc": 1597494892.0,
                    "replies": [
                        {
                            "body": "She didn't ask for a necklace. She asked for a phone. So you should've got a new phone and then if you were insistent on an unwanted necklace then spent less on that.\n\nShe's clearly hot, she'll find someone else to her standards soon and I'm sure you can too. It wasn't meant to be.",
                            "author": "blonde-throwaway",
                            "id": "g1unppd",
                            "parent_id": "t1_g1kvlld",
                            "score": 3,
                            "created_utc": 1597669542.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "S10 costs 750+, its definitely not a cheap phone. \n\nA woman of substance doesn’t throw stupid tantrums like that, more like a self entitled brat.",
                    "author": "geekxp",
                    "id": "g1l5n05",
                    "parent_id": "t1_g1ksk5x",
                    "score": 4,
                    "created_utc": 1597498034.0,
                    "replies": []
                },
                {
                    "body": ">A woman of substance cannot be seen with such a loser phone.  :-)\n\nA woman that cares about what phone she is \"being seen\" with is by definition NOT a woman of substance.",
                    "author": null,
                    "id": "g1ntzi3",
                    "parent_id": "t1_g1ksk5x",
                    "score": 1,
                    "created_utc": 1597528581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude this is a relationship. Talk to her. Rarely do ppl reach 20 and know how to communicate their feelings. You'd be doing the same thing shutting her out and ending it.",
            "author": "hannooony",
            "id": "g1lao6t",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597499856.0,
            "replies": []
        },
        {
            "body": "Lots of SBs talk about wanting to be \"spoiled.\" Yours obviously is acting that way. Believe me, there's not a huge difference between an S10 and an S20, other than cost. But frankly this is one reason I am careful buying for others who can be difficult to please.",
            "author": "Intrepid_Seeker",
            "id": "g1kx9l3",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597495412.0,
            "replies": []
        },
        {
            "body": "Just to show the dissenting opinion.  Who is the insensitive one here?  How can you date someone for so long and not understand that you give a gift based on what the other person in the relationship wants.  Her reaction is imature but the emotions are real.  to realize that the person she is dating doesn’t know her well enough that she is an I phone person.  Sounds like you two are made for each other in terms of emotional maturity so play it out learn your lesson be more mature and let it blow over or move on.  But most importantly learn your lesson.",
            "author": "supercalc",
            "id": "g1lkk1s",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597503539.0,
            "replies": []
        },
        {
            "body": "Kick her to the curb. Don't need that kind if negativity in your life.",
            "author": "LifeIsShortImNot",
            "id": "g1l8l3q",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597498982.0,
            "replies": []
        },
        {
            "body": "Ungrateful and immature B. That's the kind of personality I can't stand dating.",
            "author": "Rich_Wishbone",
            "id": "g1lkeyz",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597503501.0,
            "replies": []
        },
        {
            "body": "I’m sorry, but that sort of unappreciative behavior and disregard is what splits marriages. There is NO reason in hell anyone should deal with that in a SR. You better get the oompah loompah soon too before she holds her breath til she turns blue.",
            "author": "SunnyWinter85",
            "id": "g1lqj60",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597505345.0,
            "replies": []
        },
        {
            "body": "You may be dating the wrong girls and for the wrong reasons.",
            "author": null,
            "id": "g1ltuk8",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597506404.0,
            "replies": []
        },
        {
            "body": "Time to start fresh",
            "author": null,
            "id": "g1kmpmz",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597491486.0,
            "replies": []
        },
        {
            "body": "Get rid of the entitled little brat.",
            "author": null,
            "id": "g1kzqau",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597496140.0,
            "replies": []
        },
        {
            "body": "It’s time to grow a set and you shouldn’t be throwing excessive amounts of allowance or gifs at an sb.  It comes off weak and teaches her to take advantage of you.  She isn’t your wife or gf.  And if she was you would get the same reaction or worse.  Learn your lesson here.  You created a monster by being weak, insensitive insecure and excessive.  We have all been there believe me.",
            "author": "supercalc",
            "id": "g1lnco1",
            "parent_id": "t3_ia54yz",
            "score": 3,
            "created_utc": 1597504382.0,
            "replies": []
        },
        {
            "body": "She sounds like a bitch. Time to next.",
            "author": "BigBearSD",
            "id": "g1kiw54",
            "parent_id": "t3_ia54yz",
            "score": 2,
            "created_utc": 1597489956.0,
            "replies": []
        },
        {
            "body": "Rude! (Of her!) unless she asked specifically or gave you enough hints, how would you know what she wanted. It was a gift! Next!",
            "author": "Terminally_Pr3tty",
            "id": "g1lbomh",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597500459.0,
            "replies": []
        },
        {
            "body": "Dump her, she has no gratitude for your effort or time. 20F says it all, tantrums to say the least. Sometimes ignoring her wants is the best solution. When her needs surpass the wants, she will get in touch with you. There are plenty of fish in the pond. Just don’t be desperate, have some patience. Rent will be due shortly and other expenses will come especially given the market conditions and covid. Hold your ground and wait for her to come back and apologize first.",
            "author": "sugardaddy153",
            "id": "g1m3475",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597509373.0,
            "replies": []
        },
        {
            "body": "I am appalled at her reaction. Having a generous person like you is literally my dream. You truly went out if your way and put a lot if thought into the gift you chose for her. \n\nIf u want my opinion,  I would NOT reach out to her. She is the one that OWES you a huge apology and should make the 1st move. \n\nShe does not deserve you.",
            "author": "CinderellaSnowBeauty",
            "id": "g1mrxqg",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597516728.0,
            "replies": []
        },
        {
            "body": "As a sugar baby myself, the immaturity that she has is insane. I get that we expect the best and the most but at the same time who are we to act like that when you're just trying to do something nice for us. I guess I'm just all about being fair because my relationship with my sugar daddy is more than him giving me whatever I want. I'm also a very firm believer of showing appreciation for what you get, and maybe she's just been on her high horse way too long. \n\nYou sound like a really great person, but I would not tolerate that if I were you. You gave her her allowance, anniversary gift which was a necklace and a phone. The only thing that you should be giving her is a kick to the curb right now.",
            "author": "lululove429",
            "id": "g1mwnhs",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597518402.0,
            "replies": []
        },
        {
            "body": "her behavior is immature and way off. good thing you did not devote more time to her, so be grateful for that\n\nas for the money, don't worry about it, you can afford",
            "author": "doctorcoolpop",
            "id": "g1nel4x",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597523895.0,
            "replies": []
        },
        {
            "body": "Damn. Lose the zero and get with a hero 🤣🤣",
            "author": "livnichole91",
            "id": "g1nxubj",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597529862.0,
            "replies": []
        },
        {
            "body": "Really disrespectful of her. I would see this as a glaring red flag",
            "author": "SelectIndependence3",
            "id": "g1nyfyn",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597530053.0,
            "replies": []
        },
        {
            "body": "I'm so sorry that happened. If I was that SB, I would have been thankful for it. A S10 is a awesome phone, I use the Samsung Ultra atm and Samsung is a excellent phone brand.\n\nI don't understand some young people. They think it's all glitz and glam. No, it's not. I do want a sugar daddy, to keep company and laugh at things with. The gifts are a bonus. Some people pull at my scarf ends that much.\n\nYou are awesome, just keep on being awesome and don't mind that girl, she is not worth it.",
            "author": "thedarksheikh",
            "id": "g1ob9lq",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597534099.0,
            "replies": []
        },
        {
            "body": "“ Hi, I need an advice here I'm 30 M and I prefer to date in sugar life because tbh I won't be able to land beautiful girls in vanilla.”\n\nGood lord not with that attitude.  You sound like you have a good job and make money.  You should be using your wealth to buy bottle service at high end clubs (the club promoters would be sending you hot girls from the club in exchange for paying for a bottle service), you then offer to take these girls on fun dates or vacations . \n\nOn second thought just spend all your money on high end whores/sugar babies if you really don’t think you could ever improve yourself enough to land a quality girl in regular dating. \n\nMost of the responses are spot on, this girls behavior is so bad because you repeatedly allow it and encourage it.  Just block her everywhere and do not ever contact her and hopefully you have learned that throwing Excessive money at a Sb will not always pan out for you, hopefully you learned that much.",
            "author": null,
            "id": "g1oxvyu",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597541050.0,
            "replies": []
        },
        {
            "body": "She is betting that you will call, offer to get a better phone for her, let her keep (and sell) the old one, and apologise.\n\nWill she win that bet?\n\nIt is highly possible that she's decided to end this, but is prepared to continue if you really really pay a premium...and she's seeing how high she can push that premium. If she gets the extra, next month she will push higher. And so on till you crack.",
            "author": "Mangotingthroneway",
            "id": "g1p5bw2",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597545175.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g37sig4",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1598680323.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "g37sihu",
                    "parent_id": "t1_g37sig4",
                    "score": 2,
                    "created_utc": 1598680324.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She’s young so that may factor in.  I’d say cut the loss and up the change a little.  You want someone that’s grateful and can communicate if they’re dissatisfied.  That gives you the opportunity to remedy it if necessary.  I wouldn’t trust it anymore because she received her monthly allowance and disappeared.  That’s the sign of a character flaw.",
            "author": "17Nest",
            "id": "g3pqkqy",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1599052534.0,
            "replies": []
        },
        {
            "body": "Take the phone back, buy her the one she wants and enjoy.\n\nOr, get someone who doesn't need the platinum version of everything to be happy.\n\nShe feels like you cheaped out, but what were *you* getting for the mythical six month anniversary (annum = year)? Nothing.\n\nAnyway you clearly can do the math here. Is your pride and another $300 worth the wild in bed that you like?\n\nProbably.\n\nSo buy her the gift and say you don't know much about phones.",
            "author": "amigodeface",
            "id": "g1khqtx",
            "parent_id": "t3_ia54yz",
            "score": 0,
            "created_utc": 1597489491.0,
            "replies": [
                {
                    "body": "She knows I'm not cheap. I spend well on her, I really didn't think it was because of the phone. I got confused because the necklace was pretty expensive too",
                    "author": "hitonce_1919",
                    "id": "g1kw4fl",
                    "parent_id": "t1_g1khqtx",
                    "score": 2,
                    "created_utc": 1597495061.0,
                    "replies": [
                        {
                            "body": "When she sees a less than top of the line phone she feels like you cheaped out. You didn't, it's an expensive phone and you got her two presents.\n\nI don't know why people are downvoting my advice. You said what you liked about her is that she is good in bed. You have two choices which is to stand on principle and find someone new, or else do the math and see if what you are getting is worth upping the ante on the phone.\n\nThat's just game theory. People can not like it, but if your other choices out there are less good than you think she is, you're going to have to invest your time in going through M and G and dealing with new bullshit instead of taking the existing bullshit in stride.\n\nIf you like her just upgrade the phone and it will be water under the bridge.",
                            "author": "amigodeface",
                            "id": "g1pxtdx",
                            "parent_id": "t1_g1kw4fl",
                            "score": 3,
                            "created_utc": 1597567922.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "g1khycx",
                    "parent_id": "t1_g1khqtx",
                    "score": 0,
                    "created_utc": 1597489577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1koat2",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597492364.0,
            "replies": [
                {
                    "body": "Hahah, I'm sure you will get someone great..\n If you live in Western Europe we might give it a shot",
                    "author": "hitonce_1919",
                    "id": "g1kusvi",
                    "parent_id": "t1_g1koat2",
                    "score": 3,
                    "created_utc": 1597494636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi , SB here, she sounds like a brat and she’s manipulating you, disappearing like that then she’s gonna come back expecting you to be extremely sorry and whipped or something stupid like that. You seem kind and very generous sooooo idk maybe look for another one",
            "author": "izzeizze",
            "id": "g1lbuph",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597500540.0,
            "replies": [
                {
                    "body": "Exactly this.  She'll make him feel like he was wrong and needs to make it up to her.\n\nI think he should leave her but if he thinks he wants to keep her he better be strong, make her come to him and make HER apologize for her lack of appreciation. If he can do that she might  show some respect (for a little while)",
                    "author": "Volturi6271",
                    "id": "g1lsa8s",
                    "parent_id": "t1_g1lbuph",
                    "score": 3,
                    "created_utc": 1597505916.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think she’s ungrateful and not worth your time or effort. In five months she should at least feel comfortable enough to openly ask for what she wants. Think of saying goodbye to her.",
            "author": "MissMabeliita",
            "id": "g1lcbxc",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597500723.0,
            "replies": []
        },
        {
            "body": "Honestly I say cut her off if she isn’t grateful for the gifts you gave her out of the kindness of your heart and decides not to talk to you over the smallest little thing like that is not someone you want in your life",
            "author": "panicalwayd",
            "id": "g1lclg9",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597500821.0,
            "replies": []
        },
        {
            "body": "Yikes- maybe she doesn’t like the agreed allowance? I’d touch base for sure. But also if she thinks that’s fair her attitude about the gift isn’t very kind- I think you should stay in the bowl and keep looking for someone that matches your lifestyle -experienced sb",
            "author": "Affectionate_Goat667",
            "id": "g1lhj63",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597502561.0,
            "replies": []
        },
        {
            "body": "No way could she apologize enough for me to continue seeing her. She’s ungrateful and obviously materialistic. \n\nShit, I gave my SB a SPORK (among other gifts) and she was thrilled!",
            "author": "mraspencer",
            "id": "g1ltuhk",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597506404.0,
            "replies": []
        },
        {
            "body": "Sounds like an immature bitch. Downside is that it sounds like it’s over, so you’re out this months allowance. Upside is that you don’t need to do anything to end it.",
            "author": "sdthrowaway006",
            "id": "g1m8dt3",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597510908.0,
            "replies": []
        },
        {
            "body": "Cut her loose",
            "author": null,
            "id": "g1maoxs",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597511523.0,
            "replies": []
        },
        {
            "body": "Wow. The first thing I thought was selfish. Thats rude of her. She should be grateful.",
            "author": "420_spice",
            "id": "g1mcp07",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597512054.0,
            "replies": []
        },
        {
            "body": "She was very immature to do that. If she said to surprise her there was no reason to get mad at what you gave her. You are too kind. If I was you I would just walk away like many say there is alot of sugar babys looking that would be more appreciative to what they are given. No matter what relationship you are in communication is key. To be treated that way is not acceptable.",
            "author": "pandababy9",
            "id": "g1me2fb",
            "parent_id": "t3_ia54yz",
            "score": 1,
            "created_utc": 1597512441.0,
            "replies": []
        },
        {
            "body": "If you can still get in contact with her, maybe you can get the phone back under the pretext of exchanging it for a better one? ... then ghost her! It's not often I'd recommend ghosting, but she deserves it.\n\nAlso, nobody else seems to want to mention it, but these sort of stories are the reason why many SDs will insist on PPM - even after 5 months! Everyone is talking about the phone, but the monthly allowance that she got for absolutely nothing was probably way more than the phone cost.",
            "author": "SkepticalChallenge",
            "id": "g1nds37",
            "parent_id": "t3_ia54yz",
            "score": 0,
            "created_utc": 1597523637.0,
            "replies": []
        },
        {
            "body": "Thank you for the comment\nWhat bothered me is the lack of communication. She just got upset and left and never said anything. If she had asked for anything else I would give.\nShe gets a handsome amount so I really didn't like her attitude",
            "author": "hitonce_1919",
            "id": "g1ktoyf",
            "parent_id": "t1_g1kk58p",
            "score": 41,
            "created_utc": 1597494264.0,
            "replies": [
                {
                    "body": "Agreed. I really find her behavior juvenile. You seem like a very giving SD. Gifts aren't always part of the SA. Good SDs are harder to find than exceptional SBs, especially right now. I would attempt to talk with her and see how she handles it. If after 5 days her demeanor hasn't improved maybe it's time to re-evaluate.",
                    "author": "tgibook",
                    "id": "g1kw994",
                    "parent_id": "t1_g1ktoyf",
                    "score": 21,
                    "created_utc": 1597495103.0,
                    "replies": [
                        {
                            "body": "Thanks, do you think I should text her and ask what's all about?",
                            "author": "hitonce_1919",
                            "id": "g1kwqov",
                            "parent_id": "t1_g1kw994",
                            "score": 4,
                            "created_utc": 1597495249.0,
                            "replies": [
                                {
                                    "body": "Honestly I don't think you should continue this relationship. I think any relationship can be abusive, manipulative, etc. That seems to me what you are stuck in. You can do better than this. If you can afford to be this generous then you will find a gorgeous sugar baby who will really appreciate this kind of a gesture. Just look at how many awesome people there are in these threads, talking about how much they love their sugar daddy, how he surprised them with some small gift and it made them swoon. Sorry to be a negative person but what's going on here is not going to get better. You can't fix this. And really, the great thing about a sugar relationship is you can just break it off. You paid what you owed, your karma is clean. \n\nThat's my belief. I just really think you can do better and it's not OK to be in a relationship where you're being treated that way. It won't get better.\n\nSorry.",
                                    "author": null,
                                    "id": "g1ma8rw",
                                    "parent_id": "t1_g1kwqov",
                                    "score": 19,
                                    "created_utc": 1597511419.0,
                                    "replies": []
                                },
                                {
                                    "body": "Dude, maybe i'm a petty asshole but here's what i'd do. Act like you are very sorry for such a cheap gift and ask for the phone back so you can buy her an iphone 11 pro.\n\nThen return it to the store and block her, THAT would be a great lesson.",
                                    "author": null,
                                    "id": "g1ntopj",
                                    "parent_id": "t1_g1kwqov",
                                    "score": 8,
                                    "created_utc": 1597528463.0,
                                    "replies": [
                                        {
                                            "body": "[maybe i'm a petty asshole]^^\n\nYes u are. Good call.",
                                            "author": "honey-_bunny",
                                            "id": "g1pnj68",
                                            "parent_id": "t1_g1ntopj",
                                            "score": 6,
                                            "created_utc": 1597557843.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Is that your primary form of communication? If so yes. Do you ever FaceTime or video chat? In a case like this I would want to see her expressions.",
                                    "author": "tgibook",
                                    "id": "g1kxadd",
                                    "parent_id": "t1_g1kwqov",
                                    "score": 2,
                                    "created_utc": 1597495418.0,
                                    "replies": [
                                        {
                                            "body": "We video chat sometimes. But I don't feel like looking at her and get disappointed",
                                            "author": "hitonce_1919",
                                            "id": "g1kyceh",
                                            "parent_id": "t1_g1kxadd",
                                            "score": 1,
                                            "created_utc": 1597495734.0,
                                            "replies": [
                                                {
                                                    "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
                                                    "author": "tgibook",
                                                    "id": "g1kyzlp",
                                                    "parent_id": "t1_g1kyceh",
                                                    "score": 3,
                                                    "created_utc": 1597495914.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Juvenile? She’s 20 years old 😂 she can’t even drink alcohol 🙃",
                            "author": "Foreignbecky214",
                            "id": "g1oa3po",
                            "parent_id": "t1_g1kw994",
                            "score": 10,
                            "created_utc": 1597533755.0,
                            "replies": [
                                {
                                    "body": "They want the maturity and emotional intelligence of a 50 year old professor yet is  malleable and easily impressed with the body of a 20 yr. old too. \nThe logic is perfectly reasonable. 🙄🙄😂😂",
                                    "author": "honey-_bunny",
                                    "id": "g1pns5h",
                                    "parent_id": "t1_g1oa3po",
                                    "score": 10,
                                    "created_utc": 1597558061.0,
                                    "replies": [
                                        {
                                            "body": "Lmao the accuracy!!!!",
                                            "author": "Foreignbecky214",
                                            "id": "g1pobkw",
                                            "parent_id": "t1_g1pns5h",
                                            "score": 9,
                                            "created_utc": 1597558540.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "just because you are young doesn’t mean you can’t have manners lol. age is weak excuse to be an asshole.",
                                            "author": "sheabuttersugarbaby",
                                            "id": "g1q0ywz",
                                            "parent_id": "t1_g1pns5h",
                                            "score": 0,
                                            "created_utc": 1597571368.0,
                                            "replies": [
                                                {
                                                    "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
                                                    "author": "honey-_bunny",
                                                    "id": "g1qqjsg",
                                                    "parent_id": "t1_g1q0ywz",
                                                    "score": 6,
                                                    "created_utc": 1597591533.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No lack of communication.......  she took the allowance and disappeared ..............\n\n\ntranslated    ADIOS  \n\n\nas a side note I've been an iPhone user for well over a decade and would not consider changing.  Year ago I   walked into their Santa Monica store and left without a phone but was so impressed by the operation that I bought some stock.",
                    "author": "pinotandsugar",
                    "id": "g1lk5no",
                    "parent_id": "t1_g1ktoyf",
                    "score": 4,
                    "created_utc": 1597503430.0,
                    "replies": [
                        {
                            "body": "Lol",
                            "author": null,
                            "id": "g1onpvo",
                            "parent_id": "t1_g1lk5no",
                            "score": 1,
                            "created_utc": 1597537842.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah that’s not nice 😕 sorry you had to experience that 💝",
                    "author": "TheIncantress",
                    "id": "g1m0w4q",
                    "parent_id": "t1_g1ktoyf",
                    "score": 2,
                    "created_utc": 1597508697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">sHe SoUnDs ImMaTuRe She's fucking 20! \n\nGuess what, plent of girls are way more mature at 20 or even before reaching adulthood.\n\nShe is the kind of woman that will always be a pain in the ass to deal with, be it at 20 or 40.",
            "author": null,
            "id": "g1nsljf",
            "parent_id": "t1_g1mmdd6",
            "score": 0,
            "created_utc": 1597528120.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g1orz36",
                    "parent_id": "t1_g1nsljf",
                    "score": 7,
                    "created_utc": 1597539163.0,
                    "replies": [
                        {
                            "body": ">She's a pain in the ass now because she's a child basically\n\nNope, she is an adult. Most people at her age are way more mature than that so age isn't a excuse.\n\nAnd hell, not even all teenagers are this kind of annoying.",
                            "author": null,
                            "id": "g1oskup",
                            "parent_id": "t1_g1orz36",
                            "score": 0,
                            "created_utc": 1597539344.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g1ostvm",
                                    "parent_id": "t1_g1oskup",
                                    "score": 4,
                                    "created_utc": 1597539425.0,
                                    "replies": [
                                        {
                                            "body": "I was a child and teenager, neither me or my sister were like this. And most people in highschool already knew better than being brats, the few that didn't usually have been getting their way since kids.",
                                            "author": null,
                                            "id": "g1otmor",
                                            "parent_id": "t1_g1ostvm",
                                            "score": 1,
                                            "created_utc": 1597539659.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This. The S10 came out years ago. It's like gifting a Iphone 7. There are three newer galaxy models out.",
            "author": null,
            "id": "g3bwaew",
            "parent_id": "t1_g1ltzyd",
            "score": 1,
            "created_utc": 1598770682.0,
            "replies": []
        },
        {
            "body": "Unfortunately, I am starting to think like that. I have always spent well on her. this kind of came out of no where",
            "author": "hitonce_1919",
            "id": "g1kttu3",
            "parent_id": "t1_g1kdttb",
            "score": 4,
            "created_utc": 1597494311.0,
            "replies": [
                {
                    "body": "I always live by the mantra “When someone shows you who they are, believe them the first time.” It may have been the first time she acted that way but if you keep seeing her, I guarantee it won’t be the last.",
                    "author": "Vixxen887",
                    "id": "g1kv45n",
                    "parent_id": "t1_g1kttu3",
                    "score": 20,
                    "created_utc": 1597494733.0,
                    "replies": [
                        {
                            "body": "> When someone shows you who they are, believe them the first time.”\n\nThat is a classic and unfortunately true.",
                            "author": "pinotandsugar",
                            "id": "g1lkmtr",
                            "parent_id": "t1_g1kv45n",
                            "score": 10,
                            "created_utc": 1597503562.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "...and watch “Pretty Woman” For few other basic tips as a short cut. u/hitonce_1919",
            "author": "BeautyGr8ce",
            "id": "g1n0irp",
            "parent_id": "t1_g1lchaa",
            "score": 3,
            "created_utc": 1597519539.0,
            "replies": [
                {
                    "body": "Confession: I've never seen Pretty Woman!  Sounds like I should watch it for more tips lol",
                    "author": "Azurecole",
                    "id": "g1skhn3",
                    "parent_id": "t1_g1n0irp",
                    "score": 3,
                    "created_utc": 1597627586.0,
                    "replies": [
                        {
                            "body": "Please do. Mind you, it’s a classic. So the insinuated tips may be basic in application to the present day sugar-babe. However, today’s SLF blowup may show that things haven’t changed.",
                            "author": "BeautyGr8ce",
                            "id": "g1sl5ei",
                            "parent_id": "t1_g1skhn3",
                            "score": 1,
                            "created_utc": 1597627994.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey, I know.\nWhat bothered me is investing into the relationship and getting a terrible response. I didn't want it to look like I am just giving her money for sex I went out of my way to buy the gifts.",
            "author": "hitonce_1919",
            "id": "g1n2hnh",
            "parent_id": "t1_g1lchaa",
            "score": 2,
            "created_utc": 1597520111.0,
            "replies": [
                {
                    "body": "I think you're a good dude for doing so.  Not your fault she responded the way she did.  In fact, it may be a blessing in disguise that she's outing herself now.  I'm just suggesting there might be a lesson here -- in general, most of us SDs are probably not great at understanding what a young SB wants.  I suggesting avoiding the \"surprise me\" gift strategy whenever possible",
                    "author": "Azurecole",
                    "id": "g1nceqn",
                    "parent_id": "t1_g1n2hnh",
                    "score": 3,
                    "created_utc": 1597523204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not sure what was the problem. She knows I am very generous. If she had asked for a better phone I would have given in a heartbeat",
            "author": "hitonce_1919",
            "id": "g1ktzm9",
            "parent_id": "t1_g1kn3op",
            "score": 7,
            "created_utc": 1597494369.0,
            "replies": [
                {
                    "body": "She's the problem. She isn't mature enough to communicate like an adult.",
                    "author": "Actually_a_bot_accnt",
                    "id": "g1kzlqj",
                    "parent_id": "t1_g1ktzm9",
                    "score": 20,
                    "created_utc": 1597496091.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g1l8pbd",
                            "parent_id": "t1_g1kzlqj",
                            "score": 12,
                            "created_utc": 1597499023.0,
                            "replies": [
                                {
                                    "body": "🤣🤣 right??? they are seriously confused by their own ridiculous expectations and faulty logic. \n\nThey want a mature, logical yet  worldly emotionally mature adult in a teen’s body and easily influenced spirit. U can’t make this up! It’s sad but hilarious.",
                                    "author": "honey-_bunny",
                                    "id": "g1po7jf",
                                    "parent_id": "t1_g1l8pbd",
                                    "score": 12,
                                    "created_utc": 1597558440.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are attempting to be logical and rational with a 20 yr old female who is used to getting her way.\n\nChasing, offering more money, etc... Won't work. Cut her off completely and don't look back. Some people don't look at your kindness for what it is,they see at as weakness or desperation. In her mind you are no longer an alpha, you are just another clinger who won't say no.",
                    "author": "princelydeeds",
                    "id": "g1lqinq",
                    "parent_id": "t1_g1ktzm9",
                    "score": 9,
                    "created_utc": 1597505341.0,
                    "replies": [
                        {
                            "body": "True. I appreciate when people do things for me (which is rare) so falsely extrapolated that to SBs with my gestures, with my generosity being directly related to how much I liked her.\n\nNever, not once, failed to get kicked in the very balls of my soul for that. End result, I don't any more.",
                            "author": "god_sized_cock",
                            "id": "g1n51bp",
                            "parent_id": "t1_g1lqinq",
                            "score": -1,
                            "created_utc": 1597520952.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She possibly subconsciously decided to end the arrangement and was looking for an excuse to make it \"your fault\".\n\nLook back on it, and you might find she has been giving other small signs of disinterest as well...that you didn't notice...or discounted.\n\nIf that's happened, then she's decided it's over, or, maybe you are relegated to an occasional meet when and if she wants and on her terms. Is that acceptable to you?  If that's the case, you might consider seeing an experienced domme, rather than your now-ex. I don’t mean that in a nasty or sarcastic way, but it is something you might like to explore as an alternative to taking this one back.",
                    "author": "Mangotingthroneway",
                    "id": "g1p4d6c",
                    "parent_id": "t1_g1ktzm9",
                    "score": 1,
                    "created_utc": 1597544614.0,
                    "replies": []
                },
                {
                    "body": "Your best bet is to get a life. 30 years old in the prime of your life and paying for an entitled prostitute.",
                    "author": "paradox501",
                    "id": "g1l9gu0",
                    "parent_id": "t1_g1ktzm9",
                    "score": -17,
                    "created_utc": 1597499305.0,
                    "replies": [
                        {
                            "body": "Passing judgement on why the OP chooses this lifestyle does not require your opinion.  He explains why he chose this lifestyle in his post. Down voted.",
                            "author": "rdu4u",
                            "id": "g1lbkpb",
                            "parent_id": "t1_g1l9gu0",
                            "score": 8,
                            "created_utc": 1597500393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hahah, I am using S10 too. That's why I bought it for her because I like it",
            "author": "hitonce_1919",
            "id": "g1kx0xb",
            "parent_id": "t1_g1ktyrq",
            "score": 11,
            "created_utc": 1597495342.0,
            "replies": []
        },
        {
            "body": "It happened only once before in our 2nd date. Then everything was perfect I have been generous with her. \nWell I wanted to be ask here to see if it's common for SB to behave like this",
            "author": "hitonce_1919",
            "id": "g1kv8hw",
            "parent_id": "t1_g1ksctz",
            "score": 5,
            "created_utc": 1597494767.0,
            "replies": [
                {
                    "body": "Sounds like you deserve something better and that there are a lot of SB who would be happy to be with you.   Learn  and use the info for screening.",
                    "author": "pinotandsugar",
                    "id": "g1lky2w",
                    "parent_id": "t1_g1kv8hw",
                    "score": 1,
                    "created_utc": 1597503655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She had hinted in our last meeting about her phone being old etc.\nMy main gift was a necklace, a very beautiful one.",
            "author": "hitonce_1919",
            "id": "g1kvtip",
            "parent_id": "t1_g1ktcen",
            "score": 3,
            "created_utc": 1597494963.0,
            "replies": [
                {
                    "body": "So you gave her an expensive necklace, an upscale phone and a full month allowance at dinner and she left.........?     You deserve much better  and need to be much wiser",
                    "author": "pinotandsugar",
                    "id": "g1llrb4",
                    "parent_id": "t1_g1kvtip",
                    "score": 4,
                    "created_utc": 1597503900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you're right. I will reactivate my seeking account today",
            "author": "hitonce_1919",
            "id": "g1kuj44",
            "parent_id": "t1_g1kmfta",
            "score": 4,
            "created_utc": 1597494555.0,
            "replies": []
        },
        {
            "body": "She doesn't know that I bought it because I liked it myself. I didn't think she will get upset for no real reason",
            "author": "hitonce_1919",
            "id": "g1ku6vp",
            "parent_id": "t1_g1kr13s",
            "score": 5,
            "created_utc": 1597494442.0,
            "replies": [
                {
                    "body": "I would say rather talk to her about it or drop her. Thats alot of money you paid for the phone and if she wanted a specific one I imagine you guys are close enough that she could've asked you directly. There was no reason for her to be rude about it.",
                    "author": null,
                    "id": "g1kwb0e",
                    "parent_id": "t1_g1ku6vp",
                    "score": 3,
                    "created_utc": 1597495119.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the advice. I am definitely going to do that",
            "author": "hitonce_1919",
            "id": "g1kuw1t",
            "parent_id": "t1_g1kofh4",
            "score": 3,
            "created_utc": 1597494660.0,
            "replies": []
        },
        {
            "body": "Enough of this corny mentality please. If you think money gives you power in a SB/SD dynamic please do not continue sugaring lol.",
            "author": "Sweet_Union_8551",
            "id": "g1mtgbv",
            "parent_id": "t1_g1ler7m",
            "score": 10,
            "created_utc": 1597517414.0,
            "replies": [
                {
                    "body": "Their entitled delusion blocks rational thinking.",
                    "author": "honey-_bunny",
                    "id": "g1pocu7",
                    "parent_id": "t1_g1mtgbv",
                    "score": 5,
                    "created_utc": 1597558570.0,
                    "replies": [
                        {
                            "body": "it’s actually laughable, yes go off about how money is power behind your faceless account and no indication you actually have money lol",
                            "author": "Sweet_Union_8551",
                            "id": "g1ry77a",
                            "parent_id": "t1_g1pocu7",
                            "score": 6,
                            "created_utc": 1597614510.0,
                            "replies": [
                                {
                                    "body": "90% or more of self-labeled “SDs” like on the forum SLF sugarlifesryleforum are not SDs. I suspect most are misogynists as well. That type lives to be mean to women online as they are cowards in the real world. . \n\nWould an occasional real SD who happened upon this forum stick around for the cruelty and depravity seen here? I think not. 🤔 😒 \n\nFact: Entitled guys like that wear the acronym SD like it’s a badge of honor and stick around for the sport of delusion and cruelty. They take glee in insulting women and brag about treating them as a disposable object.\n\nI’m preaching to the choir but they not only lack wealth but any character or shame  in their bitter stingy souls and bank accounts. . Obviously as they are not hiding their assholery. \n\nThey aren’t even a poor yet kind man one might encounter who pretends to be wealthy online as a form of escapism. Nope: They are TOXIC and cruel. They do not deserve our attention. Just like stupid, u cannot change mean and stingy. They will carry on being this way online unless a mod bans them.\n\nI make fun of them in their own language . Bad grammar and misuse of words as well, so they understand better.",
                                    "author": "honey-_bunny",
                                    "id": "g1shomt",
                                    "parent_id": "t1_g1ry77a",
                                    "score": 8,
                                    "created_utc": 1597625864.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s not a miscommunication, that’s a spoiled brat",
            "author": "HighOnGoofballs",
            "id": "g1kriet",
            "parent_id": "t1_g1kop7e",
            "score": 7,
            "created_utc": 1597493540.0,
            "replies": [
                {
                    "body": "We don’t know her. We don’t know if this one time is a representation of her character. I’m not defending her behaviour, (or even saying they should continue dating) I’m just saying have a conversation about the way they both feel, so they can understand each other better, and make each other happier. There’s no losses, only gains from communicating.\n\nHappy 5th reddit bday!",
                    "author": "topazreich",
                    "id": "g1kt564",
                    "parent_id": "t1_g1kriet",
                    "score": 5,
                    "created_utc": 1597494082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm going to text her and I will reactivate my seeking account. If she acts like a bitch I will find someone else",
            "author": "hitonce_1919",
            "id": "g1kxv0j",
            "parent_id": "t1_g1kop7e",
            "score": 1,
            "created_utc": 1597495584.0,
            "replies": [
                {
                    "body": "I wouldn't contact her, i would let her contact you. If She doesn't reach out , it confirmed that the relationship is over. Next time try to be tougher, manlier and less forgiving, women can sense weak men from a 1000 miles.",
                    "author": "vdzz000",
                    "id": "g1leuwj",
                    "parent_id": "t1_g1kxv0j",
                    "score": 1,
                    "created_utc": 1597501688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I quit listening to the \"just keep her advice on this forum\", just keeping her has never resulted in anything good. When my gut tells me something it's a instant dump, it never gets better.",
            "author": null,
            "id": "g1kzu8g",
            "parent_id": "t1_g1kop7e",
            "score": 1,
            "created_utc": 1597496184.0,
            "replies": []
        },
        {
            "body": ">There's a reason most people refuse to have arrangements with people below 25.\n\nNot true at all, you are just pushing this sub's narrative that older SBs are more mature. In my experience, maturity has little to do with age, i should know, i used to daye a 30 yo trainwreck.",
            "author": null,
            "id": "g1nsz5p",
            "parent_id": "t1_g1nb387",
            "score": 2,
            "created_utc": 1597528235.0,
            "replies": [
                {
                    "body": "If everyone is saying it, don't you think there's at least a little truth in the sentiment? Yes, there's exceptions to rules, and actually nobody said that older people are inherently more stable. Just more likely to be less flakey the older you go.",
                    "author": "yeehaw_yall",
                    "id": "g1r5e7f",
                    "parent_id": "t1_g1nsz5p",
                    "score": 3,
                    "created_utc": 1597599610.0,
                    "replies": [
                        {
                            "body": ">If everyone is saying it, don't you think there's at least a little truth in the sentiment?\n\nWho's everyone? You are using weasel words.",
                            "author": null,
                            "id": "g1r5prm",
                            "parent_id": "t1_g1r5e7f",
                            "score": 0,
                            "created_utc": 1597599783.0,
                            "replies": [
                                {
                                    "body": "1.) Your reply sounds like you're just here to argue.\n\n2.) You're the person who said that it's this \"sub's narrative.\"\n\n3.) Because of #1, this is my last reply to you. Take care.",
                                    "author": "yeehaw_yall",
                                    "id": "g1rizwk",
                                    "parent_id": "t1_g1r5prm",
                                    "score": 2,
                                    "created_utc": 1597606577.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have been with 4 babies before and this one takes the cake, she is amazing in sex. I have been generous with her and have doubled her allowance. This behavior is really strange",
            "author": "hitonce_1919",
            "id": "g1kwf14",
            "parent_id": "t1_g1kmfaj",
            "score": 1,
            "created_utc": 1597495156.0,
            "replies": [
                {
                    "body": "Being excessively generous without reciprocation will always blow up in your face plus you might appear desperate which is an unattractive quality. Why did you have to double her allowance unnecessarily? \n\nShe’s going to milk you as much as she can with all this drama. Dump her and find another wild SB. They are out there",
                    "author": "supportiveceo",
                    "id": "g1l43u5",
                    "parent_id": "t1_g1kwf14",
                    "score": 3,
                    "created_utc": 1597497583.0,
                    "replies": [
                        {
                            "body": "This.",
                            "author": "xxnightrain",
                            "id": "g1nz0rh",
                            "parent_id": "t1_g1l43u5",
                            "score": 2,
                            "created_utc": 1597530240.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣",
            "author": "BeautyGr8ce",
            "id": "g1mzg3b",
            "parent_id": "t1_g1mhpd6",
            "score": 3,
            "created_utc": 1597519222.0,
            "replies": []
        },
        {
            "body": ">If you want to keep seeing her, act like a vanilla bf would act.  Crawl back, get her what she wants and have some wild makeup sex. \n\nCRAWL BACK??? That's not a bf, that's a doormat. You are just telling OP to reward her shitty behavior. And no, that doesn't fly in vanilla dating either.\n\nBeing so dissapointed by a GIFT that you storm out? Screw that.\n\n&#x200B;\n\n\\> It’s not ur fault and she’s not a B... just unaligned expectations  \n\nShe is a total B.. and the only unaligned expectations is her expecting OP not to man up and kick her to the curb.",
            "author": null,
            "id": "g1ns7om",
            "parent_id": "t1_g1kv24h",
            "score": 4,
            "created_utc": 1597527994.0,
            "replies": []
        },
        {
            "body": "Why are you ignoring the necklace. Idk if I'm allowed to say the cost. It was pretty expensive\nI am thinking it has to be something more than the phone",
            "author": "hitonce_1919",
            "id": "g1kvlld",
            "parent_id": "t1_g1ksk5x",
            "score": 4,
            "created_utc": 1597494892.0,
            "replies": [
                {
                    "body": "She didn't ask for a necklace. She asked for a phone. So you should've got a new phone and then if you were insistent on an unwanted necklace then spent less on that.\n\nShe's clearly hot, she'll find someone else to her standards soon and I'm sure you can too. It wasn't meant to be.",
                    "author": "blonde-throwaway",
                    "id": "g1unppd",
                    "parent_id": "t1_g1kvlld",
                    "score": 3,
                    "created_utc": 1597669542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "S10 costs 750+, its definitely not a cheap phone. \n\nA woman of substance doesn’t throw stupid tantrums like that, more like a self entitled brat.",
            "author": "geekxp",
            "id": "g1l5n05",
            "parent_id": "t1_g1ksk5x",
            "score": 4,
            "created_utc": 1597498034.0,
            "replies": []
        },
        {
            "body": ">A woman of substance cannot be seen with such a loser phone.  :-)\n\nA woman that cares about what phone she is \"being seen\" with is by definition NOT a woman of substance.",
            "author": null,
            "id": "g1ntzi3",
            "parent_id": "t1_g1ksk5x",
            "score": 1,
            "created_utc": 1597528581.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "g37sihu",
            "parent_id": "t1_g37sig4",
            "score": 2,
            "created_utc": 1598680324.0,
            "replies": []
        },
        {
            "body": "She knows I'm not cheap. I spend well on her, I really didn't think it was because of the phone. I got confused because the necklace was pretty expensive too",
            "author": "hitonce_1919",
            "id": "g1kw4fl",
            "parent_id": "t1_g1khqtx",
            "score": 2,
            "created_utc": 1597495061.0,
            "replies": [
                {
                    "body": "When she sees a less than top of the line phone she feels like you cheaped out. You didn't, it's an expensive phone and you got her two presents.\n\nI don't know why people are downvoting my advice. You said what you liked about her is that she is good in bed. You have two choices which is to stand on principle and find someone new, or else do the math and see if what you are getting is worth upping the ante on the phone.\n\nThat's just game theory. People can not like it, but if your other choices out there are less good than you think she is, you're going to have to invest your time in going through M and G and dealing with new bullshit instead of taking the existing bullshit in stride.\n\nIf you like her just upgrade the phone and it will be water under the bridge.",
                    "author": "amigodeface",
                    "id": "g1pxtdx",
                    "parent_id": "t1_g1kw4fl",
                    "score": 3,
                    "created_utc": 1597567922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "g1khycx",
            "parent_id": "t1_g1khqtx",
            "score": 0,
            "created_utc": 1597489577.0,
            "replies": []
        },
        {
            "body": "Hahah, I'm sure you will get someone great..\n If you live in Western Europe we might give it a shot",
            "author": "hitonce_1919",
            "id": "g1kusvi",
            "parent_id": "t1_g1koat2",
            "score": 3,
            "created_utc": 1597494636.0,
            "replies": []
        },
        {
            "body": "Exactly this.  She'll make him feel like he was wrong and needs to make it up to her.\n\nI think he should leave her but if he thinks he wants to keep her he better be strong, make her come to him and make HER apologize for her lack of appreciation. If he can do that she might  show some respect (for a little while)",
            "author": "Volturi6271",
            "id": "g1lsa8s",
            "parent_id": "t1_g1lbuph",
            "score": 3,
            "created_utc": 1597505916.0,
            "replies": []
        },
        {
            "body": "Agreed. I really find her behavior juvenile. You seem like a very giving SD. Gifts aren't always part of the SA. Good SDs are harder to find than exceptional SBs, especially right now. I would attempt to talk with her and see how she handles it. If after 5 days her demeanor hasn't improved maybe it's time to re-evaluate.",
            "author": "tgibook",
            "id": "g1kw994",
            "parent_id": "t1_g1ktoyf",
            "score": 21,
            "created_utc": 1597495103.0,
            "replies": [
                {
                    "body": "Thanks, do you think I should text her and ask what's all about?",
                    "author": "hitonce_1919",
                    "id": "g1kwqov",
                    "parent_id": "t1_g1kw994",
                    "score": 4,
                    "created_utc": 1597495249.0,
                    "replies": [
                        {
                            "body": "Honestly I don't think you should continue this relationship. I think any relationship can be abusive, manipulative, etc. That seems to me what you are stuck in. You can do better than this. If you can afford to be this generous then you will find a gorgeous sugar baby who will really appreciate this kind of a gesture. Just look at how many awesome people there are in these threads, talking about how much they love their sugar daddy, how he surprised them with some small gift and it made them swoon. Sorry to be a negative person but what's going on here is not going to get better. You can't fix this. And really, the great thing about a sugar relationship is you can just break it off. You paid what you owed, your karma is clean. \n\nThat's my belief. I just really think you can do better and it's not OK to be in a relationship where you're being treated that way. It won't get better.\n\nSorry.",
                            "author": null,
                            "id": "g1ma8rw",
                            "parent_id": "t1_g1kwqov",
                            "score": 19,
                            "created_utc": 1597511419.0,
                            "replies": []
                        },
                        {
                            "body": "Dude, maybe i'm a petty asshole but here's what i'd do. Act like you are very sorry for such a cheap gift and ask for the phone back so you can buy her an iphone 11 pro.\n\nThen return it to the store and block her, THAT would be a great lesson.",
                            "author": null,
                            "id": "g1ntopj",
                            "parent_id": "t1_g1kwqov",
                            "score": 8,
                            "created_utc": 1597528463.0,
                            "replies": [
                                {
                                    "body": "[maybe i'm a petty asshole]^^\n\nYes u are. Good call.",
                                    "author": "honey-_bunny",
                                    "id": "g1pnj68",
                                    "parent_id": "t1_g1ntopj",
                                    "score": 6,
                                    "created_utc": 1597557843.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Is that your primary form of communication? If so yes. Do you ever FaceTime or video chat? In a case like this I would want to see her expressions.",
                            "author": "tgibook",
                            "id": "g1kxadd",
                            "parent_id": "t1_g1kwqov",
                            "score": 2,
                            "created_utc": 1597495418.0,
                            "replies": [
                                {
                                    "body": "We video chat sometimes. But I don't feel like looking at her and get disappointed",
                                    "author": "hitonce_1919",
                                    "id": "g1kyceh",
                                    "parent_id": "t1_g1kxadd",
                                    "score": 1,
                                    "created_utc": 1597495734.0,
                                    "replies": [
                                        {
                                            "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
                                            "author": "tgibook",
                                            "id": "g1kyzlp",
                                            "parent_id": "t1_g1kyceh",
                                            "score": 3,
                                            "created_utc": 1597495914.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Juvenile? She’s 20 years old 😂 she can’t even drink alcohol 🙃",
                    "author": "Foreignbecky214",
                    "id": "g1oa3po",
                    "parent_id": "t1_g1kw994",
                    "score": 10,
                    "created_utc": 1597533755.0,
                    "replies": [
                        {
                            "body": "They want the maturity and emotional intelligence of a 50 year old professor yet is  malleable and easily impressed with the body of a 20 yr. old too. \nThe logic is perfectly reasonable. 🙄🙄😂😂",
                            "author": "honey-_bunny",
                            "id": "g1pns5h",
                            "parent_id": "t1_g1oa3po",
                            "score": 10,
                            "created_utc": 1597558061.0,
                            "replies": [
                                {
                                    "body": "Lmao the accuracy!!!!",
                                    "author": "Foreignbecky214",
                                    "id": "g1pobkw",
                                    "parent_id": "t1_g1pns5h",
                                    "score": 9,
                                    "created_utc": 1597558540.0,
                                    "replies": []
                                },
                                {
                                    "body": "just because you are young doesn’t mean you can’t have manners lol. age is weak excuse to be an asshole.",
                                    "author": "sheabuttersugarbaby",
                                    "id": "g1q0ywz",
                                    "parent_id": "t1_g1pns5h",
                                    "score": 0,
                                    "created_utc": 1597571368.0,
                                    "replies": [
                                        {
                                            "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
                                            "author": "honey-_bunny",
                                            "id": "g1qqjsg",
                                            "parent_id": "t1_g1q0ywz",
                                            "score": 6,
                                            "created_utc": 1597591533.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No lack of communication.......  she took the allowance and disappeared ..............\n\n\ntranslated    ADIOS  \n\n\nas a side note I've been an iPhone user for well over a decade and would not consider changing.  Year ago I   walked into their Santa Monica store and left without a phone but was so impressed by the operation that I bought some stock.",
            "author": "pinotandsugar",
            "id": "g1lk5no",
            "parent_id": "t1_g1ktoyf",
            "score": 4,
            "created_utc": 1597503430.0,
            "replies": [
                {
                    "body": "Lol",
                    "author": null,
                    "id": "g1onpvo",
                    "parent_id": "t1_g1lk5no",
                    "score": 1,
                    "created_utc": 1597537842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that’s not nice 😕 sorry you had to experience that 💝",
            "author": "TheIncantress",
            "id": "g1m0w4q",
            "parent_id": "t1_g1ktoyf",
            "score": 2,
            "created_utc": 1597508697.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1orz36",
            "parent_id": "t1_g1nsljf",
            "score": 7,
            "created_utc": 1597539163.0,
            "replies": [
                {
                    "body": ">She's a pain in the ass now because she's a child basically\n\nNope, she is an adult. Most people at her age are way more mature than that so age isn't a excuse.\n\nAnd hell, not even all teenagers are this kind of annoying.",
                    "author": null,
                    "id": "g1oskup",
                    "parent_id": "t1_g1orz36",
                    "score": 0,
                    "created_utc": 1597539344.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g1ostvm",
                            "parent_id": "t1_g1oskup",
                            "score": 4,
                            "created_utc": 1597539425.0,
                            "replies": [
                                {
                                    "body": "I was a child and teenager, neither me or my sister were like this. And most people in highschool already knew better than being brats, the few that didn't usually have been getting their way since kids.",
                                    "author": null,
                                    "id": "g1otmor",
                                    "parent_id": "t1_g1ostvm",
                                    "score": 1,
                                    "created_utc": 1597539659.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always live by the mantra “When someone shows you who they are, believe them the first time.” It may have been the first time she acted that way but if you keep seeing her, I guarantee it won’t be the last.",
            "author": "Vixxen887",
            "id": "g1kv45n",
            "parent_id": "t1_g1kttu3",
            "score": 20,
            "created_utc": 1597494733.0,
            "replies": [
                {
                    "body": "> When someone shows you who they are, believe them the first time.”\n\nThat is a classic and unfortunately true.",
                    "author": "pinotandsugar",
                    "id": "g1lkmtr",
                    "parent_id": "t1_g1kv45n",
                    "score": 10,
                    "created_utc": 1597503562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Confession: I've never seen Pretty Woman!  Sounds like I should watch it for more tips lol",
            "author": "Azurecole",
            "id": "g1skhn3",
            "parent_id": "t1_g1n0irp",
            "score": 3,
            "created_utc": 1597627586.0,
            "replies": [
                {
                    "body": "Please do. Mind you, it’s a classic. So the insinuated tips may be basic in application to the present day sugar-babe. However, today’s SLF blowup may show that things haven’t changed.",
                    "author": "BeautyGr8ce",
                    "id": "g1sl5ei",
                    "parent_id": "t1_g1skhn3",
                    "score": 1,
                    "created_utc": 1597627994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you're a good dude for doing so.  Not your fault she responded the way she did.  In fact, it may be a blessing in disguise that she's outing herself now.  I'm just suggesting there might be a lesson here -- in general, most of us SDs are probably not great at understanding what a young SB wants.  I suggesting avoiding the \"surprise me\" gift strategy whenever possible",
            "author": "Azurecole",
            "id": "g1nceqn",
            "parent_id": "t1_g1n2hnh",
            "score": 3,
            "created_utc": 1597523204.0,
            "replies": []
        },
        {
            "body": "She's the problem. She isn't mature enough to communicate like an adult.",
            "author": "Actually_a_bot_accnt",
            "id": "g1kzlqj",
            "parent_id": "t1_g1ktzm9",
            "score": 20,
            "created_utc": 1597496091.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g1l8pbd",
                    "parent_id": "t1_g1kzlqj",
                    "score": 12,
                    "created_utc": 1597499023.0,
                    "replies": [
                        {
                            "body": "🤣🤣 right??? they are seriously confused by their own ridiculous expectations and faulty logic. \n\nThey want a mature, logical yet  worldly emotionally mature adult in a teen’s body and easily influenced spirit. U can’t make this up! It’s sad but hilarious.",
                            "author": "honey-_bunny",
                            "id": "g1po7jf",
                            "parent_id": "t1_g1l8pbd",
                            "score": 12,
                            "created_utc": 1597558440.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are attempting to be logical and rational with a 20 yr old female who is used to getting her way.\n\nChasing, offering more money, etc... Won't work. Cut her off completely and don't look back. Some people don't look at your kindness for what it is,they see at as weakness or desperation. In her mind you are no longer an alpha, you are just another clinger who won't say no.",
            "author": "princelydeeds",
            "id": "g1lqinq",
            "parent_id": "t1_g1ktzm9",
            "score": 9,
            "created_utc": 1597505341.0,
            "replies": [
                {
                    "body": "True. I appreciate when people do things for me (which is rare) so falsely extrapolated that to SBs with my gestures, with my generosity being directly related to how much I liked her.\n\nNever, not once, failed to get kicked in the very balls of my soul for that. End result, I don't any more.",
                    "author": "god_sized_cock",
                    "id": "g1n51bp",
                    "parent_id": "t1_g1lqinq",
                    "score": -1,
                    "created_utc": 1597520952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She possibly subconsciously decided to end the arrangement and was looking for an excuse to make it \"your fault\".\n\nLook back on it, and you might find she has been giving other small signs of disinterest as well...that you didn't notice...or discounted.\n\nIf that's happened, then she's decided it's over, or, maybe you are relegated to an occasional meet when and if she wants and on her terms. Is that acceptable to you?  If that's the case, you might consider seeing an experienced domme, rather than your now-ex. I don’t mean that in a nasty or sarcastic way, but it is something you might like to explore as an alternative to taking this one back.",
            "author": "Mangotingthroneway",
            "id": "g1p4d6c",
            "parent_id": "t1_g1ktzm9",
            "score": 1,
            "created_utc": 1597544614.0,
            "replies": []
        },
        {
            "body": "Your best bet is to get a life. 30 years old in the prime of your life and paying for an entitled prostitute.",
            "author": "paradox501",
            "id": "g1l9gu0",
            "parent_id": "t1_g1ktzm9",
            "score": -17,
            "created_utc": 1597499305.0,
            "replies": [
                {
                    "body": "Passing judgement on why the OP chooses this lifestyle does not require your opinion.  He explains why he chose this lifestyle in his post. Down voted.",
                    "author": "rdu4u",
                    "id": "g1lbkpb",
                    "parent_id": "t1_g1l9gu0",
                    "score": 8,
                    "created_utc": 1597500393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you deserve something better and that there are a lot of SB who would be happy to be with you.   Learn  and use the info for screening.",
            "author": "pinotandsugar",
            "id": "g1lky2w",
            "parent_id": "t1_g1kv8hw",
            "score": 1,
            "created_utc": 1597503655.0,
            "replies": []
        },
        {
            "body": "So you gave her an expensive necklace, an upscale phone and a full month allowance at dinner and she left.........?     You deserve much better  and need to be much wiser",
            "author": "pinotandsugar",
            "id": "g1llrb4",
            "parent_id": "t1_g1kvtip",
            "score": 4,
            "created_utc": 1597503900.0,
            "replies": []
        },
        {
            "body": "I would say rather talk to her about it or drop her. Thats alot of money you paid for the phone and if she wanted a specific one I imagine you guys are close enough that she could've asked you directly. There was no reason for her to be rude about it.",
            "author": null,
            "id": "g1kwb0e",
            "parent_id": "t1_g1ku6vp",
            "score": 3,
            "created_utc": 1597495119.0,
            "replies": []
        },
        {
            "body": "Their entitled delusion blocks rational thinking.",
            "author": "honey-_bunny",
            "id": "g1pocu7",
            "parent_id": "t1_g1mtgbv",
            "score": 5,
            "created_utc": 1597558570.0,
            "replies": [
                {
                    "body": "it’s actually laughable, yes go off about how money is power behind your faceless account and no indication you actually have money lol",
                    "author": "Sweet_Union_8551",
                    "id": "g1ry77a",
                    "parent_id": "t1_g1pocu7",
                    "score": 6,
                    "created_utc": 1597614510.0,
                    "replies": [
                        {
                            "body": "90% or more of self-labeled “SDs” like on the forum SLF sugarlifesryleforum are not SDs. I suspect most are misogynists as well. That type lives to be mean to women online as they are cowards in the real world. . \n\nWould an occasional real SD who happened upon this forum stick around for the cruelty and depravity seen here? I think not. 🤔 😒 \n\nFact: Entitled guys like that wear the acronym SD like it’s a badge of honor and stick around for the sport of delusion and cruelty. They take glee in insulting women and brag about treating them as a disposable object.\n\nI’m preaching to the choir but they not only lack wealth but any character or shame  in their bitter stingy souls and bank accounts. . Obviously as they are not hiding their assholery. \n\nThey aren’t even a poor yet kind man one might encounter who pretends to be wealthy online as a form of escapism. Nope: They are TOXIC and cruel. They do not deserve our attention. Just like stupid, u cannot change mean and stingy. They will carry on being this way online unless a mod bans them.\n\nI make fun of them in their own language . Bad grammar and misuse of words as well, so they understand better.",
                            "author": "honey-_bunny",
                            "id": "g1shomt",
                            "parent_id": "t1_g1ry77a",
                            "score": 8,
                            "created_utc": 1597625864.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We don’t know her. We don’t know if this one time is a representation of her character. I’m not defending her behaviour, (or even saying they should continue dating) I’m just saying have a conversation about the way they both feel, so they can understand each other better, and make each other happier. There’s no losses, only gains from communicating.\n\nHappy 5th reddit bday!",
            "author": "topazreich",
            "id": "g1kt564",
            "parent_id": "t1_g1kriet",
            "score": 5,
            "created_utc": 1597494082.0,
            "replies": []
        },
        {
            "body": "I wouldn't contact her, i would let her contact you. If She doesn't reach out , it confirmed that the relationship is over. Next time try to be tougher, manlier and less forgiving, women can sense weak men from a 1000 miles.",
            "author": "vdzz000",
            "id": "g1leuwj",
            "parent_id": "t1_g1kxv0j",
            "score": 1,
            "created_utc": 1597501688.0,
            "replies": []
        },
        {
            "body": "If everyone is saying it, don't you think there's at least a little truth in the sentiment? Yes, there's exceptions to rules, and actually nobody said that older people are inherently more stable. Just more likely to be less flakey the older you go.",
            "author": "yeehaw_yall",
            "id": "g1r5e7f",
            "parent_id": "t1_g1nsz5p",
            "score": 3,
            "created_utc": 1597599610.0,
            "replies": [
                {
                    "body": ">If everyone is saying it, don't you think there's at least a little truth in the sentiment?\n\nWho's everyone? You are using weasel words.",
                    "author": null,
                    "id": "g1r5prm",
                    "parent_id": "t1_g1r5e7f",
                    "score": 0,
                    "created_utc": 1597599783.0,
                    "replies": [
                        {
                            "body": "1.) Your reply sounds like you're just here to argue.\n\n2.) You're the person who said that it's this \"sub's narrative.\"\n\n3.) Because of #1, this is my last reply to you. Take care.",
                            "author": "yeehaw_yall",
                            "id": "g1rizwk",
                            "parent_id": "t1_g1r5prm",
                            "score": 2,
                            "created_utc": 1597606577.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Being excessively generous without reciprocation will always blow up in your face plus you might appear desperate which is an unattractive quality. Why did you have to double her allowance unnecessarily? \n\nShe’s going to milk you as much as she can with all this drama. Dump her and find another wild SB. They are out there",
            "author": "supportiveceo",
            "id": "g1l43u5",
            "parent_id": "t1_g1kwf14",
            "score": 3,
            "created_utc": 1597497583.0,
            "replies": [
                {
                    "body": "This.",
                    "author": "xxnightrain",
                    "id": "g1nz0rh",
                    "parent_id": "t1_g1l43u5",
                    "score": 2,
                    "created_utc": 1597530240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She didn't ask for a necklace. She asked for a phone. So you should've got a new phone and then if you were insistent on an unwanted necklace then spent less on that.\n\nShe's clearly hot, she'll find someone else to her standards soon and I'm sure you can too. It wasn't meant to be.",
            "author": "blonde-throwaway",
            "id": "g1unppd",
            "parent_id": "t1_g1kvlld",
            "score": 3,
            "created_utc": 1597669542.0,
            "replies": []
        },
        {
            "body": "When she sees a less than top of the line phone she feels like you cheaped out. You didn't, it's an expensive phone and you got her two presents.\n\nI don't know why people are downvoting my advice. You said what you liked about her is that she is good in bed. You have two choices which is to stand on principle and find someone new, or else do the math and see if what you are getting is worth upping the ante on the phone.\n\nThat's just game theory. People can not like it, but if your other choices out there are less good than you think she is, you're going to have to invest your time in going through M and G and dealing with new bullshit instead of taking the existing bullshit in stride.\n\nIf you like her just upgrade the phone and it will be water under the bridge.",
            "author": "amigodeface",
            "id": "g1pxtdx",
            "parent_id": "t1_g1kw4fl",
            "score": 3,
            "created_utc": 1597567922.0,
            "replies": []
        },
        {
            "body": "Thanks, do you think I should text her and ask what's all about?",
            "author": "hitonce_1919",
            "id": "g1kwqov",
            "parent_id": "t1_g1kw994",
            "score": 4,
            "created_utc": 1597495249.0,
            "replies": [
                {
                    "body": "Honestly I don't think you should continue this relationship. I think any relationship can be abusive, manipulative, etc. That seems to me what you are stuck in. You can do better than this. If you can afford to be this generous then you will find a gorgeous sugar baby who will really appreciate this kind of a gesture. Just look at how many awesome people there are in these threads, talking about how much they love their sugar daddy, how he surprised them with some small gift and it made them swoon. Sorry to be a negative person but what's going on here is not going to get better. You can't fix this. And really, the great thing about a sugar relationship is you can just break it off. You paid what you owed, your karma is clean. \n\nThat's my belief. I just really think you can do better and it's not OK to be in a relationship where you're being treated that way. It won't get better.\n\nSorry.",
                    "author": null,
                    "id": "g1ma8rw",
                    "parent_id": "t1_g1kwqov",
                    "score": 19,
                    "created_utc": 1597511419.0,
                    "replies": []
                },
                {
                    "body": "Dude, maybe i'm a petty asshole but here's what i'd do. Act like you are very sorry for such a cheap gift and ask for the phone back so you can buy her an iphone 11 pro.\n\nThen return it to the store and block her, THAT would be a great lesson.",
                    "author": null,
                    "id": "g1ntopj",
                    "parent_id": "t1_g1kwqov",
                    "score": 8,
                    "created_utc": 1597528463.0,
                    "replies": [
                        {
                            "body": "[maybe i'm a petty asshole]^^\n\nYes u are. Good call.",
                            "author": "honey-_bunny",
                            "id": "g1pnj68",
                            "parent_id": "t1_g1ntopj",
                            "score": 6,
                            "created_utc": 1597557843.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Is that your primary form of communication? If so yes. Do you ever FaceTime or video chat? In a case like this I would want to see her expressions.",
                    "author": "tgibook",
                    "id": "g1kxadd",
                    "parent_id": "t1_g1kwqov",
                    "score": 2,
                    "created_utc": 1597495418.0,
                    "replies": [
                        {
                            "body": "We video chat sometimes. But I don't feel like looking at her and get disappointed",
                            "author": "hitonce_1919",
                            "id": "g1kyceh",
                            "parent_id": "t1_g1kxadd",
                            "score": 1,
                            "created_utc": 1597495734.0,
                            "replies": [
                                {
                                    "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
                                    "author": "tgibook",
                                    "id": "g1kyzlp",
                                    "parent_id": "t1_g1kyceh",
                                    "score": 3,
                                    "created_utc": 1597495914.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Juvenile? She’s 20 years old 😂 she can’t even drink alcohol 🙃",
            "author": "Foreignbecky214",
            "id": "g1oa3po",
            "parent_id": "t1_g1kw994",
            "score": 10,
            "created_utc": 1597533755.0,
            "replies": [
                {
                    "body": "They want the maturity and emotional intelligence of a 50 year old professor yet is  malleable and easily impressed with the body of a 20 yr. old too. \nThe logic is perfectly reasonable. 🙄🙄😂😂",
                    "author": "honey-_bunny",
                    "id": "g1pns5h",
                    "parent_id": "t1_g1oa3po",
                    "score": 10,
                    "created_utc": 1597558061.0,
                    "replies": [
                        {
                            "body": "Lmao the accuracy!!!!",
                            "author": "Foreignbecky214",
                            "id": "g1pobkw",
                            "parent_id": "t1_g1pns5h",
                            "score": 9,
                            "created_utc": 1597558540.0,
                            "replies": []
                        },
                        {
                            "body": "just because you are young doesn’t mean you can’t have manners lol. age is weak excuse to be an asshole.",
                            "author": "sheabuttersugarbaby",
                            "id": "g1q0ywz",
                            "parent_id": "t1_g1pns5h",
                            "score": 0,
                            "created_utc": 1597571368.0,
                            "replies": [
                                {
                                    "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
                                    "author": "honey-_bunny",
                                    "id": "g1qqjsg",
                                    "parent_id": "t1_g1q0ywz",
                                    "score": 6,
                                    "created_utc": 1597591533.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol",
            "author": null,
            "id": "g1onpvo",
            "parent_id": "t1_g1lk5no",
            "score": 1,
            "created_utc": 1597537842.0,
            "replies": []
        },
        {
            "body": ">She's a pain in the ass now because she's a child basically\n\nNope, she is an adult. Most people at her age are way more mature than that so age isn't a excuse.\n\nAnd hell, not even all teenagers are this kind of annoying.",
            "author": null,
            "id": "g1oskup",
            "parent_id": "t1_g1orz36",
            "score": 0,
            "created_utc": 1597539344.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g1ostvm",
                    "parent_id": "t1_g1oskup",
                    "score": 4,
                    "created_utc": 1597539425.0,
                    "replies": [
                        {
                            "body": "I was a child and teenager, neither me or my sister were like this. And most people in highschool already knew better than being brats, the few that didn't usually have been getting their way since kids.",
                            "author": null,
                            "id": "g1otmor",
                            "parent_id": "t1_g1ostvm",
                            "score": 1,
                            "created_utc": 1597539659.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> When someone shows you who they are, believe them the first time.”\n\nThat is a classic and unfortunately true.",
            "author": "pinotandsugar",
            "id": "g1lkmtr",
            "parent_id": "t1_g1kv45n",
            "score": 10,
            "created_utc": 1597503562.0,
            "replies": []
        },
        {
            "body": "Please do. Mind you, it’s a classic. So the insinuated tips may be basic in application to the present day sugar-babe. However, today’s SLF blowup may show that things haven’t changed.",
            "author": "BeautyGr8ce",
            "id": "g1sl5ei",
            "parent_id": "t1_g1skhn3",
            "score": 1,
            "created_utc": 1597627994.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1l8pbd",
            "parent_id": "t1_g1kzlqj",
            "score": 12,
            "created_utc": 1597499023.0,
            "replies": [
                {
                    "body": "🤣🤣 right??? they are seriously confused by their own ridiculous expectations and faulty logic. \n\nThey want a mature, logical yet  worldly emotionally mature adult in a teen’s body and easily influenced spirit. U can’t make this up! It’s sad but hilarious.",
                    "author": "honey-_bunny",
                    "id": "g1po7jf",
                    "parent_id": "t1_g1l8pbd",
                    "score": 12,
                    "created_utc": 1597558440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True. I appreciate when people do things for me (which is rare) so falsely extrapolated that to SBs with my gestures, with my generosity being directly related to how much I liked her.\n\nNever, not once, failed to get kicked in the very balls of my soul for that. End result, I don't any more.",
            "author": "god_sized_cock",
            "id": "g1n51bp",
            "parent_id": "t1_g1lqinq",
            "score": -1,
            "created_utc": 1597520952.0,
            "replies": []
        },
        {
            "body": "Passing judgement on why the OP chooses this lifestyle does not require your opinion.  He explains why he chose this lifestyle in his post. Down voted.",
            "author": "rdu4u",
            "id": "g1lbkpb",
            "parent_id": "t1_g1l9gu0",
            "score": 8,
            "created_utc": 1597500393.0,
            "replies": []
        },
        {
            "body": "it’s actually laughable, yes go off about how money is power behind your faceless account and no indication you actually have money lol",
            "author": "Sweet_Union_8551",
            "id": "g1ry77a",
            "parent_id": "t1_g1pocu7",
            "score": 6,
            "created_utc": 1597614510.0,
            "replies": [
                {
                    "body": "90% or more of self-labeled “SDs” like on the forum SLF sugarlifesryleforum are not SDs. I suspect most are misogynists as well. That type lives to be mean to women online as they are cowards in the real world. . \n\nWould an occasional real SD who happened upon this forum stick around for the cruelty and depravity seen here? I think not. 🤔 😒 \n\nFact: Entitled guys like that wear the acronym SD like it’s a badge of honor and stick around for the sport of delusion and cruelty. They take glee in insulting women and brag about treating them as a disposable object.\n\nI’m preaching to the choir but they not only lack wealth but any character or shame  in their bitter stingy souls and bank accounts. . Obviously as they are not hiding their assholery. \n\nThey aren’t even a poor yet kind man one might encounter who pretends to be wealthy online as a form of escapism. Nope: They are TOXIC and cruel. They do not deserve our attention. Just like stupid, u cannot change mean and stingy. They will carry on being this way online unless a mod bans them.\n\nI make fun of them in their own language . Bad grammar and misuse of words as well, so they understand better.",
                    "author": "honey-_bunny",
                    "id": "g1shomt",
                    "parent_id": "t1_g1ry77a",
                    "score": 8,
                    "created_utc": 1597625864.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">If everyone is saying it, don't you think there's at least a little truth in the sentiment?\n\nWho's everyone? You are using weasel words.",
            "author": null,
            "id": "g1r5prm",
            "parent_id": "t1_g1r5e7f",
            "score": 0,
            "created_utc": 1597599783.0,
            "replies": [
                {
                    "body": "1.) Your reply sounds like you're just here to argue.\n\n2.) You're the person who said that it's this \"sub's narrative.\"\n\n3.) Because of #1, this is my last reply to you. Take care.",
                    "author": "yeehaw_yall",
                    "id": "g1rizwk",
                    "parent_id": "t1_g1r5prm",
                    "score": 2,
                    "created_utc": 1597606577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This.",
            "author": "xxnightrain",
            "id": "g1nz0rh",
            "parent_id": "t1_g1l43u5",
            "score": 2,
            "created_utc": 1597530240.0,
            "replies": []
        },
        {
            "body": "Honestly I don't think you should continue this relationship. I think any relationship can be abusive, manipulative, etc. That seems to me what you are stuck in. You can do better than this. If you can afford to be this generous then you will find a gorgeous sugar baby who will really appreciate this kind of a gesture. Just look at how many awesome people there are in these threads, talking about how much they love their sugar daddy, how he surprised them with some small gift and it made them swoon. Sorry to be a negative person but what's going on here is not going to get better. You can't fix this. And really, the great thing about a sugar relationship is you can just break it off. You paid what you owed, your karma is clean. \n\nThat's my belief. I just really think you can do better and it's not OK to be in a relationship where you're being treated that way. It won't get better.\n\nSorry.",
            "author": null,
            "id": "g1ma8rw",
            "parent_id": "t1_g1kwqov",
            "score": 19,
            "created_utc": 1597511419.0,
            "replies": []
        },
        {
            "body": "Dude, maybe i'm a petty asshole but here's what i'd do. Act like you are very sorry for such a cheap gift and ask for the phone back so you can buy her an iphone 11 pro.\n\nThen return it to the store and block her, THAT would be a great lesson.",
            "author": null,
            "id": "g1ntopj",
            "parent_id": "t1_g1kwqov",
            "score": 8,
            "created_utc": 1597528463.0,
            "replies": [
                {
                    "body": "[maybe i'm a petty asshole]^^\n\nYes u are. Good call.",
                    "author": "honey-_bunny",
                    "id": "g1pnj68",
                    "parent_id": "t1_g1ntopj",
                    "score": 6,
                    "created_utc": 1597557843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is that your primary form of communication? If so yes. Do you ever FaceTime or video chat? In a case like this I would want to see her expressions.",
            "author": "tgibook",
            "id": "g1kxadd",
            "parent_id": "t1_g1kwqov",
            "score": 2,
            "created_utc": 1597495418.0,
            "replies": [
                {
                    "body": "We video chat sometimes. But I don't feel like looking at her and get disappointed",
                    "author": "hitonce_1919",
                    "id": "g1kyceh",
                    "parent_id": "t1_g1kxadd",
                    "score": 1,
                    "created_utc": 1597495734.0,
                    "replies": [
                        {
                            "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
                            "author": "tgibook",
                            "id": "g1kyzlp",
                            "parent_id": "t1_g1kyceh",
                            "score": 3,
                            "created_utc": 1597495914.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They want the maturity and emotional intelligence of a 50 year old professor yet is  malleable and easily impressed with the body of a 20 yr. old too. \nThe logic is perfectly reasonable. 🙄🙄😂😂",
            "author": "honey-_bunny",
            "id": "g1pns5h",
            "parent_id": "t1_g1oa3po",
            "score": 10,
            "created_utc": 1597558061.0,
            "replies": [
                {
                    "body": "Lmao the accuracy!!!!",
                    "author": "Foreignbecky214",
                    "id": "g1pobkw",
                    "parent_id": "t1_g1pns5h",
                    "score": 9,
                    "created_utc": 1597558540.0,
                    "replies": []
                },
                {
                    "body": "just because you are young doesn’t mean you can’t have manners lol. age is weak excuse to be an asshole.",
                    "author": "sheabuttersugarbaby",
                    "id": "g1q0ywz",
                    "parent_id": "t1_g1pns5h",
                    "score": 0,
                    "created_utc": 1597571368.0,
                    "replies": [
                        {
                            "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
                            "author": "honey-_bunny",
                            "id": "g1qqjsg",
                            "parent_id": "t1_g1q0ywz",
                            "score": 6,
                            "created_utc": 1597591533.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1ostvm",
            "parent_id": "t1_g1oskup",
            "score": 4,
            "created_utc": 1597539425.0,
            "replies": [
                {
                    "body": "I was a child and teenager, neither me or my sister were like this. And most people in highschool already knew better than being brats, the few that didn't usually have been getting their way since kids.",
                    "author": null,
                    "id": "g1otmor",
                    "parent_id": "t1_g1ostvm",
                    "score": 1,
                    "created_utc": 1597539659.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤣🤣 right??? they are seriously confused by their own ridiculous expectations and faulty logic. \n\nThey want a mature, logical yet  worldly emotionally mature adult in a teen’s body and easily influenced spirit. U can’t make this up! It’s sad but hilarious.",
            "author": "honey-_bunny",
            "id": "g1po7jf",
            "parent_id": "t1_g1l8pbd",
            "score": 12,
            "created_utc": 1597558440.0,
            "replies": []
        },
        {
            "body": "90% or more of self-labeled “SDs” like on the forum SLF sugarlifesryleforum are not SDs. I suspect most are misogynists as well. That type lives to be mean to women online as they are cowards in the real world. . \n\nWould an occasional real SD who happened upon this forum stick around for the cruelty and depravity seen here? I think not. 🤔 😒 \n\nFact: Entitled guys like that wear the acronym SD like it’s a badge of honor and stick around for the sport of delusion and cruelty. They take glee in insulting women and brag about treating them as a disposable object.\n\nI’m preaching to the choir but they not only lack wealth but any character or shame  in their bitter stingy souls and bank accounts. . Obviously as they are not hiding their assholery. \n\nThey aren’t even a poor yet kind man one might encounter who pretends to be wealthy online as a form of escapism. Nope: They are TOXIC and cruel. They do not deserve our attention. Just like stupid, u cannot change mean and stingy. They will carry on being this way online unless a mod bans them.\n\nI make fun of them in their own language . Bad grammar and misuse of words as well, so they understand better.",
            "author": "honey-_bunny",
            "id": "g1shomt",
            "parent_id": "t1_g1ry77a",
            "score": 8,
            "created_utc": 1597625864.0,
            "replies": []
        },
        {
            "body": "1.) Your reply sounds like you're just here to argue.\n\n2.) You're the person who said that it's this \"sub's narrative.\"\n\n3.) Because of #1, this is my last reply to you. Take care.",
            "author": "yeehaw_yall",
            "id": "g1rizwk",
            "parent_id": "t1_g1r5prm",
            "score": 2,
            "created_utc": 1597606577.0,
            "replies": []
        },
        {
            "body": "[maybe i'm a petty asshole]^^\n\nYes u are. Good call.",
            "author": "honey-_bunny",
            "id": "g1pnj68",
            "parent_id": "t1_g1ntopj",
            "score": 6,
            "created_utc": 1597557843.0,
            "replies": []
        },
        {
            "body": "We video chat sometimes. But I don't feel like looking at her and get disappointed",
            "author": "hitonce_1919",
            "id": "g1kyceh",
            "parent_id": "t1_g1kxadd",
            "score": 1,
            "created_utc": 1597495734.0,
            "replies": [
                {
                    "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
                    "author": "tgibook",
                    "id": "g1kyzlp",
                    "parent_id": "t1_g1kyceh",
                    "score": 3,
                    "created_utc": 1597495914.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao the accuracy!!!!",
            "author": "Foreignbecky214",
            "id": "g1pobkw",
            "parent_id": "t1_g1pns5h",
            "score": 9,
            "created_utc": 1597558540.0,
            "replies": []
        },
        {
            "body": "just because you are young doesn’t mean you can’t have manners lol. age is weak excuse to be an asshole.",
            "author": "sheabuttersugarbaby",
            "id": "g1q0ywz",
            "parent_id": "t1_g1pns5h",
            "score": 0,
            "created_utc": 1597571368.0,
            "replies": [
                {
                    "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
                    "author": "honey-_bunny",
                    "id": "g1qqjsg",
                    "parent_id": "t1_g1q0ywz",
                    "score": 6,
                    "created_utc": 1597591533.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was a child and teenager, neither me or my sister were like this. And most people in highschool already knew better than being brats, the few that didn't usually have been getting their way since kids.",
            "author": null,
            "id": "g1otmor",
            "parent_id": "t1_g1ostvm",
            "score": 1,
            "created_utc": 1597539659.0,
            "replies": []
        },
        {
            "body": "Text and see if that will lead to a phone discussion. Communication is important in every kind of relationship.",
            "author": "tgibook",
            "id": "g1kyzlp",
            "parent_id": "t1_g1kyceh",
            "score": 3,
            "created_utc": 1597495914.0,
            "replies": []
        },
        {
            "body": "True. And, people tend to mature at a different pace with some never really maturing much at all, whatever that means to each person’s expectations of maturity. But, we only have one side of the story. And, the story sounds like immaturity on her part more than calculated assholery imo. \n\nIf you expect 5 star service before the staff has had experience training fully, then u might be disappointed.",
            "author": "honey-_bunny",
            "id": "g1qqjsg",
            "parent_id": "t1_g1q0ywz",
            "score": 6,
            "created_utc": 1597591533.0,
            "replies": []
        }
    ]
}