{
    "title": "Tips for attracting wealthy men",
    "post_id": "cvgxv8",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cvgxv8/tips_for_attracting_wealthy_men/",
    "author": null,
    "body": "Disclaimer: before anyone gets offended and claims I’m promoting inauthenticity, if this advice doesn’t work for you or doesn’t feel authentic, don’t follow it or at least take it with a grain of salt. Just know it works, and most importantly it works no matter what you look like naturally! I have a friend who has very similar features and a very similar body type as mine, and the guys we get approached by are polar opposites. \nAlso this will be long AF oops lol\n\nTHE LOOK\n\nFirst things first, you have to look the part. I’m a fashion student and fairly high maintenance so I’m almost always overdressed, but that isn’t entirely necessary. The main thing to note fashion wise is that anything super trendy won’t work (neon colors, bike shorts, spandex, chunky sneakers, those matching track set type things, overly tacky patterns, etc). You can find clothing that looks good just about anywhere if you’re selective and decent at styling it, but if it LOOKS like it’s clearly from fashion nova or forever 21, burn that shit (but not literally because lord knows what chemical fumes that’ll put into the air and the earth is already fucked enough). Men of means might not be ultra familiar with women’s brands, but they know what fabrics look cheap and how slutty is too slutty lol. If I’m going out, I’ll typically wear a cocktail dress and heels. I went out recently in a bodysuit and jeans and it was uncanny how different the guys that approached me were from the guys who typically do when I’m more dressed up, so dress up! \n\nI like to wear a scent (namely a musky perfume oil because I have very specific taste in scents) but the only tip I have there is not to wear anything too girly or super sweet. No older successful guy thinks it’s sexy when a girl smells like a 13 year old stripper except maybe the ghost of Jeffrey Epstein. Paris Hilton is the only one who can pull it off but she’s already an heiress, we’re only on our way 💅\n\nHair and makeup wise, keep it classic and fairly simple. I’m obsessed with old Hollywood stars so I love a good hot roller set paired with winged eyeliner and a red lip, and guys love it too. Save the super trendy editorial looks for the gay club, something about it just does not register in the minds of men and they will be confused AF if you have blush on your nose and glitter on your cheekbones, especially if they’re older and unfamiliar with whatever makeup looks are trending on Instagram this week. Also keep the falsies somewhat subtle, I’ve heard from like every guy I’ve talked to about makeup about how much they hate the crazy two inch long lashes. Just not flattering or classy. Also biologically, guys always like blushing cheeks, dewy skin, and glossy lips.\n\nLast but certainly not least when it comes to looks: POSTURE. I want to rip out my hot-roller-curled hair when I see a beautiful girl with her shoulders hunched. If you look nervous while you’re just sitting at a regular bar, how are you going to look if he takes you to Nobu or The Plaza? There’s something to be said about posture and the halo effect; people always assume I’m super sure of myself because I have good posture (LOL). Your body language also influences your thoughts and mindset, so if you carry yourself like you know what you’re doing, you’ll actually start to believe you do (my delusion is a superpower tbh). When I’ve had a bad day or I’m worried everyone is going to notice that my nails are chipped and my hair is frizzy or whatever, I literally channel Samantha Jones with my body language and that shit really does work lol.\n\nPLACES  \n\nGoing to the most expensive bar or restaurant in town is certainly not a bad idea, but keep in mind that that’s not exactly where successful men go to relax. If they’re there, it’s probably because they’re either meeting with a client or business partner or they’re on a date. I can’t give you a cut and dry answer of where all the wealthy men in your city are hiding on a Saturday night, especially because a lot of them are traveling, at their weekend homes, or at events that mere peasants like us aren’t invited to (yet). But once you make a few connections and get your foot in the door of a few well to do social circles, you’ll get a better idea. Even just a successful guy on a date telling you a story about going out with drinks at whatever bar can give you a new idea for somewhere to go. \n\nMy number one tip place wise, though, is that unless you live in a place that has like two successful guys and they’re both hermits, anywhere is a place you can meet successful guys. Not that you should be going to random grocery stores in a cocktail dress with an SA sticker on your chest, but if you follow the rest of the advice here, successful men will start approaching you. \n\nRecently I was at a dive bar (or rather divey enough that the bartender looked at me weird when I ordered a Cosmo) waiting for a friend and happening to look fabulous and I got approached by a banker pretty well known in the city who bought me a drink and asked for my number. Had I been in a tank top, jorts, and flip flops, I could’ve flashed my tits all up and down Wall Street and not gotten a single glance, but when you look like you appreciate the finer things in life, men who can provide them will come to you. \n\nDEMEANOR/BEHAVIOR\n\nFinally, once you’re looking bomb and you’re out somewhere filled with well to do men, what do you do? I like to meet guys while I’m with a friend or two so I’m not just waiting around for someone to talk to me, but either way, don’t be anxiously looking around like you’re waiting for someone to approach you. I’ve gotten the best treatment from guys when I’ve been with my friends having a fun, lively conversation, or by myself but clearly content and relaxed. \n\nYou can approach guys yourself, but I recommend not to. It’s in a man’s nature to chase and the ones who aren’t lazy enjoy doing it, especially if you’re a bit of a challenge. Plus there’s something magical that happens when you look beautiful and classy and your posture is right where you pretty much only get approached by successful men. If you look like you put a lot of effort into your life, men who don’t do the same will not approach you unless they’re super bold (or drunk). \n\nWhen you’re talking to a successful guy, be fun and flirty, but it’s important not to be too nice or easily impressed. If a man needs constant sickly-sweetness and compliments, it’s probably because his manager at TJI Friday’s was yelling at him all day. I’m not suggesting you neg him or anything, but if you have some sass or a bit of an edge, rich men eat that shit up like Gato halibut. Again, being nice and flirtatious: good. Getting on your knees as soon as he tells you he’s a banker or a lawyer: bad. \n\nAlso, don’t mention you’re looking for a SD unless he says something like that first. You can bring that up via text or another time you meet (or never, if you don’t need a consistent allowance and just want gifts and/or bills paid). Just drop hints that you like to be spoiled — for example, when a guy tells me he works in finance (which is like 95% of the time because I live in manhattan lmao) I like to say “oh, so you’re good at buying things? That’ll come in handy with me.” It gets a laugh and sends the message that I’m not looking for something entirely vanilla. But honestly, if you’re a hot younger girl talking to an older rich guy, they’re not exactly expecting to be splitting any checks. \n\nThose are all my tips, I’d love to hear the strategies other SBs use if you like to find guys without always using SA, and SDs - what do you agree with? Disagree with? What responsibilities should I have been attending to instead of writing this long ass thing? Let me know! \n\nTLDR: Dress up and look classy and feminine, avoid overly trendy clothes and makeup, have good posture. Don’t rely on going to the most expensive places, get to know wealthier people and find out where they go, but keep in mind you could find someone anywhere. Don’t be too easily impressed, drop hints that you want to be spoiled.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cvgxv8/tips_for_attracting_wealthy_men/",
    "score": 203,
    "upvote_ratio": 0.92,
    "created_utc": 1566780689.0,
    "num_comments": 105,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I love this, these are great tips! Especially posture- that’s the best indication of confidence in my experience. Another tip if you’re like me and get nervous/bored at a bar alone and don’t want to be sucked into your phone screen (a bad look), bring something to read or a notepad to write on. It’s a good conversation starter either way. Some guys won’t want to bother you while you’re reading so it’s good to take breaks from that occasionally too. If I bring my notepad it doesn’t matter what I’m actually writing, I always just say I’m working on an outline for my next project. You can turn “project” into a million different things depending on what you actually do. Usually I say poetry or painting.",
            "author": "vakzos",
            "id": "ey49uh3",
            "parent_id": "t3_cvgxv8",
            "score": 44,
            "created_utc": 1566785794.0,
            "replies": [
                {
                    "body": "That’s a great tip for freestyling! Being on your phone is def a bad look, and I’ve brought a book to a bar a few times but it made me feel like I was screaming “look at me! Pretty girl reading a book!” so that’s a great compromise.",
                    "author": null,
                    "id": "ey4ahex",
                    "parent_id": "t1_ey49uh3",
                    "score": 27,
                    "created_utc": 1566786313.0,
                    "replies": [
                        {
                            "body": "Yeah, but I’m curious what book the pretty girl is reading.   Playing on your phone is a major turnoff unless it at least looks like you are working, thus the notebook.",
                            "author": "FlexEconGuy",
                            "id": "eyz6r7z",
                            "parent_id": "t1_ey4ahex",
                            "score": 3,
                            "created_utc": 1567610861.0,
                            "replies": [
                                {
                                    "body": "Eh it still feels too peacock-y for me, I’m a designer so the notebook works perfectly",
                                    "author": null,
                                    "id": "eyzjpl0",
                                    "parent_id": "t1_eyz6r7z",
                                    "score": 3,
                                    "created_utc": 1567619260.0,
                                    "replies": [
                                        {
                                            "body": "I currently have two notebooks, a laptop, diary, and book on some religious cult in front of me at the sake bar.   #notprops ;)  \n\nGiven my tank top under a powder blue sports coat and jeans that perfectly match my NB, you might call me peacock-y.   I’m even rocking a lapel pin of some bird I just realized was upside down.   Thanks for making me notice.",
                                            "author": "FlexEconGuy",
                                            "id": "eyzkcpw",
                                            "parent_id": "t1_eyzjpl0",
                                            "score": 5,
                                            "created_utc": 1567619669.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "READ BLOOMBERG. Be familiar with current events.\n\nEdit:\nMIND YOUR MANNERS\nIt’s so awkward to be on a dinner date and see someone lick their fingers or pick their teeth or whatever gross thing. On another note, if you get taken to a high end restaurant, it might be useful to know which utensil to use for what, etc. Little things matter. No one will notice if you’re overly well mannered, but they will notice a small thing if they are aware of good etiquette and you slip.\nThere’s tons of YouTube videos on etiquette/manners. No excuse for ignoring this one.",
            "author": "DallasSugarBaby",
            "id": "ey57jyw",
            "parent_id": "t3_cvgxv8",
            "score": 17,
            "created_utc": 1566824264.0,
            "replies": [
                {
                    "body": "Yes! Be familiar with current events to intrigue him and be able to distract him from what’s going on in the world to seduce him.",
                    "author": null,
                    "id": "ey5bjzh",
                    "parent_id": "t1_ey57jyw",
                    "score": 4,
                    "created_utc": 1566827447.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Educate yourself to be conversant on a diverse set of topics from business, tech, current events, art or music, history, fine dining, wine, cars, etc.",
            "author": "HMU2018",
            "id": "ey441yw",
            "parent_id": "t3_cvgxv8",
            "score": 77,
            "created_utc": 1566781237.0,
            "replies": [
                {
                    "body": "Ooh, and, I find is equally important as being able to \\*talk\\* about a lot of topics: be able to \\*listen\\* about a lot of topics. As in curious, truly listening to ask the right questions. Men LOVE talking about themselves. The dates where I let a man talk and answer questions have always been called some of the best by the man themself so, that, too!",
                    "author": "SapioSugarBabe",
                    "id": "ey445yv",
                    "parent_id": "t1_ey441yw",
                    "score": 58,
                    "created_utc": 1566781324.0,
                    "replies": [
                        {
                            "body": "Yes! and even if it doesn’t work out with that guy, boom you have talking points for the the next guy you meet with his shared interests/industry",
                            "author": null,
                            "id": "ey47cvb",
                            "parent_id": "t1_ey445yv",
                            "score": 23,
                            "created_utc": 1566783807.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ey5dnp8",
                                    "parent_id": "t1_ey47cvb",
                                    "score": 8,
                                    "created_utc": 1566829027.0,
                                    "replies": [
                                        {
                                            "body": "Exactly, I know all I know about the stock market because of all the intolerable 20 something finance bros i dated when I first moved to the city lol",
                                            "author": null,
                                            "id": "ey5ksvl",
                                            "parent_id": "t1_ey5dnp8",
                                            "score": 4,
                                            "created_utc": 1566834093.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Best advice here.\n\nThe difference between the class of SBs isn't a look or a style but how they sound in conversations (educated or knowledgeable) and their level of etiquette when they are at different social functions.",
                    "author": "KnocDown",
                    "id": "ey4ijgh",
                    "parent_id": "t1_ey441yw",
                    "score": 25,
                    "created_utc": 1566793531.0,
                    "replies": []
                },
                {
                    "body": "Ooh this too, my best friend has taught me all about wine, cheese, oysters, etc and those tips alone help so much on dates",
                    "author": null,
                    "id": "ey448f2",
                    "parent_id": "t1_ey441yw",
                    "score": 10,
                    "created_utc": 1566781377.0,
                    "replies": []
                },
                {
                    "body": "Don't you guys see right through that?",
                    "author": null,
                    "id": "ey475wv",
                    "parent_id": "t1_ey441yw",
                    "score": -2,
                    "created_utc": 1566783655.0,
                    "replies": [
                        {
                            "body": "What does it mean to “see right through” a pleasant conversation?\n\nWhen a sales guy from some vendor is personable, remembers my kids names, and suggests I come to an event at a hockey game, I know he’s playing a role. But it’s also the role I expect him to play. And if he gets that stuff right he’s probably good at other parts of his job.",
                            "author": "tra24602",
                            "id": "ey512cy",
                            "parent_id": "t1_ey475wv",
                            "score": 21,
                            "created_utc": 1566817896.0,
                            "replies": []
                        },
                        {
                            "body": "As it was once written by Coleridge, “that willing suspension of disbelief for the moment, which constitutes poetic faith.”",
                            "author": "HMU2018",
                            "id": "ey6qgxy",
                            "parent_id": "t1_ey475wv",
                            "score": 8,
                            "created_utc": 1566861570.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, I’m sure that guys see right through my Bachelor’s degree in Classics. My ability to speak Ancient Greek is entirely an act.",
                            "author": "sugar-magnolias",
                            "id": "ey572jv",
                            "parent_id": "t1_ey475wv",
                            "score": 14,
                            "created_utc": 1566823849.0,
                            "replies": [
                                {
                                    "body": "Those may not be acts but your interest in those things might be.",
                                    "author": null,
                                    "id": "ey57ru4",
                                    "parent_id": "t1_ey572jv",
                                    "score": 2,
                                    "created_utc": 1566824448.0,
                                    "replies": [
                                        {
                                            "body": "I mean, if a potential sugar daddy only wants to talk about fast cars and basketball, then he and I probably won’t click. You’re totally right in the sense of: Why would I get involved in a long-term sugar relationship where I have to fake my way through every conversation? But I enjoy talking about history and fine art, so I am educated about those things. I like talking about them, and many POTs think that’s impressive/enjoy talking about those things also.",
                                            "author": "sugar-magnolias",
                                            "id": "ey58agv",
                                            "parent_id": "t1_ey57ru4",
                                            "score": 6,
                                            "created_utc": 1566824876.0,
                                            "replies": [
                                                {
                                                    "body": "Your interest in these areas will screen out 2/3 bullshitters.  Unless a guy *just* hit the lottery or exited an IPO (hasn’t learned how to spend money) no real SD declines discussing art and history.  Except if they are an engineer by training; then, well, you are dating an engineer.",
                                                    "author": "FlexEconGuy",
                                                    "id": "eyz7brm",
                                                    "parent_id": "t1_ey58agv",
                                                    "score": 4,
                                                    "created_utc": 1567611233.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey4vp0e",
            "parent_id": "t3_cvgxv8",
            "score": 18,
            "created_utc": 1566810609.0,
            "replies": [
                {
                    "body": "All this too! Keep it simple and classy, I love the thank you note idea with the lipstick, gotta try that!",
                    "author": null,
                    "id": "ey5cy3x",
                    "parent_id": "t1_ey4vp0e",
                    "score": 3,
                    "created_utc": 1566828498.0,
                    "replies": []
                },
                {
                    "body": "This is the greatest thread ever!  Yes, all of this but if you are going to play the breakfast game, do it later than normal ~ 9:30am, guys who breakfast earlier than that at 5-star hotels either have a routine and don’t want to be disturbed, have a salary job, or are in town on business.  \n\nExcellent advice on the props during the day; and not trying to play that game at night.",
                    "author": "FlexEconGuy",
                    "id": "eyz7w90",
                    "parent_id": "t1_ey4vp0e",
                    "score": 2,
                    "created_utc": 1567611603.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eyzbhj4",
                            "parent_id": "t1_eyz7w90",
                            "score": 1,
                            "created_utc": 1567613952.0,
                            "replies": [
                                {
                                    "body": "Same reason you want to hit fashionable restaurants at 4pm.  It increases the likelihood of meeting guys who don’t need to be in an office.   \n\nAlso liked the previous advice on not overdoing it on jewelry and bags.  Wear a single piece of fine, minimalist jewelry, and keep the bag from screaming.   \n\nIn my eternal search to find a new husband for my ex-wife, I keep reminding her that wearing a parkinglot’s value of jewelry doesn’t exactly scream “I’m friendly and no drama”.",
                                    "author": "FlexEconGuy",
                                    "id": "eyzcu81",
                                    "parent_id": "t1_eyzbhj4",
                                    "score": 2,
                                    "created_utc": 1567614826.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eyzduxh",
                                            "parent_id": "t1_eyzcu81",
                                            "score": 1,
                                            "created_utc": 1567615498.0,
                                            "replies": [
                                                {
                                                    "body": "You’d have to be divorced and have a penis to understand dumping liabilities on another man.  Alimony is just the beginning of it; the non-monetary issues are more annoying.   \n\nRegarding restaurants, just pick up your local society pages, see where BOLD FACE people are mentioned hanging out, then cruise the spots and look for the nice cars parked in front at 4pm.",
                                                    "author": "FlexEconGuy",
                                                    "id": "eyzjbls",
                                                    "parent_id": "t1_eyzduxh",
                                                    "score": 4,
                                                    "created_utc": 1567619013.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Two simple rules to get your foot in the door:\n\n1. be attractive\n2. do not be unattractive\n\n&#x200B;\n\nOnce your foot is in the door, show that you're an educated woman. Your demeanor, body language, manners, messaging... etc mean a world of difference to many SDs, myself included. Unfortunately, I have had to \"next\" many attractive POTs because of this.",
            "author": "RuggedDaddy69",
            "id": "ey44koc",
            "parent_id": "t3_cvgxv8",
            "score": 42,
            "created_utc": 1566781640.0,
            "replies": [
                {
                    "body": "This whole post can be condensed down to this.",
                    "author": null,
                    "id": "ey5h91o",
                    "parent_id": "t1_ey44koc",
                    "score": 5,
                    "created_utc": 1566831602.0,
                    "replies": []
                },
                {
                    "body": "Ok.  But here is my issue with your argument.  If you are dating girls like OP, and are socially active, you will know them.  They’ve probably slept with a friend or two.  They are actually sugar seekers with an eye on the prize.  What you are talking about is targeting exploitation of poor girls.",
                    "author": "FlexEconGuy",
                    "id": "eyz8edx",
                    "parent_id": "t1_ey44koc",
                    "score": 7,
                    "created_utc": 1567611935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Also, don’t mention you’re looking for a SD unless he says something like that first. \n\nYessss, thank you for writing this.  Every time I read a post made by some clueless girl who wants to try freestyling but lacks any sort of subtlety I die a little inside.",
            "author": null,
            "id": "ey4737q",
            "parent_id": "t3_cvgxv8",
            "score": 25,
            "created_utc": 1566783597.0,
            "replies": [
                {
                    "body": "Same, it’s just not necessary! No 50 year old man on a date with a girl half his age is thinking “bet she wants me for my high energy and good looks!” They’re not stupid lol",
                    "author": null,
                    "id": "ey47s02",
                    "parent_id": "t1_ey4737q",
                    "score": 22,
                    "created_utc": 1566784141.0,
                    "replies": [
                        {
                            "body": ">No 50 year old man on a date with a girl half his age is thinking “bet she wants me for my high energy and good looks!” They’re not stupid lol\n\nGirl, really?? Never underestimate delusion haha. \n\nHave you not seen the copious amount of old men on Tinder with their age range set down to 18 but 'No SB's or golddiggers!' in their profile/ paunchy, average guys who label themselves as handsome and athletic/ age set at 44 when that was clearly at least 10 years ago?\n\nThat's not to say that the brash approach is a wise one to take. Tact is key but being too coy and expecting he will know what's up because of an age and looks disparity can definitely lead a girl to waste her time on dates with someone who is hoping he's just hit the jackpot.\n\nThis post was a good read though :)",
                            "author": "yourgirlfriday99",
                            "id": "ey4j8s2",
                            "parent_id": "t1_ey47s02",
                            "score": 36,
                            "created_utc": 1566794249.0,
                            "replies": [
                                {
                                    "body": "That’s true, but those guys aren’t ever successful from what I’ve seen. Guys who can easily afford to have a SB, unless they’re exceptionally handsome or young, will likely be at least interested in the idea because it means dating hotter girls with less commitment. All the rich guys I’ve dated have had the mindset of “well, I hope you’re just a bit of a gold digger, because that means you’re smart, have high standards, and appreciate my wealth.” Broke guys hate girls who date wealthy guys because they feel entitled to them.",
                                    "author": null,
                                    "id": "ey4jld3",
                                    "parent_id": "t1_ey4j8s2",
                                    "score": 16,
                                    "created_utc": 1566794611.0,
                                    "replies": [
                                        {
                                            "body": "Well if we're specifically talking about the ones on dating sites then yes, I highly doubt they have much success! I was speaking more generally to general delusions and expectations. \n\nMy main point of disagreement is that just because a guy is significantly older does not mean that he will know what's up on a date with someone out of his physical league. Even for wealthy guys, a lot of their reservations are tied up in ego and 'paying for it' regardless of whether they can afford it, is a hill to get over. Showing you the 'finer things in life' could simply mean paying for dinner at nice places. Sugar shouldn't be assumed and any girl who thinks that dating an older, rich man will just naturally evolve into a SR or even a spoiled situation with gifts/ bills needs to prepare herself for disappointment. So little hints like your 'Oh so you're good at buying? That will come in handy with me' are crucial. I think your post is great but light on the conversion to sugar element which is where most girls will struggle.",
                                            "author": "yourgirlfriday99",
                                            "id": "ey4kcb9",
                                            "parent_id": "t1_ey4jld3",
                                            "score": 10,
                                            "created_utc": 1566795400.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You aren’t targeting actual wealthy men.  All this SA sugar nonsense y’all talk will get you laughed away from the room in real life.",
                                    "author": "FlexEconGuy",
                                    "id": "eyz81bn",
                                    "parent_id": "t1_ey4j8s2",
                                    "score": 1,
                                    "created_utc": 1567611696.0,
                                    "replies": [
                                        {
                                            "body": "How do you presume to know who/ what I am targeting? I am simply describing the type of older men one encounters (and swipes left on) on Tinder and other dating sites. Extrapolating information about my personal experiences from that is a fool's exercise.",
                                            "author": "yourgirlfriday99",
                                            "id": "eyz85nj",
                                            "parent_id": "t1_eyz81bn",
                                            "score": 1,
                                            "created_utc": 1567611775.0,
                                            "replies": [
                                                {
                                                    "body": "I’m responding to what you wrote.  Your response verified my comment.",
                                                    "author": "FlexEconGuy",
                                                    "id": "eyz98ve",
                                                    "parent_id": "t1_eyz85nj",
                                                    "score": 1,
                                                    "created_utc": 1567612492.0,
                                                    "replies": [
                                                        {
                                                            "body": "Of course :)",
                                                            "author": "yourgirlfriday99",
                                                            "id": "eyz99w4",
                                                            "parent_id": "t1_eyz98ve",
                                                            "score": 1,
                                                            "created_utc": 1567612511.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love your \"So you're good at buying things? \" line. Instant classic! Flirty and cute without being demanding. \n\nI'm 100% proof that posture and nice makeup really do make a difference. I have excellent posture and my daily makeup is simple: lightly filled brows, winged liner, curled lashes, red lip. I also have several very visible tattoos, unless I'm wearing a long-sleeve high neck top, they're impossible to hide. Yet, almost everyone who has met me describes me as \"elegant\" and \"poised\" -I have nice manners and can hold a conversation,  but I'm convinced it's the posture and classic makeup that convey elegance.",
            "author": "bourbonandblonde",
            "id": "ey5vp5w",
            "parent_id": "t3_cvgxv8",
            "score": 7,
            "created_utc": 1566841427.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey4x1o2",
            "parent_id": "t3_cvgxv8",
            "score": 13,
            "created_utc": 1566812605.0,
            "replies": [
                {
                    "body": "I love her channel 😍",
                    "author": "Yummy223",
                    "id": "ey78gj6",
                    "parent_id": "t1_ey4x1o2",
                    "score": 1,
                    "created_utc": 1566874759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Devil's advocate for not dressing up. Athleisure or casual is fine. Sometimes being different from what is normally encountered at the obligatory \"high end\" social gatherings is refreshing, especially if the guy is bit introverted and doesn't want to be there in the first place.\n\nDitto on the be educated, not in your phone, and, even if you're jaded, try to be open at the first meet. Sarcasm is fine but not \"too cool for school\".\n\n\\*Note: I come from an area where high end hostesses (\\~1.5k sitting fee, 2-4k night out, their choice) are pervasive, so, as they say, variety is spice of life. Also the girls here tend to be skinny-fat, so athletic wear is a good sign.",
            "author": "chipndipper",
            "id": "ey7ndqb",
            "parent_id": "t3_cvgxv8",
            "score": 6,
            "created_utc": 1566890964.0,
            "replies": [
                {
                    "body": "That might work (though I’ve never seen athleisure attract successful men, at least not at the places I go to) but from a SB’s perspective he’ll likely perceive you as being low maintenance and be less generous",
                    "author": null,
                    "id": "ey8kffc",
                    "parent_id": "t1_ey7ndqb",
                    "score": 5,
                    "created_utc": 1566922103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Going to the most expensive bar or restaurant in town is certainly not a bad idea, but keep in mind that that’s not exactly where successful men go to relax. If they’re there, it’s probably because they’re either meeting with a client or business partner or they’re on a date. I can’t give you a cut and dry answer of where all the wealthy men in your city are hiding on a Saturday night, especially because a lot of them are traveling, at their weekend homes, or at events that mere peasants like us aren’t invited to (yet). But once you make a few connections and get your foot in the door of a few well to do social circles, you’ll get a better idea. Even just a successful guy on a date telling you a story about going out with drinks at whatever bar can give you a new idea for somewhere to go.\n\nThis 100%, once you get into their circles, your chances of meeting a wealthy man greatly increase.  A lot of these circles include non-profits & political events.",
            "author": "mollyflowers",
            "id": "ey5ixcz",
            "parent_id": "t3_cvgxv8",
            "score": 7,
            "created_utc": 1566832805.0,
            "replies": [
                {
                    "body": "Exactly, my best friend comes from old New York money and she’s introduced me to so much socially",
                    "author": null,
                    "id": "ey5j6ql",
                    "parent_id": "t1_ey5ixcz",
                    "score": 1,
                    "created_utc": 1566832987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually found those very helpful, and it works in my favor since I am looking for a man who is wealthy and loving/wants a serious relationship at the same time.\n\nBut I don't live in such a huge area as Manhattan (which of course, wealthy men are easy to find there). Are rich men on dating websites willing to travel (within state still) far to meet somebody? They have the $$$ but will they do it? Because while there are a some fancy restaurants and stuff where I live, you pointed out that it might not be the best place to get a guy all by himself- doubtful such a wealthy man is going to be sitting all alone.\n\nlol @ the Epstein comment. Just loved the humor in general in your post. Have you ever considered publishing this as an article in a magazine or something?",
            "author": "TheOmegaWerewolf",
            "id": "ey467d8",
            "parent_id": "t3_cvgxv8",
            "score": 13,
            "created_utc": 1566782910.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey4vksg",
                    "parent_id": "t1_ey467d8",
                    "score": 4,
                    "created_utc": 1566810432.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ey5lqsj",
                            "parent_id": "t1_ey4vksg",
                            "score": 0,
                            "created_utc": 1566834741.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ey6gz0w",
                                    "parent_id": "t1_ey5lqsj",
                                    "score": 2,
                                    "created_utc": 1566855369.0,
                                    "replies": [
                                        {
                                            "body": "i just meant in general, if I stood out enough to them. obviously, i would have to stand out a lot if they went to those lengths.",
                                            "author": "TheOmegaWerewolf",
                                            "id": "ey6p1pn",
                                            "parent_id": "t1_ey6gz0w",
                                            "score": 2,
                                            "created_utc": 1566860678.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m not quite sure how far guys will travel because it’s not an issue for me, but have good dating profiles and it’ll be more of an incentive for them to come to you/get a car for you. Check out @theslumflower on IG, she has a great highlight for dating apps. And thank you! I’ve thought about starting a blog, especially because I have a bunch of stories from dating wealthy men. We’ll see!",
                    "author": null,
                    "id": "ey47m6d",
                    "parent_id": "t1_ey467d8",
                    "score": 3,
                    "created_utc": 1566784013.0,
                    "replies": [
                        {
                            "body": "Okay, I'll have to check that IG out.\n\nAlso, if you do start a blog, will you put a link to it here too lol",
                            "author": "TheOmegaWerewolf",
                            "id": "ey47v00",
                            "parent_id": "t1_ey47m6d",
                            "score": 3,
                            "created_utc": 1566784208.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes!!\n\n(Bonus) Don't be a poser.\n\nDon’t be someone you're not - doing that will always attract someone that can sense your nervous energy, and will take advantage of that uneasiness.\n\nBe yourself. If you don't dress up, don't like dresses, stop looking for men that expect their women to look \"polished\" at all times. Find a casual man, they exist!",
            "author": "brownandsweet",
            "id": "ey4748y",
            "parent_id": "t3_cvgxv8",
            "score": 9,
            "created_utc": 1566783619.0,
            "replies": [
                {
                    "body": "Absolutely! I do dress up and enjoy a lot of the ‘finer things’ but I didn’t grow up that way and I’m occasionally clumsy in situations I’m not used to. I try to amp up the classier side of me, but rich people have quite the nose for posers, and rightfully so!",
                    "author": null,
                    "id": "ey47we9",
                    "parent_id": "t1_ey4748y",
                    "score": 3,
                    "created_utc": 1566784238.0,
                    "replies": [
                        {
                            "body": "Same. The more we put ourselves in those environments, the more we’ll learn. Look up school of affluence and Gloria Starr on YouTube. They’re amazing. They talk a lot about about fashion and Etiquette.",
                            "author": "brownandsweet",
                            "id": "ey48wmr",
                            "parent_id": "t1_ey47we9",
                            "score": 5,
                            "created_utc": 1566785031.0,
                            "replies": [
                                {
                                    "body": "I’ve heard of school of affluence but not Gloria Starr, thank you! I should brush up on my etiquette tips because a very successful finance is guy is taking me to a work party soon and unfortunately I have to repress the part of me that wants to get champagne drunk and ask everyone how much money they make 😩",
                                    "author": null,
                                    "id": "ey4am7r",
                                    "parent_id": "t1_ey48wmr",
                                    "score": 6,
                                    "created_utc": 1566786424.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wonderful advice.  The only item I would emphasize is that the sexiest thing a woman can wear is a smile.",
            "author": "LoftDaddy",
            "id": "ey44m1k",
            "parent_id": "t3_cvgxv8",
            "score": 11,
            "created_utc": 1566781670.0,
            "replies": [
                {
                    "body": "Also add some warm occasional eye contact as you are flashing that smile.",
                    "author": "brownandsweet",
                    "id": "ey47u8l",
                    "parent_id": "t1_ey44m1k",
                    "score": 4,
                    "created_utc": 1566784191.0,
                    "replies": []
                },
                {
                    "body": "This too, I need to work on it myself! Been crossing from ‘ooh you’re so mysterious and hard to impress’ to ‘wait do you actually even like me’ a little too often lately",
                    "author": null,
                    "id": "ey47oqg",
                    "parent_id": "t1_ey44m1k",
                    "score": 4,
                    "created_utc": 1566784071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is all great advice! \n\nI’d like to emphasize how important it is to be looking your best as often as possible. I’ve met my best SD’s at airport bars (otw to see a current SD) and while car shopping! It literally can happen anywhere so I don’t even hit the dog park without a little game 😅",
            "author": "113lbsofsugar",
            "id": "ey4xk4k",
            "parent_id": "t3_cvgxv8",
            "score": 9,
            "created_utc": 1566813348.0,
            "replies": [
                {
                    "body": "It really is amazing, I’ve been approached by a multimillionaire at the grocery store lmao",
                    "author": null,
                    "id": "ey5c30m",
                    "parent_id": "t1_ey4xk4k",
                    "score": 1,
                    "created_utc": 1566827846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is great! I enjoyed your sense of humor and style. Never apologize to the people with short attention spans. Your post was exactly the right length and very cleverly written.",
            "author": "SDforreal",
            "id": "ey4594n",
            "parent_id": "t3_cvgxv8",
            "score": 7,
            "created_utc": 1566782169.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": null,
                    "id": "ey47p2c",
                    "parent_id": "t1_ey4594n",
                    "score": 2,
                    "created_utc": 1566784078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey4w4rh",
            "parent_id": "t3_cvgxv8",
            "score": 6,
            "created_utc": 1566811261.0,
            "replies": [
                {
                    "body": "True, I prefer not to but approaching doesn’t hurt. And yes, appearance isn’t everything, even though I love me a handsome man in a suit! My current SD is super attractive but he wears t shirts and shorts to $1k dinners lmao, tech guys am I right",
                    "author": null,
                    "id": "ey5ch4w",
                    "parent_id": "t1_ey4w4rh",
                    "score": 4,
                    "created_utc": 1566828142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ey4833o",
            "parent_id": "t3_cvgxv8",
            "score": 3,
            "created_utc": 1566784387.0,
            "replies": [
                {
                    "body": "Yass love her! Wish I could get the quote “the right guy is an illusion, start living your lives” written on the sky tbh",
                    "author": null,
                    "id": "ey4aq60",
                    "parent_id": "t1_ey4833o",
                    "score": 5,
                    "created_utc": 1566786517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I literally channel Samantha Jones with my body language and that shit really does work lol.\n\nFor me Angelina J. as Lara Croft in Tomb Raider. \n\nWhew, that movie lowkey changed my life.",
            "author": "bsbdfw",
            "id": "ey4kbhv",
            "parent_id": "t3_cvgxv8",
            "score": 5,
            "created_utc": 1566795377.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey51grr",
                    "parent_id": "t1_ey4kbhv",
                    "score": 2,
                    "created_utc": 1566818345.0,
                    "replies": [
                        {
                            "body": "It was her body language. \n\nThe confidence. \nThe unflappable cool. \nIt always seemed that no matter the situation, even if she was the odd man out, she had what it takes to be there. \n\nIt may have been my overactive imagination but I took nothing but positives from it.",
                            "author": "bsbdfw",
                            "id": "ey5bz8i",
                            "parent_id": "t1_ey51grr",
                            "score": 3,
                            "created_utc": 1566827767.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey5eo4v",
            "parent_id": "t3_cvgxv8",
            "score": 6,
            "created_utc": 1566829763.0,
            "replies": [
                {
                    "body": "Girl same! Ever since I started sugaring I’ve been like yeah these are the men for me lmao",
                    "author": null,
                    "id": "ey5f2pl",
                    "parent_id": "t1_ey5eo4v",
                    "score": 2,
                    "created_utc": 1566830055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love reading this sub. I thought I'd be a SB one day, try and get into the lifestyle but every day I'm reminded I'm not cut out for it. \n\nY'all got it all going on, good on y'all! Maybe I'll try this one day, but all of it sounds so exhausting and for me, fake. Bc I like to be comfy and true to myself. I feel uncomfortable and out of place at an average of a $14+ dollar place.",
            "author": "AccursedHalo",
            "id": "ey5ifzd",
            "parent_id": "t3_cvgxv8",
            "score": 6,
            "created_utc": 1566832463.0,
            "replies": [
                {
                    "body": "Yeah you have to be kind of naturally high maintenance or else it will feel unnatural, that’s why 99% of my attractive single friends aren’t SBs",
                    "author": null,
                    "id": "ey5ilpd",
                    "parent_id": "t1_ey5ifzd",
                    "score": 6,
                    "created_utc": 1566832576.0,
                    "replies": [
                        {
                            "body": "I used to get called high maintenance, still do. But, I grew up poor and lots of situations have probably humbled me to the point I just ain't got that attitude, confidence and stuff anymore. 😅 and I mean, living in a completely wrecked house for 11 months after Florence, I think I just realized I'm very lucky with what I have.\n\nBut man, if i could grab a man who got unlimited wealth. Lol! Fairy tale dreams. Gotta work it to have it.",
                            "author": "AccursedHalo",
                            "id": "ey5j397",
                            "parent_id": "t1_ey5ilpd",
                            "score": 3,
                            "created_utc": 1566832920.0,
                            "replies": [
                                {
                                    "body": "Girl that attitude and confidence can come back! Fake it til you make it, a year ago I lived in a closet sized bedroom with no windows and I was still going out to places I couldn’t afford strutting my stuff in $12 dresses lol",
                                    "author": null,
                                    "id": "ey5jask",
                                    "parent_id": "t1_ey5j397",
                                    "score": 6,
                                    "created_utc": 1566833066.0,
                                    "replies": [
                                        {
                                            "body": "Haha! Gives me hope! But I've never been good at faking anything. Probably why I failed so miserably in retail work. My facial expression speaks volumes! Probably another reason I'd never land a high class man. Oops!",
                                            "author": "AccursedHalo",
                                            "id": "ey5jk0a",
                                            "parent_id": "t1_ey5jask",
                                            "score": 1,
                                            "created_utc": 1566833241.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey4vvbq",
            "parent_id": "t3_cvgxv8",
            "score": 6,
            "created_utc": 1566810871.0,
            "replies": [
                {
                    "body": "Thank you! Absolutely, being well put together and confident drives posers away fast.",
                    "author": null,
                    "id": "ey5coxa",
                    "parent_id": "t1_ey4vvbq",
                    "score": 2,
                    "created_utc": 1566828305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A high percentage of new relationships start at the workplace.   Why not take a low level job at a target rich environment?   From the inside, you can quickly assess which men are top earners...or have the potential to be top earners.\n\nThe job market is so frothy right now...you could almost plan to bounce comfortably every couple of months, to broaden the search.\n\nOne more thing.....a young hottie who is actually a great worker is doubly hot.   So work hard if you see a lot of POTs at a work place.",
            "author": "sdphilly",
            "id": "ey55wlw",
            "parent_id": "t3_cvgxv8",
            "score": 4,
            "created_utc": 1566822814.0,
            "replies": [
                {
                    "body": "Horrible idea. A high level boss is not going to shit where he eats, unless it's banging his secretary on a one off.",
                    "author": "Gucci_Cocaine",
                    "id": "ey5ec79",
                    "parent_id": "t1_ey55wlw",
                    "score": 3,
                    "created_utc": 1566829525.0,
                    "replies": [
                        {
                            "body": "I'm not suggesting the SB, or potential SDs gets involved in any non-professional activities.\nI am suggesting that the right workplace is a great place to see the beast in his habitat.   For example, you meet doctors at hospitals....financial wizards live on Wall St. \nWe had a real hottie a few years back join my club waitstaff.  She could flirt with the best, and was a big reason why people started dining more.  She eventually got into a relationship with a member...which got her fired.   The word in the locker room was that the member relationship was much more lucrative than the tips she got serving ice teas.\nPlus...networking with that member introduced her to a ton of other wealthy folks.   Whether her goal was to meet rich men or not...that gig at the Club worked out nicely for her.",
                            "author": "sdphilly",
                            "id": "ey5qiyb",
                            "parent_id": "t1_ey5ec79",
                            "score": 1,
                            "created_utc": 1566837988.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So my take away is that some women are constantly barraged by men “approaching them”, and this advice is how to control the flood.",
            "author": null,
            "id": "ey44y5j",
            "parent_id": "t3_cvgxv8",
            "score": 3,
            "created_utc": 1566781929.0,
            "replies": [
                {
                    "body": "Lol, you could see it that way. But also that wealthy men have more options and are more selective in who they approach.",
                    "author": null,
                    "id": "ey47es6",
                    "parent_id": "t1_ey44y5j",
                    "score": 3,
                    "created_utc": 1566783849.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm in NYC too. I'm curious, which dive bar were you in and what were you wearing? Can you recommend any fancy bars to check out? Thanks!",
            "author": "aceshighsays",
            "id": "ey4lcmh",
            "parent_id": "t3_cvgxv8",
            "score": 3,
            "created_utc": 1566796490.0,
            "replies": [
                {
                    "body": "I was in Madame X wearing a cocktail dress, I don’t remember which one! And champagne/hotel bars are best, I’m still going out and seeing where works best.",
                    "author": null,
                    "id": "ey5dmd9",
                    "parent_id": "t1_ey4lcmh",
                    "score": 5,
                    "created_utc": 1566828998.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "aceshighsays",
                            "id": "ey5o1z6",
                            "parent_id": "t1_ey5dmd9",
                            "score": 1,
                            "created_utc": 1566836325.0,
                            "replies": []
                        },
                        {
                            "body": "Madame X? I can get that but its such a hit or miss crowd...",
                            "author": "Yummy223",
                            "id": "ey78sss",
                            "parent_id": "t1_ey5dmd9",
                            "score": 1,
                            "created_utc": 1566875042.0,
                            "replies": [
                                {
                                    "body": "Yeah I don’t really go there for the crowd, or go there much in general. I wasn’t there to freestyle it was just the place my friend wanted to meet",
                                    "author": null,
                                    "id": "ey8kj5t",
                                    "parent_id": "t1_ey78sss",
                                    "score": 2,
                                    "created_utc": 1566922170.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This should be stickied! \n\nI wish all the SBs the best of luck in their quest to snag some whales.",
            "author": "jackknight208",
            "id": "ey4m57f",
            "parent_id": "t3_cvgxv8",
            "score": 3,
            "created_utc": 1566797350.0,
            "replies": []
        },
        {
            "body": "In general good advice but there's one point that irks me.\n\n>Also, don’t mention you’re looking for a SD unless he says something like that first. You can bring that up via text \n\nYou are going to bring up the hard sell by text? A medium where you have no way to calibrate impact, little possibility to soften the blow or use your presence that likely got you so far.\n\n\nThis is not a good closing tactic.",
            "author": "KeyToGramercy",
            "id": "ey82iej",
            "parent_id": "t3_cvgxv8",
            "score": 1,
            "created_utc": 1566909437.0,
            "replies": [
                {
                    "body": "It’s always worked for me but thats probably a better idea, bring it up the next time you meet the guy",
                    "author": null,
                    "id": "ey8i8kn",
                    "parent_id": "t1_ey82iej",
                    "score": 3,
                    "created_utc": 1566920686.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She has mastered the art of finding wealthy men . A true pro.",
            "author": "dade_murphy1",
            "id": "eyl3dg9",
            "parent_id": "t3_cvgxv8",
            "score": 1,
            "created_utc": 1567175217.0,
            "replies": []
        },
        {
            "body": "... I’m in love.  No clue how I missed this post, but yes... yes... yes to basically everything except a minor asterisk that a wealthy man approaching this woman with any hope of success would not at all be nice; I’d whisper something filthy into her ear and she will either laugh or slap me.    \n\nReading this legit had me running thru my calendar thinking when I’m next in NYC, hot rock shrimp, tank tops at the beach drinking wine and trash talking bankers and lawyers... \n\nLadies... THIS.  Grab a few books on manners, sit-up straight, and follow this woman’s advice.",
            "author": "FlexEconGuy",
            "id": "eyz6jhi",
            "parent_id": "t3_cvgxv8",
            "score": 1,
            "created_utc": 1567610721.0,
            "replies": [
                {
                    "body": "I’m flattered 😘",
                    "author": null,
                    "id": "eyzjqwn",
                    "parent_id": "t1_eyz6jhi",
                    "score": 1,
                    "created_utc": 1567619284.0,
                    "replies": [
                        {
                            "body": "You should be, I’m probably better looking than you.",
                            "author": "FlexEconGuy",
                            "id": "eyzkxd5",
                            "parent_id": "t1_eyzjqwn",
                            "score": 1,
                            "created_utc": 1567620030.0,
                            "replies": [
                                {
                                    "body": "Sure you are honey",
                                    "author": null,
                                    "id": "eyzljs4",
                                    "parent_id": "t1_eyzkxd5",
                                    "score": 2,
                                    "created_utc": 1567620439.0,
                                    "replies": [
                                        {
                                            "body": "The concept of not being the best looking person in the room is suddenly distracting.",
                                            "author": "FlexEconGuy",
                                            "id": "eyzlyri",
                                            "parent_id": "t1_eyzljs4",
                                            "score": 2,
                                            "created_utc": 1567620715.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t wanna have to be the funny one 😢",
                                                    "author": null,
                                                    "id": "eyzm3eo",
                                                    "parent_id": "t1_eyzlyri",
                                                    "score": 1,
                                                    "created_utc": 1567620801.0,
                                                    "replies": [
                                                        {
                                                            "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
                                                            "author": "FlexEconGuy",
                                                            "id": "eyzndye",
                                                            "parent_id": "t1_eyzm3eo",
                                                            "score": 3,
                                                            "created_utc": 1567621569.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am! It’s the upside of being a walking nightmare",
                                                                    "author": null,
                                                                    "id": "ez0b8dq",
                                                                    "parent_id": "t1_eyzndye",
                                                                    "score": 2,
                                                                    "created_utc": 1567634267.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey44x8k",
            "parent_id": "t3_cvgxv8",
            "score": 1,
            "created_utc": 1566781909.0,
            "replies": [
                {
                    "body": "Thank you 💅🍾",
                    "author": null,
                    "id": "ey47xl0",
                    "parent_id": "t1_ey44x8k",
                    "score": 1,
                    "created_utc": 1566784264.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey46m9x",
            "parent_id": "t3_cvgxv8",
            "score": 1,
            "created_utc": 1566783230.0,
            "replies": [
                {
                    "body": "Do your thing, I’m sure it won’t keep you up at night knowing you’re not my type. Even if it should ;)",
                    "author": null,
                    "id": "ey4807d",
                    "parent_id": "t1_ey46m9x",
                    "score": 4,
                    "created_utc": 1566784322.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ey48lob",
                            "parent_id": "t1_ey4807d",
                            "score": 2,
                            "created_utc": 1566784794.0,
                            "replies": [
                                {
                                    "body": "Chatting yes.🙂 But there is no scent of a woman nearby lol.",
                                    "author": "SDforreal",
                                    "id": "ey4c2i8",
                                    "parent_id": "t1_ey48lob",
                                    "score": 7,
                                    "created_utc": 1566787630.0,
                                    "replies": [
                                        {
                                            "body": "True, and I smell gooood",
                                            "author": null,
                                            "id": "ey4fe00",
                                            "parent_id": "t1_ey4c2i8",
                                            "score": 6,
                                            "created_utc": 1566790516.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would also add that you slant your political leanings towards the right. Among men my age there's not very many Democrats. No one wants to hear about how much they hate Donald Trump or the socialist nature of Bernie Sanders.",
            "author": "JDiGi7730",
            "id": "ey4qcbd",
            "parent_id": "t3_cvgxv8",
            "score": -1,
            "created_utc": 1566802644.0,
            "replies": [
                {
                    "body": "Why bring up politics at all? Ego is what drives many people to politics these days, which makes it hard to have a civil conversation about it without people getting “offended” and attacking your character. Ego!! And it’s not a right or left thing, it’s all sides. I rather avoid at all cost. There’s many other things we can talk about. \n\nAlso not every Republican are fans of Trump.. lol.",
                    "author": "brownandsweet",
                    "id": "ey58ghi",
                    "parent_id": "t1_ey4qcbd",
                    "score": 5,
                    "created_utc": 1566825014.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ey7iu8a",
                            "parent_id": "t1_ey58ghi",
                            "score": 0,
                            "created_utc": 1566885131.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I very rarely meet full-blown Republicans, possibly because I tend to go for 45 and below, but yeah to some extent. Just avoid any “fuck the rich” type statements because, well, you’re fucking the rich.",
                    "author": null,
                    "id": "ey5d87h",
                    "parent_id": "t1_ey4qcbd",
                    "score": 8,
                    "created_utc": 1566828706.0,
                    "replies": [
                        {
                            "body": "To be successful in the bowl with an age cap of 45?\n\nDamn. I need to move to NY.",
                            "author": "bsbdfw",
                            "id": "ey5eqa3",
                            "parent_id": "t1_ey5d87h",
                            "score": 2,
                            "created_utc": 1566829806.0,
                            "replies": [
                                {
                                    "body": "Lmao, my current SD is 33 and started giving me cash well before we ever slept together 😭 idk how this happened",
                                    "author": null,
                                    "id": "ey5ezx8",
                                    "parent_id": "t1_ey5eqa3",
                                    "score": 4,
                                    "created_utc": 1566829999.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A desperate liberal woman sleeping with older men just to make ends meet. Fits the stereotype of a liberal.\n\nThat's hot. Not going to lie.",
                    "author": "InvestmentBanker19",
                    "id": "ey4yjhj",
                    "parent_id": "t1_ey4qcbd",
                    "score": -8,
                    "created_utc": 1566814722.0,
                    "replies": [
                        {
                            "body": "I don’t think many of us are desperate, Sachs.",
                            "author": null,
                            "id": "ey5d9v5",
                            "parent_id": "t1_ey4yjhj",
                            "score": 9,
                            "created_utc": 1566828740.0,
                            "replies": [
                                {
                                    "body": "Well, desperate was an exaggeration. \n\nIf I really wanted actual desperation, I'd get a street hooker.",
                                    "author": "InvestmentBanker19",
                                    "id": "ey5djc7",
                                    "parent_id": "t1_ey5d9v5",
                                    "score": -3,
                                    "created_utc": 1566828935.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel like I personally wrote this, haha.",
            "author": "SapioSugarBabe",
            "id": "ey43nle",
            "parent_id": "t3_cvgxv8",
            "score": -2,
            "created_utc": 1566780931.0,
            "replies": []
        },
        {
            "body": "Suspend your disbelief!",
            "author": "HMU2018",
            "id": "ey6q4au",
            "parent_id": "t3_cvgxv8",
            "score": -1,
            "created_utc": 1566861348.0,
            "replies": []
        },
        {
            "body": "That’s a great tip for freestyling! Being on your phone is def a bad look, and I’ve brought a book to a bar a few times but it made me feel like I was screaming “look at me! Pretty girl reading a book!” so that’s a great compromise.",
            "author": null,
            "id": "ey4ahex",
            "parent_id": "t1_ey49uh3",
            "score": 27,
            "created_utc": 1566786313.0,
            "replies": [
                {
                    "body": "Yeah, but I’m curious what book the pretty girl is reading.   Playing on your phone is a major turnoff unless it at least looks like you are working, thus the notebook.",
                    "author": "FlexEconGuy",
                    "id": "eyz6r7z",
                    "parent_id": "t1_ey4ahex",
                    "score": 3,
                    "created_utc": 1567610861.0,
                    "replies": [
                        {
                            "body": "Eh it still feels too peacock-y for me, I’m a designer so the notebook works perfectly",
                            "author": null,
                            "id": "eyzjpl0",
                            "parent_id": "t1_eyz6r7z",
                            "score": 3,
                            "created_utc": 1567619260.0,
                            "replies": [
                                {
                                    "body": "I currently have two notebooks, a laptop, diary, and book on some religious cult in front of me at the sake bar.   #notprops ;)  \n\nGiven my tank top under a powder blue sports coat and jeans that perfectly match my NB, you might call me peacock-y.   I’m even rocking a lapel pin of some bird I just realized was upside down.   Thanks for making me notice.",
                                    "author": "FlexEconGuy",
                                    "id": "eyzkcpw",
                                    "parent_id": "t1_eyzjpl0",
                                    "score": 5,
                                    "created_utc": 1567619669.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! Be familiar with current events to intrigue him and be able to distract him from what’s going on in the world to seduce him.",
            "author": null,
            "id": "ey5bjzh",
            "parent_id": "t1_ey57jyw",
            "score": 4,
            "created_utc": 1566827447.0,
            "replies": []
        },
        {
            "body": "Ooh, and, I find is equally important as being able to \\*talk\\* about a lot of topics: be able to \\*listen\\* about a lot of topics. As in curious, truly listening to ask the right questions. Men LOVE talking about themselves. The dates where I let a man talk and answer questions have always been called some of the best by the man themself so, that, too!",
            "author": "SapioSugarBabe",
            "id": "ey445yv",
            "parent_id": "t1_ey441yw",
            "score": 58,
            "created_utc": 1566781324.0,
            "replies": [
                {
                    "body": "Yes! and even if it doesn’t work out with that guy, boom you have talking points for the the next guy you meet with his shared interests/industry",
                    "author": null,
                    "id": "ey47cvb",
                    "parent_id": "t1_ey445yv",
                    "score": 23,
                    "created_utc": 1566783807.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ey5dnp8",
                            "parent_id": "t1_ey47cvb",
                            "score": 8,
                            "created_utc": 1566829027.0,
                            "replies": [
                                {
                                    "body": "Exactly, I know all I know about the stock market because of all the intolerable 20 something finance bros i dated when I first moved to the city lol",
                                    "author": null,
                                    "id": "ey5ksvl",
                                    "parent_id": "t1_ey5dnp8",
                                    "score": 4,
                                    "created_utc": 1566834093.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best advice here.\n\nThe difference between the class of SBs isn't a look or a style but how they sound in conversations (educated or knowledgeable) and their level of etiquette when they are at different social functions.",
            "author": "KnocDown",
            "id": "ey4ijgh",
            "parent_id": "t1_ey441yw",
            "score": 25,
            "created_utc": 1566793531.0,
            "replies": []
        },
        {
            "body": "Ooh this too, my best friend has taught me all about wine, cheese, oysters, etc and those tips alone help so much on dates",
            "author": null,
            "id": "ey448f2",
            "parent_id": "t1_ey441yw",
            "score": 10,
            "created_utc": 1566781377.0,
            "replies": []
        },
        {
            "body": "Don't you guys see right through that?",
            "author": null,
            "id": "ey475wv",
            "parent_id": "t1_ey441yw",
            "score": -2,
            "created_utc": 1566783655.0,
            "replies": [
                {
                    "body": "What does it mean to “see right through” a pleasant conversation?\n\nWhen a sales guy from some vendor is personable, remembers my kids names, and suggests I come to an event at a hockey game, I know he’s playing a role. But it’s also the role I expect him to play. And if he gets that stuff right he’s probably good at other parts of his job.",
                    "author": "tra24602",
                    "id": "ey512cy",
                    "parent_id": "t1_ey475wv",
                    "score": 21,
                    "created_utc": 1566817896.0,
                    "replies": []
                },
                {
                    "body": "As it was once written by Coleridge, “that willing suspension of disbelief for the moment, which constitutes poetic faith.”",
                    "author": "HMU2018",
                    "id": "ey6qgxy",
                    "parent_id": "t1_ey475wv",
                    "score": 8,
                    "created_utc": 1566861570.0,
                    "replies": []
                },
                {
                    "body": "Yeah, I’m sure that guys see right through my Bachelor’s degree in Classics. My ability to speak Ancient Greek is entirely an act.",
                    "author": "sugar-magnolias",
                    "id": "ey572jv",
                    "parent_id": "t1_ey475wv",
                    "score": 14,
                    "created_utc": 1566823849.0,
                    "replies": [
                        {
                            "body": "Those may not be acts but your interest in those things might be.",
                            "author": null,
                            "id": "ey57ru4",
                            "parent_id": "t1_ey572jv",
                            "score": 2,
                            "created_utc": 1566824448.0,
                            "replies": [
                                {
                                    "body": "I mean, if a potential sugar daddy only wants to talk about fast cars and basketball, then he and I probably won’t click. You’re totally right in the sense of: Why would I get involved in a long-term sugar relationship where I have to fake my way through every conversation? But I enjoy talking about history and fine art, so I am educated about those things. I like talking about them, and many POTs think that’s impressive/enjoy talking about those things also.",
                                    "author": "sugar-magnolias",
                                    "id": "ey58agv",
                                    "parent_id": "t1_ey57ru4",
                                    "score": 6,
                                    "created_utc": 1566824876.0,
                                    "replies": [
                                        {
                                            "body": "Your interest in these areas will screen out 2/3 bullshitters.  Unless a guy *just* hit the lottery or exited an IPO (hasn’t learned how to spend money) no real SD declines discussing art and history.  Except if they are an engineer by training; then, well, you are dating an engineer.",
                                            "author": "FlexEconGuy",
                                            "id": "eyz7brm",
                                            "parent_id": "t1_ey58agv",
                                            "score": 4,
                                            "created_utc": 1567611233.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All this too! Keep it simple and classy, I love the thank you note idea with the lipstick, gotta try that!",
            "author": null,
            "id": "ey5cy3x",
            "parent_id": "t1_ey4vp0e",
            "score": 3,
            "created_utc": 1566828498.0,
            "replies": []
        },
        {
            "body": "This is the greatest thread ever!  Yes, all of this but if you are going to play the breakfast game, do it later than normal ~ 9:30am, guys who breakfast earlier than that at 5-star hotels either have a routine and don’t want to be disturbed, have a salary job, or are in town on business.  \n\nExcellent advice on the props during the day; and not trying to play that game at night.",
            "author": "FlexEconGuy",
            "id": "eyz7w90",
            "parent_id": "t1_ey4vp0e",
            "score": 2,
            "created_utc": 1567611603.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyzbhj4",
                    "parent_id": "t1_eyz7w90",
                    "score": 1,
                    "created_utc": 1567613952.0,
                    "replies": [
                        {
                            "body": "Same reason you want to hit fashionable restaurants at 4pm.  It increases the likelihood of meeting guys who don’t need to be in an office.   \n\nAlso liked the previous advice on not overdoing it on jewelry and bags.  Wear a single piece of fine, minimalist jewelry, and keep the bag from screaming.   \n\nIn my eternal search to find a new husband for my ex-wife, I keep reminding her that wearing a parkinglot’s value of jewelry doesn’t exactly scream “I’m friendly and no drama”.",
                            "author": "FlexEconGuy",
                            "id": "eyzcu81",
                            "parent_id": "t1_eyzbhj4",
                            "score": 2,
                            "created_utc": 1567614826.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eyzduxh",
                                    "parent_id": "t1_eyzcu81",
                                    "score": 1,
                                    "created_utc": 1567615498.0,
                                    "replies": [
                                        {
                                            "body": "You’d have to be divorced and have a penis to understand dumping liabilities on another man.  Alimony is just the beginning of it; the non-monetary issues are more annoying.   \n\nRegarding restaurants, just pick up your local society pages, see where BOLD FACE people are mentioned hanging out, then cruise the spots and look for the nice cars parked in front at 4pm.",
                                            "author": "FlexEconGuy",
                                            "id": "eyzjbls",
                                            "parent_id": "t1_eyzduxh",
                                            "score": 4,
                                            "created_utc": 1567619013.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This whole post can be condensed down to this.",
            "author": null,
            "id": "ey5h91o",
            "parent_id": "t1_ey44koc",
            "score": 5,
            "created_utc": 1566831602.0,
            "replies": []
        },
        {
            "body": "Ok.  But here is my issue with your argument.  If you are dating girls like OP, and are socially active, you will know them.  They’ve probably slept with a friend or two.  They are actually sugar seekers with an eye on the prize.  What you are talking about is targeting exploitation of poor girls.",
            "author": "FlexEconGuy",
            "id": "eyz8edx",
            "parent_id": "t1_ey44koc",
            "score": 7,
            "created_utc": 1567611935.0,
            "replies": []
        },
        {
            "body": "Same, it’s just not necessary! No 50 year old man on a date with a girl half his age is thinking “bet she wants me for my high energy and good looks!” They’re not stupid lol",
            "author": null,
            "id": "ey47s02",
            "parent_id": "t1_ey4737q",
            "score": 22,
            "created_utc": 1566784141.0,
            "replies": [
                {
                    "body": ">No 50 year old man on a date with a girl half his age is thinking “bet she wants me for my high energy and good looks!” They’re not stupid lol\n\nGirl, really?? Never underestimate delusion haha. \n\nHave you not seen the copious amount of old men on Tinder with their age range set down to 18 but 'No SB's or golddiggers!' in their profile/ paunchy, average guys who label themselves as handsome and athletic/ age set at 44 when that was clearly at least 10 years ago?\n\nThat's not to say that the brash approach is a wise one to take. Tact is key but being too coy and expecting he will know what's up because of an age and looks disparity can definitely lead a girl to waste her time on dates with someone who is hoping he's just hit the jackpot.\n\nThis post was a good read though :)",
                    "author": "yourgirlfriday99",
                    "id": "ey4j8s2",
                    "parent_id": "t1_ey47s02",
                    "score": 36,
                    "created_utc": 1566794249.0,
                    "replies": [
                        {
                            "body": "That’s true, but those guys aren’t ever successful from what I’ve seen. Guys who can easily afford to have a SB, unless they’re exceptionally handsome or young, will likely be at least interested in the idea because it means dating hotter girls with less commitment. All the rich guys I’ve dated have had the mindset of “well, I hope you’re just a bit of a gold digger, because that means you’re smart, have high standards, and appreciate my wealth.” Broke guys hate girls who date wealthy guys because they feel entitled to them.",
                            "author": null,
                            "id": "ey4jld3",
                            "parent_id": "t1_ey4j8s2",
                            "score": 16,
                            "created_utc": 1566794611.0,
                            "replies": [
                                {
                                    "body": "Well if we're specifically talking about the ones on dating sites then yes, I highly doubt they have much success! I was speaking more generally to general delusions and expectations. \n\nMy main point of disagreement is that just because a guy is significantly older does not mean that he will know what's up on a date with someone out of his physical league. Even for wealthy guys, a lot of their reservations are tied up in ego and 'paying for it' regardless of whether they can afford it, is a hill to get over. Showing you the 'finer things in life' could simply mean paying for dinner at nice places. Sugar shouldn't be assumed and any girl who thinks that dating an older, rich man will just naturally evolve into a SR or even a spoiled situation with gifts/ bills needs to prepare herself for disappointment. So little hints like your 'Oh so you're good at buying? That will come in handy with me' are crucial. I think your post is great but light on the conversion to sugar element which is where most girls will struggle.",
                                    "author": "yourgirlfriday99",
                                    "id": "ey4kcb9",
                                    "parent_id": "t1_ey4jld3",
                                    "score": 10,
                                    "created_utc": 1566795400.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You aren’t targeting actual wealthy men.  All this SA sugar nonsense y’all talk will get you laughed away from the room in real life.",
                            "author": "FlexEconGuy",
                            "id": "eyz81bn",
                            "parent_id": "t1_ey4j8s2",
                            "score": 1,
                            "created_utc": 1567611696.0,
                            "replies": [
                                {
                                    "body": "How do you presume to know who/ what I am targeting? I am simply describing the type of older men one encounters (and swipes left on) on Tinder and other dating sites. Extrapolating information about my personal experiences from that is a fool's exercise.",
                                    "author": "yourgirlfriday99",
                                    "id": "eyz85nj",
                                    "parent_id": "t1_eyz81bn",
                                    "score": 1,
                                    "created_utc": 1567611775.0,
                                    "replies": [
                                        {
                                            "body": "I’m responding to what you wrote.  Your response verified my comment.",
                                            "author": "FlexEconGuy",
                                            "id": "eyz98ve",
                                            "parent_id": "t1_eyz85nj",
                                            "score": 1,
                                            "created_utc": 1567612492.0,
                                            "replies": [
                                                {
                                                    "body": "Of course :)",
                                                    "author": "yourgirlfriday99",
                                                    "id": "eyz99w4",
                                                    "parent_id": "t1_eyz98ve",
                                                    "score": 1,
                                                    "created_utc": 1567612511.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love her channel 😍",
            "author": "Yummy223",
            "id": "ey78gj6",
            "parent_id": "t1_ey4x1o2",
            "score": 1,
            "created_utc": 1566874759.0,
            "replies": []
        },
        {
            "body": "That might work (though I’ve never seen athleisure attract successful men, at least not at the places I go to) but from a SB’s perspective he’ll likely perceive you as being low maintenance and be less generous",
            "author": null,
            "id": "ey8kffc",
            "parent_id": "t1_ey7ndqb",
            "score": 5,
            "created_utc": 1566922103.0,
            "replies": []
        },
        {
            "body": "Exactly, my best friend comes from old New York money and she’s introduced me to so much socially",
            "author": null,
            "id": "ey5j6ql",
            "parent_id": "t1_ey5ixcz",
            "score": 1,
            "created_utc": 1566832987.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey4vksg",
            "parent_id": "t1_ey467d8",
            "score": 4,
            "created_utc": 1566810432.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey5lqsj",
                    "parent_id": "t1_ey4vksg",
                    "score": 0,
                    "created_utc": 1566834741.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ey6gz0w",
                            "parent_id": "t1_ey5lqsj",
                            "score": 2,
                            "created_utc": 1566855369.0,
                            "replies": [
                                {
                                    "body": "i just meant in general, if I stood out enough to them. obviously, i would have to stand out a lot if they went to those lengths.",
                                    "author": "TheOmegaWerewolf",
                                    "id": "ey6p1pn",
                                    "parent_id": "t1_ey6gz0w",
                                    "score": 2,
                                    "created_utc": 1566860678.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not quite sure how far guys will travel because it’s not an issue for me, but have good dating profiles and it’ll be more of an incentive for them to come to you/get a car for you. Check out @theslumflower on IG, she has a great highlight for dating apps. And thank you! I’ve thought about starting a blog, especially because I have a bunch of stories from dating wealthy men. We’ll see!",
            "author": null,
            "id": "ey47m6d",
            "parent_id": "t1_ey467d8",
            "score": 3,
            "created_utc": 1566784013.0,
            "replies": [
                {
                    "body": "Okay, I'll have to check that IG out.\n\nAlso, if you do start a blog, will you put a link to it here too lol",
                    "author": "TheOmegaWerewolf",
                    "id": "ey47v00",
                    "parent_id": "t1_ey47m6d",
                    "score": 3,
                    "created_utc": 1566784208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely! I do dress up and enjoy a lot of the ‘finer things’ but I didn’t grow up that way and I’m occasionally clumsy in situations I’m not used to. I try to amp up the classier side of me, but rich people have quite the nose for posers, and rightfully so!",
            "author": null,
            "id": "ey47we9",
            "parent_id": "t1_ey4748y",
            "score": 3,
            "created_utc": 1566784238.0,
            "replies": [
                {
                    "body": "Same. The more we put ourselves in those environments, the more we’ll learn. Look up school of affluence and Gloria Starr on YouTube. They’re amazing. They talk a lot about about fashion and Etiquette.",
                    "author": "brownandsweet",
                    "id": "ey48wmr",
                    "parent_id": "t1_ey47we9",
                    "score": 5,
                    "created_utc": 1566785031.0,
                    "replies": [
                        {
                            "body": "I’ve heard of school of affluence but not Gloria Starr, thank you! I should brush up on my etiquette tips because a very successful finance is guy is taking me to a work party soon and unfortunately I have to repress the part of me that wants to get champagne drunk and ask everyone how much money they make 😩",
                            "author": null,
                            "id": "ey4am7r",
                            "parent_id": "t1_ey48wmr",
                            "score": 6,
                            "created_utc": 1566786424.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also add some warm occasional eye contact as you are flashing that smile.",
            "author": "brownandsweet",
            "id": "ey47u8l",
            "parent_id": "t1_ey44m1k",
            "score": 4,
            "created_utc": 1566784191.0,
            "replies": []
        },
        {
            "body": "This too, I need to work on it myself! Been crossing from ‘ooh you’re so mysterious and hard to impress’ to ‘wait do you actually even like me’ a little too often lately",
            "author": null,
            "id": "ey47oqg",
            "parent_id": "t1_ey44m1k",
            "score": 4,
            "created_utc": 1566784071.0,
            "replies": []
        },
        {
            "body": "It really is amazing, I’ve been approached by a multimillionaire at the grocery store lmao",
            "author": null,
            "id": "ey5c30m",
            "parent_id": "t1_ey4xk4k",
            "score": 1,
            "created_utc": 1566827846.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": null,
            "id": "ey47p2c",
            "parent_id": "t1_ey4594n",
            "score": 2,
            "created_utc": 1566784078.0,
            "replies": []
        },
        {
            "body": "True, I prefer not to but approaching doesn’t hurt. And yes, appearance isn’t everything, even though I love me a handsome man in a suit! My current SD is super attractive but he wears t shirts and shorts to $1k dinners lmao, tech guys am I right",
            "author": null,
            "id": "ey5ch4w",
            "parent_id": "t1_ey4w4rh",
            "score": 4,
            "created_utc": 1566828142.0,
            "replies": []
        },
        {
            "body": "Yass love her! Wish I could get the quote “the right guy is an illusion, start living your lives” written on the sky tbh",
            "author": null,
            "id": "ey4aq60",
            "parent_id": "t1_ey4833o",
            "score": 5,
            "created_utc": 1566786517.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey51grr",
            "parent_id": "t1_ey4kbhv",
            "score": 2,
            "created_utc": 1566818345.0,
            "replies": [
                {
                    "body": "It was her body language. \n\nThe confidence. \nThe unflappable cool. \nIt always seemed that no matter the situation, even if she was the odd man out, she had what it takes to be there. \n\nIt may have been my overactive imagination but I took nothing but positives from it.",
                    "author": "bsbdfw",
                    "id": "ey5bz8i",
                    "parent_id": "t1_ey51grr",
                    "score": 3,
                    "created_utc": 1566827767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl same! Ever since I started sugaring I’ve been like yeah these are the men for me lmao",
            "author": null,
            "id": "ey5f2pl",
            "parent_id": "t1_ey5eo4v",
            "score": 2,
            "created_utc": 1566830055.0,
            "replies": []
        },
        {
            "body": "Yeah you have to be kind of naturally high maintenance or else it will feel unnatural, that’s why 99% of my attractive single friends aren’t SBs",
            "author": null,
            "id": "ey5ilpd",
            "parent_id": "t1_ey5ifzd",
            "score": 6,
            "created_utc": 1566832576.0,
            "replies": [
                {
                    "body": "I used to get called high maintenance, still do. But, I grew up poor and lots of situations have probably humbled me to the point I just ain't got that attitude, confidence and stuff anymore. 😅 and I mean, living in a completely wrecked house for 11 months after Florence, I think I just realized I'm very lucky with what I have.\n\nBut man, if i could grab a man who got unlimited wealth. Lol! Fairy tale dreams. Gotta work it to have it.",
                    "author": "AccursedHalo",
                    "id": "ey5j397",
                    "parent_id": "t1_ey5ilpd",
                    "score": 3,
                    "created_utc": 1566832920.0,
                    "replies": [
                        {
                            "body": "Girl that attitude and confidence can come back! Fake it til you make it, a year ago I lived in a closet sized bedroom with no windows and I was still going out to places I couldn’t afford strutting my stuff in $12 dresses lol",
                            "author": null,
                            "id": "ey5jask",
                            "parent_id": "t1_ey5j397",
                            "score": 6,
                            "created_utc": 1566833066.0,
                            "replies": [
                                {
                                    "body": "Haha! Gives me hope! But I've never been good at faking anything. Probably why I failed so miserably in retail work. My facial expression speaks volumes! Probably another reason I'd never land a high class man. Oops!",
                                    "author": "AccursedHalo",
                                    "id": "ey5jk0a",
                                    "parent_id": "t1_ey5jask",
                                    "score": 1,
                                    "created_utc": 1566833241.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Absolutely, being well put together and confident drives posers away fast.",
            "author": null,
            "id": "ey5coxa",
            "parent_id": "t1_ey4vvbq",
            "score": 2,
            "created_utc": 1566828305.0,
            "replies": []
        },
        {
            "body": "Horrible idea. A high level boss is not going to shit where he eats, unless it's banging his secretary on a one off.",
            "author": "Gucci_Cocaine",
            "id": "ey5ec79",
            "parent_id": "t1_ey55wlw",
            "score": 3,
            "created_utc": 1566829525.0,
            "replies": [
                {
                    "body": "I'm not suggesting the SB, or potential SDs gets involved in any non-professional activities.\nI am suggesting that the right workplace is a great place to see the beast in his habitat.   For example, you meet doctors at hospitals....financial wizards live on Wall St. \nWe had a real hottie a few years back join my club waitstaff.  She could flirt with the best, and was a big reason why people started dining more.  She eventually got into a relationship with a member...which got her fired.   The word in the locker room was that the member relationship was much more lucrative than the tips she got serving ice teas.\nPlus...networking with that member introduced her to a ton of other wealthy folks.   Whether her goal was to meet rich men or not...that gig at the Club worked out nicely for her.",
                    "author": "sdphilly",
                    "id": "ey5qiyb",
                    "parent_id": "t1_ey5ec79",
                    "score": 1,
                    "created_utc": 1566837988.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol, you could see it that way. But also that wealthy men have more options and are more selective in who they approach.",
            "author": null,
            "id": "ey47es6",
            "parent_id": "t1_ey44y5j",
            "score": 3,
            "created_utc": 1566783849.0,
            "replies": []
        },
        {
            "body": "I was in Madame X wearing a cocktail dress, I don’t remember which one! And champagne/hotel bars are best, I’m still going out and seeing where works best.",
            "author": null,
            "id": "ey5dmd9",
            "parent_id": "t1_ey4lcmh",
            "score": 5,
            "created_utc": 1566828998.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "aceshighsays",
                    "id": "ey5o1z6",
                    "parent_id": "t1_ey5dmd9",
                    "score": 1,
                    "created_utc": 1566836325.0,
                    "replies": []
                },
                {
                    "body": "Madame X? I can get that but its such a hit or miss crowd...",
                    "author": "Yummy223",
                    "id": "ey78sss",
                    "parent_id": "t1_ey5dmd9",
                    "score": 1,
                    "created_utc": 1566875042.0,
                    "replies": [
                        {
                            "body": "Yeah I don’t really go there for the crowd, or go there much in general. I wasn’t there to freestyle it was just the place my friend wanted to meet",
                            "author": null,
                            "id": "ey8kj5t",
                            "parent_id": "t1_ey78sss",
                            "score": 2,
                            "created_utc": 1566922170.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s always worked for me but thats probably a better idea, bring it up the next time you meet the guy",
            "author": null,
            "id": "ey8i8kn",
            "parent_id": "t1_ey82iej",
            "score": 3,
            "created_utc": 1566920686.0,
            "replies": []
        },
        {
            "body": "I’m flattered 😘",
            "author": null,
            "id": "eyzjqwn",
            "parent_id": "t1_eyz6jhi",
            "score": 1,
            "created_utc": 1567619284.0,
            "replies": [
                {
                    "body": "You should be, I’m probably better looking than you.",
                    "author": "FlexEconGuy",
                    "id": "eyzkxd5",
                    "parent_id": "t1_eyzjqwn",
                    "score": 1,
                    "created_utc": 1567620030.0,
                    "replies": [
                        {
                            "body": "Sure you are honey",
                            "author": null,
                            "id": "eyzljs4",
                            "parent_id": "t1_eyzkxd5",
                            "score": 2,
                            "created_utc": 1567620439.0,
                            "replies": [
                                {
                                    "body": "The concept of not being the best looking person in the room is suddenly distracting.",
                                    "author": "FlexEconGuy",
                                    "id": "eyzlyri",
                                    "parent_id": "t1_eyzljs4",
                                    "score": 2,
                                    "created_utc": 1567620715.0,
                                    "replies": [
                                        {
                                            "body": "I don’t wanna have to be the funny one 😢",
                                            "author": null,
                                            "id": "eyzm3eo",
                                            "parent_id": "t1_eyzlyri",
                                            "score": 1,
                                            "created_utc": 1567620801.0,
                                            "replies": [
                                                {
                                                    "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
                                                    "author": "FlexEconGuy",
                                                    "id": "eyzndye",
                                                    "parent_id": "t1_eyzm3eo",
                                                    "score": 3,
                                                    "created_utc": 1567621569.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am! It’s the upside of being a walking nightmare",
                                                            "author": null,
                                                            "id": "ez0b8dq",
                                                            "parent_id": "t1_eyzndye",
                                                            "score": 2,
                                                            "created_utc": 1567634267.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you 💅🍾",
            "author": null,
            "id": "ey47xl0",
            "parent_id": "t1_ey44x8k",
            "score": 1,
            "created_utc": 1566784264.0,
            "replies": []
        },
        {
            "body": "Do your thing, I’m sure it won’t keep you up at night knowing you’re not my type. Even if it should ;)",
            "author": null,
            "id": "ey4807d",
            "parent_id": "t1_ey46m9x",
            "score": 4,
            "created_utc": 1566784322.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey48lob",
                    "parent_id": "t1_ey4807d",
                    "score": 2,
                    "created_utc": 1566784794.0,
                    "replies": [
                        {
                            "body": "Chatting yes.🙂 But there is no scent of a woman nearby lol.",
                            "author": "SDforreal",
                            "id": "ey4c2i8",
                            "parent_id": "t1_ey48lob",
                            "score": 7,
                            "created_utc": 1566787630.0,
                            "replies": [
                                {
                                    "body": "True, and I smell gooood",
                                    "author": null,
                                    "id": "ey4fe00",
                                    "parent_id": "t1_ey4c2i8",
                                    "score": 6,
                                    "created_utc": 1566790516.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why bring up politics at all? Ego is what drives many people to politics these days, which makes it hard to have a civil conversation about it without people getting “offended” and attacking your character. Ego!! And it’s not a right or left thing, it’s all sides. I rather avoid at all cost. There’s many other things we can talk about. \n\nAlso not every Republican are fans of Trump.. lol.",
            "author": "brownandsweet",
            "id": "ey58ghi",
            "parent_id": "t1_ey4qcbd",
            "score": 5,
            "created_utc": 1566825014.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey7iu8a",
                    "parent_id": "t1_ey58ghi",
                    "score": 0,
                    "created_utc": 1566885131.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I very rarely meet full-blown Republicans, possibly because I tend to go for 45 and below, but yeah to some extent. Just avoid any “fuck the rich” type statements because, well, you’re fucking the rich.",
            "author": null,
            "id": "ey5d87h",
            "parent_id": "t1_ey4qcbd",
            "score": 8,
            "created_utc": 1566828706.0,
            "replies": [
                {
                    "body": "To be successful in the bowl with an age cap of 45?\n\nDamn. I need to move to NY.",
                    "author": "bsbdfw",
                    "id": "ey5eqa3",
                    "parent_id": "t1_ey5d87h",
                    "score": 2,
                    "created_utc": 1566829806.0,
                    "replies": [
                        {
                            "body": "Lmao, my current SD is 33 and started giving me cash well before we ever slept together 😭 idk how this happened",
                            "author": null,
                            "id": "ey5ezx8",
                            "parent_id": "t1_ey5eqa3",
                            "score": 4,
                            "created_utc": 1566829999.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A desperate liberal woman sleeping with older men just to make ends meet. Fits the stereotype of a liberal.\n\nThat's hot. Not going to lie.",
            "author": "InvestmentBanker19",
            "id": "ey4yjhj",
            "parent_id": "t1_ey4qcbd",
            "score": -8,
            "created_utc": 1566814722.0,
            "replies": [
                {
                    "body": "I don’t think many of us are desperate, Sachs.",
                    "author": null,
                    "id": "ey5d9v5",
                    "parent_id": "t1_ey4yjhj",
                    "score": 9,
                    "created_utc": 1566828740.0,
                    "replies": [
                        {
                            "body": "Well, desperate was an exaggeration. \n\nIf I really wanted actual desperation, I'd get a street hooker.",
                            "author": "InvestmentBanker19",
                            "id": "ey5djc7",
                            "parent_id": "t1_ey5d9v5",
                            "score": -3,
                            "created_utc": 1566828935.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, but I’m curious what book the pretty girl is reading.   Playing on your phone is a major turnoff unless it at least looks like you are working, thus the notebook.",
            "author": "FlexEconGuy",
            "id": "eyz6r7z",
            "parent_id": "t1_ey4ahex",
            "score": 3,
            "created_utc": 1567610861.0,
            "replies": [
                {
                    "body": "Eh it still feels too peacock-y for me, I’m a designer so the notebook works perfectly",
                    "author": null,
                    "id": "eyzjpl0",
                    "parent_id": "t1_eyz6r7z",
                    "score": 3,
                    "created_utc": 1567619260.0,
                    "replies": [
                        {
                            "body": "I currently have two notebooks, a laptop, diary, and book on some religious cult in front of me at the sake bar.   #notprops ;)  \n\nGiven my tank top under a powder blue sports coat and jeans that perfectly match my NB, you might call me peacock-y.   I’m even rocking a lapel pin of some bird I just realized was upside down.   Thanks for making me notice.",
                            "author": "FlexEconGuy",
                            "id": "eyzkcpw",
                            "parent_id": "t1_eyzjpl0",
                            "score": 5,
                            "created_utc": 1567619669.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! and even if it doesn’t work out with that guy, boom you have talking points for the the next guy you meet with his shared interests/industry",
            "author": null,
            "id": "ey47cvb",
            "parent_id": "t1_ey445yv",
            "score": 23,
            "created_utc": 1566783807.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey5dnp8",
                    "parent_id": "t1_ey47cvb",
                    "score": 8,
                    "created_utc": 1566829027.0,
                    "replies": [
                        {
                            "body": "Exactly, I know all I know about the stock market because of all the intolerable 20 something finance bros i dated when I first moved to the city lol",
                            "author": null,
                            "id": "ey5ksvl",
                            "parent_id": "t1_ey5dnp8",
                            "score": 4,
                            "created_utc": 1566834093.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What does it mean to “see right through” a pleasant conversation?\n\nWhen a sales guy from some vendor is personable, remembers my kids names, and suggests I come to an event at a hockey game, I know he’s playing a role. But it’s also the role I expect him to play. And if he gets that stuff right he’s probably good at other parts of his job.",
            "author": "tra24602",
            "id": "ey512cy",
            "parent_id": "t1_ey475wv",
            "score": 21,
            "created_utc": 1566817896.0,
            "replies": []
        },
        {
            "body": "As it was once written by Coleridge, “that willing suspension of disbelief for the moment, which constitutes poetic faith.”",
            "author": "HMU2018",
            "id": "ey6qgxy",
            "parent_id": "t1_ey475wv",
            "score": 8,
            "created_utc": 1566861570.0,
            "replies": []
        },
        {
            "body": "Yeah, I’m sure that guys see right through my Bachelor’s degree in Classics. My ability to speak Ancient Greek is entirely an act.",
            "author": "sugar-magnolias",
            "id": "ey572jv",
            "parent_id": "t1_ey475wv",
            "score": 14,
            "created_utc": 1566823849.0,
            "replies": [
                {
                    "body": "Those may not be acts but your interest in those things might be.",
                    "author": null,
                    "id": "ey57ru4",
                    "parent_id": "t1_ey572jv",
                    "score": 2,
                    "created_utc": 1566824448.0,
                    "replies": [
                        {
                            "body": "I mean, if a potential sugar daddy only wants to talk about fast cars and basketball, then he and I probably won’t click. You’re totally right in the sense of: Why would I get involved in a long-term sugar relationship where I have to fake my way through every conversation? But I enjoy talking about history and fine art, so I am educated about those things. I like talking about them, and many POTs think that’s impressive/enjoy talking about those things also.",
                            "author": "sugar-magnolias",
                            "id": "ey58agv",
                            "parent_id": "t1_ey57ru4",
                            "score": 6,
                            "created_utc": 1566824876.0,
                            "replies": [
                                {
                                    "body": "Your interest in these areas will screen out 2/3 bullshitters.  Unless a guy *just* hit the lottery or exited an IPO (hasn’t learned how to spend money) no real SD declines discussing art and history.  Except if they are an engineer by training; then, well, you are dating an engineer.",
                                    "author": "FlexEconGuy",
                                    "id": "eyz7brm",
                                    "parent_id": "t1_ey58agv",
                                    "score": 4,
                                    "created_utc": 1567611233.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyzbhj4",
            "parent_id": "t1_eyz7w90",
            "score": 1,
            "created_utc": 1567613952.0,
            "replies": [
                {
                    "body": "Same reason you want to hit fashionable restaurants at 4pm.  It increases the likelihood of meeting guys who don’t need to be in an office.   \n\nAlso liked the previous advice on not overdoing it on jewelry and bags.  Wear a single piece of fine, minimalist jewelry, and keep the bag from screaming.   \n\nIn my eternal search to find a new husband for my ex-wife, I keep reminding her that wearing a parkinglot’s value of jewelry doesn’t exactly scream “I’m friendly and no drama”.",
                    "author": "FlexEconGuy",
                    "id": "eyzcu81",
                    "parent_id": "t1_eyzbhj4",
                    "score": 2,
                    "created_utc": 1567614826.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eyzduxh",
                            "parent_id": "t1_eyzcu81",
                            "score": 1,
                            "created_utc": 1567615498.0,
                            "replies": [
                                {
                                    "body": "You’d have to be divorced and have a penis to understand dumping liabilities on another man.  Alimony is just the beginning of it; the non-monetary issues are more annoying.   \n\nRegarding restaurants, just pick up your local society pages, see where BOLD FACE people are mentioned hanging out, then cruise the spots and look for the nice cars parked in front at 4pm.",
                                    "author": "FlexEconGuy",
                                    "id": "eyzjbls",
                                    "parent_id": "t1_eyzduxh",
                                    "score": 4,
                                    "created_utc": 1567619013.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">No 50 year old man on a date with a girl half his age is thinking “bet she wants me for my high energy and good looks!” They’re not stupid lol\n\nGirl, really?? Never underestimate delusion haha. \n\nHave you not seen the copious amount of old men on Tinder with their age range set down to 18 but 'No SB's or golddiggers!' in their profile/ paunchy, average guys who label themselves as handsome and athletic/ age set at 44 when that was clearly at least 10 years ago?\n\nThat's not to say that the brash approach is a wise one to take. Tact is key but being too coy and expecting he will know what's up because of an age and looks disparity can definitely lead a girl to waste her time on dates with someone who is hoping he's just hit the jackpot.\n\nThis post was a good read though :)",
            "author": "yourgirlfriday99",
            "id": "ey4j8s2",
            "parent_id": "t1_ey47s02",
            "score": 36,
            "created_utc": 1566794249.0,
            "replies": [
                {
                    "body": "That’s true, but those guys aren’t ever successful from what I’ve seen. Guys who can easily afford to have a SB, unless they’re exceptionally handsome or young, will likely be at least interested in the idea because it means dating hotter girls with less commitment. All the rich guys I’ve dated have had the mindset of “well, I hope you’re just a bit of a gold digger, because that means you’re smart, have high standards, and appreciate my wealth.” Broke guys hate girls who date wealthy guys because they feel entitled to them.",
                    "author": null,
                    "id": "ey4jld3",
                    "parent_id": "t1_ey4j8s2",
                    "score": 16,
                    "created_utc": 1566794611.0,
                    "replies": [
                        {
                            "body": "Well if we're specifically talking about the ones on dating sites then yes, I highly doubt they have much success! I was speaking more generally to general delusions and expectations. \n\nMy main point of disagreement is that just because a guy is significantly older does not mean that he will know what's up on a date with someone out of his physical league. Even for wealthy guys, a lot of their reservations are tied up in ego and 'paying for it' regardless of whether they can afford it, is a hill to get over. Showing you the 'finer things in life' could simply mean paying for dinner at nice places. Sugar shouldn't be assumed and any girl who thinks that dating an older, rich man will just naturally evolve into a SR or even a spoiled situation with gifts/ bills needs to prepare herself for disappointment. So little hints like your 'Oh so you're good at buying? That will come in handy with me' are crucial. I think your post is great but light on the conversion to sugar element which is where most girls will struggle.",
                            "author": "yourgirlfriday99",
                            "id": "ey4kcb9",
                            "parent_id": "t1_ey4jld3",
                            "score": 10,
                            "created_utc": 1566795400.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You aren’t targeting actual wealthy men.  All this SA sugar nonsense y’all talk will get you laughed away from the room in real life.",
                    "author": "FlexEconGuy",
                    "id": "eyz81bn",
                    "parent_id": "t1_ey4j8s2",
                    "score": 1,
                    "created_utc": 1567611696.0,
                    "replies": [
                        {
                            "body": "How do you presume to know who/ what I am targeting? I am simply describing the type of older men one encounters (and swipes left on) on Tinder and other dating sites. Extrapolating information about my personal experiences from that is a fool's exercise.",
                            "author": "yourgirlfriday99",
                            "id": "eyz85nj",
                            "parent_id": "t1_eyz81bn",
                            "score": 1,
                            "created_utc": 1567611775.0,
                            "replies": [
                                {
                                    "body": "I’m responding to what you wrote.  Your response verified my comment.",
                                    "author": "FlexEconGuy",
                                    "id": "eyz98ve",
                                    "parent_id": "t1_eyz85nj",
                                    "score": 1,
                                    "created_utc": 1567612492.0,
                                    "replies": [
                                        {
                                            "body": "Of course :)",
                                            "author": "yourgirlfriday99",
                                            "id": "eyz99w4",
                                            "parent_id": "t1_eyz98ve",
                                            "score": 1,
                                            "created_utc": 1567612511.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey5lqsj",
            "parent_id": "t1_ey4vksg",
            "score": 0,
            "created_utc": 1566834741.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ey6gz0w",
                    "parent_id": "t1_ey5lqsj",
                    "score": 2,
                    "created_utc": 1566855369.0,
                    "replies": [
                        {
                            "body": "i just meant in general, if I stood out enough to them. obviously, i would have to stand out a lot if they went to those lengths.",
                            "author": "TheOmegaWerewolf",
                            "id": "ey6p1pn",
                            "parent_id": "t1_ey6gz0w",
                            "score": 2,
                            "created_utc": 1566860678.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay, I'll have to check that IG out.\n\nAlso, if you do start a blog, will you put a link to it here too lol",
            "author": "TheOmegaWerewolf",
            "id": "ey47v00",
            "parent_id": "t1_ey47m6d",
            "score": 3,
            "created_utc": 1566784208.0,
            "replies": []
        },
        {
            "body": "Same. The more we put ourselves in those environments, the more we’ll learn. Look up school of affluence and Gloria Starr on YouTube. They’re amazing. They talk a lot about about fashion and Etiquette.",
            "author": "brownandsweet",
            "id": "ey48wmr",
            "parent_id": "t1_ey47we9",
            "score": 5,
            "created_utc": 1566785031.0,
            "replies": [
                {
                    "body": "I’ve heard of school of affluence but not Gloria Starr, thank you! I should brush up on my etiquette tips because a very successful finance is guy is taking me to a work party soon and unfortunately I have to repress the part of me that wants to get champagne drunk and ask everyone how much money they make 😩",
                    "author": null,
                    "id": "ey4am7r",
                    "parent_id": "t1_ey48wmr",
                    "score": 6,
                    "created_utc": 1566786424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was her body language. \n\nThe confidence. \nThe unflappable cool. \nIt always seemed that no matter the situation, even if she was the odd man out, she had what it takes to be there. \n\nIt may have been my overactive imagination but I took nothing but positives from it.",
            "author": "bsbdfw",
            "id": "ey5bz8i",
            "parent_id": "t1_ey51grr",
            "score": 3,
            "created_utc": 1566827767.0,
            "replies": []
        },
        {
            "body": "I used to get called high maintenance, still do. But, I grew up poor and lots of situations have probably humbled me to the point I just ain't got that attitude, confidence and stuff anymore. 😅 and I mean, living in a completely wrecked house for 11 months after Florence, I think I just realized I'm very lucky with what I have.\n\nBut man, if i could grab a man who got unlimited wealth. Lol! Fairy tale dreams. Gotta work it to have it.",
            "author": "AccursedHalo",
            "id": "ey5j397",
            "parent_id": "t1_ey5ilpd",
            "score": 3,
            "created_utc": 1566832920.0,
            "replies": [
                {
                    "body": "Girl that attitude and confidence can come back! Fake it til you make it, a year ago I lived in a closet sized bedroom with no windows and I was still going out to places I couldn’t afford strutting my stuff in $12 dresses lol",
                    "author": null,
                    "id": "ey5jask",
                    "parent_id": "t1_ey5j397",
                    "score": 6,
                    "created_utc": 1566833066.0,
                    "replies": [
                        {
                            "body": "Haha! Gives me hope! But I've never been good at faking anything. Probably why I failed so miserably in retail work. My facial expression speaks volumes! Probably another reason I'd never land a high class man. Oops!",
                            "author": "AccursedHalo",
                            "id": "ey5jk0a",
                            "parent_id": "t1_ey5jask",
                            "score": 1,
                            "created_utc": 1566833241.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not suggesting the SB, or potential SDs gets involved in any non-professional activities.\nI am suggesting that the right workplace is a great place to see the beast in his habitat.   For example, you meet doctors at hospitals....financial wizards live on Wall St. \nWe had a real hottie a few years back join my club waitstaff.  She could flirt with the best, and was a big reason why people started dining more.  She eventually got into a relationship with a member...which got her fired.   The word in the locker room was that the member relationship was much more lucrative than the tips she got serving ice teas.\nPlus...networking with that member introduced her to a ton of other wealthy folks.   Whether her goal was to meet rich men or not...that gig at the Club worked out nicely for her.",
            "author": "sdphilly",
            "id": "ey5qiyb",
            "parent_id": "t1_ey5ec79",
            "score": 1,
            "created_utc": 1566837988.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "aceshighsays",
            "id": "ey5o1z6",
            "parent_id": "t1_ey5dmd9",
            "score": 1,
            "created_utc": 1566836325.0,
            "replies": []
        },
        {
            "body": "Madame X? I can get that but its such a hit or miss crowd...",
            "author": "Yummy223",
            "id": "ey78sss",
            "parent_id": "t1_ey5dmd9",
            "score": 1,
            "created_utc": 1566875042.0,
            "replies": [
                {
                    "body": "Yeah I don’t really go there for the crowd, or go there much in general. I wasn’t there to freestyle it was just the place my friend wanted to meet",
                    "author": null,
                    "id": "ey8kj5t",
                    "parent_id": "t1_ey78sss",
                    "score": 2,
                    "created_utc": 1566922170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should be, I’m probably better looking than you.",
            "author": "FlexEconGuy",
            "id": "eyzkxd5",
            "parent_id": "t1_eyzjqwn",
            "score": 1,
            "created_utc": 1567620030.0,
            "replies": [
                {
                    "body": "Sure you are honey",
                    "author": null,
                    "id": "eyzljs4",
                    "parent_id": "t1_eyzkxd5",
                    "score": 2,
                    "created_utc": 1567620439.0,
                    "replies": [
                        {
                            "body": "The concept of not being the best looking person in the room is suddenly distracting.",
                            "author": "FlexEconGuy",
                            "id": "eyzlyri",
                            "parent_id": "t1_eyzljs4",
                            "score": 2,
                            "created_utc": 1567620715.0,
                            "replies": [
                                {
                                    "body": "I don’t wanna have to be the funny one 😢",
                                    "author": null,
                                    "id": "eyzm3eo",
                                    "parent_id": "t1_eyzlyri",
                                    "score": 1,
                                    "created_utc": 1567620801.0,
                                    "replies": [
                                        {
                                            "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
                                            "author": "FlexEconGuy",
                                            "id": "eyzndye",
                                            "parent_id": "t1_eyzm3eo",
                                            "score": 3,
                                            "created_utc": 1567621569.0,
                                            "replies": [
                                                {
                                                    "body": "I am! It’s the upside of being a walking nightmare",
                                                    "author": null,
                                                    "id": "ez0b8dq",
                                                    "parent_id": "t1_eyzndye",
                                                    "score": 2,
                                                    "created_utc": 1567634267.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey48lob",
            "parent_id": "t1_ey4807d",
            "score": 2,
            "created_utc": 1566784794.0,
            "replies": [
                {
                    "body": "Chatting yes.🙂 But there is no scent of a woman nearby lol.",
                    "author": "SDforreal",
                    "id": "ey4c2i8",
                    "parent_id": "t1_ey48lob",
                    "score": 7,
                    "created_utc": 1566787630.0,
                    "replies": [
                        {
                            "body": "True, and I smell gooood",
                            "author": null,
                            "id": "ey4fe00",
                            "parent_id": "t1_ey4c2i8",
                            "score": 6,
                            "created_utc": 1566790516.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey7iu8a",
            "parent_id": "t1_ey58ghi",
            "score": 0,
            "created_utc": 1566885131.0,
            "replies": []
        },
        {
            "body": "To be successful in the bowl with an age cap of 45?\n\nDamn. I need to move to NY.",
            "author": "bsbdfw",
            "id": "ey5eqa3",
            "parent_id": "t1_ey5d87h",
            "score": 2,
            "created_utc": 1566829806.0,
            "replies": [
                {
                    "body": "Lmao, my current SD is 33 and started giving me cash well before we ever slept together 😭 idk how this happened",
                    "author": null,
                    "id": "ey5ezx8",
                    "parent_id": "t1_ey5eqa3",
                    "score": 4,
                    "created_utc": 1566829999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think many of us are desperate, Sachs.",
            "author": null,
            "id": "ey5d9v5",
            "parent_id": "t1_ey4yjhj",
            "score": 9,
            "created_utc": 1566828740.0,
            "replies": [
                {
                    "body": "Well, desperate was an exaggeration. \n\nIf I really wanted actual desperation, I'd get a street hooker.",
                    "author": "InvestmentBanker19",
                    "id": "ey5djc7",
                    "parent_id": "t1_ey5d9v5",
                    "score": -3,
                    "created_utc": 1566828935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Eh it still feels too peacock-y for me, I’m a designer so the notebook works perfectly",
            "author": null,
            "id": "eyzjpl0",
            "parent_id": "t1_eyz6r7z",
            "score": 3,
            "created_utc": 1567619260.0,
            "replies": [
                {
                    "body": "I currently have two notebooks, a laptop, diary, and book on some religious cult in front of me at the sake bar.   #notprops ;)  \n\nGiven my tank top under a powder blue sports coat and jeans that perfectly match my NB, you might call me peacock-y.   I’m even rocking a lapel pin of some bird I just realized was upside down.   Thanks for making me notice.",
                    "author": "FlexEconGuy",
                    "id": "eyzkcpw",
                    "parent_id": "t1_eyzjpl0",
                    "score": 5,
                    "created_utc": 1567619669.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey5dnp8",
            "parent_id": "t1_ey47cvb",
            "score": 8,
            "created_utc": 1566829027.0,
            "replies": [
                {
                    "body": "Exactly, I know all I know about the stock market because of all the intolerable 20 something finance bros i dated when I first moved to the city lol",
                    "author": null,
                    "id": "ey5ksvl",
                    "parent_id": "t1_ey5dnp8",
                    "score": 4,
                    "created_utc": 1566834093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Those may not be acts but your interest in those things might be.",
            "author": null,
            "id": "ey57ru4",
            "parent_id": "t1_ey572jv",
            "score": 2,
            "created_utc": 1566824448.0,
            "replies": [
                {
                    "body": "I mean, if a potential sugar daddy only wants to talk about fast cars and basketball, then he and I probably won’t click. You’re totally right in the sense of: Why would I get involved in a long-term sugar relationship where I have to fake my way through every conversation? But I enjoy talking about history and fine art, so I am educated about those things. I like talking about them, and many POTs think that’s impressive/enjoy talking about those things also.",
                    "author": "sugar-magnolias",
                    "id": "ey58agv",
                    "parent_id": "t1_ey57ru4",
                    "score": 6,
                    "created_utc": 1566824876.0,
                    "replies": [
                        {
                            "body": "Your interest in these areas will screen out 2/3 bullshitters.  Unless a guy *just* hit the lottery or exited an IPO (hasn’t learned how to spend money) no real SD declines discussing art and history.  Except if they are an engineer by training; then, well, you are dating an engineer.",
                            "author": "FlexEconGuy",
                            "id": "eyz7brm",
                            "parent_id": "t1_ey58agv",
                            "score": 4,
                            "created_utc": 1567611233.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same reason you want to hit fashionable restaurants at 4pm.  It increases the likelihood of meeting guys who don’t need to be in an office.   \n\nAlso liked the previous advice on not overdoing it on jewelry and bags.  Wear a single piece of fine, minimalist jewelry, and keep the bag from screaming.   \n\nIn my eternal search to find a new husband for my ex-wife, I keep reminding her that wearing a parkinglot’s value of jewelry doesn’t exactly scream “I’m friendly and no drama”.",
            "author": "FlexEconGuy",
            "id": "eyzcu81",
            "parent_id": "t1_eyzbhj4",
            "score": 2,
            "created_utc": 1567614826.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eyzduxh",
                    "parent_id": "t1_eyzcu81",
                    "score": 1,
                    "created_utc": 1567615498.0,
                    "replies": [
                        {
                            "body": "You’d have to be divorced and have a penis to understand dumping liabilities on another man.  Alimony is just the beginning of it; the non-monetary issues are more annoying.   \n\nRegarding restaurants, just pick up your local society pages, see where BOLD FACE people are mentioned hanging out, then cruise the spots and look for the nice cars parked in front at 4pm.",
                            "author": "FlexEconGuy",
                            "id": "eyzjbls",
                            "parent_id": "t1_eyzduxh",
                            "score": 4,
                            "created_utc": 1567619013.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s true, but those guys aren’t ever successful from what I’ve seen. Guys who can easily afford to have a SB, unless they’re exceptionally handsome or young, will likely be at least interested in the idea because it means dating hotter girls with less commitment. All the rich guys I’ve dated have had the mindset of “well, I hope you’re just a bit of a gold digger, because that means you’re smart, have high standards, and appreciate my wealth.” Broke guys hate girls who date wealthy guys because they feel entitled to them.",
            "author": null,
            "id": "ey4jld3",
            "parent_id": "t1_ey4j8s2",
            "score": 16,
            "created_utc": 1566794611.0,
            "replies": [
                {
                    "body": "Well if we're specifically talking about the ones on dating sites then yes, I highly doubt they have much success! I was speaking more generally to general delusions and expectations. \n\nMy main point of disagreement is that just because a guy is significantly older does not mean that he will know what's up on a date with someone out of his physical league. Even for wealthy guys, a lot of their reservations are tied up in ego and 'paying for it' regardless of whether they can afford it, is a hill to get over. Showing you the 'finer things in life' could simply mean paying for dinner at nice places. Sugar shouldn't be assumed and any girl who thinks that dating an older, rich man will just naturally evolve into a SR or even a spoiled situation with gifts/ bills needs to prepare herself for disappointment. So little hints like your 'Oh so you're good at buying? That will come in handy with me' are crucial. I think your post is great but light on the conversion to sugar element which is where most girls will struggle.",
                    "author": "yourgirlfriday99",
                    "id": "ey4kcb9",
                    "parent_id": "t1_ey4jld3",
                    "score": 10,
                    "created_utc": 1566795400.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You aren’t targeting actual wealthy men.  All this SA sugar nonsense y’all talk will get you laughed away from the room in real life.",
            "author": "FlexEconGuy",
            "id": "eyz81bn",
            "parent_id": "t1_ey4j8s2",
            "score": 1,
            "created_utc": 1567611696.0,
            "replies": [
                {
                    "body": "How do you presume to know who/ what I am targeting? I am simply describing the type of older men one encounters (and swipes left on) on Tinder and other dating sites. Extrapolating information about my personal experiences from that is a fool's exercise.",
                    "author": "yourgirlfriday99",
                    "id": "eyz85nj",
                    "parent_id": "t1_eyz81bn",
                    "score": 1,
                    "created_utc": 1567611775.0,
                    "replies": [
                        {
                            "body": "I’m responding to what you wrote.  Your response verified my comment.",
                            "author": "FlexEconGuy",
                            "id": "eyz98ve",
                            "parent_id": "t1_eyz85nj",
                            "score": 1,
                            "created_utc": 1567612492.0,
                            "replies": [
                                {
                                    "body": "Of course :)",
                                    "author": "yourgirlfriday99",
                                    "id": "eyz99w4",
                                    "parent_id": "t1_eyz98ve",
                                    "score": 1,
                                    "created_utc": 1567612511.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ey6gz0w",
            "parent_id": "t1_ey5lqsj",
            "score": 2,
            "created_utc": 1566855369.0,
            "replies": [
                {
                    "body": "i just meant in general, if I stood out enough to them. obviously, i would have to stand out a lot if they went to those lengths.",
                    "author": "TheOmegaWerewolf",
                    "id": "ey6p1pn",
                    "parent_id": "t1_ey6gz0w",
                    "score": 2,
                    "created_utc": 1566860678.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve heard of school of affluence but not Gloria Starr, thank you! I should brush up on my etiquette tips because a very successful finance is guy is taking me to a work party soon and unfortunately I have to repress the part of me that wants to get champagne drunk and ask everyone how much money they make 😩",
            "author": null,
            "id": "ey4am7r",
            "parent_id": "t1_ey48wmr",
            "score": 6,
            "created_utc": 1566786424.0,
            "replies": []
        },
        {
            "body": "Girl that attitude and confidence can come back! Fake it til you make it, a year ago I lived in a closet sized bedroom with no windows and I was still going out to places I couldn’t afford strutting my stuff in $12 dresses lol",
            "author": null,
            "id": "ey5jask",
            "parent_id": "t1_ey5j397",
            "score": 6,
            "created_utc": 1566833066.0,
            "replies": [
                {
                    "body": "Haha! Gives me hope! But I've never been good at faking anything. Probably why I failed so miserably in retail work. My facial expression speaks volumes! Probably another reason I'd never land a high class man. Oops!",
                    "author": "AccursedHalo",
                    "id": "ey5jk0a",
                    "parent_id": "t1_ey5jask",
                    "score": 1,
                    "created_utc": 1566833241.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I don’t really go there for the crowd, or go there much in general. I wasn’t there to freestyle it was just the place my friend wanted to meet",
            "author": null,
            "id": "ey8kj5t",
            "parent_id": "t1_ey78sss",
            "score": 2,
            "created_utc": 1566922170.0,
            "replies": []
        },
        {
            "body": "Sure you are honey",
            "author": null,
            "id": "eyzljs4",
            "parent_id": "t1_eyzkxd5",
            "score": 2,
            "created_utc": 1567620439.0,
            "replies": [
                {
                    "body": "The concept of not being the best looking person in the room is suddenly distracting.",
                    "author": "FlexEconGuy",
                    "id": "eyzlyri",
                    "parent_id": "t1_eyzljs4",
                    "score": 2,
                    "created_utc": 1567620715.0,
                    "replies": [
                        {
                            "body": "I don’t wanna have to be the funny one 😢",
                            "author": null,
                            "id": "eyzm3eo",
                            "parent_id": "t1_eyzlyri",
                            "score": 1,
                            "created_utc": 1567620801.0,
                            "replies": [
                                {
                                    "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
                                    "author": "FlexEconGuy",
                                    "id": "eyzndye",
                                    "parent_id": "t1_eyzm3eo",
                                    "score": 3,
                                    "created_utc": 1567621569.0,
                                    "replies": [
                                        {
                                            "body": "I am! It’s the upside of being a walking nightmare",
                                            "author": null,
                                            "id": "ez0b8dq",
                                            "parent_id": "t1_eyzndye",
                                            "score": 2,
                                            "created_utc": 1567634267.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Chatting yes.🙂 But there is no scent of a woman nearby lol.",
            "author": "SDforreal",
            "id": "ey4c2i8",
            "parent_id": "t1_ey48lob",
            "score": 7,
            "created_utc": 1566787630.0,
            "replies": [
                {
                    "body": "True, and I smell gooood",
                    "author": null,
                    "id": "ey4fe00",
                    "parent_id": "t1_ey4c2i8",
                    "score": 6,
                    "created_utc": 1566790516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao, my current SD is 33 and started giving me cash well before we ever slept together 😭 idk how this happened",
            "author": null,
            "id": "ey5ezx8",
            "parent_id": "t1_ey5eqa3",
            "score": 4,
            "created_utc": 1566829999.0,
            "replies": []
        },
        {
            "body": "Well, desperate was an exaggeration. \n\nIf I really wanted actual desperation, I'd get a street hooker.",
            "author": "InvestmentBanker19",
            "id": "ey5djc7",
            "parent_id": "t1_ey5d9v5",
            "score": -3,
            "created_utc": 1566828935.0,
            "replies": []
        },
        {
            "body": "I currently have two notebooks, a laptop, diary, and book on some religious cult in front of me at the sake bar.   #notprops ;)  \n\nGiven my tank top under a powder blue sports coat and jeans that perfectly match my NB, you might call me peacock-y.   I’m even rocking a lapel pin of some bird I just realized was upside down.   Thanks for making me notice.",
            "author": "FlexEconGuy",
            "id": "eyzkcpw",
            "parent_id": "t1_eyzjpl0",
            "score": 5,
            "created_utc": 1567619669.0,
            "replies": []
        },
        {
            "body": "Exactly, I know all I know about the stock market because of all the intolerable 20 something finance bros i dated when I first moved to the city lol",
            "author": null,
            "id": "ey5ksvl",
            "parent_id": "t1_ey5dnp8",
            "score": 4,
            "created_utc": 1566834093.0,
            "replies": []
        },
        {
            "body": "I mean, if a potential sugar daddy only wants to talk about fast cars and basketball, then he and I probably won’t click. You’re totally right in the sense of: Why would I get involved in a long-term sugar relationship where I have to fake my way through every conversation? But I enjoy talking about history and fine art, so I am educated about those things. I like talking about them, and many POTs think that’s impressive/enjoy talking about those things also.",
            "author": "sugar-magnolias",
            "id": "ey58agv",
            "parent_id": "t1_ey57ru4",
            "score": 6,
            "created_utc": 1566824876.0,
            "replies": [
                {
                    "body": "Your interest in these areas will screen out 2/3 bullshitters.  Unless a guy *just* hit the lottery or exited an IPO (hasn’t learned how to spend money) no real SD declines discussing art and history.  Except if they are an engineer by training; then, well, you are dating an engineer.",
                    "author": "FlexEconGuy",
                    "id": "eyz7brm",
                    "parent_id": "t1_ey58agv",
                    "score": 4,
                    "created_utc": 1567611233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eyzduxh",
            "parent_id": "t1_eyzcu81",
            "score": 1,
            "created_utc": 1567615498.0,
            "replies": [
                {
                    "body": "You’d have to be divorced and have a penis to understand dumping liabilities on another man.  Alimony is just the beginning of it; the non-monetary issues are more annoying.   \n\nRegarding restaurants, just pick up your local society pages, see where BOLD FACE people are mentioned hanging out, then cruise the spots and look for the nice cars parked in front at 4pm.",
                    "author": "FlexEconGuy",
                    "id": "eyzjbls",
                    "parent_id": "t1_eyzduxh",
                    "score": 4,
                    "created_utc": 1567619013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well if we're specifically talking about the ones on dating sites then yes, I highly doubt they have much success! I was speaking more generally to general delusions and expectations. \n\nMy main point of disagreement is that just because a guy is significantly older does not mean that he will know what's up on a date with someone out of his physical league. Even for wealthy guys, a lot of their reservations are tied up in ego and 'paying for it' regardless of whether they can afford it, is a hill to get over. Showing you the 'finer things in life' could simply mean paying for dinner at nice places. Sugar shouldn't be assumed and any girl who thinks that dating an older, rich man will just naturally evolve into a SR or even a spoiled situation with gifts/ bills needs to prepare herself for disappointment. So little hints like your 'Oh so you're good at buying? That will come in handy with me' are crucial. I think your post is great but light on the conversion to sugar element which is where most girls will struggle.",
            "author": "yourgirlfriday99",
            "id": "ey4kcb9",
            "parent_id": "t1_ey4jld3",
            "score": 10,
            "created_utc": 1566795400.0,
            "replies": []
        },
        {
            "body": "How do you presume to know who/ what I am targeting? I am simply describing the type of older men one encounters (and swipes left on) on Tinder and other dating sites. Extrapolating information about my personal experiences from that is a fool's exercise.",
            "author": "yourgirlfriday99",
            "id": "eyz85nj",
            "parent_id": "t1_eyz81bn",
            "score": 1,
            "created_utc": 1567611775.0,
            "replies": [
                {
                    "body": "I’m responding to what you wrote.  Your response verified my comment.",
                    "author": "FlexEconGuy",
                    "id": "eyz98ve",
                    "parent_id": "t1_eyz85nj",
                    "score": 1,
                    "created_utc": 1567612492.0,
                    "replies": [
                        {
                            "body": "Of course :)",
                            "author": "yourgirlfriday99",
                            "id": "eyz99w4",
                            "parent_id": "t1_eyz98ve",
                            "score": 1,
                            "created_utc": 1567612511.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i just meant in general, if I stood out enough to them. obviously, i would have to stand out a lot if they went to those lengths.",
            "author": "TheOmegaWerewolf",
            "id": "ey6p1pn",
            "parent_id": "t1_ey6gz0w",
            "score": 2,
            "created_utc": 1566860678.0,
            "replies": []
        },
        {
            "body": "Haha! Gives me hope! But I've never been good at faking anything. Probably why I failed so miserably in retail work. My facial expression speaks volumes! Probably another reason I'd never land a high class man. Oops!",
            "author": "AccursedHalo",
            "id": "ey5jk0a",
            "parent_id": "t1_ey5jask",
            "score": 1,
            "created_utc": 1566833241.0,
            "replies": []
        },
        {
            "body": "The concept of not being the best looking person in the room is suddenly distracting.",
            "author": "FlexEconGuy",
            "id": "eyzlyri",
            "parent_id": "t1_eyzljs4",
            "score": 2,
            "created_utc": 1567620715.0,
            "replies": [
                {
                    "body": "I don’t wanna have to be the funny one 😢",
                    "author": null,
                    "id": "eyzm3eo",
                    "parent_id": "t1_eyzlyri",
                    "score": 1,
                    "created_utc": 1567620801.0,
                    "replies": [
                        {
                            "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
                            "author": "FlexEconGuy",
                            "id": "eyzndye",
                            "parent_id": "t1_eyzm3eo",
                            "score": 3,
                            "created_utc": 1567621569.0,
                            "replies": [
                                {
                                    "body": "I am! It’s the upside of being a walking nightmare",
                                    "author": null,
                                    "id": "ez0b8dq",
                                    "parent_id": "t1_eyzndye",
                                    "score": 2,
                                    "created_utc": 1567634267.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "True, and I smell gooood",
            "author": null,
            "id": "ey4fe00",
            "parent_id": "t1_ey4c2i8",
            "score": 6,
            "created_utc": 1566790516.0,
            "replies": []
        },
        {
            "body": "Your interest in these areas will screen out 2/3 bullshitters.  Unless a guy *just* hit the lottery or exited an IPO (hasn’t learned how to spend money) no real SD declines discussing art and history.  Except if they are an engineer by training; then, well, you are dating an engineer.",
            "author": "FlexEconGuy",
            "id": "eyz7brm",
            "parent_id": "t1_ey58agv",
            "score": 4,
            "created_utc": 1567611233.0,
            "replies": []
        },
        {
            "body": "You’d have to be divorced and have a penis to understand dumping liabilities on another man.  Alimony is just the beginning of it; the non-monetary issues are more annoying.   \n\nRegarding restaurants, just pick up your local society pages, see where BOLD FACE people are mentioned hanging out, then cruise the spots and look for the nice cars parked in front at 4pm.",
            "author": "FlexEconGuy",
            "id": "eyzjbls",
            "parent_id": "t1_eyzduxh",
            "score": 4,
            "created_utc": 1567619013.0,
            "replies": []
        },
        {
            "body": "I’m responding to what you wrote.  Your response verified my comment.",
            "author": "FlexEconGuy",
            "id": "eyz98ve",
            "parent_id": "t1_eyz85nj",
            "score": 1,
            "created_utc": 1567612492.0,
            "replies": [
                {
                    "body": "Of course :)",
                    "author": "yourgirlfriday99",
                    "id": "eyz99w4",
                    "parent_id": "t1_eyz98ve",
                    "score": 1,
                    "created_utc": 1567612511.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t wanna have to be the funny one 😢",
            "author": null,
            "id": "eyzm3eo",
            "parent_id": "t1_eyzlyri",
            "score": 1,
            "created_utc": 1567620801.0,
            "replies": [
                {
                    "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
                    "author": "FlexEconGuy",
                    "id": "eyzndye",
                    "parent_id": "t1_eyzm3eo",
                    "score": 3,
                    "created_utc": 1567621569.0,
                    "replies": [
                        {
                            "body": "I am! It’s the upside of being a walking nightmare",
                            "author": null,
                            "id": "ez0b8dq",
                            "parent_id": "t1_eyzndye",
                            "score": 2,
                            "created_utc": 1567634267.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course :)",
            "author": "yourgirlfriday99",
            "id": "eyz99w4",
            "parent_id": "t1_eyz98ve",
            "score": 1,
            "created_utc": 1567612511.0,
            "replies": []
        },
        {
            "body": ".... you can’t shut me up.   You legit sound highly entertaining.",
            "author": "FlexEconGuy",
            "id": "eyzndye",
            "parent_id": "t1_eyzm3eo",
            "score": 3,
            "created_utc": 1567621569.0,
            "replies": [
                {
                    "body": "I am! It’s the upside of being a walking nightmare",
                    "author": null,
                    "id": "ez0b8dq",
                    "parent_id": "t1_eyzndye",
                    "score": 2,
                    "created_utc": 1567634267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am! It’s the upside of being a walking nightmare",
            "author": null,
            "id": "ez0b8dq",
            "parent_id": "t1_eyzndye",
            "score": 2,
            "created_utc": 1567634267.0,
            "replies": []
        }
    ]
}