{
    "title": "RM's longevity is a miracle itself and something we should never take for granted",
    "post_id": "mzmdlh",
    "post_url": "https://www.reddit.com/r/runningman/comments/mzmdlh/rms_longevity_is_a_miracle_itself_and_something/",
    "author": "lzyan",
    "body": "Kinda inspired by Kwangsoo's announced departure.\n\nIt is pretty clear that Korean varieties normally don't have the longest and most stable runs. There were so many Korean varieties who faced cast changes due to scandals popping up within their members (AJH in NJTTW, NHC and Gil in IC, the whole cast after 1N2D S2)\n\nAnd even without scandals, millitary enlistments could ruin a shows whole dynamic if one of the members have to enlist. We are so lucky to have a young cast member which has actually enlisted early despite being the uncommon case within actors.\n\nTherefore, I feel like we don't appreciate enough that every single one of the members did not have any show-ending scandal for 11 years, thats a very uncommon phenomenon in Kvariety.\n\nEvery cast departure was an amicable one and had a presentable farewell unlike abrupt ones (leading to scenes being cut) which were caused by scandals.\n\nPlus, the fact that the show was literally sentenced to cancellation, uncancelled, saved by good PDs and continuing till now with most of the cast intact is probably a FIRST in such a competitive industry.\n\nWe are honestly blessed to still be able to watch RM now and I feel like we don't realize that enough.",
    "url": "https://www.reddit.com/r/runningman/comments/mzmdlh/rms_longevity_is_a_miracle_itself_and_something/",
    "score": 397,
    "upvote_ratio": 0.99,
    "created_utc": 1619523071.0,
    "num_comments": 14,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Yeah that's true. Sometimes I just accept it as part of my life and that I'd be able to see the show forever. Recently though (especially after today) I realize that the show has been going on for 11 years and with the members quite aging now we're probably in the last few years of the show. After today's news I cant help but feel even more so like that. Going to be grateful for every single episode from here on out",
            "author": "fallin_light09",
            "id": "gw1r0bz",
            "parent_id": "t3_mzmdlh",
            "score": 59,
            "created_utc": 1619530384.0,
            "replies": [
                {
                    "body": "For 11 years I had something to look forward to on Sundays I can't imagine my Sundays without RM.....",
                    "author": "Geones",
                    "id": "gw49isd",
                    "parent_id": "t1_gw1r0bz",
                    "score": 8,
                    "created_utc": 1619570590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been thinking the same thing. I was so sad to see the news of his departure as I am brand new to RM, but then I realized there are over *five hundred* episodes for me to go through. I haven’t even scratched the surface of that. The fact that ANY of them have been going this long, and in such a rigorous fashion, is an absolutely incredible testament to their commitment. Things don’t last this long. They just don’t. This show has already broken all the rules. It’s sad that he’s leaving of course, but we should be blown away that it’s lasted this long at all.",
            "author": "IambicRhys",
            "id": "gw1vvuu",
            "parent_id": "t3_mzmdlh",
            "score": 29,
            "created_utc": 1619532711.0,
            "replies": [
                {
                    "body": "I don't have all the time in the world to watch RM, so I get maybe 1-3 episodes a week. It's taken me 1.5 years to watch to episode 226. It's sad knowing Gary and Kwang Soo eventually leave, but I'm taking my time and enjoying the heck out of all the episodes until then.",
                    "author": "Hijacks",
                    "id": "gw3yq9i",
                    "parent_id": "t1_gw1vvuu",
                    "score": 8,
                    "created_utc": 1619565172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The injury took a toll on LKS, he tried his best but I can understand. I feel so respect for other members who are doing it for years with fatigue and they are not young either. \n\nSomewhere I hope it just a long break and someday LKS comes back. But for now there are only buckets of tears",
            "author": "Tnr2D",
            "id": "gw22a50",
            "parent_id": "t3_mzmdlh",
            "score": 27,
            "created_utc": 1619535499.0,
            "replies": []
        },
        {
            "body": "When Running Man ends - it's going to leave behind an unbelievable legacy.\n\nThe longevity of the show itself is insane.",
            "author": "kbx24",
            "id": "gw2z7x9",
            "parent_id": "t3_mzmdlh",
            "score": 16,
            "created_utc": 1619549374.0,
            "replies": []
        },
        {
            "body": " I'd like to believe that it was more of Kwang Soo wanting to shake off  that image of his Running Man character than his injury. If it was about  that injury, he could just take an indefinite hiatus to recuperate and come  back whenever he's ready. We have to remember that Kwang Soo is first  and foremost a television drama actor. But due to his character on  Running Man, people tend to see him as a comedian and that hurts his  prospects for his acting career.",
            "author": "Tidus3960",
            "id": "gw2yvpe",
            "parent_id": "t3_mzmdlh",
            "score": 16,
            "created_utc": 1619549231.0,
            "replies": [
                {
                    "body": "I kinda agree...I mean car accident injuries are no joke, but in general still should be recoverable. Also RM has been changing the format to be less physical for quite awhile now and the standard generally has dropped either. Also I believe KJK's back injury is potentially even more severe than that but yet he still managed to continue. I think this was just the right chance for him to bow out without kicking up too much drama",
                    "author": "Klubeht",
                    "id": "gwigfbo",
                    "parent_id": "t1_gw2yvpe",
                    "score": 2,
                    "created_utc": 1619846832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I followed RM after episode 39 after being a fan of X-Man and Family Outing. With how Family Outing went out and how ratings were low in the beginning of RM, I never thought I would still be watching this show today, and I was just grateful every single week because it hadn't been canceled despite the ratings. When Song Joongki left, I admit, I had some anger because I felt he was bailing out due to the show's rankings. But the bond between this cast is just so different, which initially made Family Outing different on its own as well. But unlike FO, RM are actually friends who hang out and talk outside the show. I never felt that way with some of the cast in FO. \n\nI think RM is really special. It was the ignored underdog but has now become a global phenomenon. Online, I get angry about toxic fans, but I did go to RM's first fan meeting in HK in 2013, and the feeling it was to be amongst the fans and cheering on the cast... it was magic.",
            "author": "Edenelle",
            "id": "gx9w6k4",
            "parent_id": "t3_mzmdlh",
            "score": 4,
            "created_utc": 1620396244.0,
            "replies": []
        },
        {
            "body": "I don't know if this show will become like 1N2D and still be airing a decade later with a completely different cast nor am I sure if I would still be watching it if that is the case.",
            "author": "chromelogan",
            "id": "gw51b0v",
            "parent_id": "t3_mzmdlh",
            "score": 1,
            "created_utc": 1619586247.0,
            "replies": [
                {
                    "body": "I would still be okay with that, but replacing YJS would be the hardest part of it.. :')",
                    "author": "linuxisme",
                    "id": "gwe3b51",
                    "parent_id": "t1_gw51b0v",
                    "score": 5,
                    "created_utc": 1619759530.0,
                    "replies": [
                        {
                            "body": "YJS leaving would ultimately be the end of RM.",
                            "author": "Edenelle",
                            "id": "gx9v9b0",
                            "parent_id": "t1_gwe3b51",
                            "score": 3,
                            "created_utc": 1620395819.0,
                            "replies": [
                                {
                                    "body": "Indeed.. :(",
                                    "author": "linuxisme",
                                    "id": "gxdobai",
                                    "parent_id": "t1_gx9v9b0",
                                    "score": 1,
                                    "created_utc": 1620475479.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For 11 years I had something to look forward to on Sundays I can't imagine my Sundays without RM.....",
            "author": "Geones",
            "id": "gw49isd",
            "parent_id": "t1_gw1r0bz",
            "score": 8,
            "created_utc": 1619570590.0,
            "replies": []
        },
        {
            "body": "I don't have all the time in the world to watch RM, so I get maybe 1-3 episodes a week. It's taken me 1.5 years to watch to episode 226. It's sad knowing Gary and Kwang Soo eventually leave, but I'm taking my time and enjoying the heck out of all the episodes until then.",
            "author": "Hijacks",
            "id": "gw3yq9i",
            "parent_id": "t1_gw1vvuu",
            "score": 8,
            "created_utc": 1619565172.0,
            "replies": []
        },
        {
            "body": "I kinda agree...I mean car accident injuries are no joke, but in general still should be recoverable. Also RM has been changing the format to be less physical for quite awhile now and the standard generally has dropped either. Also I believe KJK's back injury is potentially even more severe than that but yet he still managed to continue. I think this was just the right chance for him to bow out without kicking up too much drama",
            "author": "Klubeht",
            "id": "gwigfbo",
            "parent_id": "t1_gw2yvpe",
            "score": 2,
            "created_utc": 1619846832.0,
            "replies": []
        },
        {
            "body": "I would still be okay with that, but replacing YJS would be the hardest part of it.. :')",
            "author": "linuxisme",
            "id": "gwe3b51",
            "parent_id": "t1_gw51b0v",
            "score": 5,
            "created_utc": 1619759530.0,
            "replies": [
                {
                    "body": "YJS leaving would ultimately be the end of RM.",
                    "author": "Edenelle",
                    "id": "gx9v9b0",
                    "parent_id": "t1_gwe3b51",
                    "score": 3,
                    "created_utc": 1620395819.0,
                    "replies": [
                        {
                            "body": "Indeed.. :(",
                            "author": "linuxisme",
                            "id": "gxdobai",
                            "parent_id": "t1_gx9v9b0",
                            "score": 1,
                            "created_utc": 1620475479.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "YJS leaving would ultimately be the end of RM.",
            "author": "Edenelle",
            "id": "gx9v9b0",
            "parent_id": "t1_gwe3b51",
            "score": 3,
            "created_utc": 1620395819.0,
            "replies": [
                {
                    "body": "Indeed.. :(",
                    "author": "linuxisme",
                    "id": "gxdobai",
                    "parent_id": "t1_gx9v9b0",
                    "score": 1,
                    "created_utc": 1620475479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Indeed.. :(",
            "author": "linuxisme",
            "id": "gxdobai",
            "parent_id": "t1_gx9v9b0",
            "score": 1,
            "created_utc": 1620475479.0,
            "replies": []
        }
    ]
}