{
    "title": "The best and worse week of my life",
    "post_id": "hpfc9l",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hpfc9l/the_best_and_worse_week_of_my_life/",
    "author": "youngerwomanlove",
    "body": "I have posted on here twice before. The first time in December how to end my 4 year relationship. The second time in February how we came back into each others lives after being apart for 3 months. \n\nIn mid March the virus shut down hit. She was going to have three weeks off school. She had been working for me remotely while she was in school. I had always told her she would be a great fit in my profession instead of being a nurse. For those three weeks we worked together daily with me training her. We enjoyed the time together and she said that she was ready to change and enter my profession.\n\nAfter her semester ended she enrolled for school for four weeks to enter my profession.  I paid for her school and paid her while she took her classes. She aced them and received her license the end of June. Working together we became closer to each other after four years being in each others lives.\n\nLast Wednesday we were working and talked about her lease being up on her apartment. I told her it would be easier if she lived closer to work.  She replied how close. I told her that  she could always live with me. We talked about it and she decided that she would move in the end of July. I was over the moon happy and so was she. We were going to make the huge step about living together. \n\nLast Thursday she worked half a day and left to go see family for the weekend. I had hurt my ribs the week before and decided to get them checked out. They did chest x rays and came back in. They told me the good news was that your ribs aren't cracked. The bad news it was saw several spots in your right lung. After a Ct scan they informed me that they found four spots in my lung that showed that had started in another part of my body. I had survived cancer three years ago and she was there for me. \n\nIt was the hardest thing in my life of knowing I had to tell her that my cancer had come back. Monday we went out and worked in the morning. When we came back to my house for lunch I pulled her close to me. Held her in my arms and told her what I had found out. She collapsed into my arm. We cried, kissed and held each other like we never had before. \n\nI told her that she could change her mind and not move in. I am going to be sicker this time and my treatments will be longer. I told her that I didn't want her to see me sick. She replied that it wasn't my decision. We were going to fight this together. \n\nMovers are at her house now and her friends are packing her up. She will be moving in today. \n\nLife doesn't seem fair, right or easy. We were planning on spending our lives together not her being here when I battle for my life.\n\nHuge and kiss the person you love and care about. Reach out and tell them how you feel. Tomorrow is never guaranteed . If this is my last battle I am lucky that the woman that I love and she loves me we will be together through this battle. Wish us luck.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hpfc9l/the_best_and_worse_week_of_my_life/",
    "score": 160,
    "upvote_ratio": 0.98,
    "created_utc": 1594493293.0,
    "num_comments": 20,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Pulling for you.  This must be hard.  Good luck.",
            "author": "MrBuzzard",
            "id": "fxq3f1b",
            "parent_id": "t3_hpfc9l",
            "score": 21,
            "created_utc": 1594493408.0,
            "replies": []
        },
        {
            "body": "Fuck cancer. Sounds like now you have a great reason to fight hard and beat it back again. Pulling for you.",
            "author": "Cledaddy23",
            "id": "fxqe7b0",
            "parent_id": "t3_hpfc9l",
            "score": 20,
            "created_utc": 1594495872.0,
            "replies": []
        },
        {
            "body": "Yours is a remarkable story.  I understand- best and worst weeks.  Thanks for sharing your story on this sub over the past eight months.  Love is such a wonderful thing.  Death is guaranteed; love is not.",
            "author": "TY2022",
            "id": "fxqce66",
            "parent_id": "t3_hpfc9l",
            "score": 11,
            "created_utc": 1594495493.0,
            "replies": []
        },
        {
            "body": "I wish the best for you and your woman. You seem to be like the best SD to her and now is her time to take care of you. Best of luck x",
            "author": null,
            "id": "fxqg4tj",
            "parent_id": "t3_hpfc9l",
            "score": 10,
            "created_utc": 1594496504.0,
            "replies": []
        },
        {
            "body": "Stay positive & be strong! Sounds like you have a good support system. If it’s not advance you have a good chance of a fight (:",
            "author": null,
            "id": "fxqi5x4",
            "parent_id": "t3_hpfc9l",
            "score": 3,
            "created_utc": 1594497067.0,
            "replies": []
        },
        {
            "body": "Going thru cancer RN. Might I suggest some sort of legality to the relationship so she can visit in hospitals/help make medical decisions if you get to a certain point?  Is providing for her in the will something to think about?",
            "author": "saxonny78",
            "id": "fxs6spt",
            "parent_id": "t3_hpfc9l",
            "score": 3,
            "created_utc": 1594517932.0,
            "replies": [
                {
                    "body": "I am in process of doing my will. I put her on my accounts. We have been worried about her being able to see me in the hospital. What legal way can we make that happen?\nThanks for your help",
                    "author": "youngerwomanlove",
                    "id": "fxs78v3",
                    "parent_id": "t1_fxs6spt",
                    "score": 1,
                    "created_utc": 1594518193.0,
                    "replies": [
                        {
                            "body": "In the US at least... You'll want a DPOA.   [https://www.nolo.com/legal-encyclopedia/durable-power-of-attorney-health-finances-29579.html](https://www.nolo.com/legal-encyclopedia/durable-power-of-attorney-health-finances-29579.html)",
                            "author": "sharksfanthrowaway",
                            "id": "fxta2h1",
                            "parent_id": "t1_fxs78v3",
                            "score": 1,
                            "created_utc": 1594543709.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am in tears reading this!!!!! This hits home for me personally. Hugs and healing vibes to you both!!!!!",
            "author": "Layla_Fox2",
            "id": "fxqr09q",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594499024.0,
            "replies": []
        },
        {
            "body": "Prayers up buddy. You guys are clearly great together.",
            "author": "InveSDor",
            "id": "fxqwkwk",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594500393.0,
            "replies": []
        },
        {
            "body": "Make me cry. Wish you best of luck OP xxx",
            "author": "Pollydolly75",
            "id": "fxr1xoc",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594501678.0,
            "replies": []
        },
        {
            "body": "My heart! 😭 Sounds like the two of you have something very beautiful.",
            "author": "ImaginaryBullfrog5",
            "id": "fxrduts",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594504563.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing this.  Sometimes we take things for granted and she is what I call a ride or die!",
            "author": "markymark-1863",
            "id": "fxreipr",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594504731.0,
            "replies": []
        },
        {
            "body": "May God bless you with good health as a cancer survivor myself I wish you the best of luck",
            "author": "shamloo77",
            "id": "fxrgror",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594505396.0,
            "replies": []
        },
        {
            "body": "So sorry to hear but you are very lucky to have her. I'm sure you will beat the cancer again!",
            "author": "zsum555",
            "id": "fxrvaku",
            "parent_id": "t3_hpfc9l",
            "score": 2,
            "created_utc": 1594511554.0,
            "replies": []
        },
        {
            "body": "I am so happy you have a wonderful partner to be there to help you fight this together.  Cancer sucks!!! No one wants you here, Cancer, quit crashing parties!!",
            "author": "kimchi_Queen",
            "id": "fxqt3i2",
            "parent_id": "t3_hpfc9l",
            "score": 1,
            "created_utc": 1594499585.0,
            "replies": []
        },
        {
            "body": "This literally sent chills throughout my whole body.  Sorry to hear that the cancer has returned but I'm glad you have a class woman at your side to see you through this.  Giver her a big hug for me and have her give you a big hug for me.  Fight hard and don't give up hope!",
            "author": "EMPOWER_not_enable",
            "id": "fxrihy9",
            "parent_id": "t3_hpfc9l",
            "score": 1,
            "created_utc": 1594506248.0,
            "replies": []
        },
        {
            "body": "Don't give up!  It sounds like you have an awful lot to live for!",
            "author": "CrinkleCut789",
            "id": "fxs67jq",
            "parent_id": "t3_hpfc9l",
            "score": 1,
            "created_utc": 1594517599.0,
            "replies": []
        },
        {
            "body": "Sorry to hear the bad news but you got this and a special woman to be with!!!!! The heart is the strongest muscle in the body when combined with your will to fight!!!!\n\nDid you hear about the restaurant on the moon? It has great food but no atmosphere!!! \n\nLaughter is the best medicine!!!! :) Get some!!!!",
            "author": "NOVALDS",
            "id": "fxw8u12",
            "parent_id": "t3_hpfc9l",
            "score": 1,
            "created_utc": 1594611097.0,
            "replies": []
        },
        {
            "body": "No one gets out alive! You have a reason to fight. Your not alone you have each other. What’s unfair you meet the love of your life! Late in life. Don’t give up, never give up. You owe yourself and her that. I feel you bro",
            "author": "SD4u21",
            "id": "fxwnl2u",
            "parent_id": "t3_hpfc9l",
            "score": 1,
            "created_utc": 1594622827.0,
            "replies": []
        },
        {
            "body": "I am in process of doing my will. I put her on my accounts. We have been worried about her being able to see me in the hospital. What legal way can we make that happen?\nThanks for your help",
            "author": "youngerwomanlove",
            "id": "fxs78v3",
            "parent_id": "t1_fxs6spt",
            "score": 1,
            "created_utc": 1594518193.0,
            "replies": [
                {
                    "body": "In the US at least... You'll want a DPOA.   [https://www.nolo.com/legal-encyclopedia/durable-power-of-attorney-health-finances-29579.html](https://www.nolo.com/legal-encyclopedia/durable-power-of-attorney-health-finances-29579.html)",
                    "author": "sharksfanthrowaway",
                    "id": "fxta2h1",
                    "parent_id": "t1_fxs78v3",
                    "score": 1,
                    "created_utc": 1594543709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the US at least... You'll want a DPOA.   [https://www.nolo.com/legal-encyclopedia/durable-power-of-attorney-health-finances-29579.html](https://www.nolo.com/legal-encyclopedia/durable-power-of-attorney-health-finances-29579.html)",
            "author": "sharksfanthrowaway",
            "id": "fxta2h1",
            "parent_id": "t1_fxs78v3",
            "score": 1,
            "created_utc": 1594543709.0,
            "replies": []
        }
    ]
}