{
    "title": "An Absolute Beginner's Guide to Hair",
    "post_id": "3jyo62",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/3jyo62/an_absolute_beginners_guide_to_hair/",
    "author": null,
    "body": "#Welcome to MHA!\n\nHello and welcome! I'm /u/CaptainCannibal, a relatively new moderator here hoping to improve MHA after hanging around it for so long. Today I'll be writing a quick guide that is meant to be short, simple, and easy to follow. This is meant for newcomers who are really not sure what they want to do with their hair and have not spent a lot of time being concerned with it in the past.\n\nThis guide is under construction. Suggestions and feedback are appreciated. Please keep in mind this guide is for total beginners who just stumbled across this sub and are wondering \"should I be caring about my hair?\"\n\n#So uh.. why?\n\nMany men aren't that concerned about their hair and most men aren't concerned about it until they're in their 20's or so. Growing up, you've probably not been told a whole lot about your hair or what to do with it. A lot of dudes end up looking like [this](http://www.fashionfemale.net/wp-content/uploads/2013/10/Blonde-Highlights-in-Brown-Hair-Men.jpg) or [this](https://4.bp.blogspot.com/_-q8lIbt5XB0/TJ6vGPITZcI/AAAAAAAAAL4/Qkyx6HXXEdM/s400/byron-hairdressing1.jpg) or maybe [this](http://coolmenshairstyles.com/images/2010/09/tapered-haircut.jpg). Sure, these dudes aren't ugly by any means but any man isn't reaching his full potential if he doesn't have a hairstyle that suits him.\n\nIf you still aren't sure that your hair is an enormous part of your appearance, just check out [these awesome MHA user transformations](http://imgur.com/a/X0QO9)!\n\n#Where do I start?\n\nYou start with **the haircut**. You can have all the products in the world but it isn't going to make a difference if you've got some sort of mop plopped on your head.\n\nThere are many cuts out there but it can be difficult finding a good variety. The best way to find haircuts is to check out an **inspo album**. Inspo is short in the fashion and hair communities for \"inspiration\". These albums, in the context of MHA, are full of dudes with really nice haircuts. [Here](https://imgur.com/a/D8bLM) is a quick inspo album I put together for newcomers. You can find another one at the bottom of this guide.\n\nWhen you find something you like, **take the damn picture to your barber/stylist**. Trust me. No amount of you describing the cut to them will get you close to what you're actually wanting. A lot of people are intimidated by this but *so many people* take pictures in. It is completely normal to a stylist to be given a picture and told \"I really like this cut, can we do this?\" It makes life easier for the stylist and it makes you less nervous about them giving you something you don't want.\n\nTo reiterate, the answer to \"how do I get this cut?\" is **TAKE THE PICTURE TO YOUR STYLIST**. If you come here and ask what to tell your stylist to do in order to get a certain cut, the answer will be **SHOW THEM THE PICTURE YOU JUST SHOWED US**.\n\n#Well I got home and it doesn't look anything like it did when they styled it at the shop\n\nThis is because they likely used a product or two and maybe a blow dryer. Do you own a blow dryer? Does your wife, girlfriend, sister, mom, etc. own a blow dryer? If so, use one. A blow dryer is an incredibly valuable tool for those who like to style their hair. When your hair is wet it is malleable and as it dries it will be more likely to stay in whatever shape it dries in to. With a blow dryer and a brush (or your hands!) you can easily manipulate that drying process to do whatever you want. Whether that be to flatten your hair, blow the front back, spike up the top, etc. [Here](https://www.reddit.com/r/malehairadvice/comments/32d4eq/finally_invested_in_a_blow_dryer_check_out_the/) is a great example of why it is worth buying one. There is also a great guide to adding volume [right here](https://www.reddit.com/r/malehairadvice/comments/3d5est/is_your_hair_lacking_volume/) that talks more about blow drying.\n\nSo once you have your hair dry, you're likely going to want to add some products. I'm sure you know what hair products are generally, but there are a lot of different types that do different things despite looking similar. We'll go over a few popular types real quick:\n\n- **Pomade**  \nStrong but pliable hold. Your hair won't fall in to your face all day long but you can easily tossle it around. Also makes your hair shinier. Great for slicked-back looks.\n\n- **Clay**  \nA light product with strong hold. Tends to help with volume if you're looking for it since it won't weigh your hair down. Adds little to no shine. \n\n- **Gel**  \nRidiculously strong hold. Adds a ton of shine. Most men are already familiar with hair gel - most people would recommend you stop being familiar with it. The only thing it is still good for is spiking.\n\n- **Wax**  \nWaxes can be a lot of things, but the usual wax tends to be similar to pomade with a little less hold and a little less shine. \n\nThose are just some common ones you will or have already come across. It is recommended to experiment a little and see what you like best. You can also ask your stylist as they can assist you in finding something that works for your hair if you really aren't sure. Plus they'll probably jump at the chance to sell you some of the products they stock.\n\n#Conclusion\n\nFinding a hair style that suits you is really important. It can definitely be a daunting task to take a chance and totally change a major feature like that, but it is so worth it in the end. \n\nIf you have any questions you can feel free to post them here, on the subreddit, or in one of the daily threads that are posted for specific topics. We will be happy to help you.\n\nIf you are interested enough that you'd like to learn more about specific hair-related topics, just check out some guides below or on the sidebar to the right.\n\nAnd as a final little piece of advice, I would *highly* recommend that each and every person reading this right now check out this video: [\"Good Hair Doesn't Come From A Jar\"](https://www.youtube.com/watch?v=aFb_Ggh89S4). In just a few minutes you will learn more about styling than any of your friends have probably learned in their entire lives.\n\nThanks for stopping by!\n\n#More resources\n\n- [Good Hair Doesn't Come From A Jar](https://www.youtube.com/watch?v=aFb_Ggh89S4)\n\n- [Finding a haircut based on your facial shape](https://www.reddit.com/r/malehairadvice/comments/1uxrbv/guide_to_faceshapes_and_what_cuts_compliments/)\n\n- [Guide to product types](http://www.misterpompadour.com/blogs/hair/17216789-paste-pomade-and-clay-whats-the-difference)\n\n- [More info on product types](https://www.reddit.com/r/malehairadvice/comments/1kwgwr/someone_suggested_i_post_this_here_an_overview_of/)\n\n- [Applying products: Cocktailing and layering](https://www.reddit.com/r/malehairadvice/comments/yf85q/the_thorough_guide_to_hairstyling_part_3_applying/)\n\n- [Adding volume](https://www.reddit.com/r/malehairadvice/comments/3d5est/is_your_hair_lacking_volume/)\n\n- [Some lessons for getting your hair cut](https://www.reddit.com/r/malehairadvice/comments/38ohhx/some_lessons_for_men_getting_their_hair_cut/)\n\n- [How to talk to your barber](https://www.reddit.com/r/malehairadvice/comments/34roov/how_to_talk_to_your_barber/)\n\n- [Great inspo album](https://www.reddit.com/r/malehairadvice/comments/3a0vor/not_sure_if_this_something_you_guys_wanted_on/)\n\n- [Guide to popular styles](https://www.reddit.com/r/malehairadvice/comments/31uuta/mens_hairstyles_a_simple_guide_to_popular_and/)\n\n- [Product flowchart](https://www.reddit.com/r/malehairadvice/comments/3fkp8m/this_chart_tells_you_what_hair_product_to_use/)",
    "url": "https://www.reddit.com/r/malehairadvice/comments/3jyo62/an_absolute_beginners_guide_to_hair/",
    "score": 718,
    "upvote_ratio": 0.97,
    "created_utc": 1441626125.0,
    "num_comments": 63,
    "links": [
        [
            "/u/CaptainCannibal",
            "http://www.fashionfemale.net/wp-content/uploads/2013/10/Blonde-Highlights-in-Brown-Hair-Men.jpg",
            "https://4.bp.blogspot.com/_-q8lIbt5XB0/TJ6vGPITZcI/AAAAAAAAAL4/Qkyx6HXXEdM/s400/byron-hairdressing1.jpg",
            "http://coolmenshairstyles.com/images/2010/09/tapered-haircut.jpg",
            "http://imgur.com/a/X0QO9",
            "https://imgur.com/a/D8bLM",
            "https://www.reddit.com/r/malehairadvice/comments/32d4eq/finally_invested_in_a_blow_dryer_check_out_the/",
            "https://www.reddit.com/r/malehairadvice/comments/3d5est/is_your_hair_lacking_volume/",
            "https://www.youtube.com/watch?v=aFb_Ggh89S4",
            "https://www.youtube.com/watch?v=aFb_Ggh89S4",
            "https://www.reddit.com/r/malehairadvice/comments/1uxrbv/guide_to_faceshapes_and_what_cuts_compliments/",
            "http://www.misterpompadour.com/blogs/hair/17216789-paste-pomade-and-clay-whats-the-difference",
            "https://www.reddit.com/r/malehairadvice/comments/1kwgwr/someone_suggested_i_post_this_here_an_overview_of/",
            "https://www.reddit.com/r/malehairadvice/comments/yf85q/the_thorough_guide_to_hairstyling_part_3_applying/",
            "https://www.reddit.com/r/malehairadvice/comments/3d5est/is_your_hair_lacking_volume/",
            "https://www.reddit.com/r/malehairadvice/comments/38ohhx/some_lessons_for_men_getting_their_hair_cut/",
            "https://www.reddit.com/r/malehairadvice/comments/34roov/how_to_talk_to_your_barber/",
            "https://www.reddit.com/r/malehairadvice/comments/3a0vor/not_sure_if_this_something_you_guys_wanted_on/",
            "https://www.reddit.com/r/malehairadvice/comments/31uuta/mens_hairstyles_a_simple_guide_to_popular_and/",
            "https://www.reddit.com/r/malehairadvice/comments/3fkp8m/this_chart_tells_you_what_hair_product_to_use/"
        ]
    ],
    "comments": [
        {
            "body": "Anything like this for those of us with shoulder-length hair? \n/r/fierceflow and /r/majesticmanes feel more like circle jerks of people posting their own hair rather than forums of discussion with guides and such. ",
            "author": null,
            "id": "cutfll3",
            "parent_id": "t3_3jyo62",
            "score": 64,
            "created_utc": 1441634577.0,
            "replies": [
                {
                    "body": "Just post it here. Be the change you want to see in the subreddit.",
                    "author": null,
                    "id": "cutkawt",
                    "parent_id": "t1_cutfll3",
                    "score": 45,
                    "created_utc": 1441644265.0,
                    "replies": [
                        {
                            "body": "I'm inspired",
                            "author": "ResilientFellow",
                            "id": "cvn9xco",
                            "parent_id": "t1_cutkawt",
                            "score": 21,
                            "created_utc": 1443917500.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Coconut oil. DO NOT WASH EVERY DAY. Sulfate free shampoo. Boar bristle brush. What else you wanna know?",
                    "author": null,
                    "id": "cutlg19",
                    "parent_id": "t1_cutfll3",
                    "score": 11,
                    "created_utc": 1441646370.0,
                    "replies": [
                        {
                            "body": "what's the coconut oil + not washing do? and the brush? ",
                            "author": "sageDieu",
                            "id": "cv8p3t0",
                            "parent_id": "t1_cutlg19",
                            "score": 3,
                            "created_utc": 1442807750.0,
                            "replies": [
                                {
                                    "body": "Shampoo can actually be detrimental to your scalp's (and in turn your hair's) health. Coconut oil helps keep your scalp and hair healthy.",
                                    "author": "moostream",
                                    "id": "cvmx5fy",
                                    "parent_id": "t1_cv8p3t0",
                                    "score": 3,
                                    "created_utc": 1443894394.0,
                                    "replies": [
                                        {
                                            "body": "How do you use it though, without making your hair all oily all day?\n",
                                            "author": "sageDieu",
                                            "id": "cvn1qnd",
                                            "parent_id": "t1_cvmx5fy",
                                            "score": 7,
                                            "created_utc": 1443902289.0,
                                            "replies": [
                                                {
                                                    "body": "My gf bought it two months ago, and uses it every 3rd day while she's doing chores an hour before her shower. It needs to be applied from the scalp to the tips. \n\nHer hair is 30 - 50 centimeters long and a regular spoon is enough for her mane.",
                                                    "author": "theycallmeponcho",
                                                    "id": "cw0dfr2",
                                                    "parent_id": "t1_cvn1qnd",
                                                    "score": 2,
                                                    "created_utc": 1444888236.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This guide is really just a general catch-all. /u/redbingo is absolutely right though - nobody said people with shoulder-length hair aren't welcome to post here. Post away. \n\nI wish we had more people posting about curly, long, and ethnic hair as well. I just unfortunately don't know enough about them to post myself.",
                    "author": null,
                    "id": "cutlzv2",
                    "parent_id": "t1_cutfll3",
                    "score": 13,
                    "created_utc": 1441647368.0,
                    "replies": [
                        {
                            "body": "I would post, if I actually knew how to care for my own hair. Guess it's time to start researching.",
                            "author": null,
                            "id": "cuuevpo",
                            "parent_id": "t1_cutlzv2",
                            "score": 3,
                            "created_utc": 1441721256.0,
                            "replies": [
                                {
                                    "body": "Well you're welcome to post here and ask as well. There are definitely others with long hair here that could give advice.",
                                    "author": null,
                                    "id": "cuuf0ek",
                                    "parent_id": "t1_cuuevpo",
                                    "score": 3,
                                    "created_utc": 1441721520.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've been looking for shoulder length hair styling tips for some time. Wish I could pull off something like [this post over at FierceFlow.](https://www.reddit.com/r/FierceFlow/comments/3huuy2/good_hair_day_in_the_cubicle/) \n\nI don't get how people manage to get so much product in their hair and not make it a sticky, tangled mess.\n\n",
                    "author": "Stendarpaval",
                    "id": "cutntuu",
                    "parent_id": "t1_cutfll3",
                    "score": 1,
                    "created_utc": 1441650736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gotta say I love [Russell Crowe's](http://i.imgur.com/7mWVJ4F.jpg) transformation",
            "author": null,
            "id": "cutr5e9",
            "parent_id": "t3_3jyo62",
            "score": 28,
            "created_utc": 1441657375.0,
            "replies": []
        },
        {
            "body": "I'm going to go one deeper.  How do you use a comb?  Serious question.  I've never ONCE taken a comb to my hair and had it cause it to look better, only worse.  \n\nAlso, could you provide more detail on how one blow dries?  Accuse me of \"overthinking\" all you want, but I feel like this probably needs to be explained a lot more.  How dry do you towel dry before starting?  How long do you dry for, and at what heat?  How about using a hand/comb/brush?  When and how?",
            "author": "bbmmpp",
            "id": "cuudpx2",
            "parent_id": "t3_3jyo62",
            "score": 30,
            "created_utc": 1441718805.0,
            "replies": []
        },
        {
            "body": "Brad Pitt's hair in 2001 was the style that people had then, and the style that impressionable teenagers wanted. That chopped, messy, highlighted look. Almost every member of N*Sync had it. It seems odd to me to use this as the primary example when hair trends are bound to change drastically in 15 years. It's like saying baggy suits and jeans are awful. They are now, but in 2001, baggy bootcut jeans were the rage, and all anchors and casters had baggy suits. ",
            "author": "followmarko",
            "id": "cutie33",
            "parent_id": "t3_3jyo62",
            "score": 13,
            "created_utc": 1441640696.0,
            "replies": [
                {
                    "body": "You are correct, you can see my reasoning in another comment below.\n\nThat section was a placeholder anyways that I just fixed :)",
                    "author": null,
                    "id": "cutm0ne",
                    "parent_id": "t1_cutie33",
                    "score": 6,
                    "created_utc": 1441647405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Feel free to ask us questions too, we will gladly recommend how to style, which product to choose, or even a competitor product.   Thanks for all your support!\n\nZack\n\nCo-founder\n\nMister Pompadour ",
            "author": "MisterPompadour",
            "id": "cutpv31",
            "parent_id": "t3_3jyo62",
            "score": 20,
            "created_utc": 1441654470.0,
            "replies": [
                {
                    "body": "Really appreciate that a company is actually on such a small reddit community thanks for hanging around!",
                    "author": "ilikehairproducts",
                    "id": "cuxg21y",
                    "parent_id": "t1_cutpv31",
                    "score": 11,
                    "created_utc": 1441935540.0,
                    "replies": [
                        {
                            "body": "We were small once too :)  We're actually quite small compared to where we want to be.  We feel that great customer engagement and service will help us get there.  Thanks for the support!",
                            "author": "MisterPompadour",
                            "id": "cuy9iv5",
                            "parent_id": "t1_cuxg21y",
                            "score": 15,
                            "created_utc": 1442000600.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I currently use wax but feel like it's a bit harder to get out. I'm looking for something that has a good/strong hold and can be washed out during the daily shower... any recommendations?",
                    "author": "SC2Fun",
                    "id": "cvi58ac",
                    "parent_id": "t1_cutpv31",
                    "score": 3,
                    "created_utc": 1443540105.0,
                    "replies": []
                },
                {
                    "body": "Do you run your own hair salon? ",
                    "author": "Reygul",
                    "id": "cuw2ky4",
                    "parent_id": "t1_cutpv31",
                    "score": 2,
                    "created_utc": 1441834831.0,
                    "replies": [
                        {
                            "body": "We don't yet.  Matt and I are actually product engineers.  We have taken the scientific approach to formulating the best products we possibly can.",
                            "author": "MisterPompadour",
                            "id": "cuwllhk",
                            "parent_id": "t1_cuw2ky4",
                            "score": 2,
                            "created_utc": 1441879787.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "cuu4zso",
                    "parent_id": "t1_cutpv31",
                    "score": 1,
                    "created_utc": 1441687590.0,
                    "replies": [
                        {
                            "body": "Put some medium hold matte product in your hair and blow dry it on warm / cool setting.  The product will keep the fly aways down and give it some light hold.  ",
                            "author": "MisterPompadour",
                            "id": "cuuec7v",
                            "parent_id": "t1_cuu4zso",
                            "score": 6,
                            "created_utc": 1441720159.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What does \"don't wash every day\" mean? Does that mean when I shower in the morning I dont rinse my hair, or is that ok just no shampoo or conditioner. Also, I recently moved to the carribean. Would I need to wash my hair everytime I go swim in the Ocean? Does the salt damage my hair? Thanks in advance.",
                    "author": "DabbingTRex",
                    "id": "cv36w8s",
                    "parent_id": "t1_cutpv31",
                    "score": 1,
                    "created_utc": 1442379157.0,
                    "replies": [
                        {
                            "body": "First,  \"don't wash every day\" means don't apply shampoo everyday.  I shower every day, but only apply shampoo every third day.  You can do something call co-washing, which is using only conditioner daily if you want to try that.\n\nWhen you swim in the ocean, your hair will collect sea salt.  While this looks good, it can be damaging because salt draws out all the moisture from your hair.  I'd recommend rinsing your hair after swimming to at least get the most of that salt out.   If you start to get frizzy / dry hair, you might need to condition it daily to add that moisture back in. ",
                            "author": "MisterPompadour",
                            "id": "cv3f3ex",
                            "parent_id": "t1_cv36w8s",
                            "score": 8,
                            "created_utc": 1442408195.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "cv4bd2s",
                    "parent_id": "t1_cutpv31",
                    "score": 1,
                    "created_utc": 1442460050.0,
                    "replies": [
                        {
                            "body": "I recommend against using a 2 in 1 shampoo + conditioner.  It does both the job of cleaning and conditioning poorly by combining the two.  The purpose of a shampoo is to remove all dirt and oils from your hair and conditioner puts healthy oils back in.  I think it'd be unreasonable to have a product that does both well.\n\nI recommend shampooing / conditioning every other day or every third day.  Always condition after shampooing, but you can use conditioner on off days if you think it's necessary. ",
                            "author": "MisterPompadour",
                            "id": "cv4pzot",
                            "parent_id": "t1_cv4bd2s",
                            "score": 6,
                            "created_utc": 1442501590.0,
                            "replies": [
                                {
                                    "body": "Hey, i just bought beeswax paste and I really loved it. I just wanna ask if you have other products with the shine of beeswax paste but with a stronger hold? And what can you advice to me when styling my undercut I want it look straight and nice, but my hair is kinda dry and wavy. I dont shampoo everyday and I often use conditioner. Thanks! :D",
                                    "author": "sil130",
                                    "id": "cwvi83z",
                                    "parent_id": "t1_cv4pzot",
                                    "score": 1,
                                    "created_utc": 1447176975.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "would the advice you give here work with curly or wavy hair?",
            "author": "Neocentennial",
            "id": "cuu0e6s",
            "parent_id": "t3_3jyo62",
            "score": 6,
            "created_utc": 1441677946.0,
            "replies": [
                {
                    "body": "Yes. These are just basic getting-started tips when picking a haircut. But keep in mind curly and wavy hair has different possibilities when it comes to hairstyles.",
                    "author": "TheBurningSoda",
                    "id": "cuw12lb",
                    "parent_id": "t1_cuu0e6s",
                    "score": 4,
                    "created_utc": 1441832431.0,
                    "replies": [
                        {
                            "body": "Yeah. Everything I read is for straight hairs.  I got wavy curly strawberry blond that's kinda thick and need some tips. ",
                            "author": "Fattswindstorm",
                            "id": "cuwk15a",
                            "parent_id": "t1_cuw12lb",
                            "score": 6,
                            "created_utc": 1441871507.0,
                            "replies": [
                                {
                                    "body": "I know that feel man. You just gotta accept that you cant to the easy to manage straight hair styles. But believe me, the sooner you realize that, the sooner you can start getting that flow going and making the women crazy. And if you are looking for advice, try to specify that your hair is thick and wavy/curly and hopefully we can help you better ;)",
                                    "author": "TheBurningSoda",
                                    "id": "cuwul9d",
                                    "parent_id": "t1_cuwk15a",
                                    "score": 3,
                                    "created_utc": 1441900629.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Uhm the third link at the second section looks broken. Great guide, by the way.\n\n> A lot of dudes end up looking like [this](http://www.fashionfemale.net/wp-content/uploads/2013/10/Blonde-Highlights-in-Brown-Hair-Men.jpg) or [this](https://4.bp.blogspot.com/_-q8lIbt5XB0/TJ6vGPITZcI/AAAAAAAAAL4/Qkyx6HXXEdM/s400/byron-hairdressing1.jpg) or maybe [this](http://coolmenshairstyles.com/images/2010/09/tapered-haircut.jpg).",
            "author": "theycallmeponcho",
            "id": "cw0cgwv",
            "parent_id": "t3_3jyo62",
            "score": 6,
            "created_utc": 1444885601.0,
            "replies": []
        },
        {
            "body": "Question: What would be a good hairstyle if I don't plan on using any product?",
            "author": "youngbathsalt",
            "id": "cv1h5we",
            "parent_id": "t3_3jyo62",
            "score": 4,
            "created_utc": 1442259209.0,
            "replies": []
        },
        {
            "body": "Wow! This is exactly what this sub needed. Thank you for all the info!",
            "author": "Alex782",
            "id": "cutx10b",
            "parent_id": "t3_3jyo62",
            "score": 4,
            "created_utc": 1441671504.0,
            "replies": []
        },
        {
            "body": "4th link(3rd image) is broken. ",
            "author": "TheBurningSoda",
            "id": "cuw143o",
            "parent_id": "t3_3jyo62",
            "score": 4,
            "created_utc": 1441832495.0,
            "replies": []
        },
        {
            "body": "How do you know if a barber is a good barber or not? I feel like I can be oblivious to this type of thing",
            "author": "fonzi786",
            "id": "cvthyn8",
            "parent_id": "t3_3jyo62",
            "score": 5,
            "created_utc": 1444378432.0,
            "replies": [
                {
                    "body": "Word of mouth, see his finished products, price(sometimes), etc.",
                    "author": "VerseForYou",
                    "id": "cwei61j",
                    "parent_id": "t1_cvthyn8",
                    "score": 3,
                    "created_utc": 1445949664.0,
                    "replies": [
                        {
                            "body": "See I have no friends that care about their hair. Should I be checking instagram then?",
                            "author": "fonzi786",
                            "id": "cwervc8",
                            "parent_id": "t1_cwei61j",
                            "score": 3,
                            "created_utc": 1445965368.0,
                            "replies": [
                                {
                                    "body": "I don't have friends that care about their hair either.  I know the feels.\n\nI don't have an instagram.  I've never thought about that, but it could totally be a good way of checking to see who the best barbers in town are.  Thanks for the tip.  I might actually download it now.",
                                    "author": "VerseForYou",
                                    "id": "cwesb7x",
                                    "parent_id": "t1_cwervc8",
                                    "score": 2,
                                    "created_utc": 1445965994.0,
                                    "replies": [
                                        {
                                            "body": "Hmm. Where did you go for online searches? Curious cause I'm so clueless here :'(",
                                            "author": "fonzi786",
                                            "id": "cwez51e",
                                            "parent_id": "t1_cwesb7x",
                                            "score": 3,
                                            "created_utc": 1445975398.0,
                                            "replies": [
                                                {
                                                    "body": "I just googled local barbershops and looked for websites and usually they had photos of their work.",
                                                    "author": "VerseForYou",
                                                    "id": "cwfdo3c",
                                                    "parent_id": "t1_cwez51e",
                                                    "score": 1,
                                                    "created_utc": 1445996805.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
                                                            "author": "fonzi786",
                                                            "id": "cwfgy8h",
                                                            "parent_id": "t1_cwfdo3c",
                                                            "score": 2,
                                                            "created_utc": 1446001847.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great stuff. Looks of good info. Some things I have to share: [How to Talk to Your Barber | Art of Manliness](https://www.youtube.com/watch?v=Xw4JP3bEvng) and if you find pictures repost your photos on imgur so they don't 404 or disappear. ",
            "author": "solaceinsleep",
            "id": "cuuakrj",
            "parent_id": "t3_3jyo62",
            "score": 3,
            "created_utc": 1441708438.0,
            "replies": []
        },
        {
            "body": "Thanks for the post! I am now just starting to look into hair are and haircuts, after finally somewhat growing out my hair. I've cut my own hair, and cut it short, for over a decade now as I have horrible hair and thought there was no way to really do anything nice to it. I'm ready to move away from that!",
            "author": "ohhector",
            "id": "cutf3hy",
            "parent_id": "t3_3jyo62",
            "score": 2,
            "created_utc": 1441633265.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cutfeed",
            "parent_id": "t3_3jyo62",
            "score": 2,
            "created_utc": 1441634065.0,
            "replies": [
                {
                    "body": "I'm going to have a quick mention of this in a FAQ I'll be adding to this guide soon. Should be this week sometime.",
                    "author": null,
                    "id": "cutm1fo",
                    "parent_id": "t1_cutfeed",
                    "score": 2,
                    "created_utc": 1441647444.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a little late but I have a question. I'm growing out my hair to slick back but notice my sides aren't growing evenly. One side is easy to slick back but the other side difficult. Is this a common problem and will growing it out fix it? ",
            "author": "palberca",
            "id": "cuxaujj",
            "parent_id": "t3_3jyo62",
            "score": 2,
            "created_utc": 1441926358.0,
            "replies": [
                {
                    "body": "It's possible your hair grows in different directions? One side grows \"back\" and the other doesn't? ",
                    "author": "DrunkFern",
                    "id": "cuxdkag",
                    "parent_id": "t1_cuxaujj",
                    "score": 1,
                    "created_utc": 1441931368.0,
                    "replies": [
                        {
                            "body": "It might be that, when I try to slick the side back it just sticks up. I have to brush it down to make it look decent. I can try to take pics later to show the difference. ",
                            "author": "palberca",
                            "id": "cuxz8u5",
                            "parent_id": "t1_cuxdkag",
                            "score": 1,
                            "created_utc": 1441984596.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Brad Pitt along the years was a bad example. 2001-2014 is a long time and 2001s style was vastly different than it is now.",
            "author": "lannisterstark",
            "id": "cutkrix",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1441645112.0,
            "replies": [
                {
                    "body": "I see what you mean but I'm just looking at it from a 2015 standpoint. That part of the guide will be changed soon anyways, I have something else in mind for it. No Brad Pitt.\n\nI just wanted an excuse to post pics of Brad Pitts current hair honestly. Because daaaamn. ",
                    "author": null,
                    "id": "cutl3kt",
                    "parent_id": "t1_cutkrix",
                    "score": 2,
                    "created_utc": 1441645744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hello, I just came across this site today and I am glad this post is active right now. I apologize if this question has been answered somewhere else already but, I have thick coarse hair and I now have a job where I have to look a lot more presentable than I have ever had to before. Is there anywhere I can look to to get advice on hair styles for thick coarse hair? I like the look of the taper or faded sides and back and the longer hair on top combed to the side from a part but I am afraid to get the haircut if its not going to work how I want it to.",
            "author": "boarderman8",
            "id": "cutrwku",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1441659241.0,
            "replies": []
        },
        {
            "body": "Are these imgur links broken for anyone else? When I go to them there is nothing there.",
            "author": null,
            "id": "cuu0tq2",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1441678823.0,
            "replies": []
        },
        {
            "body": "Hi where can I find pomade?",
            "author": null,
            "id": "cuu5qf0",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1441689629.0,
            "replies": [
                {
                    "body": "American Crew pomade can be bought at your local walmart. Products like Hanz de Fuko, and Mister Pompadour are some higher caliber products that, as far as I know, can only be bought online.\n\nEDIT: Come to think of it, your local hair *stylist* might carry some decent products. ",
                    "author": "HelloSlackers",
                    "id": "cv4wbe4",
                    "parent_id": "t1_cuu5qf0",
                    "score": 3,
                    "created_utc": 1442511264.0,
                    "replies": [
                        {
                            "body": "ok thank you",
                            "author": null,
                            "id": "cv4wk3t",
                            "parent_id": "t1_cv4wbe4",
                            "score": 2,
                            "created_utc": 1442511629.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cuv277u",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1441759058.0,
            "replies": [
                {
                    "body": "Any thoughts on Redken manuever wax?",
                    "author": "bondinspace",
                    "id": "cuwaoon",
                    "parent_id": "t1_cuv277u",
                    "score": 1,
                    "created_utc": 1441848882.0,
                    "replies": [
                        {
                            "body": "Never heard of it, to be honest.",
                            "author": "DoesThisMakeMeLookFa",
                            "id": "cuxab4v",
                            "parent_id": "t1_cuwaoon",
                            "score": 1,
                            "created_utc": 1441925374.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ive got hair about halfway down my backs that is kinda thinning. I generally just brush it, throw on a bandana and go. What would work well with it?",
            "author": "Satansnightmare0192",
            "id": "cv8ll50",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1442801542.0,
            "replies": []
        },
        {
            "body": "What can I put if I don't care about styling per se, I just want to avoid frizz? My hair feels great 1-2 hours after showering, but late in the afternoon it is a tangled nest of frizzy hair. Thanks.",
            "author": "Amator",
            "id": "cxexg3k",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1448650116.0,
            "replies": [
                {
                    "body": "Some sort of light cream or oil spray. Maybe even a leave-in conditioner. Maybe something like [Milkshake](https://www.amazon.com/dp/B002KQ7E9M/ref=cm_sw_r_cp_awd_NilwwbFPCHRR4)? I like that stuff. ",
                    "author": null,
                    "id": "cxez7af",
                    "parent_id": "t1_cxexg3k",
                    "score": 1,
                    "created_utc": 1448653410.0,
                    "replies": [
                        {
                            "body": "\n**Milk Shake Leave in Conditioner 11.8 fl ounces** \n\n||||\n--:|:--|:--\nCurrent|$10.99|Amazon (3rd Party New)\nHigh|$19.58|Amazon (3rd Party New)\nLow|$3.11|Amazon (3rd Party New)\n|Average|$10.99|30 Day\n\n[Price History Chart and Sales Rank](http://i.imgur.com/HuywQy0.png) | [FAQ](http://www.reddit.com/r/PriceZombie/wiki/index) \n",
                            "author": "PriceZombie",
                            "id": "cxez7ih",
                            "parent_id": "t1_cxez7af",
                            "score": 1,
                            "created_utc": 1448653420.0,
                            "replies": []
                        },
                        {
                            "body": "I'll have to give that a try. Thank you!",
                            "author": "Amator",
                            "id": "cxf16nm",
                            "parent_id": "t1_cxez7af",
                            "score": 1,
                            "created_utc": 1448657072.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am a womantype thing but am going for a boy haircut. I just buzzed the entire thing from a 'hawk to start over, and have been trying to find the perfect photo for what I'm wanting to grow it out to, and I JUST FOUND IT in your example inspo album here. THANK YOU!\nhttp://i.imgur.com/AUepCht.jpg",
            "author": "erispie",
            "id": "cxkwx2j",
            "parent_id": "t3_3jyo62",
            "score": 1,
            "created_utc": 1449094174.0,
            "replies": []
        },
        {
            "body": "Just post it here. Be the change you want to see in the subreddit.",
            "author": null,
            "id": "cutkawt",
            "parent_id": "t1_cutfll3",
            "score": 45,
            "created_utc": 1441644265.0,
            "replies": [
                {
                    "body": "I'm inspired",
                    "author": "ResilientFellow",
                    "id": "cvn9xco",
                    "parent_id": "t1_cutkawt",
                    "score": 21,
                    "created_utc": 1443917500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Coconut oil. DO NOT WASH EVERY DAY. Sulfate free shampoo. Boar bristle brush. What else you wanna know?",
            "author": null,
            "id": "cutlg19",
            "parent_id": "t1_cutfll3",
            "score": 11,
            "created_utc": 1441646370.0,
            "replies": [
                {
                    "body": "what's the coconut oil + not washing do? and the brush? ",
                    "author": "sageDieu",
                    "id": "cv8p3t0",
                    "parent_id": "t1_cutlg19",
                    "score": 3,
                    "created_utc": 1442807750.0,
                    "replies": [
                        {
                            "body": "Shampoo can actually be detrimental to your scalp's (and in turn your hair's) health. Coconut oil helps keep your scalp and hair healthy.",
                            "author": "moostream",
                            "id": "cvmx5fy",
                            "parent_id": "t1_cv8p3t0",
                            "score": 3,
                            "created_utc": 1443894394.0,
                            "replies": [
                                {
                                    "body": "How do you use it though, without making your hair all oily all day?\n",
                                    "author": "sageDieu",
                                    "id": "cvn1qnd",
                                    "parent_id": "t1_cvmx5fy",
                                    "score": 7,
                                    "created_utc": 1443902289.0,
                                    "replies": [
                                        {
                                            "body": "My gf bought it two months ago, and uses it every 3rd day while she's doing chores an hour before her shower. It needs to be applied from the scalp to the tips. \n\nHer hair is 30 - 50 centimeters long and a regular spoon is enough for her mane.",
                                            "author": "theycallmeponcho",
                                            "id": "cw0dfr2",
                                            "parent_id": "t1_cvn1qnd",
                                            "score": 2,
                                            "created_utc": 1444888236.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This guide is really just a general catch-all. /u/redbingo is absolutely right though - nobody said people with shoulder-length hair aren't welcome to post here. Post away. \n\nI wish we had more people posting about curly, long, and ethnic hair as well. I just unfortunately don't know enough about them to post myself.",
            "author": null,
            "id": "cutlzv2",
            "parent_id": "t1_cutfll3",
            "score": 13,
            "created_utc": 1441647368.0,
            "replies": [
                {
                    "body": "I would post, if I actually knew how to care for my own hair. Guess it's time to start researching.",
                    "author": null,
                    "id": "cuuevpo",
                    "parent_id": "t1_cutlzv2",
                    "score": 3,
                    "created_utc": 1441721256.0,
                    "replies": [
                        {
                            "body": "Well you're welcome to post here and ask as well. There are definitely others with long hair here that could give advice.",
                            "author": null,
                            "id": "cuuf0ek",
                            "parent_id": "t1_cuuevpo",
                            "score": 3,
                            "created_utc": 1441721520.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've been looking for shoulder length hair styling tips for some time. Wish I could pull off something like [this post over at FierceFlow.](https://www.reddit.com/r/FierceFlow/comments/3huuy2/good_hair_day_in_the_cubicle/) \n\nI don't get how people manage to get so much product in their hair and not make it a sticky, tangled mess.\n\n",
            "author": "Stendarpaval",
            "id": "cutntuu",
            "parent_id": "t1_cutfll3",
            "score": 1,
            "created_utc": 1441650736.0,
            "replies": []
        },
        {
            "body": "You are correct, you can see my reasoning in another comment below.\n\nThat section was a placeholder anyways that I just fixed :)",
            "author": null,
            "id": "cutm0ne",
            "parent_id": "t1_cutie33",
            "score": 6,
            "created_utc": 1441647405.0,
            "replies": []
        },
        {
            "body": "Really appreciate that a company is actually on such a small reddit community thanks for hanging around!",
            "author": "ilikehairproducts",
            "id": "cuxg21y",
            "parent_id": "t1_cutpv31",
            "score": 11,
            "created_utc": 1441935540.0,
            "replies": [
                {
                    "body": "We were small once too :)  We're actually quite small compared to where we want to be.  We feel that great customer engagement and service will help us get there.  Thanks for the support!",
                    "author": "MisterPompadour",
                    "id": "cuy9iv5",
                    "parent_id": "t1_cuxg21y",
                    "score": 15,
                    "created_utc": 1442000600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I currently use wax but feel like it's a bit harder to get out. I'm looking for something that has a good/strong hold and can be washed out during the daily shower... any recommendations?",
            "author": "SC2Fun",
            "id": "cvi58ac",
            "parent_id": "t1_cutpv31",
            "score": 3,
            "created_utc": 1443540105.0,
            "replies": []
        },
        {
            "body": "Do you run your own hair salon? ",
            "author": "Reygul",
            "id": "cuw2ky4",
            "parent_id": "t1_cutpv31",
            "score": 2,
            "created_utc": 1441834831.0,
            "replies": [
                {
                    "body": "We don't yet.  Matt and I are actually product engineers.  We have taken the scientific approach to formulating the best products we possibly can.",
                    "author": "MisterPompadour",
                    "id": "cuwllhk",
                    "parent_id": "t1_cuw2ky4",
                    "score": 2,
                    "created_utc": 1441879787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cuu4zso",
            "parent_id": "t1_cutpv31",
            "score": 1,
            "created_utc": 1441687590.0,
            "replies": [
                {
                    "body": "Put some medium hold matte product in your hair and blow dry it on warm / cool setting.  The product will keep the fly aways down and give it some light hold.  ",
                    "author": "MisterPompadour",
                    "id": "cuuec7v",
                    "parent_id": "t1_cuu4zso",
                    "score": 6,
                    "created_utc": 1441720159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does \"don't wash every day\" mean? Does that mean when I shower in the morning I dont rinse my hair, or is that ok just no shampoo or conditioner. Also, I recently moved to the carribean. Would I need to wash my hair everytime I go swim in the Ocean? Does the salt damage my hair? Thanks in advance.",
            "author": "DabbingTRex",
            "id": "cv36w8s",
            "parent_id": "t1_cutpv31",
            "score": 1,
            "created_utc": 1442379157.0,
            "replies": [
                {
                    "body": "First,  \"don't wash every day\" means don't apply shampoo everyday.  I shower every day, but only apply shampoo every third day.  You can do something call co-washing, which is using only conditioner daily if you want to try that.\n\nWhen you swim in the ocean, your hair will collect sea salt.  While this looks good, it can be damaging because salt draws out all the moisture from your hair.  I'd recommend rinsing your hair after swimming to at least get the most of that salt out.   If you start to get frizzy / dry hair, you might need to condition it daily to add that moisture back in. ",
                    "author": "MisterPompadour",
                    "id": "cv3f3ex",
                    "parent_id": "t1_cv36w8s",
                    "score": 8,
                    "created_utc": 1442408195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cv4bd2s",
            "parent_id": "t1_cutpv31",
            "score": 1,
            "created_utc": 1442460050.0,
            "replies": [
                {
                    "body": "I recommend against using a 2 in 1 shampoo + conditioner.  It does both the job of cleaning and conditioning poorly by combining the two.  The purpose of a shampoo is to remove all dirt and oils from your hair and conditioner puts healthy oils back in.  I think it'd be unreasonable to have a product that does both well.\n\nI recommend shampooing / conditioning every other day or every third day.  Always condition after shampooing, but you can use conditioner on off days if you think it's necessary. ",
                    "author": "MisterPompadour",
                    "id": "cv4pzot",
                    "parent_id": "t1_cv4bd2s",
                    "score": 6,
                    "created_utc": 1442501590.0,
                    "replies": [
                        {
                            "body": "Hey, i just bought beeswax paste and I really loved it. I just wanna ask if you have other products with the shine of beeswax paste but with a stronger hold? And what can you advice to me when styling my undercut I want it look straight and nice, but my hair is kinda dry and wavy. I dont shampoo everyday and I often use conditioner. Thanks! :D",
                            "author": "sil130",
                            "id": "cwvi83z",
                            "parent_id": "t1_cv4pzot",
                            "score": 1,
                            "created_utc": 1447176975.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. These are just basic getting-started tips when picking a haircut. But keep in mind curly and wavy hair has different possibilities when it comes to hairstyles.",
            "author": "TheBurningSoda",
            "id": "cuw12lb",
            "parent_id": "t1_cuu0e6s",
            "score": 4,
            "created_utc": 1441832431.0,
            "replies": [
                {
                    "body": "Yeah. Everything I read is for straight hairs.  I got wavy curly strawberry blond that's kinda thick and need some tips. ",
                    "author": "Fattswindstorm",
                    "id": "cuwk15a",
                    "parent_id": "t1_cuw12lb",
                    "score": 6,
                    "created_utc": 1441871507.0,
                    "replies": [
                        {
                            "body": "I know that feel man. You just gotta accept that you cant to the easy to manage straight hair styles. But believe me, the sooner you realize that, the sooner you can start getting that flow going and making the women crazy. And if you are looking for advice, try to specify that your hair is thick and wavy/curly and hopefully we can help you better ;)",
                            "author": "TheBurningSoda",
                            "id": "cuwul9d",
                            "parent_id": "t1_cuwk15a",
                            "score": 3,
                            "created_utc": 1441900629.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Word of mouth, see his finished products, price(sometimes), etc.",
            "author": "VerseForYou",
            "id": "cwei61j",
            "parent_id": "t1_cvthyn8",
            "score": 3,
            "created_utc": 1445949664.0,
            "replies": [
                {
                    "body": "See I have no friends that care about their hair. Should I be checking instagram then?",
                    "author": "fonzi786",
                    "id": "cwervc8",
                    "parent_id": "t1_cwei61j",
                    "score": 3,
                    "created_utc": 1445965368.0,
                    "replies": [
                        {
                            "body": "I don't have friends that care about their hair either.  I know the feels.\n\nI don't have an instagram.  I've never thought about that, but it could totally be a good way of checking to see who the best barbers in town are.  Thanks for the tip.  I might actually download it now.",
                            "author": "VerseForYou",
                            "id": "cwesb7x",
                            "parent_id": "t1_cwervc8",
                            "score": 2,
                            "created_utc": 1445965994.0,
                            "replies": [
                                {
                                    "body": "Hmm. Where did you go for online searches? Curious cause I'm so clueless here :'(",
                                    "author": "fonzi786",
                                    "id": "cwez51e",
                                    "parent_id": "t1_cwesb7x",
                                    "score": 3,
                                    "created_utc": 1445975398.0,
                                    "replies": [
                                        {
                                            "body": "I just googled local barbershops and looked for websites and usually they had photos of their work.",
                                            "author": "VerseForYou",
                                            "id": "cwfdo3c",
                                            "parent_id": "t1_cwez51e",
                                            "score": 1,
                                            "created_utc": 1445996805.0,
                                            "replies": [
                                                {
                                                    "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
                                                    "author": "fonzi786",
                                                    "id": "cwfgy8h",
                                                    "parent_id": "t1_cwfdo3c",
                                                    "score": 2,
                                                    "created_utc": 1446001847.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm going to have a quick mention of this in a FAQ I'll be adding to this guide soon. Should be this week sometime.",
            "author": null,
            "id": "cutm1fo",
            "parent_id": "t1_cutfeed",
            "score": 2,
            "created_utc": 1441647444.0,
            "replies": []
        },
        {
            "body": "It's possible your hair grows in different directions? One side grows \"back\" and the other doesn't? ",
            "author": "DrunkFern",
            "id": "cuxdkag",
            "parent_id": "t1_cuxaujj",
            "score": 1,
            "created_utc": 1441931368.0,
            "replies": [
                {
                    "body": "It might be that, when I try to slick the side back it just sticks up. I have to brush it down to make it look decent. I can try to take pics later to show the difference. ",
                    "author": "palberca",
                    "id": "cuxz8u5",
                    "parent_id": "t1_cuxdkag",
                    "score": 1,
                    "created_utc": 1441984596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see what you mean but I'm just looking at it from a 2015 standpoint. That part of the guide will be changed soon anyways, I have something else in mind for it. No Brad Pitt.\n\nI just wanted an excuse to post pics of Brad Pitts current hair honestly. Because daaaamn. ",
            "author": null,
            "id": "cutl3kt",
            "parent_id": "t1_cutkrix",
            "score": 2,
            "created_utc": 1441645744.0,
            "replies": []
        },
        {
            "body": "American Crew pomade can be bought at your local walmart. Products like Hanz de Fuko, and Mister Pompadour are some higher caliber products that, as far as I know, can only be bought online.\n\nEDIT: Come to think of it, your local hair *stylist* might carry some decent products. ",
            "author": "HelloSlackers",
            "id": "cv4wbe4",
            "parent_id": "t1_cuu5qf0",
            "score": 3,
            "created_utc": 1442511264.0,
            "replies": [
                {
                    "body": "ok thank you",
                    "author": null,
                    "id": "cv4wk3t",
                    "parent_id": "t1_cv4wbe4",
                    "score": 2,
                    "created_utc": 1442511629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any thoughts on Redken manuever wax?",
            "author": "bondinspace",
            "id": "cuwaoon",
            "parent_id": "t1_cuv277u",
            "score": 1,
            "created_utc": 1441848882.0,
            "replies": [
                {
                    "body": "Never heard of it, to be honest.",
                    "author": "DoesThisMakeMeLookFa",
                    "id": "cuxab4v",
                    "parent_id": "t1_cuwaoon",
                    "score": 1,
                    "created_utc": 1441925374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some sort of light cream or oil spray. Maybe even a leave-in conditioner. Maybe something like [Milkshake](https://www.amazon.com/dp/B002KQ7E9M/ref=cm_sw_r_cp_awd_NilwwbFPCHRR4)? I like that stuff. ",
            "author": null,
            "id": "cxez7af",
            "parent_id": "t1_cxexg3k",
            "score": 1,
            "created_utc": 1448653410.0,
            "replies": [
                {
                    "body": "\n**Milk Shake Leave in Conditioner 11.8 fl ounces** \n\n||||\n--:|:--|:--\nCurrent|$10.99|Amazon (3rd Party New)\nHigh|$19.58|Amazon (3rd Party New)\nLow|$3.11|Amazon (3rd Party New)\n|Average|$10.99|30 Day\n\n[Price History Chart and Sales Rank](http://i.imgur.com/HuywQy0.png) | [FAQ](http://www.reddit.com/r/PriceZombie/wiki/index) \n",
                    "author": "PriceZombie",
                    "id": "cxez7ih",
                    "parent_id": "t1_cxez7af",
                    "score": 1,
                    "created_utc": 1448653420.0,
                    "replies": []
                },
                {
                    "body": "I'll have to give that a try. Thank you!",
                    "author": "Amator",
                    "id": "cxf16nm",
                    "parent_id": "t1_cxez7af",
                    "score": 1,
                    "created_utc": 1448657072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm inspired",
            "author": "ResilientFellow",
            "id": "cvn9xco",
            "parent_id": "t1_cutkawt",
            "score": 21,
            "created_utc": 1443917500.0,
            "replies": []
        },
        {
            "body": "what's the coconut oil + not washing do? and the brush? ",
            "author": "sageDieu",
            "id": "cv8p3t0",
            "parent_id": "t1_cutlg19",
            "score": 3,
            "created_utc": 1442807750.0,
            "replies": [
                {
                    "body": "Shampoo can actually be detrimental to your scalp's (and in turn your hair's) health. Coconut oil helps keep your scalp and hair healthy.",
                    "author": "moostream",
                    "id": "cvmx5fy",
                    "parent_id": "t1_cv8p3t0",
                    "score": 3,
                    "created_utc": 1443894394.0,
                    "replies": [
                        {
                            "body": "How do you use it though, without making your hair all oily all day?\n",
                            "author": "sageDieu",
                            "id": "cvn1qnd",
                            "parent_id": "t1_cvmx5fy",
                            "score": 7,
                            "created_utc": 1443902289.0,
                            "replies": [
                                {
                                    "body": "My gf bought it two months ago, and uses it every 3rd day while she's doing chores an hour before her shower. It needs to be applied from the scalp to the tips. \n\nHer hair is 30 - 50 centimeters long and a regular spoon is enough for her mane.",
                                    "author": "theycallmeponcho",
                                    "id": "cw0dfr2",
                                    "parent_id": "t1_cvn1qnd",
                                    "score": 2,
                                    "created_utc": 1444888236.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would post, if I actually knew how to care for my own hair. Guess it's time to start researching.",
            "author": null,
            "id": "cuuevpo",
            "parent_id": "t1_cutlzv2",
            "score": 3,
            "created_utc": 1441721256.0,
            "replies": [
                {
                    "body": "Well you're welcome to post here and ask as well. There are definitely others with long hair here that could give advice.",
                    "author": null,
                    "id": "cuuf0ek",
                    "parent_id": "t1_cuuevpo",
                    "score": 3,
                    "created_utc": 1441721520.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We were small once too :)  We're actually quite small compared to where we want to be.  We feel that great customer engagement and service will help us get there.  Thanks for the support!",
            "author": "MisterPompadour",
            "id": "cuy9iv5",
            "parent_id": "t1_cuxg21y",
            "score": 15,
            "created_utc": 1442000600.0,
            "replies": []
        },
        {
            "body": "We don't yet.  Matt and I are actually product engineers.  We have taken the scientific approach to formulating the best products we possibly can.",
            "author": "MisterPompadour",
            "id": "cuwllhk",
            "parent_id": "t1_cuw2ky4",
            "score": 2,
            "created_utc": 1441879787.0,
            "replies": []
        },
        {
            "body": "Put some medium hold matte product in your hair and blow dry it on warm / cool setting.  The product will keep the fly aways down and give it some light hold.  ",
            "author": "MisterPompadour",
            "id": "cuuec7v",
            "parent_id": "t1_cuu4zso",
            "score": 6,
            "created_utc": 1441720159.0,
            "replies": []
        },
        {
            "body": "First,  \"don't wash every day\" means don't apply shampoo everyday.  I shower every day, but only apply shampoo every third day.  You can do something call co-washing, which is using only conditioner daily if you want to try that.\n\nWhen you swim in the ocean, your hair will collect sea salt.  While this looks good, it can be damaging because salt draws out all the moisture from your hair.  I'd recommend rinsing your hair after swimming to at least get the most of that salt out.   If you start to get frizzy / dry hair, you might need to condition it daily to add that moisture back in. ",
            "author": "MisterPompadour",
            "id": "cv3f3ex",
            "parent_id": "t1_cv36w8s",
            "score": 8,
            "created_utc": 1442408195.0,
            "replies": []
        },
        {
            "body": "I recommend against using a 2 in 1 shampoo + conditioner.  It does both the job of cleaning and conditioning poorly by combining the two.  The purpose of a shampoo is to remove all dirt and oils from your hair and conditioner puts healthy oils back in.  I think it'd be unreasonable to have a product that does both well.\n\nI recommend shampooing / conditioning every other day or every third day.  Always condition after shampooing, but you can use conditioner on off days if you think it's necessary. ",
            "author": "MisterPompadour",
            "id": "cv4pzot",
            "parent_id": "t1_cv4bd2s",
            "score": 6,
            "created_utc": 1442501590.0,
            "replies": [
                {
                    "body": "Hey, i just bought beeswax paste and I really loved it. I just wanna ask if you have other products with the shine of beeswax paste but with a stronger hold? And what can you advice to me when styling my undercut I want it look straight and nice, but my hair is kinda dry and wavy. I dont shampoo everyday and I often use conditioner. Thanks! :D",
                    "author": "sil130",
                    "id": "cwvi83z",
                    "parent_id": "t1_cv4pzot",
                    "score": 1,
                    "created_utc": 1447176975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. Everything I read is for straight hairs.  I got wavy curly strawberry blond that's kinda thick and need some tips. ",
            "author": "Fattswindstorm",
            "id": "cuwk15a",
            "parent_id": "t1_cuw12lb",
            "score": 6,
            "created_utc": 1441871507.0,
            "replies": [
                {
                    "body": "I know that feel man. You just gotta accept that you cant to the easy to manage straight hair styles. But believe me, the sooner you realize that, the sooner you can start getting that flow going and making the women crazy. And if you are looking for advice, try to specify that your hair is thick and wavy/curly and hopefully we can help you better ;)",
                    "author": "TheBurningSoda",
                    "id": "cuwul9d",
                    "parent_id": "t1_cuwk15a",
                    "score": 3,
                    "created_utc": 1441900629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "See I have no friends that care about their hair. Should I be checking instagram then?",
            "author": "fonzi786",
            "id": "cwervc8",
            "parent_id": "t1_cwei61j",
            "score": 3,
            "created_utc": 1445965368.0,
            "replies": [
                {
                    "body": "I don't have friends that care about their hair either.  I know the feels.\n\nI don't have an instagram.  I've never thought about that, but it could totally be a good way of checking to see who the best barbers in town are.  Thanks for the tip.  I might actually download it now.",
                    "author": "VerseForYou",
                    "id": "cwesb7x",
                    "parent_id": "t1_cwervc8",
                    "score": 2,
                    "created_utc": 1445965994.0,
                    "replies": [
                        {
                            "body": "Hmm. Where did you go for online searches? Curious cause I'm so clueless here :'(",
                            "author": "fonzi786",
                            "id": "cwez51e",
                            "parent_id": "t1_cwesb7x",
                            "score": 3,
                            "created_utc": 1445975398.0,
                            "replies": [
                                {
                                    "body": "I just googled local barbershops and looked for websites and usually they had photos of their work.",
                                    "author": "VerseForYou",
                                    "id": "cwfdo3c",
                                    "parent_id": "t1_cwez51e",
                                    "score": 1,
                                    "created_utc": 1445996805.0,
                                    "replies": [
                                        {
                                            "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
                                            "author": "fonzi786",
                                            "id": "cwfgy8h",
                                            "parent_id": "t1_cwfdo3c",
                                            "score": 2,
                                            "created_utc": 1446001847.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It might be that, when I try to slick the side back it just sticks up. I have to brush it down to make it look decent. I can try to take pics later to show the difference. ",
            "author": "palberca",
            "id": "cuxz8u5",
            "parent_id": "t1_cuxdkag",
            "score": 1,
            "created_utc": 1441984596.0,
            "replies": []
        },
        {
            "body": "ok thank you",
            "author": null,
            "id": "cv4wk3t",
            "parent_id": "t1_cv4wbe4",
            "score": 2,
            "created_utc": 1442511629.0,
            "replies": []
        },
        {
            "body": "Never heard of it, to be honest.",
            "author": "DoesThisMakeMeLookFa",
            "id": "cuxab4v",
            "parent_id": "t1_cuwaoon",
            "score": 1,
            "created_utc": 1441925374.0,
            "replies": []
        },
        {
            "body": "\n**Milk Shake Leave in Conditioner 11.8 fl ounces** \n\n||||\n--:|:--|:--\nCurrent|$10.99|Amazon (3rd Party New)\nHigh|$19.58|Amazon (3rd Party New)\nLow|$3.11|Amazon (3rd Party New)\n|Average|$10.99|30 Day\n\n[Price History Chart and Sales Rank](http://i.imgur.com/HuywQy0.png) | [FAQ](http://www.reddit.com/r/PriceZombie/wiki/index) \n",
            "author": "PriceZombie",
            "id": "cxez7ih",
            "parent_id": "t1_cxez7af",
            "score": 1,
            "created_utc": 1448653420.0,
            "replies": []
        },
        {
            "body": "I'll have to give that a try. Thank you!",
            "author": "Amator",
            "id": "cxf16nm",
            "parent_id": "t1_cxez7af",
            "score": 1,
            "created_utc": 1448657072.0,
            "replies": []
        },
        {
            "body": "Shampoo can actually be detrimental to your scalp's (and in turn your hair's) health. Coconut oil helps keep your scalp and hair healthy.",
            "author": "moostream",
            "id": "cvmx5fy",
            "parent_id": "t1_cv8p3t0",
            "score": 3,
            "created_utc": 1443894394.0,
            "replies": [
                {
                    "body": "How do you use it though, without making your hair all oily all day?\n",
                    "author": "sageDieu",
                    "id": "cvn1qnd",
                    "parent_id": "t1_cvmx5fy",
                    "score": 7,
                    "created_utc": 1443902289.0,
                    "replies": [
                        {
                            "body": "My gf bought it two months ago, and uses it every 3rd day while she's doing chores an hour before her shower. It needs to be applied from the scalp to the tips. \n\nHer hair is 30 - 50 centimeters long and a regular spoon is enough for her mane.",
                            "author": "theycallmeponcho",
                            "id": "cw0dfr2",
                            "parent_id": "t1_cvn1qnd",
                            "score": 2,
                            "created_utc": 1444888236.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well you're welcome to post here and ask as well. There are definitely others with long hair here that could give advice.",
            "author": null,
            "id": "cuuf0ek",
            "parent_id": "t1_cuuevpo",
            "score": 3,
            "created_utc": 1441721520.0,
            "replies": []
        },
        {
            "body": "Hey, i just bought beeswax paste and I really loved it. I just wanna ask if you have other products with the shine of beeswax paste but with a stronger hold? And what can you advice to me when styling my undercut I want it look straight and nice, but my hair is kinda dry and wavy. I dont shampoo everyday and I often use conditioner. Thanks! :D",
            "author": "sil130",
            "id": "cwvi83z",
            "parent_id": "t1_cv4pzot",
            "score": 1,
            "created_utc": 1447176975.0,
            "replies": []
        },
        {
            "body": "I know that feel man. You just gotta accept that you cant to the easy to manage straight hair styles. But believe me, the sooner you realize that, the sooner you can start getting that flow going and making the women crazy. And if you are looking for advice, try to specify that your hair is thick and wavy/curly and hopefully we can help you better ;)",
            "author": "TheBurningSoda",
            "id": "cuwul9d",
            "parent_id": "t1_cuwk15a",
            "score": 3,
            "created_utc": 1441900629.0,
            "replies": []
        },
        {
            "body": "I don't have friends that care about their hair either.  I know the feels.\n\nI don't have an instagram.  I've never thought about that, but it could totally be a good way of checking to see who the best barbers in town are.  Thanks for the tip.  I might actually download it now.",
            "author": "VerseForYou",
            "id": "cwesb7x",
            "parent_id": "t1_cwervc8",
            "score": 2,
            "created_utc": 1445965994.0,
            "replies": [
                {
                    "body": "Hmm. Where did you go for online searches? Curious cause I'm so clueless here :'(",
                    "author": "fonzi786",
                    "id": "cwez51e",
                    "parent_id": "t1_cwesb7x",
                    "score": 3,
                    "created_utc": 1445975398.0,
                    "replies": [
                        {
                            "body": "I just googled local barbershops and looked for websites and usually they had photos of their work.",
                            "author": "VerseForYou",
                            "id": "cwfdo3c",
                            "parent_id": "t1_cwez51e",
                            "score": 1,
                            "created_utc": 1445996805.0,
                            "replies": [
                                {
                                    "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
                                    "author": "fonzi786",
                                    "id": "cwfgy8h",
                                    "parent_id": "t1_cwfdo3c",
                                    "score": 2,
                                    "created_utc": 1446001847.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How do you use it though, without making your hair all oily all day?\n",
            "author": "sageDieu",
            "id": "cvn1qnd",
            "parent_id": "t1_cvmx5fy",
            "score": 7,
            "created_utc": 1443902289.0,
            "replies": [
                {
                    "body": "My gf bought it two months ago, and uses it every 3rd day while she's doing chores an hour before her shower. It needs to be applied from the scalp to the tips. \n\nHer hair is 30 - 50 centimeters long and a regular spoon is enough for her mane.",
                    "author": "theycallmeponcho",
                    "id": "cw0dfr2",
                    "parent_id": "t1_cvn1qnd",
                    "score": 2,
                    "created_utc": 1444888236.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm. Where did you go for online searches? Curious cause I'm so clueless here :'(",
            "author": "fonzi786",
            "id": "cwez51e",
            "parent_id": "t1_cwesb7x",
            "score": 3,
            "created_utc": 1445975398.0,
            "replies": [
                {
                    "body": "I just googled local barbershops and looked for websites and usually they had photos of their work.",
                    "author": "VerseForYou",
                    "id": "cwfdo3c",
                    "parent_id": "t1_cwez51e",
                    "score": 1,
                    "created_utc": 1445996805.0,
                    "replies": [
                        {
                            "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
                            "author": "fonzi786",
                            "id": "cwfgy8h",
                            "parent_id": "t1_cwfdo3c",
                            "score": 2,
                            "created_utc": 1446001847.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My gf bought it two months ago, and uses it every 3rd day while she's doing chores an hour before her shower. It needs to be applied from the scalp to the tips. \n\nHer hair is 30 - 50 centimeters long and a regular spoon is enough for her mane.",
            "author": "theycallmeponcho",
            "id": "cw0dfr2",
            "parent_id": "t1_cvn1qnd",
            "score": 2,
            "created_utc": 1444888236.0,
            "replies": []
        },
        {
            "body": "I just googled local barbershops and looked for websites and usually they had photos of their work.",
            "author": "VerseForYou",
            "id": "cwfdo3c",
            "parent_id": "t1_cwez51e",
            "score": 1,
            "created_utc": 1445996805.0,
            "replies": [
                {
                    "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
                    "author": "fonzi786",
                    "id": "cwfgy8h",
                    "parent_id": "t1_cwfdo3c",
                    "score": 2,
                    "created_utc": 1446001847.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahh I feel you. I feel like there's not many good barbers here in vancouver. They must be hiding!",
            "author": "fonzi786",
            "id": "cwfgy8h",
            "parent_id": "t1_cwfdo3c",
            "score": 2,
            "created_utc": 1446001847.0,
            "replies": []
        }
    ]
}