{
    "title": "Update 3 - Wheelie girl - I survived",
    "post_id": "12ry5ej",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/12ry5ej/update_3_wheelie_girl_i_survived/",
    "author": "Bartise_",
    "body": "[Previous date 2](https://www.reddit.com/r/sugarlifestyleforum/comments/12jqg1w/update_to_wheelie_girl_what_is_peen/)\n\nDate 3 was last night. I debated posting this because it’s a little embarrassing,,,but I have too many Reddit followers I don’t want to let down. \n\nTexted Wheelie Girl (WG) to setup another date. I picked a different restaurant from 2nd date’s embarrassing moment,,,this time was Asian fusion. I also texted WG “If you feel comfortable I can make a hotel reservation nearby for continuation of our date. You can stay the night if easier for you.” \n\nWG says “Alllllrighty. Can you bring Vizzys too?” I don’t know what she’s talking about so I google it,,don’t know if that’s a yes either. \n\nNext day we meet at restaurant,,she looks cute wearing a dress. She also wore the bulky black shoes with yellow stitching that looks orthopedic. Maybe she has foot problems,,,that’s why she wears these and wheelies?\n\nDinner was nice and good food but no perverted outbursts this time. So after dinner we walk back to the hotel and I tell her the Vizzys are on ice. But I didn’t know which flavors she liked so I got raspberry-tangerine and watermelon. She said “womp womp my favorite is peach-lemonade,, but that’s ok,, thank you for getting them and for dinner.” Then she gives me a long sloppy kiss while waiting for the crosswalk. During the kiss, I think to myself “i don’t know anyone who says womp womp,,,is this millennial lingo or just wheelie girl lingo?”\n\nWe drank Vizzys in the room and had fun. I won’t get into sexual details but we had a great time. After sex we were exhausted and WG was laying on top of me,her head on my round mountain stomach. She says “I heard when the penis is soft you can twist it 360 degrees,,can I try?” Before I can answer she takes the little guy and twists it. It didn’t hurt but didn’t feel comfortable so I tell her that’s enough. She turns her head and gives me this very pouty look so I felt bad and tell her “fine, keep doing it”. \n\nLater when time to sleep WG didn’t bring a toothbrush so I said I will go buy one at the drugstore. She said it’s ok, it’s too late she will just use mine!! I never shared toothbrush before but next time I will bring extra one. Do I throw away the toothbrush or save it? Sooooo 3rd date wasn’t crazy but still weird.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/12ry5ej/update_3_wheelie_girl_i_survived/",
    "score": 190,
    "upvote_ratio": 0.95,
    "created_utc": 1681918446.0,
    "num_comments": 164,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/12jqg1w/update_to_wheelie_girl_what_is_peen/"
        ]
    ],
    "comments": [
        {
            "body": "I’ve been waiting in anticipation for this update 😂 She’s definitely very eccentric but I’m glad she also seems genuine and sweet.",
            "author": "Empressofthemall",
            "id": "jgw56gu",
            "parent_id": "t3_12ry5ej",
            "score": 110,
            "created_utc": 1681919035.0,
            "replies": []
        },
        {
            "body": "Ah, the wondrous freedom of a mindset that would tell you to bring Vizzys, and she has a favorite flavor, but she's not going to tell you she has a favorite flavor or what it is.  I can't imagine what it must be like for your mind to be free of such encumbrances.  Share your toothbrush level freedom, that is next level  🤣🤣🤣",
            "author": "Azurecole",
            "id": "jgw6322",
            "parent_id": "t3_12ry5ej",
            "score": 101,
            "created_utc": 1681919389.0,
            "replies": [
                {
                    "body": "Lmao this is the perfect response",
                    "author": "MorganDax",
                    "id": "jgx7e4y",
                    "parent_id": "t1_jgw6322",
                    "score": 10,
                    "created_utc": 1681933833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Orthopaedic? Are you talking about doc martens ? 😂😂😂\n\nAlso wtf is a vizzy is it yummy",
            "author": "Sugarintheorange",
            "id": "jgw8lc9",
            "parent_id": "t3_12ry5ej",
            "score": 83,
            "created_utc": 1681920373.0,
            "replies": [
                {
                    "body": "no literally... when i got to that part i was like now i am slightly doubting all the other judgements about poor WG. \n\ndocs are popular, i could see them [dressing down a skirt](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRON-SJ4kKyq0CqDEbzt6FJ_DNQVi41GOlFBA&usqp=CAU) if ur not a total girlie girl. also ironic that you confused them for orthopedics, they famously make your feet ache when breaking them in.",
                    "author": "simply_unaffected",
                    "id": "jgxng8z",
                    "parent_id": "t1_jgw8lc9",
                    "score": 31,
                    "created_utc": 1681939953.0,
                    "replies": [
                        {
                            "body": "leather bomber, dress, boots 💯",
                            "author": "xa3D",
                            "id": "jgxq7kb",
                            "parent_id": "t1_jgxng8z",
                            "score": 11,
                            "created_utc": 1681941060.0,
                            "replies": [
                                {
                                    "body": "Had an ex who dressed this way.",
                                    "author": "BigBearSD",
                                    "id": "jgzt4uj",
                                    "parent_id": "t1_jgxq7kb",
                                    "score": 3,
                                    "created_utc": 1681983566.0,
                                    "replies": [
                                        {
                                            "body": ">Had an ex who dressed this way.\n\nMe too, but I was 18 at the time (early 1980s).  Not since then though.\n\nIn some ways though, that is more the sort of look I'd definitely go for in an SB nowadays - recreating my youth.",
                                            "author": "HecatesCats",
                                            "id": "jh1rh4y",
                                            "parent_id": "t1_jgzt4uj",
                                            "score": 1,
                                            "created_utc": 1682017085.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "tbf they do kinda look like those old people shoes with thick soles and stitching, my grandpa has some 💀",
                            "author": "strawb3rry-sh0rtcake",
                            "id": "jh1s193",
                            "parent_id": "t1_jgxng8z",
                            "score": 2,
                            "created_utc": 1682017310.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Vizzy's are SO good! They're like the new White Claws, I like them a lot.",
                    "author": "coffeebeanbookgal",
                    "id": "jgwdqd3",
                    "parent_id": "t1_jgw8lc9",
                    "score": 12,
                    "created_utc": 1681922368.0,
                    "replies": [
                        {
                            "body": "I’ve never had a white claw either. Have to try both of these",
                            "author": "Sugarintheorange",
                            "id": "jgwfobg",
                            "parent_id": "t1_jgwdqd3",
                            "score": 6,
                            "created_utc": 1681923121.0,
                            "replies": [
                                {
                                    "body": "11/10 Recommend, they're pretty low on the alcohol content itself, but it's in a can that fits perfectly in the hand and is super popular on college campuses (I've got Vizzys and White Claws in my apartment at all times for spontaneous get-togethers).",
                                    "author": "coffeebeanbookgal",
                                    "id": "jgwfx61",
                                    "parent_id": "t1_jgwfobg",
                                    "score": 8,
                                    "created_utc": 1681923214.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Can confirm, I love the watermelon flavor",
                            "author": "Myrtle_Snow333",
                            "id": "jgybx6d",
                            "parent_id": "t1_jgwdqd3",
                            "score": 2,
                            "created_utc": 1681950544.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That was my thought. It's kind of a normalish look in my area to wear Doc Martens with a cute, semi formal dress to kind of dress it down a little. Now I'm feeling self conscious.",
                    "author": "grimoiregirl",
                    "id": "jgyg2ju",
                    "parent_id": "t1_jgw8lc9",
                    "score": 10,
                    "created_utc": 1681952387.0,
                    "replies": []
                },
                {
                    "body": "I also immediately thought of doc martens",
                    "author": "Kozmicbunny",
                    "id": "jgzi0rh",
                    "parent_id": "t1_jgw8lc9",
                    "score": 6,
                    "created_utc": 1681973599.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgw8um0",
                    "parent_id": "t1_jgw8lc9",
                    "score": 3,
                    "created_utc": 1681920473.0,
                    "replies": [
                        {
                            "body": "There are times when I really step back and appreciate the generational divide in sugar relationships. I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol! I love this",
                            "author": "SETXBrit",
                            "id": "jgwhe2d",
                            "parent_id": "t1_jgw8um0",
                            "score": 76,
                            "created_utc": 1681923786.0,
                            "replies": [
                                {
                                    "body": "> I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol!\n\nThis is something I really don't get.  I guess he's in the US and probably back in the day DMs weren't a thing there?\n\nI certainly remember saving up for a pair of DMs when I had a Saturday job at Sainsbury's back in the early 80s.",
                                    "author": "HecatesCats",
                                    "id": "jgxbqz4",
                                    "parent_id": "t1_jgwhe2d",
                                    "score": 13,
                                    "created_utc": 1681935475.0,
                                    "replies": [
                                        {
                                            "body": "DMs have been a thing on this side of the pond  since the 80s too 😊",
                                            "author": "mrssmithsshoes",
                                            "id": "jgzu3pu",
                                            "parent_id": "t1_jgxbqz4",
                                            "score": 8,
                                            "created_utc": 1681984405.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "right I am crying this is so good haha… so pure 😭😆🙌🏼",
                                    "author": "strawb3rry-sh0rtcake",
                                    "id": "jh1s617",
                                    "parent_id": "t1_jgwhe2d",
                                    "score": 2,
                                    "created_utc": 1682017364.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "They’re like boots but they also make sandals and like shoes that cut off before the ankle. The yellow stitching makes me think it’s probably those 😂",
                            "author": "Sugarintheorange",
                            "id": "jgw96db",
                            "parent_id": "t1_jgw8um0",
                            "score": 14,
                            "created_utc": 1681920601.0,
                            "replies": []
                        },
                        {
                            "body": "They are indeed more than likely Doc Martens...the yellow stiching is a signature of theirs.",
                            "author": "ShaArt5",
                            "id": "jgwf7gn",
                            "parent_id": "t1_jgw8um0",
                            "score": 10,
                            "created_utc": 1681922940.0,
                            "replies": []
                        },
                        {
                            "body": "It does sound like Dr Martens.  Here is what they look like:-\n\nhttps://www.drmartens.com/uk/en_gb/womens/c/01000000\n\nThe brand was very big from the 1970s-1990s.  Not so much nowadays, it's quite a bit more niche these days.",
                            "author": "HecatesCats",
                            "id": "jgwewyx",
                            "parent_id": "t1_jgw8um0",
                            "score": 8,
                            "created_utc": 1681922824.0,
                            "replies": [
                                {
                                    "body": "Docs are IN right now. Super popular.",
                                    "author": "coffeebeanbookgal",
                                    "id": "jgwfjef",
                                    "parent_id": "t1_jgwewyx",
                                    "score": 26,
                                    "created_utc": 1681923067.0,
                                    "replies": [
                                        {
                                            "body": "docs have really always been in. IMO.",
                                            "author": "sdsf9",
                                            "id": "jgxlv7p",
                                            "parent_id": "t1_jgwfjef",
                                            "score": 16,
                                            "created_utc": 1681939330.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "jgwf3t6",
                                    "parent_id": "t1_jgwewyx",
                                    "score": 7,
                                    "created_utc": 1681922899.0,
                                    "replies": [
                                        {
                                            "body": "No they’re still super popular",
                                            "author": "Sugarintheorange",
                                            "id": "jgwfln2",
                                            "parent_id": "t1_jgwf3t6",
                                            "score": 28,
                                            "created_utc": 1681923091.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Not at all. My sis is 21, and she has been harassing us to buy her docs since she was 15. They are super popular with the athletic baddies.",
                                            "author": "AdBot_1443",
                                            "id": "jgwvnql",
                                            "parent_id": "t1_jgwf3t6",
                                            "score": 12,
                                            "created_utc": 1681929327.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It’s popular with an indie crowd and I know lots of people on TikTok who love these shoes. I wouldn’t say outdated.",
                                            "author": "cottagewitchpet",
                                            "id": "jgwfmnm",
                                            "parent_id": "t1_jgwf3t6",
                                            "score": 10,
                                            "created_utc": 1681923103.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I bought an early 20s SB a pair in the past.",
                                            "author": "Downtown_Astronauts",
                                            "id": "jgx4un7",
                                            "parent_id": "t1_jgwf3t6",
                                            "score": 5,
                                            "created_utc": 1681932870.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">Yes those are the ones. So she is outdated?\n\nNo, I guess it may be more that they have been \"rediscovered\".\n\nAs /u/Sugarintheorange /u/cottagewitchpet /u/coffeebeanbookgal and /u/AdBot_1443 refer to, they are still popular to a certain extent.  But it certainly isn't as mainstream as it used to be 30 or 40 years ago.  Dr Martens (or DMs) really are a lot more niche than they ever used to be.\n\nBack in the 1970s, 80s and 90s this brand was very much mainstream, from punks to skinheads to goths (and very male).  Not many girls wore this brand at all.\n\nBack in the day it was all about the boots.  Going right up to the 14 eye black or oxblood boots.\n\nDMs have been popular since the 1960s.  Here in the 1960s are [skinheads v hippies](https://imgur.com/a/rH29wVy).  This carried on into the 70s, 80s and 90s.\n\nAlthough [some girls did embrace the look back then as well](https://imgur.com/a/TnmcOvg)\n\nFrom then, of course, it moved on to [punk](https://imgur.com/a/HI2HGjI)\n\nWhen that photo was taken above I was 18 and my then girlfriend looked quite a lot like the blonde girl sitting on the right of the photo.\n\nOf course back then in high school, we weren't allowed to wear boots so, what are now called their \"1461 smooth leather oxford shoes\", were popular among boys in high school.\n\nThe popularity of DMs has really dropped off since the late 1990s/ early 2000s.  They used to be really quite mainstream amongst a lot of working class young men, based on music and cultural links, but that has more or less gone away now.\n\nSince then they have seen something of a resurgance as a bit of a niche fashion brand but nothing like the cultural icon they used to be 30 or 40 years ago.\n\nJust as an aside, there is another brand - Solovair - that essentially make the same product as DM (in fact, they literally did make DMs from the 1950s to the 1980s) but now the two companies have gone their own way and DM manufactures shoes in Thailand but Solovair still manufactures in the UK.  If you google something like \"Solovair v Dr Marten\" you'll see that there is a heated debate online as to which company produces the best boots.",
                                            "author": "HecatesCats",
                                            "id": "jgxazf8",
                                            "parent_id": "t1_jgwf3t6",
                                            "score": 6,
                                            "created_utc": 1681935181.0,
                                            "replies": [
                                                {
                                                    "body": "When I was working in a mall in the early 00s, doc martens were super popular and every girl coveted a pair in a bright color or floral pattern, they seem like they'd be close to due for a comeback based on the trend cycle.",
                                                    "author": "grimoiregirl",
                                                    "id": "jgygf6x",
                                                    "parent_id": "t1_jgxazf8",
                                                    "score": 5,
                                                    "created_utc": 1681952543.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love Wheelie Girl ❤️",
            "author": "AtticusFinchLover",
            "id": "jgw9eja",
            "parent_id": "t3_12ry5ej",
            "score": 53,
            "created_utc": 1681920692.0,
            "replies": [
                {
                    "body": "Me tooooo!!!❤️",
                    "author": "Necessary_Tart3108",
                    "id": "jh4hbpw",
                    "parent_id": "t1_jgw9eja",
                    "score": 2,
                    "created_utc": 1682069154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I frequently, emphatically use the “womp womp”onomatopoeia like I’m the freaking sound guy on Let’s Make a Deal. \n\nAt least she didn’t use that sound effect during sex *am I right ladies?*",
            "author": "sugarbrulee",
            "id": "jgwix2h",
            "parent_id": "t3_12ry5ej",
            "score": 36,
            "created_utc": 1681924384.0,
            "replies": [
                {
                    "body": "Resisting the urge to make a Zoidburg sound as the 🐔 flops around",
                    "author": "AdBot_1443",
                    "id": "jgwvvah",
                    "parent_id": "t1_jgwix2h",
                    "score": 13,
                    "created_utc": 1681929410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I still think shes a keeper 😁",
            "author": "Upper-District-50",
            "id": "jgw4rs2",
            "parent_id": "t3_12ry5ej",
            "score": 31,
            "created_utc": 1681918873.0,
            "replies": []
        },
        {
            "body": "Yeah - after an evening of carnal delights, sharing a toothbrush is a deal breaker.  /s",
            "author": "Harpua1",
            "id": "jgw6dmt",
            "parent_id": "t3_12ry5ej",
            "score": 29,
            "created_utc": 1681919504.0,
            "replies": [
                {
                    "body": "This is always weird to me. Like, sure I'll shove my tongue down your throat and lick your bootyhole but a toothbrush that's rinsed off multiple times between uses? Gross!!!",
                    "author": "JemimaQuackers",
                    "id": "jgw7igi",
                    "parent_id": "t1_jgw6dmt",
                    "score": 45,
                    "created_utc": 1681919948.0,
                    "replies": [
                        {
                            "body": "I mean she stuck his toothbrush in her mouth?! Does he know her mouth has been?!\n\nOh wait. Yes, he does. Nevermind.",
                            "author": "BinghamtonSD",
                            "id": "jgwat5b",
                            "parent_id": "t1_jgw7igi",
                            "score": 24,
                            "created_utc": 1681921239.0,
                            "replies": [
                                {
                                    "body": "😅🤣",
                                    "author": "ShaArt5",
                                    "id": "jgwfdti",
                                    "parent_id": "t1_jgwat5b",
                                    "score": 7,
                                    "created_utc": 1681923008.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "& slathered with chemicals hahahah",
                            "author": "xxemberraexx",
                            "id": "jgxd5wm",
                            "parent_id": "t1_jgw7igi",
                            "score": 4,
                            "created_utc": 1681936006.0,
                            "replies": []
                        },
                        {
                            "body": "LMAOOO...the pictures in my brain...I'm DYING of laughter...🤣🤣🤣",
                            "author": "ShaArt5",
                            "id": "jgwfc5b",
                            "parent_id": "t1_jgw7igi",
                            "score": 6,
                            "created_utc": 1681922991.0,
                            "replies": []
                        },
                        {
                            "body": "Lol came here to say exactly this",
                            "author": "timothee2023",
                            "id": "jgyyk40",
                            "parent_id": "t1_jgw7igi",
                            "score": 3,
                            "created_utc": 1681960865.0,
                            "replies": []
                        },
                        {
                            "body": "Haha exactly… though tbf, I usually do throw the toothbrush away the next day if we’ve been sharing but I have like a dozen toothbrushes in the bathroom drawer at home pretty much always. Either way, no big deal.",
                            "author": "Immediate_Cabinet725",
                            "id": "jgxlqwj",
                            "parent_id": "t1_jgw7igi",
                            "score": 2,
                            "created_utc": 1681939283.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the content I'm here for. Ask her if she has a sister 😂",
            "author": "wtfamidoinghere4829",
            "id": "jgwbvcg",
            "parent_id": "t3_12ry5ej",
            "score": 26,
            "created_utc": 1681921649.0,
            "replies": []
        },
        {
            "body": "I think I’m into Wheelie Girl. You guys up for a 3some?",
            "author": "SexxxyBunny",
            "id": "jgwd8vr",
            "parent_id": "t3_12ry5ej",
            "score": 22,
            "created_utc": 1681922184.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgxz686",
                    "parent_id": "t1_jgwd8vr",
                    "score": 3,
                    "created_utc": 1681944874.0,
                    "replies": [
                        {
                            "body": "We can talk. Send me a message. But don’t send me a pic unless she agrees that she’s into it.",
                            "author": "SexxxyBunny",
                            "id": "jgxznp0",
                            "parent_id": "t1_jgxz686",
                            "score": 7,
                            "created_utc": 1681945085.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you just question if she has foot problems bc she wore doc martens 😂😂",
            "author": "_wowmeow_",
            "id": "jgx3ars",
            "parent_id": "t3_12ry5ej",
            "score": 17,
            "created_utc": 1681932279.0,
            "replies": [
                {
                    "body": "underrated comment, when he said that I thought bwomp bwomp",
                    "author": "mayorofny",
                    "id": "jgywvov",
                    "parent_id": "t1_jgx3ars",
                    "score": 2,
                    "created_utc": 1681960007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So I'm mid-40s and I say \"womp womp\" to express disappointment. Or make a noise like the sad trombone from The Price Is Right",
            "author": "BinghamtonSD",
            "id": "jgw9uld",
            "parent_id": "t3_12ry5ej",
            "score": 36,
            "created_utc": 1681920865.0,
            "replies": [
                {
                    "body": "This^",
                    "author": "wtfamidoinghere4829",
                    "id": "jgwbxcl",
                    "parent_id": "t1_jgw9uld",
                    "score": 10,
                    "created_utc": 1681921670.0,
                    "replies": []
                },
                {
                    "body": "Ditto",
                    "author": "Immediate_Cabinet725",
                    "id": "jgxlv4p",
                    "parent_id": "t1_jgw9uld",
                    "score": 3,
                    "created_utc": 1681939329.0,
                    "replies": []
                },
                {
                    "body": "+1",
                    "author": "timothee2023",
                    "id": "jgyzpdi",
                    "parent_id": "t1_jgw9uld",
                    "score": 3,
                    "created_utc": 1681961469.0,
                    "replies": []
                },
                {
                    "body": "As a millenial, womp womp sounds like a lewd vtuber that sometimes gets suggested on my clips/shorts feed while i browse gaming clips.",
                    "author": "xa3D",
                    "id": "jgxqgdx",
                    "parent_id": "t1_jgw9uld",
                    "score": 3,
                    "created_utc": 1681941159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How old is she??  This is not millennial behavior IMO. GenZ on the other hand….",
            "author": "Rich-Painting5135",
            "id": "jgwyld0",
            "parent_id": "t3_12ry5ej",
            "score": 13,
            "created_utc": 1681930473.0,
            "replies": [
                {
                    "body": "That’s what I was thinking, because I def had my own pair of wheelies. 😂😂",
                    "author": "MilaniAmara99",
                    "id": "jgy9jjq",
                    "parent_id": "t1_jgwyld0",
                    "score": 2,
                    "created_utc": 1681949498.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup...young people do indeed say womp womp sometimes...lollll! She sounds adorable...😁",
            "author": "ShaArt5",
            "id": "jgwf1eb",
            "parent_id": "t3_12ry5ej",
            "score": 13,
            "created_utc": 1681922872.0,
            "replies": []
        },
        {
            "body": "Team Wheelie !!!",
            "author": "Babosathaa",
            "id": "jgwg0h2",
            "parent_id": "t3_12ry5ej",
            "score": 14,
            "created_utc": 1681923250.0,
            "replies": [
                {
                    "body": "yes, team wheelie! but I feel like she could do better with somebody who appreciates her",
                    "author": "mayorofny",
                    "id": "jgyx12x",
                    "parent_id": "t1_jgwg0h2",
                    "score": 7,
                    "created_utc": 1681960082.0,
                    "replies": [
                        {
                            "body": "Exactly. He’s the one out of touch.",
                            "author": "SignatureOk1022",
                            "id": "jgzjwn4",
                            "parent_id": "t1_jgyx12x",
                            "score": 2,
                            "created_utc": 1681975192.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So maybe WG is a long lost cousin, because when I’m slightly bored and really comfortable with a guy, I entertain myself by flipping his flaccid penis around. What can I say, the movement is hilarious!",
            "author": "Spoilme93",
            "id": "jgwgwn7",
            "parent_id": "t3_12ry5ej",
            "score": 14,
            "created_utc": 1681923597.0,
            "replies": [
                {
                    "body": "This! And squish it and bend it and see all the ways I can play with it without getting it hard... each time it starts getting hard! Is very entertaining 😅😁🤣",
                    "author": "desiderataJa",
                    "id": "jgyl63x",
                    "parent_id": "t1_jgwgwn7",
                    "score": 6,
                    "created_utc": 1681954658.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve been following this adventure and it’s sounds simultaneously crazy and fun as hell",
            "author": "FortuneUnusual3157",
            "id": "jgw9tqu",
            "parent_id": "t3_12ry5ej",
            "score": 11,
            "created_utc": 1681920856.0,
            "replies": []
        },
        {
            "body": "She's my girlcrush!\n\nGive her mismatched socks for her amazing footwear - she'll love it!\nhttps://www.happysocks.com/uk/collection/rock-your-socks",
            "author": "FructoseLady",
            "id": "jgwlglk",
            "parent_id": "t3_12ry5ej",
            "score": 10,
            "created_utc": 1681925367.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgwm60x",
                    "parent_id": "t1_jgwlglk",
                    "score": 4,
                    "created_utc": 1681925638.0,
                    "replies": [
                        {
                            "body": "💔\nI bet it's a fashion statement though! Mismatched earrings would probably work too - just pick a pair and said you thought of her 🥰",
                            "author": "FructoseLady",
                            "id": "jgwrhr6",
                            "parent_id": "t1_jgwm60x",
                            "score": 8,
                            "created_utc": 1681927683.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is pure gold 🙏. She's a keeper",
            "author": "ClassicAd3873",
            "id": "jgw4mvd",
            "parent_id": "t3_12ry5ej",
            "score": 10,
            "created_utc": 1681918818.0,
            "replies": []
        },
        {
            "body": "I’m gonna steal your girl.  @sexxxybunny, want to team up?",
            "author": "Murderousbonesfile",
            "id": "jgwe91h",
            "parent_id": "t3_12ry5ej",
            "score": 11,
            "created_utc": 1681922568.0,
            "replies": [
                {
                    "body": "I would but I generally stay away from people with derivatives of “murder” in their screen name. 😂😂😂😂",
                    "author": "SexxxyBunny",
                    "id": "jgx263u",
                    "parent_id": "t1_jgwe91h",
                    "score": 13,
                    "created_utc": 1681931859.0,
                    "replies": [
                        {
                            "body": "But seriously. Can we throw a party in her honor.  Rent out a club, charge (SD's) 100 at the door, SB's free entry, any SD flying in must also get airfare for an SB to fly in, we'll have like 100 people there, she won't know what's up except OP must insist she wear her heelies, and then we're all like \"surprise\" and start serenading her and/or start a mass orgy.",
                            "author": "DisposableDextrose",
                            "id": "jgz5p3s",
                            "parent_id": "t1_jgx263u",
                            "score": 6,
                            "created_utc": 1681964841.0,
                            "replies": [
                                {
                                    "body": "It sounds like you just planned the First Annual SLF M&G✨",
                                    "author": "Jewels_Gems",
                                    "id": "jh4464t",
                                    "parent_id": "t1_jgz5p3s",
                                    "score": 4,
                                    "created_utc": 1682057748.0,
                                    "replies": [
                                        {
                                            "body": "This has already happened.",
                                            "author": "sugarintherawr",
                                            "id": "ji4syea",
                                            "parent_id": "t1_jh4464t",
                                            "score": 0,
                                            "created_utc": 1682732899.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wheelie girl is insurmountably the raddest chick. I hope you see her again!",
            "author": "catsandcappuccinos",
            "id": "jgx7wsa",
            "parent_id": "t3_12ry5ej",
            "score": 14,
            "created_utc": 1681934024.0,
            "replies": []
        },
        {
            "body": "I never heard that thing about the penis nor would I dream of trying it so go wheelie girl!\n\nShe's off the wall that's for sure but she sounds like a lot of fun.\nAppreciate the update- I'm definitely following the saga",
            "author": "SnooStories6031",
            "id": "jgw8car",
            "parent_id": "t3_12ry5ej",
            "score": 7,
            "created_utc": 1681920274.0,
            "replies": []
        },
        {
            "body": "She’s definitely a character. Love that she’s authentic to herself. Hate that she used your toothbrush.",
            "author": "Ill_Selection_8266",
            "id": "jgwlfma",
            "parent_id": "t3_12ry5ej",
            "score": 6,
            "created_utc": 1681925356.0,
            "replies": []
        },
        {
            "body": "> I heard when the penis is soft you can twist it 360 degrees,,can I try?\n\nReading this on the throne, had to try this myself ...\n\nAnd then I was thinking about the toothbrush thing .... Tons of people use their phone while on the toilet and no one questions cleanliness when using other people's phones 🤣 The dirtiest things are money, dish washing sponges, and phones!",
            "author": "whatever-tata",
            "id": "jgy1mbr",
            "parent_id": "t3_12ry5ej",
            "score": 7,
            "created_utc": 1681945957.0,
            "replies": [
                {
                    "body": "If I had one I’m positive I’d never leave it alone, and the audio track from the bop-it commercial would constantly be rolling through my brain 😂",
                    "author": "BeautyBaby247",
                    "id": "jgyd75u",
                    "parent_id": "t1_jgy1mbr",
                    "score": 4,
                    "created_utc": 1681951109.0,
                    "replies": [
                        {
                            "body": "omg fucking bop it 😂😂😂😂",
                            "author": "sugarintherawr",
                            "id": "ji4t9wo",
                            "parent_id": "t1_jgyd75u",
                            "score": 1,
                            "created_utc": 1682733053.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is great stuff. Thanks for sharing. I am starting to fall for WG",
            "author": "Teejaynj",
            "id": "jgy2rbv",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681946465.0,
            "replies": []
        },
        {
            "body": "I'm eagerly awaiting hubby's arrival home from work, because the 360° thing is hilarious and I'm curious. \n\nI do know that when they're hard, you can launch Cheerios at their face with it.",
            "author": "Uranusspinssideways",
            "id": "jgy38zr",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681946681.0,
            "replies": [
                {
                    "body": "A penile trebuchet??!!! Omg. I need to try this!!!",
                    "author": "desiderataJa",
                    "id": "jgym42r",
                    "parent_id": "t1_jgy38zr",
                    "score": 4,
                    "created_utc": 1681955081.0,
                    "replies": []
                },
                {
                    "body": "UPDATE!!\n\n&#x200B;\n\nYou can, indeed, turn a soft penis 360 degrees.\n\n&#x200B;\n\nHubby was not amused.\n\n&#x200B;\n\n(But I was)",
                    "author": "Uranusspinssideways",
                    "id": "ji9pydv",
                    "parent_id": "t1_jgy38zr",
                    "score": 2,
                    "created_utc": 1682829345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are tragically (and comically) unhip. I’m in my fifties and know about the sights, sounds, and clothes of the 20-some generation. Lean in, she’s good for you!",
            "author": "LordWildmore",
            "id": "jgxl3kq",
            "parent_id": "t3_12ry5ej",
            "score": 11,
            "created_utc": 1681939030.0,
            "replies": []
        },
        {
            "body": "Sounds like Vizzy girl is wild, keep the toothbrush because she sounds like a keeper.",
            "author": "coffeebeanbookgal",
            "id": "jgw7rz4",
            "parent_id": "t3_12ry5ej",
            "score": 6,
            "created_utc": 1681920050.0,
            "replies": []
        },
        {
            "body": "I love you and Wheelie Girl so much😂😂",
            "author": "AdBot_1443",
            "id": "jgwvam3",
            "parent_id": "t3_12ry5ej",
            "score": 4,
            "created_utc": 1681929179.0,
            "replies": []
        },
        {
            "body": "Wheelie girl is the girl this movie is ABOUT, man. \n\nAlso, I saw womp womp but I got it from a line in Steven Universe.",
            "author": "dontkillmejustkinkme",
            "id": "jgybwm4",
            "parent_id": "t3_12ry5ej",
            "score": 6,
            "created_utc": 1681950537.0,
            "replies": []
        },
        {
            "body": "TIL vizzys\n\nThis is the best thing on Reddit. \n\nIf only WC knew she was famous. \n\nShe seems so quirky. Just love it.\n\nShe’s got a holly go lightly on acid vibe.",
            "author": null,
            "id": "jgyo0sj",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681955912.0,
            "replies": []
        },
        {
            "body": "When do we get to see pics? 🤷🏽‍♂️",
            "author": "hpygilmr",
            "id": "jgwbeot",
            "parent_id": "t3_12ry5ej",
            "score": 10,
            "created_utc": 1681921469.0,
            "replies": [
                {
                    "body": "Ooh yes!!! Although telling her she has a following when he is gaining consent will likely lead her here and he will lose his advice source?",
                    "author": "desiderataJa",
                    "id": "jgyloha",
                    "parent_id": "t1_jgwbeot",
                    "score": 4,
                    "created_utc": 1681954888.0,
                    "replies": [
                        {
                            "body": "This is true, so he can either blur her face out and not tell her, or he can tell her he has some friends who would like to see what she looks like 🤷🏽‍♂️",
                            "author": "hpygilmr",
                            "id": "jh605w2",
                            "parent_id": "t1_jgyloha",
                            "score": 2,
                            "created_utc": 1682096796.0,
                            "replies": [
                                {
                                    "body": "That's a good way around it :)",
                                    "author": "desiderataJa",
                                    "id": "jh7o4b4",
                                    "parent_id": "t1_jh605w2",
                                    "score": 1,
                                    "created_utc": 1682122547.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yesss ! 🙋‍♀️",
                    "author": "Own-Ad6334",
                    "id": "jgwgcr2",
                    "parent_id": "t1_jgwbeot",
                    "score": 3,
                    "created_utc": 1681923382.0,
                    "replies": []
                },
                {
                    "body": "Upvote sooooo hard!",
                    "author": "wtfamidoinghere4829",
                    "id": "jgwi0m7",
                    "parent_id": "t1_jgwbeot",
                    "score": 4,
                    "created_utc": 1681924031.0,
                    "replies": [
                        {
                            "body": "More upvotes for seeing pics!",
                            "author": "BinghamtonSD",
                            "id": "jgxadh6",
                            "parent_id": "t1_jgwi0m7",
                            "score": 4,
                            "created_utc": 1681934952.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let this ride as long as it can. Celebrate those who march to their own drummer.",
            "author": "StealyMissile",
            "id": "jgx3dqk",
            "parent_id": "t3_12ry5ej",
            "score": 8,
            "created_utc": 1681932309.0,
            "replies": [
                {
                    "body": "I was going to comment along the same line, I love that she is being 100% herself and rather than ditching her for her eccentricities he is like... well this is a ride... how do I not get bucked off?! 🤩🙌🫶👌🏼",
                    "author": "desiderataJa",
                    "id": "jgylfv0",
                    "parent_id": "t1_jgx3dqk",
                    "score": 3,
                    "created_utc": 1681954781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love her.",
            "author": "SDidiotUK",
            "id": "jgx17fl",
            "parent_id": "t3_12ry5ej",
            "score": 4,
            "created_utc": 1681931487.0,
            "replies": []
        },
        {
            "body": "& yes I also say womp womp hahaha I’m trying to replace fuck okay.",
            "author": "xxemberraexx",
            "id": "jgxclb8",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681935794.0,
            "replies": []
        },
        {
            "body": "re the toothbrush vibe ...   WG wouldn't have seen anything wrong, or gross about that ...\n\nWhether she's brushing her throat with your cock, or brushing her teeth with your toothbrush; its all the same - lit, sic*...\n\n*(Had to consult the *Urban Dictionary* to extract those expressions,  lmao)...",
            "author": "BeltnBrace",
            "id": "jgxr5cl",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681941441.0,
            "replies": []
        },
        {
            "body": "I still ❤️ her",
            "author": "TwerkingAvocado",
            "id": "jgy8dw2",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681948985.0,
            "replies": []
        },
        {
            "body": "I think you’re sugaring Luna Lovegood and I’m here for it ✌️😂❤️",
            "author": "RavingMaenad",
            "id": "jgyv7be",
            "parent_id": "t3_12ry5ej",
            "score": 4,
            "created_utc": 1681959176.0,
            "replies": [
                {
                    "body": "I was just thinking that! Love it",
                    "author": "Relative-Fuel7990",
                    "id": "jgzslti",
                    "parent_id": "t1_jgyv7be",
                    "score": 3,
                    "created_utc": 1681983103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She sounds amazing, you’re lucky.",
            "author": "Vast_Web_5827",
            "id": "jgwfsgh",
            "parent_id": "t3_12ry5ej",
            "score": 7,
            "created_utc": 1681923165.0,
            "replies": [
                {
                    "body": "😂 I think he can find a normal SB he likes.",
                    "author": "Own-Ad6334",
                    "id": "jgwgf3j",
                    "parent_id": "t1_jgwfsgh",
                    "score": 0,
                    "created_utc": 1681923408.0,
                    "replies": [
                        {
                            "body": "Wheelie Girl reminds me of those movies where the straight laced non spicy food loving conventional guy falls in love with the type of woman who challenges his preferences. I think OP will eventually grow to quite like WG, and he’ll expand his world hanging out with her.",
                            "author": "Empressofthemall",
                            "id": "jgwo1g2",
                            "parent_id": "t1_jgwgf3j",
                            "score": 14,
                            "created_utc": 1681926348.0,
                            "replies": [
                                {
                                    "body": "the manic pixie girl trope\n\nkinda hate it bc in many such films the manic pixie girl character has no purpose or identity whatsoever except to help the protagonist along, and people don't work that way.  Just make her an actual mythical sexy fairy not a person why don't they?\n\nsorry for the tangential rant haha",
                                    "author": "Gemini-Fox",
                                    "id": "jgx9gug",
                                    "parent_id": "t1_jgwo1g2",
                                    "score": 8,
                                    "created_utc": 1681934613.0,
                                    "replies": [
                                        {
                                            "body": "💚",
                                            "author": "sugarintherawr",
                                            "id": "ji4tftp",
                                            "parent_id": "t1_jgx9gug",
                                            "score": 1,
                                            "created_utc": 1682733129.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What is “normal”?\n\nWheelie girl is an inspiration to all sb’s. \n\nIt’s so weird that people are scared to be authentic. I’d never want a sd who didn’t adore my silly behaviors or try to change me. \n\nIf he wants a vanilla Vanessa then so be it, his loss. \n\nWomp womp",
                            "author": "Vast_Web_5827",
                            "id": "jgwhgxe",
                            "parent_id": "t1_jgwgf3j",
                            "score": 20,
                            "created_utc": 1681923818.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "jgwgq1f",
                            "parent_id": "t1_jgwgf3j",
                            "score": 2,
                            "created_utc": 1681923525.0,
                            "replies": [
                                {
                                    "body": "Absolutely! 👽",
                                    "author": "Own-Ad6334",
                                    "id": "jgwh60g",
                                    "parent_id": "t1_jgwgq1f",
                                    "score": 1,
                                    "created_utc": 1681923697.0,
                                    "replies": [
                                        {
                                            "body": "Side-EYE. 'Abnormal' is what some people like.",
                                            "author": "coffeebeanbookgal",
                                            "id": "jgwhkwh",
                                            "parent_id": "t1_jgwh60g",
                                            "score": 3,
                                            "created_utc": 1681923862.0,
                                            "replies": [
                                                {
                                                    "body": "Bombastic side-eye\n\nI’m definitely a manic pixie dream girl type of Sugarbaby myself. Lolololol",
                                                    "author": "Vast_Web_5827",
                                                    "id": "jgx2ooi",
                                                    "parent_id": "t1_jgwhkwh",
                                                    "score": 7,
                                                    "created_utc": 1681932056.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ewwwww NOT the toothbrush",
            "author": "Mayaxoxo000",
            "id": "jgw4prm",
            "parent_id": "t3_12ry5ej",
            "score": 7,
            "created_utc": 1681918850.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgwvnku",
            "parent_id": "t3_12ry5ej",
            "score": 8,
            "created_utc": 1681929325.0,
            "replies": [
                {
                    "body": "OP was cleearly not involved in the business world in the 90s and early 00s when Docs were THE go to for fresh out of high school/college intern types who couldn't yet afford the truly business attire wardrobe.",
                    "author": "WadingDeep",
                    "id": "jgx8txx",
                    "parent_id": "t1_jgwvnku",
                    "score": 2,
                    "created_utc": 1681934375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love all of this.",
            "author": "caffeinekink",
            "id": "jgwya45",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681930354.0,
            "replies": []
        },
        {
            "body": "Docs have been a thing since forever. Pretty timeless. They have been my go to for riding motorcycles since the 90s because they used to have a \"for life\" guarantee. If they couldn't fix them they would just replace them. They got rid of the guarantee, but they still honor it if you have a pair...or 3.\n\n[https://www.drmartens.com/us/en/](https://www.drmartens.com/us/en/)\n\nMay you and WG have a lot of fun for many moons.",
            "author": "Filledwithoysters",
            "id": "jgycsul",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681950934.0,
            "replies": []
        },
        {
            "body": "This is what I want my sugar adventures to be like. Not crazy but not vanilla",
            "author": "Wildebot34",
            "id": "jgycxob",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681950994.0,
            "replies": []
        },
        {
            "body": "Congrats, you’ve found a manic pixie dream girl.",
            "author": "NotAnEngineer287",
            "id": "jgx2558",
            "parent_id": "t3_12ry5ej",
            "score": 6,
            "created_utc": 1681931849.0,
            "replies": []
        },
        {
            "body": "😂😂 but why do I kinda love her? Unapologetically herself!",
            "author": "Ok-Butterscotch-5827",
            "id": "jgx7itb",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681933882.0,
            "replies": []
        },
        {
            "body": "Oh my days, I'm absolutely loving this, she seems like an angel, and someone I wish I could be, around my SD or POTS. The toothbrush thing does seem a little weird for me. \n\nThat said, I do hope you had a good time.",
            "author": "scabbehhhh",
            "id": "jgwksan",
            "parent_id": "t3_12ry5ej",
            "score": 5,
            "created_utc": 1681925109.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgwl1do",
                    "parent_id": "t1_jgwksan",
                    "score": 2,
                    "created_utc": 1681925205.0,
                    "replies": [
                        {
                            "body": "I'm not too sure, I myself find I can be weird at times, but that's the person who I am. On dates and meet ups I do try to hide it from them to not scare them away.\n\nIt seems as though from my point, she's very comfortable with you.",
                            "author": "scabbehhhh",
                            "id": "jgwlfx1",
                            "parent_id": "t1_jgwl1do",
                            "score": 4,
                            "created_utc": 1681925359.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She sounds refreshing and a good escape.",
            "author": "BishopSD",
            "id": "jgxh308",
            "parent_id": "t3_12ry5ej",
            "score": 4,
            "created_utc": 1681937483.0,
            "replies": []
        },
        {
            "body": "Any other SB’s googling “Wheelies” to see what kind of cute pair they might have and then being reminded that the brand was called Heely’s? 😂😂😂",
            "author": "SexxxyBunny",
            "id": "jgxwnvs",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681943791.0,
            "replies": [
                {
                    "body": "I actually bought a cute pink pair after I read the meet and greet story. Completely underrated for both fashion and fun. I had to google “wheelie shoes” 😂",
                    "author": "Empressofthemall",
                    "id": "jgxy86d",
                    "parent_id": "t1_jgxwnvs",
                    "score": 5,
                    "created_utc": 1681944467.0,
                    "replies": []
                },
                {
                    "body": "Lol. There’s an off brand called “Wheelies”. Sold on Amazon. 🤣🤣🤣",
                    "author": "SignatureOk1022",
                    "id": "jgzk6tx",
                    "parent_id": "t1_jgxwnvs",
                    "score": 3,
                    "created_utc": 1681975442.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are an amazing couple.",
            "author": "BigHands_JackKelly",
            "id": "jgx3ybq",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681932526.0,
            "replies": []
        },
        {
            "body": "Sounds like my ex!",
            "author": "ChildhoodOld5721",
            "id": "jgxk640",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681938667.0,
            "replies": []
        },
        {
            "body": "Hotels have free toothbrushes, call the front desk and they'll send one up for you",
            "author": "akos_beres",
            "id": "jgydica",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681951244.0,
            "replies": []
        },
        {
            "body": "She sounds like a cartoon character. So fun and carefree. I love her.",
            "author": "QueenSereneD",
            "id": "jgz1zcz",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681962702.0,
            "replies": []
        },
        {
            "body": "It keeps getting better 😂😂😂💓",
            "author": "hereyougococo",
            "id": "jgz4435",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681963906.0,
            "replies": []
        },
        {
            "body": "She sounds like a whole lot of fun. We engage in deep kissing,tongue, the whole works so why wouldn't we share a toothbrush?  You CAN rinse it out well before using it.",
            "author": "GSSD",
            "id": "jh0bjue",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681995585.0,
            "replies": []
        },
        {
            "body": "I just had to go back & read the other 2 dates 🤣🤣",
            "author": "Adorable_Scholar_713",
            "id": "jh0hr4s",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681998678.0,
            "replies": []
        },
        {
            "body": "Tooth brush is just gross imo, it’s used to get gunk and rotting food out of your teeth 🫣 but you sound like a very very patient man",
            "author": "redinwondrland",
            "id": "jh0l5mz",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682000243.0,
            "replies": []
        },
        {
            "body": "Can someone tell me what wheelies are, google just told me about the trick you can do on bikes n motorcycles 💀",
            "author": "DaWonderHamster",
            "id": "jh0lcx0",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682000330.0,
            "replies": []
        },
        {
            "body": "I'm obsessed with her, most POTs are such normies but she's just straight up bizarre. Saying she'll just use your toothbrush is INSANE though 😭",
            "author": "DaWonderHamster",
            "id": "jh0lmcb",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682000442.0,
            "replies": []
        },
        {
            "body": "Yes sir. I told you, adventure of a lifetime.",
            "author": "Roofin_dad",
            "id": "jh1294t",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682007074.0,
            "replies": []
        },
        {
            "body": "Shes just quirky. Either you re into it, or not. I think she sounds cool. The penis thing was weird though.",
            "author": "newportred100s",
            "id": "jh16z63",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682008938.0,
            "replies": []
        },
        {
            "body": "hahahahaha I am LIVING for these updates \n😭😭😭💀⚰️",
            "author": "strawb3rry-sh0rtcake",
            "id": "jh1ruih",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682017235.0,
            "replies": []
        },
        {
            "body": "I love these stories. Keep them coming!",
            "author": "Kaoxt",
            "id": "jh2hshb",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682027572.0,
            "replies": []
        },
        {
            "body": "😂😂😂😂😂😂😂 I’m dying",
            "author": "Vivid-Leader-3409",
            "id": "jh2oli0",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682030627.0,
            "replies": []
        },
        {
            "body": "This story delights and pleases me :)",
            "author": "No-Pin-9988",
            "id": "ji30nu4",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682705001.0,
            "replies": []
        },
        {
            "body": "They look orthopaedic 💀💀💀",
            "author": "Honest_Possibility3",
            "id": "ji79ojc",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1682786817.0,
            "replies": []
        },
        {
            "body": "I really liked her until the toothbrush part😭",
            "author": "Myrtle_Snow333",
            "id": "jgw6t3h",
            "parent_id": "t3_12ry5ej",
            "score": 4,
            "created_utc": 1681919671.0,
            "replies": []
        },
        {
            "body": "Crazy girls are the best in bed.",
            "author": "n0v0cane",
            "id": "jgwhvyq",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681923981.0,
            "replies": []
        },
        {
            "body": "I see UseRound's story telling has gotten better.",
            "author": "WadingDeep",
            "id": "jgwjeak",
            "parent_id": "t3_12ry5ej",
            "score": 4,
            "created_utc": 1681924570.0,
            "replies": [
                {
                    "body": "except his SR are now drama free 😜",
                    "author": "NickPfromYuma",
                    "id": "jgwxxxb",
                    "parent_id": "t1_jgwjeak",
                    "score": 3,
                    "created_utc": 1681930223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay she is me but yeah I would have brought my toothbrush. She’s a riot.",
            "author": "xxemberraexx",
            "id": "jgxcfrz",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681935742.0,
            "replies": []
        },
        {
            "body": "i audibly laughed at the womp womp chapter 😂😂😂😂😭",
            "author": "Wise-Contribution509",
            "id": "jgxu68r",
            "parent_id": "t3_12ry5ej",
            "score": 3,
            "created_utc": 1681942715.0,
            "replies": []
        },
        {
            "body": "Now... can you go back to normal sugaring again?",
            "author": "SD_AU",
            "id": "jgxdd4g",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681936082.0,
            "replies": []
        },
        {
            "body": "she sounds fun I love her",
            "author": "waltkinseyworld",
            "id": "jgyklqi",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681954405.0,
            "replies": []
        },
        {
            "body": "How old is the girl?",
            "author": "professorxc",
            "id": "jgwgx7d",
            "parent_id": "t3_12ry5ej",
            "score": 2,
            "created_utc": 1681923603.0,
            "replies": [
                {
                    "body": "Young enough for Vizzy's but old enough for Heely's.",
                    "author": "coffeebeanbookgal",
                    "id": "jgwibuw",
                    "parent_id": "t1_jgwgx7d",
                    "score": 7,
                    "created_utc": 1681924153.0,
                    "replies": [
                        {
                            "body": "This is a perfect answer.  I've never been so invested in a story on reddit.  I love WG so much!",
                            "author": "Lucky-you-",
                            "id": "jgx79r1",
                            "parent_id": "t1_jgwibuw",
                            "score": 4,
                            "created_utc": 1681933788.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She definitely a keeper dude.  She is what I’m now seeking for a new long term SB, quirky, funny, and fun. Probably could of done without the penis twist but hey that’s the price you pay for that level of quirky.  Please don’t tell me sharing a toothbrush wigged you out, after you licked the brown ring ? And if you didn’t we can’t be friends 😂",
            "author": "RedHeavyG603",
            "id": "jgyhlq1",
            "parent_id": "t3_12ry5ej",
            "score": 1,
            "created_utc": 1681953075.0,
            "replies": []
        },
        {
            "body": "If it helps you sort things out at all, I definitely day “womp womp” on a consistent basis (and am a millennial).",
            "author": "backwoulds",
            "id": "jgzgozv",
            "parent_id": "t3_12ry5ej",
            "score": 1,
            "created_utc": 1681972547.0,
            "replies": []
        },
        {
            "body": "She sounds like a genuine person who is quirky - and that’s cool in a sea of me-to people.  Enjoy the SR however long or short it is - you’ll certainly never get bored!",
            "author": "Jonconnerysd",
            "id": "jgzlssd",
            "parent_id": "t3_12ry5ej",
            "score": 1,
            "created_utc": 1681976904.0,
            "replies": []
        },
        {
            "body": "The more OP posts, the more I think WG is an indie free spirit type doing her best to lighten up a socially awkward SD.",
            "author": "justabebeh",
            "id": "jh0nku8",
            "parent_id": "t3_12ry5ej",
            "score": 1,
            "created_utc": 1682001257.0,
            "replies": []
        },
        {
            "body": "Dude— you gotta stop listening to all these comments and get tf out. This is the weirdest shit I’ve ever heard 😂😂 if you were into it, that’s one thing. But clearly she’s not your vibe. Any time spent you’re gonna be convincing yourself you’re about it. I literally cannot with this girl….I would have dropped her hard especially after that green PEEN",
            "author": "crunchytacobaby",
            "id": "jgya361",
            "parent_id": "t3_12ry5ej",
            "score": 0,
            "created_utc": 1681949739.0,
            "replies": []
        },
        {
            "body": "Probably autistic to some degree",
            "author": "415-Daddy",
            "id": "jgzdc6x",
            "parent_id": "t3_12ry5ej",
            "score": 0,
            "created_utc": 1681969960.0,
            "replies": []
        },
        {
            "body": "So she can stick her tongue in your mouth and share saliva but you recoil at sharing a toothbrush?  🙄",
            "author": "Dazzling_Truth6472",
            "id": "jh02u3l",
            "parent_id": "t3_12ry5ej",
            "score": 0,
            "created_utc": 1681990654.0,
            "replies": []
        },
        {
            "body": "I’m glad you’re having fun.  Everybody has different tastes.  She’d have to be super model hot with crazy bedroom skills for me to put up with her.",
            "author": "BigSugar44",
            "id": "jgwi024",
            "parent_id": "t3_12ry5ej",
            "score": -7,
            "created_utc": 1681924024.0,
            "replies": [
                {
                    "body": "Scanning the comments is the best way to rule people out as a POT.  Am I right? I’d totally have a 3way with Wheelie Girl!  Yet, you’re annoyed by her.  Of course you’re not so annoyed by her that you wouldn’t fuck her if she was super hot.  Which I am finding doubly gross. Ye old pump her and dump her mentality.",
                    "author": "SexxxyBunny",
                    "id": "jgx19nu",
                    "parent_id": "t1_jgwi024",
                    "score": 5,
                    "created_utc": 1681931511.0,
                    "replies": [
                        {
                            "body": "To be brutally honest, I really don’t care what you think.",
                            "author": "BigSugar44",
                            "id": "jgxpy40",
                            "parent_id": "t1_jgx19nu",
                            "score": -5,
                            "created_utc": 1681940957.0,
                            "replies": [
                                {
                                    "body": "You should care, not about what I think, but how what you write might not portray you in the best light. Including that you don’t care what others in this community might think. It just all seems problematic. Womp, womp.",
                                    "author": "SexxxyBunny",
                                    "id": "jgxqlbt",
                                    "parent_id": "t1_jgxpy40",
                                    "score": 7,
                                    "created_utc": 1681941214.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "how can I get back on SA? they banned me. last time I tried they kicked me off. \n\nit went bad when I bought a fake credit card to pay for the memebership. \n\nI guess I should get the card with cash next time? I think they were able to track my name to the credit card? \n\nthey dont track IPs do they?",
            "author": "JeffyFan10",
            "id": "jgxpnt7",
            "parent_id": "t3_12ry5ej",
            "score": -2,
            "created_utc": 1681940841.0,
            "replies": []
        },
        {
            "body": "At what point did you discuss arrangement, T&Cs and that?",
            "author": "hwillson00",
            "id": "ji71nfl",
            "parent_id": "t3_12ry5ej",
            "score": 1,
            "created_utc": 1682783317.0,
            "replies": []
        },
        {
            "body": "Lmao this is the perfect response",
            "author": "MorganDax",
            "id": "jgx7e4y",
            "parent_id": "t1_jgw6322",
            "score": 10,
            "created_utc": 1681933833.0,
            "replies": []
        },
        {
            "body": "no literally... when i got to that part i was like now i am slightly doubting all the other judgements about poor WG. \n\ndocs are popular, i could see them [dressing down a skirt](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRON-SJ4kKyq0CqDEbzt6FJ_DNQVi41GOlFBA&usqp=CAU) if ur not a total girlie girl. also ironic that you confused them for orthopedics, they famously make your feet ache when breaking them in.",
            "author": "simply_unaffected",
            "id": "jgxng8z",
            "parent_id": "t1_jgw8lc9",
            "score": 31,
            "created_utc": 1681939953.0,
            "replies": [
                {
                    "body": "leather bomber, dress, boots 💯",
                    "author": "xa3D",
                    "id": "jgxq7kb",
                    "parent_id": "t1_jgxng8z",
                    "score": 11,
                    "created_utc": 1681941060.0,
                    "replies": [
                        {
                            "body": "Had an ex who dressed this way.",
                            "author": "BigBearSD",
                            "id": "jgzt4uj",
                            "parent_id": "t1_jgxq7kb",
                            "score": 3,
                            "created_utc": 1681983566.0,
                            "replies": [
                                {
                                    "body": ">Had an ex who dressed this way.\n\nMe too, but I was 18 at the time (early 1980s).  Not since then though.\n\nIn some ways though, that is more the sort of look I'd definitely go for in an SB nowadays - recreating my youth.",
                                    "author": "HecatesCats",
                                    "id": "jh1rh4y",
                                    "parent_id": "t1_jgzt4uj",
                                    "score": 1,
                                    "created_utc": 1682017085.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "tbf they do kinda look like those old people shoes with thick soles and stitching, my grandpa has some 💀",
                    "author": "strawb3rry-sh0rtcake",
                    "id": "jh1s193",
                    "parent_id": "t1_jgxng8z",
                    "score": 2,
                    "created_utc": 1682017310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Vizzy's are SO good! They're like the new White Claws, I like them a lot.",
            "author": "coffeebeanbookgal",
            "id": "jgwdqd3",
            "parent_id": "t1_jgw8lc9",
            "score": 12,
            "created_utc": 1681922368.0,
            "replies": [
                {
                    "body": "I’ve never had a white claw either. Have to try both of these",
                    "author": "Sugarintheorange",
                    "id": "jgwfobg",
                    "parent_id": "t1_jgwdqd3",
                    "score": 6,
                    "created_utc": 1681923121.0,
                    "replies": [
                        {
                            "body": "11/10 Recommend, they're pretty low on the alcohol content itself, but it's in a can that fits perfectly in the hand and is super popular on college campuses (I've got Vizzys and White Claws in my apartment at all times for spontaneous get-togethers).",
                            "author": "coffeebeanbookgal",
                            "id": "jgwfx61",
                            "parent_id": "t1_jgwfobg",
                            "score": 8,
                            "created_utc": 1681923214.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Can confirm, I love the watermelon flavor",
                    "author": "Myrtle_Snow333",
                    "id": "jgybx6d",
                    "parent_id": "t1_jgwdqd3",
                    "score": 2,
                    "created_utc": 1681950544.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That was my thought. It's kind of a normalish look in my area to wear Doc Martens with a cute, semi formal dress to kind of dress it down a little. Now I'm feeling self conscious.",
            "author": "grimoiregirl",
            "id": "jgyg2ju",
            "parent_id": "t1_jgw8lc9",
            "score": 10,
            "created_utc": 1681952387.0,
            "replies": []
        },
        {
            "body": "I also immediately thought of doc martens",
            "author": "Kozmicbunny",
            "id": "jgzi0rh",
            "parent_id": "t1_jgw8lc9",
            "score": 6,
            "created_utc": 1681973599.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgw8um0",
            "parent_id": "t1_jgw8lc9",
            "score": 3,
            "created_utc": 1681920473.0,
            "replies": [
                {
                    "body": "There are times when I really step back and appreciate the generational divide in sugar relationships. I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol! I love this",
                    "author": "SETXBrit",
                    "id": "jgwhe2d",
                    "parent_id": "t1_jgw8um0",
                    "score": 76,
                    "created_utc": 1681923786.0,
                    "replies": [
                        {
                            "body": "> I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol!\n\nThis is something I really don't get.  I guess he's in the US and probably back in the day DMs weren't a thing there?\n\nI certainly remember saving up for a pair of DMs when I had a Saturday job at Sainsbury's back in the early 80s.",
                            "author": "HecatesCats",
                            "id": "jgxbqz4",
                            "parent_id": "t1_jgwhe2d",
                            "score": 13,
                            "created_utc": 1681935475.0,
                            "replies": [
                                {
                                    "body": "DMs have been a thing on this side of the pond  since the 80s too 😊",
                                    "author": "mrssmithsshoes",
                                    "id": "jgzu3pu",
                                    "parent_id": "t1_jgxbqz4",
                                    "score": 8,
                                    "created_utc": 1681984405.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "right I am crying this is so good haha… so pure 😭😆🙌🏼",
                            "author": "strawb3rry-sh0rtcake",
                            "id": "jh1s617",
                            "parent_id": "t1_jgwhe2d",
                            "score": 2,
                            "created_utc": 1682017364.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They’re like boots but they also make sandals and like shoes that cut off before the ankle. The yellow stitching makes me think it’s probably those 😂",
                    "author": "Sugarintheorange",
                    "id": "jgw96db",
                    "parent_id": "t1_jgw8um0",
                    "score": 14,
                    "created_utc": 1681920601.0,
                    "replies": []
                },
                {
                    "body": "They are indeed more than likely Doc Martens...the yellow stiching is a signature of theirs.",
                    "author": "ShaArt5",
                    "id": "jgwf7gn",
                    "parent_id": "t1_jgw8um0",
                    "score": 10,
                    "created_utc": 1681922940.0,
                    "replies": []
                },
                {
                    "body": "It does sound like Dr Martens.  Here is what they look like:-\n\nhttps://www.drmartens.com/uk/en_gb/womens/c/01000000\n\nThe brand was very big from the 1970s-1990s.  Not so much nowadays, it's quite a bit more niche these days.",
                    "author": "HecatesCats",
                    "id": "jgwewyx",
                    "parent_id": "t1_jgw8um0",
                    "score": 8,
                    "created_utc": 1681922824.0,
                    "replies": [
                        {
                            "body": "Docs are IN right now. Super popular.",
                            "author": "coffeebeanbookgal",
                            "id": "jgwfjef",
                            "parent_id": "t1_jgwewyx",
                            "score": 26,
                            "created_utc": 1681923067.0,
                            "replies": [
                                {
                                    "body": "docs have really always been in. IMO.",
                                    "author": "sdsf9",
                                    "id": "jgxlv7p",
                                    "parent_id": "t1_jgwfjef",
                                    "score": 16,
                                    "created_utc": 1681939330.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "jgwf3t6",
                            "parent_id": "t1_jgwewyx",
                            "score": 7,
                            "created_utc": 1681922899.0,
                            "replies": [
                                {
                                    "body": "No they’re still super popular",
                                    "author": "Sugarintheorange",
                                    "id": "jgwfln2",
                                    "parent_id": "t1_jgwf3t6",
                                    "score": 28,
                                    "created_utc": 1681923091.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not at all. My sis is 21, and she has been harassing us to buy her docs since she was 15. They are super popular with the athletic baddies.",
                                    "author": "AdBot_1443",
                                    "id": "jgwvnql",
                                    "parent_id": "t1_jgwf3t6",
                                    "score": 12,
                                    "created_utc": 1681929327.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s popular with an indie crowd and I know lots of people on TikTok who love these shoes. I wouldn’t say outdated.",
                                    "author": "cottagewitchpet",
                                    "id": "jgwfmnm",
                                    "parent_id": "t1_jgwf3t6",
                                    "score": 10,
                                    "created_utc": 1681923103.0,
                                    "replies": []
                                },
                                {
                                    "body": "I bought an early 20s SB a pair in the past.",
                                    "author": "Downtown_Astronauts",
                                    "id": "jgx4un7",
                                    "parent_id": "t1_jgwf3t6",
                                    "score": 5,
                                    "created_utc": 1681932870.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Yes those are the ones. So she is outdated?\n\nNo, I guess it may be more that they have been \"rediscovered\".\n\nAs /u/Sugarintheorange /u/cottagewitchpet /u/coffeebeanbookgal and /u/AdBot_1443 refer to, they are still popular to a certain extent.  But it certainly isn't as mainstream as it used to be 30 or 40 years ago.  Dr Martens (or DMs) really are a lot more niche than they ever used to be.\n\nBack in the 1970s, 80s and 90s this brand was very much mainstream, from punks to skinheads to goths (and very male).  Not many girls wore this brand at all.\n\nBack in the day it was all about the boots.  Going right up to the 14 eye black or oxblood boots.\n\nDMs have been popular since the 1960s.  Here in the 1960s are [skinheads v hippies](https://imgur.com/a/rH29wVy).  This carried on into the 70s, 80s and 90s.\n\nAlthough [some girls did embrace the look back then as well](https://imgur.com/a/TnmcOvg)\n\nFrom then, of course, it moved on to [punk](https://imgur.com/a/HI2HGjI)\n\nWhen that photo was taken above I was 18 and my then girlfriend looked quite a lot like the blonde girl sitting on the right of the photo.\n\nOf course back then in high school, we weren't allowed to wear boots so, what are now called their \"1461 smooth leather oxford shoes\", were popular among boys in high school.\n\nThe popularity of DMs has really dropped off since the late 1990s/ early 2000s.  They used to be really quite mainstream amongst a lot of working class young men, based on music and cultural links, but that has more or less gone away now.\n\nSince then they have seen something of a resurgance as a bit of a niche fashion brand but nothing like the cultural icon they used to be 30 or 40 years ago.\n\nJust as an aside, there is another brand - Solovair - that essentially make the same product as DM (in fact, they literally did make DMs from the 1950s to the 1980s) but now the two companies have gone their own way and DM manufactures shoes in Thailand but Solovair still manufactures in the UK.  If you google something like \"Solovair v Dr Marten\" you'll see that there is a heated debate online as to which company produces the best boots.",
                                    "author": "HecatesCats",
                                    "id": "jgxazf8",
                                    "parent_id": "t1_jgwf3t6",
                                    "score": 6,
                                    "created_utc": 1681935181.0,
                                    "replies": [
                                        {
                                            "body": "When I was working in a mall in the early 00s, doc martens were super popular and every girl coveted a pair in a bright color or floral pattern, they seem like they'd be close to due for a comeback based on the trend cycle.",
                                            "author": "grimoiregirl",
                                            "id": "jgygf6x",
                                            "parent_id": "t1_jgxazf8",
                                            "score": 5,
                                            "created_utc": 1681952543.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me tooooo!!!❤️",
            "author": "Necessary_Tart3108",
            "id": "jh4hbpw",
            "parent_id": "t1_jgw9eja",
            "score": 2,
            "created_utc": 1682069154.0,
            "replies": []
        },
        {
            "body": "Resisting the urge to make a Zoidburg sound as the 🐔 flops around",
            "author": "AdBot_1443",
            "id": "jgwvvah",
            "parent_id": "t1_jgwix2h",
            "score": 13,
            "created_utc": 1681929410.0,
            "replies": []
        },
        {
            "body": "This is always weird to me. Like, sure I'll shove my tongue down your throat and lick your bootyhole but a toothbrush that's rinsed off multiple times between uses? Gross!!!",
            "author": "JemimaQuackers",
            "id": "jgw7igi",
            "parent_id": "t1_jgw6dmt",
            "score": 45,
            "created_utc": 1681919948.0,
            "replies": [
                {
                    "body": "I mean she stuck his toothbrush in her mouth?! Does he know her mouth has been?!\n\nOh wait. Yes, he does. Nevermind.",
                    "author": "BinghamtonSD",
                    "id": "jgwat5b",
                    "parent_id": "t1_jgw7igi",
                    "score": 24,
                    "created_utc": 1681921239.0,
                    "replies": [
                        {
                            "body": "😅🤣",
                            "author": "ShaArt5",
                            "id": "jgwfdti",
                            "parent_id": "t1_jgwat5b",
                            "score": 7,
                            "created_utc": 1681923008.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "& slathered with chemicals hahahah",
                    "author": "xxemberraexx",
                    "id": "jgxd5wm",
                    "parent_id": "t1_jgw7igi",
                    "score": 4,
                    "created_utc": 1681936006.0,
                    "replies": []
                },
                {
                    "body": "LMAOOO...the pictures in my brain...I'm DYING of laughter...🤣🤣🤣",
                    "author": "ShaArt5",
                    "id": "jgwfc5b",
                    "parent_id": "t1_jgw7igi",
                    "score": 6,
                    "created_utc": 1681922991.0,
                    "replies": []
                },
                {
                    "body": "Lol came here to say exactly this",
                    "author": "timothee2023",
                    "id": "jgyyk40",
                    "parent_id": "t1_jgw7igi",
                    "score": 3,
                    "created_utc": 1681960865.0,
                    "replies": []
                },
                {
                    "body": "Haha exactly… though tbf, I usually do throw the toothbrush away the next day if we’ve been sharing but I have like a dozen toothbrushes in the bathroom drawer at home pretty much always. Either way, no big deal.",
                    "author": "Immediate_Cabinet725",
                    "id": "jgxlqwj",
                    "parent_id": "t1_jgw7igi",
                    "score": 2,
                    "created_utc": 1681939283.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgxz686",
            "parent_id": "t1_jgwd8vr",
            "score": 3,
            "created_utc": 1681944874.0,
            "replies": [
                {
                    "body": "We can talk. Send me a message. But don’t send me a pic unless she agrees that she’s into it.",
                    "author": "SexxxyBunny",
                    "id": "jgxznp0",
                    "parent_id": "t1_jgxz686",
                    "score": 7,
                    "created_utc": 1681945085.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "underrated comment, when he said that I thought bwomp bwomp",
            "author": "mayorofny",
            "id": "jgywvov",
            "parent_id": "t1_jgx3ars",
            "score": 2,
            "created_utc": 1681960007.0,
            "replies": []
        },
        {
            "body": "This^",
            "author": "wtfamidoinghere4829",
            "id": "jgwbxcl",
            "parent_id": "t1_jgw9uld",
            "score": 10,
            "created_utc": 1681921670.0,
            "replies": []
        },
        {
            "body": "Ditto",
            "author": "Immediate_Cabinet725",
            "id": "jgxlv4p",
            "parent_id": "t1_jgw9uld",
            "score": 3,
            "created_utc": 1681939329.0,
            "replies": []
        },
        {
            "body": "+1",
            "author": "timothee2023",
            "id": "jgyzpdi",
            "parent_id": "t1_jgw9uld",
            "score": 3,
            "created_utc": 1681961469.0,
            "replies": []
        },
        {
            "body": "As a millenial, womp womp sounds like a lewd vtuber that sometimes gets suggested on my clips/shorts feed while i browse gaming clips.",
            "author": "xa3D",
            "id": "jgxqgdx",
            "parent_id": "t1_jgw9uld",
            "score": 3,
            "created_utc": 1681941159.0,
            "replies": []
        },
        {
            "body": "That’s what I was thinking, because I def had my own pair of wheelies. 😂😂",
            "author": "MilaniAmara99",
            "id": "jgy9jjq",
            "parent_id": "t1_jgwyld0",
            "score": 2,
            "created_utc": 1681949498.0,
            "replies": []
        },
        {
            "body": "yes, team wheelie! but I feel like she could do better with somebody who appreciates her",
            "author": "mayorofny",
            "id": "jgyx12x",
            "parent_id": "t1_jgwg0h2",
            "score": 7,
            "created_utc": 1681960082.0,
            "replies": [
                {
                    "body": "Exactly. He’s the one out of touch.",
                    "author": "SignatureOk1022",
                    "id": "jgzjwn4",
                    "parent_id": "t1_jgyx12x",
                    "score": 2,
                    "created_utc": 1681975192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This! And squish it and bend it and see all the ways I can play with it without getting it hard... each time it starts getting hard! Is very entertaining 😅😁🤣",
            "author": "desiderataJa",
            "id": "jgyl63x",
            "parent_id": "t1_jgwgwn7",
            "score": 6,
            "created_utc": 1681954658.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgwm60x",
            "parent_id": "t1_jgwlglk",
            "score": 4,
            "created_utc": 1681925638.0,
            "replies": [
                {
                    "body": "💔\nI bet it's a fashion statement though! Mismatched earrings would probably work too - just pick a pair and said you thought of her 🥰",
                    "author": "FructoseLady",
                    "id": "jgwrhr6",
                    "parent_id": "t1_jgwm60x",
                    "score": 8,
                    "created_utc": 1681927683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would but I generally stay away from people with derivatives of “murder” in their screen name. 😂😂😂😂",
            "author": "SexxxyBunny",
            "id": "jgx263u",
            "parent_id": "t1_jgwe91h",
            "score": 13,
            "created_utc": 1681931859.0,
            "replies": [
                {
                    "body": "But seriously. Can we throw a party in her honor.  Rent out a club, charge (SD's) 100 at the door, SB's free entry, any SD flying in must also get airfare for an SB to fly in, we'll have like 100 people there, she won't know what's up except OP must insist she wear her heelies, and then we're all like \"surprise\" and start serenading her and/or start a mass orgy.",
                    "author": "DisposableDextrose",
                    "id": "jgz5p3s",
                    "parent_id": "t1_jgx263u",
                    "score": 6,
                    "created_utc": 1681964841.0,
                    "replies": [
                        {
                            "body": "It sounds like you just planned the First Annual SLF M&G✨",
                            "author": "Jewels_Gems",
                            "id": "jh4464t",
                            "parent_id": "t1_jgz5p3s",
                            "score": 4,
                            "created_utc": 1682057748.0,
                            "replies": [
                                {
                                    "body": "This has already happened.",
                                    "author": "sugarintherawr",
                                    "id": "ji4syea",
                                    "parent_id": "t1_jh4464t",
                                    "score": 0,
                                    "created_utc": 1682732899.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I had one I’m positive I’d never leave it alone, and the audio track from the bop-it commercial would constantly be rolling through my brain 😂",
            "author": "BeautyBaby247",
            "id": "jgyd75u",
            "parent_id": "t1_jgy1mbr",
            "score": 4,
            "created_utc": 1681951109.0,
            "replies": [
                {
                    "body": "omg fucking bop it 😂😂😂😂",
                    "author": "sugarintherawr",
                    "id": "ji4t9wo",
                    "parent_id": "t1_jgyd75u",
                    "score": 1,
                    "created_utc": 1682733053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A penile trebuchet??!!! Omg. I need to try this!!!",
            "author": "desiderataJa",
            "id": "jgym42r",
            "parent_id": "t1_jgy38zr",
            "score": 4,
            "created_utc": 1681955081.0,
            "replies": []
        },
        {
            "body": "UPDATE!!\n\n&#x200B;\n\nYou can, indeed, turn a soft penis 360 degrees.\n\n&#x200B;\n\nHubby was not amused.\n\n&#x200B;\n\n(But I was)",
            "author": "Uranusspinssideways",
            "id": "ji9pydv",
            "parent_id": "t1_jgy38zr",
            "score": 2,
            "created_utc": 1682829345.0,
            "replies": []
        },
        {
            "body": "Ooh yes!!! Although telling her she has a following when he is gaining consent will likely lead her here and he will lose his advice source?",
            "author": "desiderataJa",
            "id": "jgyloha",
            "parent_id": "t1_jgwbeot",
            "score": 4,
            "created_utc": 1681954888.0,
            "replies": [
                {
                    "body": "This is true, so he can either blur her face out and not tell her, or he can tell her he has some friends who would like to see what she looks like 🤷🏽‍♂️",
                    "author": "hpygilmr",
                    "id": "jh605w2",
                    "parent_id": "t1_jgyloha",
                    "score": 2,
                    "created_utc": 1682096796.0,
                    "replies": [
                        {
                            "body": "That's a good way around it :)",
                            "author": "desiderataJa",
                            "id": "jh7o4b4",
                            "parent_id": "t1_jh605w2",
                            "score": 1,
                            "created_utc": 1682122547.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yesss ! 🙋‍♀️",
            "author": "Own-Ad6334",
            "id": "jgwgcr2",
            "parent_id": "t1_jgwbeot",
            "score": 3,
            "created_utc": 1681923382.0,
            "replies": []
        },
        {
            "body": "Upvote sooooo hard!",
            "author": "wtfamidoinghere4829",
            "id": "jgwi0m7",
            "parent_id": "t1_jgwbeot",
            "score": 4,
            "created_utc": 1681924031.0,
            "replies": [
                {
                    "body": "More upvotes for seeing pics!",
                    "author": "BinghamtonSD",
                    "id": "jgxadh6",
                    "parent_id": "t1_jgwi0m7",
                    "score": 4,
                    "created_utc": 1681934952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was going to comment along the same line, I love that she is being 100% herself and rather than ditching her for her eccentricities he is like... well this is a ride... how do I not get bucked off?! 🤩🙌🫶👌🏼",
            "author": "desiderataJa",
            "id": "jgylfv0",
            "parent_id": "t1_jgx3dqk",
            "score": 3,
            "created_utc": 1681954781.0,
            "replies": []
        },
        {
            "body": "I was just thinking that! Love it",
            "author": "Relative-Fuel7990",
            "id": "jgzslti",
            "parent_id": "t1_jgyv7be",
            "score": 3,
            "created_utc": 1681983103.0,
            "replies": []
        },
        {
            "body": "😂 I think he can find a normal SB he likes.",
            "author": "Own-Ad6334",
            "id": "jgwgf3j",
            "parent_id": "t1_jgwfsgh",
            "score": 0,
            "created_utc": 1681923408.0,
            "replies": [
                {
                    "body": "Wheelie Girl reminds me of those movies where the straight laced non spicy food loving conventional guy falls in love with the type of woman who challenges his preferences. I think OP will eventually grow to quite like WG, and he’ll expand his world hanging out with her.",
                    "author": "Empressofthemall",
                    "id": "jgwo1g2",
                    "parent_id": "t1_jgwgf3j",
                    "score": 14,
                    "created_utc": 1681926348.0,
                    "replies": [
                        {
                            "body": "the manic pixie girl trope\n\nkinda hate it bc in many such films the manic pixie girl character has no purpose or identity whatsoever except to help the protagonist along, and people don't work that way.  Just make her an actual mythical sexy fairy not a person why don't they?\n\nsorry for the tangential rant haha",
                            "author": "Gemini-Fox",
                            "id": "jgx9gug",
                            "parent_id": "t1_jgwo1g2",
                            "score": 8,
                            "created_utc": 1681934613.0,
                            "replies": [
                                {
                                    "body": "💚",
                                    "author": "sugarintherawr",
                                    "id": "ji4tftp",
                                    "parent_id": "t1_jgx9gug",
                                    "score": 1,
                                    "created_utc": 1682733129.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What is “normal”?\n\nWheelie girl is an inspiration to all sb’s. \n\nIt’s so weird that people are scared to be authentic. I’d never want a sd who didn’t adore my silly behaviors or try to change me. \n\nIf he wants a vanilla Vanessa then so be it, his loss. \n\nWomp womp",
                    "author": "Vast_Web_5827",
                    "id": "jgwhgxe",
                    "parent_id": "t1_jgwgf3j",
                    "score": 20,
                    "created_utc": 1681923818.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgwgq1f",
                    "parent_id": "t1_jgwgf3j",
                    "score": 2,
                    "created_utc": 1681923525.0,
                    "replies": [
                        {
                            "body": "Absolutely! 👽",
                            "author": "Own-Ad6334",
                            "id": "jgwh60g",
                            "parent_id": "t1_jgwgq1f",
                            "score": 1,
                            "created_utc": 1681923697.0,
                            "replies": [
                                {
                                    "body": "Side-EYE. 'Abnormal' is what some people like.",
                                    "author": "coffeebeanbookgal",
                                    "id": "jgwhkwh",
                                    "parent_id": "t1_jgwh60g",
                                    "score": 3,
                                    "created_utc": 1681923862.0,
                                    "replies": [
                                        {
                                            "body": "Bombastic side-eye\n\nI’m definitely a manic pixie dream girl type of Sugarbaby myself. Lolololol",
                                            "author": "Vast_Web_5827",
                                            "id": "jgx2ooi",
                                            "parent_id": "t1_jgwhkwh",
                                            "score": 7,
                                            "created_utc": 1681932056.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "OP was cleearly not involved in the business world in the 90s and early 00s when Docs were THE go to for fresh out of high school/college intern types who couldn't yet afford the truly business attire wardrobe.",
            "author": "WadingDeep",
            "id": "jgx8txx",
            "parent_id": "t1_jgwvnku",
            "score": 2,
            "created_utc": 1681934375.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgwl1do",
            "parent_id": "t1_jgwksan",
            "score": 2,
            "created_utc": 1681925205.0,
            "replies": [
                {
                    "body": "I'm not too sure, I myself find I can be weird at times, but that's the person who I am. On dates and meet ups I do try to hide it from them to not scare them away.\n\nIt seems as though from my point, she's very comfortable with you.",
                    "author": "scabbehhhh",
                    "id": "jgwlfx1",
                    "parent_id": "t1_jgwl1do",
                    "score": 4,
                    "created_utc": 1681925359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually bought a cute pink pair after I read the meet and greet story. Completely underrated for both fashion and fun. I had to google “wheelie shoes” 😂",
            "author": "Empressofthemall",
            "id": "jgxy86d",
            "parent_id": "t1_jgxwnvs",
            "score": 5,
            "created_utc": 1681944467.0,
            "replies": []
        },
        {
            "body": "Lol. There’s an off brand called “Wheelies”. Sold on Amazon. 🤣🤣🤣",
            "author": "SignatureOk1022",
            "id": "jgzk6tx",
            "parent_id": "t1_jgxwnvs",
            "score": 3,
            "created_utc": 1681975442.0,
            "replies": []
        },
        {
            "body": "except his SR are now drama free 😜",
            "author": "NickPfromYuma",
            "id": "jgwxxxb",
            "parent_id": "t1_jgwjeak",
            "score": 3,
            "created_utc": 1681930223.0,
            "replies": []
        },
        {
            "body": "Young enough for Vizzy's but old enough for Heely's.",
            "author": "coffeebeanbookgal",
            "id": "jgwibuw",
            "parent_id": "t1_jgwgx7d",
            "score": 7,
            "created_utc": 1681924153.0,
            "replies": [
                {
                    "body": "This is a perfect answer.  I've never been so invested in a story on reddit.  I love WG so much!",
                    "author": "Lucky-you-",
                    "id": "jgx79r1",
                    "parent_id": "t1_jgwibuw",
                    "score": 4,
                    "created_utc": 1681933788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Scanning the comments is the best way to rule people out as a POT.  Am I right? I’d totally have a 3way with Wheelie Girl!  Yet, you’re annoyed by her.  Of course you’re not so annoyed by her that you wouldn’t fuck her if she was super hot.  Which I am finding doubly gross. Ye old pump her and dump her mentality.",
            "author": "SexxxyBunny",
            "id": "jgx19nu",
            "parent_id": "t1_jgwi024",
            "score": 5,
            "created_utc": 1681931511.0,
            "replies": [
                {
                    "body": "To be brutally honest, I really don’t care what you think.",
                    "author": "BigSugar44",
                    "id": "jgxpy40",
                    "parent_id": "t1_jgx19nu",
                    "score": -5,
                    "created_utc": 1681940957.0,
                    "replies": [
                        {
                            "body": "You should care, not about what I think, but how what you write might not portray you in the best light. Including that you don’t care what others in this community might think. It just all seems problematic. Womp, womp.",
                            "author": "SexxxyBunny",
                            "id": "jgxqlbt",
                            "parent_id": "t1_jgxpy40",
                            "score": 7,
                            "created_utc": 1681941214.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "leather bomber, dress, boots 💯",
            "author": "xa3D",
            "id": "jgxq7kb",
            "parent_id": "t1_jgxng8z",
            "score": 11,
            "created_utc": 1681941060.0,
            "replies": [
                {
                    "body": "Had an ex who dressed this way.",
                    "author": "BigBearSD",
                    "id": "jgzt4uj",
                    "parent_id": "t1_jgxq7kb",
                    "score": 3,
                    "created_utc": 1681983566.0,
                    "replies": [
                        {
                            "body": ">Had an ex who dressed this way.\n\nMe too, but I was 18 at the time (early 1980s).  Not since then though.\n\nIn some ways though, that is more the sort of look I'd definitely go for in an SB nowadays - recreating my youth.",
                            "author": "HecatesCats",
                            "id": "jh1rh4y",
                            "parent_id": "t1_jgzt4uj",
                            "score": 1,
                            "created_utc": 1682017085.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "tbf they do kinda look like those old people shoes with thick soles and stitching, my grandpa has some 💀",
            "author": "strawb3rry-sh0rtcake",
            "id": "jh1s193",
            "parent_id": "t1_jgxng8z",
            "score": 2,
            "created_utc": 1682017310.0,
            "replies": []
        },
        {
            "body": "I’ve never had a white claw either. Have to try both of these",
            "author": "Sugarintheorange",
            "id": "jgwfobg",
            "parent_id": "t1_jgwdqd3",
            "score": 6,
            "created_utc": 1681923121.0,
            "replies": [
                {
                    "body": "11/10 Recommend, they're pretty low on the alcohol content itself, but it's in a can that fits perfectly in the hand and is super popular on college campuses (I've got Vizzys and White Claws in my apartment at all times for spontaneous get-togethers).",
                    "author": "coffeebeanbookgal",
                    "id": "jgwfx61",
                    "parent_id": "t1_jgwfobg",
                    "score": 8,
                    "created_utc": 1681923214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can confirm, I love the watermelon flavor",
            "author": "Myrtle_Snow333",
            "id": "jgybx6d",
            "parent_id": "t1_jgwdqd3",
            "score": 2,
            "created_utc": 1681950544.0,
            "replies": []
        },
        {
            "body": "There are times when I really step back and appreciate the generational divide in sugar relationships. I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol! I love this",
            "author": "SETXBrit",
            "id": "jgwhe2d",
            "parent_id": "t1_jgw8um0",
            "score": 76,
            "created_utc": 1681923786.0,
            "replies": [
                {
                    "body": "> I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol!\n\nThis is something I really don't get.  I guess he's in the US and probably back in the day DMs weren't a thing there?\n\nI certainly remember saving up for a pair of DMs when I had a Saturday job at Sainsbury's back in the early 80s.",
                    "author": "HecatesCats",
                    "id": "jgxbqz4",
                    "parent_id": "t1_jgwhe2d",
                    "score": 13,
                    "created_utc": 1681935475.0,
                    "replies": [
                        {
                            "body": "DMs have been a thing on this side of the pond  since the 80s too 😊",
                            "author": "mrssmithsshoes",
                            "id": "jgzu3pu",
                            "parent_id": "t1_jgxbqz4",
                            "score": 8,
                            "created_utc": 1681984405.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "right I am crying this is so good haha… so pure 😭😆🙌🏼",
                    "author": "strawb3rry-sh0rtcake",
                    "id": "jh1s617",
                    "parent_id": "t1_jgwhe2d",
                    "score": 2,
                    "created_utc": 1682017364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They’re like boots but they also make sandals and like shoes that cut off before the ankle. The yellow stitching makes me think it’s probably those 😂",
            "author": "Sugarintheorange",
            "id": "jgw96db",
            "parent_id": "t1_jgw8um0",
            "score": 14,
            "created_utc": 1681920601.0,
            "replies": []
        },
        {
            "body": "They are indeed more than likely Doc Martens...the yellow stiching is a signature of theirs.",
            "author": "ShaArt5",
            "id": "jgwf7gn",
            "parent_id": "t1_jgw8um0",
            "score": 10,
            "created_utc": 1681922940.0,
            "replies": []
        },
        {
            "body": "It does sound like Dr Martens.  Here is what they look like:-\n\nhttps://www.drmartens.com/uk/en_gb/womens/c/01000000\n\nThe brand was very big from the 1970s-1990s.  Not so much nowadays, it's quite a bit more niche these days.",
            "author": "HecatesCats",
            "id": "jgwewyx",
            "parent_id": "t1_jgw8um0",
            "score": 8,
            "created_utc": 1681922824.0,
            "replies": [
                {
                    "body": "Docs are IN right now. Super popular.",
                    "author": "coffeebeanbookgal",
                    "id": "jgwfjef",
                    "parent_id": "t1_jgwewyx",
                    "score": 26,
                    "created_utc": 1681923067.0,
                    "replies": [
                        {
                            "body": "docs have really always been in. IMO.",
                            "author": "sdsf9",
                            "id": "jgxlv7p",
                            "parent_id": "t1_jgwfjef",
                            "score": 16,
                            "created_utc": 1681939330.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jgwf3t6",
                    "parent_id": "t1_jgwewyx",
                    "score": 7,
                    "created_utc": 1681922899.0,
                    "replies": [
                        {
                            "body": "No they’re still super popular",
                            "author": "Sugarintheorange",
                            "id": "jgwfln2",
                            "parent_id": "t1_jgwf3t6",
                            "score": 28,
                            "created_utc": 1681923091.0,
                            "replies": []
                        },
                        {
                            "body": "Not at all. My sis is 21, and she has been harassing us to buy her docs since she was 15. They are super popular with the athletic baddies.",
                            "author": "AdBot_1443",
                            "id": "jgwvnql",
                            "parent_id": "t1_jgwf3t6",
                            "score": 12,
                            "created_utc": 1681929327.0,
                            "replies": []
                        },
                        {
                            "body": "It’s popular with an indie crowd and I know lots of people on TikTok who love these shoes. I wouldn’t say outdated.",
                            "author": "cottagewitchpet",
                            "id": "jgwfmnm",
                            "parent_id": "t1_jgwf3t6",
                            "score": 10,
                            "created_utc": 1681923103.0,
                            "replies": []
                        },
                        {
                            "body": "I bought an early 20s SB a pair in the past.",
                            "author": "Downtown_Astronauts",
                            "id": "jgx4un7",
                            "parent_id": "t1_jgwf3t6",
                            "score": 5,
                            "created_utc": 1681932870.0,
                            "replies": []
                        },
                        {
                            "body": ">Yes those are the ones. So she is outdated?\n\nNo, I guess it may be more that they have been \"rediscovered\".\n\nAs /u/Sugarintheorange /u/cottagewitchpet /u/coffeebeanbookgal and /u/AdBot_1443 refer to, they are still popular to a certain extent.  But it certainly isn't as mainstream as it used to be 30 or 40 years ago.  Dr Martens (or DMs) really are a lot more niche than they ever used to be.\n\nBack in the 1970s, 80s and 90s this brand was very much mainstream, from punks to skinheads to goths (and very male).  Not many girls wore this brand at all.\n\nBack in the day it was all about the boots.  Going right up to the 14 eye black or oxblood boots.\n\nDMs have been popular since the 1960s.  Here in the 1960s are [skinheads v hippies](https://imgur.com/a/rH29wVy).  This carried on into the 70s, 80s and 90s.\n\nAlthough [some girls did embrace the look back then as well](https://imgur.com/a/TnmcOvg)\n\nFrom then, of course, it moved on to [punk](https://imgur.com/a/HI2HGjI)\n\nWhen that photo was taken above I was 18 and my then girlfriend looked quite a lot like the blonde girl sitting on the right of the photo.\n\nOf course back then in high school, we weren't allowed to wear boots so, what are now called their \"1461 smooth leather oxford shoes\", were popular among boys in high school.\n\nThe popularity of DMs has really dropped off since the late 1990s/ early 2000s.  They used to be really quite mainstream amongst a lot of working class young men, based on music and cultural links, but that has more or less gone away now.\n\nSince then they have seen something of a resurgance as a bit of a niche fashion brand but nothing like the cultural icon they used to be 30 or 40 years ago.\n\nJust as an aside, there is another brand - Solovair - that essentially make the same product as DM (in fact, they literally did make DMs from the 1950s to the 1980s) but now the two companies have gone their own way and DM manufactures shoes in Thailand but Solovair still manufactures in the UK.  If you google something like \"Solovair v Dr Marten\" you'll see that there is a heated debate online as to which company produces the best boots.",
                            "author": "HecatesCats",
                            "id": "jgxazf8",
                            "parent_id": "t1_jgwf3t6",
                            "score": 6,
                            "created_utc": 1681935181.0,
                            "replies": [
                                {
                                    "body": "When I was working in a mall in the early 00s, doc martens were super popular and every girl coveted a pair in a bright color or floral pattern, they seem like they'd be close to due for a comeback based on the trend cycle.",
                                    "author": "grimoiregirl",
                                    "id": "jgygf6x",
                                    "parent_id": "t1_jgxazf8",
                                    "score": 5,
                                    "created_utc": 1681952543.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean she stuck his toothbrush in her mouth?! Does he know her mouth has been?!\n\nOh wait. Yes, he does. Nevermind.",
            "author": "BinghamtonSD",
            "id": "jgwat5b",
            "parent_id": "t1_jgw7igi",
            "score": 24,
            "created_utc": 1681921239.0,
            "replies": [
                {
                    "body": "😅🤣",
                    "author": "ShaArt5",
                    "id": "jgwfdti",
                    "parent_id": "t1_jgwat5b",
                    "score": 7,
                    "created_utc": 1681923008.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "& slathered with chemicals hahahah",
            "author": "xxemberraexx",
            "id": "jgxd5wm",
            "parent_id": "t1_jgw7igi",
            "score": 4,
            "created_utc": 1681936006.0,
            "replies": []
        },
        {
            "body": "LMAOOO...the pictures in my brain...I'm DYING of laughter...🤣🤣🤣",
            "author": "ShaArt5",
            "id": "jgwfc5b",
            "parent_id": "t1_jgw7igi",
            "score": 6,
            "created_utc": 1681922991.0,
            "replies": []
        },
        {
            "body": "Lol came here to say exactly this",
            "author": "timothee2023",
            "id": "jgyyk40",
            "parent_id": "t1_jgw7igi",
            "score": 3,
            "created_utc": 1681960865.0,
            "replies": []
        },
        {
            "body": "Haha exactly… though tbf, I usually do throw the toothbrush away the next day if we’ve been sharing but I have like a dozen toothbrushes in the bathroom drawer at home pretty much always. Either way, no big deal.",
            "author": "Immediate_Cabinet725",
            "id": "jgxlqwj",
            "parent_id": "t1_jgw7igi",
            "score": 2,
            "created_utc": 1681939283.0,
            "replies": []
        },
        {
            "body": "We can talk. Send me a message. But don’t send me a pic unless she agrees that she’s into it.",
            "author": "SexxxyBunny",
            "id": "jgxznp0",
            "parent_id": "t1_jgxz686",
            "score": 7,
            "created_utc": 1681945085.0,
            "replies": []
        },
        {
            "body": "Exactly. He’s the one out of touch.",
            "author": "SignatureOk1022",
            "id": "jgzjwn4",
            "parent_id": "t1_jgyx12x",
            "score": 2,
            "created_utc": 1681975192.0,
            "replies": []
        },
        {
            "body": "💔\nI bet it's a fashion statement though! Mismatched earrings would probably work too - just pick a pair and said you thought of her 🥰",
            "author": "FructoseLady",
            "id": "jgwrhr6",
            "parent_id": "t1_jgwm60x",
            "score": 8,
            "created_utc": 1681927683.0,
            "replies": []
        },
        {
            "body": "But seriously. Can we throw a party in her honor.  Rent out a club, charge (SD's) 100 at the door, SB's free entry, any SD flying in must also get airfare for an SB to fly in, we'll have like 100 people there, she won't know what's up except OP must insist she wear her heelies, and then we're all like \"surprise\" and start serenading her and/or start a mass orgy.",
            "author": "DisposableDextrose",
            "id": "jgz5p3s",
            "parent_id": "t1_jgx263u",
            "score": 6,
            "created_utc": 1681964841.0,
            "replies": [
                {
                    "body": "It sounds like you just planned the First Annual SLF M&G✨",
                    "author": "Jewels_Gems",
                    "id": "jh4464t",
                    "parent_id": "t1_jgz5p3s",
                    "score": 4,
                    "created_utc": 1682057748.0,
                    "replies": [
                        {
                            "body": "This has already happened.",
                            "author": "sugarintherawr",
                            "id": "ji4syea",
                            "parent_id": "t1_jh4464t",
                            "score": 0,
                            "created_utc": 1682732899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "omg fucking bop it 😂😂😂😂",
            "author": "sugarintherawr",
            "id": "ji4t9wo",
            "parent_id": "t1_jgyd75u",
            "score": 1,
            "created_utc": 1682733053.0,
            "replies": []
        },
        {
            "body": "This is true, so he can either blur her face out and not tell her, or he can tell her he has some friends who would like to see what she looks like 🤷🏽‍♂️",
            "author": "hpygilmr",
            "id": "jh605w2",
            "parent_id": "t1_jgyloha",
            "score": 2,
            "created_utc": 1682096796.0,
            "replies": [
                {
                    "body": "That's a good way around it :)",
                    "author": "desiderataJa",
                    "id": "jh7o4b4",
                    "parent_id": "t1_jh605w2",
                    "score": 1,
                    "created_utc": 1682122547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More upvotes for seeing pics!",
            "author": "BinghamtonSD",
            "id": "jgxadh6",
            "parent_id": "t1_jgwi0m7",
            "score": 4,
            "created_utc": 1681934952.0,
            "replies": []
        },
        {
            "body": "Wheelie Girl reminds me of those movies where the straight laced non spicy food loving conventional guy falls in love with the type of woman who challenges his preferences. I think OP will eventually grow to quite like WG, and he’ll expand his world hanging out with her.",
            "author": "Empressofthemall",
            "id": "jgwo1g2",
            "parent_id": "t1_jgwgf3j",
            "score": 14,
            "created_utc": 1681926348.0,
            "replies": [
                {
                    "body": "the manic pixie girl trope\n\nkinda hate it bc in many such films the manic pixie girl character has no purpose or identity whatsoever except to help the protagonist along, and people don't work that way.  Just make her an actual mythical sexy fairy not a person why don't they?\n\nsorry for the tangential rant haha",
                    "author": "Gemini-Fox",
                    "id": "jgx9gug",
                    "parent_id": "t1_jgwo1g2",
                    "score": 8,
                    "created_utc": 1681934613.0,
                    "replies": [
                        {
                            "body": "💚",
                            "author": "sugarintherawr",
                            "id": "ji4tftp",
                            "parent_id": "t1_jgx9gug",
                            "score": 1,
                            "created_utc": 1682733129.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What is “normal”?\n\nWheelie girl is an inspiration to all sb’s. \n\nIt’s so weird that people are scared to be authentic. I’d never want a sd who didn’t adore my silly behaviors or try to change me. \n\nIf he wants a vanilla Vanessa then so be it, his loss. \n\nWomp womp",
            "author": "Vast_Web_5827",
            "id": "jgwhgxe",
            "parent_id": "t1_jgwgf3j",
            "score": 20,
            "created_utc": 1681923818.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgwgq1f",
            "parent_id": "t1_jgwgf3j",
            "score": 2,
            "created_utc": 1681923525.0,
            "replies": [
                {
                    "body": "Absolutely! 👽",
                    "author": "Own-Ad6334",
                    "id": "jgwh60g",
                    "parent_id": "t1_jgwgq1f",
                    "score": 1,
                    "created_utc": 1681923697.0,
                    "replies": [
                        {
                            "body": "Side-EYE. 'Abnormal' is what some people like.",
                            "author": "coffeebeanbookgal",
                            "id": "jgwhkwh",
                            "parent_id": "t1_jgwh60g",
                            "score": 3,
                            "created_utc": 1681923862.0,
                            "replies": [
                                {
                                    "body": "Bombastic side-eye\n\nI’m definitely a manic pixie dream girl type of Sugarbaby myself. Lolololol",
                                    "author": "Vast_Web_5827",
                                    "id": "jgx2ooi",
                                    "parent_id": "t1_jgwhkwh",
                                    "score": 7,
                                    "created_utc": 1681932056.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not too sure, I myself find I can be weird at times, but that's the person who I am. On dates and meet ups I do try to hide it from them to not scare them away.\n\nIt seems as though from my point, she's very comfortable with you.",
            "author": "scabbehhhh",
            "id": "jgwlfx1",
            "parent_id": "t1_jgwl1do",
            "score": 4,
            "created_utc": 1681925359.0,
            "replies": []
        },
        {
            "body": "This is a perfect answer.  I've never been so invested in a story on reddit.  I love WG so much!",
            "author": "Lucky-you-",
            "id": "jgx79r1",
            "parent_id": "t1_jgwibuw",
            "score": 4,
            "created_utc": 1681933788.0,
            "replies": []
        },
        {
            "body": "To be brutally honest, I really don’t care what you think.",
            "author": "BigSugar44",
            "id": "jgxpy40",
            "parent_id": "t1_jgx19nu",
            "score": -5,
            "created_utc": 1681940957.0,
            "replies": [
                {
                    "body": "You should care, not about what I think, but how what you write might not portray you in the best light. Including that you don’t care what others in this community might think. It just all seems problematic. Womp, womp.",
                    "author": "SexxxyBunny",
                    "id": "jgxqlbt",
                    "parent_id": "t1_jgxpy40",
                    "score": 7,
                    "created_utc": 1681941214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Had an ex who dressed this way.",
            "author": "BigBearSD",
            "id": "jgzt4uj",
            "parent_id": "t1_jgxq7kb",
            "score": 3,
            "created_utc": 1681983566.0,
            "replies": [
                {
                    "body": ">Had an ex who dressed this way.\n\nMe too, but I was 18 at the time (early 1980s).  Not since then though.\n\nIn some ways though, that is more the sort of look I'd definitely go for in an SB nowadays - recreating my youth.",
                    "author": "HecatesCats",
                    "id": "jh1rh4y",
                    "parent_id": "t1_jgzt4uj",
                    "score": 1,
                    "created_utc": 1682017085.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "11/10 Recommend, they're pretty low on the alcohol content itself, but it's in a can that fits perfectly in the hand and is super popular on college campuses (I've got Vizzys and White Claws in my apartment at all times for spontaneous get-togethers).",
            "author": "coffeebeanbookgal",
            "id": "jgwfx61",
            "parent_id": "t1_jgwfobg",
            "score": 8,
            "created_utc": 1681923214.0,
            "replies": []
        },
        {
            "body": "> I have to say a daddy confusing docs with orthopedic footwear has to be one of those top tier moments lol!\n\nThis is something I really don't get.  I guess he's in the US and probably back in the day DMs weren't a thing there?\n\nI certainly remember saving up for a pair of DMs when I had a Saturday job at Sainsbury's back in the early 80s.",
            "author": "HecatesCats",
            "id": "jgxbqz4",
            "parent_id": "t1_jgwhe2d",
            "score": 13,
            "created_utc": 1681935475.0,
            "replies": [
                {
                    "body": "DMs have been a thing on this side of the pond  since the 80s too 😊",
                    "author": "mrssmithsshoes",
                    "id": "jgzu3pu",
                    "parent_id": "t1_jgxbqz4",
                    "score": 8,
                    "created_utc": 1681984405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "right I am crying this is so good haha… so pure 😭😆🙌🏼",
            "author": "strawb3rry-sh0rtcake",
            "id": "jh1s617",
            "parent_id": "t1_jgwhe2d",
            "score": 2,
            "created_utc": 1682017364.0,
            "replies": []
        },
        {
            "body": "Docs are IN right now. Super popular.",
            "author": "coffeebeanbookgal",
            "id": "jgwfjef",
            "parent_id": "t1_jgwewyx",
            "score": 26,
            "created_utc": 1681923067.0,
            "replies": [
                {
                    "body": "docs have really always been in. IMO.",
                    "author": "sdsf9",
                    "id": "jgxlv7p",
                    "parent_id": "t1_jgwfjef",
                    "score": 16,
                    "created_utc": 1681939330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jgwf3t6",
            "parent_id": "t1_jgwewyx",
            "score": 7,
            "created_utc": 1681922899.0,
            "replies": [
                {
                    "body": "No they’re still super popular",
                    "author": "Sugarintheorange",
                    "id": "jgwfln2",
                    "parent_id": "t1_jgwf3t6",
                    "score": 28,
                    "created_utc": 1681923091.0,
                    "replies": []
                },
                {
                    "body": "Not at all. My sis is 21, and she has been harassing us to buy her docs since she was 15. They are super popular with the athletic baddies.",
                    "author": "AdBot_1443",
                    "id": "jgwvnql",
                    "parent_id": "t1_jgwf3t6",
                    "score": 12,
                    "created_utc": 1681929327.0,
                    "replies": []
                },
                {
                    "body": "It’s popular with an indie crowd and I know lots of people on TikTok who love these shoes. I wouldn’t say outdated.",
                    "author": "cottagewitchpet",
                    "id": "jgwfmnm",
                    "parent_id": "t1_jgwf3t6",
                    "score": 10,
                    "created_utc": 1681923103.0,
                    "replies": []
                },
                {
                    "body": "I bought an early 20s SB a pair in the past.",
                    "author": "Downtown_Astronauts",
                    "id": "jgx4un7",
                    "parent_id": "t1_jgwf3t6",
                    "score": 5,
                    "created_utc": 1681932870.0,
                    "replies": []
                },
                {
                    "body": ">Yes those are the ones. So she is outdated?\n\nNo, I guess it may be more that they have been \"rediscovered\".\n\nAs /u/Sugarintheorange /u/cottagewitchpet /u/coffeebeanbookgal and /u/AdBot_1443 refer to, they are still popular to a certain extent.  But it certainly isn't as mainstream as it used to be 30 or 40 years ago.  Dr Martens (or DMs) really are a lot more niche than they ever used to be.\n\nBack in the 1970s, 80s and 90s this brand was very much mainstream, from punks to skinheads to goths (and very male).  Not many girls wore this brand at all.\n\nBack in the day it was all about the boots.  Going right up to the 14 eye black or oxblood boots.\n\nDMs have been popular since the 1960s.  Here in the 1960s are [skinheads v hippies](https://imgur.com/a/rH29wVy).  This carried on into the 70s, 80s and 90s.\n\nAlthough [some girls did embrace the look back then as well](https://imgur.com/a/TnmcOvg)\n\nFrom then, of course, it moved on to [punk](https://imgur.com/a/HI2HGjI)\n\nWhen that photo was taken above I was 18 and my then girlfriend looked quite a lot like the blonde girl sitting on the right of the photo.\n\nOf course back then in high school, we weren't allowed to wear boots so, what are now called their \"1461 smooth leather oxford shoes\", were popular among boys in high school.\n\nThe popularity of DMs has really dropped off since the late 1990s/ early 2000s.  They used to be really quite mainstream amongst a lot of working class young men, based on music and cultural links, but that has more or less gone away now.\n\nSince then they have seen something of a resurgance as a bit of a niche fashion brand but nothing like the cultural icon they used to be 30 or 40 years ago.\n\nJust as an aside, there is another brand - Solovair - that essentially make the same product as DM (in fact, they literally did make DMs from the 1950s to the 1980s) but now the two companies have gone their own way and DM manufactures shoes in Thailand but Solovair still manufactures in the UK.  If you google something like \"Solovair v Dr Marten\" you'll see that there is a heated debate online as to which company produces the best boots.",
                    "author": "HecatesCats",
                    "id": "jgxazf8",
                    "parent_id": "t1_jgwf3t6",
                    "score": 6,
                    "created_utc": 1681935181.0,
                    "replies": [
                        {
                            "body": "When I was working in a mall in the early 00s, doc martens were super popular and every girl coveted a pair in a bright color or floral pattern, they seem like they'd be close to due for a comeback based on the trend cycle.",
                            "author": "grimoiregirl",
                            "id": "jgygf6x",
                            "parent_id": "t1_jgxazf8",
                            "score": 5,
                            "created_utc": 1681952543.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😅🤣",
            "author": "ShaArt5",
            "id": "jgwfdti",
            "parent_id": "t1_jgwat5b",
            "score": 7,
            "created_utc": 1681923008.0,
            "replies": []
        },
        {
            "body": "It sounds like you just planned the First Annual SLF M&G✨",
            "author": "Jewels_Gems",
            "id": "jh4464t",
            "parent_id": "t1_jgz5p3s",
            "score": 4,
            "created_utc": 1682057748.0,
            "replies": [
                {
                    "body": "This has already happened.",
                    "author": "sugarintherawr",
                    "id": "ji4syea",
                    "parent_id": "t1_jh4464t",
                    "score": 0,
                    "created_utc": 1682732899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a good way around it :)",
            "author": "desiderataJa",
            "id": "jh7o4b4",
            "parent_id": "t1_jh605w2",
            "score": 1,
            "created_utc": 1682122547.0,
            "replies": []
        },
        {
            "body": "the manic pixie girl trope\n\nkinda hate it bc in many such films the manic pixie girl character has no purpose or identity whatsoever except to help the protagonist along, and people don't work that way.  Just make her an actual mythical sexy fairy not a person why don't they?\n\nsorry for the tangential rant haha",
            "author": "Gemini-Fox",
            "id": "jgx9gug",
            "parent_id": "t1_jgwo1g2",
            "score": 8,
            "created_utc": 1681934613.0,
            "replies": [
                {
                    "body": "💚",
                    "author": "sugarintherawr",
                    "id": "ji4tftp",
                    "parent_id": "t1_jgx9gug",
                    "score": 1,
                    "created_utc": 1682733129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely! 👽",
            "author": "Own-Ad6334",
            "id": "jgwh60g",
            "parent_id": "t1_jgwgq1f",
            "score": 1,
            "created_utc": 1681923697.0,
            "replies": [
                {
                    "body": "Side-EYE. 'Abnormal' is what some people like.",
                    "author": "coffeebeanbookgal",
                    "id": "jgwhkwh",
                    "parent_id": "t1_jgwh60g",
                    "score": 3,
                    "created_utc": 1681923862.0,
                    "replies": [
                        {
                            "body": "Bombastic side-eye\n\nI’m definitely a manic pixie dream girl type of Sugarbaby myself. Lolololol",
                            "author": "Vast_Web_5827",
                            "id": "jgx2ooi",
                            "parent_id": "t1_jgwhkwh",
                            "score": 7,
                            "created_utc": 1681932056.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You should care, not about what I think, but how what you write might not portray you in the best light. Including that you don’t care what others in this community might think. It just all seems problematic. Womp, womp.",
            "author": "SexxxyBunny",
            "id": "jgxqlbt",
            "parent_id": "t1_jgxpy40",
            "score": 7,
            "created_utc": 1681941214.0,
            "replies": []
        },
        {
            "body": ">Had an ex who dressed this way.\n\nMe too, but I was 18 at the time (early 1980s).  Not since then though.\n\nIn some ways though, that is more the sort of look I'd definitely go for in an SB nowadays - recreating my youth.",
            "author": "HecatesCats",
            "id": "jh1rh4y",
            "parent_id": "t1_jgzt4uj",
            "score": 1,
            "created_utc": 1682017085.0,
            "replies": []
        },
        {
            "body": "DMs have been a thing on this side of the pond  since the 80s too 😊",
            "author": "mrssmithsshoes",
            "id": "jgzu3pu",
            "parent_id": "t1_jgxbqz4",
            "score": 8,
            "created_utc": 1681984405.0,
            "replies": []
        },
        {
            "body": "docs have really always been in. IMO.",
            "author": "sdsf9",
            "id": "jgxlv7p",
            "parent_id": "t1_jgwfjef",
            "score": 16,
            "created_utc": 1681939330.0,
            "replies": []
        },
        {
            "body": "No they’re still super popular",
            "author": "Sugarintheorange",
            "id": "jgwfln2",
            "parent_id": "t1_jgwf3t6",
            "score": 28,
            "created_utc": 1681923091.0,
            "replies": []
        },
        {
            "body": "Not at all. My sis is 21, and she has been harassing us to buy her docs since she was 15. They are super popular with the athletic baddies.",
            "author": "AdBot_1443",
            "id": "jgwvnql",
            "parent_id": "t1_jgwf3t6",
            "score": 12,
            "created_utc": 1681929327.0,
            "replies": []
        },
        {
            "body": "It’s popular with an indie crowd and I know lots of people on TikTok who love these shoes. I wouldn’t say outdated.",
            "author": "cottagewitchpet",
            "id": "jgwfmnm",
            "parent_id": "t1_jgwf3t6",
            "score": 10,
            "created_utc": 1681923103.0,
            "replies": []
        },
        {
            "body": "I bought an early 20s SB a pair in the past.",
            "author": "Downtown_Astronauts",
            "id": "jgx4un7",
            "parent_id": "t1_jgwf3t6",
            "score": 5,
            "created_utc": 1681932870.0,
            "replies": []
        },
        {
            "body": ">Yes those are the ones. So she is outdated?\n\nNo, I guess it may be more that they have been \"rediscovered\".\n\nAs /u/Sugarintheorange /u/cottagewitchpet /u/coffeebeanbookgal and /u/AdBot_1443 refer to, they are still popular to a certain extent.  But it certainly isn't as mainstream as it used to be 30 or 40 years ago.  Dr Martens (or DMs) really are a lot more niche than they ever used to be.\n\nBack in the 1970s, 80s and 90s this brand was very much mainstream, from punks to skinheads to goths (and very male).  Not many girls wore this brand at all.\n\nBack in the day it was all about the boots.  Going right up to the 14 eye black or oxblood boots.\n\nDMs have been popular since the 1960s.  Here in the 1960s are [skinheads v hippies](https://imgur.com/a/rH29wVy).  This carried on into the 70s, 80s and 90s.\n\nAlthough [some girls did embrace the look back then as well](https://imgur.com/a/TnmcOvg)\n\nFrom then, of course, it moved on to [punk](https://imgur.com/a/HI2HGjI)\n\nWhen that photo was taken above I was 18 and my then girlfriend looked quite a lot like the blonde girl sitting on the right of the photo.\n\nOf course back then in high school, we weren't allowed to wear boots so, what are now called their \"1461 smooth leather oxford shoes\", were popular among boys in high school.\n\nThe popularity of DMs has really dropped off since the late 1990s/ early 2000s.  They used to be really quite mainstream amongst a lot of working class young men, based on music and cultural links, but that has more or less gone away now.\n\nSince then they have seen something of a resurgance as a bit of a niche fashion brand but nothing like the cultural icon they used to be 30 or 40 years ago.\n\nJust as an aside, there is another brand - Solovair - that essentially make the same product as DM (in fact, they literally did make DMs from the 1950s to the 1980s) but now the two companies have gone their own way and DM manufactures shoes in Thailand but Solovair still manufactures in the UK.  If you google something like \"Solovair v Dr Marten\" you'll see that there is a heated debate online as to which company produces the best boots.",
            "author": "HecatesCats",
            "id": "jgxazf8",
            "parent_id": "t1_jgwf3t6",
            "score": 6,
            "created_utc": 1681935181.0,
            "replies": [
                {
                    "body": "When I was working in a mall in the early 00s, doc martens were super popular and every girl coveted a pair in a bright color or floral pattern, they seem like they'd be close to due for a comeback based on the trend cycle.",
                    "author": "grimoiregirl",
                    "id": "jgygf6x",
                    "parent_id": "t1_jgxazf8",
                    "score": 5,
                    "created_utc": 1681952543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This has already happened.",
            "author": "sugarintherawr",
            "id": "ji4syea",
            "parent_id": "t1_jh4464t",
            "score": 0,
            "created_utc": 1682732899.0,
            "replies": []
        },
        {
            "body": "💚",
            "author": "sugarintherawr",
            "id": "ji4tftp",
            "parent_id": "t1_jgx9gug",
            "score": 1,
            "created_utc": 1682733129.0,
            "replies": []
        },
        {
            "body": "Side-EYE. 'Abnormal' is what some people like.",
            "author": "coffeebeanbookgal",
            "id": "jgwhkwh",
            "parent_id": "t1_jgwh60g",
            "score": 3,
            "created_utc": 1681923862.0,
            "replies": [
                {
                    "body": "Bombastic side-eye\n\nI’m definitely a manic pixie dream girl type of Sugarbaby myself. Lolololol",
                    "author": "Vast_Web_5827",
                    "id": "jgx2ooi",
                    "parent_id": "t1_jgwhkwh",
                    "score": 7,
                    "created_utc": 1681932056.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I was working in a mall in the early 00s, doc martens were super popular and every girl coveted a pair in a bright color or floral pattern, they seem like they'd be close to due for a comeback based on the trend cycle.",
            "author": "grimoiregirl",
            "id": "jgygf6x",
            "parent_id": "t1_jgxazf8",
            "score": 5,
            "created_utc": 1681952543.0,
            "replies": []
        },
        {
            "body": "Bombastic side-eye\n\nI’m definitely a manic pixie dream girl type of Sugarbaby myself. Lolololol",
            "author": "Vast_Web_5827",
            "id": "jgx2ooi",
            "parent_id": "t1_jgwhkwh",
            "score": 7,
            "created_utc": 1681932056.0,
            "replies": []
        }
    ]
}