{
    "title": "Humorous Airport Interaction",
    "post_id": "ey15eb",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ey15eb/humorous_airport_interaction/",
    "author": "not_like_kahlo",
    "body": "So I'm in an airport bar, killing time until I fly back home after my wonderful SD flew me out for a weekend of shopping and extravagant dining experiences. Start chatting with the guy next to me (mid 30s probably), he's waiting to fly home as well and can't wait to get out of the \"awful\" city we're currently in. As he goes on about how much he dislikes the place, a particular annoyance of his comes up: The number of young girls he sees with 60 year old men is \"disturbing,\" and very condescendingly implied those girls are only there for the money. Now I'm not that secretive when it comes to my sugaring lifestyle, and felt that comment deserved an honest response. I let him know I just had a lovely weekend with my older SD, and maybe we just appreciate a man that knows how to treat us well. Both in and out of the bedroom ;) \n\nI doubt I changed his mind, but it was fun to see the look on his face when he realized I was one of those girls he thinks so poorly of. Thought some of you might get a kick out of the story, hope you're all having a lovely Sunday!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ey15eb/humorous_airport_interaction/",
    "score": 208,
    "upvote_ratio": 0.97,
    "created_utc": 1580702953.0,
    "num_comments": 28,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Ask him if he’s offered “Netflix and Chill” for a first date. \n\nI’m in my late 40s, and that’s the complaint I hear the most about that crowd.\n\nHave some game, man. You’re making it too easy for us old fat dudes with money...",
            "author": "EastTexas_SD",
            "id": "fgen8nt",
            "parent_id": "t3_ey15eb",
            "score": 85,
            "created_utc": 1580703838.0,
            "replies": [
                {
                    "body": "\n\n\"those girls are only there for the money.\"   \n\n   \"\" I could explain it to you but you would not understand\"\"",
                    "author": "pinotandsugar",
                    "id": "fgeudkf",
                    "parent_id": "t1_fgen8nt",
                    "score": 19,
                    "created_utc": 1580710349.0,
                    "replies": []
                },
                {
                    "body": "Not even dinner. YUCK!!",
                    "author": null,
                    "id": "fggnpn4",
                    "parent_id": "t1_fgen8nt",
                    "score": 3,
                    "created_utc": 1580765661.0,
                    "replies": []
                },
                {
                    "body": "Extremely well done - you are right. My SB is with me completely happy with our relationship. It is not only about money. Specially in our case that we have a monogamous relationship/agreement.",
                    "author": "SkyiHiker",
                    "id": "fggtayu",
                    "parent_id": "t1_fgen8nt",
                    "score": 1,
                    "created_utc": 1580769079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha. I bet he was trying to impress you. FAILLLLL lol. Guess he has to find another young woman to woo with his judgements and possible offer of buy one get one at Applebee’s.",
            "author": "soullessfreckles",
            "id": "fgfo8df",
            "parent_id": "t3_ey15eb",
            "score": 26,
            "created_utc": 1580743829.0,
            "replies": [
                {
                    "body": "Applebees 🤣🤣🤣🤣🏆",
                    "author": "OliviaWildflower2332",
                    "id": "fgg0gi9",
                    "parent_id": "t1_fgfo8df",
                    "score": 7,
                    "created_utc": 1580751571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ten bucks says he thinks making out on the couch in front of a movie counts as foreplay",
            "author": "Mopsydoll",
            "id": "fgf2s0g",
            "parent_id": "t3_ey15eb",
            "score": 46,
            "created_utc": 1580721265.0,
            "replies": [
                {
                    "body": "It doesn't?!?!?!   :'(",
                    "author": "duckydee543",
                    "id": "fgf9nwe",
                    "parent_id": "t1_fgf2s0g",
                    "score": 15,
                    "created_utc": 1580731393.0,
                    "replies": [
                        {
                            "body": "Hahaha no.",
                            "author": "Mopsydoll",
                            "id": "fgf9z2n",
                            "parent_id": "t1_fgf9nwe",
                            "score": 7,
                            "created_utc": 1580731759.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is awesome.  Would have paid to see the look on his face.  Well done.",
            "author": "MrBuzzard",
            "id": "fgemvcp",
            "parent_id": "t3_ey15eb",
            "score": 20,
            "created_utc": 1580703544.0,
            "replies": []
        },
        {
            "body": "I think a lot of the late 30s men who find it appalling don’t seem to have any issue when they date 10 years younger. They are also most likely to sugar date when they are older and actually have the means to be able to live the lifestyle.\n\nYounger men are often clouded by their own ego. They assume money can be the only reason women do this. Their ego makes them blind. They can’t see that older men act like gentleman, they offer a wealth of life experience, they are generally more skilled in seduction (not just the bedroom). \n\nI am the same in that I don’t really hide my lifestyle, I would have loved to have witnessed that conversation.",
            "author": null,
            "id": "fgf0xgg",
            "parent_id": "t3_ey15eb",
            "score": 29,
            "created_utc": 1580718514.0,
            "replies": [
                {
                    "body": ">Their ego makes them blind.\n\nTruer words have yet to be spoken.",
                    "author": "bsbdfw",
                    "id": "fgfokod",
                    "parent_id": "t1_fgf0xgg",
                    "score": 7,
                    "created_utc": 1580744059.0,
                    "replies": []
                },
                {
                    "body": "It’s bitterness, they know they don’t have enough to Ofer those girl but they still want them to settle for them while those girl have better options. Meanwhile they don’t want to settle for the non attractive girl",
                    "author": "Lilipuss25",
                    "id": "fggxnt4",
                    "parent_id": "t1_fgf0xgg",
                    "score": 3,
                    "created_utc": 1580771879.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fgg21uu",
                    "parent_id": "t1_fgf0xgg",
                    "score": 1,
                    "created_utc": 1580752545.0,
                    "replies": [
                        {
                            "body": "Meet men who come from other countries, and preferably shitty ones.\n\nMy current 34yo SD grew up in Iran(he's Persian, which he always makes a very clear distinction on, lol) and has lived a very full life and is one of the nicest, classiest younger SDs I've ever spoken to. Before I met him I never would have considered a SD so young.",
                            "author": "Rabb1tH3ad",
                            "id": "fgirbze",
                            "parent_id": "t1_fgg21uu",
                            "score": 2,
                            "created_utc": 1580829171.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fgisvce",
                                    "parent_id": "t1_fgirbze",
                                    "score": 1,
                                    "created_utc": 1580830168.0,
                                    "replies": [
                                        {
                                            "body": "Immediately. I met him organically in a bar and we talked for awhile before we realized we both were in the lifestyle, so I found out his age after I already enjoyed his personality.",
                                            "author": "Rabb1tH3ad",
                                            "id": "fgitd80",
                                            "parent_id": "t1_fgisvce",
                                            "score": 1,
                                            "created_utc": 1580830482.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Younger men don’t really understand how to be a gentleman unless they have spent a considerable amount of time with their grandparents I find! It just isn’t apart of how these last two generations act. The awareness just isn’t there. \n\nAnd a younger man can’t really offer much in life experience. It isn’t just in the act of doing things to get experience, it’s the ability to reflect on situations and understand their meaning. That comes with time.",
                            "author": null,
                            "id": "fgh42si",
                            "parent_id": "t1_fgg21uu",
                            "score": 0,
                            "created_utc": 1580776210.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fghn7kr",
                                    "parent_id": "t1_fgh42si",
                                    "score": 1,
                                    "created_utc": 1580788713.0,
                                    "replies": [
                                        {
                                            "body": "I said it comes more with time, not age.\n\nOver time, and after more experiences, we gain a different perspective. It isn’t the fault of a younger man that he doesn’t offer much insight via life experience, he hasn’t had the time to cultivate many experiences and gain a broader perspective on them. \n\nBut when a man in his 30s tells me he can offer a wealth of life experience I roll my eyes. I’m in my early 30s, I’ve lived in 5 countries, traveled others, volunteered for causes that have allowed me to see how different life is for others, experienced suffering and joy, and discovered that the person I thought I knew I was at 25 is not the person I am today, and in a few years time that person will likely be changed again. \n\nMost of the SDs in their 30s that I have spoken to have had a typical upbringing, gone through education, and now are focusing on their career, and there is nothing wrong with that at all. But what wisdom could this man possibly share with me? \n\nThe thing about the generation gap is that an older SD has an insight of being brought up in a world a little different to the world I was brought up in. Their parents offered them an insight from a world my parents can’t. They have had the time to experience more and with each experience brings wisdom that allows a different reflection than at the time they experienced each moment.",
                                            "author": null,
                                            "id": "fghpwx1",
                                            "parent_id": "t1_fghn7kr",
                                            "score": 2,
                                            "created_utc": 1580790631.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Amen.",
                    "author": "BratinaHat",
                    "id": "fghm8tn",
                    "parent_id": "t1_fgf0xgg",
                    "score": 1,
                    "created_utc": 1580788039.0,
                    "replies": []
                },
                {
                    "body": "Good points. \nI believe even at mid to late 30s most men still consider themselves younger and think they still have a chance to change the world. \n\n\nThey most probably have children at home and are invested in raising them still. \n\n\nGive them 10-15 years and the freedom of an empty nest coupled with a dead bedroom.\n Add a dash of menopause. A pinch of  midlife crisis and a heap of idgaf. \nAlong w a paid mortgage and higher earnings. \n\nYeah sugar becomes a viable thing.",
                    "author": "inafishbowl17",
                    "id": "fgnbi8p",
                    "parent_id": "t1_fgf0xgg",
                    "score": 1,
                    "created_utc": 1580941391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "implied those girls are only there for the money.\n\nWhere would he get that idea?? /s",
            "author": "GSSD",
            "id": "fgfi6oo",
            "parent_id": "t3_ey15eb",
            "score": 7,
            "created_utc": 1580739424.0,
            "replies": []
        },
        {
            "body": "I loved this story it made me smile and feel also a it more confident about it all actually",
            "author": null,
            "id": "fgf6mwc",
            "parent_id": "t3_ey15eb",
            "score": 5,
            "created_utc": 1580727311.0,
            "replies": []
        },
        {
            "body": "I was flying back from Ohio for work and my flight home was through Dallas. When I walked on the plane I saw a beautiful younger woman sitting on the aisle seat. I put my bag in front then sat two rows behind her.\n\nWhen the gates closed she reached up and buzz for an attendant. She asked how could she help her and she wanted a drink while still on the runway. She was informed they couldn't serve her until they were airborne. The woman replied that she was scared to death to fly and the only way she got there was stoned. She was freaking out. I went to my bag and gave her something that i used and told her to breath we will get there. Then i sat in my seat.\n\nTwo minutes later the woman was standing in front of me and asked is she could sit next to me. Needless to say I said yes. She sat down and we started talking trying to take her mind off flying. I asked her was she in Ohio for work or family. She leaned down and whispered in the ear that she was seeing her sugar daddy. I think she was trying to shock me. I leaned in and whispered to her that I have had three sugar babies and you have a very lucky daddy.\n\nShe pulled up the arm between us and put her head on my shoulder and I put my arm around her. The next 2:30 minutes of the flight we talked all about the bowl.She had my shirt unbuttoned and my hand was down her leggings playing with her ass.  \n\nThe other male flyers were watching us she kept telling me and I told them they were just jealous. When the flight ended way too soon we stood up and i got her bag. She leaned back and rubbed her ass against me as we waited. She walked in front of me and I held back to see her ass I has been playing with. She stopped before we got off the plane turned around threw her arms around me kissed me on my lips and said loudly \" Thank you Daddy\"\n\nWe took selfies and she gave me her number if I am ever in Dallas.  I might take her up on her offer. There aren't too many places I can share my story. You never know if the person next to you is in the bowl or not.",
            "author": "youngerwomanlove",
            "id": "fgh0q10",
            "parent_id": "t3_ey15eb",
            "score": 3,
            "created_utc": 1580773932.0,
            "replies": [
                {
                    "body": "I loved reading this! Cute how you two met! You also definitely have a knack for story telling ;)",
                    "author": "xxsugabbxx",
                    "id": "fgkak7g",
                    "parent_id": "t1_fgh0q10",
                    "score": 1,
                    "created_utc": 1580861100.0,
                    "replies": [
                        {
                            "body": "I'm glad you enjoyed my story I sure did. Thank you for taking the time to respond.",
                            "author": "youngerwomanlove",
                            "id": "fgkvkcm",
                            "parent_id": "t1_fgkak7g",
                            "score": 1,
                            "created_utc": 1580874605.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good job speaking up girlfriend!",
            "author": null,
            "id": "fggo2m6",
            "parent_id": "t3_ey15eb",
            "score": 3,
            "created_utc": 1580765875.0,
            "replies": []
        },
        {
            "body": "I'm waiting for an experience with a sugar mommy",
            "author": "DutchM11",
            "id": "fgh4436",
            "parent_id": "t3_ey15eb",
            "score": 1,
            "created_utc": 1580776233.0,
            "replies": []
        },
        {
            "body": "Broke older man and poor young man can be so bitter 🤣🤣🤣\n\nIf you are young with potential you’ll find a girl, even a hot one willing to bet on you. If you’re struggling it means you’re I’m personable or appear without potential. Work hard and you’ll get your girl.\n\nFor older broke men, well you should have worked harder",
            "author": "Lilipuss25",
            "id": "fggxdq9",
            "parent_id": "t3_ey15eb",
            "score": 1,
            "created_utc": 1580771697.0,
            "replies": [
                {
                    "body": "Amen.",
                    "author": "BratinaHat",
                    "id": "fghlzgk",
                    "parent_id": "t1_fggxdq9",
                    "score": 1,
                    "created_utc": 1580787860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\n\n\"those girls are only there for the money.\"   \n\n   \"\" I could explain it to you but you would not understand\"\"",
            "author": "pinotandsugar",
            "id": "fgeudkf",
            "parent_id": "t1_fgen8nt",
            "score": 19,
            "created_utc": 1580710349.0,
            "replies": []
        },
        {
            "body": "Not even dinner. YUCK!!",
            "author": null,
            "id": "fggnpn4",
            "parent_id": "t1_fgen8nt",
            "score": 3,
            "created_utc": 1580765661.0,
            "replies": []
        },
        {
            "body": "Extremely well done - you are right. My SB is with me completely happy with our relationship. It is not only about money. Specially in our case that we have a monogamous relationship/agreement.",
            "author": "SkyiHiker",
            "id": "fggtayu",
            "parent_id": "t1_fgen8nt",
            "score": 1,
            "created_utc": 1580769079.0,
            "replies": []
        },
        {
            "body": "Applebees 🤣🤣🤣🤣🏆",
            "author": "OliviaWildflower2332",
            "id": "fgg0gi9",
            "parent_id": "t1_fgfo8df",
            "score": 7,
            "created_utc": 1580751571.0,
            "replies": []
        },
        {
            "body": "It doesn't?!?!?!   :'(",
            "author": "duckydee543",
            "id": "fgf9nwe",
            "parent_id": "t1_fgf2s0g",
            "score": 15,
            "created_utc": 1580731393.0,
            "replies": [
                {
                    "body": "Hahaha no.",
                    "author": "Mopsydoll",
                    "id": "fgf9z2n",
                    "parent_id": "t1_fgf9nwe",
                    "score": 7,
                    "created_utc": 1580731759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Their ego makes them blind.\n\nTruer words have yet to be spoken.",
            "author": "bsbdfw",
            "id": "fgfokod",
            "parent_id": "t1_fgf0xgg",
            "score": 7,
            "created_utc": 1580744059.0,
            "replies": []
        },
        {
            "body": "It’s bitterness, they know they don’t have enough to Ofer those girl but they still want them to settle for them while those girl have better options. Meanwhile they don’t want to settle for the non attractive girl",
            "author": "Lilipuss25",
            "id": "fggxnt4",
            "parent_id": "t1_fgf0xgg",
            "score": 3,
            "created_utc": 1580771879.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fgg21uu",
            "parent_id": "t1_fgf0xgg",
            "score": 1,
            "created_utc": 1580752545.0,
            "replies": [
                {
                    "body": "Meet men who come from other countries, and preferably shitty ones.\n\nMy current 34yo SD grew up in Iran(he's Persian, which he always makes a very clear distinction on, lol) and has lived a very full life and is one of the nicest, classiest younger SDs I've ever spoken to. Before I met him I never would have considered a SD so young.",
                    "author": "Rabb1tH3ad",
                    "id": "fgirbze",
                    "parent_id": "t1_fgg21uu",
                    "score": 2,
                    "created_utc": 1580829171.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fgisvce",
                            "parent_id": "t1_fgirbze",
                            "score": 1,
                            "created_utc": 1580830168.0,
                            "replies": [
                                {
                                    "body": "Immediately. I met him organically in a bar and we talked for awhile before we realized we both were in the lifestyle, so I found out his age after I already enjoyed his personality.",
                                    "author": "Rabb1tH3ad",
                                    "id": "fgitd80",
                                    "parent_id": "t1_fgisvce",
                                    "score": 1,
                                    "created_utc": 1580830482.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Younger men don’t really understand how to be a gentleman unless they have spent a considerable amount of time with their grandparents I find! It just isn’t apart of how these last two generations act. The awareness just isn’t there. \n\nAnd a younger man can’t really offer much in life experience. It isn’t just in the act of doing things to get experience, it’s the ability to reflect on situations and understand their meaning. That comes with time.",
                    "author": null,
                    "id": "fgh42si",
                    "parent_id": "t1_fgg21uu",
                    "score": 0,
                    "created_utc": 1580776210.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fghn7kr",
                            "parent_id": "t1_fgh42si",
                            "score": 1,
                            "created_utc": 1580788713.0,
                            "replies": [
                                {
                                    "body": "I said it comes more with time, not age.\n\nOver time, and after more experiences, we gain a different perspective. It isn’t the fault of a younger man that he doesn’t offer much insight via life experience, he hasn’t had the time to cultivate many experiences and gain a broader perspective on them. \n\nBut when a man in his 30s tells me he can offer a wealth of life experience I roll my eyes. I’m in my early 30s, I’ve lived in 5 countries, traveled others, volunteered for causes that have allowed me to see how different life is for others, experienced suffering and joy, and discovered that the person I thought I knew I was at 25 is not the person I am today, and in a few years time that person will likely be changed again. \n\nMost of the SDs in their 30s that I have spoken to have had a typical upbringing, gone through education, and now are focusing on their career, and there is nothing wrong with that at all. But what wisdom could this man possibly share with me? \n\nThe thing about the generation gap is that an older SD has an insight of being brought up in a world a little different to the world I was brought up in. Their parents offered them an insight from a world my parents can’t. They have had the time to experience more and with each experience brings wisdom that allows a different reflection than at the time they experienced each moment.",
                                    "author": null,
                                    "id": "fghpwx1",
                                    "parent_id": "t1_fghn7kr",
                                    "score": 2,
                                    "created_utc": 1580790631.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Amen.",
            "author": "BratinaHat",
            "id": "fghm8tn",
            "parent_id": "t1_fgf0xgg",
            "score": 1,
            "created_utc": 1580788039.0,
            "replies": []
        },
        {
            "body": "Good points. \nI believe even at mid to late 30s most men still consider themselves younger and think they still have a chance to change the world. \n\n\nThey most probably have children at home and are invested in raising them still. \n\n\nGive them 10-15 years and the freedom of an empty nest coupled with a dead bedroom.\n Add a dash of menopause. A pinch of  midlife crisis and a heap of idgaf. \nAlong w a paid mortgage and higher earnings. \n\nYeah sugar becomes a viable thing.",
            "author": "inafishbowl17",
            "id": "fgnbi8p",
            "parent_id": "t1_fgf0xgg",
            "score": 1,
            "created_utc": 1580941391.0,
            "replies": []
        },
        {
            "body": "I loved reading this! Cute how you two met! You also definitely have a knack for story telling ;)",
            "author": "xxsugabbxx",
            "id": "fgkak7g",
            "parent_id": "t1_fgh0q10",
            "score": 1,
            "created_utc": 1580861100.0,
            "replies": [
                {
                    "body": "I'm glad you enjoyed my story I sure did. Thank you for taking the time to respond.",
                    "author": "youngerwomanlove",
                    "id": "fgkvkcm",
                    "parent_id": "t1_fgkak7g",
                    "score": 1,
                    "created_utc": 1580874605.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Amen.",
            "author": "BratinaHat",
            "id": "fghlzgk",
            "parent_id": "t1_fggxdq9",
            "score": 1,
            "created_utc": 1580787860.0,
            "replies": []
        },
        {
            "body": "Hahaha no.",
            "author": "Mopsydoll",
            "id": "fgf9z2n",
            "parent_id": "t1_fgf9nwe",
            "score": 7,
            "created_utc": 1580731759.0,
            "replies": []
        },
        {
            "body": "Meet men who come from other countries, and preferably shitty ones.\n\nMy current 34yo SD grew up in Iran(he's Persian, which he always makes a very clear distinction on, lol) and has lived a very full life and is one of the nicest, classiest younger SDs I've ever spoken to. Before I met him I never would have considered a SD so young.",
            "author": "Rabb1tH3ad",
            "id": "fgirbze",
            "parent_id": "t1_fgg21uu",
            "score": 2,
            "created_utc": 1580829171.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fgisvce",
                    "parent_id": "t1_fgirbze",
                    "score": 1,
                    "created_utc": 1580830168.0,
                    "replies": [
                        {
                            "body": "Immediately. I met him organically in a bar and we talked for awhile before we realized we both were in the lifestyle, so I found out his age after I already enjoyed his personality.",
                            "author": "Rabb1tH3ad",
                            "id": "fgitd80",
                            "parent_id": "t1_fgisvce",
                            "score": 1,
                            "created_utc": 1580830482.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Younger men don’t really understand how to be a gentleman unless they have spent a considerable amount of time with their grandparents I find! It just isn’t apart of how these last two generations act. The awareness just isn’t there. \n\nAnd a younger man can’t really offer much in life experience. It isn’t just in the act of doing things to get experience, it’s the ability to reflect on situations and understand their meaning. That comes with time.",
            "author": null,
            "id": "fgh42si",
            "parent_id": "t1_fgg21uu",
            "score": 0,
            "created_utc": 1580776210.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fghn7kr",
                    "parent_id": "t1_fgh42si",
                    "score": 1,
                    "created_utc": 1580788713.0,
                    "replies": [
                        {
                            "body": "I said it comes more with time, not age.\n\nOver time, and after more experiences, we gain a different perspective. It isn’t the fault of a younger man that he doesn’t offer much insight via life experience, he hasn’t had the time to cultivate many experiences and gain a broader perspective on them. \n\nBut when a man in his 30s tells me he can offer a wealth of life experience I roll my eyes. I’m in my early 30s, I’ve lived in 5 countries, traveled others, volunteered for causes that have allowed me to see how different life is for others, experienced suffering and joy, and discovered that the person I thought I knew I was at 25 is not the person I am today, and in a few years time that person will likely be changed again. \n\nMost of the SDs in their 30s that I have spoken to have had a typical upbringing, gone through education, and now are focusing on their career, and there is nothing wrong with that at all. But what wisdom could this man possibly share with me? \n\nThe thing about the generation gap is that an older SD has an insight of being brought up in a world a little different to the world I was brought up in. Their parents offered them an insight from a world my parents can’t. They have had the time to experience more and with each experience brings wisdom that allows a different reflection than at the time they experienced each moment.",
                            "author": null,
                            "id": "fghpwx1",
                            "parent_id": "t1_fghn7kr",
                            "score": 2,
                            "created_utc": 1580790631.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm glad you enjoyed my story I sure did. Thank you for taking the time to respond.",
            "author": "youngerwomanlove",
            "id": "fgkvkcm",
            "parent_id": "t1_fgkak7g",
            "score": 1,
            "created_utc": 1580874605.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fgisvce",
            "parent_id": "t1_fgirbze",
            "score": 1,
            "created_utc": 1580830168.0,
            "replies": [
                {
                    "body": "Immediately. I met him organically in a bar and we talked for awhile before we realized we both were in the lifestyle, so I found out his age after I already enjoyed his personality.",
                    "author": "Rabb1tH3ad",
                    "id": "fgitd80",
                    "parent_id": "t1_fgisvce",
                    "score": 1,
                    "created_utc": 1580830482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fghn7kr",
            "parent_id": "t1_fgh42si",
            "score": 1,
            "created_utc": 1580788713.0,
            "replies": [
                {
                    "body": "I said it comes more with time, not age.\n\nOver time, and after more experiences, we gain a different perspective. It isn’t the fault of a younger man that he doesn’t offer much insight via life experience, he hasn’t had the time to cultivate many experiences and gain a broader perspective on them. \n\nBut when a man in his 30s tells me he can offer a wealth of life experience I roll my eyes. I’m in my early 30s, I’ve lived in 5 countries, traveled others, volunteered for causes that have allowed me to see how different life is for others, experienced suffering and joy, and discovered that the person I thought I knew I was at 25 is not the person I am today, and in a few years time that person will likely be changed again. \n\nMost of the SDs in their 30s that I have spoken to have had a typical upbringing, gone through education, and now are focusing on their career, and there is nothing wrong with that at all. But what wisdom could this man possibly share with me? \n\nThe thing about the generation gap is that an older SD has an insight of being brought up in a world a little different to the world I was brought up in. Their parents offered them an insight from a world my parents can’t. They have had the time to experience more and with each experience brings wisdom that allows a different reflection than at the time they experienced each moment.",
                    "author": null,
                    "id": "fghpwx1",
                    "parent_id": "t1_fghn7kr",
                    "score": 2,
                    "created_utc": 1580790631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Immediately. I met him organically in a bar and we talked for awhile before we realized we both were in the lifestyle, so I found out his age after I already enjoyed his personality.",
            "author": "Rabb1tH3ad",
            "id": "fgitd80",
            "parent_id": "t1_fgisvce",
            "score": 1,
            "created_utc": 1580830482.0,
            "replies": []
        },
        {
            "body": "I said it comes more with time, not age.\n\nOver time, and after more experiences, we gain a different perspective. It isn’t the fault of a younger man that he doesn’t offer much insight via life experience, he hasn’t had the time to cultivate many experiences and gain a broader perspective on them. \n\nBut when a man in his 30s tells me he can offer a wealth of life experience I roll my eyes. I’m in my early 30s, I’ve lived in 5 countries, traveled others, volunteered for causes that have allowed me to see how different life is for others, experienced suffering and joy, and discovered that the person I thought I knew I was at 25 is not the person I am today, and in a few years time that person will likely be changed again. \n\nMost of the SDs in their 30s that I have spoken to have had a typical upbringing, gone through education, and now are focusing on their career, and there is nothing wrong with that at all. But what wisdom could this man possibly share with me? \n\nThe thing about the generation gap is that an older SD has an insight of being brought up in a world a little different to the world I was brought up in. Their parents offered them an insight from a world my parents can’t. They have had the time to experience more and with each experience brings wisdom that allows a different reflection than at the time they experienced each moment.",
            "author": null,
            "id": "fghpwx1",
            "parent_id": "t1_fghn7kr",
            "score": 2,
            "created_utc": 1580790631.0,
            "replies": []
        }
    ]
}