{
    "title": "Ji Suk Jin Fails To Hide His Disappointment After Winning A Random SBS Award Instead Of The Grand Prize",
    "post_id": "rmotvm",
    "post_url": "https://www.reddit.com/r/runningman/comments/rmotvm/ji_suk_jin_fails_to_hide_his_disappointment_after/",
    "author": "abgbob",
    "body": "",
    "url": "https://www.koreaboo.com/news/ji-suk-jin-disappointment-random-award-grand-prize/",
    "score": 204,
    "upvote_ratio": 0.96,
    "created_utc": 1640239487.0,
    "num_comments": 67,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I wonder what were the members’ reaction after SJ got this award, and JK got another daesang for MUD. It also kinda sucks for all them how RM has never won a daesang, despite the fact that they should’ve probably won at least once as a whole cast in the past 11 years.",
            "author": "lijiburr",
            "id": "hpnq9y1",
            "parent_id": "t3_rmotvm",
            "score": 131,
            "created_utc": 1640245241.0,
            "replies": [
                {
                    "body": "MUD has the highest ratings on every episode and thats the most important factor for being recognized.",
                    "author": "loldiiij",
                    "id": "hpnvwl9",
                    "parent_id": "t1_hpnq9y1",
                    "score": 56,
                    "created_utc": 1640249708.0,
                    "replies": [
                        {
                            "body": "Yeah, but it sucks for the members that they’ve never won as a group, even during the heydays of the show. MUD winning when RM has never been awarded the daesang doesn’t sit well with some fans, considering RM is still one of the most popular variety shows in Korea and definitely the most popular internationally.",
                            "author": "lijiburr",
                            "id": "hpo66g4",
                            "parent_id": "t1_hpnvwl9",
                            "score": 48,
                            "created_utc": 1640258163.0,
                            "replies": [
                                {
                                    "body": "to be fair, most of the MUD members were nominated for a daesang award which is probably why SBS gave it to MUD's main people vs to just a single person. Thehe only RM members to usually get nominated the award are YJS and KJK. Back then even with RM's popularity, YJS was still the only one. \n\n&#x200B;\n\nRM did get a best variety show awards from SBS because of how good the show itself is. Last time, the mothers of MUD got the daesang award so it's similar now. \n\n&#x200B;\n\nCrazy thing is, KJK technically won 2x in a row.",
                                    "author": "thuglifeforlife",
                                    "id": "hpqoehx",
                                    "parent_id": "t1_hpo66g4",
                                    "score": 9,
                                    "created_utc": 1640300605.0,
                                    "replies": [
                                        {
                                            "body": "> Back then even with RM's popularity, YJS was still the only one.\n\nprobably unpopular opinion but yjs x kjk should've gotten a team daesang at least once at the beginning of rm",
                                            "author": "jumpybouncinglad",
                                            "id": "hq3jfv5",
                                            "parent_id": "t1_hpqoehx",
                                            "score": 3,
                                            "created_utc": 1640571760.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Agreed, in the grand scheme of things, Running Man has done so much for SBS and Hallyu and has had an amazing impact yet haven't been awarded a Daesang. Kinda ridiculous. Even if they gave one of YJS's Daesang to the whole cast, it would've made sense. Or even KJK's one last year since it was their 10th year anniversary.",
                                    "author": "zaichii",
                                    "id": "hpqod0z",
                                    "parent_id": "t1_hpo66g4",
                                    "score": 13,
                                    "created_utc": 1640300586.0,
                                    "replies": []
                                },
                                {
                                    "body": "No, not really. Even at its height of popularity, I wouldn't say Gary or Kwangsoo or Jihyo even Haha of that time deserve Daesang. Top Excellence is more like it. And RM has won multiple Top Excellence as individuals and as a whole team.",
                                    "author": "EnvBlitz",
                                    "id": "hprdh4z",
                                    "parent_id": "t1_hpo66g4",
                                    "score": 2,
                                    "created_utc": 1640312625.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What does MUD stand for im sorry, i dont think i know that acronym for a variety show",
                            "author": null,
                            "id": "hpo6s2k",
                            "parent_id": "t1_hpnvwl9",
                            "score": 10,
                            "created_utc": 1640258624.0,
                            "replies": [
                                {
                                    "body": "My ugly ducking",
                                    "author": "n0cn1l",
                                    "id": "hpo7h1a",
                                    "parent_id": "t1_hpo6s2k",
                                    "score": 15,
                                    "created_utc": 1640259165.0,
                                    "replies": [
                                        {
                                            "body": "Thank you!",
                                            "author": null,
                                            "id": "hpo7j47",
                                            "parent_id": "t1_hpo7h1a",
                                            "score": 2,
                                            "created_utc": 1640259209.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "My or mom ugly duckling not sure.. but i hope you know it",
                                    "author": "MalayAmsel",
                                    "id": "hpo7i8k",
                                    "parent_id": "t1_hpo6s2k",
                                    "score": 1,
                                    "created_utc": 1640259191.0,
                                    "replies": [
                                        {
                                            "body": "I googled it, here in my country it’s called my little old boy? Is it that show with jong kook’s mom and other moms?",
                                            "author": null,
                                            "id": "hpo7r7u",
                                            "parent_id": "t1_hpo7i8k",
                                            "score": 10,
                                            "created_utc": 1640259378.0,
                                            "replies": [
                                                {
                                                    "body": "Yep",
                                                    "author": "MalayAmsel",
                                                    "id": "hpo7tqe",
                                                    "parent_id": "t1_hpo7r7u",
                                                    "score": 2,
                                                    "created_utc": 1640259429.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "My ugly duckling",
                                    "author": "slimshades09",
                                    "id": "hpo7l6s",
                                    "parent_id": "t1_hpo6s2k",
                                    "score": 1,
                                    "created_utc": 1640259253.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But sbs gets the coin from running man sigh",
                            "author": "okaaay2021",
                            "id": "hptn86o",
                            "parent_id": "t1_hpnvwl9",
                            "score": 1,
                            "created_utc": 1640363925.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Because having the whole program get Daesang isn't even that common to begin with. And truth is RM crew as a whole aren't really at that level. Even if multiple members deserve Daesang, it's only for YJS, JSJ and KJK. MUD have more casts that deserve it.",
                    "author": "EnvBlitz",
                    "id": "hprczzx",
                    "parent_id": "t1_hpnq9y1",
                    "score": 4,
                    "created_utc": 1640312397.0,
                    "replies": [
                        {
                            "body": "Yeah unfortunately, the MUD cast members individually have been killing it. I enjoy Running man more but the MUD members are just individually so much more recognizable on the variety space.",
                            "author": "Cedosg",
                            "id": "hpshuid",
                            "parent_id": "t1_hprczzx",
                            "score": 7,
                            "created_utc": 1640337586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "aw, i feel bad for him. i think sbs gave him a special award just to console him that he won’t get the daesang 😭\n\nEdit: format",
            "author": "Other_Will758",
            "id": "hpni71d",
            "parent_id": "t3_rmotvm",
            "score": 113,
            "created_utc": 1640239587.0,
            "replies": [
                {
                    "body": "I think so too.",
                    "author": null,
                    "id": "hpophu0",
                    "parent_id": "t1_hpni71d",
                    "score": 3,
                    "created_utc": 1640269948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not even surprised by this. For 2017 Daesang, they gave it to the Mums who just laugh on screen for like 10mins every week.",
            "author": "sonertimotei",
            "id": "hpnskii",
            "parent_id": "t3_rmotvm",
            "score": 114,
            "created_utc": 1640247025.0,
            "replies": [
                {
                    "body": "When you realize jk's mom got a daesang before him lol",
                    "author": "amazingoopah",
                    "id": "hpoy7v9",
                    "parent_id": "t1_hpnskii",
                    "score": 17,
                    "created_utc": 1640273920.0,
                    "replies": [
                        {
                            "body": "nope,they joined the show in 2018",
                            "author": "sonertimotei",
                            "id": "hpp2vma",
                            "parent_id": "t1_hpoy7v9",
                            "score": 5,
                            "created_utc": 1640275929.0,
                            "replies": [
                                {
                                    "body": "And KJK won a Daesang in 2005 anyways.",
                                    "author": "working-acct",
                                    "id": "hpr4h31",
                                    "parent_id": "t1_hpp2vma",
                                    "score": 4,
                                    "created_utc": 1640308259.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "True. Why they like to do this.",
                    "author": "daikindes",
                    "id": "hpntfzp",
                    "parent_id": "t1_hpnskii",
                    "score": 18,
                    "created_utc": 1640247718.0,
                    "replies": []
                },
                {
                    "body": "Moms from mom’s diary are very funny and comedic, but they didn’t have to receive that award because they aren’t apart of many famous shows and they haven’t been in the entertainment industry for a long time. But I do believe they deserve a award like any other person in the Korean industry.",
                    "author": "Foodieforreal",
                    "id": "hpoedn0",
                    "parent_id": "t1_hpnskii",
                    "score": 11,
                    "created_utc": 1640263932.0,
                    "replies": [
                        {
                            "body": "yeah, a special award category dedicated to them would be good but a Grand Daesang was really ridiculous.",
                            "author": "sonertimotei",
                            "id": "hpooi44",
                            "parent_id": "t1_hpoedn0",
                            "score": 24,
                            "created_utc": 1640269476.0,
                            "replies": [
                                {
                                    "body": "I think the beauty of the show originally was really about the mom's reactions and thoughts rather than their children. Nowadays, the focus does seem to have shifted to more of the actual cast members.",
                                    "author": "Cedosg",
                                    "id": "hpshyoo",
                                    "parent_id": "t1_hpooi44",
                                    "score": 4,
                                    "created_utc": 1640337684.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think SBS did him dirty by giving him some random unheard of award. If they think he doesn't deserve the Daesang(which I think he deserved it), then don't give it. We'll respect your decision.\n\nDon't go patronising him and create some random awards that no one ever heard before. It is ridiculous.",
            "author": "abgbob",
            "id": "hpnig4v",
            "parent_id": "t3_rmotvm",
            "score": 168,
            "created_utc": 1640239749.0,
            "replies": [
                {
                    "body": "I mean hasn't YJS talked about these types of awards. in Yoo Quiz I think? About Jo Se Ho. YJS joked about the nature of awards being one and done and stuff like that but did sincerely say that it is the Network's way of saying we still appreciate what you've done for the year.\n\nEDIT: Found where he talked about it, on his Showterview appearance apparently\n\n> The prize you never heard of, but no one wins it next year. One thing that comes to mind is, not in SBS but…wait what was it? Something like ‘Talk/Music Award.’ But the thing is, don’t put it that way. It’s a message to them. They would like to appreciate their hard work. However, not enough to deserve a prize. That’s when they create a prize",
                    "author": "Yssl",
                    "id": "hpnzwg2",
                    "parent_id": "t1_hpnig4v",
                    "score": 50,
                    "created_utc": 1640253014.0,
                    "replies": []
                },
                {
                    "body": "Actually the award is not new. It had been given out for 2 years already. This year is the 3rd year. The first time was given to Se-hyung in 2019. Last year recipient was Seo Jang-hoon. The new award was actually 'Next Level' award that was won by Jang Do-yeon. But honestly I also thought that Seok-Jin might have a chance to win this year's daesang. Sad that even on MBC he was not nominated. Let's hope he can we a daesang one day.",
                    "author": "sophia8012",
                    "id": "hpoh2gv",
                    "parent_id": "t1_hpnig4v",
                    "score": 21,
                    "created_utc": 1640265537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think JSJ deserves the daesang on SBS, his biggest accolade is on Hangout with Yoo on MBC, so he should win it there instead. But that being said, I understand the disappointment. I think this new award feels more like a slap in the face and it doesn't help that even RM themselves were hyping him up for it",
            "author": "banethor88",
            "id": "hpnoeyz",
            "parent_id": "t3_rmotvm",
            "score": 87,
            "created_utc": 1640243858.0,
            "replies": [
                {
                    "body": "True, everyone can agree to disagree who should win the Daesang. But giving this award out of nowhere feels like patronising, rather than sincere appreciation.",
                    "author": "abgbob",
                    "id": "hpqojhz",
                    "parent_id": "t1_hpnoeyz",
                    "score": 4,
                    "created_utc": 1640300669.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's disappointing to see award shows in Korea handing out these random awards like it's candy bruh. JSJ was a front runner for the daesang this year as well. RM and the members need more acknowledgement and respect from their own station. They've been carrying their variety and entertainment shows for more than a decade yet no Daesangs were awarded up to now.",
            "author": "korlstorks34",
            "id": "hpnwocw",
            "parent_id": "t3_rmotvm",
            "score": 41,
            "created_utc": 1640250335.0,
            "replies": []
        },
        {
            "body": "The whole thing stinks for me, it's inconsistent and buried with so much politics.\n\nIt was weird when all the moms in MUD won the Daesang. How could you award the grand prize to a group of people. Then they did it again this year with the boys for MUD.\n\nIt was weird when Lee Seunggi won the Daesang with his first SBS project after military service. IIRC Jaesuk and Kwangsoo was on fire that year.\n\nIt was weird that they give runningman the best variety show but gave the Daesang to all the MUD guys. If the guys was deserving of the Daesang shouldn't they win best variety show also?\n\nThat's like giving BTS the grand award but they won't win the best male group award. I know it's boring to have most of the awards go to one group or individual but if they're really deserving then go for it.\n\nIt goes to pretty much all award shows. Like those Best Director or Actor award given to a lesser film that year coz they messed up not giving it the year before like an apology(Di Caprio and Steven Spielberg comes to mind)",
            "author": "JADlloyd",
            "id": "hpo2abi",
            "parent_id": "t3_rmotvm",
            "score": 37,
            "created_utc": 1640255000.0,
            "replies": []
        },
        {
            "body": "Beware that the article isn't exactly from a reputable \"news\" website. They're known for clickbait.",
            "author": "BoneToBeWild",
            "id": "hpolgtv",
            "parent_id": "t3_rmotvm",
            "score": 1,
            "created_utc": 1640267941.0,
            "replies": []
        },
        {
            "body": "It felt like one of those 'employee of the month' awards tbh, kinda sucks that even in the award shows they make fun of him too.\n\nI was actually hoping they might give LKS one of these awards for his long service in RM, even if he was on the show only half the year.",
            "author": "amazingoopah",
            "id": "hpox9h3",
            "parent_id": "t3_rmotvm",
            "score": 10,
            "created_utc": 1640273499.0,
            "replies": []
        },
        {
            "body": "For those who said JSJ not at daesang level yet then how did lee seung gi and the moms from MUD win daesang. If they can give them daesang why not JSJ. Even YJS said that theres no outstanding nominees for this year awards. I believe JSJ should be rewarded for his 10 years of hard work in runningman",
            "author": "Blbstw",
            "id": "hq43v1v",
            "parent_id": "t3_rmotvm",
            "score": 6,
            "created_utc": 1640582249.0,
            "replies": [
                {
                    "body": "True. Jongmin also won Daesang for his long service in 1D2N.",
                    "author": "abgbob",
                    "id": "hq440op",
                    "parent_id": "t1_hq43v1v",
                    "score": 3,
                    "created_utc": 1640582340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is not an unheard of award. It existed a few times in past years too and past winners include Yang Sehyun and Seo Janghoon.\n\nAs much as JSJ has done a great job this year, I didn't feel it was daesang caliber. It only felt possible because there was no individual standout performance from anybody else. Compare it to what Yoo Jaesuk did last year for MBC to win the most obvious daesang in recent memory -- he's not on that level. Just being nominated (winning the Entertainer of the Year award) was a pretty good recognition. And let's face it, MUD's viewership rating has been incredible and I thought it was highly unlikely the daesang would go to any other show.\n\nThat being said, I'm not defending SBS's decision this year. Maybe not a daesang, but JSJ's performance still deserved a \"second-half\" award. I kinda appreciate what Lee Kyungkyu did there, saying that he wouldn't accept the award even if he got it. It sounds belittling but afterwards it felt like he's airing JSJ's grievances when JSJ couldn't do it himself.\n\nAlso how daesang itself was handled was weird. I understand that the award should probably go to MUD, but the team award diminishes the weight of the daesang. I would've supported KJK winning it again, either Tak Jaehoon or Lee Sangmin winning it, or Shin Dongyup winning it as a nod to MUD and the other shows he's doing for SBS.",
            "author": "SuddenBag",
            "id": "hpoiw3i",
            "parent_id": "t3_rmotvm",
            "score": 23,
            "created_utc": 1640266567.0,
            "replies": [
                {
                    "body": "May I know where Lee Kyungkyu said that? Did he said it during the award ceremony itself? That guy really have no filter 😅 Really love his straight forwardnesa.",
                    "author": "abgbob",
                    "id": "hpqp1l0",
                    "parent_id": "t1_hpoiw3i",
                    "score": 3,
                    "created_utc": 1640300901.0,
                    "replies": [
                        {
                            "body": "Yes during the ceremony when JSJ was giving his acceptance speech.",
                            "author": "SuddenBag",
                            "id": "hprrisj",
                            "parent_id": "t1_hpqp1l0",
                            "score": 3,
                            "created_utc": 1640319569.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've never watched an awards show (in any country) that felt fair. There's always some decision that feels random or like someone's being cheated.  \nTo me this award says that they wanted to recognize him, but (for whatever reason) didn't want to give him the Daesang. I hope he doesn't take it too personally, he's clearly worked really hard for the show and the fans. I find him hilarious.",
            "author": "TopCoconut2",
            "id": "hpqehfa",
            "parent_id": "t3_rmotvm",
            "score": 6,
            "created_utc": 1640296152.0,
            "replies": [
                {
                    "body": "He didn't even bothered actually. You can see it through his acceptance speech. Few days after the event he went on singing happily on Lee Dong Hwi's Orange Tag show. That's the happiest JSJ I ever seen. He even started workout challenge on his Youtube channel right now, visiting gym to gym. His living his best life.",
                    "author": "Pyeonsae",
                    "id": "hptj2wc",
                    "parent_id": "t1_hpqehfa",
                    "score": 4,
                    "created_utc": 1640361996.0,
                    "replies": [
                        {
                            "body": "Good for him. This is why you can never trust Koreaboo.",
                            "author": "TopCoconut2",
                            "id": "hptnfux",
                            "parent_id": "t1_hptj2wc",
                            "score": 2,
                            "created_utc": 1640364024.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even Bo Pil dan Running Man production team think that the awards is ridiculous. See this week episode, they didn't even put in the clip. They only put Se Chan's winning speech.",
            "author": "abgbob",
            "id": "hq4mvwn",
            "parent_id": "t3_rmotvm",
            "score": 6,
            "created_utc": 1640595930.0,
            "replies": [
                {
                    "body": "I actually surprise they didnt put JSJ award clip. I guess they are really pissed at SBS for what happen to JSJ.",
                    "author": "Ideapad02",
                    "id": "hq5fkhw",
                    "parent_id": "t1_hq4mvwn",
                    "score": 2,
                    "created_utc": 1640616178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All I will say is \"Wanko hyung Fighting!!\"",
            "author": "Benzener",
            "id": "hpqvvt5",
            "parent_id": "t3_rmotvm",
            "score": 5,
            "created_utc": 1640304113.0,
            "replies": []
        },
        {
            "body": "Hardcore fans blowing it a bit out of proportion...  Sure it was a \"made up\" award, but even if the made up award didnt exist, he probably wouldnt have won daesang anyways.  It was a great year for suk jin for sure.  But not to the level of daesang",
            "author": "siumai",
            "id": "hpnrn40",
            "parent_id": "t3_rmotvm",
            "score": 26,
            "created_utc": 1640246296.0,
            "replies": [
                {
                    "body": "That what op said. Sbs shouldn't give him some \"participation\" award. It make him look poor & bad. Even other comedian comment the same.",
                    "author": "azizulaziz88",
                    "id": "hpnry8b",
                    "parent_id": "t1_hpnrn40",
                    "score": 37,
                    "created_utc": 1640246539.0,
                    "replies": [
                        {
                            "body": "True. That's my point. Either Daesang or nothing at all. Not some random bullshit award. This is demeaning and humiliation.",
                            "author": "abgbob",
                            "id": "hpns6ls",
                            "parent_id": "t1_hpnry8b",
                            "score": 13,
                            "created_utc": 1640246721.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sukjin had a Daesang level year for his work on RM and MSG Wannabe. Unfortunately, neither MBC and SBS could fully recognize it. I get MBC but I think SBS dropped the ball this time. MUD is their highest rated variety but then RM had way better ratings at their peak and still no Daesang?",
                    "author": "buddhabear07",
                    "id": "hpo0h60",
                    "parent_id": "t1_hpnrn40",
                    "score": 22,
                    "created_utc": 1640253495.0,
                    "replies": [
                        {
                            "body": "at rm peak, jsj wasnt this good tho...",
                            "author": "shadowmushroom1",
                            "id": "hprq5cj",
                            "parent_id": "t1_hpo0h60",
                            "score": 2,
                            "created_utc": 1640318865.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i think he deserved the daesang this year but it’s not the end yet. there’s always next year and hopefully he win. and i just want to say that he handled it very well when he accepted the award.",
            "author": null,
            "id": "hpo2z18",
            "parent_id": "t3_rmotvm",
            "score": 8,
            "created_utc": 1640255569.0,
            "replies": []
        },
        {
            "body": "I think he's been really funny the past few years and I appreciate how he lets all the younger members tease him when there are people in other shows that would get genuinely offended. However, I wouldn't say he was grand prize worthy this year. (Not saying MUD was. I tried watching that show and disliked it.) \n\nI do agree with complaints I've seen that if they were willing to award the grand prize to a whole team, then they should've given to RM long ago, before MUD.",
            "author": "fadedcosy",
            "id": "hprtjpr",
            "parent_id": "t3_rmotvm",
            "score": 4,
            "created_utc": 1640320641.0,
            "replies": []
        },
        {
            "body": "This is so sad :-( I agree JSJ deserves a Daesang this time.",
            "author": "iwantaspudgun",
            "id": "hpomh2s",
            "parent_id": "t3_rmotvm",
            "score": 6,
            "created_utc": 1640268459.0,
            "replies": []
        },
        {
            "body": "JSJ will still have a chance in future. Don't give up.",
            "author": "jhmelvin",
            "id": "hpo7vm6",
            "parent_id": "t3_rmotvm",
            "score": 6,
            "created_utc": 1640259469.0,
            "replies": []
        },
        {
            "body": "Like OP stated \"Koreaboo clickbait\". Saying he failed to hide disappointment is a bit out of context. I noticed he always smile like this in front of camera. Any expression JSJ make will be regarded as disappointment to Koreaboo.\n\nOf course he expecting a Daesang as he is one of the candidate but I know he still appreciate the award and to say he showed a face of disappointment is a bit too far.\n\nThey announced JSJ's award right before the Daesang. So, to me, he still win the highest individual award as the Daesang was given to a team. The most important thing is, his effort is recognized by the public and that means a lot more for him. Remember when he said he needs only 5 people to acknowledge him as an entertainer in Ep 550",
            "author": "Pyeonsae",
            "id": "hptmii5",
            "parent_id": "t3_rmotvm",
            "score": 2,
            "created_utc": 1640363598.0,
            "replies": []
        },
        {
            "body": "He deserved daesang this time",
            "author": "PsychologicalPrize90",
            "id": "hpolr3t",
            "parent_id": "t3_rmotvm",
            "score": 5,
            "created_utc": 1640268092.0,
            "replies": []
        },
        {
            "body": "He should've won The Grand Prize instead SBS has given him an award that no one has ever heard of,\n\nAward shows are only there to make everyone happy instead of giving awards to deserving ones. Award shows are nothing but façade.",
            "author": "NavdeepNSG",
            "id": "hpnock9",
            "parent_id": "t3_rmotvm",
            "score": 7,
            "created_utc": 1640243811.0,
            "replies": [
                {
                    "body": "That's the sad reality. It's full of political motives",
                    "author": "abgbob",
                    "id": "hpqp6lq",
                    "parent_id": "t1_hpnock9",
                    "score": 2,
                    "created_utc": 1640300966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hpofi0g",
            "parent_id": "t3_rmotvm",
            "score": -12,
            "created_utc": 1640264615.0,
            "replies": [
                {
                    "body": "Apparently you're missing the point of the discussion here. Read again.",
                    "author": "abgbob",
                    "id": "hpqpd44",
                    "parent_id": "t1_hpofi0g",
                    "score": 1,
                    "created_utc": 1640301049.0,
                    "replies": [
                        {
                            "body": "apparently",
                            "author": "duracell_bbunny",
                            "id": "hput0th",
                            "parent_id": "t1_hpqpd44",
                            "score": 1,
                            "created_utc": 1640383805.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe it's about time Ji Suk Jin accepted his role as the side character",
            "author": null,
            "id": "hpopy6v",
            "parent_id": "t3_rmotvm",
            "score": -8,
            "created_utc": 1640270162.0,
            "replies": []
        },
        {
            "body": "This is never gonna happen but they just gotta start doing one award show for the three public networks",
            "author": "I_AmPotatoGirl",
            "id": "hpql9i8",
            "parent_id": "t3_rmotvm",
            "score": 1,
            "created_utc": 1640299167.0,
            "replies": [
                {
                    "body": "if they start doing one award show for all public networks , yjs will win every single daesang until the day he retired",
                    "author": "jumpybouncinglad",
                    "id": "hq3kcdn",
                    "parent_id": "t1_hpql9i8",
                    "score": 2,
                    "created_utc": 1640572197.0,
                    "replies": [
                        {
                            "body": "Not really.  He doesn’t really have a lot of big programs on the public networks anymore like he use to.  He’s still the best at what he does but there would be plenty more deserving candidates and there would be less “pity” winners as well.",
                            "author": "I_AmPotatoGirl",
                            "id": "hq3ow8r",
                            "parent_id": "t1_hq3kcdn",
                            "score": 1,
                            "created_utc": 1640574393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "MUD has the highest ratings on every episode and thats the most important factor for being recognized.",
            "author": "loldiiij",
            "id": "hpnvwl9",
            "parent_id": "t1_hpnq9y1",
            "score": 56,
            "created_utc": 1640249708.0,
            "replies": [
                {
                    "body": "Yeah, but it sucks for the members that they’ve never won as a group, even during the heydays of the show. MUD winning when RM has never been awarded the daesang doesn’t sit well with some fans, considering RM is still one of the most popular variety shows in Korea and definitely the most popular internationally.",
                    "author": "lijiburr",
                    "id": "hpo66g4",
                    "parent_id": "t1_hpnvwl9",
                    "score": 48,
                    "created_utc": 1640258163.0,
                    "replies": [
                        {
                            "body": "to be fair, most of the MUD members were nominated for a daesang award which is probably why SBS gave it to MUD's main people vs to just a single person. Thehe only RM members to usually get nominated the award are YJS and KJK. Back then even with RM's popularity, YJS was still the only one. \n\n&#x200B;\n\nRM did get a best variety show awards from SBS because of how good the show itself is. Last time, the mothers of MUD got the daesang award so it's similar now. \n\n&#x200B;\n\nCrazy thing is, KJK technically won 2x in a row.",
                            "author": "thuglifeforlife",
                            "id": "hpqoehx",
                            "parent_id": "t1_hpo66g4",
                            "score": 9,
                            "created_utc": 1640300605.0,
                            "replies": [
                                {
                                    "body": "> Back then even with RM's popularity, YJS was still the only one.\n\nprobably unpopular opinion but yjs x kjk should've gotten a team daesang at least once at the beginning of rm",
                                    "author": "jumpybouncinglad",
                                    "id": "hq3jfv5",
                                    "parent_id": "t1_hpqoehx",
                                    "score": 3,
                                    "created_utc": 1640571760.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Agreed, in the grand scheme of things, Running Man has done so much for SBS and Hallyu and has had an amazing impact yet haven't been awarded a Daesang. Kinda ridiculous. Even if they gave one of YJS's Daesang to the whole cast, it would've made sense. Or even KJK's one last year since it was their 10th year anniversary.",
                            "author": "zaichii",
                            "id": "hpqod0z",
                            "parent_id": "t1_hpo66g4",
                            "score": 13,
                            "created_utc": 1640300586.0,
                            "replies": []
                        },
                        {
                            "body": "No, not really. Even at its height of popularity, I wouldn't say Gary or Kwangsoo or Jihyo even Haha of that time deserve Daesang. Top Excellence is more like it. And RM has won multiple Top Excellence as individuals and as a whole team.",
                            "author": "EnvBlitz",
                            "id": "hprdh4z",
                            "parent_id": "t1_hpo66g4",
                            "score": 2,
                            "created_utc": 1640312625.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What does MUD stand for im sorry, i dont think i know that acronym for a variety show",
                    "author": null,
                    "id": "hpo6s2k",
                    "parent_id": "t1_hpnvwl9",
                    "score": 10,
                    "created_utc": 1640258624.0,
                    "replies": [
                        {
                            "body": "My ugly ducking",
                            "author": "n0cn1l",
                            "id": "hpo7h1a",
                            "parent_id": "t1_hpo6s2k",
                            "score": 15,
                            "created_utc": 1640259165.0,
                            "replies": [
                                {
                                    "body": "Thank you!",
                                    "author": null,
                                    "id": "hpo7j47",
                                    "parent_id": "t1_hpo7h1a",
                                    "score": 2,
                                    "created_utc": 1640259209.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My or mom ugly duckling not sure.. but i hope you know it",
                            "author": "MalayAmsel",
                            "id": "hpo7i8k",
                            "parent_id": "t1_hpo6s2k",
                            "score": 1,
                            "created_utc": 1640259191.0,
                            "replies": [
                                {
                                    "body": "I googled it, here in my country it’s called my little old boy? Is it that show with jong kook’s mom and other moms?",
                                    "author": null,
                                    "id": "hpo7r7u",
                                    "parent_id": "t1_hpo7i8k",
                                    "score": 10,
                                    "created_utc": 1640259378.0,
                                    "replies": [
                                        {
                                            "body": "Yep",
                                            "author": "MalayAmsel",
                                            "id": "hpo7tqe",
                                            "parent_id": "t1_hpo7r7u",
                                            "score": 2,
                                            "created_utc": 1640259429.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "My ugly duckling",
                            "author": "slimshades09",
                            "id": "hpo7l6s",
                            "parent_id": "t1_hpo6s2k",
                            "score": 1,
                            "created_utc": 1640259253.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But sbs gets the coin from running man sigh",
                    "author": "okaaay2021",
                    "id": "hptn86o",
                    "parent_id": "t1_hpnvwl9",
                    "score": 1,
                    "created_utc": 1640363925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because having the whole program get Daesang isn't even that common to begin with. And truth is RM crew as a whole aren't really at that level. Even if multiple members deserve Daesang, it's only for YJS, JSJ and KJK. MUD have more casts that deserve it.",
            "author": "EnvBlitz",
            "id": "hprczzx",
            "parent_id": "t1_hpnq9y1",
            "score": 4,
            "created_utc": 1640312397.0,
            "replies": [
                {
                    "body": "Yeah unfortunately, the MUD cast members individually have been killing it. I enjoy Running man more but the MUD members are just individually so much more recognizable on the variety space.",
                    "author": "Cedosg",
                    "id": "hpshuid",
                    "parent_id": "t1_hprczzx",
                    "score": 7,
                    "created_utc": 1640337586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think so too.",
            "author": null,
            "id": "hpophu0",
            "parent_id": "t1_hpni71d",
            "score": 3,
            "created_utc": 1640269948.0,
            "replies": []
        },
        {
            "body": "When you realize jk's mom got a daesang before him lol",
            "author": "amazingoopah",
            "id": "hpoy7v9",
            "parent_id": "t1_hpnskii",
            "score": 17,
            "created_utc": 1640273920.0,
            "replies": [
                {
                    "body": "nope,they joined the show in 2018",
                    "author": "sonertimotei",
                    "id": "hpp2vma",
                    "parent_id": "t1_hpoy7v9",
                    "score": 5,
                    "created_utc": 1640275929.0,
                    "replies": [
                        {
                            "body": "And KJK won a Daesang in 2005 anyways.",
                            "author": "working-acct",
                            "id": "hpr4h31",
                            "parent_id": "t1_hpp2vma",
                            "score": 4,
                            "created_utc": 1640308259.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True. Why they like to do this.",
            "author": "daikindes",
            "id": "hpntfzp",
            "parent_id": "t1_hpnskii",
            "score": 18,
            "created_utc": 1640247718.0,
            "replies": []
        },
        {
            "body": "Moms from mom’s diary are very funny and comedic, but they didn’t have to receive that award because they aren’t apart of many famous shows and they haven’t been in the entertainment industry for a long time. But I do believe they deserve a award like any other person in the Korean industry.",
            "author": "Foodieforreal",
            "id": "hpoedn0",
            "parent_id": "t1_hpnskii",
            "score": 11,
            "created_utc": 1640263932.0,
            "replies": [
                {
                    "body": "yeah, a special award category dedicated to them would be good but a Grand Daesang was really ridiculous.",
                    "author": "sonertimotei",
                    "id": "hpooi44",
                    "parent_id": "t1_hpoedn0",
                    "score": 24,
                    "created_utc": 1640269476.0,
                    "replies": [
                        {
                            "body": "I think the beauty of the show originally was really about the mom's reactions and thoughts rather than their children. Nowadays, the focus does seem to have shifted to more of the actual cast members.",
                            "author": "Cedosg",
                            "id": "hpshyoo",
                            "parent_id": "t1_hpooi44",
                            "score": 4,
                            "created_utc": 1640337684.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean hasn't YJS talked about these types of awards. in Yoo Quiz I think? About Jo Se Ho. YJS joked about the nature of awards being one and done and stuff like that but did sincerely say that it is the Network's way of saying we still appreciate what you've done for the year.\n\nEDIT: Found where he talked about it, on his Showterview appearance apparently\n\n> The prize you never heard of, but no one wins it next year. One thing that comes to mind is, not in SBS but…wait what was it? Something like ‘Talk/Music Award.’ But the thing is, don’t put it that way. It’s a message to them. They would like to appreciate their hard work. However, not enough to deserve a prize. That’s when they create a prize",
            "author": "Yssl",
            "id": "hpnzwg2",
            "parent_id": "t1_hpnig4v",
            "score": 50,
            "created_utc": 1640253014.0,
            "replies": []
        },
        {
            "body": "Actually the award is not new. It had been given out for 2 years already. This year is the 3rd year. The first time was given to Se-hyung in 2019. Last year recipient was Seo Jang-hoon. The new award was actually 'Next Level' award that was won by Jang Do-yeon. But honestly I also thought that Seok-Jin might have a chance to win this year's daesang. Sad that even on MBC he was not nominated. Let's hope he can we a daesang one day.",
            "author": "sophia8012",
            "id": "hpoh2gv",
            "parent_id": "t1_hpnig4v",
            "score": 21,
            "created_utc": 1640265537.0,
            "replies": []
        },
        {
            "body": "True, everyone can agree to disagree who should win the Daesang. But giving this award out of nowhere feels like patronising, rather than sincere appreciation.",
            "author": "abgbob",
            "id": "hpqojhz",
            "parent_id": "t1_hpnoeyz",
            "score": 4,
            "created_utc": 1640300669.0,
            "replies": []
        },
        {
            "body": "True. Jongmin also won Daesang for his long service in 1D2N.",
            "author": "abgbob",
            "id": "hq440op",
            "parent_id": "t1_hq43v1v",
            "score": 3,
            "created_utc": 1640582340.0,
            "replies": []
        },
        {
            "body": "May I know where Lee Kyungkyu said that? Did he said it during the award ceremony itself? That guy really have no filter 😅 Really love his straight forwardnesa.",
            "author": "abgbob",
            "id": "hpqp1l0",
            "parent_id": "t1_hpoiw3i",
            "score": 3,
            "created_utc": 1640300901.0,
            "replies": [
                {
                    "body": "Yes during the ceremony when JSJ was giving his acceptance speech.",
                    "author": "SuddenBag",
                    "id": "hprrisj",
                    "parent_id": "t1_hpqp1l0",
                    "score": 3,
                    "created_utc": 1640319569.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He didn't even bothered actually. You can see it through his acceptance speech. Few days after the event he went on singing happily on Lee Dong Hwi's Orange Tag show. That's the happiest JSJ I ever seen. He even started workout challenge on his Youtube channel right now, visiting gym to gym. His living his best life.",
            "author": "Pyeonsae",
            "id": "hptj2wc",
            "parent_id": "t1_hpqehfa",
            "score": 4,
            "created_utc": 1640361996.0,
            "replies": [
                {
                    "body": "Good for him. This is why you can never trust Koreaboo.",
                    "author": "TopCoconut2",
                    "id": "hptnfux",
                    "parent_id": "t1_hptj2wc",
                    "score": 2,
                    "created_utc": 1640364024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually surprise they didnt put JSJ award clip. I guess they are really pissed at SBS for what happen to JSJ.",
            "author": "Ideapad02",
            "id": "hq5fkhw",
            "parent_id": "t1_hq4mvwn",
            "score": 2,
            "created_utc": 1640616178.0,
            "replies": []
        },
        {
            "body": "That what op said. Sbs shouldn't give him some \"participation\" award. It make him look poor & bad. Even other comedian comment the same.",
            "author": "azizulaziz88",
            "id": "hpnry8b",
            "parent_id": "t1_hpnrn40",
            "score": 37,
            "created_utc": 1640246539.0,
            "replies": [
                {
                    "body": "True. That's my point. Either Daesang or nothing at all. Not some random bullshit award. This is demeaning and humiliation.",
                    "author": "abgbob",
                    "id": "hpns6ls",
                    "parent_id": "t1_hpnry8b",
                    "score": 13,
                    "created_utc": 1640246721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sukjin had a Daesang level year for his work on RM and MSG Wannabe. Unfortunately, neither MBC and SBS could fully recognize it. I get MBC but I think SBS dropped the ball this time. MUD is their highest rated variety but then RM had way better ratings at their peak and still no Daesang?",
            "author": "buddhabear07",
            "id": "hpo0h60",
            "parent_id": "t1_hpnrn40",
            "score": 22,
            "created_utc": 1640253495.0,
            "replies": [
                {
                    "body": "at rm peak, jsj wasnt this good tho...",
                    "author": "shadowmushroom1",
                    "id": "hprq5cj",
                    "parent_id": "t1_hpo0h60",
                    "score": 2,
                    "created_utc": 1640318865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's the sad reality. It's full of political motives",
            "author": "abgbob",
            "id": "hpqp6lq",
            "parent_id": "t1_hpnock9",
            "score": 2,
            "created_utc": 1640300966.0,
            "replies": []
        },
        {
            "body": "Apparently you're missing the point of the discussion here. Read again.",
            "author": "abgbob",
            "id": "hpqpd44",
            "parent_id": "t1_hpofi0g",
            "score": 1,
            "created_utc": 1640301049.0,
            "replies": [
                {
                    "body": "apparently",
                    "author": "duracell_bbunny",
                    "id": "hput0th",
                    "parent_id": "t1_hpqpd44",
                    "score": 1,
                    "created_utc": 1640383805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "if they start doing one award show for all public networks , yjs will win every single daesang until the day he retired",
            "author": "jumpybouncinglad",
            "id": "hq3kcdn",
            "parent_id": "t1_hpql9i8",
            "score": 2,
            "created_utc": 1640572197.0,
            "replies": [
                {
                    "body": "Not really.  He doesn’t really have a lot of big programs on the public networks anymore like he use to.  He’s still the best at what he does but there would be plenty more deserving candidates and there would be less “pity” winners as well.",
                    "author": "I_AmPotatoGirl",
                    "id": "hq3ow8r",
                    "parent_id": "t1_hq3kcdn",
                    "score": 1,
                    "created_utc": 1640574393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, but it sucks for the members that they’ve never won as a group, even during the heydays of the show. MUD winning when RM has never been awarded the daesang doesn’t sit well with some fans, considering RM is still one of the most popular variety shows in Korea and definitely the most popular internationally.",
            "author": "lijiburr",
            "id": "hpo66g4",
            "parent_id": "t1_hpnvwl9",
            "score": 48,
            "created_utc": 1640258163.0,
            "replies": [
                {
                    "body": "to be fair, most of the MUD members were nominated for a daesang award which is probably why SBS gave it to MUD's main people vs to just a single person. Thehe only RM members to usually get nominated the award are YJS and KJK. Back then even with RM's popularity, YJS was still the only one. \n\n&#x200B;\n\nRM did get a best variety show awards from SBS because of how good the show itself is. Last time, the mothers of MUD got the daesang award so it's similar now. \n\n&#x200B;\n\nCrazy thing is, KJK technically won 2x in a row.",
                    "author": "thuglifeforlife",
                    "id": "hpqoehx",
                    "parent_id": "t1_hpo66g4",
                    "score": 9,
                    "created_utc": 1640300605.0,
                    "replies": [
                        {
                            "body": "> Back then even with RM's popularity, YJS was still the only one.\n\nprobably unpopular opinion but yjs x kjk should've gotten a team daesang at least once at the beginning of rm",
                            "author": "jumpybouncinglad",
                            "id": "hq3jfv5",
                            "parent_id": "t1_hpqoehx",
                            "score": 3,
                            "created_utc": 1640571760.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed, in the grand scheme of things, Running Man has done so much for SBS and Hallyu and has had an amazing impact yet haven't been awarded a Daesang. Kinda ridiculous. Even if they gave one of YJS's Daesang to the whole cast, it would've made sense. Or even KJK's one last year since it was their 10th year anniversary.",
                    "author": "zaichii",
                    "id": "hpqod0z",
                    "parent_id": "t1_hpo66g4",
                    "score": 13,
                    "created_utc": 1640300586.0,
                    "replies": []
                },
                {
                    "body": "No, not really. Even at its height of popularity, I wouldn't say Gary or Kwangsoo or Jihyo even Haha of that time deserve Daesang. Top Excellence is more like it. And RM has won multiple Top Excellence as individuals and as a whole team.",
                    "author": "EnvBlitz",
                    "id": "hprdh4z",
                    "parent_id": "t1_hpo66g4",
                    "score": 2,
                    "created_utc": 1640312625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does MUD stand for im sorry, i dont think i know that acronym for a variety show",
            "author": null,
            "id": "hpo6s2k",
            "parent_id": "t1_hpnvwl9",
            "score": 10,
            "created_utc": 1640258624.0,
            "replies": [
                {
                    "body": "My ugly ducking",
                    "author": "n0cn1l",
                    "id": "hpo7h1a",
                    "parent_id": "t1_hpo6s2k",
                    "score": 15,
                    "created_utc": 1640259165.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": null,
                            "id": "hpo7j47",
                            "parent_id": "t1_hpo7h1a",
                            "score": 2,
                            "created_utc": 1640259209.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My or mom ugly duckling not sure.. but i hope you know it",
                    "author": "MalayAmsel",
                    "id": "hpo7i8k",
                    "parent_id": "t1_hpo6s2k",
                    "score": 1,
                    "created_utc": 1640259191.0,
                    "replies": [
                        {
                            "body": "I googled it, here in my country it’s called my little old boy? Is it that show with jong kook’s mom and other moms?",
                            "author": null,
                            "id": "hpo7r7u",
                            "parent_id": "t1_hpo7i8k",
                            "score": 10,
                            "created_utc": 1640259378.0,
                            "replies": [
                                {
                                    "body": "Yep",
                                    "author": "MalayAmsel",
                                    "id": "hpo7tqe",
                                    "parent_id": "t1_hpo7r7u",
                                    "score": 2,
                                    "created_utc": 1640259429.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "My ugly duckling",
                    "author": "slimshades09",
                    "id": "hpo7l6s",
                    "parent_id": "t1_hpo6s2k",
                    "score": 1,
                    "created_utc": 1640259253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But sbs gets the coin from running man sigh",
            "author": "okaaay2021",
            "id": "hptn86o",
            "parent_id": "t1_hpnvwl9",
            "score": 1,
            "created_utc": 1640363925.0,
            "replies": []
        },
        {
            "body": "Yeah unfortunately, the MUD cast members individually have been killing it. I enjoy Running man more but the MUD members are just individually so much more recognizable on the variety space.",
            "author": "Cedosg",
            "id": "hpshuid",
            "parent_id": "t1_hprczzx",
            "score": 7,
            "created_utc": 1640337586.0,
            "replies": []
        },
        {
            "body": "nope,they joined the show in 2018",
            "author": "sonertimotei",
            "id": "hpp2vma",
            "parent_id": "t1_hpoy7v9",
            "score": 5,
            "created_utc": 1640275929.0,
            "replies": [
                {
                    "body": "And KJK won a Daesang in 2005 anyways.",
                    "author": "working-acct",
                    "id": "hpr4h31",
                    "parent_id": "t1_hpp2vma",
                    "score": 4,
                    "created_utc": 1640308259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeah, a special award category dedicated to them would be good but a Grand Daesang was really ridiculous.",
            "author": "sonertimotei",
            "id": "hpooi44",
            "parent_id": "t1_hpoedn0",
            "score": 24,
            "created_utc": 1640269476.0,
            "replies": [
                {
                    "body": "I think the beauty of the show originally was really about the mom's reactions and thoughts rather than their children. Nowadays, the focus does seem to have shifted to more of the actual cast members.",
                    "author": "Cedosg",
                    "id": "hpshyoo",
                    "parent_id": "t1_hpooi44",
                    "score": 4,
                    "created_utc": 1640337684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes during the ceremony when JSJ was giving his acceptance speech.",
            "author": "SuddenBag",
            "id": "hprrisj",
            "parent_id": "t1_hpqp1l0",
            "score": 3,
            "created_utc": 1640319569.0,
            "replies": []
        },
        {
            "body": "Good for him. This is why you can never trust Koreaboo.",
            "author": "TopCoconut2",
            "id": "hptnfux",
            "parent_id": "t1_hptj2wc",
            "score": 2,
            "created_utc": 1640364024.0,
            "replies": []
        },
        {
            "body": "True. That's my point. Either Daesang or nothing at all. Not some random bullshit award. This is demeaning and humiliation.",
            "author": "abgbob",
            "id": "hpns6ls",
            "parent_id": "t1_hpnry8b",
            "score": 13,
            "created_utc": 1640246721.0,
            "replies": []
        },
        {
            "body": "at rm peak, jsj wasnt this good tho...",
            "author": "shadowmushroom1",
            "id": "hprq5cj",
            "parent_id": "t1_hpo0h60",
            "score": 2,
            "created_utc": 1640318865.0,
            "replies": []
        },
        {
            "body": "apparently",
            "author": "duracell_bbunny",
            "id": "hput0th",
            "parent_id": "t1_hpqpd44",
            "score": 1,
            "created_utc": 1640383805.0,
            "replies": []
        },
        {
            "body": "Not really.  He doesn’t really have a lot of big programs on the public networks anymore like he use to.  He’s still the best at what he does but there would be plenty more deserving candidates and there would be less “pity” winners as well.",
            "author": "I_AmPotatoGirl",
            "id": "hq3ow8r",
            "parent_id": "t1_hq3kcdn",
            "score": 1,
            "created_utc": 1640574393.0,
            "replies": []
        },
        {
            "body": "to be fair, most of the MUD members were nominated for a daesang award which is probably why SBS gave it to MUD's main people vs to just a single person. Thehe only RM members to usually get nominated the award are YJS and KJK. Back then even with RM's popularity, YJS was still the only one. \n\n&#x200B;\n\nRM did get a best variety show awards from SBS because of how good the show itself is. Last time, the mothers of MUD got the daesang award so it's similar now. \n\n&#x200B;\n\nCrazy thing is, KJK technically won 2x in a row.",
            "author": "thuglifeforlife",
            "id": "hpqoehx",
            "parent_id": "t1_hpo66g4",
            "score": 9,
            "created_utc": 1640300605.0,
            "replies": [
                {
                    "body": "> Back then even with RM's popularity, YJS was still the only one.\n\nprobably unpopular opinion but yjs x kjk should've gotten a team daesang at least once at the beginning of rm",
                    "author": "jumpybouncinglad",
                    "id": "hq3jfv5",
                    "parent_id": "t1_hpqoehx",
                    "score": 3,
                    "created_utc": 1640571760.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed, in the grand scheme of things, Running Man has done so much for SBS and Hallyu and has had an amazing impact yet haven't been awarded a Daesang. Kinda ridiculous. Even if they gave one of YJS's Daesang to the whole cast, it would've made sense. Or even KJK's one last year since it was their 10th year anniversary.",
            "author": "zaichii",
            "id": "hpqod0z",
            "parent_id": "t1_hpo66g4",
            "score": 13,
            "created_utc": 1640300586.0,
            "replies": []
        },
        {
            "body": "No, not really. Even at its height of popularity, I wouldn't say Gary or Kwangsoo or Jihyo even Haha of that time deserve Daesang. Top Excellence is more like it. And RM has won multiple Top Excellence as individuals and as a whole team.",
            "author": "EnvBlitz",
            "id": "hprdh4z",
            "parent_id": "t1_hpo66g4",
            "score": 2,
            "created_utc": 1640312625.0,
            "replies": []
        },
        {
            "body": "My ugly ducking",
            "author": "n0cn1l",
            "id": "hpo7h1a",
            "parent_id": "t1_hpo6s2k",
            "score": 15,
            "created_utc": 1640259165.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": null,
                    "id": "hpo7j47",
                    "parent_id": "t1_hpo7h1a",
                    "score": 2,
                    "created_utc": 1640259209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My or mom ugly duckling not sure.. but i hope you know it",
            "author": "MalayAmsel",
            "id": "hpo7i8k",
            "parent_id": "t1_hpo6s2k",
            "score": 1,
            "created_utc": 1640259191.0,
            "replies": [
                {
                    "body": "I googled it, here in my country it’s called my little old boy? Is it that show with jong kook’s mom and other moms?",
                    "author": null,
                    "id": "hpo7r7u",
                    "parent_id": "t1_hpo7i8k",
                    "score": 10,
                    "created_utc": 1640259378.0,
                    "replies": [
                        {
                            "body": "Yep",
                            "author": "MalayAmsel",
                            "id": "hpo7tqe",
                            "parent_id": "t1_hpo7r7u",
                            "score": 2,
                            "created_utc": 1640259429.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My ugly duckling",
            "author": "slimshades09",
            "id": "hpo7l6s",
            "parent_id": "t1_hpo6s2k",
            "score": 1,
            "created_utc": 1640259253.0,
            "replies": []
        },
        {
            "body": "And KJK won a Daesang in 2005 anyways.",
            "author": "working-acct",
            "id": "hpr4h31",
            "parent_id": "t1_hpp2vma",
            "score": 4,
            "created_utc": 1640308259.0,
            "replies": []
        },
        {
            "body": "I think the beauty of the show originally was really about the mom's reactions and thoughts rather than their children. Nowadays, the focus does seem to have shifted to more of the actual cast members.",
            "author": "Cedosg",
            "id": "hpshyoo",
            "parent_id": "t1_hpooi44",
            "score": 4,
            "created_utc": 1640337684.0,
            "replies": []
        },
        {
            "body": "> Back then even with RM's popularity, YJS was still the only one.\n\nprobably unpopular opinion but yjs x kjk should've gotten a team daesang at least once at the beginning of rm",
            "author": "jumpybouncinglad",
            "id": "hq3jfv5",
            "parent_id": "t1_hpqoehx",
            "score": 3,
            "created_utc": 1640571760.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": null,
            "id": "hpo7j47",
            "parent_id": "t1_hpo7h1a",
            "score": 2,
            "created_utc": 1640259209.0,
            "replies": []
        },
        {
            "body": "I googled it, here in my country it’s called my little old boy? Is it that show with jong kook’s mom and other moms?",
            "author": null,
            "id": "hpo7r7u",
            "parent_id": "t1_hpo7i8k",
            "score": 10,
            "created_utc": 1640259378.0,
            "replies": [
                {
                    "body": "Yep",
                    "author": "MalayAmsel",
                    "id": "hpo7tqe",
                    "parent_id": "t1_hpo7r7u",
                    "score": 2,
                    "created_utc": 1640259429.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep",
            "author": "MalayAmsel",
            "id": "hpo7tqe",
            "parent_id": "t1_hpo7r7u",
            "score": 2,
            "created_utc": 1640259429.0,
            "replies": []
        }
    ]
}