{
    "title": "My first SD just passed away...",
    "post_id": "cnj5s5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cnj5s5/my_first_sd_just_passed_away/",
    "author": "slinkyinthebag",
    "body": "The last two months have mostly been spent with work, auditions, and hospital visits. I’ve been neglecting a lot of my social life. Mostly because my friends and I don’t share the same interests anymore. I’m going back to school for my MBA, and they think it’s a waste of time.\n\nI met my first SD on SA when I was 20. I was turning 21 in the next month after that. Which I think made him more comfortable. We were together for two and a half years, but it legitimately felt like yeeaarrsss (in a good way). He was the first and only person I ever met off of SA, so I got really lucky. He always talked about how I was an old soul and spoke my mind “so much” (in his words). I was “so mature” for my age. “Don’t settle”, he said. “You deserve so much better”, he said. “I hope I can show you the world”, he said. “You’re going to be something great”, he said. He is/was my favorite person and best friend.\n\nTwo months after we broke up, I found out he had cancer. I noticed his hair thinning and he was coughing a little too much. I thought it was his asthma, so I would carry an inhaler with me because he hated having his with him (it came in handy a good amount of times). I began to visit him at his condo in the morning and after work the last 8 months.. even though we had ended our “arrangement”. I made him my favorite breakfasts and dinners. It was really terrifying thinking about him not living anymore.\n\nI got a call from his best friend saying he passed away. His attorney contacted me about my share in his will. Apparently he left me 30% of his assets to pay off my loans/grad school and then some... I had no idea he was doing this. At all. I want to slap him so hard right now haha. I want to cry, I want to laugh, I want to scream. All of the emotions are happening. My heart has been broken into a billion pieces because the day he passed was the ONE TIME I decided to go camping. After spending all of July with him in the hospital, he decides to leave when I’m away. How selfish of him 😒. Haha I love him. I truly would not be the person I am today if he had never come into my life. \n\nIt’s amazing how someone you wouldn’t normally meet shows up in your life and makes a difference. D, I miss you. I love you and Rest In Peace my lovey dovey. \n\nI’m sorry if this was a bit too corny for the SLF community but it’s the only place I feel people can relate.\n\n\nEdit: I wish I had the time to respond to all of the replies. Thank you to every single person who liked, replied, and reached out to me for support. We’re very fortunate to have this community and truly am grateful for all of the kind words. \n\nRemember to count your blessings, love people, and reach for the stars ✨ \n\nOh, and thank you kind friend for my first gold. Such a sweet gesture. I hope everyone has a lovely day.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cnj5s5/my_first_sd_just_passed_away/",
    "score": 548,
    "upvote_ratio": 0.98,
    "created_utc": 1565255527.0,
    "num_comments": 44,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Condolences for your loss.  And, yes, this is one of the few places people can relate to all the highs, lows, love and heartache that can come on just as strong in these non-traditional relationships.",
            "author": "leyapaul",
            "id": "ewb05pt",
            "parent_id": "t3_cnj5s5",
            "score": 34,
            "created_utc": 1565256059.0,
            "replies": [
                {
                    "body": "Thank you. If there’s anything I’ve learned from this sub, is that strong feelings are never off the table.",
                    "author": "slinkyinthebag",
                    "id": "ewb3glo",
                    "parent_id": "t1_ewb05pt",
                    "score": 12,
                    "created_utc": 1565258312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ewb1ord",
            "parent_id": "t3_cnj5s5",
            "score": 54,
            "created_utc": 1565257095.0,
            "replies": [
                {
                    "body": "This makes me cry even more 😭 He was an amazing human being and I bet he’s laughing at me for crying right now.",
                    "author": "slinkyinthebag",
                    "id": "ewb3qw1",
                    "parent_id": "t1_ewb1ord",
                    "score": 35,
                    "created_utc": 1565258509.0,
                    "replies": [
                        {
                            "body": ">This makes me cry even more 😭 He was an amazing human being and I bet he’s laughing at me for crying right now.\n\n Look at the stars. The great kings of the past look down on us from those stars.  Whenever you feel alone, just remember that those kings will always be there to guide you. And so will he.",
                            "author": "pintodinosaur",
                            "id": "ewdfqiy",
                            "parent_id": "t1_ewb3qw1",
                            "score": 18,
                            "created_utc": 1565300099.0,
                            "replies": [
                                {
                                    "body": "This is literally a quote from the Lion King",
                                    "author": "kb1323",
                                    "id": "ewditqs",
                                    "parent_id": "t1_ewdfqiy",
                                    "score": 16,
                                    "created_utc": 1565301548.0,
                                    "replies": [
                                        {
                                            "body": ">This is literally a quote from the Lion King\n\nLmao, guilty as charged. That didn't take long  😭",
                                            "author": "pintodinosaur",
                                            "id": "ewgivll",
                                            "parent_id": "t1_ewditqs",
                                            "score": 6,
                                            "created_utc": 1565382854.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "One of the best movies in the world. Full of keys.",
                                            "author": "luhshawty",
                                            "id": "eweg0v6",
                                            "parent_id": "t1_ewditqs",
                                            "score": 5,
                                            "created_utc": 1565322950.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Only the best one..?",
                                            "author": "knot_yours_yet",
                                            "id": "ewefwq7",
                                            "parent_id": "t1_ewditqs",
                                            "score": 4,
                                            "created_utc": 1565322852.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg, this is so beautiful and so sad all at the same time. I’m so sorry for your loss x x",
            "author": "anonanonanon10",
            "id": "ewb0a18",
            "parent_id": "t3_cnj5s5",
            "score": 15,
            "created_utc": 1565256142.0,
            "replies": []
        },
        {
            "body": "He was a lucky man.  You brightened the winter of his life!",
            "author": "MidAmericaSD",
            "id": "ewbnqcc",
            "parent_id": "t3_cnj5s5",
            "score": 15,
            "created_utc": 1565269514.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss 💕 this was a beautifully written snapshot of your relationship, and your relationship sounds like it was true and genuinely filled with love.",
            "author": "danilani",
            "id": "ewbkjfg",
            "parent_id": "t3_cnj5s5",
            "score": 15,
            "created_utc": 1565268024.0,
            "replies": []
        },
        {
            "body": "Cried a bit this is sad to hear but at least you have good memories",
            "author": "sugarquestionthrow",
            "id": "ewb0skf",
            "parent_id": "t3_cnj5s5",
            "score": 10,
            "created_utc": 1565256487.0,
            "replies": []
        },
        {
            "body": "It’s such a beautiful thing to have good memories filled with genuine joy and love... Sorry for your loss, sending you lots of hugs 💙",
            "author": "DubuThickie",
            "id": "ewb2kdc",
            "parent_id": "t3_cnj5s5",
            "score": 7,
            "created_utc": 1565257699.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss. I hope you are doing well",
            "author": null,
            "id": "ewb01d4",
            "parent_id": "t3_cnj5s5",
            "score": 4,
            "created_utc": 1565255975.0,
            "replies": [
                {
                    "body": "Thank you. I’m going through the motions of a grieving person, but I’ll be fine I’m sure. It’s funny how I never really considered my own mortality until the passed. But it truly helps me appreciate life so much more.",
                    "author": "slinkyinthebag",
                    "id": "ewb3ncv",
                    "parent_id": "t1_ewb01d4",
                    "score": 8,
                    "created_utc": 1565258440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m completely teary reading your words.   He sounds like a wonderful man, and you were both lucky to have found each other and make such an impact on each other’s lives.    \n\nIt’s obvious you cared about him very much, and he care about you too, and has provided a way to help you even after he’s gone.    I know you’ll treasure your memories of him.",
            "author": "ksmith33672",
            "id": "ewbokx8",
            "parent_id": "t3_cnj5s5",
            "score": 6,
            "created_utc": 1565269904.0,
            "replies": []
        },
        {
            "body": "I bet he left you in his will because he judged you as a very good human being and you brought joy to him while he was alive.  Sorry for you loss -- but the story is uplifting in some ways.",
            "author": "JoshSD",
            "id": "ewc0vd6",
            "parent_id": "t3_cnj5s5",
            "score": 5,
            "created_utc": 1565275661.0,
            "replies": []
        },
        {
            "body": "I’m so sorry, sending you hugs and condolences for your loss!\n\nI totally sympathize with you, my SBF is sick and we got emotional together last night at dinner bc of the mere fact he doesn’t know how long he has..  \nTime is our most important and limited resource, and while it can be cruel it’s up to the individual person to see fit how they use it. For as long as I have left w him I just want it to be as pure and loving as possible.\n\nSorry for going off on my tangent but I also share your sentiment about how SLF is the only place we can share these things. Again I’m sorry for your loss babe, I know he’s smiling down on you though 😇",
            "author": "lstat1005",
            "id": "ewche86",
            "parent_id": "t3_cnj5s5",
            "score": 4,
            "created_utc": 1565284889.0,
            "replies": []
        },
        {
            "body": "My deepest condolences for your loss - it sounds like he was amazing and you two had a great bond (both in and post-SR). You'll carry him forever in your heart in so many ways. Just by way of personal experience, when my grandmother passed, about 5 years after I got out of school, she left me enough in her will to get out of debt. 20+ years later, the thought hits me at least once a week, when going over finances, or reflecting on what I've been able to do with my life, that I would not have come nearly as far without her generous spirit, and a warm feeling of love and gratitude comes over me. That can't assuage the pain of your loss, or replace your loved once's physical presence, but it is something you can always hold close, reflect on, and be grateful for. Take care of yourself, and go out and make him proud.",
            "author": "Cledaddy23",
            "id": "ewc3k0h",
            "parent_id": "t3_cnj5s5",
            "score": 6,
            "created_utc": 1565277314.0,
            "replies": []
        },
        {
            "body": "I am sorry for you loss. My condolences. It sounds like what you both had was very special, and clearly you were very special to him. I am glad he thought of you towards the end, and vice versa.",
            "author": "BigBearSD",
            "id": "ewb3jd6",
            "parent_id": "t3_cnj5s5",
            "score": 5,
            "created_utc": 1565258364.0,
            "replies": []
        },
        {
            "body": "So sorry for your loss. That was a beautiful post, you can tell how much you meant to each other. It’s wonderful he left you anything at all.",
            "author": "mraspencer",
            "id": "ewbh25b",
            "parent_id": "t3_cnj5s5",
            "score": 4,
            "created_utc": 1565266315.0,
            "replies": []
        },
        {
            "body": "A poem that relates as much to December May relationships as any other. You are magnificent in your description of your loving relationship!\n\nWe who choose to surround ourselves with lives\nEven more temporary than our own,\nLive within a fragile circle,\nEasily and often breached.\nUnable to accept its awful gaps,\nWe still would live no other way.\nWe cherish memory as the only certain Immortality,\nNever fully understanding The necessary plan….\nIrving Townsend",
            "author": "SDforreal",
            "id": "ewbmirq",
            "parent_id": "t3_cnj5s5",
            "score": 4,
            "created_utc": 1565268956.0,
            "replies": []
        },
        {
            "body": "What a wonderful experience. You both really cherished those times properly and that's what is most important. Thank you for sharing.",
            "author": "YesToAdventure",
            "id": "ewc3f8u",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565277233.0,
            "replies": []
        },
        {
            "body": "I am so sorry to hear this! But I bet you made the last months, weeks and days of his life that much better for him!",
            "author": "elusiveprincess",
            "id": "ewccjnz",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565282348.0,
            "replies": []
        },
        {
            "body": "Wow. This is heartfelt on so many levels. So very sorry for your loss. He sounds like an amazing human being, as do you. xx",
            "author": "renaissanceSB",
            "id": "ewcsj9l",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565289698.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss.  You really loved him with all your heart.  He was a lucky man to have you in his life. I hope to find an SB like you one day and have such an SR.  Your words seem so loyal, caring and genuine.  Thank you for sharing with all of us.  I hope you feel better soon. May you find the strength to get through this rough time.",
            "author": "ffreshindo",
            "id": "ewd4jsw",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565295004.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss. From the sounds of it, I'm sure he knew exactly what he was doing, waiting until you were doing something you enjoyed to go. He sounds like an amazing man. 🖤",
            "author": "ThePrettyLovely",
            "id": "ewdmplk",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565303343.0,
            "replies": []
        },
        {
            "body": "Beautiful.",
            "author": "aesthete2061",
            "id": "ewdnymz",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565304022.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss! He truly loved you! 💕",
            "author": "realglucose",
            "id": "ewwl4he",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1565830202.0,
            "replies": []
        },
        {
            "body": "Believe that he is with you in spirit and watching over you , So make him proud",
            "author": "psychic-michaela",
            "id": "eyf64k6",
            "parent_id": "t3_cnj5s5",
            "score": 2,
            "created_utc": 1567043991.0,
            "replies": []
        },
        {
            "body": "I am so sorry. *hugs*",
            "author": null,
            "id": "ewebtou",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1565319581.0,
            "replies": []
        },
        {
            "body": "Wow, thank you for sharing something so profound and intimate with us. \n\nAdmittedly I started my period today so I am veryyyyyy emotional, but this has me feeling all of the feels. \n\nI am so sorry for your loss, but I also feel so much fondness towards the obvious kinship y’all had with one another. Those kinds of relationships are so special. I can tell y’all touched each other’s souls, and that is such a beautiful thing.\n\nI don’t have advice with loss because it’s fucking hard. I just wanted to share this emotional space with you, send some love, and thank you. \n\nX",
            "author": "fluffypinkkitties",
            "id": "ewg0x18",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1565371473.0,
            "replies": []
        },
        {
            "body": "Wow, this is not corny at all! I'm so sorry for your loss",
            "author": "JustCallMeLo",
            "id": "ewgggch",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1565381283.0,
            "replies": []
        },
        {
            "body": "I feel for you and sorry about your loss. Life is such. There today, gone tomorrow.Atleast you know he is gone. I lost a good friend, who was an SD on SA. He was the type that could walk into an airport and buy a lady a Louie Vuitton. I know he had a long distance SB that he loved. Don’t think she knows about his demise. I do not have her contact. But know she is a realtor in Toronto and have a pic. Unable to find her by a google search. Thought that it Would be good to get her closure. She must be distraught for not getting any replies from him.",
            "author": "golferkris101",
            "id": "ewi5nu5",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1565439378.0,
            "replies": []
        },
        {
            "body": "my deepest condolences. so sorry for your lost.\n\nIf it is of any comfort to you, speaking as an SD, he is indeed privileged to have meet you, known you and in a relationship with you. The fact that he remembered you in his will says that this went beyond SR.",
            "author": "johnanon58",
            "id": "f94vj97",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1575105713.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss but you are blessed to have had the relationship in the first place.",
            "author": "LotBuilder",
            "id": "ewc1ddj",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1565275966.0,
            "replies": []
        },
        {
            "body": "I read the subject line and immediately thought \"wow that must have been some minblowing sex!\"\n\nThen I read the rest. My condolences.",
            "author": "KeyToGramercy",
            "id": "ewbxa2x",
            "parent_id": "t3_cnj5s5",
            "score": 0,
            "created_utc": 1565273733.0,
            "replies": []
        },
        {
            "body": "It was an amazing story until you hit the “left 30% of his will to me” thingy! That quickly makes it a creepy infomercial for Seeking.",
            "author": null,
            "id": "ewb37l4",
            "parent_id": "t3_cnj5s5",
            "score": -21,
            "created_utc": 1565258144.0,
            "replies": [
                {
                    "body": "Would you not want to leave something for someone who cared genuinely enough to willingly give her time for 8 months to care for you uncompensated? Idk what kind of infomercial you think that is but it wouldn't be an appealing one.",
                    "author": "yourgirlfriday99",
                    "id": "ewbc1hw",
                    "parent_id": "t1_ewb37l4",
                    "score": 17,
                    "created_utc": 1565263644.0,
                    "replies": []
                },
                {
                    "body": "Sorry, I didn’t mean to make it look that way. I was kind of just writing about what happened in my life. Putting my thoughts into words.",
                    "author": "slinkyinthebag",
                    "id": "ewb3xb6",
                    "parent_id": "t1_ewb37l4",
                    "score": 13,
                    "created_utc": 1565258631.0,
                    "replies": [
                        {
                            "body": "My SD put me in his will too. I was shocked when he told me. I’m so sorry for tour loss girl. I love that you took care of him, and he’s taking care of you even after he’s gone. So sweet. He was lucky to have you by his side :) xo",
                            "author": "bebedeazucar",
                            "id": "ewbw423",
                            "parent_id": "t1_ewb3xb6",
                            "score": 11,
                            "created_utc": 1565273230.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "\nMaybe, but not really\n\nI have life insurance and cash aside for my \"baby\" i care deeply and i always seen it as a \"mans\" responsibility to make sure she is \"ok\" after i am gone. \n\nSince i am older, it is something i would deal with in \"any loving relationship\".\n\nMine knows, because i want her to know she is loved AND it's my job to take care of her.... spoiled  as she may be.... which i just love doing.... \n\nShe cried when i told her this and was completely shocked too...",
                    "author": "SpaceGuy1968",
                    "id": "ewefy3m",
                    "parent_id": "t1_ewb37l4",
                    "score": 3,
                    "created_utc": 1565322883.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry my comment is late and igot teary reading your post. Such a wholesome experiences.",
            "author": "reborn912021",
            "id": "hlrc908",
            "parent_id": "t3_cnj5s5",
            "score": 1,
            "created_utc": 1637669442.0,
            "replies": []
        },
        {
            "body": "Thank you. If there’s anything I’ve learned from this sub, is that strong feelings are never off the table.",
            "author": "slinkyinthebag",
            "id": "ewb3glo",
            "parent_id": "t1_ewb05pt",
            "score": 12,
            "created_utc": 1565258312.0,
            "replies": []
        },
        {
            "body": "This makes me cry even more 😭 He was an amazing human being and I bet he’s laughing at me for crying right now.",
            "author": "slinkyinthebag",
            "id": "ewb3qw1",
            "parent_id": "t1_ewb1ord",
            "score": 35,
            "created_utc": 1565258509.0,
            "replies": [
                {
                    "body": ">This makes me cry even more 😭 He was an amazing human being and I bet he’s laughing at me for crying right now.\n\n Look at the stars. The great kings of the past look down on us from those stars.  Whenever you feel alone, just remember that those kings will always be there to guide you. And so will he.",
                    "author": "pintodinosaur",
                    "id": "ewdfqiy",
                    "parent_id": "t1_ewb3qw1",
                    "score": 18,
                    "created_utc": 1565300099.0,
                    "replies": [
                        {
                            "body": "This is literally a quote from the Lion King",
                            "author": "kb1323",
                            "id": "ewditqs",
                            "parent_id": "t1_ewdfqiy",
                            "score": 16,
                            "created_utc": 1565301548.0,
                            "replies": [
                                {
                                    "body": ">This is literally a quote from the Lion King\n\nLmao, guilty as charged. That didn't take long  😭",
                                    "author": "pintodinosaur",
                                    "id": "ewgivll",
                                    "parent_id": "t1_ewditqs",
                                    "score": 6,
                                    "created_utc": 1565382854.0,
                                    "replies": []
                                },
                                {
                                    "body": "One of the best movies in the world. Full of keys.",
                                    "author": "luhshawty",
                                    "id": "eweg0v6",
                                    "parent_id": "t1_ewditqs",
                                    "score": 5,
                                    "created_utc": 1565322950.0,
                                    "replies": []
                                },
                                {
                                    "body": "Only the best one..?",
                                    "author": "knot_yours_yet",
                                    "id": "ewefwq7",
                                    "parent_id": "t1_ewditqs",
                                    "score": 4,
                                    "created_utc": 1565322852.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you. I’m going through the motions of a grieving person, but I’ll be fine I’m sure. It’s funny how I never really considered my own mortality until the passed. But it truly helps me appreciate life so much more.",
            "author": "slinkyinthebag",
            "id": "ewb3ncv",
            "parent_id": "t1_ewb01d4",
            "score": 8,
            "created_utc": 1565258440.0,
            "replies": []
        },
        {
            "body": "Would you not want to leave something for someone who cared genuinely enough to willingly give her time for 8 months to care for you uncompensated? Idk what kind of infomercial you think that is but it wouldn't be an appealing one.",
            "author": "yourgirlfriday99",
            "id": "ewbc1hw",
            "parent_id": "t1_ewb37l4",
            "score": 17,
            "created_utc": 1565263644.0,
            "replies": []
        },
        {
            "body": "Sorry, I didn’t mean to make it look that way. I was kind of just writing about what happened in my life. Putting my thoughts into words.",
            "author": "slinkyinthebag",
            "id": "ewb3xb6",
            "parent_id": "t1_ewb37l4",
            "score": 13,
            "created_utc": 1565258631.0,
            "replies": [
                {
                    "body": "My SD put me in his will too. I was shocked when he told me. I’m so sorry for tour loss girl. I love that you took care of him, and he’s taking care of you even after he’s gone. So sweet. He was lucky to have you by his side :) xo",
                    "author": "bebedeazucar",
                    "id": "ewbw423",
                    "parent_id": "t1_ewb3xb6",
                    "score": 11,
                    "created_utc": 1565273230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\nMaybe, but not really\n\nI have life insurance and cash aside for my \"baby\" i care deeply and i always seen it as a \"mans\" responsibility to make sure she is \"ok\" after i am gone. \n\nSince i am older, it is something i would deal with in \"any loving relationship\".\n\nMine knows, because i want her to know she is loved AND it's my job to take care of her.... spoiled  as she may be.... which i just love doing.... \n\nShe cried when i told her this and was completely shocked too...",
            "author": "SpaceGuy1968",
            "id": "ewefy3m",
            "parent_id": "t1_ewb37l4",
            "score": 3,
            "created_utc": 1565322883.0,
            "replies": []
        },
        {
            "body": ">This makes me cry even more 😭 He was an amazing human being and I bet he’s laughing at me for crying right now.\n\n Look at the stars. The great kings of the past look down on us from those stars.  Whenever you feel alone, just remember that those kings will always be there to guide you. And so will he.",
            "author": "pintodinosaur",
            "id": "ewdfqiy",
            "parent_id": "t1_ewb3qw1",
            "score": 18,
            "created_utc": 1565300099.0,
            "replies": [
                {
                    "body": "This is literally a quote from the Lion King",
                    "author": "kb1323",
                    "id": "ewditqs",
                    "parent_id": "t1_ewdfqiy",
                    "score": 16,
                    "created_utc": 1565301548.0,
                    "replies": [
                        {
                            "body": ">This is literally a quote from the Lion King\n\nLmao, guilty as charged. That didn't take long  😭",
                            "author": "pintodinosaur",
                            "id": "ewgivll",
                            "parent_id": "t1_ewditqs",
                            "score": 6,
                            "created_utc": 1565382854.0,
                            "replies": []
                        },
                        {
                            "body": "One of the best movies in the world. Full of keys.",
                            "author": "luhshawty",
                            "id": "eweg0v6",
                            "parent_id": "t1_ewditqs",
                            "score": 5,
                            "created_utc": 1565322950.0,
                            "replies": []
                        },
                        {
                            "body": "Only the best one..?",
                            "author": "knot_yours_yet",
                            "id": "ewefwq7",
                            "parent_id": "t1_ewditqs",
                            "score": 4,
                            "created_utc": 1565322852.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My SD put me in his will too. I was shocked when he told me. I’m so sorry for tour loss girl. I love that you took care of him, and he’s taking care of you even after he’s gone. So sweet. He was lucky to have you by his side :) xo",
            "author": "bebedeazucar",
            "id": "ewbw423",
            "parent_id": "t1_ewb3xb6",
            "score": 11,
            "created_utc": 1565273230.0,
            "replies": []
        },
        {
            "body": "This is literally a quote from the Lion King",
            "author": "kb1323",
            "id": "ewditqs",
            "parent_id": "t1_ewdfqiy",
            "score": 16,
            "created_utc": 1565301548.0,
            "replies": [
                {
                    "body": ">This is literally a quote from the Lion King\n\nLmao, guilty as charged. That didn't take long  😭",
                    "author": "pintodinosaur",
                    "id": "ewgivll",
                    "parent_id": "t1_ewditqs",
                    "score": 6,
                    "created_utc": 1565382854.0,
                    "replies": []
                },
                {
                    "body": "One of the best movies in the world. Full of keys.",
                    "author": "luhshawty",
                    "id": "eweg0v6",
                    "parent_id": "t1_ewditqs",
                    "score": 5,
                    "created_utc": 1565322950.0,
                    "replies": []
                },
                {
                    "body": "Only the best one..?",
                    "author": "knot_yours_yet",
                    "id": "ewefwq7",
                    "parent_id": "t1_ewditqs",
                    "score": 4,
                    "created_utc": 1565322852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">This is literally a quote from the Lion King\n\nLmao, guilty as charged. That didn't take long  😭",
            "author": "pintodinosaur",
            "id": "ewgivll",
            "parent_id": "t1_ewditqs",
            "score": 6,
            "created_utc": 1565382854.0,
            "replies": []
        },
        {
            "body": "One of the best movies in the world. Full of keys.",
            "author": "luhshawty",
            "id": "eweg0v6",
            "parent_id": "t1_ewditqs",
            "score": 5,
            "created_utc": 1565322950.0,
            "replies": []
        },
        {
            "body": "Only the best one..?",
            "author": "knot_yours_yet",
            "id": "ewefwq7",
            "parent_id": "t1_ewditqs",
            "score": 4,
            "created_utc": 1565322852.0,
            "replies": []
        }
    ]
}