{
    "title": "A year of living differently.",
    "post_id": "ptxthg",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ptxthg/a_year_of_living_differently/",
    "author": "ChapterRelative",
    "body": "Tldr: a guy's self indulgent thoughts after one year in the bowl\n\nThree years ago I was happily married. \n\nTrue, the beginning of the year had been a little rocky after my wife was diagnosed with breast cancer, but together we'd gotten through the surgery and the chemo and she'd received a clean bill of health.\n\nAnd everything else was going great. Our kids were in school and happy. I had a new job and was on the way to switching careers after years of effort. And I was close to reaching my goal of becoming financially independent. We were happy together; we'd just gotten back from a fantastic 5-day trip to Florence, marred only by a nagging pain in my wife's hip that made long walks difficult.\n\nLife was good.\n\nOr so I thought.\n\nEighteen months later she was dead.\n\nThat nagging pain in her hip, initially diagnosed as a muscle sprain, turned out to be the breast cancer returned in metastatic form. Stage 4 breast cancer. Incurable.\n\nShe had been the only woman in my life. I hadn't so much as kissed another woman in 28 years. Now, you have to understand that being monogamous doesn't necessarily mean I wasn't interested in other women. I was definitely attracted to other women; particularly younger women or, well, anyone with a great figure. Just never interested enough to cheat on my wife, or take a chance of ruining my marriage.\n\nSo, despite the pain and the loss I was very interested in exploring my sexuality in ways I hadn't been able to for decades. I started dating, using Tinder to find women who were age appropriate, and quickly found the experience frustrating.\n\nThen, I found a sugaring website (not SA at that time). I met \"Rosa\" online. I had no idea what I was doing. She agreed to go out with me and while I understood she wanted some financial help we had no discussion of specifics. I picked her up near her home and we went to dinner. She was very young, very beautiful, and very shy. Over dessert I asked if she wanted to go back to my place, and she said yes. That night, exactly a year ago, we slept together and, for me at least, it was incredible. Afterward, I drove her home. There was no discussion of money.\n\nThe next day I knew I had screwed things up. I asked her for her payment app and I sent her some cash. She was happy with it, and we saw each other two more times before she ended things to get back together with her boyfriend. \n\nThere have been quite a few other women since then. Some just a dinner date, some I slept with a few times, some more. At first I got more emotionally involved in the relationships than I should have been. I had a hard time when Rosa left, while in retrospect she was really immature and probably not a great match. For a while I definitely acted a little bit like a kid in a candy store, searching on SA for more meetings and more dates even while seeing someone I enjoyed spending time with. \n\nI'm definitely settling down though. There are a couple of women.  I see one regularly - perhaps more of an NSA relationship than I'd like but she's beautiful and intelligent and the sex is fantastic. Another, not as much because of my schedule and the fact that she's engaged (whole 'nother post folks), but we chat all the time. Even a third long distance who's fantastic to spend time with. I hope to see her again. \n\nNone of them can replace what I've lost. As I dictate this I'm standing on a park in the Italian Marche looking at the palaces of Urbino and the surrounding hills. It's an incredible view. It would certainly be more enjoyable in the company of any of the three women I mentioned, but there's really only one person I wish was standing here by my side.\n\nI'm sure I'll be back on SA at some point (I've been off premium for a few months now). Perhaps someday I'll find what I had. I rather doubt it, but you never know. For now I'm not really looking. I'm just grateful that there are women out there willing to spend time with my old sorry sagging ass, and grateful to this community for helping me find them. \n\nMy view.\nhttps://imgur.com/a/fcWHwgJ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ptxthg/a_year_of_living_differently/",
    "score": 105,
    "upvote_ratio": 0.96,
    "created_utc": 1632411276.0,
    "num_comments": 25,
    "links": [
        [
            "https://imgur.com/a/fcWHwgJ"
        ]
    ],
    "comments": [
        {
            "body": "Loved this. Keep writing brother.",
            "author": null,
            "id": "hdz79xd",
            "parent_id": "t3_ptxthg",
            "score": 16,
            "created_utc": 1632412620.0,
            "replies": []
        },
        {
            "body": "This is also almost exactly my story as well. Big love to you and thanks for writing it.",
            "author": "thereadinessisall",
            "id": "hdz9p8p",
            "parent_id": "t3_ptxthg",
            "score": 8,
            "created_utc": 1632413643.0,
            "replies": [
                {
                    "body": "I'm sorry for your loss too.  I wasn't aware, so many men had lost their spouses.",
                    "author": "Darknlovely38",
                    "id": "he4z9hx",
                    "parent_id": "t1_hdz9p8p",
                    "score": 3,
                    "created_utc": 1632516898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A refreshing change from the usual fare on SLF. Glad you were able to partake in meaningful and enjoyable relationships. I'm sorry for your loss; it signifies that you had a precious and irreplaceable partner. Better this pain than the pain of never having loved, or a douche poet might say",
            "author": "stupid_smart_ape",
            "id": "hdzc772",
            "parent_id": "t3_ptxthg",
            "score": 8,
            "created_utc": 1632414675.0,
            "replies": []
        },
        {
            "body": "Thanks for sharing. I’m sorry for your loss. I, too, personally know the horrific aftermath of what cancer can do. Maybe sugar is a detour and a pitstop in your life’s journey, maybe its become part of your second stretch of life for the long haul. Meanwhile, take good care of yourself and those around you, even the ephemeral ones.",
            "author": "ExExpectations",
            "id": "hdzsjh8",
            "parent_id": "t3_ptxthg",
            "score": 7,
            "created_utc": 1632421378.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hdzafl7",
            "parent_id": "t3_ptxthg",
            "score": 7,
            "created_utc": 1632413952.0,
            "replies": [
                {
                    "body": "I'm drinking it now.",
                    "author": "ChapterRelative",
                    "id": "hdzavvt",
                    "parent_id": "t1_hdzafl7",
                    "score": 7,
                    "created_utc": 1632414136.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is someone chopping onions here?",
            "author": "thesuitelife2010",
            "id": "hdzjeb7",
            "parent_id": "t3_ptxthg",
            "score": 5,
            "created_utc": 1632417613.0,
            "replies": []
        },
        {
            "body": "This is the kind of thing I find so meaningful about these arrangements. Human connection and being able to keep enjoying life is so important. I'm glad you have some connections. Sorry for your loss.",
            "author": "oneangstybiscuit",
            "id": "hdzg7w0",
            "parent_id": "t3_ptxthg",
            "score": 5,
            "created_utc": 1632416311.0,
            "replies": []
        },
        {
            "body": "This was an epic posting, please write again if you do find another SB.",
            "author": "PalpitationOk5726",
            "id": "hdzh23o",
            "parent_id": "t3_ptxthg",
            "score": 4,
            "created_utc": 1632416651.0,
            "replies": [
                {
                    "body": "Well, I mean the three I mentioned are all sugar relationships.",
                    "author": "ChapterRelative",
                    "id": "hdzo9di",
                    "parent_id": "t1_hdzh23o",
                    "score": 2,
                    "created_utc": 1632419600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very touching and gorgeous view",
            "author": "lisaelizabethgold_of",
            "id": "hdzmbq3",
            "parent_id": "t3_ptxthg",
            "score": 3,
            "created_utc": 1632418810.0,
            "replies": []
        },
        {
            "body": "Wholesome.  Enjoy life, man!",
            "author": "badmonopoly",
            "id": "hdzz0o6",
            "parent_id": "t3_ptxthg",
            "score": 3,
            "created_utc": 1632424056.0,
            "replies": []
        },
        {
            "body": "You seem like a good person and I am so happy SA has helped you",
            "author": "MJline",
            "id": "he1eadg",
            "parent_id": "t3_ptxthg",
            "score": 3,
            "created_utc": 1632447423.0,
            "replies": []
        },
        {
            "body": "My condolences for your loss. Beautiful writing.",
            "author": "ZenMD76",
            "id": "he1mpjb",
            "parent_id": "t3_ptxthg",
            "score": 3,
            "created_utc": 1632451489.0,
            "replies": []
        },
        {
            "body": "this was so lovely to read. I so hope You find what You are longing for",
            "author": "chercub",
            "id": "he2yct9",
            "parent_id": "t3_ptxthg",
            "score": 3,
            "created_utc": 1632485274.0,
            "replies": []
        },
        {
            "body": "Thank you for this",
            "author": "ElectricalEducator29",
            "id": "hdz5ez2",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632411844.0,
            "replies": []
        },
        {
            "body": "Almost made me tear up. I hope you find fulfillment again.",
            "author": "SheThrowsGoodSugar",
            "id": "hdz9qlr",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632413660.0,
            "replies": []
        },
        {
            "body": "Sorry for your lose. At least you are not all alone :-)",
            "author": "Ambitious_Middle723",
            "id": "hdzjrtv",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632417766.0,
            "replies": []
        },
        {
            "body": "nice story bro",
            "author": "naIamgood",
            "id": "he08w1d",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632428492.0,
            "replies": []
        },
        {
            "body": "Best of luck to you my friend.  Your wonderful memories of your wife will stay with you forever.  You both were lucky to have such a great marriage, and partnership.",
            "author": "tim0690",
            "id": "he122qo",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632441606.0,
            "replies": []
        },
        {
            "body": "It was a good read. Thanks for sharing. My heart goes out to you.",
            "author": "VaxxedNotWaxed",
            "id": "he4h185",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632509337.0,
            "replies": []
        },
        {
            "body": "That was a breathtaking photo.  I'm very sorry for your loss.  I've read men who have lost a wife marry very quickly afterward.  Perhaps, you need to look for a more substantial relationship.  Sure fulfilling your fantasies is good, but those women can't or won't fill the void you feel left by your wife.  Only a real relationship can ease the pain a leaving only the sweet memories and love you had with your wife.  An SB relationship will *always* leave you, especially with young girls, void and empty, and for someone who's used to being with a woman, that won't do.  I ***don't*** know your pain, but I understand it because I went through something very similar with my dad.  My mother got breast cancer at 44 yo and was dead at 46 yo.  My uncle married my aunt's best friend, a man in the church married his church friend's younger sister.  Look for someone who was in your circle or your wife's friends that are single.",
            "author": "Darknlovely38",
            "id": "he4yqgc",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632516674.0,
            "replies": [
                {
                    "body": "I agree with you, and I had similar thoughts about what OP was saying about his relationships. I'm glad that OP is finding some fun and happiness in the bowl, but it's a tough place to find a deep, meaningful life-parter LTR. Then again, Tinder isn't that great either for us older guys. \n\nHopefully he'll find what he wants and needs as he continues his adventure in life.",
                    "author": "emptyoverflow",
                    "id": "heiepmt",
                    "parent_id": "t1_he4yqgc",
                    "score": 2,
                    "created_utc": 1632773672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post. Thanks for sharing!\n\nCancer is rough. I've lost a lot of family to it, including my mom. Took a couple years to process that. And SA helped me transition out of that era too. I'm hugely grateful to the amazing women I met and had relationships with. Really helped bring me to a better place.",
            "author": "SwimmingInSugar",
            "id": "he99wxg",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632598757.0,
            "replies": []
        },
        {
            "body": "Wow this is so sad and beautifully written, I'm crying 😭. I wish you nothing but happiness in life ❤",
            "author": "cutiebean",
            "id": "hejz6b8",
            "parent_id": "t3_ptxthg",
            "score": 2,
            "created_utc": 1632800410.0,
            "replies": []
        },
        {
            "body": "I'm sorry for your loss too.  I wasn't aware, so many men had lost their spouses.",
            "author": "Darknlovely38",
            "id": "he4z9hx",
            "parent_id": "t1_hdz9p8p",
            "score": 3,
            "created_utc": 1632516898.0,
            "replies": []
        },
        {
            "body": "I'm drinking it now.",
            "author": "ChapterRelative",
            "id": "hdzavvt",
            "parent_id": "t1_hdzafl7",
            "score": 7,
            "created_utc": 1632414136.0,
            "replies": []
        },
        {
            "body": "Well, I mean the three I mentioned are all sugar relationships.",
            "author": "ChapterRelative",
            "id": "hdzo9di",
            "parent_id": "t1_hdzh23o",
            "score": 2,
            "created_utc": 1632419600.0,
            "replies": []
        },
        {
            "body": "I agree with you, and I had similar thoughts about what OP was saying about his relationships. I'm glad that OP is finding some fun and happiness in the bowl, but it's a tough place to find a deep, meaningful life-parter LTR. Then again, Tinder isn't that great either for us older guys. \n\nHopefully he'll find what he wants and needs as he continues his adventure in life.",
            "author": "emptyoverflow",
            "id": "heiepmt",
            "parent_id": "t1_he4yqgc",
            "score": 2,
            "created_utc": 1632773672.0,
            "replies": []
        }
    ]
}