{
    "title": "So I tried looking for SDs on tinder",
    "post_id": "e6so9t",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e6so9t/so_i_tried_looking_for_sds_on_tinder/",
    "author": "enlabasura7",
    "body": "I set my age range to 40-50+, and there were maybe a handful of guys hinting at an actual SR. On the other hand, there were a baffling number of guys who said they wanted an attractive young girl, but then specifically wrote in their profiles “no sugar babies”. I’ve seen a 57 year old saying he wanted an 18-22 year old, between 5’6” and 5’9”, less than 133 lbs, but no sugar babies. Some of them blatantly say they don’t even want to date, just have sex with hot young girls for free. I’m 19, so they obviously lowered their age range by a lot for me to be able to see them. Where do these men get the idea that an 18-25 year old would date/hook up with a 40-60 year old man for free? I don’t imagine they get many matches, but it’s super annoying to swipe past 100 of them. Think I’m just gonna stick to SA lol.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e6so9t/so_i_tried_looking_for_sds_on_tinder/",
    "score": 119,
    "upvote_ratio": 0.92,
    "created_utc": 1575601931.0,
    "num_comments": 82,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "The funniest is unattractive men 2-3* your age, who match with you but start with the I’m not comfortable with the age difference or saying why did you match with a old guy like me. You know dan well why I am here",
            "author": "Lilipuss25",
            "id": "f9tlbzo",
            "parent_id": "t3_e6so9t",
            "score": 52,
            "created_utc": 1575630486.0,
            "replies": [
                {
                    "body": "Right!!",
                    "author": "heyitsdoe",
                    "id": "f9u6cea",
                    "parent_id": "t1_f9tlbzo",
                    "score": 7,
                    "created_utc": 1575645181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Where do these men get the idea that an 18-25 year old would date/hook up with a 40-60 year old man for free?\n\nThey are the older & male version of young females who think they can get thousands for platonic arrangements.\n\nIn other words, idiots exist at both end of the age and gender spectrum",
            "author": "Church42",
            "id": "f9sx0qx",
            "parent_id": "t3_e6so9t",
            "score": 98,
            "created_utc": 1575602637.0,
            "replies": [
                {
                    "body": "“Platonic”. You’re not on tinder for platonic friendships lmao. \n\nAnd I agree with the quoted statement honestly. It’s harsh but fair. I’ve had older men (60s-70s) approach me on the street to flirt with me and I am 20 years old and decently attractive. \n\nLike sir, unless you’re about to write me a check, I’m not sure what world you’re living in.",
                    "author": "vanityepitomized",
                    "id": "f9udktz",
                    "parent_id": "t1_f9sx0qx",
                    "score": 15,
                    "created_utc": 1575648827.0,
                    "replies": []
                },
                {
                    "body": "I mean, why not try? I'm in my 40s and have hooked up several times with Tinder girls in their early twenties in a non-sugar context. You'd be surprised how many girls will fuck an attractive older man for fun, just like she sleeps with men her own age for fun.\n\nIf you're talking guys in their 60s and 70s then yeah, it becomes extremely unlikely.",
                    "author": "Seven_league_boots",
                    "id": "f9ur4wm",
                    "parent_id": "t1_f9sx0qx",
                    "score": 5,
                    "created_utc": 1575656221.0,
                    "replies": []
                },
                {
                    "body": "Hahaha so true! Never thought of it this way",
                    "author": "ewwitsjessagain",
                    "id": "f9u5oy2",
                    "parent_id": "t1_f9sx0qx",
                    "score": 2,
                    "created_utc": 1575644843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s male delusion. I mean, even look at some of the replies on this thread. There’s plenty of old men that honestly think a sizeable minority of young women are interested in having (free) sex with aged 50+ men because they’re “better in bed.” I’m a woman in their prime target age range, friends with a lot of other women in the same age range and NOPE. There’s probably a few old guys somewhere that had sex with an attractive young woman for free, then they go around telling all the other old men, who then honestly believe this is a somewhat common occurance. It’s not. If old men want to fuck pretty young women, 99% of the time you’re going to have to pay to play.",
            "author": "super-vain",
            "id": "f9tp5b6",
            "parent_id": "t3_e6so9t",
            "score": 30,
            "created_utc": 1575635217.0,
            "replies": [
                {
                    "body": "There is some delusional notion that our generation is one of so much sexual freedom that we just are sex crazed and just wanna bang. Statistically we are actually having less sex than generations before us.",
                    "author": "knowswhatiwant",
                    "id": "f9u9efq",
                    "parent_id": "t1_f9tp5b6",
                    "score": 19,
                    "created_utc": 1575646760.0,
                    "replies": [
                        {
                            "body": ">There is some delusional notion that our generation is one of so much sexual freedom that we just are sex crazed and just wanna bang. Statistically we are actually having less sex than generations before us.\n\nwhat is your age range..? Are you millennial or generation Z..?\n\nSeems like the 18-22 crowd is having lots of sex from what Ive experienced and from what I have seen.",
                            "author": "ruphun",
                            "id": "f9vp2l0",
                            "parent_id": "t1_f9u9efq",
                            "score": 1,
                            "created_utc": 1575675983.0,
                            "replies": [
                                {
                                    "body": "Even if they are why they expected to do it with everyone especially someone 2 to 3 times their age? Like let’s say an orgy breaks out full of millennials no ones gonna be askin where’s the old guy! \n\nFrom what you’ve seen? You mean TV, social media and word of mouth. Some small sample....a true sample of a population is 700 people. So when you have analyzed and verified the sexual activities of 700 18 to 22 yr olds then I’ll believe you.\n\nThis is where it annoys me the assumption if anyone of any age is sexually open their discretion is out the window! \n\nI’m a cusp can fall in either category, but the assumptions and shear fantasy men spew is insane.",
                                    "author": "knowswhatiwant",
                                    "id": "f9vplm2",
                                    "parent_id": "t1_f9vp2l0",
                                    "score": 5,
                                    "created_utc": 1575676370.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9tyub5",
                    "parent_id": "t1_f9tp5b6",
                    "score": 7,
                    "created_utc": 1575641316.0,
                    "replies": [
                        {
                            "body": "I remember one night being out with a Gf who was going to be DJing at burning man and this guy in his 50’s goes oh that’s thing everyone goes and has sex with everyone....”my friend went and got laid so many times” everyone just looked at him like wtf it’s a music and arts festival. I replied no that’s hedonism! Was insane every time it came up old guys had the same reaction. Their younger counterparts would be so embarrassed. They are just completely out of touch. This same group also thinks we have threesomes like daily!!",
                            "author": "knowswhatiwant",
                            "id": "f9uo825",
                            "parent_id": "t1_f9tyub5",
                            "score": 5,
                            "created_utc": 1575654698.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree!!",
                    "author": "kimchi_Queen",
                    "id": "f9viqs9",
                    "parent_id": "t1_f9tp5b6",
                    "score": 3,
                    "created_utc": 1575671484.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're a smart 19 year old",
            "author": "SupremeHeaux",
            "id": "f9swqke",
            "parent_id": "t3_e6so9t",
            "score": 9,
            "created_utc": 1575602432.0,
            "replies": []
        },
        {
            "body": "Haha, go figure, everyone on here commenting is an SD, I don't see any SBs chiming in with, \"I would totally do it without the money!!\" Keep on eating up those delusions, guys... \n\n\nFor me, I do need an attraction, but I wouldn't do it without money now. When I was younger I dated older men because I wanted to, but those relationships always had way more issues (guys think they still got it, getting a younger girl which just makes them even more into themselves). So now, from experience, I only see older men in a SB sense, but I do have to have some sort of genuine connection to the person. \n\nSo yes, younger women do want to see older men. They don't always need money. But it is not the norm like many here are desperate to believe.",
            "author": "kimchi_Queen",
            "id": "f9t87k5",
            "parent_id": "t3_e6so9t",
            "score": 39,
            "created_utc": 1575612192.0,
            "replies": [
                {
                    "body": "When I was younger, I had dated plenty of older men. Now I'm 45 and I have to say that, in retrospect, I should have dated in my own age range. We got so many who believe that they are entitled to \"free sex\"  or \"discounts\" because they are/were seeing someone else who gave them that type of thing. I don't even see someone unless the figures match what I'm looking for from my SD.",
                    "author": "Knosha",
                    "id": "f9vabps",
                    "parent_id": "t1_f9t87k5",
                    "score": 3,
                    "created_utc": 1575665949.0,
                    "replies": []
                },
                {
                    "body": ">I don't see any SBs chiming in with, \"I would totally do it without the money!!\" Keep on eating up those delusions, guys...\n\nbecause it wouldn't be sugar babies that would be responding for the most part.  All you have to do is browse on over to [https://www.reddit.com/r/AgeGap/](https://www.reddit.com/r/AgeGap/) and you will see plenty of 18 to 22 year olds the are dating guys 20, 30 or even 40 years older with an allowance.\n\nIt's only delusional to you, because you're probably only sugar dating for money.",
                    "author": "ruphun",
                    "id": "f9topr8",
                    "parent_id": "t1_f9t87k5",
                    "score": -11,
                    "created_utc": 1575634743.0,
                    "replies": [
                        {
                            "body": "LMAO I mean, I'm shocked this isn't obvious to her. This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free. \n\nBut not everyone outside of this forum is a sugar baby, I swear.",
                            "author": "NoBromo3213",
                            "id": "f9u772s",
                            "parent_id": "t1_f9topr8",
                            "score": 0,
                            "created_utc": 1575645627.0,
                            "replies": [
                                {
                                    "body": "> i'm shocked this isn't obvious to her. \n\nIm not shocked at all. Some women only sugar date for money. They look at things transactionally, and are operating on a pro like basis, so of course they countnt possibility think any young women with date an older man without an allowance /s\n\n>This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free.\n\nActually in the past, I have seen a few posts by SB saying that they would definitely vanilla date their SD if they had met them another way and not on Seeking.",
                                    "author": "ruphun",
                                    "id": "f9uch4s",
                                    "parent_id": "t1_f9u772s",
                                    "score": 2,
                                    "created_utc": 1575648282.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9wgu74",
                    "parent_id": "t1_f9t87k5",
                    "score": -4,
                    "created_utc": 1575692419.0,
                    "replies": [
                        {
                            "body": "Way to be racist! You're a real winner.",
                            "author": "kimchi_Queen",
                            "id": "f9wx7fp",
                            "parent_id": "t1_f9wgu74",
                            "score": 1,
                            "created_utc": 1575700561.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Where do these men get the idea that an 18-25 year old would date/hook up with a 40-60 year old man for free?\n\nI snicker every time I see this on Tinder. It's delightful.",
            "author": "MASugarBaby",
            "id": "f9sytx7",
            "parent_id": "t3_e6so9t",
            "score": 35,
            "created_utc": 1575603939.0,
            "replies": [
                {
                    "body": "And yet it happens every day. Do you seriously think young women aren't fucking attractive ~40 year olds for free? Cause they are. The only reason I have SBs is because it's way easier on every level, including the option to turn it into an LTR. Also, because I like supporting them.",
                    "author": "Seven_league_boots",
                    "id": "f9urhia",
                    "parent_id": "t1_f9sytx7",
                    "score": 1,
                    "created_utc": 1575656396.0,
                    "replies": [
                        {
                            "body": "Lmaoooo 😂😂😂😂 sir!! \n\nNo they aren’t that’s what this entire thread is trying to tell you. Is it too much? Should we have said it nicer?",
                            "author": "brownbaby21",
                            "id": "f9v9e9e",
                            "parent_id": "t1_f9urhia",
                            "score": 11,
                            "created_utc": 1575665434.0,
                            "replies": [
                                {
                                    "body": "Lol, okay, I must have been hallucinating when I slept with all those women. Good thing you were here to clear that up.",
                                    "author": "Seven_league_boots",
                                    "id": "f9vgp69",
                                    "parent_id": "t1_f9v9e9e",
                                    "score": 3,
                                    "created_utc": 1575670086.0,
                                    "replies": [
                                        {
                                            "body": "There are literally a few threads in the past few days about people who want to meet rich older men without allowance. I don't think these SBs realize that is a thing some people want.",
                                            "author": "NoBromo3213",
                                            "id": "f9vsjha",
                                            "parent_id": "t1_f9vgp69",
                                            "score": 2,
                                            "created_utc": 1575678586.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Key word “attractive”. \n\nI remember when I was a 20 year old I thought any man over 30 years old was ancient and no matter how “attractive” he was there was no way I was going to sleep with him. \n\nMind you I was still a virgin at that time so that probably had something to do with it.",
                            "author": "EllaMae17",
                            "id": "f9vc171",
                            "parent_id": "t1_f9urhia",
                            "score": 3,
                            "created_utc": 1575667044.0,
                            "replies": [
                                {
                                    "body": "And yet so many 20 year olds sleep with their attractive +40 professors.",
                                    "author": "Seven_league_boots",
                                    "id": "f9vgren",
                                    "parent_id": "t1_f9vc171",
                                    "score": 3,
                                    "created_utc": 1575670128.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's probably 1 in a 1000 girls that were up for it so that guy told all his friends who told all his friends.\n\nDid get this message a while back on Seeking though..she was in her mid 20's:\n\n> I’m literally just on here so I can bang an older dude. Not for money. Lol I never have so I’m crossing it off my bucket list",
            "author": "tenmillionplus",
            "id": "f9swfs1",
            "parent_id": "t3_e6so9t",
            "score": 12,
            "created_utc": 1575602216.0,
            "replies": [
                {
                    "body": "Did you help her with that bucket list?",
                    "author": "brown_bi_babe",
                    "id": "f9uv50n",
                    "parent_id": "t1_f9swfs1",
                    "score": 1,
                    "created_utc": 1575658260.0,
                    "replies": [
                        {
                            "body": "I'm only 35 so she blocked me haha",
                            "author": "tenmillionplus",
                            "id": "f9uws9y",
                            "parent_id": "t1_f9uv50n",
                            "score": 2,
                            "created_utc": 1575659097.0,
                            "replies": [
                                {
                                    "body": "That is both surprising and hilarious (I suppose more in retrospect than at the moment for you)",
                                    "author": "brown_bi_babe",
                                    "id": "fa6pkp7",
                                    "parent_id": "t1_f9uws9y",
                                    "score": 1,
                                    "created_utc": 1575827268.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Seems like it could be a scam",
                    "author": "kimchi_Queen",
                    "id": "f9vivk1",
                    "parent_id": "t1_f9swfs1",
                    "score": 0,
                    "created_utc": 1575671575.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who’s banging a +50 year old man for free?? 🤮",
            "author": "chitownbabe17",
            "id": "f9urq7c",
            "parent_id": "t3_e6so9t",
            "score": 11,
            "created_utc": 1575656515.0,
            "replies": []
        },
        {
            "body": "The only way I’m fucking an older guy for free is if he looks like Chris Evans or Robert Downey Jr other than that I think the f*ck not.\nI can’t stand how they think you’re naive because you’re younger",
            "author": "booshiibabee",
            "id": "f9uznk8",
            "parent_id": "t3_e6so9t",
            "score": 3,
            "created_utc": 1575660552.0,
            "replies": []
        },
        {
            "body": "I wonder how vigorously Tinder polices accounts. I'd love to have some success with it in the future but I've tried in the past with almost zero luck. I'd like to be more transparent with what I'm looking for just not sure if that is a sure recipe to get banned, like on SA.",
            "author": "gingerdaddy56",
            "id": "f9to5lx",
            "parent_id": "t3_e6so9t",
            "score": 4,
            "created_utc": 1575634109.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9vkpi3",
                    "parent_id": "t1_f9to5lx",
                    "score": 1,
                    "created_utc": 1575672839.0,
                    "replies": [
                        {
                            "body": "Do you really have to pay up in order to see matches? Just experimenting here.",
                            "author": "gingerdaddy56",
                            "id": "f9vnoh8",
                            "parent_id": "t1_f9vkpi3",
                            "score": 2,
                            "created_utc": 1575674964.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whats an SR?",
            "author": null,
            "id": "f9urxgk",
            "parent_id": "t3_e6so9t",
            "score": 2,
            "created_utc": 1575656619.0,
            "replies": [
                {
                    "body": "Sugar Relationship",
                    "author": "NoBromo3213",
                    "id": "f9us6ry",
                    "parent_id": "t1_f9urxgk",
                    "score": 1,
                    "created_utc": 1575656752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been fortunate enough as an \"older\" guy (46) to hook up with some very hot younger women (19-29) in everyday life who know nothing of the sugar world.   With that being said, I prefer the sugar route for a few reasons.  1.  Younger women can get attached very quickly and it's not fair to them because I can't offer \"happily ever after\".  2.  A SR speeds up the process.  Just because I can \"sometimes\" attract a younger woman, doesn't mean that it doesn't take a ton of time and a great deal of luck and timing.   The benefits help move things along.\n\nAnd because I have been able to attract the occassional younger woman away from the SB world, I can convince myself that any SB is genuinely into me, even if she is just faking it.  As long as she fakes it well.   \n\nThe only reason I would think you would want to use Tinder, would be you don't want to put yourself out there on SA.  Since you are there, I would just stay there.  At least those of us on there, should know the purpose of the site.  (Obviously that doesn't always happen).",
            "author": null,
            "id": "f9tyqlr",
            "parent_id": "t3_e6so9t",
            "score": 4,
            "created_utc": 1575641259.0,
            "replies": []
        },
        {
            "body": "> Where do these men get the idea that an 18-25 year old would date/hook up with a 40-60 year old man for free?\n\nTinder is for free hookups. Where do you get the idea that guys on Tinder are looking to pay SBs?\n\nSBs asking for sugar on Tinder are akin to guys on SA asking for free hookup.",
            "author": "geekxp",
            "id": "f9t21pu",
            "parent_id": "t3_e6so9t",
            "score": 11,
            "created_utc": 1575606440.0,
            "replies": [
                {
                    "body": "Tinder is full of would-be SB's.  I match with them all the time, and I'm not even (specifically) looking.  It's also full of escorts and Snapchat sex workers.\n\nEdit: Protip if she's willing to meet for $100 with $25-$50 up front, it's a scam.  Which is obvious, but it's so common I assume it must work sometimes.",
                    "author": null,
                    "id": "f9tpowz",
                    "parent_id": "t1_f9t21pu",
                    "score": 4,
                    "created_utc": 1575635797.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9tu04e",
                    "parent_id": "t1_f9t21pu",
                    "score": 0,
                    "created_utc": 1575638644.0,
                    "replies": [
                        {
                            "body": "\\>Tinder is for dating\n\nMaybe that's what it's intended for but it has a hookup reputation compared to other apps. By no means is it just a minority of people looking for hookups on there, but I suppose this probably varies by location.",
                            "author": "NoBromo3213",
                            "id": "f9u9spq",
                            "parent_id": "t1_f9tu04e",
                            "score": 1,
                            "created_utc": 1575646961.0,
                            "replies": [
                                {
                                    "body": "Tinder started as a hookup app and the userbase has transitioned it to more dating oriented. Of course people still use it for hookup but a large number of women I see on there are looking for relationships.",
                                    "author": "falecf4",
                                    "id": "f9usqik",
                                    "parent_id": "t1_f9u9spq",
                                    "score": 1,
                                    "created_utc": 1575657027.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9tu8p3",
            "parent_id": "t3_e6so9t",
            "score": 6,
            "created_utc": 1575638785.0,
            "replies": [
                {
                    "body": "Yeah bc who wants money right?!?!?",
                    "author": "knowswhatiwant",
                    "id": "f9u9k0x",
                    "parent_id": "t1_f9tu8p3",
                    "score": 5,
                    "created_utc": 1575646843.0,
                    "replies": [
                        {
                            "body": ">Yeah bc who wants money right?!?!?\n\nnot because they dont want money. Not everyone equates sex with money. Not everyone wants to get paid to have sex. Someone actually enjoy sex. Some women actually like older guys. Some women actually date older guys, and some even fall in love with them. Just step on over into r/agegaps and take a look at all really young girls in love with guys 20, 30 or 40 years older, and aren't getting an allowance. Oh heaven forbid they're giving it away for free 🤣🤣🤣",
                            "author": "ruphun",
                            "id": "f9vpd7a",
                            "parent_id": "t1_f9u9k0x",
                            "score": 4,
                            "created_utc": 1575676198.0,
                            "replies": [
                                {
                                    "body": "Stop promoting your sub. Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh",
                                    "author": "knowswhatiwant",
                                    "id": "f9vpxea",
                                    "parent_id": "t1_f9vpd7a",
                                    "score": 1,
                                    "created_utc": 1575676614.0,
                                    "replies": [
                                        {
                                            "body": "Believe it or not, the idea of getting paid to have sex is discomforting to some. \n\nI was talking to someone on OKC who was in college. She lamented that most older guys on the site were \"asking if I wanted money to be with them like I'm some kind of hooker!\". What she didn't know was I was fishing to see if she wanted an SR. Fortunately I hadn't made her an offer yet in the convo.",
                                            "author": "NoBromo3213",
                                            "id": "f9vtd1s",
                                            "parent_id": "t1_f9vpxea",
                                            "score": 2,
                                            "created_utc": 1575679219.0,
                                            "replies": [
                                                {
                                                    "body": "You aren’t old though prob just doesn’t want old guys. If ya like someone and they offer to pay your rent doubt ya would be like nah...",
                                                    "author": "knowswhatiwant",
                                                    "id": "f9vthcu",
                                                    "parent_id": "t1_f9vtd1s",
                                                    "score": 1,
                                                    "created_utc": 1575679311.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
                                                            "author": "NoBromo3213",
                                                            "id": "f9vvj8s",
                                                            "parent_id": "t1_f9vthcu",
                                                            "score": 1,
                                                            "created_utc": 1575680898.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> Stop promoting your sub\n\nnot my sub. Just a fan 🤣\n\n> Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh\n\ncan you translate this for us English speakers..?",
                                            "author": "ruphun",
                                            "id": "f9vzk16",
                                            "parent_id": "t1_f9vpxea",
                                            "score": 0,
                                            "created_utc": 1575683980.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just guys exploiting the daddy issues. They know that girls need someone to fill what daddy couldn't.",
            "author": null,
            "id": "f9uf1g7",
            "parent_id": "t3_e6so9t",
            "score": 3,
            "created_utc": 1575649580.0,
            "replies": []
        },
        {
            "body": "I found one of my current SD on okc. 😮\nFor me SA has been so dry :(",
            "author": "egurlpowers",
            "id": "f9vozr1",
            "parent_id": "t3_e6so9t",
            "score": 1,
            "created_utc": 1575675926.0,
            "replies": []
        },
        {
            "body": "Why does this happen?\n\nPorn. Porn is why this happens...",
            "author": null,
            "id": "f9vrc3v",
            "parent_id": "t3_e6so9t",
            "score": 1,
            "created_utc": 1575677671.0,
            "replies": []
        },
        {
            "body": "Out of curiosity, as I am perfectly happy with my arrangement and SB, I signed up to Tinder (since now deleted my account). There's a whole set of women looking for sugar daddies and not being shy about it all. Good to know for future reference. I'm worried about sites like SA (long term) sticking around.",
            "author": "gingerdaddy56",
            "id": "f9vsqi9",
            "parent_id": "t3_e6so9t",
            "score": 1,
            "created_utc": 1575678735.0,
            "replies": [
                {
                    "body": "are they very clear about what they are looking for? I've always wanted to see if i can match a SB on tinder, i just do not know what to put in the profile to NOT set off the red flags.",
                    "author": null,
                    "id": "fb6eou3",
                    "parent_id": "t1_f9vsqi9",
                    "score": 1,
                    "created_utc": 1576548423.0,
                    "replies": [
                        {
                            "body": "The ones I saw were clear they were looking for a sugar daddy but did not go into detail. I presume that could be covered over chat. YMMV.",
                            "author": "gingerdaddy56",
                            "id": "fb6ewq9",
                            "parent_id": "t1_fb6eou3",
                            "score": 1,
                            "created_utc": 1576548578.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9t0gne",
            "parent_id": "t3_e6so9t",
            "score": 2,
            "created_utc": 1575605170.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9u1xwo",
                    "parent_id": "t1_f9t0gne",
                    "score": -1,
                    "created_utc": 1575642924.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9u8i8m",
                            "parent_id": "t1_f9u1xwo",
                            "score": -1,
                            "created_utc": 1575646295.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, it \\*is\\* possible that a young chick might want to hook up with a guy double her age or more. It happens. I was the lucky guy once myself. And also, I am quite sure that there are many guys your own age who fantasize about having sex with a woman aged 40-50. I know I did. I have no idea how rare or common these things are but they do happen. And it \\*is\\* Tinder, it's not designed as a sugar dating platform so if these guys already had some bad experiences with girls looking for sugar, on the wrong platform, I think it's only fair for them to state their intentions upfront. It's also good for you - you don't have to waste your time with them that way, no?",
            "author": "-Good_Daddy-",
            "id": "f9t2kqv",
            "parent_id": "t3_e6so9t",
            "score": 1,
            "created_utc": 1575606864.0,
            "replies": []
        },
        {
            "body": "Must have worked for someone before if they haven't given up on it lol. I haven't used Tinder recently but I have been with younger women without it being an SR. But I am under 40, to be fair.\n\nTBH, I'd say a old man's chances of finding a young girl who doesn't need sugar is better than a young girl's chance of finding a platonic SD. But both aren't especially likely.\n\nThis is why when people talk about people they met freestyling they are hoping to get into an SR with, I always wonder if they realize the likelihood of a random person wanting one is low. Most people who are approaching you want something vanilla, I would think. Regardless of the age gap.",
            "author": "NoBromo3213",
            "id": "f9u6b36",
            "parent_id": "t3_e6so9t",
            "score": 1,
            "created_utc": 1575645162.0,
            "replies": []
        },
        {
            "body": "Those are probably fake or scam profiles made by kids ... just swipe left",
            "author": "shamloo77",
            "id": "f9sy15a",
            "parent_id": "t3_e6so9t",
            "score": 1,
            "created_utc": 1575603370.0,
            "replies": []
        },
        {
            "body": "> Where do these men get the idea that an 18-25 year old would date/hook up with a 40-60 year old man for free?\n\nAre you kidding? Plenty of younger women like having sex with older men because they tend to know what they're doing in bed and aren't focused solely on getting themselves off like the younger guys do. Some of the girls who have a more sexually robust appetite love that kind of stuff (I can speak from experience).",
            "author": "Ranger3752",
            "id": "f9t0i6h",
            "parent_id": "t3_e6so9t",
            "score": -6,
            "created_utc": 1575605203.0,
            "replies": [
                {
                    "body": "The problem is that those old men don’t just want a younger women, they want to top 1%, hot, smart that everybody want ( hot guy her age who want to hook up, hot guy her age who want to offer her a future, older guy looking for a sr, ) why would the should the least attractive option?\n\nEspecially when those older guy aren’t even attractive. We aren’t talking about idriss Elba, Denzel washington pr George Clooney",
                    "author": "Lilipuss25",
                    "id": "f9tliya",
                    "parent_id": "t1_f9t0i6h",
                    "score": 12,
                    "created_utc": 1575630764.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9u8gw2",
                            "parent_id": "t1_f9tliya",
                            "score": -1,
                            "created_utc": 1575646276.0,
                            "replies": [
                                {
                                    "body": "Sorry I’m hot and all my friend are too, where do I find the overweight girl?",
                                    "author": "Lilipuss25",
                                    "id": "f9vor3v",
                                    "parent_id": "t1_f9u8gw2",
                                    "score": 2,
                                    "created_utc": 1575675750.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is true Id like you to know what you're doing... I also like having my bills fully payed and prefer getting off completely satisfied with no stress or depressing thoughts about how I'm literally F*ing around and Not getting payed.. It makes it so much more satisfying and fun for me personally.",
                    "author": "AvalonB",
                    "id": "f9tnlpg",
                    "parent_id": "t1_f9t0i6h",
                    "score": 6,
                    "created_utc": 1575633455.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9t1hoo",
                    "parent_id": "t1_f9t0i6h",
                    "score": 7,
                    "created_utc": 1575605983.0,
                    "replies": [
                        {
                            "body": "Well, that's kind of the whole purpose of this sub, isn't it? lol I was taking issue with her assertion that younger women never hook up with older men unless there was some financial compensation for it. That is patently untrue.",
                            "author": "Ranger3752",
                            "id": "f9t1qdh",
                            "parent_id": "t1_f9t1hoo",
                            "score": 0,
                            "created_utc": 1575606181.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f9t1yie",
                                    "parent_id": "t1_f9t1qdh",
                                    "score": 2,
                                    "created_utc": 1575606367.0,
                                    "replies": [
                                        {
                                            "body": "> It's just rare\n\nThat is a far more accurate statement (and what the OP probably should have said).",
                                            "author": "Ranger3752",
                                            "id": "f9t29nb",
                                            "parent_id": "t1_f9t1yie",
                                            "score": 2,
                                            "created_utc": 1575606616.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f9t2j5d",
                                                    "parent_id": "t1_f9t29nb",
                                                    "score": 11,
                                                    "created_utc": 1575606829.0,
                                                    "replies": [
                                                        {
                                                            "body": "Valid point.",
                                                            "author": "Ranger3752",
                                                            "id": "f9t2nz5",
                                                            "parent_id": "t1_f9t2j5d",
                                                            "score": 3,
                                                            "created_utc": 1575606934.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "f9t2rav",
                                                                    "parent_id": "t1_f9t2nz5",
                                                                    "score": 3,
                                                                    "created_utc": 1575607010.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your poor SD  😢😂",
                                                                            "author": "Ranger3752",
                                                                            "id": "f9t3f6o",
                                                                            "parent_id": "t1_f9t2rav",
                                                                            "score": 1,
                                                                            "created_utc": 1575607562.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This..! [https://www.reddit.com/r/AgeGap/](https://www.reddit.com/r/AgeGap/)\n\nPlenty of younger women go for older guys without an allowance",
                    "author": "ruphun",
                    "id": "f9tosgv",
                    "parent_id": "t1_f9t0i6h",
                    "score": -2,
                    "created_utc": 1575634827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Where do these men get the idea that an 18-25 year old would date/hook up with a 40-60 year old man for free? \n\nThe same place SBs get the idea that they should get paid for getting pretty to show up for a date.",
            "author": null,
            "id": "f9tvtiu",
            "parent_id": "t3_e6so9t",
            "score": 0,
            "created_utc": 1575639678.0,
            "replies": []
        },
        {
            "body": "It’s not common but it’s not really unheard of for younger women to be interested in guys their dad’s age. I’m 55 and I’ve been in a non-sugar (but not vanilla) relationship for 3 years with someone who is now 23, and I’ve had a few FWBs in their early 20s. Tinder is admittedly a terrible place to meet them but honestly Tinder has been a big fail for me regardless of age.",
            "author": "jaguarsharkSD",
            "id": "f9utwqh",
            "parent_id": "t3_e6so9t",
            "score": 0,
            "created_utc": 1575657629.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9sycae",
            "parent_id": "t3_e6so9t",
            "score": -1,
            "created_utc": 1575603597.0,
            "replies": [
                {
                    "body": "She’s not talking about guys that are looking for SBs though. She’s asking about the middle aged men that are trying to fuck for free.",
                    "author": "super-vain",
                    "id": "f9toykd",
                    "parent_id": "t1_f9sycae",
                    "score": 5,
                    "created_utc": 1575635014.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This reminded me of something that I saved and I found it\n\nhttps://www.reddit.com/r/sex/comments/cco9y0/22f_im_only_sexually_attracted_to_much_older_men/?utm_medium=android_app&utm_source=share\n\nSome women are actually into much older men and don't even think about how it's something they can earn money from too",
            "author": "andrea_athena",
            "id": "f9te1la",
            "parent_id": "t3_e6so9t",
            "score": -2,
            "created_utc": 1575619394.0,
            "replies": [
                {
                    "body": "100% this. Thats why there's a sub reddit for [https://www.reddit.com/r/AgeGap/](https://www.reddit.com/r/AgeGap/)\n\nIve been with younger women that were into older men, ones that had fantasies of being with older guys, and have said that the allowance was only the icing on the cake, not the main reason why they were on Seeking. I've also met a couple in their 20's that didnt even want an allowance, just wanted to be with someone that would treat them better then guys their age.",
                    "author": "ruphun",
                    "id": "f9tp0vx",
                    "parent_id": "t1_f9te1la",
                    "score": 2,
                    "created_utc": 1575635083.0,
                    "replies": [
                        {
                            "body": "It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!",
                            "author": "andrea_athena",
                            "id": "f9vmafz",
                            "parent_id": "t1_f9tp0vx",
                            "score": 0,
                            "created_utc": 1575673962.0,
                            "replies": [
                                {
                                    "body": ">It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!\n\nbecause some of the members on here make their living off of sugar, dont actually like older guys and are threatened by women that would actually date an older man who wasnt giving them an allowance.",
                                    "author": "ruphun",
                                    "id": "f9vpivm",
                                    "parent_id": "t1_f9vmafz",
                                    "score": 1,
                                    "created_utc": 1575676314.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Before I moved to my partner's hometown, I exclusively used Tinder to find mistresses. Upper age limit was set to 25. I did just fine. Mostly early-mid 20s divorcees. But a few college girls thrown in for good measure. I didn't ask (or particularly care) why they were choosing to meet an older attached guy at his home or a hotel but they were definitely game.",
            "author": "This_is_Not_My_Handl",
            "id": "f9t39fu",
            "parent_id": "t3_e6so9t",
            "score": -2,
            "created_utc": 1575607425.0,
            "replies": [
                {
                    "body": "Sounds like a lie but okay.",
                    "author": "thehottubistoohawt",
                    "id": "f9v8f8x",
                    "parent_id": "t1_f9t39fu",
                    "score": 3,
                    "created_utc": 1575664952.0,
                    "replies": [
                        {
                            "body": "Yeah. Because I really want all the downvotes🙄",
                            "author": "This_is_Not_My_Handl",
                            "id": "f9v9cnh",
                            "parent_id": "t1_f9v8f8x",
                            "score": 0,
                            "created_utc": 1575665412.0,
                            "replies": [
                                {
                                    "body": "Either you’re incredibly good looking and charming or these girls are thirsty af in a boring town.",
                                    "author": "thehottubistoohawt",
                                    "id": "f9v9gvi",
                                    "parent_id": "t1_f9v9cnh",
                                    "score": 1,
                                    "created_utc": 1575665471.0,
                                    "replies": [
                                        {
                                            "body": "~~or~~\nand",
                                            "author": "This_is_Not_My_Handl",
                                            "id": "f9vcki3",
                                            "parent_id": "t1_f9v9gvi",
                                            "score": 1,
                                            "created_utc": 1575667392.0,
                                            "replies": [
                                                {
                                                    "body": "Speculation...",
                                                    "author": "thehottubistoohawt",
                                                    "id": "f9vdilp",
                                                    "parent_id": "t1_f9vcki3",
                                                    "score": 1,
                                                    "created_utc": 1575667996.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9txgkf",
            "parent_id": "t3_e6so9t",
            "score": -6,
            "created_utc": 1575640573.0,
            "replies": [
                {
                    "body": "Then you hit Milf status and have younger SDs 👏👏👏😍😍😍😍😈😈😈🤷‍♀️🤷‍♀️🤷‍♀️",
                    "author": "TrixieDixie99",
                    "id": "f9tzfr5",
                    "parent_id": "t1_f9txgkf",
                    "score": 8,
                    "created_utc": 1575641628.0,
                    "replies": [
                        {
                            "body": "AMEN!!! Nobodies stopped looking yet. My last vanilla boyfriend was 10 yrs younger than me and a certified super model....I rocked his damn world!!!",
                            "author": "knowswhatiwant",
                            "id": "f9u9ydx",
                            "parent_id": "t1_f9tzfr5",
                            "score": 5,
                            "created_utc": 1575647038.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right!!",
            "author": "heyitsdoe",
            "id": "f9u6cea",
            "parent_id": "t1_f9tlbzo",
            "score": 7,
            "created_utc": 1575645181.0,
            "replies": []
        },
        {
            "body": "“Platonic”. You’re not on tinder for platonic friendships lmao. \n\nAnd I agree with the quoted statement honestly. It’s harsh but fair. I’ve had older men (60s-70s) approach me on the street to flirt with me and I am 20 years old and decently attractive. \n\nLike sir, unless you’re about to write me a check, I’m not sure what world you’re living in.",
            "author": "vanityepitomized",
            "id": "f9udktz",
            "parent_id": "t1_f9sx0qx",
            "score": 15,
            "created_utc": 1575648827.0,
            "replies": []
        },
        {
            "body": "I mean, why not try? I'm in my 40s and have hooked up several times with Tinder girls in their early twenties in a non-sugar context. You'd be surprised how many girls will fuck an attractive older man for fun, just like she sleeps with men her own age for fun.\n\nIf you're talking guys in their 60s and 70s then yeah, it becomes extremely unlikely.",
            "author": "Seven_league_boots",
            "id": "f9ur4wm",
            "parent_id": "t1_f9sx0qx",
            "score": 5,
            "created_utc": 1575656221.0,
            "replies": []
        },
        {
            "body": "Hahaha so true! Never thought of it this way",
            "author": "ewwitsjessagain",
            "id": "f9u5oy2",
            "parent_id": "t1_f9sx0qx",
            "score": 2,
            "created_utc": 1575644843.0,
            "replies": []
        },
        {
            "body": "There is some delusional notion that our generation is one of so much sexual freedom that we just are sex crazed and just wanna bang. Statistically we are actually having less sex than generations before us.",
            "author": "knowswhatiwant",
            "id": "f9u9efq",
            "parent_id": "t1_f9tp5b6",
            "score": 19,
            "created_utc": 1575646760.0,
            "replies": [
                {
                    "body": ">There is some delusional notion that our generation is one of so much sexual freedom that we just are sex crazed and just wanna bang. Statistically we are actually having less sex than generations before us.\n\nwhat is your age range..? Are you millennial or generation Z..?\n\nSeems like the 18-22 crowd is having lots of sex from what Ive experienced and from what I have seen.",
                    "author": "ruphun",
                    "id": "f9vp2l0",
                    "parent_id": "t1_f9u9efq",
                    "score": 1,
                    "created_utc": 1575675983.0,
                    "replies": [
                        {
                            "body": "Even if they are why they expected to do it with everyone especially someone 2 to 3 times their age? Like let’s say an orgy breaks out full of millennials no ones gonna be askin where’s the old guy! \n\nFrom what you’ve seen? You mean TV, social media and word of mouth. Some small sample....a true sample of a population is 700 people. So when you have analyzed and verified the sexual activities of 700 18 to 22 yr olds then I’ll believe you.\n\nThis is where it annoys me the assumption if anyone of any age is sexually open their discretion is out the window! \n\nI’m a cusp can fall in either category, but the assumptions and shear fantasy men spew is insane.",
                            "author": "knowswhatiwant",
                            "id": "f9vplm2",
                            "parent_id": "t1_f9vp2l0",
                            "score": 5,
                            "created_utc": 1575676370.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9tyub5",
            "parent_id": "t1_f9tp5b6",
            "score": 7,
            "created_utc": 1575641316.0,
            "replies": [
                {
                    "body": "I remember one night being out with a Gf who was going to be DJing at burning man and this guy in his 50’s goes oh that’s thing everyone goes and has sex with everyone....”my friend went and got laid so many times” everyone just looked at him like wtf it’s a music and arts festival. I replied no that’s hedonism! Was insane every time it came up old guys had the same reaction. Their younger counterparts would be so embarrassed. They are just completely out of touch. This same group also thinks we have threesomes like daily!!",
                    "author": "knowswhatiwant",
                    "id": "f9uo825",
                    "parent_id": "t1_f9tyub5",
                    "score": 5,
                    "created_utc": 1575654698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree!!",
            "author": "kimchi_Queen",
            "id": "f9viqs9",
            "parent_id": "t1_f9tp5b6",
            "score": 3,
            "created_utc": 1575671484.0,
            "replies": []
        },
        {
            "body": "When I was younger, I had dated plenty of older men. Now I'm 45 and I have to say that, in retrospect, I should have dated in my own age range. We got so many who believe that they are entitled to \"free sex\"  or \"discounts\" because they are/were seeing someone else who gave them that type of thing. I don't even see someone unless the figures match what I'm looking for from my SD.",
            "author": "Knosha",
            "id": "f9vabps",
            "parent_id": "t1_f9t87k5",
            "score": 3,
            "created_utc": 1575665949.0,
            "replies": []
        },
        {
            "body": ">I don't see any SBs chiming in with, \"I would totally do it without the money!!\" Keep on eating up those delusions, guys...\n\nbecause it wouldn't be sugar babies that would be responding for the most part.  All you have to do is browse on over to [https://www.reddit.com/r/AgeGap/](https://www.reddit.com/r/AgeGap/) and you will see plenty of 18 to 22 year olds the are dating guys 20, 30 or even 40 years older with an allowance.\n\nIt's only delusional to you, because you're probably only sugar dating for money.",
            "author": "ruphun",
            "id": "f9topr8",
            "parent_id": "t1_f9t87k5",
            "score": -11,
            "created_utc": 1575634743.0,
            "replies": [
                {
                    "body": "LMAO I mean, I'm shocked this isn't obvious to her. This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free. \n\nBut not everyone outside of this forum is a sugar baby, I swear.",
                    "author": "NoBromo3213",
                    "id": "f9u772s",
                    "parent_id": "t1_f9topr8",
                    "score": 0,
                    "created_utc": 1575645627.0,
                    "replies": [
                        {
                            "body": "> i'm shocked this isn't obvious to her. \n\nIm not shocked at all. Some women only sugar date for money. They look at things transactionally, and are operating on a pro like basis, so of course they countnt possibility think any young women with date an older man without an allowance /s\n\n>This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free.\n\nActually in the past, I have seen a few posts by SB saying that they would definitely vanilla date their SD if they had met them another way and not on Seeking.",
                            "author": "ruphun",
                            "id": "f9uch4s",
                            "parent_id": "t1_f9u772s",
                            "score": 2,
                            "created_utc": 1575648282.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9wgu74",
            "parent_id": "t1_f9t87k5",
            "score": -4,
            "created_utc": 1575692419.0,
            "replies": [
                {
                    "body": "Way to be racist! You're a real winner.",
                    "author": "kimchi_Queen",
                    "id": "f9wx7fp",
                    "parent_id": "t1_f9wgu74",
                    "score": 1,
                    "created_utc": 1575700561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And yet it happens every day. Do you seriously think young women aren't fucking attractive ~40 year olds for free? Cause they are. The only reason I have SBs is because it's way easier on every level, including the option to turn it into an LTR. Also, because I like supporting them.",
            "author": "Seven_league_boots",
            "id": "f9urhia",
            "parent_id": "t1_f9sytx7",
            "score": 1,
            "created_utc": 1575656396.0,
            "replies": [
                {
                    "body": "Lmaoooo 😂😂😂😂 sir!! \n\nNo they aren’t that’s what this entire thread is trying to tell you. Is it too much? Should we have said it nicer?",
                    "author": "brownbaby21",
                    "id": "f9v9e9e",
                    "parent_id": "t1_f9urhia",
                    "score": 11,
                    "created_utc": 1575665434.0,
                    "replies": [
                        {
                            "body": "Lol, okay, I must have been hallucinating when I slept with all those women. Good thing you were here to clear that up.",
                            "author": "Seven_league_boots",
                            "id": "f9vgp69",
                            "parent_id": "t1_f9v9e9e",
                            "score": 3,
                            "created_utc": 1575670086.0,
                            "replies": [
                                {
                                    "body": "There are literally a few threads in the past few days about people who want to meet rich older men without allowance. I don't think these SBs realize that is a thing some people want.",
                                    "author": "NoBromo3213",
                                    "id": "f9vsjha",
                                    "parent_id": "t1_f9vgp69",
                                    "score": 2,
                                    "created_utc": 1575678586.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Key word “attractive”. \n\nI remember when I was a 20 year old I thought any man over 30 years old was ancient and no matter how “attractive” he was there was no way I was going to sleep with him. \n\nMind you I was still a virgin at that time so that probably had something to do with it.",
                    "author": "EllaMae17",
                    "id": "f9vc171",
                    "parent_id": "t1_f9urhia",
                    "score": 3,
                    "created_utc": 1575667044.0,
                    "replies": [
                        {
                            "body": "And yet so many 20 year olds sleep with their attractive +40 professors.",
                            "author": "Seven_league_boots",
                            "id": "f9vgren",
                            "parent_id": "t1_f9vc171",
                            "score": 3,
                            "created_utc": 1575670128.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you help her with that bucket list?",
            "author": "brown_bi_babe",
            "id": "f9uv50n",
            "parent_id": "t1_f9swfs1",
            "score": 1,
            "created_utc": 1575658260.0,
            "replies": [
                {
                    "body": "I'm only 35 so she blocked me haha",
                    "author": "tenmillionplus",
                    "id": "f9uws9y",
                    "parent_id": "t1_f9uv50n",
                    "score": 2,
                    "created_utc": 1575659097.0,
                    "replies": [
                        {
                            "body": "That is both surprising and hilarious (I suppose more in retrospect than at the moment for you)",
                            "author": "brown_bi_babe",
                            "id": "fa6pkp7",
                            "parent_id": "t1_f9uws9y",
                            "score": 1,
                            "created_utc": 1575827268.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seems like it could be a scam",
            "author": "kimchi_Queen",
            "id": "f9vivk1",
            "parent_id": "t1_f9swfs1",
            "score": 0,
            "created_utc": 1575671575.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9vkpi3",
            "parent_id": "t1_f9to5lx",
            "score": 1,
            "created_utc": 1575672839.0,
            "replies": [
                {
                    "body": "Do you really have to pay up in order to see matches? Just experimenting here.",
                    "author": "gingerdaddy56",
                    "id": "f9vnoh8",
                    "parent_id": "t1_f9vkpi3",
                    "score": 2,
                    "created_utc": 1575674964.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugar Relationship",
            "author": "NoBromo3213",
            "id": "f9us6ry",
            "parent_id": "t1_f9urxgk",
            "score": 1,
            "created_utc": 1575656752.0,
            "replies": []
        },
        {
            "body": "Tinder is full of would-be SB's.  I match with them all the time, and I'm not even (specifically) looking.  It's also full of escorts and Snapchat sex workers.\n\nEdit: Protip if she's willing to meet for $100 with $25-$50 up front, it's a scam.  Which is obvious, but it's so common I assume it must work sometimes.",
            "author": null,
            "id": "f9tpowz",
            "parent_id": "t1_f9t21pu",
            "score": 4,
            "created_utc": 1575635797.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9tu04e",
            "parent_id": "t1_f9t21pu",
            "score": 0,
            "created_utc": 1575638644.0,
            "replies": [
                {
                    "body": "\\>Tinder is for dating\n\nMaybe that's what it's intended for but it has a hookup reputation compared to other apps. By no means is it just a minority of people looking for hookups on there, but I suppose this probably varies by location.",
                    "author": "NoBromo3213",
                    "id": "f9u9spq",
                    "parent_id": "t1_f9tu04e",
                    "score": 1,
                    "created_utc": 1575646961.0,
                    "replies": [
                        {
                            "body": "Tinder started as a hookup app and the userbase has transitioned it to more dating oriented. Of course people still use it for hookup but a large number of women I see on there are looking for relationships.",
                            "author": "falecf4",
                            "id": "f9usqik",
                            "parent_id": "t1_f9u9spq",
                            "score": 1,
                            "created_utc": 1575657027.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah bc who wants money right?!?!?",
            "author": "knowswhatiwant",
            "id": "f9u9k0x",
            "parent_id": "t1_f9tu8p3",
            "score": 5,
            "created_utc": 1575646843.0,
            "replies": [
                {
                    "body": ">Yeah bc who wants money right?!?!?\n\nnot because they dont want money. Not everyone equates sex with money. Not everyone wants to get paid to have sex. Someone actually enjoy sex. Some women actually like older guys. Some women actually date older guys, and some even fall in love with them. Just step on over into r/agegaps and take a look at all really young girls in love with guys 20, 30 or 40 years older, and aren't getting an allowance. Oh heaven forbid they're giving it away for free 🤣🤣🤣",
                    "author": "ruphun",
                    "id": "f9vpd7a",
                    "parent_id": "t1_f9u9k0x",
                    "score": 4,
                    "created_utc": 1575676198.0,
                    "replies": [
                        {
                            "body": "Stop promoting your sub. Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh",
                            "author": "knowswhatiwant",
                            "id": "f9vpxea",
                            "parent_id": "t1_f9vpd7a",
                            "score": 1,
                            "created_utc": 1575676614.0,
                            "replies": [
                                {
                                    "body": "Believe it or not, the idea of getting paid to have sex is discomforting to some. \n\nI was talking to someone on OKC who was in college. She lamented that most older guys on the site were \"asking if I wanted money to be with them like I'm some kind of hooker!\". What she didn't know was I was fishing to see if she wanted an SR. Fortunately I hadn't made her an offer yet in the convo.",
                                    "author": "NoBromo3213",
                                    "id": "f9vtd1s",
                                    "parent_id": "t1_f9vpxea",
                                    "score": 2,
                                    "created_utc": 1575679219.0,
                                    "replies": [
                                        {
                                            "body": "You aren’t old though prob just doesn’t want old guys. If ya like someone and they offer to pay your rent doubt ya would be like nah...",
                                            "author": "knowswhatiwant",
                                            "id": "f9vthcu",
                                            "parent_id": "t1_f9vtd1s",
                                            "score": 1,
                                            "created_utc": 1575679311.0,
                                            "replies": [
                                                {
                                                    "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
                                                    "author": "NoBromo3213",
                                                    "id": "f9vvj8s",
                                                    "parent_id": "t1_f9vthcu",
                                                    "score": 1,
                                                    "created_utc": 1575680898.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> Stop promoting your sub\n\nnot my sub. Just a fan 🤣\n\n> Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh\n\ncan you translate this for us English speakers..?",
                                    "author": "ruphun",
                                    "id": "f9vzk16",
                                    "parent_id": "t1_f9vpxea",
                                    "score": 0,
                                    "created_utc": 1575683980.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "are they very clear about what they are looking for? I've always wanted to see if i can match a SB on tinder, i just do not know what to put in the profile to NOT set off the red flags.",
            "author": null,
            "id": "fb6eou3",
            "parent_id": "t1_f9vsqi9",
            "score": 1,
            "created_utc": 1576548423.0,
            "replies": [
                {
                    "body": "The ones I saw were clear they were looking for a sugar daddy but did not go into detail. I presume that could be covered over chat. YMMV.",
                    "author": "gingerdaddy56",
                    "id": "fb6ewq9",
                    "parent_id": "t1_fb6eou3",
                    "score": 1,
                    "created_utc": 1576548578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9u1xwo",
            "parent_id": "t1_f9t0gne",
            "score": -1,
            "created_utc": 1575642924.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9u8i8m",
                    "parent_id": "t1_f9u1xwo",
                    "score": -1,
                    "created_utc": 1575646295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The problem is that those old men don’t just want a younger women, they want to top 1%, hot, smart that everybody want ( hot guy her age who want to hook up, hot guy her age who want to offer her a future, older guy looking for a sr, ) why would the should the least attractive option?\n\nEspecially when those older guy aren’t even attractive. We aren’t talking about idriss Elba, Denzel washington pr George Clooney",
            "author": "Lilipuss25",
            "id": "f9tliya",
            "parent_id": "t1_f9t0i6h",
            "score": 12,
            "created_utc": 1575630764.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9u8gw2",
                    "parent_id": "t1_f9tliya",
                    "score": -1,
                    "created_utc": 1575646276.0,
                    "replies": [
                        {
                            "body": "Sorry I’m hot and all my friend are too, where do I find the overweight girl?",
                            "author": "Lilipuss25",
                            "id": "f9vor3v",
                            "parent_id": "t1_f9u8gw2",
                            "score": 2,
                            "created_utc": 1575675750.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is true Id like you to know what you're doing... I also like having my bills fully payed and prefer getting off completely satisfied with no stress or depressing thoughts about how I'm literally F*ing around and Not getting payed.. It makes it so much more satisfying and fun for me personally.",
            "author": "AvalonB",
            "id": "f9tnlpg",
            "parent_id": "t1_f9t0i6h",
            "score": 6,
            "created_utc": 1575633455.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9t1hoo",
            "parent_id": "t1_f9t0i6h",
            "score": 7,
            "created_utc": 1575605983.0,
            "replies": [
                {
                    "body": "Well, that's kind of the whole purpose of this sub, isn't it? lol I was taking issue with her assertion that younger women never hook up with older men unless there was some financial compensation for it. That is patently untrue.",
                    "author": "Ranger3752",
                    "id": "f9t1qdh",
                    "parent_id": "t1_f9t1hoo",
                    "score": 0,
                    "created_utc": 1575606181.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9t1yie",
                            "parent_id": "t1_f9t1qdh",
                            "score": 2,
                            "created_utc": 1575606367.0,
                            "replies": [
                                {
                                    "body": "> It's just rare\n\nThat is a far more accurate statement (and what the OP probably should have said).",
                                    "author": "Ranger3752",
                                    "id": "f9t29nb",
                                    "parent_id": "t1_f9t1yie",
                                    "score": 2,
                                    "created_utc": 1575606616.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f9t2j5d",
                                            "parent_id": "t1_f9t29nb",
                                            "score": 11,
                                            "created_utc": 1575606829.0,
                                            "replies": [
                                                {
                                                    "body": "Valid point.",
                                                    "author": "Ranger3752",
                                                    "id": "f9t2nz5",
                                                    "parent_id": "t1_f9t2j5d",
                                                    "score": 3,
                                                    "created_utc": 1575606934.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "f9t2rav",
                                                            "parent_id": "t1_f9t2nz5",
                                                            "score": 3,
                                                            "created_utc": 1575607010.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your poor SD  😢😂",
                                                                    "author": "Ranger3752",
                                                                    "id": "f9t3f6o",
                                                                    "parent_id": "t1_f9t2rav",
                                                                    "score": 1,
                                                                    "created_utc": 1575607562.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This..! [https://www.reddit.com/r/AgeGap/](https://www.reddit.com/r/AgeGap/)\n\nPlenty of younger women go for older guys without an allowance",
            "author": "ruphun",
            "id": "f9tosgv",
            "parent_id": "t1_f9t0i6h",
            "score": -2,
            "created_utc": 1575634827.0,
            "replies": []
        },
        {
            "body": "She’s not talking about guys that are looking for SBs though. She’s asking about the middle aged men that are trying to fuck for free.",
            "author": "super-vain",
            "id": "f9toykd",
            "parent_id": "t1_f9sycae",
            "score": 5,
            "created_utc": 1575635014.0,
            "replies": []
        },
        {
            "body": "100% this. Thats why there's a sub reddit for [https://www.reddit.com/r/AgeGap/](https://www.reddit.com/r/AgeGap/)\n\nIve been with younger women that were into older men, ones that had fantasies of being with older guys, and have said that the allowance was only the icing on the cake, not the main reason why they were on Seeking. I've also met a couple in their 20's that didnt even want an allowance, just wanted to be with someone that would treat them better then guys their age.",
            "author": "ruphun",
            "id": "f9tp0vx",
            "parent_id": "t1_f9te1la",
            "score": 2,
            "created_utc": 1575635083.0,
            "replies": [
                {
                    "body": "It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!",
                    "author": "andrea_athena",
                    "id": "f9vmafz",
                    "parent_id": "t1_f9tp0vx",
                    "score": 0,
                    "created_utc": 1575673962.0,
                    "replies": [
                        {
                            "body": ">It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!\n\nbecause some of the members on here make their living off of sugar, dont actually like older guys and are threatened by women that would actually date an older man who wasnt giving them an allowance.",
                            "author": "ruphun",
                            "id": "f9vpivm",
                            "parent_id": "t1_f9vmafz",
                            "score": 1,
                            "created_utc": 1575676314.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like a lie but okay.",
            "author": "thehottubistoohawt",
            "id": "f9v8f8x",
            "parent_id": "t1_f9t39fu",
            "score": 3,
            "created_utc": 1575664952.0,
            "replies": [
                {
                    "body": "Yeah. Because I really want all the downvotes🙄",
                    "author": "This_is_Not_My_Handl",
                    "id": "f9v9cnh",
                    "parent_id": "t1_f9v8f8x",
                    "score": 0,
                    "created_utc": 1575665412.0,
                    "replies": [
                        {
                            "body": "Either you’re incredibly good looking and charming or these girls are thirsty af in a boring town.",
                            "author": "thehottubistoohawt",
                            "id": "f9v9gvi",
                            "parent_id": "t1_f9v9cnh",
                            "score": 1,
                            "created_utc": 1575665471.0,
                            "replies": [
                                {
                                    "body": "~~or~~\nand",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "f9vcki3",
                                    "parent_id": "t1_f9v9gvi",
                                    "score": 1,
                                    "created_utc": 1575667392.0,
                                    "replies": [
                                        {
                                            "body": "Speculation...",
                                            "author": "thehottubistoohawt",
                                            "id": "f9vdilp",
                                            "parent_id": "t1_f9vcki3",
                                            "score": 1,
                                            "created_utc": 1575667996.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then you hit Milf status and have younger SDs 👏👏👏😍😍😍😍😈😈😈🤷‍♀️🤷‍♀️🤷‍♀️",
            "author": "TrixieDixie99",
            "id": "f9tzfr5",
            "parent_id": "t1_f9txgkf",
            "score": 8,
            "created_utc": 1575641628.0,
            "replies": [
                {
                    "body": "AMEN!!! Nobodies stopped looking yet. My last vanilla boyfriend was 10 yrs younger than me and a certified super model....I rocked his damn world!!!",
                    "author": "knowswhatiwant",
                    "id": "f9u9ydx",
                    "parent_id": "t1_f9tzfr5",
                    "score": 5,
                    "created_utc": 1575647038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">There is some delusional notion that our generation is one of so much sexual freedom that we just are sex crazed and just wanna bang. Statistically we are actually having less sex than generations before us.\n\nwhat is your age range..? Are you millennial or generation Z..?\n\nSeems like the 18-22 crowd is having lots of sex from what Ive experienced and from what I have seen.",
            "author": "ruphun",
            "id": "f9vp2l0",
            "parent_id": "t1_f9u9efq",
            "score": 1,
            "created_utc": 1575675983.0,
            "replies": [
                {
                    "body": "Even if they are why they expected to do it with everyone especially someone 2 to 3 times their age? Like let’s say an orgy breaks out full of millennials no ones gonna be askin where’s the old guy! \n\nFrom what you’ve seen? You mean TV, social media and word of mouth. Some small sample....a true sample of a population is 700 people. So when you have analyzed and verified the sexual activities of 700 18 to 22 yr olds then I’ll believe you.\n\nThis is where it annoys me the assumption if anyone of any age is sexually open their discretion is out the window! \n\nI’m a cusp can fall in either category, but the assumptions and shear fantasy men spew is insane.",
                    "author": "knowswhatiwant",
                    "id": "f9vplm2",
                    "parent_id": "t1_f9vp2l0",
                    "score": 5,
                    "created_utc": 1575676370.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remember one night being out with a Gf who was going to be DJing at burning man and this guy in his 50’s goes oh that’s thing everyone goes and has sex with everyone....”my friend went and got laid so many times” everyone just looked at him like wtf it’s a music and arts festival. I replied no that’s hedonism! Was insane every time it came up old guys had the same reaction. Their younger counterparts would be so embarrassed. They are just completely out of touch. This same group also thinks we have threesomes like daily!!",
            "author": "knowswhatiwant",
            "id": "f9uo825",
            "parent_id": "t1_f9tyub5",
            "score": 5,
            "created_utc": 1575654698.0,
            "replies": []
        },
        {
            "body": "LMAO I mean, I'm shocked this isn't obvious to her. This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free. \n\nBut not everyone outside of this forum is a sugar baby, I swear.",
            "author": "NoBromo3213",
            "id": "f9u772s",
            "parent_id": "t1_f9topr8",
            "score": 0,
            "created_utc": 1575645627.0,
            "replies": [
                {
                    "body": "> i'm shocked this isn't obvious to her. \n\nIm not shocked at all. Some women only sugar date for money. They look at things transactionally, and are operating on a pro like basis, so of course they countnt possibility think any young women with date an older man without an allowance /s\n\n>This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free.\n\nActually in the past, I have seen a few posts by SB saying that they would definitely vanilla date their SD if they had met them another way and not on Seeking.",
                    "author": "ruphun",
                    "id": "f9uch4s",
                    "parent_id": "t1_f9u772s",
                    "score": 2,
                    "created_utc": 1575648282.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Way to be racist! You're a real winner.",
            "author": "kimchi_Queen",
            "id": "f9wx7fp",
            "parent_id": "t1_f9wgu74",
            "score": 1,
            "created_utc": 1575700561.0,
            "replies": []
        },
        {
            "body": "Lmaoooo 😂😂😂😂 sir!! \n\nNo they aren’t that’s what this entire thread is trying to tell you. Is it too much? Should we have said it nicer?",
            "author": "brownbaby21",
            "id": "f9v9e9e",
            "parent_id": "t1_f9urhia",
            "score": 11,
            "created_utc": 1575665434.0,
            "replies": [
                {
                    "body": "Lol, okay, I must have been hallucinating when I slept with all those women. Good thing you were here to clear that up.",
                    "author": "Seven_league_boots",
                    "id": "f9vgp69",
                    "parent_id": "t1_f9v9e9e",
                    "score": 3,
                    "created_utc": 1575670086.0,
                    "replies": [
                        {
                            "body": "There are literally a few threads in the past few days about people who want to meet rich older men without allowance. I don't think these SBs realize that is a thing some people want.",
                            "author": "NoBromo3213",
                            "id": "f9vsjha",
                            "parent_id": "t1_f9vgp69",
                            "score": 2,
                            "created_utc": 1575678586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Key word “attractive”. \n\nI remember when I was a 20 year old I thought any man over 30 years old was ancient and no matter how “attractive” he was there was no way I was going to sleep with him. \n\nMind you I was still a virgin at that time so that probably had something to do with it.",
            "author": "EllaMae17",
            "id": "f9vc171",
            "parent_id": "t1_f9urhia",
            "score": 3,
            "created_utc": 1575667044.0,
            "replies": [
                {
                    "body": "And yet so many 20 year olds sleep with their attractive +40 professors.",
                    "author": "Seven_league_boots",
                    "id": "f9vgren",
                    "parent_id": "t1_f9vc171",
                    "score": 3,
                    "created_utc": 1575670128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm only 35 so she blocked me haha",
            "author": "tenmillionplus",
            "id": "f9uws9y",
            "parent_id": "t1_f9uv50n",
            "score": 2,
            "created_utc": 1575659097.0,
            "replies": [
                {
                    "body": "That is both surprising and hilarious (I suppose more in retrospect than at the moment for you)",
                    "author": "brown_bi_babe",
                    "id": "fa6pkp7",
                    "parent_id": "t1_f9uws9y",
                    "score": 1,
                    "created_utc": 1575827268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you really have to pay up in order to see matches? Just experimenting here.",
            "author": "gingerdaddy56",
            "id": "f9vnoh8",
            "parent_id": "t1_f9vkpi3",
            "score": 2,
            "created_utc": 1575674964.0,
            "replies": []
        },
        {
            "body": "\\>Tinder is for dating\n\nMaybe that's what it's intended for but it has a hookup reputation compared to other apps. By no means is it just a minority of people looking for hookups on there, but I suppose this probably varies by location.",
            "author": "NoBromo3213",
            "id": "f9u9spq",
            "parent_id": "t1_f9tu04e",
            "score": 1,
            "created_utc": 1575646961.0,
            "replies": [
                {
                    "body": "Tinder started as a hookup app and the userbase has transitioned it to more dating oriented. Of course people still use it for hookup but a large number of women I see on there are looking for relationships.",
                    "author": "falecf4",
                    "id": "f9usqik",
                    "parent_id": "t1_f9u9spq",
                    "score": 1,
                    "created_utc": 1575657027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Yeah bc who wants money right?!?!?\n\nnot because they dont want money. Not everyone equates sex with money. Not everyone wants to get paid to have sex. Someone actually enjoy sex. Some women actually like older guys. Some women actually date older guys, and some even fall in love with them. Just step on over into r/agegaps and take a look at all really young girls in love with guys 20, 30 or 40 years older, and aren't getting an allowance. Oh heaven forbid they're giving it away for free 🤣🤣🤣",
            "author": "ruphun",
            "id": "f9vpd7a",
            "parent_id": "t1_f9u9k0x",
            "score": 4,
            "created_utc": 1575676198.0,
            "replies": [
                {
                    "body": "Stop promoting your sub. Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh",
                    "author": "knowswhatiwant",
                    "id": "f9vpxea",
                    "parent_id": "t1_f9vpd7a",
                    "score": 1,
                    "created_utc": 1575676614.0,
                    "replies": [
                        {
                            "body": "Believe it or not, the idea of getting paid to have sex is discomforting to some. \n\nI was talking to someone on OKC who was in college. She lamented that most older guys on the site were \"asking if I wanted money to be with them like I'm some kind of hooker!\". What she didn't know was I was fishing to see if she wanted an SR. Fortunately I hadn't made her an offer yet in the convo.",
                            "author": "NoBromo3213",
                            "id": "f9vtd1s",
                            "parent_id": "t1_f9vpxea",
                            "score": 2,
                            "created_utc": 1575679219.0,
                            "replies": [
                                {
                                    "body": "You aren’t old though prob just doesn’t want old guys. If ya like someone and they offer to pay your rent doubt ya would be like nah...",
                                    "author": "knowswhatiwant",
                                    "id": "f9vthcu",
                                    "parent_id": "t1_f9vtd1s",
                                    "score": 1,
                                    "created_utc": 1575679311.0,
                                    "replies": [
                                        {
                                            "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
                                            "author": "NoBromo3213",
                                            "id": "f9vvj8s",
                                            "parent_id": "t1_f9vthcu",
                                            "score": 1,
                                            "created_utc": 1575680898.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> Stop promoting your sub\n\nnot my sub. Just a fan 🤣\n\n> Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh\n\ncan you translate this for us English speakers..?",
                            "author": "ruphun",
                            "id": "f9vzk16",
                            "parent_id": "t1_f9vpxea",
                            "score": 0,
                            "created_utc": 1575683980.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The ones I saw were clear they were looking for a sugar daddy but did not go into detail. I presume that could be covered over chat. YMMV.",
            "author": "gingerdaddy56",
            "id": "fb6ewq9",
            "parent_id": "t1_fb6eou3",
            "score": 1,
            "created_utc": 1576548578.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9u8i8m",
            "parent_id": "t1_f9u1xwo",
            "score": -1,
            "created_utc": 1575646295.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9u8gw2",
            "parent_id": "t1_f9tliya",
            "score": -1,
            "created_utc": 1575646276.0,
            "replies": [
                {
                    "body": "Sorry I’m hot and all my friend are too, where do I find the overweight girl?",
                    "author": "Lilipuss25",
                    "id": "f9vor3v",
                    "parent_id": "t1_f9u8gw2",
                    "score": 2,
                    "created_utc": 1575675750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, that's kind of the whole purpose of this sub, isn't it? lol I was taking issue with her assertion that younger women never hook up with older men unless there was some financial compensation for it. That is patently untrue.",
            "author": "Ranger3752",
            "id": "f9t1qdh",
            "parent_id": "t1_f9t1hoo",
            "score": 0,
            "created_utc": 1575606181.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9t1yie",
                    "parent_id": "t1_f9t1qdh",
                    "score": 2,
                    "created_utc": 1575606367.0,
                    "replies": [
                        {
                            "body": "> It's just rare\n\nThat is a far more accurate statement (and what the OP probably should have said).",
                            "author": "Ranger3752",
                            "id": "f9t29nb",
                            "parent_id": "t1_f9t1yie",
                            "score": 2,
                            "created_utc": 1575606616.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f9t2j5d",
                                    "parent_id": "t1_f9t29nb",
                                    "score": 11,
                                    "created_utc": 1575606829.0,
                                    "replies": [
                                        {
                                            "body": "Valid point.",
                                            "author": "Ranger3752",
                                            "id": "f9t2nz5",
                                            "parent_id": "t1_f9t2j5d",
                                            "score": 3,
                                            "created_utc": 1575606934.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f9t2rav",
                                                    "parent_id": "t1_f9t2nz5",
                                                    "score": 3,
                                                    "created_utc": 1575607010.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your poor SD  😢😂",
                                                            "author": "Ranger3752",
                                                            "id": "f9t3f6o",
                                                            "parent_id": "t1_f9t2rav",
                                                            "score": 1,
                                                            "created_utc": 1575607562.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!",
            "author": "andrea_athena",
            "id": "f9vmafz",
            "parent_id": "t1_f9tp0vx",
            "score": 0,
            "created_utc": 1575673962.0,
            "replies": [
                {
                    "body": ">It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!\n\nbecause some of the members on here make their living off of sugar, dont actually like older guys and are threatened by women that would actually date an older man who wasnt giving them an allowance.",
                    "author": "ruphun",
                    "id": "f9vpivm",
                    "parent_id": "t1_f9vmafz",
                    "score": 1,
                    "created_utc": 1575676314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. Because I really want all the downvotes🙄",
            "author": "This_is_Not_My_Handl",
            "id": "f9v9cnh",
            "parent_id": "t1_f9v8f8x",
            "score": 0,
            "created_utc": 1575665412.0,
            "replies": [
                {
                    "body": "Either you’re incredibly good looking and charming or these girls are thirsty af in a boring town.",
                    "author": "thehottubistoohawt",
                    "id": "f9v9gvi",
                    "parent_id": "t1_f9v9cnh",
                    "score": 1,
                    "created_utc": 1575665471.0,
                    "replies": [
                        {
                            "body": "~~or~~\nand",
                            "author": "This_is_Not_My_Handl",
                            "id": "f9vcki3",
                            "parent_id": "t1_f9v9gvi",
                            "score": 1,
                            "created_utc": 1575667392.0,
                            "replies": [
                                {
                                    "body": "Speculation...",
                                    "author": "thehottubistoohawt",
                                    "id": "f9vdilp",
                                    "parent_id": "t1_f9vcki3",
                                    "score": 1,
                                    "created_utc": 1575667996.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "AMEN!!! Nobodies stopped looking yet. My last vanilla boyfriend was 10 yrs younger than me and a certified super model....I rocked his damn world!!!",
            "author": "knowswhatiwant",
            "id": "f9u9ydx",
            "parent_id": "t1_f9tzfr5",
            "score": 5,
            "created_utc": 1575647038.0,
            "replies": []
        },
        {
            "body": "Even if they are why they expected to do it with everyone especially someone 2 to 3 times their age? Like let’s say an orgy breaks out full of millennials no ones gonna be askin where’s the old guy! \n\nFrom what you’ve seen? You mean TV, social media and word of mouth. Some small sample....a true sample of a population is 700 people. So when you have analyzed and verified the sexual activities of 700 18 to 22 yr olds then I’ll believe you.\n\nThis is where it annoys me the assumption if anyone of any age is sexually open their discretion is out the window! \n\nI’m a cusp can fall in either category, but the assumptions and shear fantasy men spew is insane.",
            "author": "knowswhatiwant",
            "id": "f9vplm2",
            "parent_id": "t1_f9vp2l0",
            "score": 5,
            "created_utc": 1575676370.0,
            "replies": []
        },
        {
            "body": "> i'm shocked this isn't obvious to her. \n\nIm not shocked at all. Some women only sugar date for money. They look at things transactionally, and are operating on a pro like basis, so of course they countnt possibility think any young women with date an older man without an allowance /s\n\n>This is literally a forum for people who seek sugar, of course there are no women here saying they'd do it for free.\n\nActually in the past, I have seen a few posts by SB saying that they would definitely vanilla date their SD if they had met them another way and not on Seeking.",
            "author": "ruphun",
            "id": "f9uch4s",
            "parent_id": "t1_f9u772s",
            "score": 2,
            "created_utc": 1575648282.0,
            "replies": []
        },
        {
            "body": "Lol, okay, I must have been hallucinating when I slept with all those women. Good thing you were here to clear that up.",
            "author": "Seven_league_boots",
            "id": "f9vgp69",
            "parent_id": "t1_f9v9e9e",
            "score": 3,
            "created_utc": 1575670086.0,
            "replies": [
                {
                    "body": "There are literally a few threads in the past few days about people who want to meet rich older men without allowance. I don't think these SBs realize that is a thing some people want.",
                    "author": "NoBromo3213",
                    "id": "f9vsjha",
                    "parent_id": "t1_f9vgp69",
                    "score": 2,
                    "created_utc": 1575678586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And yet so many 20 year olds sleep with their attractive +40 professors.",
            "author": "Seven_league_boots",
            "id": "f9vgren",
            "parent_id": "t1_f9vc171",
            "score": 3,
            "created_utc": 1575670128.0,
            "replies": []
        },
        {
            "body": "That is both surprising and hilarious (I suppose more in retrospect than at the moment for you)",
            "author": "brown_bi_babe",
            "id": "fa6pkp7",
            "parent_id": "t1_f9uws9y",
            "score": 1,
            "created_utc": 1575827268.0,
            "replies": []
        },
        {
            "body": "Tinder started as a hookup app and the userbase has transitioned it to more dating oriented. Of course people still use it for hookup but a large number of women I see on there are looking for relationships.",
            "author": "falecf4",
            "id": "f9usqik",
            "parent_id": "t1_f9u9spq",
            "score": 1,
            "created_utc": 1575657027.0,
            "replies": []
        },
        {
            "body": "Stop promoting your sub. Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh",
            "author": "knowswhatiwant",
            "id": "f9vpxea",
            "parent_id": "t1_f9vpd7a",
            "score": 1,
            "created_utc": 1575676614.0,
            "replies": [
                {
                    "body": "Believe it or not, the idea of getting paid to have sex is discomforting to some. \n\nI was talking to someone on OKC who was in college. She lamented that most older guys on the site were \"asking if I wanted money to be with them like I'm some kind of hooker!\". What she didn't know was I was fishing to see if she wanted an SR. Fortunately I hadn't made her an offer yet in the convo.",
                    "author": "NoBromo3213",
                    "id": "f9vtd1s",
                    "parent_id": "t1_f9vpxea",
                    "score": 2,
                    "created_utc": 1575679219.0,
                    "replies": [
                        {
                            "body": "You aren’t old though prob just doesn’t want old guys. If ya like someone and they offer to pay your rent doubt ya would be like nah...",
                            "author": "knowswhatiwant",
                            "id": "f9vthcu",
                            "parent_id": "t1_f9vtd1s",
                            "score": 1,
                            "created_utc": 1575679311.0,
                            "replies": [
                                {
                                    "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
                                    "author": "NoBromo3213",
                                    "id": "f9vvj8s",
                                    "parent_id": "t1_f9vthcu",
                                    "score": 1,
                                    "created_utc": 1575680898.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Stop promoting your sub\n\nnot my sub. Just a fan 🤣\n\n> Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh\n\ncan you translate this for us English speakers..?",
                    "author": "ruphun",
                    "id": "f9vzk16",
                    "parent_id": "t1_f9vpxea",
                    "score": 0,
                    "created_utc": 1575683980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry I’m hot and all my friend are too, where do I find the overweight girl?",
            "author": "Lilipuss25",
            "id": "f9vor3v",
            "parent_id": "t1_f9u8gw2",
            "score": 2,
            "created_utc": 1575675750.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9t1yie",
            "parent_id": "t1_f9t1qdh",
            "score": 2,
            "created_utc": 1575606367.0,
            "replies": [
                {
                    "body": "> It's just rare\n\nThat is a far more accurate statement (and what the OP probably should have said).",
                    "author": "Ranger3752",
                    "id": "f9t29nb",
                    "parent_id": "t1_f9t1yie",
                    "score": 2,
                    "created_utc": 1575606616.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9t2j5d",
                            "parent_id": "t1_f9t29nb",
                            "score": 11,
                            "created_utc": 1575606829.0,
                            "replies": [
                                {
                                    "body": "Valid point.",
                                    "author": "Ranger3752",
                                    "id": "f9t2nz5",
                                    "parent_id": "t1_f9t2j5d",
                                    "score": 3,
                                    "created_utc": 1575606934.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f9t2rav",
                                            "parent_id": "t1_f9t2nz5",
                                            "score": 3,
                                            "created_utc": 1575607010.0,
                                            "replies": [
                                                {
                                                    "body": "Your poor SD  😢😂",
                                                    "author": "Ranger3752",
                                                    "id": "f9t3f6o",
                                                    "parent_id": "t1_f9t2rav",
                                                    "score": 1,
                                                    "created_utc": 1575607562.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It definitely exists. I've no idea why I'm being downvoted tho. It's an actual thing!\n\nbecause some of the members on here make their living off of sugar, dont actually like older guys and are threatened by women that would actually date an older man who wasnt giving them an allowance.",
            "author": "ruphun",
            "id": "f9vpivm",
            "parent_id": "t1_f9vmafz",
            "score": 1,
            "created_utc": 1575676314.0,
            "replies": []
        },
        {
            "body": "Either you’re incredibly good looking and charming or these girls are thirsty af in a boring town.",
            "author": "thehottubistoohawt",
            "id": "f9v9gvi",
            "parent_id": "t1_f9v9cnh",
            "score": 1,
            "created_utc": 1575665471.0,
            "replies": [
                {
                    "body": "~~or~~\nand",
                    "author": "This_is_Not_My_Handl",
                    "id": "f9vcki3",
                    "parent_id": "t1_f9v9gvi",
                    "score": 1,
                    "created_utc": 1575667392.0,
                    "replies": [
                        {
                            "body": "Speculation...",
                            "author": "thehottubistoohawt",
                            "id": "f9vdilp",
                            "parent_id": "t1_f9vcki3",
                            "score": 1,
                            "created_utc": 1575667996.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are literally a few threads in the past few days about people who want to meet rich older men without allowance. I don't think these SBs realize that is a thing some people want.",
            "author": "NoBromo3213",
            "id": "f9vsjha",
            "parent_id": "t1_f9vgp69",
            "score": 2,
            "created_utc": 1575678586.0,
            "replies": []
        },
        {
            "body": "Believe it or not, the idea of getting paid to have sex is discomforting to some. \n\nI was talking to someone on OKC who was in college. She lamented that most older guys on the site were \"asking if I wanted money to be with them like I'm some kind of hooker!\". What she didn't know was I was fishing to see if she wanted an SR. Fortunately I hadn't made her an offer yet in the convo.",
            "author": "NoBromo3213",
            "id": "f9vtd1s",
            "parent_id": "t1_f9vpxea",
            "score": 2,
            "created_utc": 1575679219.0,
            "replies": [
                {
                    "body": "You aren’t old though prob just doesn’t want old guys. If ya like someone and they offer to pay your rent doubt ya would be like nah...",
                    "author": "knowswhatiwant",
                    "id": "f9vthcu",
                    "parent_id": "t1_f9vtd1s",
                    "score": 1,
                    "created_utc": 1575679311.0,
                    "replies": [
                        {
                            "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
                            "author": "NoBromo3213",
                            "id": "f9vvj8s",
                            "parent_id": "t1_f9vthcu",
                            "score": 1,
                            "created_utc": 1575680898.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Stop promoting your sub\n\nnot my sub. Just a fan 🤣\n\n> Not that it matters since you are here promoting a sub but saying women refuse money makes me laugh\n\ncan you translate this for us English speakers..?",
            "author": "ruphun",
            "id": "f9vzk16",
            "parent_id": "t1_f9vpxea",
            "score": 0,
            "created_utc": 1575683980.0,
            "replies": []
        },
        {
            "body": "> It's just rare\n\nThat is a far more accurate statement (and what the OP probably should have said).",
            "author": "Ranger3752",
            "id": "f9t29nb",
            "parent_id": "t1_f9t1yie",
            "score": 2,
            "created_utc": 1575606616.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9t2j5d",
                    "parent_id": "t1_f9t29nb",
                    "score": 11,
                    "created_utc": 1575606829.0,
                    "replies": [
                        {
                            "body": "Valid point.",
                            "author": "Ranger3752",
                            "id": "f9t2nz5",
                            "parent_id": "t1_f9t2j5d",
                            "score": 3,
                            "created_utc": 1575606934.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f9t2rav",
                                    "parent_id": "t1_f9t2nz5",
                                    "score": 3,
                                    "created_utc": 1575607010.0,
                                    "replies": [
                                        {
                                            "body": "Your poor SD  😢😂",
                                            "author": "Ranger3752",
                                            "id": "f9t3f6o",
                                            "parent_id": "t1_f9t2rav",
                                            "score": 1,
                                            "created_utc": 1575607562.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "~~or~~\nand",
            "author": "This_is_Not_My_Handl",
            "id": "f9vcki3",
            "parent_id": "t1_f9v9gvi",
            "score": 1,
            "created_utc": 1575667392.0,
            "replies": [
                {
                    "body": "Speculation...",
                    "author": "thehottubistoohawt",
                    "id": "f9vdilp",
                    "parent_id": "t1_f9vcki3",
                    "score": 1,
                    "created_utc": 1575667996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You aren’t old though prob just doesn’t want old guys. If ya like someone and they offer to pay your rent doubt ya would be like nah...",
            "author": "knowswhatiwant",
            "id": "f9vthcu",
            "parent_id": "t1_f9vtd1s",
            "score": 1,
            "created_utc": 1575679311.0,
            "replies": [
                {
                    "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
                    "author": "NoBromo3213",
                    "id": "f9vvj8s",
                    "parent_id": "t1_f9vthcu",
                    "score": 1,
                    "created_utc": 1575680898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9t2j5d",
            "parent_id": "t1_f9t29nb",
            "score": 11,
            "created_utc": 1575606829.0,
            "replies": [
                {
                    "body": "Valid point.",
                    "author": "Ranger3752",
                    "id": "f9t2nz5",
                    "parent_id": "t1_f9t2j5d",
                    "score": 3,
                    "created_utc": 1575606934.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9t2rav",
                            "parent_id": "t1_f9t2nz5",
                            "score": 3,
                            "created_utc": 1575607010.0,
                            "replies": [
                                {
                                    "body": "Your poor SD  😢😂",
                                    "author": "Ranger3752",
                                    "id": "f9t3f6o",
                                    "parent_id": "t1_f9t2rav",
                                    "score": 1,
                                    "created_utc": 1575607562.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Speculation...",
            "author": "thehottubistoohawt",
            "id": "f9vdilp",
            "parent_id": "t1_f9vcki3",
            "score": 1,
            "created_utc": 1575667996.0,
            "replies": []
        },
        {
            "body": "I mean yes in sugar terms I am not old, but when she was referring to the group of \"older guys\" she was including me and was implying that she was glad I had not acted the same way as the other \"older guys\" had. \n\nI think bringing up money, especially early on, to someone who wants a vanilla thing can make things very weird. Some would feel guilty taking money, some don't want the feeling of owing someone else (even if I insist it's a gift), some like the girl above don't want to feel like they are being paid to have sex etc. It's not a universal sentiment that if someone offers money people will always take it. It very much depends on how and when the topic comes up. (Of course the pool of younger girls seeking vanilla with older men is not huge, but there are some. Most are probably opening their age range in order to find an SR, but not all.)\n\nAs soon as it moves away from straight up cash though, vanilla people open up way more to it. Like if I offered to buy them something nice we see when we're outside, or on a vacation etc then most would be ok with that. But I probably couldn't open up with that as it could come off weird/desperate or like a scam or car salesman-y. It's gotta come up later and feel genuinely like I'm offering it as a gift / because I can afford to and not as a way to compensate them for being with me.",
            "author": "NoBromo3213",
            "id": "f9vvj8s",
            "parent_id": "t1_f9vthcu",
            "score": 1,
            "created_utc": 1575680898.0,
            "replies": []
        },
        {
            "body": "Valid point.",
            "author": "Ranger3752",
            "id": "f9t2nz5",
            "parent_id": "t1_f9t2j5d",
            "score": 3,
            "created_utc": 1575606934.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9t2rav",
                    "parent_id": "t1_f9t2nz5",
                    "score": 3,
                    "created_utc": 1575607010.0,
                    "replies": [
                        {
                            "body": "Your poor SD  😢😂",
                            "author": "Ranger3752",
                            "id": "f9t3f6o",
                            "parent_id": "t1_f9t2rav",
                            "score": 1,
                            "created_utc": 1575607562.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9t2rav",
            "parent_id": "t1_f9t2nz5",
            "score": 3,
            "created_utc": 1575607010.0,
            "replies": [
                {
                    "body": "Your poor SD  😢😂",
                    "author": "Ranger3752",
                    "id": "f9t3f6o",
                    "parent_id": "t1_f9t2rav",
                    "score": 1,
                    "created_utc": 1575607562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your poor SD  😢😂",
            "author": "Ranger3752",
            "id": "f9t3f6o",
            "parent_id": "t1_f9t2rav",
            "score": 1,
            "created_utc": 1575607562.0,
            "replies": []
        }
    ]
}