{
    "title": "Discussing sugar: how to ask for things when raised by cheap parents?",
    "post_id": "d9y80l",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/d9y80l/discussing_sugar_how_to_ask_for_things_when/",
    "author": null,
    "body": "So kind of an odd question, but here goes:\n\nMy dad is cheap. Or at least, he always dreaded the thought of spoiling me or my sister. This means that instead of driving me (12 years old) to my friend's house, he would instead present to me an equation of how much time amd money it would cost him (20 minutes each way + gas + taxes ++), and how I could just take the bus. I don't mind taking the bus, but similar discussions would pop up everytime there was something i wanted. Keep in mind my father is RICH, and he could make my life so much easier if he wasn't obsessed with always spending the bare minimum.\n\nEnough of the unrelated story/rant. You get my point. After years of being slammed down whenever I asked for something, it became incredibly uncomfortable to do so. I hate it, it gives me anxiety just thinking about it.\n\nNow, I brought up financial expectation with my new POT (over text), and he wanted to discuss my needs next time we meet. \n\nMY NEEDS?! I don't \"need\" his money, I will survive on my student loan and part time job. I don't \"need\" more, but I want more. I want to buy a new couch, I want to buy expensive, organic avocados, and I want to buy new shoes that I will only wear one time.\n\nHow do I discuss this when It's so incredibly painful for me to do so? How much do I ask for? We both agreed we wanted a monthly allowance. I reaaally like this guy, but obviously more is more when it comes to sugar. \n\nI really hope this doesn't come across as \"just another newbie question\", because I've noticed this sub is filling up on them.\n\nAny advice from strangers? Thanks in advance",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/d9y80l/discussing_sugar_how_to_ask_for_things_when/",
    "score": 110,
    "upvote_ratio": 0.95,
    "created_utc": 1569578696.0,
    "num_comments": 95,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I can completely relate to this.  I grew up poor and in a very abusive neglectful home.  Anytime I would ask for things it was met with verbal or physical abuse so I completely understand shutting down.  It has taken me a lot of therapy and hard work to get better but the bowl has actually helped me.  It’s about letting go and being vulnerable to talk about those things.  If you think doing it over text or phone would be easier for you, do that, don’t feel like you have to do it in person(I get a little akward about it and I am a super confident woman). \n\nRemember, not every man is your dad.  You are going to meet some shitty mean in the bowl, use your experience with your dad to not tolerate that treatment.  Instead find someone who cares about you and wants to do those things for you.  When you do, it can be amazing and can help heal some old wounds too.  Good luck, I hope he is a good guy and it works out",
            "author": "CCsugarbaby",
            "id": "f1m1bi9",
            "parent_id": "t3_d9y80l",
            "score": 51,
            "created_utc": 1569580240.0,
            "replies": [
                {
                    "body": "Thank you so much! And I'm happy to hear you've fought through a lot of this.\n\nWhat worries me is that some (most) SDs wants to spend as little as possible in allowance. I think it's naive to believe that they actually LIKE to just give me stuff, based of what I've read in here...\n\nI don't know what I'm scared of. Getting a \"no\" is the worst that can happen, right?",
                    "author": null,
                    "id": "f1m1n8w",
                    "parent_id": "t1_f1m1bi9",
                    "score": 17,
                    "created_utc": 1569580666.0,
                    "replies": [
                        {
                            "body": "This is fully dependent on the SD, if you read around the threads here some SD's will just give money sporadically on top of what's agreed. \n\nIt is also fully dependent on if the SB is \"worth it\". For me I've done both, see what the minimum I can get away with and go with that--while others send a random Venmo amount without having it brought up.\n\nI can't tell you the exact reasoning behind it but the less needy a girl seems the more I'm willing to give but if they make it clear I'm just an ATM then I'm less enthused to do so.",
                            "author": "tenmillionplus",
                            "id": "f1mmmqh",
                            "parent_id": "t1_f1m1n8w",
                            "score": 10,
                            "created_utc": 1569597407.0,
                            "replies": []
                        },
                        {
                            "body": "Dont settle for stingy guys. Since you are getting by alright, it's ok to be picky. There is a mega thread on the subs wiki that shows allowance averages based in city. You should look at that for an idea. But ultimately you discuss whatever amount with your sugar daddy.",
                            "author": "Anxioussquidkid",
                            "id": "f1mo5o3",
                            "parent_id": "t1_f1m1n8w",
                            "score": 12,
                            "created_utc": 1569598389.0,
                            "replies": [
                                {
                                    "body": "Thank you! Where can i find this wiki?",
                                    "author": null,
                                    "id": "f1mp22i",
                                    "parent_id": "t1_f1mo5o3",
                                    "score": 5,
                                    "created_utc": 1569598972.0,
                                    "replies": [
                                        {
                                            "body": "On mobile click community info and it should be somewhere there",
                                            "author": "Anxioussquidkid",
                                            "id": "f1mxbyh",
                                            "parent_id": "t1_f1mp22i",
                                            "score": 4,
                                            "created_utc": 1569604196.0,
                                            "replies": [
                                                {
                                                    "body": "I found it, thanks!\nBut average allowance per area is just a hole of deleted comments 😅 doubt i find Norway on the list anyway.",
                                                    "author": null,
                                                    "id": "f1myjkh",
                                                    "parent_id": "t1_f1mxbyh",
                                                    "score": 9,
                                                    "created_utc": 1569604959.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re in Norway?",
                                                            "author": "fannyhoney",
                                                            "id": "f1ni22i",
                                                            "parent_id": "t1_f1myjkh",
                                                            "score": 1,
                                                            "created_utc": 1569617768.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yep, you? Fanny is kind of a norwegian name :)",
                                                                    "author": null,
                                                                    "id": "f1ni6g5",
                                                                    "parent_id": "t1_f1ni22i",
                                                                    "score": 1,
                                                                    "created_utc": 1569617851.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                                                                            "author": "fannyhoney",
                                                                            "id": "f1p81y7",
                                                                            "parent_id": "t1_f1ni6g5",
                                                                            "score": 1,
                                                                            "created_utc": 1569674599.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                                                                    "author": null,
                                                                                    "id": "f1pa00o",
                                                                                    "parent_id": "t1_f1p81y7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1569675945.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you need to change the conversation. If you both agree you want a monthly allowance, why does he need to know which things you'll be buying with that money? You need to make it clear to him, in the most non-confrontational way you are able to, that it is none of his business. Just figure out how much all those things you want to buy will cost you on a monthly average and ask him if it is within his budget.",
            "author": "MyIncognitoMe",
            "id": "f1m1dp4",
            "parent_id": "t3_d9y80l",
            "score": 14,
            "created_utc": 1569580319.0,
            "replies": [
                {
                    "body": "Just want to emphasize: what you’ll spend the money on is none of his business really. And any discussion of that is a waste of time. Probably best to just flat out say that and avoid any such discussion because mostly that’s a route to minimize what he’s willing to provide - if he insists on having you detail “needs” then safe to say he’s just trying to lowball and any money will be a battle every time. \n\n“I mostly have my needs met. I have a job (parents, school loans, whatever) and I don’t need a lot. This is really about having somebody to do fun things with and having some extra money to enjoy. Now as to what I enjoy, there’s so many things and I’m sure we’ll discuss many of them over time but many of the normal things people value - travel, nice food, I’d love to upgrade my apt etc. and I wouldn’t mind taking fewer student loans (taking less from parents, working fewer hours) along the way. I’m looking for somebody to help with that. I’m not extravagant but if you’re willing to help with those things I’m interested in hearing what you’re willing to do”.",
                    "author": "2fast-2curious",
                    "id": "f1m4tgu",
                    "parent_id": "t1_f1m1dp4",
                    "score": 15,
                    "created_utc": 1569584231.0,
                    "replies": []
                },
                {
                    "body": "Thanks!\n\nObviously I \"want it all\", but 1M$ a month is a bit much to ask for haha... i know some SB's get up to 4000$ but, that sounds very unreasonable to me. I just have no idea what the \"window\" is, and I don't want to ask for less than I can get.\n\nKind of a greedy way to think, but yeah..",
                    "author": null,
                    "id": "f1m1qp4",
                    "parent_id": "t1_f1m1dp4",
                    "score": 4,
                    "created_utc": 1569580789.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f1m7ltx",
                            "parent_id": "t1_f1m1qp4",
                            "score": 2,
                            "created_utc": 1569586834.0,
                            "replies": [
                                {
                                    "body": "My apartment is like 660$, so I definetely want to aim higher. Thank you so much for the advice",
                                    "author": null,
                                    "id": "f1mnkjw",
                                    "parent_id": "t1_f1m7ltx",
                                    "score": 2,
                                    "created_utc": 1569598009.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f1mogpr",
                                            "parent_id": "t1_f1mnkjw",
                                            "score": 2,
                                            "created_utc": 1569598588.0,
                                            "replies": [
                                                {
                                                    "body": "She’s in Norway which is going to have different customs if for no other reason than the taxes. High earners there are paying 55-60% in tax I think?",
                                                    "author": "SDstartingOut",
                                                    "id": "f1n6lmp",
                                                    "parent_id": "t1_f1mogpr",
                                                    "score": 3,
                                                    "created_utc": 1569610160.0,
                                                    "replies": [
                                                        {
                                                            "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
                                                            "author": null,
                                                            "id": "f1pgqxh",
                                                            "parent_id": "t1_f1n6lmp",
                                                            "score": 1,
                                                            "created_utc": 1569680096.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yeah, it's a cheap student-room of about 16square meters ;)",
                                                    "author": null,
                                                    "id": "f1mozyr",
                                                    "parent_id": "t1_f1mogpr",
                                                    "score": 1,
                                                    "created_utc": 1569598935.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not sure what part of the country or world you're in but $4,000 a month allowances are fairly unusual in my experience.\n\nIt's also entirely dependent on how much time you're willing to commit. For example, if your going to see someone two to three times a week, you would expect a larger allowance that if you were seeing someone once a week.\n\nI like the apartment formula but I also use the tuition formula :-) basically, if I was seeing someone once a week, I'd be willing to pick up the tuition at one of our state schools along with rent assuming it's a normal roommate situation and not the penthouse in a high-end building :-)  \n\nOf course, everything starts with a PPM",
                            "author": "mtncityguy",
                            "id": "f1m99gp",
                            "parent_id": "t1_f1m1qp4",
                            "score": 5,
                            "created_utc": 1569588202.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ask for what’s comfortable for you. Think about how much all of these things will cost (avocados are expensive, hello) and come up with a nice number. \n\nI grew up poor and in a situation like yourself, my parents just didn’t have the money to give. I was comfortable asking for $1,000/month allowance, which covers rent/utilities/food where I live. And my SD was more than happy, plus adding some extra if I wanted a new outfit for a date or to go get my hair done, whatever. \n\nThese men are not your parents. They’re in this lifestyle for a reason...well, most of them.",
            "author": "mollllyx",
            "id": "f1moyj0",
            "parent_id": "t3_d9y80l",
            "score": 12,
            "created_utc": 1569598908.0,
            "replies": [
                {
                    "body": "You're right, they CHOSE this as well. And I'm not exactly asking for free money, I guess I hold some sort of value to the SDs 😅\n\nThanks. Geez, i really like this sub",
                    "author": null,
                    "id": "f1mp7ie",
                    "parent_id": "t1_f1moyj0",
                    "score": 4,
                    "created_utc": 1569599069.0,
                    "replies": [
                        {
                            "body": "Let me rephrase, they’re not stingy like your parents. Usually. \n\nAnd it’s not “free” money. You have to work to keep a relationship going.",
                            "author": "mollllyx",
                            "id": "f1mpdnu",
                            "parent_id": "t1_f1mp7ie",
                            "score": 5,
                            "created_utc": 1569599179.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My issue is I am horrible at asking for anything.  I've always been such a proud independent woman and it kills me the situation I am in now.  I've been lucky in the two SDs I connected with had no qualms about stating how much they'd like to give me as an allowance and it was an amount I am appreciative of.  I also get VERY uncomfortable when they hand it to me. It's all so awkward. I am definitely not made for this!",
            "author": "secretsofthisgal",
            "id": "f1mjzrl",
            "parent_id": "t3_d9y80l",
            "score": 6,
            "created_utc": 1569595688.0,
            "replies": [
                {
                    "body": "wow we’re like the same person it’s insane - how did you deal with this?",
                    "author": "lovelybabe88",
                    "id": "f1nico6",
                    "parent_id": "t1_f1mjzrl",
                    "score": 2,
                    "created_utc": 1569617970.0,
                    "replies": []
                },
                {
                    "body": "Have him paypal or Venmo the funds, can be done before date & no cash exchange during your time together. Takes away the \"uncomfortable\" you speak of. Have a beautiful day.",
                    "author": "MyBeautifulLife4Me",
                    "id": "f1p9f44",
                    "parent_id": "t1_f1mjzrl",
                    "score": 2,
                    "created_utc": 1569675560.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“ thank you so much for asking because I despise talking about money.  It makes me very uncomfortable so hopefully this is our first and last money talk so we can just enjoy each other.   I would love to have ($500 or whatever) for each time we meet.   I don’t expect a darn thing if I have to reschedule or cancel but I would be relieved if you agreed to send me a Venmo/cashapp if you cancel or reschedule because I really need the money (I wish I didn’t) so that would put my mind at ease and allow me to focus on making you happy.”",
            "author": "LotBuilder",
            "id": "f1n0m8n",
            "parent_id": "t3_d9y80l",
            "score": 12,
            "created_utc": 1569606264.0,
            "replies": [
                {
                    "body": "Huh. I think i'll write that down",
                    "author": null,
                    "id": "f1n110z",
                    "parent_id": "t1_f1n0m8n",
                    "score": 2,
                    "created_utc": 1569606524.0,
                    "replies": []
                },
                {
                    "body": "how'd you become such a good communicator?",
                    "author": "aceshighsays",
                    "id": "f1nb25s",
                    "parent_id": "t1_f1n0m8n",
                    "score": 1,
                    "created_utc": 1569613096.0,
                    "replies": [
                        {
                            "body": "A lot of reading,  experience trying to pre empt or pre address issues that often come up.   Follow a guy named Chris Voss on FB and Instagram.   He was a FBI hostage negotiator.  His style is not tricky or slick,  he creates “tactical empathy” so you get what you want without being adversarial.  The “I hate taking about money” means you are not going to haggle.   Acting like you are giving something (not getting money if you cancel or reschedule, duh) before setting a firm expectation if the other side makes a change.    Tying those changes to hurting you.   If they push back against you they look unreasonable and somewhat cruel.  That’s all tactical empathy.",
                            "author": "LotBuilder",
                            "id": "f1nc4ip",
                            "parent_id": "t1_f1nb25s",
                            "score": 12,
                            "created_utc": 1569613805.0,
                            "replies": [
                                {
                                    "body": "I want to add his book, _Never Split the Difference_, is a fantastic read. I imagine the rest of his works are, as well.",
                                    "author": "ScreenPeepinE",
                                    "id": "f1nhfku",
                                    "parent_id": "t1_f1nc4ip",
                                    "score": 6,
                                    "created_utc": 1569617350.0,
                                    "replies": []
                                },
                                {
                                    "body": "thank you!!",
                                    "author": "aceshighsays",
                                    "id": "f1ncozi",
                                    "parent_id": "t1_f1nc4ip",
                                    "score": 1,
                                    "created_utc": 1569614188.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just every time he says the word \"needs\" translate it in your mind to \"wants\" lol.",
            "author": "DreamingLurker",
            "id": "f1mpmgy",
            "parent_id": "t3_d9y80l",
            "score": 4,
            "created_utc": 1569599335.0,
            "replies": [
                {
                    "body": "Yes this",
                    "author": "Momopllc",
                    "id": "f1nn1vy",
                    "parent_id": "t1_f1mpmgy",
                    "score": 4,
                    "created_utc": 1569621012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish I knew what to tell you but I'm in the same boat most of the time. I feel terrible for it but I've had breakdowns when SDs use \"need\" instead of \"want\" and I've ghosted because I felt like they'd tell me I dont need internet or a car like my parents have told me when I ask them for help. I want to stop feeling guilty for wanting.",
            "author": "Mopsydoll",
            "id": "f1nikek",
            "parent_id": "t3_d9y80l",
            "score": 5,
            "created_utc": 1569618101.0,
            "replies": [
                {
                    "body": "I would ghost too!\nLet's just hope it gets easier with time and experience. \nWe want sugar daddies, not fructose fathers!",
                    "author": null,
                    "id": "f1nj1u5",
                    "parent_id": "t1_f1nikek",
                    "score": 5,
                    "created_utc": 1569618409.0,
                    "replies": [
                        {
                            "body": "Yes and we shouldn't feel afraid of being happy. It's okay to want things and there's no harm in just asking right?",
                            "author": "Mopsydoll",
                            "id": "f1nlgll",
                            "parent_id": "t1_f1nj1u5",
                            "score": 2,
                            "created_utc": 1569619922.0,
                            "replies": [
                                {
                                    "body": "Yeah that's what they say!\nI mean, people negotiate ALL THE TIME. Why can't we?",
                                    "author": null,
                                    "id": "f1nllcp",
                                    "parent_id": "t1_f1nlgll",
                                    "score": 3,
                                    "created_utc": 1569620009.0,
                                    "replies": [
                                        {
                                            "body": "We are gonna live our best lives even if it scares the crud out of us 😂",
                                            "author": "Mopsydoll",
                                            "id": "f1nlwz7",
                                            "parent_id": "t1_f1nllcp",
                                            "score": 1,
                                            "created_utc": 1569620217.0,
                                            "replies": [
                                                {
                                                    "body": "Shittt, i'm scared 😅",
                                                    "author": null,
                                                    "id": "f1no6r3",
                                                    "parent_id": "t1_f1nlwz7",
                                                    "score": 2,
                                                    "created_utc": 1569621836.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
                                                            "author": "Mopsydoll",
                                                            "id": "f1nsyys",
                                                            "parent_id": "t1_f1no6r3",
                                                            "score": 2,
                                                            "created_utc": 1569625476.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girl you are way over thinking this.\n\nAn SD is never going to have a problem asking you to go down on him in bed, so you should have no problem asking for clothes, jewelery, fancy dinners, experiences, makeup, groceries, tuition, and of course allowance.\n\nIt's all fun and we'll to play the \"cool\" \"great value\" girl in vanilla dating, but in the sugar bowl that's not going to get you where you want to be. Unlearn it. It's uncomfortable to ask for stuff, especially when you've grown up learning to be a \"strong independent woman\", but at the end of the day closed mouths do not get fed, and an SD should not have to \"intuit\" your needs. He's way to busy for that and you will be left feeling cheated and a little disappointed.\n\nIt's not a question of whether you \"want\" or \"need\" something at all. That irrelevant. You're asking because you know you deserve it. And you know that he knows you're not going to fuck him unless he gives it to you. \n\nThat being said obviously don't be a bitch about it. Just be clear and straightforward, and if an SR is no longer beneficial to you, feel free to walk away. Just like an SD should feel empowered to do the same.",
            "author": null,
            "id": "f1nawdu",
            "parent_id": "t3_d9y80l",
            "score": 12,
            "created_utc": 1569612986.0,
            "replies": [
                {
                    "body": "I wish I could upvote you two times. Thank you for putting it that way! And you are so right. No SD has ever been shy about asking sexual favors.\nGee, this helps a lot",
                    "author": null,
                    "id": "f1p6jvb",
                    "parent_id": "t1_f1nawdu",
                    "score": 7,
                    "created_utc": 1569673523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What you \"need\" is allowance. Without going into more detail you can say \"for living expenses\".   \n\nThe amount is all over the place in the bowl. You need to decide how much is necessary to make a difference in your quality of life. Usually that amount would cover your rent and utilities. If you have roommates and rent is not crazy high as a student you could throw in phone and fun money. The medium allowance might run in the $1500-2000/month depending on the area.",
            "author": "GSSD",
            "id": "f1mdciw",
            "parent_id": "t3_d9y80l",
            "score": 5,
            "created_utc": 1569591252.0,
            "replies": []
        },
        {
            "body": "Two quick thoughts.  First, ask in text or on the phone what ballpark allowance the gent was thinking about and how that might be split into PPMs (the most common method, especially early).  If he is in your ballpark, move forward and convey your interest and your personal positives clearly.  It is super important to be clear what you should expect and for you to be comfortable with the core arrangement before moving forward.  \n\nSecond, my best partner would mention from time to time a financial challenge without asking for help.  For example, \"American higher education seems crazy to me.  Why should I need to pay $90 to submit the thesis expected for the degree I am already enrolled in (blah, blah).\"  She covered ubers to our initial dates, never said a word, and I found out organically.  I covered these costs and she was honestly appreciative.  This great partner (hi Writer Girl!) was raised by less frugal parents than you (the bus thing is crazy).  Still, she is personally very frugal.  I think Writer Girl understood, intuitively, that I literally gave her all I could without messing with my general situation over the last 6-8 weeks of our arrangement.  That was the point where she knew she had not gotten into a PhD program and would need to move away.  \n\nAnyway, with a good SD, this combination of insisting you be clear on the basic allowance and then appreciation for any gifts beyond that might serve you well.  PM if this is not clear or you have a follow on question.",
            "author": "NCtriadSD",
            "id": "f1mlgy9",
            "parent_id": "t3_d9y80l",
            "score": 2,
            "created_utc": 1569596660.0,
            "replies": []
        },
        {
            "body": "SBs generally need to realize money is not freighted for us.  It’s more like Monopoly money.  We don’t even know how much stuff costs.  Should I tip $2 or $20, I don’t know.  A SB had to tell me to quit giving $1,000 shopping money, give $200 to start.\n\nIf you can think about money like we do - as a means to an end- you can prosper.",
            "author": "MidwestAmMan",
            "id": "f1n14y8",
            "parent_id": "t3_d9y80l",
            "score": 3,
            "created_utc": 1569606593.0,
            "replies": [
                {
                    "body": "Wait.. how much does uber pay really?",
                    "author": null,
                    "id": "f1n1r34",
                    "parent_id": "t1_f1n14y8",
                    "score": 3,
                    "created_utc": 1569606990.0,
                    "replies": [
                        {
                            "body": "We have to pay them .50/mile.  But we make it up in volume",
                            "author": "MidwestAmMan",
                            "id": "f1n4llc",
                            "parent_id": "t1_f1n1r34",
                            "score": 1,
                            "created_utc": 1569608857.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1st don't assume the word needs means actual needs more along the lines of what you need or expect or want it just seems an easier way of asking.  To get the conversation started I do the same.\n\nThat said keep in mind most of us S d's are more generous with our sugar babies than we are in the vanella a normal world.  Best advice is find something that you're satisfied with and then make him feel that it was appreciated,  \n\nMany babies have read way too much about all the things you can get in the lifestyle and think it's just a given the reality is that's the attitude that turns daddy's off  The things read are all about marketing and hype right now and 95% of them are untrue. \n\nLike any relationship don't the take things for granted because that is a path with one destination and puts a duration on the relationship.  And I mean a shorter duration.\n\nI can't speak for all daddy's but a tell I begin the conversation just to find out what somebody really needs because I'd like to do better than what they need or want.  \n\nJust show up be grateful be appreciative try to under promise and over deliver.  Not much just enough so that somebody knows your worth it because you are but you have to demonstrate that you can't just assume that too many assume that and then showed themselves to be social outcast with no class,   Having money does not give your class and one can be poor and demonstrate excessive class.",
            "author": "Momopllc",
            "id": "f1nmt1t",
            "parent_id": "t3_d9y80l",
            "score": 4,
            "created_utc": 1569620830.0,
            "replies": []
        },
        {
            "body": "I feel like that’s a limiting belief. And it’s what holds most SBs back. If there is a limited number of men offering allowances of that sizeable amount, have I been the only SB who’s been able to find them all?? That can’t be... and I’ve not only found them in New York, but in California as well. Or should I say they found me, lol?😉",
            "author": "RealEarthAngel",
            "id": "f1nxrm3",
            "parent_id": "t3_d9y80l",
            "score": 3,
            "created_utc": 1569629233.0,
            "replies": [
                {
                    "body": "> I’ve not only found them in New York, but in California as well.\n\nSo, seriously, the most expensive places in the US roughly fit into 3 areas.\n\n* NYC\n* Various areas in CA\n* And Seattle\n\n> have I been the only SB who’s been able to find them all??\n\nAgain, there is a limitation of what we can talk about, based on rule number 4.  However to your point - in a sense.  It's not surprising that in high cost of living areas, women fitting certain criteria are able to find higher amount arrangements.  My assumption is you fit into that.  That's not all women, nor all SBs.  \n\nIt sounds like you do;  that's awesome.  But even among SBs, that's not the \"average\".",
                    "author": "SDstartingOut",
                    "id": "f1o2o37",
                    "parent_id": "t1_f1nxrm3",
                    "score": 3,
                    "created_utc": 1569633032.0,
                    "replies": [
                        {
                            "body": "Yeah, there's the main difference i think. After looking up some different allowances in the NY area, I can say that rich Americans make much more money than Rich Norwegians (which is where i live)",
                            "author": null,
                            "id": "f1oha9b",
                            "parent_id": "t1_f1o2o37",
                            "score": 1,
                            "created_utc": 1569645536.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hi there, just my thoughts but I feel your dad was trying to teach you and your sister the value of money and how to be frugal in your life as wealth in life generally comes from spending skills rather than earning skills.\n\nThat said, I now feel that your mindset should shift from being the one asking for a handout and learning value to being the one setting the value.  Instead of thinking about what the SD costs are (like you did with your dad when he was teaching you) to thinking about what your costs are and what you need to receive to get value for what you are offering.\n\nWith this way of thinking, instead of the experience being painful as the one asking, you should be empowered by the experience as the one judging if the amount offered to you is enough (with your costs for travel, clothing, makeup, time etc). Your dad would want you to grow to be the one giving the lesson in value.\n\nAll this may not change how much are requiring as an allowance but it should make you more comfortable with why the amount is reasonable. If you want to give anything extra to your SD, give quality.  He'll remember that for a lot longer than a discount.",
            "author": "Funexec",
            "id": "f54dnol",
            "parent_id": "t3_d9y80l",
            "score": 3,
            "created_utc": 1571978593.0,
            "replies": [
                {
                    "body": "Thank you for taking the time to respond :)",
                    "author": null,
                    "id": "f54rrto",
                    "parent_id": "t1_f54dnol",
                    "score": 1,
                    "created_utc": 1571990254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An allowance is a gift, what you do with your gift is your business. I try to help with financial shortfalls so my SB can use her allowance as she sees fit. I also take her shopping and have her list things on amazon for gifting.",
            "author": "ontherdagn",
            "id": "f1mvg1r",
            "parent_id": "t3_d9y80l",
            "score": 2,
            "created_utc": 1569602995.0,
            "replies": []
        },
        {
            "body": "If u said that to me.... i can get by fine on my own but i want money for shoes and organic avocados.. i want some extra so that i can buy some \"nice to have things\" . i would ask how much, i think how u put it is really fun and cute.... \n\nBe honest and upfront like u are here... i personally would react in a good way to hearing how u put it.... i would \"get it\" ..... im dense sometimes and i need it point blank \"i want some extra\" ..... makes me want to give more if she is upfront and honest.... that was honest.\n\nIf he is into, like u say you like him.... this wont be a problem i dont think... if he balks, idk",
            "author": "SpaceGuy1968",
            "id": "f1noc38",
            "parent_id": "t3_d9y80l",
            "score": 2,
            "created_utc": 1569621947.0,
            "replies": [
                {
                    "body": "Haha thanks!",
                    "author": null,
                    "id": "f1p1xsj",
                    "parent_id": "t1_f1noc38",
                    "score": 1,
                    "created_utc": 1569669800.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for starting this thread, my parents (middle class) were thoughtful spenders. I have a spoiling boyfriend on my hands as my first relationship and I have such an issue with how I am to ask for things I want, not need - just want. Like Sunday we have an open day planned and I want to go shopping. Can I open my mouth and say that - no. 🤦🏾‍♀️",
            "author": "browniebowl",
            "id": "f1nx5sf",
            "parent_id": "t3_d9y80l",
            "score": 2,
            "created_utc": 1569628762.0,
            "replies": [
                {
                    "body": "I feel you so hard. \nBut since it's easier to tell others what to do: tell him! The worst you can get is a \"no\", right? Has anyone ever got dumped for wanting to shop?",
                    "author": null,
                    "id": "f1p1qbt",
                    "parent_id": "t1_f1nx5sf",
                    "score": 1,
                    "created_utc": 1569669629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can assure you that $4000 a month is not at all unreasonable!  If you know you’re worth a generous amount, you’ll eventually connect with the right SD who agrees.  I have had several long-term arrangements (the shortest was a year, and the longest was several years), and I have received at least THREE times that much per month from ALL  of them.  I have lived in New York and I now live in San Diego, and I’ve sugared in both places.  Honestly, if someone offered me my rent amount as a monthly allowance for once a week visits, I would tell him “thank you, but no thank you”.  Don’t define yourself by anyone else’s parameters... make your own.  If more SBs did that and stopped selling themselves short, it would be better in the sugar bowl for all of us😉\nAnd BTW... my dad was frugal as well, so I know how that feels.",
            "author": "RealEarthAngel",
            "id": "f1mpzy8",
            "parent_id": "t3_d9y80l",
            "score": 1,
            "created_utc": 1569599577.0,
            "replies": [
                {
                    "body": "> Don’t define yourself by anyone else’s parameters... make your own. \n\nthis is a true statement for living.",
                    "author": "aceshighsays",
                    "id": "f1na3gg",
                    "parent_id": "t1_f1mpzy8",
                    "score": 2,
                    "created_utc": 1569612448.0,
                    "replies": []
                },
                {
                    "body": "Wow that is incredible. However, i live in Norway, and although we are a rich people, the richest of us aren't rhat much richer than the average. If that makes sense? So aiming for 4k+ is out of the question.. I think I'll be happy with anywhere between 1.2k and 2k. \nI just have no idea how to get there 🤷‍♀️",
                    "author": null,
                    "id": "f1n00r3",
                    "parent_id": "t1_f1mpzy8",
                    "score": 2,
                    "created_utc": 1569605893.0,
                    "replies": []
                },
                {
                    "body": "You are the exception not the rule. Just like there are ball players that make $35 million a year and others that make a few hundred thousand. Also NYC isn’t the same as every where else in the US. Average Allowances seem to be 2-3 times higher there then other low COLA localities.",
                    "author": "ruphun",
                    "id": "f1n0758",
                    "parent_id": "t1_f1mpzy8",
                    "score": 2,
                    "created_utc": 1569606004.0,
                    "replies": [
                        {
                            "body": "I'm not sure that's the case. The cost of living in New York is certainly higher and I understand that but the numbers of well educated and attractive women in New York is four to five times higher there than other low Cola localities.",
                            "author": "mtncityguy",
                            "id": "f1pceif",
                            "parent_id": "t1_f1n0758",
                            "score": 1,
                            "created_utc": 1569677503.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If he is a POT, then monthly allowance is a ways off. You will probably have better luck getting a reasonable ppm to start. Depending upon what he wants should help you determine reasonable. And you are not asking, you are offering a trade. A mutually beneficial relationship. First, Get him to be clear on all the things that he would like, and if you are ok with that, “I can agree to do everything you ask. Now, (heartbeat, heartbeat) what is that worth to you?” This is the moment of truth. Now you find out if he is a serious SD. If he is close, but low, you can say “Can you do X in return for my being available to you?” If he is way way low, simply say, I’m sorry, I don’t think this will work. He then will probably ask what it will take, and you can tell him. Usually someone offering a really low number is not thinking of negotiations. He just is cheap. Good luck on your next talk! (Btw this is best done on the phone or in person)",
            "author": "SDforreal",
            "id": "f1m2bfh",
            "parent_id": "t3_d9y80l",
            "score": 2,
            "created_utc": 1569581506.0,
            "replies": [
                {
                    "body": "Thanks for your response!\nI guess i have a problem with the \"what is this worth to you\" as I think it sounds kind of escorty.. and I also don't know how much I should ask for in return. Like, all my monthly expenses? Some?",
                    "author": null,
                    "id": "f1m2lm4",
                    "parent_id": "t1_f1m2bfh",
                    "score": -1,
                    "created_utc": 1569581855.0,
                    "replies": [
                        {
                            "body": "If you just don’t like that wording (I kinda don’t either), would you feel better with “everything you say sounds reasonable, what kind of allowance did you have in mind”. \n\nAs for how much to ask, that’s so personal. Check the master allowance thread, but you have to consider how often, how much time, how much you like/dislike spending time with him, etc. but you def want to make sure that whatever it is, if he says yes, your response should be happy - not any uncertainty or whatever.",
                            "author": "2fast-2curious",
                            "id": "f1m56n4",
                            "parent_id": "t1_f1m2lm4",
                            "score": 5,
                            "created_utc": 1569584585.0,
                            "replies": [
                                {
                                    "body": "Thanks for your advice",
                                    "author": null,
                                    "id": "f1m73no",
                                    "parent_id": "t1_f1m56n4",
                                    "score": 1,
                                    "created_utc": 1569586393.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It really depends upon how often and how much time, and where you live. And don’t feel like you are being escorty. There are two different approaches. First, flat out say, this is what I want. I did not suggest that given your post. Second is to ask the guy to make the offer. Word it however you like, but it needs to be a firm ask. Second approach favors the woman. Some guys will come in higher than you think. Also it gives you the chance (if to low) to look disappointed and counter. “I really think we would be super good together and I would love to be in an Arrangement with you, do you think you could do X for us?”",
                            "author": "SDforreal",
                            "id": "f1m32q5",
                            "parent_id": "t1_f1m2lm4",
                            "score": 2,
                            "created_utc": 1569582427.0,
                            "replies": [
                                {
                                    "body": "Thanksss",
                                    "author": null,
                                    "id": "f1m4o2c",
                                    "parent_id": "t1_f1m32q5",
                                    "score": 1,
                                    "created_utc": 1569584079.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "there's a thread of rates for areas that can give you a good ballpark. I never accept anything less than $500 regardless of time and activity",
                            "author": null,
                            "id": "f1m8bc4",
                            "parent_id": "t1_f1m2lm4",
                            "score": 4,
                            "created_utc": 1569587427.0,
                            "replies": [
                                {
                                    "body": "Which, of course, depends on your location. In my area, $500 would be at the very high-end. It might be average or at the lower end in other areas of course.",
                                    "author": "mtncityguy",
                                    "id": "f1m9ca6",
                                    "parent_id": "t1_f1m8bc4",
                                    "score": -1,
                                    "created_utc": 1569588265.0,
                                    "replies": [
                                        {
                                            "body": "I just want to spell this out a bit just for curiosities sake. low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, which might be more what you’re thinking... and that’s just for design work which doesn’t include secrecy usually. But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate for someone holding your secrets and in most cases letting you decide the sexual energy and stick your dick in someone less than half your age. That’s now $400 for 4 hours which is about the average non-sleepover date that I prefer based on my experience. $400 for 4 hours of work and 24/7 secret keeping is pretty low IMO. But again that should be pennies to a real sugar daddy. What’s the phrase? If you have to ask the price you can’t afford it.",
                                            "author": null,
                                            "id": "f1mg8gk",
                                            "parent_id": "t1_f1m9ca6",
                                            "score": 3,
                                            "created_utc": 1569593203.0,
                                            "replies": [
                                                {
                                                    "body": "I understand your analysis which is purely transactional and doesn't take into account a number of things.\n\n Among other things, it assumes that the only value I bring into someone's life is money. What's the value in having someone in your life who cares about you and helps you sort through internships or grad school options? What's the value of having a guy in your life you trust and can provide a sounding board to your decisions? What's the value in knowing if your car fails inspection because of brakes or tires, your car will magically appear with new tires?  What's the value of having a guy you can talk to when your vanilla boyfriend hits you? What's the value of being able to sound out how to explain to your parents you decided not to go to medical school?\n\nThat doesn't mean I don't expect to provide an allowance that allows someone to graduate from college debt-free.\n\nAnd the focus on secret keeping is frankly a little concerning. No matter how we meet someone we date, isn't it expected to keep each other secrets. Of course women I date, whether from SA or through traditional dating, tell me information that is intimate, personal, and secret. The thousands of years it's been built into us that we keep that information personal and secret even when we grow apart.",
                                                    "author": "mtncityguy",
                                                    "id": "f1mhrai",
                                                    "parent_id": "t1_f1mg8gk",
                                                    "score": 2,
                                                    "created_utc": 1569594198.0,
                                                    "replies": [
                                                        {
                                                            "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
                                                            "author": null,
                                                            "id": "f1msxxx",
                                                            "parent_id": "t1_f1mhrai",
                                                            "score": 5,
                                                            "created_utc": 1569601431.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "> low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, \n\nYes that's still well below the average salary a US person makes.  Now - if you are a graphic designer, I can see why that would play into it.  But most SBs are not pulling that type of cash in.\n\n> . But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate\n\nAnd to me, the idea that my SB would attempt to turn an allowance into an hourly wage is insulting.  It's not a job.  It's a relationship.  That relationship includes benefits - sugar - as it is.  But it's not a job.\n\nUnless, you are treating it as a job.  But that's where a lot of us do not.",
                                                    "author": "SDstartingOut",
                                                    "id": "f1nkjxf",
                                                    "parent_id": "t1_f1mg8gk",
                                                    "score": 2,
                                                    "created_utc": 1569619349.0,
                                                    "replies": [
                                                        {
                                                            "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
                                                            "author": null,
                                                            "id": "f1nxfjk",
                                                            "parent_id": "t1_f1nkjxf",
                                                            "score": 0,
                                                            "created_utc": 1569628973.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                                                                    "author": null,
                                                                    "id": "f1phgbh",
                                                                    "parent_id": "t1_f1nxfjk",
                                                                    "score": 0,
                                                                    "created_utc": 1569680571.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "f1qcnyr",
                                                                            "parent_id": "t1_f1phgbh",
                                                                            "score": 1,
                                                                            "created_utc": 1569698115.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                                                                    "author": null,
                                                                                    "id": "f1qm6dw",
                                                                                    "parent_id": "t1_f1qcnyr",
                                                                                    "score": 1,
                                                                                    "created_utc": 1569703216.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That’s nuts! I would never hold a married man’s secrets for anything less than $500 a visit. I know $500 sounds like a lot to some people but if you’re making even at minimum the average that sugar daddies make, $250k then $500 x 2-4 visits a month is nothing.",
                                            "author": null,
                                            "id": "f1mfsby",
                                            "parent_id": "t1_f1m9ca6",
                                            "score": 1,
                                            "created_utc": 1569592905.0,
                                            "replies": [
                                                {
                                                    "body": "Well it certainly depends on the location.\n\nI think someone living in 80% of the geographic mass of the US might have difficulty getting a $500 per meet allowance and be one of the people on here complaining about the inability to find a long-term relationship.\n\nBut obviously no one should feel compelled to take less than what they feel is appropriate.\n\nAnd not everyone on here is married!",
                                                    "author": "mtncityguy",
                                                    "id": "f1mgcio",
                                                    "parent_id": "t1_f1mfsby",
                                                    "score": 2,
                                                    "created_utc": 1569593277.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
                                                            "author": null,
                                                            "id": "f1mt1cg",
                                                            "parent_id": "t1_f1mgcio",
                                                            "score": 2,
                                                            "created_utc": 1569601489.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Allowance isn’t based on someone income. It’s based on someone’s liquid cash that they have to spend on pleasure.\n\nA man that makes $450,000 per yard, has 2 houses, a wife and 3 college aged kids might have less to spend each month then a single guy making $150,000 and leases a condo, has no kids or wife.\n\nPlus if someone is working all week just to make $300 to $400 doing a shit job while going to school, getting $300 to $400 for an evening of dinner, having fun and getting good sex, sounds like a really good deal to most women, especially when they’ve been dating guys that either make them go Dutch or even guys they’d have to support.",
                                                    "author": "ruphun",
                                                    "id": "f1n0sg2",
                                                    "parent_id": "t1_f1mfsby",
                                                    "score": 2,
                                                    "created_utc": 1569606372.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
                                                            "author": null,
                                                            "id": "f1n8nny",
                                                            "parent_id": "t1_f1n0sg2",
                                                            "score": 1,
                                                            "created_utc": 1569611502.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I see what you mean, yes that makes sense… I think you just have to have a little patience... just look your best, be warm and relaxed, and you’ll eventually come across the right SD.",
            "author": "RealEarthAngel",
            "id": "f1n06io",
            "parent_id": "t3_d9y80l",
            "score": 1,
            "created_utc": 1569605993.0,
            "replies": []
        },
        {
            "body": "But I’m not doing that… I’m valuing myself accurately, and it just happens to be more than most SDs want to give… Yet I have never been at a loss for SDs, so obviously there are plenty of them who see my worth! And I promise it would work that way for any SB. It’s all mindset and it’s all energy✨",
            "author": "RealEarthAngel",
            "id": "f1nugyd",
            "parent_id": "t3_d9y80l",
            "score": 1,
            "created_utc": 1569626668.0,
            "replies": [
                {
                    "body": "> And I promise it would work that way for any SB. It’s all mindset and it’s all energy\n\nExtremely naive thinking.  Simply use math.  And if \"every\" woman could be an SB and get 4k+/month, there would be millions more signing up.  \n\nAgain, I'm not questioning the validity of your situation.  But it's extremely naive, and dangerous thinking that \"any\" woman can get that \"anywhere\".",
                    "author": "SDstartingOut",
                    "id": "f1o2wm4",
                    "parent_id": "t1_f1nugyd",
                    "score": 3,
                    "created_utc": 1569633210.0,
                    "replies": [
                        {
                            "body": "I stand by what I said.",
                            "author": "RealEarthAngel",
                            "id": "f40cyr2",
                            "parent_id": "t1_f1o2wm4",
                            "score": 1,
                            "created_utc": 1571294245.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s actually the way the world really works.... but most people don’t know that. So most SBs will not be doing it.... only the very few of us who do know and believe will be benefiting.",
            "author": "RealEarthAngel",
            "id": "f1o2z4h",
            "parent_id": "t3_d9y80l",
            "score": 1,
            "created_utc": 1569633261.0,
            "replies": []
        },
        {
            "body": "Yes I definitely am the exception. But many SBs could be a lot closer to it if they valued themselves a bit more highly.",
            "author": "RealEarthAngel",
            "id": "f1n0c10",
            "parent_id": "t3_d9y80l",
            "score": 0,
            "created_utc": 1569606090.0,
            "replies": [
                {
                    "body": "> But many SBs could be a lot closer to it if they valued themselves a bit more highly.\n\nI don't think that's the case.  By and large, I think there is a fairly limited number of men able to afford the type of allowances you are talking.\n\nIt's hard to have these discussions without violating rule number 4.  But yes, some women will have no problem getting these allowances repeatedly - from one arrangement to the next.  But, just like it's the top 5% of the SDs that can offer it, it's the \"top\" (not going to define what that means) 5% of SBs that can get it.\n\nAnd location is going to have a huge impact.  Most people aren't in NYC.",
                    "author": "SDstartingOut",
                    "id": "f1nl9s3",
                    "parent_id": "t1_f1n0c10",
                    "score": 2,
                    "created_utc": 1569619797.0,
                    "replies": []
                },
                {
                    "body": "Valuing yourself higher than anyone wants to give is a bit of risky businessplan though!\n\nGee, now I'M the transactional one..",
                    "author": null,
                    "id": "f1n0fk0",
                    "parent_id": "t1_f1n0c10",
                    "score": 1,
                    "created_utc": 1569606153.0,
                    "replies": [
                        {
                            "body": "And while I'm comfortable offering an allowance that allow somebody to graduate from college debt-free, constantly asking for things is annoying and uninteresting.",
                            "author": "mtncityguy",
                            "id": "f1pco6c",
                            "parent_id": "t1_f1n0fk0",
                            "score": 2,
                            "created_utc": 1569677666.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f1m87v2",
            "parent_id": "t3_d9y80l",
            "score": -1,
            "created_utc": 1569587346.0,
            "replies": [
                {
                    "body": "Driving your kid isn't going to make you richer, no.",
                    "author": null,
                    "id": "f1mhzx7",
                    "parent_id": "t1_f1m87v2",
                    "score": 2,
                    "created_utc": 1569594359.0,
                    "replies": [
                        {
                            "body": "Unless it's like Germany, where driving is expensive.   I read the taxes/licenses are high on everything, from gas, to driving training, and other expenses to discourage driving in Germany.",
                            "author": "nemo69_1999",
                            "id": "f1nfuqd",
                            "parent_id": "t1_f1mhzx7",
                            "score": 0,
                            "created_utc": 1569616284.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "forget about your dad as that was a one way compensation arrangement . he paid but got nothing in return. in your sugar arrangement it is a two way compensation arrangement you get money and he recieves your loving compassion. as to level of compensation it depends where you are located, age , appearence , capabilities , duration of get togethers , kinks expected , exclusivity , etc. \n\nbest guideline is to find out hourly rate of excorts in your vicinity that are close to your age , appearence  and capabilities . your pricing plan needs to be 80% or less than that rate multiplied by expected hours of companionship to be successful",
            "author": "afropinogal",
            "id": "f4anoot",
            "parent_id": "t3_d9y80l",
            "score": 0,
            "created_utc": 1571498131.0,
            "replies": []
        },
        {
            "body": "Thank you so much! And I'm happy to hear you've fought through a lot of this.\n\nWhat worries me is that some (most) SDs wants to spend as little as possible in allowance. I think it's naive to believe that they actually LIKE to just give me stuff, based of what I've read in here...\n\nI don't know what I'm scared of. Getting a \"no\" is the worst that can happen, right?",
            "author": null,
            "id": "f1m1n8w",
            "parent_id": "t1_f1m1bi9",
            "score": 17,
            "created_utc": 1569580666.0,
            "replies": [
                {
                    "body": "This is fully dependent on the SD, if you read around the threads here some SD's will just give money sporadically on top of what's agreed. \n\nIt is also fully dependent on if the SB is \"worth it\". For me I've done both, see what the minimum I can get away with and go with that--while others send a random Venmo amount without having it brought up.\n\nI can't tell you the exact reasoning behind it but the less needy a girl seems the more I'm willing to give but if they make it clear I'm just an ATM then I'm less enthused to do so.",
                    "author": "tenmillionplus",
                    "id": "f1mmmqh",
                    "parent_id": "t1_f1m1n8w",
                    "score": 10,
                    "created_utc": 1569597407.0,
                    "replies": []
                },
                {
                    "body": "Dont settle for stingy guys. Since you are getting by alright, it's ok to be picky. There is a mega thread on the subs wiki that shows allowance averages based in city. You should look at that for an idea. But ultimately you discuss whatever amount with your sugar daddy.",
                    "author": "Anxioussquidkid",
                    "id": "f1mo5o3",
                    "parent_id": "t1_f1m1n8w",
                    "score": 12,
                    "created_utc": 1569598389.0,
                    "replies": [
                        {
                            "body": "Thank you! Where can i find this wiki?",
                            "author": null,
                            "id": "f1mp22i",
                            "parent_id": "t1_f1mo5o3",
                            "score": 5,
                            "created_utc": 1569598972.0,
                            "replies": [
                                {
                                    "body": "On mobile click community info and it should be somewhere there",
                                    "author": "Anxioussquidkid",
                                    "id": "f1mxbyh",
                                    "parent_id": "t1_f1mp22i",
                                    "score": 4,
                                    "created_utc": 1569604196.0,
                                    "replies": [
                                        {
                                            "body": "I found it, thanks!\nBut average allowance per area is just a hole of deleted comments 😅 doubt i find Norway on the list anyway.",
                                            "author": null,
                                            "id": "f1myjkh",
                                            "parent_id": "t1_f1mxbyh",
                                            "score": 9,
                                            "created_utc": 1569604959.0,
                                            "replies": [
                                                {
                                                    "body": "You’re in Norway?",
                                                    "author": "fannyhoney",
                                                    "id": "f1ni22i",
                                                    "parent_id": "t1_f1myjkh",
                                                    "score": 1,
                                                    "created_utc": 1569617768.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yep, you? Fanny is kind of a norwegian name :)",
                                                            "author": null,
                                                            "id": "f1ni6g5",
                                                            "parent_id": "t1_f1ni22i",
                                                            "score": 1,
                                                            "created_utc": 1569617851.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                                                                    "author": "fannyhoney",
                                                                    "id": "f1p81y7",
                                                                    "parent_id": "t1_f1ni6g5",
                                                                    "score": 1,
                                                                    "created_utc": 1569674599.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                                                            "author": null,
                                                                            "id": "f1pa00o",
                                                                            "parent_id": "t1_f1p81y7",
                                                                            "score": 1,
                                                                            "created_utc": 1569675945.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just want to emphasize: what you’ll spend the money on is none of his business really. And any discussion of that is a waste of time. Probably best to just flat out say that and avoid any such discussion because mostly that’s a route to minimize what he’s willing to provide - if he insists on having you detail “needs” then safe to say he’s just trying to lowball and any money will be a battle every time. \n\n“I mostly have my needs met. I have a job (parents, school loans, whatever) and I don’t need a lot. This is really about having somebody to do fun things with and having some extra money to enjoy. Now as to what I enjoy, there’s so many things and I’m sure we’ll discuss many of them over time but many of the normal things people value - travel, nice food, I’d love to upgrade my apt etc. and I wouldn’t mind taking fewer student loans (taking less from parents, working fewer hours) along the way. I’m looking for somebody to help with that. I’m not extravagant but if you’re willing to help with those things I’m interested in hearing what you’re willing to do”.",
            "author": "2fast-2curious",
            "id": "f1m4tgu",
            "parent_id": "t1_f1m1dp4",
            "score": 15,
            "created_utc": 1569584231.0,
            "replies": []
        },
        {
            "body": "Thanks!\n\nObviously I \"want it all\", but 1M$ a month is a bit much to ask for haha... i know some SB's get up to 4000$ but, that sounds very unreasonable to me. I just have no idea what the \"window\" is, and I don't want to ask for less than I can get.\n\nKind of a greedy way to think, but yeah..",
            "author": null,
            "id": "f1m1qp4",
            "parent_id": "t1_f1m1dp4",
            "score": 4,
            "created_utc": 1569580789.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f1m7ltx",
                    "parent_id": "t1_f1m1qp4",
                    "score": 2,
                    "created_utc": 1569586834.0,
                    "replies": [
                        {
                            "body": "My apartment is like 660$, so I definetely want to aim higher. Thank you so much for the advice",
                            "author": null,
                            "id": "f1mnkjw",
                            "parent_id": "t1_f1m7ltx",
                            "score": 2,
                            "created_utc": 1569598009.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f1mogpr",
                                    "parent_id": "t1_f1mnkjw",
                                    "score": 2,
                                    "created_utc": 1569598588.0,
                                    "replies": [
                                        {
                                            "body": "She’s in Norway which is going to have different customs if for no other reason than the taxes. High earners there are paying 55-60% in tax I think?",
                                            "author": "SDstartingOut",
                                            "id": "f1n6lmp",
                                            "parent_id": "t1_f1mogpr",
                                            "score": 3,
                                            "created_utc": 1569610160.0,
                                            "replies": [
                                                {
                                                    "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
                                                    "author": null,
                                                    "id": "f1pgqxh",
                                                    "parent_id": "t1_f1n6lmp",
                                                    "score": 1,
                                                    "created_utc": 1569680096.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yeah, it's a cheap student-room of about 16square meters ;)",
                                            "author": null,
                                            "id": "f1mozyr",
                                            "parent_id": "t1_f1mogpr",
                                            "score": 1,
                                            "created_utc": 1569598935.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not sure what part of the country or world you're in but $4,000 a month allowances are fairly unusual in my experience.\n\nIt's also entirely dependent on how much time you're willing to commit. For example, if your going to see someone two to three times a week, you would expect a larger allowance that if you were seeing someone once a week.\n\nI like the apartment formula but I also use the tuition formula :-) basically, if I was seeing someone once a week, I'd be willing to pick up the tuition at one of our state schools along with rent assuming it's a normal roommate situation and not the penthouse in a high-end building :-)  \n\nOf course, everything starts with a PPM",
                    "author": "mtncityguy",
                    "id": "f1m99gp",
                    "parent_id": "t1_f1m1qp4",
                    "score": 5,
                    "created_utc": 1569588202.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right, they CHOSE this as well. And I'm not exactly asking for free money, I guess I hold some sort of value to the SDs 😅\n\nThanks. Geez, i really like this sub",
            "author": null,
            "id": "f1mp7ie",
            "parent_id": "t1_f1moyj0",
            "score": 4,
            "created_utc": 1569599069.0,
            "replies": [
                {
                    "body": "Let me rephrase, they’re not stingy like your parents. Usually. \n\nAnd it’s not “free” money. You have to work to keep a relationship going.",
                    "author": "mollllyx",
                    "id": "f1mpdnu",
                    "parent_id": "t1_f1mp7ie",
                    "score": 5,
                    "created_utc": 1569599179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wow we’re like the same person it’s insane - how did you deal with this?",
            "author": "lovelybabe88",
            "id": "f1nico6",
            "parent_id": "t1_f1mjzrl",
            "score": 2,
            "created_utc": 1569617970.0,
            "replies": []
        },
        {
            "body": "Have him paypal or Venmo the funds, can be done before date & no cash exchange during your time together. Takes away the \"uncomfortable\" you speak of. Have a beautiful day.",
            "author": "MyBeautifulLife4Me",
            "id": "f1p9f44",
            "parent_id": "t1_f1mjzrl",
            "score": 2,
            "created_utc": 1569675560.0,
            "replies": []
        },
        {
            "body": "Huh. I think i'll write that down",
            "author": null,
            "id": "f1n110z",
            "parent_id": "t1_f1n0m8n",
            "score": 2,
            "created_utc": 1569606524.0,
            "replies": []
        },
        {
            "body": "how'd you become such a good communicator?",
            "author": "aceshighsays",
            "id": "f1nb25s",
            "parent_id": "t1_f1n0m8n",
            "score": 1,
            "created_utc": 1569613096.0,
            "replies": [
                {
                    "body": "A lot of reading,  experience trying to pre empt or pre address issues that often come up.   Follow a guy named Chris Voss on FB and Instagram.   He was a FBI hostage negotiator.  His style is not tricky or slick,  he creates “tactical empathy” so you get what you want without being adversarial.  The “I hate taking about money” means you are not going to haggle.   Acting like you are giving something (not getting money if you cancel or reschedule, duh) before setting a firm expectation if the other side makes a change.    Tying those changes to hurting you.   If they push back against you they look unreasonable and somewhat cruel.  That’s all tactical empathy.",
                    "author": "LotBuilder",
                    "id": "f1nc4ip",
                    "parent_id": "t1_f1nb25s",
                    "score": 12,
                    "created_utc": 1569613805.0,
                    "replies": [
                        {
                            "body": "I want to add his book, _Never Split the Difference_, is a fantastic read. I imagine the rest of his works are, as well.",
                            "author": "ScreenPeepinE",
                            "id": "f1nhfku",
                            "parent_id": "t1_f1nc4ip",
                            "score": 6,
                            "created_utc": 1569617350.0,
                            "replies": []
                        },
                        {
                            "body": "thank you!!",
                            "author": "aceshighsays",
                            "id": "f1ncozi",
                            "parent_id": "t1_f1nc4ip",
                            "score": 1,
                            "created_utc": 1569614188.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes this",
            "author": "Momopllc",
            "id": "f1nn1vy",
            "parent_id": "t1_f1mpmgy",
            "score": 4,
            "created_utc": 1569621012.0,
            "replies": []
        },
        {
            "body": "I would ghost too!\nLet's just hope it gets easier with time and experience. \nWe want sugar daddies, not fructose fathers!",
            "author": null,
            "id": "f1nj1u5",
            "parent_id": "t1_f1nikek",
            "score": 5,
            "created_utc": 1569618409.0,
            "replies": [
                {
                    "body": "Yes and we shouldn't feel afraid of being happy. It's okay to want things and there's no harm in just asking right?",
                    "author": "Mopsydoll",
                    "id": "f1nlgll",
                    "parent_id": "t1_f1nj1u5",
                    "score": 2,
                    "created_utc": 1569619922.0,
                    "replies": [
                        {
                            "body": "Yeah that's what they say!\nI mean, people negotiate ALL THE TIME. Why can't we?",
                            "author": null,
                            "id": "f1nllcp",
                            "parent_id": "t1_f1nlgll",
                            "score": 3,
                            "created_utc": 1569620009.0,
                            "replies": [
                                {
                                    "body": "We are gonna live our best lives even if it scares the crud out of us 😂",
                                    "author": "Mopsydoll",
                                    "id": "f1nlwz7",
                                    "parent_id": "t1_f1nllcp",
                                    "score": 1,
                                    "created_utc": 1569620217.0,
                                    "replies": [
                                        {
                                            "body": "Shittt, i'm scared 😅",
                                            "author": null,
                                            "id": "f1no6r3",
                                            "parent_id": "t1_f1nlwz7",
                                            "score": 2,
                                            "created_utc": 1569621836.0,
                                            "replies": [
                                                {
                                                    "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
                                                    "author": "Mopsydoll",
                                                    "id": "f1nsyys",
                                                    "parent_id": "t1_f1no6r3",
                                                    "score": 2,
                                                    "created_utc": 1569625476.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish I could upvote you two times. Thank you for putting it that way! And you are so right. No SD has ever been shy about asking sexual favors.\nGee, this helps a lot",
            "author": null,
            "id": "f1p6jvb",
            "parent_id": "t1_f1nawdu",
            "score": 7,
            "created_utc": 1569673523.0,
            "replies": []
        },
        {
            "body": "Wait.. how much does uber pay really?",
            "author": null,
            "id": "f1n1r34",
            "parent_id": "t1_f1n14y8",
            "score": 3,
            "created_utc": 1569606990.0,
            "replies": [
                {
                    "body": "We have to pay them .50/mile.  But we make it up in volume",
                    "author": "MidwestAmMan",
                    "id": "f1n4llc",
                    "parent_id": "t1_f1n1r34",
                    "score": 1,
                    "created_utc": 1569608857.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> I’ve not only found them in New York, but in California as well.\n\nSo, seriously, the most expensive places in the US roughly fit into 3 areas.\n\n* NYC\n* Various areas in CA\n* And Seattle\n\n> have I been the only SB who’s been able to find them all??\n\nAgain, there is a limitation of what we can talk about, based on rule number 4.  However to your point - in a sense.  It's not surprising that in high cost of living areas, women fitting certain criteria are able to find higher amount arrangements.  My assumption is you fit into that.  That's not all women, nor all SBs.  \n\nIt sounds like you do;  that's awesome.  But even among SBs, that's not the \"average\".",
            "author": "SDstartingOut",
            "id": "f1o2o37",
            "parent_id": "t1_f1nxrm3",
            "score": 3,
            "created_utc": 1569633032.0,
            "replies": [
                {
                    "body": "Yeah, there's the main difference i think. After looking up some different allowances in the NY area, I can say that rich Americans make much more money than Rich Norwegians (which is where i live)",
                    "author": null,
                    "id": "f1oha9b",
                    "parent_id": "t1_f1o2o37",
                    "score": 1,
                    "created_utc": 1569645536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for taking the time to respond :)",
            "author": null,
            "id": "f54rrto",
            "parent_id": "t1_f54dnol",
            "score": 1,
            "created_utc": 1571990254.0,
            "replies": []
        },
        {
            "body": "Haha thanks!",
            "author": null,
            "id": "f1p1xsj",
            "parent_id": "t1_f1noc38",
            "score": 1,
            "created_utc": 1569669800.0,
            "replies": []
        },
        {
            "body": "I feel you so hard. \nBut since it's easier to tell others what to do: tell him! The worst you can get is a \"no\", right? Has anyone ever got dumped for wanting to shop?",
            "author": null,
            "id": "f1p1qbt",
            "parent_id": "t1_f1nx5sf",
            "score": 1,
            "created_utc": 1569669629.0,
            "replies": []
        },
        {
            "body": "> Don’t define yourself by anyone else’s parameters... make your own. \n\nthis is a true statement for living.",
            "author": "aceshighsays",
            "id": "f1na3gg",
            "parent_id": "t1_f1mpzy8",
            "score": 2,
            "created_utc": 1569612448.0,
            "replies": []
        },
        {
            "body": "Wow that is incredible. However, i live in Norway, and although we are a rich people, the richest of us aren't rhat much richer than the average. If that makes sense? So aiming for 4k+ is out of the question.. I think I'll be happy with anywhere between 1.2k and 2k. \nI just have no idea how to get there 🤷‍♀️",
            "author": null,
            "id": "f1n00r3",
            "parent_id": "t1_f1mpzy8",
            "score": 2,
            "created_utc": 1569605893.0,
            "replies": []
        },
        {
            "body": "You are the exception not the rule. Just like there are ball players that make $35 million a year and others that make a few hundred thousand. Also NYC isn’t the same as every where else in the US. Average Allowances seem to be 2-3 times higher there then other low COLA localities.",
            "author": "ruphun",
            "id": "f1n0758",
            "parent_id": "t1_f1mpzy8",
            "score": 2,
            "created_utc": 1569606004.0,
            "replies": [
                {
                    "body": "I'm not sure that's the case. The cost of living in New York is certainly higher and I understand that but the numbers of well educated and attractive women in New York is four to five times higher there than other low Cola localities.",
                    "author": "mtncityguy",
                    "id": "f1pceif",
                    "parent_id": "t1_f1n0758",
                    "score": 1,
                    "created_utc": 1569677503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for your response!\nI guess i have a problem with the \"what is this worth to you\" as I think it sounds kind of escorty.. and I also don't know how much I should ask for in return. Like, all my monthly expenses? Some?",
            "author": null,
            "id": "f1m2lm4",
            "parent_id": "t1_f1m2bfh",
            "score": -1,
            "created_utc": 1569581855.0,
            "replies": [
                {
                    "body": "If you just don’t like that wording (I kinda don’t either), would you feel better with “everything you say sounds reasonable, what kind of allowance did you have in mind”. \n\nAs for how much to ask, that’s so personal. Check the master allowance thread, but you have to consider how often, how much time, how much you like/dislike spending time with him, etc. but you def want to make sure that whatever it is, if he says yes, your response should be happy - not any uncertainty or whatever.",
                    "author": "2fast-2curious",
                    "id": "f1m56n4",
                    "parent_id": "t1_f1m2lm4",
                    "score": 5,
                    "created_utc": 1569584585.0,
                    "replies": [
                        {
                            "body": "Thanks for your advice",
                            "author": null,
                            "id": "f1m73no",
                            "parent_id": "t1_f1m56n4",
                            "score": 1,
                            "created_utc": 1569586393.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It really depends upon how often and how much time, and where you live. And don’t feel like you are being escorty. There are two different approaches. First, flat out say, this is what I want. I did not suggest that given your post. Second is to ask the guy to make the offer. Word it however you like, but it needs to be a firm ask. Second approach favors the woman. Some guys will come in higher than you think. Also it gives you the chance (if to low) to look disappointed and counter. “I really think we would be super good together and I would love to be in an Arrangement with you, do you think you could do X for us?”",
                    "author": "SDforreal",
                    "id": "f1m32q5",
                    "parent_id": "t1_f1m2lm4",
                    "score": 2,
                    "created_utc": 1569582427.0,
                    "replies": [
                        {
                            "body": "Thanksss",
                            "author": null,
                            "id": "f1m4o2c",
                            "parent_id": "t1_f1m32q5",
                            "score": 1,
                            "created_utc": 1569584079.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "there's a thread of rates for areas that can give you a good ballpark. I never accept anything less than $500 regardless of time and activity",
                    "author": null,
                    "id": "f1m8bc4",
                    "parent_id": "t1_f1m2lm4",
                    "score": 4,
                    "created_utc": 1569587427.0,
                    "replies": [
                        {
                            "body": "Which, of course, depends on your location. In my area, $500 would be at the very high-end. It might be average or at the lower end in other areas of course.",
                            "author": "mtncityguy",
                            "id": "f1m9ca6",
                            "parent_id": "t1_f1m8bc4",
                            "score": -1,
                            "created_utc": 1569588265.0,
                            "replies": [
                                {
                                    "body": "I just want to spell this out a bit just for curiosities sake. low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, which might be more what you’re thinking... and that’s just for design work which doesn’t include secrecy usually. But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate for someone holding your secrets and in most cases letting you decide the sexual energy and stick your dick in someone less than half your age. That’s now $400 for 4 hours which is about the average non-sleepover date that I prefer based on my experience. $400 for 4 hours of work and 24/7 secret keeping is pretty low IMO. But again that should be pennies to a real sugar daddy. What’s the phrase? If you have to ask the price you can’t afford it.",
                                    "author": null,
                                    "id": "f1mg8gk",
                                    "parent_id": "t1_f1m9ca6",
                                    "score": 3,
                                    "created_utc": 1569593203.0,
                                    "replies": [
                                        {
                                            "body": "I understand your analysis which is purely transactional and doesn't take into account a number of things.\n\n Among other things, it assumes that the only value I bring into someone's life is money. What's the value in having someone in your life who cares about you and helps you sort through internships or grad school options? What's the value of having a guy in your life you trust and can provide a sounding board to your decisions? What's the value in knowing if your car fails inspection because of brakes or tires, your car will magically appear with new tires?  What's the value of having a guy you can talk to when your vanilla boyfriend hits you? What's the value of being able to sound out how to explain to your parents you decided not to go to medical school?\n\nThat doesn't mean I don't expect to provide an allowance that allows someone to graduate from college debt-free.\n\nAnd the focus on secret keeping is frankly a little concerning. No matter how we meet someone we date, isn't it expected to keep each other secrets. Of course women I date, whether from SA or through traditional dating, tell me information that is intimate, personal, and secret. The thousands of years it's been built into us that we keep that information personal and secret even when we grow apart.",
                                            "author": "mtncityguy",
                                            "id": "f1mhrai",
                                            "parent_id": "t1_f1mg8gk",
                                            "score": 2,
                                            "created_utc": 1569594198.0,
                                            "replies": [
                                                {
                                                    "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
                                                    "author": null,
                                                    "id": "f1msxxx",
                                                    "parent_id": "t1_f1mhrai",
                                                    "score": 5,
                                                    "created_utc": 1569601431.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, \n\nYes that's still well below the average salary a US person makes.  Now - if you are a graphic designer, I can see why that would play into it.  But most SBs are not pulling that type of cash in.\n\n> . But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate\n\nAnd to me, the idea that my SB would attempt to turn an allowance into an hourly wage is insulting.  It's not a job.  It's a relationship.  That relationship includes benefits - sugar - as it is.  But it's not a job.\n\nUnless, you are treating it as a job.  But that's where a lot of us do not.",
                                            "author": "SDstartingOut",
                                            "id": "f1nkjxf",
                                            "parent_id": "t1_f1mg8gk",
                                            "score": 2,
                                            "created_utc": 1569619349.0,
                                            "replies": [
                                                {
                                                    "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
                                                    "author": null,
                                                    "id": "f1nxfjk",
                                                    "parent_id": "t1_f1nkjxf",
                                                    "score": 0,
                                                    "created_utc": 1569628973.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                                                            "author": null,
                                                            "id": "f1phgbh",
                                                            "parent_id": "t1_f1nxfjk",
                                                            "score": 0,
                                                            "created_utc": 1569680571.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "f1qcnyr",
                                                                    "parent_id": "t1_f1phgbh",
                                                                    "score": 1,
                                                                    "created_utc": 1569698115.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                                                            "author": null,
                                                                            "id": "f1qm6dw",
                                                                            "parent_id": "t1_f1qcnyr",
                                                                            "score": 1,
                                                                            "created_utc": 1569703216.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "That’s nuts! I would never hold a married man’s secrets for anything less than $500 a visit. I know $500 sounds like a lot to some people but if you’re making even at minimum the average that sugar daddies make, $250k then $500 x 2-4 visits a month is nothing.",
                                    "author": null,
                                    "id": "f1mfsby",
                                    "parent_id": "t1_f1m9ca6",
                                    "score": 1,
                                    "created_utc": 1569592905.0,
                                    "replies": [
                                        {
                                            "body": "Well it certainly depends on the location.\n\nI think someone living in 80% of the geographic mass of the US might have difficulty getting a $500 per meet allowance and be one of the people on here complaining about the inability to find a long-term relationship.\n\nBut obviously no one should feel compelled to take less than what they feel is appropriate.\n\nAnd not everyone on here is married!",
                                            "author": "mtncityguy",
                                            "id": "f1mgcio",
                                            "parent_id": "t1_f1mfsby",
                                            "score": 2,
                                            "created_utc": 1569593277.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
                                                    "author": null,
                                                    "id": "f1mt1cg",
                                                    "parent_id": "t1_f1mgcio",
                                                    "score": 2,
                                                    "created_utc": 1569601489.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Allowance isn’t based on someone income. It’s based on someone’s liquid cash that they have to spend on pleasure.\n\nA man that makes $450,000 per yard, has 2 houses, a wife and 3 college aged kids might have less to spend each month then a single guy making $150,000 and leases a condo, has no kids or wife.\n\nPlus if someone is working all week just to make $300 to $400 doing a shit job while going to school, getting $300 to $400 for an evening of dinner, having fun and getting good sex, sounds like a really good deal to most women, especially when they’ve been dating guys that either make them go Dutch or even guys they’d have to support.",
                                            "author": "ruphun",
                                            "id": "f1n0sg2",
                                            "parent_id": "t1_f1mfsby",
                                            "score": 2,
                                            "created_utc": 1569606372.0,
                                            "replies": [
                                                {
                                                    "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
                                                    "author": null,
                                                    "id": "f1n8nny",
                                                    "parent_id": "t1_f1n0sg2",
                                                    "score": 1,
                                                    "created_utc": 1569611502.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> And I promise it would work that way for any SB. It’s all mindset and it’s all energy\n\nExtremely naive thinking.  Simply use math.  And if \"every\" woman could be an SB and get 4k+/month, there would be millions more signing up.  \n\nAgain, I'm not questioning the validity of your situation.  But it's extremely naive, and dangerous thinking that \"any\" woman can get that \"anywhere\".",
            "author": "SDstartingOut",
            "id": "f1o2wm4",
            "parent_id": "t1_f1nugyd",
            "score": 3,
            "created_utc": 1569633210.0,
            "replies": [
                {
                    "body": "I stand by what I said.",
                    "author": "RealEarthAngel",
                    "id": "f40cyr2",
                    "parent_id": "t1_f1o2wm4",
                    "score": 1,
                    "created_utc": 1571294245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> But many SBs could be a lot closer to it if they valued themselves a bit more highly.\n\nI don't think that's the case.  By and large, I think there is a fairly limited number of men able to afford the type of allowances you are talking.\n\nIt's hard to have these discussions without violating rule number 4.  But yes, some women will have no problem getting these allowances repeatedly - from one arrangement to the next.  But, just like it's the top 5% of the SDs that can offer it, it's the \"top\" (not going to define what that means) 5% of SBs that can get it.\n\nAnd location is going to have a huge impact.  Most people aren't in NYC.",
            "author": "SDstartingOut",
            "id": "f1nl9s3",
            "parent_id": "t1_f1n0c10",
            "score": 2,
            "created_utc": 1569619797.0,
            "replies": []
        },
        {
            "body": "Valuing yourself higher than anyone wants to give is a bit of risky businessplan though!\n\nGee, now I'M the transactional one..",
            "author": null,
            "id": "f1n0fk0",
            "parent_id": "t1_f1n0c10",
            "score": 1,
            "created_utc": 1569606153.0,
            "replies": [
                {
                    "body": "And while I'm comfortable offering an allowance that allow somebody to graduate from college debt-free, constantly asking for things is annoying and uninteresting.",
                    "author": "mtncityguy",
                    "id": "f1pco6c",
                    "parent_id": "t1_f1n0fk0",
                    "score": 2,
                    "created_utc": 1569677666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Driving your kid isn't going to make you richer, no.",
            "author": null,
            "id": "f1mhzx7",
            "parent_id": "t1_f1m87v2",
            "score": 2,
            "created_utc": 1569594359.0,
            "replies": [
                {
                    "body": "Unless it's like Germany, where driving is expensive.   I read the taxes/licenses are high on everything, from gas, to driving training, and other expenses to discourage driving in Germany.",
                    "author": "nemo69_1999",
                    "id": "f1nfuqd",
                    "parent_id": "t1_f1mhzx7",
                    "score": 0,
                    "created_utc": 1569616284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is fully dependent on the SD, if you read around the threads here some SD's will just give money sporadically on top of what's agreed. \n\nIt is also fully dependent on if the SB is \"worth it\". For me I've done both, see what the minimum I can get away with and go with that--while others send a random Venmo amount without having it brought up.\n\nI can't tell you the exact reasoning behind it but the less needy a girl seems the more I'm willing to give but if they make it clear I'm just an ATM then I'm less enthused to do so.",
            "author": "tenmillionplus",
            "id": "f1mmmqh",
            "parent_id": "t1_f1m1n8w",
            "score": 10,
            "created_utc": 1569597407.0,
            "replies": []
        },
        {
            "body": "Dont settle for stingy guys. Since you are getting by alright, it's ok to be picky. There is a mega thread on the subs wiki that shows allowance averages based in city. You should look at that for an idea. But ultimately you discuss whatever amount with your sugar daddy.",
            "author": "Anxioussquidkid",
            "id": "f1mo5o3",
            "parent_id": "t1_f1m1n8w",
            "score": 12,
            "created_utc": 1569598389.0,
            "replies": [
                {
                    "body": "Thank you! Where can i find this wiki?",
                    "author": null,
                    "id": "f1mp22i",
                    "parent_id": "t1_f1mo5o3",
                    "score": 5,
                    "created_utc": 1569598972.0,
                    "replies": [
                        {
                            "body": "On mobile click community info and it should be somewhere there",
                            "author": "Anxioussquidkid",
                            "id": "f1mxbyh",
                            "parent_id": "t1_f1mp22i",
                            "score": 4,
                            "created_utc": 1569604196.0,
                            "replies": [
                                {
                                    "body": "I found it, thanks!\nBut average allowance per area is just a hole of deleted comments 😅 doubt i find Norway on the list anyway.",
                                    "author": null,
                                    "id": "f1myjkh",
                                    "parent_id": "t1_f1mxbyh",
                                    "score": 9,
                                    "created_utc": 1569604959.0,
                                    "replies": [
                                        {
                                            "body": "You’re in Norway?",
                                            "author": "fannyhoney",
                                            "id": "f1ni22i",
                                            "parent_id": "t1_f1myjkh",
                                            "score": 1,
                                            "created_utc": 1569617768.0,
                                            "replies": [
                                                {
                                                    "body": "Yep, you? Fanny is kind of a norwegian name :)",
                                                    "author": null,
                                                    "id": "f1ni6g5",
                                                    "parent_id": "t1_f1ni22i",
                                                    "score": 1,
                                                    "created_utc": 1569617851.0,
                                                    "replies": [
                                                        {
                                                            "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                                                            "author": "fannyhoney",
                                                            "id": "f1p81y7",
                                                            "parent_id": "t1_f1ni6g5",
                                                            "score": 1,
                                                            "created_utc": 1569674599.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                                                    "author": null,
                                                                    "id": "f1pa00o",
                                                                    "parent_id": "t1_f1p81y7",
                                                                    "score": 1,
                                                                    "created_utc": 1569675945.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f1m7ltx",
            "parent_id": "t1_f1m1qp4",
            "score": 2,
            "created_utc": 1569586834.0,
            "replies": [
                {
                    "body": "My apartment is like 660$, so I definetely want to aim higher. Thank you so much for the advice",
                    "author": null,
                    "id": "f1mnkjw",
                    "parent_id": "t1_f1m7ltx",
                    "score": 2,
                    "created_utc": 1569598009.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f1mogpr",
                            "parent_id": "t1_f1mnkjw",
                            "score": 2,
                            "created_utc": 1569598588.0,
                            "replies": [
                                {
                                    "body": "She’s in Norway which is going to have different customs if for no other reason than the taxes. High earners there are paying 55-60% in tax I think?",
                                    "author": "SDstartingOut",
                                    "id": "f1n6lmp",
                                    "parent_id": "t1_f1mogpr",
                                    "score": 3,
                                    "created_utc": 1569610160.0,
                                    "replies": [
                                        {
                                            "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
                                            "author": null,
                                            "id": "f1pgqxh",
                                            "parent_id": "t1_f1n6lmp",
                                            "score": 1,
                                            "created_utc": 1569680096.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah, it's a cheap student-room of about 16square meters ;)",
                                    "author": null,
                                    "id": "f1mozyr",
                                    "parent_id": "t1_f1mogpr",
                                    "score": 1,
                                    "created_utc": 1569598935.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not sure what part of the country or world you're in but $4,000 a month allowances are fairly unusual in my experience.\n\nIt's also entirely dependent on how much time you're willing to commit. For example, if your going to see someone two to three times a week, you would expect a larger allowance that if you were seeing someone once a week.\n\nI like the apartment formula but I also use the tuition formula :-) basically, if I was seeing someone once a week, I'd be willing to pick up the tuition at one of our state schools along with rent assuming it's a normal roommate situation and not the penthouse in a high-end building :-)  \n\nOf course, everything starts with a PPM",
            "author": "mtncityguy",
            "id": "f1m99gp",
            "parent_id": "t1_f1m1qp4",
            "score": 5,
            "created_utc": 1569588202.0,
            "replies": []
        },
        {
            "body": "Let me rephrase, they’re not stingy like your parents. Usually. \n\nAnd it’s not “free” money. You have to work to keep a relationship going.",
            "author": "mollllyx",
            "id": "f1mpdnu",
            "parent_id": "t1_f1mp7ie",
            "score": 5,
            "created_utc": 1569599179.0,
            "replies": []
        },
        {
            "body": "A lot of reading,  experience trying to pre empt or pre address issues that often come up.   Follow a guy named Chris Voss on FB and Instagram.   He was a FBI hostage negotiator.  His style is not tricky or slick,  he creates “tactical empathy” so you get what you want without being adversarial.  The “I hate taking about money” means you are not going to haggle.   Acting like you are giving something (not getting money if you cancel or reschedule, duh) before setting a firm expectation if the other side makes a change.    Tying those changes to hurting you.   If they push back against you they look unreasonable and somewhat cruel.  That’s all tactical empathy.",
            "author": "LotBuilder",
            "id": "f1nc4ip",
            "parent_id": "t1_f1nb25s",
            "score": 12,
            "created_utc": 1569613805.0,
            "replies": [
                {
                    "body": "I want to add his book, _Never Split the Difference_, is a fantastic read. I imagine the rest of his works are, as well.",
                    "author": "ScreenPeepinE",
                    "id": "f1nhfku",
                    "parent_id": "t1_f1nc4ip",
                    "score": 6,
                    "created_utc": 1569617350.0,
                    "replies": []
                },
                {
                    "body": "thank you!!",
                    "author": "aceshighsays",
                    "id": "f1ncozi",
                    "parent_id": "t1_f1nc4ip",
                    "score": 1,
                    "created_utc": 1569614188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes and we shouldn't feel afraid of being happy. It's okay to want things and there's no harm in just asking right?",
            "author": "Mopsydoll",
            "id": "f1nlgll",
            "parent_id": "t1_f1nj1u5",
            "score": 2,
            "created_utc": 1569619922.0,
            "replies": [
                {
                    "body": "Yeah that's what they say!\nI mean, people negotiate ALL THE TIME. Why can't we?",
                    "author": null,
                    "id": "f1nllcp",
                    "parent_id": "t1_f1nlgll",
                    "score": 3,
                    "created_utc": 1569620009.0,
                    "replies": [
                        {
                            "body": "We are gonna live our best lives even if it scares the crud out of us 😂",
                            "author": "Mopsydoll",
                            "id": "f1nlwz7",
                            "parent_id": "t1_f1nllcp",
                            "score": 1,
                            "created_utc": 1569620217.0,
                            "replies": [
                                {
                                    "body": "Shittt, i'm scared 😅",
                                    "author": null,
                                    "id": "f1no6r3",
                                    "parent_id": "t1_f1nlwz7",
                                    "score": 2,
                                    "created_utc": 1569621836.0,
                                    "replies": [
                                        {
                                            "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
                                            "author": "Mopsydoll",
                                            "id": "f1nsyys",
                                            "parent_id": "t1_f1no6r3",
                                            "score": 2,
                                            "created_utc": 1569625476.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We have to pay them .50/mile.  But we make it up in volume",
            "author": "MidwestAmMan",
            "id": "f1n4llc",
            "parent_id": "t1_f1n1r34",
            "score": 1,
            "created_utc": 1569608857.0,
            "replies": []
        },
        {
            "body": "Yeah, there's the main difference i think. After looking up some different allowances in the NY area, I can say that rich Americans make much more money than Rich Norwegians (which is where i live)",
            "author": null,
            "id": "f1oha9b",
            "parent_id": "t1_f1o2o37",
            "score": 1,
            "created_utc": 1569645536.0,
            "replies": []
        },
        {
            "body": "I'm not sure that's the case. The cost of living in New York is certainly higher and I understand that but the numbers of well educated and attractive women in New York is four to five times higher there than other low Cola localities.",
            "author": "mtncityguy",
            "id": "f1pceif",
            "parent_id": "t1_f1n0758",
            "score": 1,
            "created_utc": 1569677503.0,
            "replies": []
        },
        {
            "body": "If you just don’t like that wording (I kinda don’t either), would you feel better with “everything you say sounds reasonable, what kind of allowance did you have in mind”. \n\nAs for how much to ask, that’s so personal. Check the master allowance thread, but you have to consider how often, how much time, how much you like/dislike spending time with him, etc. but you def want to make sure that whatever it is, if he says yes, your response should be happy - not any uncertainty or whatever.",
            "author": "2fast-2curious",
            "id": "f1m56n4",
            "parent_id": "t1_f1m2lm4",
            "score": 5,
            "created_utc": 1569584585.0,
            "replies": [
                {
                    "body": "Thanks for your advice",
                    "author": null,
                    "id": "f1m73no",
                    "parent_id": "t1_f1m56n4",
                    "score": 1,
                    "created_utc": 1569586393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It really depends upon how often and how much time, and where you live. And don’t feel like you are being escorty. There are two different approaches. First, flat out say, this is what I want. I did not suggest that given your post. Second is to ask the guy to make the offer. Word it however you like, but it needs to be a firm ask. Second approach favors the woman. Some guys will come in higher than you think. Also it gives you the chance (if to low) to look disappointed and counter. “I really think we would be super good together and I would love to be in an Arrangement with you, do you think you could do X for us?”",
            "author": "SDforreal",
            "id": "f1m32q5",
            "parent_id": "t1_f1m2lm4",
            "score": 2,
            "created_utc": 1569582427.0,
            "replies": [
                {
                    "body": "Thanksss",
                    "author": null,
                    "id": "f1m4o2c",
                    "parent_id": "t1_f1m32q5",
                    "score": 1,
                    "created_utc": 1569584079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "there's a thread of rates for areas that can give you a good ballpark. I never accept anything less than $500 regardless of time and activity",
            "author": null,
            "id": "f1m8bc4",
            "parent_id": "t1_f1m2lm4",
            "score": 4,
            "created_utc": 1569587427.0,
            "replies": [
                {
                    "body": "Which, of course, depends on your location. In my area, $500 would be at the very high-end. It might be average or at the lower end in other areas of course.",
                    "author": "mtncityguy",
                    "id": "f1m9ca6",
                    "parent_id": "t1_f1m8bc4",
                    "score": -1,
                    "created_utc": 1569588265.0,
                    "replies": [
                        {
                            "body": "I just want to spell this out a bit just for curiosities sake. low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, which might be more what you’re thinking... and that’s just for design work which doesn’t include secrecy usually. But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate for someone holding your secrets and in most cases letting you decide the sexual energy and stick your dick in someone less than half your age. That’s now $400 for 4 hours which is about the average non-sleepover date that I prefer based on my experience. $400 for 4 hours of work and 24/7 secret keeping is pretty low IMO. But again that should be pennies to a real sugar daddy. What’s the phrase? If you have to ask the price you can’t afford it.",
                            "author": null,
                            "id": "f1mg8gk",
                            "parent_id": "t1_f1m9ca6",
                            "score": 3,
                            "created_utc": 1569593203.0,
                            "replies": [
                                {
                                    "body": "I understand your analysis which is purely transactional and doesn't take into account a number of things.\n\n Among other things, it assumes that the only value I bring into someone's life is money. What's the value in having someone in your life who cares about you and helps you sort through internships or grad school options? What's the value of having a guy in your life you trust and can provide a sounding board to your decisions? What's the value in knowing if your car fails inspection because of brakes or tires, your car will magically appear with new tires?  What's the value of having a guy you can talk to when your vanilla boyfriend hits you? What's the value of being able to sound out how to explain to your parents you decided not to go to medical school?\n\nThat doesn't mean I don't expect to provide an allowance that allows someone to graduate from college debt-free.\n\nAnd the focus on secret keeping is frankly a little concerning. No matter how we meet someone we date, isn't it expected to keep each other secrets. Of course women I date, whether from SA or through traditional dating, tell me information that is intimate, personal, and secret. The thousands of years it's been built into us that we keep that information personal and secret even when we grow apart.",
                                    "author": "mtncityguy",
                                    "id": "f1mhrai",
                                    "parent_id": "t1_f1mg8gk",
                                    "score": 2,
                                    "created_utc": 1569594198.0,
                                    "replies": [
                                        {
                                            "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
                                            "author": null,
                                            "id": "f1msxxx",
                                            "parent_id": "t1_f1mhrai",
                                            "score": 5,
                                            "created_utc": 1569601431.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, \n\nYes that's still well below the average salary a US person makes.  Now - if you are a graphic designer, I can see why that would play into it.  But most SBs are not pulling that type of cash in.\n\n> . But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate\n\nAnd to me, the idea that my SB would attempt to turn an allowance into an hourly wage is insulting.  It's not a job.  It's a relationship.  That relationship includes benefits - sugar - as it is.  But it's not a job.\n\nUnless, you are treating it as a job.  But that's where a lot of us do not.",
                                    "author": "SDstartingOut",
                                    "id": "f1nkjxf",
                                    "parent_id": "t1_f1mg8gk",
                                    "score": 2,
                                    "created_utc": 1569619349.0,
                                    "replies": [
                                        {
                                            "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
                                            "author": null,
                                            "id": "f1nxfjk",
                                            "parent_id": "t1_f1nkjxf",
                                            "score": 0,
                                            "created_utc": 1569628973.0,
                                            "replies": [
                                                {
                                                    "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                                                    "author": null,
                                                    "id": "f1phgbh",
                                                    "parent_id": "t1_f1nxfjk",
                                                    "score": 0,
                                                    "created_utc": 1569680571.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "f1qcnyr",
                                                            "parent_id": "t1_f1phgbh",
                                                            "score": 1,
                                                            "created_utc": 1569698115.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                                                    "author": null,
                                                                    "id": "f1qm6dw",
                                                                    "parent_id": "t1_f1qcnyr",
                                                                    "score": 1,
                                                                    "created_utc": 1569703216.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That’s nuts! I would never hold a married man’s secrets for anything less than $500 a visit. I know $500 sounds like a lot to some people but if you’re making even at minimum the average that sugar daddies make, $250k then $500 x 2-4 visits a month is nothing.",
                            "author": null,
                            "id": "f1mfsby",
                            "parent_id": "t1_f1m9ca6",
                            "score": 1,
                            "created_utc": 1569592905.0,
                            "replies": [
                                {
                                    "body": "Well it certainly depends on the location.\n\nI think someone living in 80% of the geographic mass of the US might have difficulty getting a $500 per meet allowance and be one of the people on here complaining about the inability to find a long-term relationship.\n\nBut obviously no one should feel compelled to take less than what they feel is appropriate.\n\nAnd not everyone on here is married!",
                                    "author": "mtncityguy",
                                    "id": "f1mgcio",
                                    "parent_id": "t1_f1mfsby",
                                    "score": 2,
                                    "created_utc": 1569593277.0,
                                    "replies": [
                                        {
                                            "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
                                            "author": null,
                                            "id": "f1mt1cg",
                                            "parent_id": "t1_f1mgcio",
                                            "score": 2,
                                            "created_utc": 1569601489.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Allowance isn’t based on someone income. It’s based on someone’s liquid cash that they have to spend on pleasure.\n\nA man that makes $450,000 per yard, has 2 houses, a wife and 3 college aged kids might have less to spend each month then a single guy making $150,000 and leases a condo, has no kids or wife.\n\nPlus if someone is working all week just to make $300 to $400 doing a shit job while going to school, getting $300 to $400 for an evening of dinner, having fun and getting good sex, sounds like a really good deal to most women, especially when they’ve been dating guys that either make them go Dutch or even guys they’d have to support.",
                                    "author": "ruphun",
                                    "id": "f1n0sg2",
                                    "parent_id": "t1_f1mfsby",
                                    "score": 2,
                                    "created_utc": 1569606372.0,
                                    "replies": [
                                        {
                                            "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
                                            "author": null,
                                            "id": "f1n8nny",
                                            "parent_id": "t1_f1n0sg2",
                                            "score": 1,
                                            "created_utc": 1569611502.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I stand by what I said.",
            "author": "RealEarthAngel",
            "id": "f40cyr2",
            "parent_id": "t1_f1o2wm4",
            "score": 1,
            "created_utc": 1571294245.0,
            "replies": []
        },
        {
            "body": "And while I'm comfortable offering an allowance that allow somebody to graduate from college debt-free, constantly asking for things is annoying and uninteresting.",
            "author": "mtncityguy",
            "id": "f1pco6c",
            "parent_id": "t1_f1n0fk0",
            "score": 2,
            "created_utc": 1569677666.0,
            "replies": []
        },
        {
            "body": "Unless it's like Germany, where driving is expensive.   I read the taxes/licenses are high on everything, from gas, to driving training, and other expenses to discourage driving in Germany.",
            "author": "nemo69_1999",
            "id": "f1nfuqd",
            "parent_id": "t1_f1mhzx7",
            "score": 0,
            "created_utc": 1569616284.0,
            "replies": []
        },
        {
            "body": "Thank you! Where can i find this wiki?",
            "author": null,
            "id": "f1mp22i",
            "parent_id": "t1_f1mo5o3",
            "score": 5,
            "created_utc": 1569598972.0,
            "replies": [
                {
                    "body": "On mobile click community info and it should be somewhere there",
                    "author": "Anxioussquidkid",
                    "id": "f1mxbyh",
                    "parent_id": "t1_f1mp22i",
                    "score": 4,
                    "created_utc": 1569604196.0,
                    "replies": [
                        {
                            "body": "I found it, thanks!\nBut average allowance per area is just a hole of deleted comments 😅 doubt i find Norway on the list anyway.",
                            "author": null,
                            "id": "f1myjkh",
                            "parent_id": "t1_f1mxbyh",
                            "score": 9,
                            "created_utc": 1569604959.0,
                            "replies": [
                                {
                                    "body": "You’re in Norway?",
                                    "author": "fannyhoney",
                                    "id": "f1ni22i",
                                    "parent_id": "t1_f1myjkh",
                                    "score": 1,
                                    "created_utc": 1569617768.0,
                                    "replies": [
                                        {
                                            "body": "Yep, you? Fanny is kind of a norwegian name :)",
                                            "author": null,
                                            "id": "f1ni6g5",
                                            "parent_id": "t1_f1ni22i",
                                            "score": 1,
                                            "created_utc": 1569617851.0,
                                            "replies": [
                                                {
                                                    "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                                                    "author": "fannyhoney",
                                                    "id": "f1p81y7",
                                                    "parent_id": "t1_f1ni6g5",
                                                    "score": 1,
                                                    "created_utc": 1569674599.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                                            "author": null,
                                                            "id": "f1pa00o",
                                                            "parent_id": "t1_f1p81y7",
                                                            "score": 1,
                                                            "created_utc": 1569675945.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My apartment is like 660$, so I definetely want to aim higher. Thank you so much for the advice",
            "author": null,
            "id": "f1mnkjw",
            "parent_id": "t1_f1m7ltx",
            "score": 2,
            "created_utc": 1569598009.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f1mogpr",
                    "parent_id": "t1_f1mnkjw",
                    "score": 2,
                    "created_utc": 1569598588.0,
                    "replies": [
                        {
                            "body": "She’s in Norway which is going to have different customs if for no other reason than the taxes. High earners there are paying 55-60% in tax I think?",
                            "author": "SDstartingOut",
                            "id": "f1n6lmp",
                            "parent_id": "t1_f1mogpr",
                            "score": 3,
                            "created_utc": 1569610160.0,
                            "replies": [
                                {
                                    "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
                                    "author": null,
                                    "id": "f1pgqxh",
                                    "parent_id": "t1_f1n6lmp",
                                    "score": 1,
                                    "created_utc": 1569680096.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah, it's a cheap student-room of about 16square meters ;)",
                            "author": null,
                            "id": "f1mozyr",
                            "parent_id": "t1_f1mogpr",
                            "score": 1,
                            "created_utc": 1569598935.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I want to add his book, _Never Split the Difference_, is a fantastic read. I imagine the rest of his works are, as well.",
            "author": "ScreenPeepinE",
            "id": "f1nhfku",
            "parent_id": "t1_f1nc4ip",
            "score": 6,
            "created_utc": 1569617350.0,
            "replies": []
        },
        {
            "body": "thank you!!",
            "author": "aceshighsays",
            "id": "f1ncozi",
            "parent_id": "t1_f1nc4ip",
            "score": 1,
            "created_utc": 1569614188.0,
            "replies": []
        },
        {
            "body": "Yeah that's what they say!\nI mean, people negotiate ALL THE TIME. Why can't we?",
            "author": null,
            "id": "f1nllcp",
            "parent_id": "t1_f1nlgll",
            "score": 3,
            "created_utc": 1569620009.0,
            "replies": [
                {
                    "body": "We are gonna live our best lives even if it scares the crud out of us 😂",
                    "author": "Mopsydoll",
                    "id": "f1nlwz7",
                    "parent_id": "t1_f1nllcp",
                    "score": 1,
                    "created_utc": 1569620217.0,
                    "replies": [
                        {
                            "body": "Shittt, i'm scared 😅",
                            "author": null,
                            "id": "f1no6r3",
                            "parent_id": "t1_f1nlwz7",
                            "score": 2,
                            "created_utc": 1569621836.0,
                            "replies": [
                                {
                                    "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
                                    "author": "Mopsydoll",
                                    "id": "f1nsyys",
                                    "parent_id": "t1_f1no6r3",
                                    "score": 2,
                                    "created_utc": 1569625476.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for your advice",
            "author": null,
            "id": "f1m73no",
            "parent_id": "t1_f1m56n4",
            "score": 1,
            "created_utc": 1569586393.0,
            "replies": []
        },
        {
            "body": "Thanksss",
            "author": null,
            "id": "f1m4o2c",
            "parent_id": "t1_f1m32q5",
            "score": 1,
            "created_utc": 1569584079.0,
            "replies": []
        },
        {
            "body": "Which, of course, depends on your location. In my area, $500 would be at the very high-end. It might be average or at the lower end in other areas of course.",
            "author": "mtncityguy",
            "id": "f1m9ca6",
            "parent_id": "t1_f1m8bc4",
            "score": -1,
            "created_utc": 1569588265.0,
            "replies": [
                {
                    "body": "I just want to spell this out a bit just for curiosities sake. low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, which might be more what you’re thinking... and that’s just for design work which doesn’t include secrecy usually. But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate for someone holding your secrets and in most cases letting you decide the sexual energy and stick your dick in someone less than half your age. That’s now $400 for 4 hours which is about the average non-sleepover date that I prefer based on my experience. $400 for 4 hours of work and 24/7 secret keeping is pretty low IMO. But again that should be pennies to a real sugar daddy. What’s the phrase? If you have to ask the price you can’t afford it.",
                    "author": null,
                    "id": "f1mg8gk",
                    "parent_id": "t1_f1m9ca6",
                    "score": 3,
                    "created_utc": 1569593203.0,
                    "replies": [
                        {
                            "body": "I understand your analysis which is purely transactional and doesn't take into account a number of things.\n\n Among other things, it assumes that the only value I bring into someone's life is money. What's the value in having someone in your life who cares about you and helps you sort through internships or grad school options? What's the value of having a guy in your life you trust and can provide a sounding board to your decisions? What's the value in knowing if your car fails inspection because of brakes or tires, your car will magically appear with new tires?  What's the value of having a guy you can talk to when your vanilla boyfriend hits you? What's the value of being able to sound out how to explain to your parents you decided not to go to medical school?\n\nThat doesn't mean I don't expect to provide an allowance that allows someone to graduate from college debt-free.\n\nAnd the focus on secret keeping is frankly a little concerning. No matter how we meet someone we date, isn't it expected to keep each other secrets. Of course women I date, whether from SA or through traditional dating, tell me information that is intimate, personal, and secret. The thousands of years it's been built into us that we keep that information personal and secret even when we grow apart.",
                            "author": "mtncityguy",
                            "id": "f1mhrai",
                            "parent_id": "t1_f1mg8gk",
                            "score": 2,
                            "created_utc": 1569594198.0,
                            "replies": [
                                {
                                    "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
                                    "author": null,
                                    "id": "f1msxxx",
                                    "parent_id": "t1_f1mhrai",
                                    "score": 5,
                                    "created_utc": 1569601431.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, \n\nYes that's still well below the average salary a US person makes.  Now - if you are a graphic designer, I can see why that would play into it.  But most SBs are not pulling that type of cash in.\n\n> . But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate\n\nAnd to me, the idea that my SB would attempt to turn an allowance into an hourly wage is insulting.  It's not a job.  It's a relationship.  That relationship includes benefits - sugar - as it is.  But it's not a job.\n\nUnless, you are treating it as a job.  But that's where a lot of us do not.",
                            "author": "SDstartingOut",
                            "id": "f1nkjxf",
                            "parent_id": "t1_f1mg8gk",
                            "score": 2,
                            "created_utc": 1569619349.0,
                            "replies": [
                                {
                                    "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
                                    "author": null,
                                    "id": "f1nxfjk",
                                    "parent_id": "t1_f1nkjxf",
                                    "score": 0,
                                    "created_utc": 1569628973.0,
                                    "replies": [
                                        {
                                            "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                                            "author": null,
                                            "id": "f1phgbh",
                                            "parent_id": "t1_f1nxfjk",
                                            "score": 0,
                                            "created_utc": 1569680571.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f1qcnyr",
                                                    "parent_id": "t1_f1phgbh",
                                                    "score": 1,
                                                    "created_utc": 1569698115.0,
                                                    "replies": [
                                                        {
                                                            "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                                            "author": null,
                                                            "id": "f1qm6dw",
                                                            "parent_id": "t1_f1qcnyr",
                                                            "score": 1,
                                                            "created_utc": 1569703216.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s nuts! I would never hold a married man’s secrets for anything less than $500 a visit. I know $500 sounds like a lot to some people but if you’re making even at minimum the average that sugar daddies make, $250k then $500 x 2-4 visits a month is nothing.",
                    "author": null,
                    "id": "f1mfsby",
                    "parent_id": "t1_f1m9ca6",
                    "score": 1,
                    "created_utc": 1569592905.0,
                    "replies": [
                        {
                            "body": "Well it certainly depends on the location.\n\nI think someone living in 80% of the geographic mass of the US might have difficulty getting a $500 per meet allowance and be one of the people on here complaining about the inability to find a long-term relationship.\n\nBut obviously no one should feel compelled to take less than what they feel is appropriate.\n\nAnd not everyone on here is married!",
                            "author": "mtncityguy",
                            "id": "f1mgcio",
                            "parent_id": "t1_f1mfsby",
                            "score": 2,
                            "created_utc": 1569593277.0,
                            "replies": [
                                {
                                    "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
                                    "author": null,
                                    "id": "f1mt1cg",
                                    "parent_id": "t1_f1mgcio",
                                    "score": 2,
                                    "created_utc": 1569601489.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Allowance isn’t based on someone income. It’s based on someone’s liquid cash that they have to spend on pleasure.\n\nA man that makes $450,000 per yard, has 2 houses, a wife and 3 college aged kids might have less to spend each month then a single guy making $150,000 and leases a condo, has no kids or wife.\n\nPlus if someone is working all week just to make $300 to $400 doing a shit job while going to school, getting $300 to $400 for an evening of dinner, having fun and getting good sex, sounds like a really good deal to most women, especially when they’ve been dating guys that either make them go Dutch or even guys they’d have to support.",
                            "author": "ruphun",
                            "id": "f1n0sg2",
                            "parent_id": "t1_f1mfsby",
                            "score": 2,
                            "created_utc": 1569606372.0,
                            "replies": [
                                {
                                    "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
                                    "author": null,
                                    "id": "f1n8nny",
                                    "parent_id": "t1_f1n0sg2",
                                    "score": 1,
                                    "created_utc": 1569611502.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "On mobile click community info and it should be somewhere there",
            "author": "Anxioussquidkid",
            "id": "f1mxbyh",
            "parent_id": "t1_f1mp22i",
            "score": 4,
            "created_utc": 1569604196.0,
            "replies": [
                {
                    "body": "I found it, thanks!\nBut average allowance per area is just a hole of deleted comments 😅 doubt i find Norway on the list anyway.",
                    "author": null,
                    "id": "f1myjkh",
                    "parent_id": "t1_f1mxbyh",
                    "score": 9,
                    "created_utc": 1569604959.0,
                    "replies": [
                        {
                            "body": "You’re in Norway?",
                            "author": "fannyhoney",
                            "id": "f1ni22i",
                            "parent_id": "t1_f1myjkh",
                            "score": 1,
                            "created_utc": 1569617768.0,
                            "replies": [
                                {
                                    "body": "Yep, you? Fanny is kind of a norwegian name :)",
                                    "author": null,
                                    "id": "f1ni6g5",
                                    "parent_id": "t1_f1ni22i",
                                    "score": 1,
                                    "created_utc": 1569617851.0,
                                    "replies": [
                                        {
                                            "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                                            "author": "fannyhoney",
                                            "id": "f1p81y7",
                                            "parent_id": "t1_f1ni6g5",
                                            "score": 1,
                                            "created_utc": 1569674599.0,
                                            "replies": [
                                                {
                                                    "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                                    "author": null,
                                                    "id": "f1pa00o",
                                                    "parent_id": "t1_f1p81y7",
                                                    "score": 1,
                                                    "created_utc": 1569675945.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f1mogpr",
            "parent_id": "t1_f1mnkjw",
            "score": 2,
            "created_utc": 1569598588.0,
            "replies": [
                {
                    "body": "She’s in Norway which is going to have different customs if for no other reason than the taxes. High earners there are paying 55-60% in tax I think?",
                    "author": "SDstartingOut",
                    "id": "f1n6lmp",
                    "parent_id": "t1_f1mogpr",
                    "score": 3,
                    "created_utc": 1569610160.0,
                    "replies": [
                        {
                            "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
                            "author": null,
                            "id": "f1pgqxh",
                            "parent_id": "t1_f1n6lmp",
                            "score": 1,
                            "created_utc": 1569680096.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, it's a cheap student-room of about 16square meters ;)",
                    "author": null,
                    "id": "f1mozyr",
                    "parent_id": "t1_f1mogpr",
                    "score": 1,
                    "created_utc": 1569598935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We are gonna live our best lives even if it scares the crud out of us 😂",
            "author": "Mopsydoll",
            "id": "f1nlwz7",
            "parent_id": "t1_f1nllcp",
            "score": 1,
            "created_utc": 1569620217.0,
            "replies": [
                {
                    "body": "Shittt, i'm scared 😅",
                    "author": null,
                    "id": "f1no6r3",
                    "parent_id": "t1_f1nlwz7",
                    "score": 2,
                    "created_utc": 1569621836.0,
                    "replies": [
                        {
                            "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
                            "author": "Mopsydoll",
                            "id": "f1nsyys",
                            "parent_id": "t1_f1no6r3",
                            "score": 2,
                            "created_utc": 1569625476.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just want to spell this out a bit just for curiosities sake. low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, which might be more what you’re thinking... and that’s just for design work which doesn’t include secrecy usually. But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate for someone holding your secrets and in most cases letting you decide the sexual energy and stick your dick in someone less than half your age. That’s now $400 for 4 hours which is about the average non-sleepover date that I prefer based on my experience. $400 for 4 hours of work and 24/7 secret keeping is pretty low IMO. But again that should be pennies to a real sugar daddy. What’s the phrase? If you have to ask the price you can’t afford it.",
            "author": null,
            "id": "f1mg8gk",
            "parent_id": "t1_f1m9ca6",
            "score": 3,
            "created_utc": 1569593203.0,
            "replies": [
                {
                    "body": "I understand your analysis which is purely transactional and doesn't take into account a number of things.\n\n Among other things, it assumes that the only value I bring into someone's life is money. What's the value in having someone in your life who cares about you and helps you sort through internships or grad school options? What's the value of having a guy in your life you trust and can provide a sounding board to your decisions? What's the value in knowing if your car fails inspection because of brakes or tires, your car will magically appear with new tires?  What's the value of having a guy you can talk to when your vanilla boyfriend hits you? What's the value of being able to sound out how to explain to your parents you decided not to go to medical school?\n\nThat doesn't mean I don't expect to provide an allowance that allows someone to graduate from college debt-free.\n\nAnd the focus on secret keeping is frankly a little concerning. No matter how we meet someone we date, isn't it expected to keep each other secrets. Of course women I date, whether from SA or through traditional dating, tell me information that is intimate, personal, and secret. The thousands of years it's been built into us that we keep that information personal and secret even when we grow apart.",
                    "author": "mtncityguy",
                    "id": "f1mhrai",
                    "parent_id": "t1_f1mg8gk",
                    "score": 2,
                    "created_utc": 1569594198.0,
                    "replies": [
                        {
                            "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
                            "author": null,
                            "id": "f1msxxx",
                            "parent_id": "t1_f1mhrai",
                            "score": 5,
                            "created_utc": 1569601431.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, \n\nYes that's still well below the average salary a US person makes.  Now - if you are a graphic designer, I can see why that would play into it.  But most SBs are not pulling that type of cash in.\n\n> . But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate\n\nAnd to me, the idea that my SB would attempt to turn an allowance into an hourly wage is insulting.  It's not a job.  It's a relationship.  That relationship includes benefits - sugar - as it is.  But it's not a job.\n\nUnless, you are treating it as a job.  But that's where a lot of us do not.",
                    "author": "SDstartingOut",
                    "id": "f1nkjxf",
                    "parent_id": "t1_f1mg8gk",
                    "score": 2,
                    "created_utc": 1569619349.0,
                    "replies": [
                        {
                            "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
                            "author": null,
                            "id": "f1nxfjk",
                            "parent_id": "t1_f1nkjxf",
                            "score": 0,
                            "created_utc": 1569628973.0,
                            "replies": [
                                {
                                    "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                                    "author": null,
                                    "id": "f1phgbh",
                                    "parent_id": "t1_f1nxfjk",
                                    "score": 0,
                                    "created_utc": 1569680571.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f1qcnyr",
                                            "parent_id": "t1_f1phgbh",
                                            "score": 1,
                                            "created_utc": 1569698115.0,
                                            "replies": [
                                                {
                                                    "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                                    "author": null,
                                                    "id": "f1qm6dw",
                                                    "parent_id": "t1_f1qcnyr",
                                                    "score": 1,
                                                    "created_utc": 1569703216.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s nuts! I would never hold a married man’s secrets for anything less than $500 a visit. I know $500 sounds like a lot to some people but if you’re making even at minimum the average that sugar daddies make, $250k then $500 x 2-4 visits a month is nothing.",
            "author": null,
            "id": "f1mfsby",
            "parent_id": "t1_f1m9ca6",
            "score": 1,
            "created_utc": 1569592905.0,
            "replies": [
                {
                    "body": "Well it certainly depends on the location.\n\nI think someone living in 80% of the geographic mass of the US might have difficulty getting a $500 per meet allowance and be one of the people on here complaining about the inability to find a long-term relationship.\n\nBut obviously no one should feel compelled to take less than what they feel is appropriate.\n\nAnd not everyone on here is married!",
                    "author": "mtncityguy",
                    "id": "f1mgcio",
                    "parent_id": "t1_f1mfsby",
                    "score": 2,
                    "created_utc": 1569593277.0,
                    "replies": [
                        {
                            "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
                            "author": null,
                            "id": "f1mt1cg",
                            "parent_id": "t1_f1mgcio",
                            "score": 2,
                            "created_utc": 1569601489.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Allowance isn’t based on someone income. It’s based on someone’s liquid cash that they have to spend on pleasure.\n\nA man that makes $450,000 per yard, has 2 houses, a wife and 3 college aged kids might have less to spend each month then a single guy making $150,000 and leases a condo, has no kids or wife.\n\nPlus if someone is working all week just to make $300 to $400 doing a shit job while going to school, getting $300 to $400 for an evening of dinner, having fun and getting good sex, sounds like a really good deal to most women, especially when they’ve been dating guys that either make them go Dutch or even guys they’d have to support.",
                    "author": "ruphun",
                    "id": "f1n0sg2",
                    "parent_id": "t1_f1mfsby",
                    "score": 2,
                    "created_utc": 1569606372.0,
                    "replies": [
                        {
                            "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
                            "author": null,
                            "id": "f1n8nny",
                            "parent_id": "t1_f1n0sg2",
                            "score": 1,
                            "created_utc": 1569611502.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I found it, thanks!\nBut average allowance per area is just a hole of deleted comments 😅 doubt i find Norway on the list anyway.",
            "author": null,
            "id": "f1myjkh",
            "parent_id": "t1_f1mxbyh",
            "score": 9,
            "created_utc": 1569604959.0,
            "replies": [
                {
                    "body": "You’re in Norway?",
                    "author": "fannyhoney",
                    "id": "f1ni22i",
                    "parent_id": "t1_f1myjkh",
                    "score": 1,
                    "created_utc": 1569617768.0,
                    "replies": [
                        {
                            "body": "Yep, you? Fanny is kind of a norwegian name :)",
                            "author": null,
                            "id": "f1ni6g5",
                            "parent_id": "t1_f1ni22i",
                            "score": 1,
                            "created_utc": 1569617851.0,
                            "replies": [
                                {
                                    "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                                    "author": "fannyhoney",
                                    "id": "f1p81y7",
                                    "parent_id": "t1_f1ni6g5",
                                    "score": 1,
                                    "created_utc": 1569674599.0,
                                    "replies": [
                                        {
                                            "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                            "author": null,
                                            "id": "f1pa00o",
                                            "parent_id": "t1_f1p81y7",
                                            "score": 1,
                                            "created_utc": 1569675945.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She’s in Norway which is going to have different customs if for no other reason than the taxes. High earners there are paying 55-60% in tax I think?",
            "author": "SDstartingOut",
            "id": "f1n6lmp",
            "parent_id": "t1_f1mogpr",
            "score": 3,
            "created_utc": 1569610160.0,
            "replies": [
                {
                    "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
                    "author": null,
                    "id": "f1pgqxh",
                    "parent_id": "t1_f1n6lmp",
                    "score": 1,
                    "created_utc": 1569680096.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, it's a cheap student-room of about 16square meters ;)",
            "author": null,
            "id": "f1mozyr",
            "parent_id": "t1_f1mogpr",
            "score": 1,
            "created_utc": 1569598935.0,
            "replies": []
        },
        {
            "body": "Shittt, i'm scared 😅",
            "author": null,
            "id": "f1no6r3",
            "parent_id": "t1_f1nlwz7",
            "score": 2,
            "created_utc": 1569621836.0,
            "replies": [
                {
                    "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
                    "author": "Mopsydoll",
                    "id": "f1nsyys",
                    "parent_id": "t1_f1no6r3",
                    "score": 2,
                    "created_utc": 1569625476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I understand your analysis which is purely transactional and doesn't take into account a number of things.\n\n Among other things, it assumes that the only value I bring into someone's life is money. What's the value in having someone in your life who cares about you and helps you sort through internships or grad school options? What's the value of having a guy in your life you trust and can provide a sounding board to your decisions? What's the value in knowing if your car fails inspection because of brakes or tires, your car will magically appear with new tires?  What's the value of having a guy you can talk to when your vanilla boyfriend hits you? What's the value of being able to sound out how to explain to your parents you decided not to go to medical school?\n\nThat doesn't mean I don't expect to provide an allowance that allows someone to graduate from college debt-free.\n\nAnd the focus on secret keeping is frankly a little concerning. No matter how we meet someone we date, isn't it expected to keep each other secrets. Of course women I date, whether from SA or through traditional dating, tell me information that is intimate, personal, and secret. The thousands of years it's been built into us that we keep that information personal and secret even when we grow apart.",
            "author": "mtncityguy",
            "id": "f1mhrai",
            "parent_id": "t1_f1mg8gk",
            "score": 2,
            "created_utc": 1569594198.0,
            "replies": [
                {
                    "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
                    "author": null,
                    "id": "f1msxxx",
                    "parent_id": "t1_f1mhrai",
                    "score": 5,
                    "created_utc": 1569601431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> low end graphic designers make $50/hr. So if You require 4 hours of work that’s at minimum $200 for 4 hours, \n\nYes that's still well below the average salary a US person makes.  Now - if you are a graphic designer, I can see why that would play into it.  But most SBs are not pulling that type of cash in.\n\n> . But $50/hr to provide companionship, intimacy, and discretion, is honestly beyond insulting. So let’s bump it up to $100 which to me still is a slightly insulting hourly rate\n\nAnd to me, the idea that my SB would attempt to turn an allowance into an hourly wage is insulting.  It's not a job.  It's a relationship.  That relationship includes benefits - sugar - as it is.  But it's not a job.\n\nUnless, you are treating it as a job.  But that's where a lot of us do not.",
            "author": "SDstartingOut",
            "id": "f1nkjxf",
            "parent_id": "t1_f1mg8gk",
            "score": 2,
            "created_utc": 1569619349.0,
            "replies": [
                {
                    "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
                    "author": null,
                    "id": "f1nxfjk",
                    "parent_id": "t1_f1nkjxf",
                    "score": 0,
                    "created_utc": 1569628973.0,
                    "replies": [
                        {
                            "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                            "author": null,
                            "id": "f1phgbh",
                            "parent_id": "t1_f1nxfjk",
                            "score": 0,
                            "created_utc": 1569680571.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f1qcnyr",
                                    "parent_id": "t1_f1phgbh",
                                    "score": 1,
                                    "created_utc": 1569698115.0,
                                    "replies": [
                                        {
                                            "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                            "author": null,
                                            "id": "f1qm6dw",
                                            "parent_id": "t1_f1qcnyr",
                                            "score": 1,
                                            "created_utc": 1569703216.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well it certainly depends on the location.\n\nI think someone living in 80% of the geographic mass of the US might have difficulty getting a $500 per meet allowance and be one of the people on here complaining about the inability to find a long-term relationship.\n\nBut obviously no one should feel compelled to take less than what they feel is appropriate.\n\nAnd not everyone on here is married!",
            "author": "mtncityguy",
            "id": "f1mgcio",
            "parent_id": "t1_f1mfsby",
            "score": 2,
            "created_utc": 1569593277.0,
            "replies": [
                {
                    "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
                    "author": null,
                    "id": "f1mt1cg",
                    "parent_id": "t1_f1mgcio",
                    "score": 2,
                    "created_utc": 1569601489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Allowance isn’t based on someone income. It’s based on someone’s liquid cash that they have to spend on pleasure.\n\nA man that makes $450,000 per yard, has 2 houses, a wife and 3 college aged kids might have less to spend each month then a single guy making $150,000 and leases a condo, has no kids or wife.\n\nPlus if someone is working all week just to make $300 to $400 doing a shit job while going to school, getting $300 to $400 for an evening of dinner, having fun and getting good sex, sounds like a really good deal to most women, especially when they’ve been dating guys that either make them go Dutch or even guys they’d have to support.",
            "author": "ruphun",
            "id": "f1n0sg2",
            "parent_id": "t1_f1mfsby",
            "score": 2,
            "created_utc": 1569606372.0,
            "replies": [
                {
                    "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
                    "author": null,
                    "id": "f1n8nny",
                    "parent_id": "t1_f1n0sg2",
                    "score": 1,
                    "created_utc": 1569611502.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re in Norway?",
            "author": "fannyhoney",
            "id": "f1ni22i",
            "parent_id": "t1_f1myjkh",
            "score": 1,
            "created_utc": 1569617768.0,
            "replies": [
                {
                    "body": "Yep, you? Fanny is kind of a norwegian name :)",
                    "author": null,
                    "id": "f1ni6g5",
                    "parent_id": "t1_f1ni22i",
                    "score": 1,
                    "created_utc": 1569617851.0,
                    "replies": [
                        {
                            "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                            "author": "fannyhoney",
                            "id": "f1p81y7",
                            "parent_id": "t1_f1ni6g5",
                            "score": 1,
                            "created_utc": 1569674599.0,
                            "replies": [
                                {
                                    "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                                    "author": null,
                                    "id": "f1pa00o",
                                    "parent_id": "t1_f1p81y7",
                                    "score": 1,
                                    "created_utc": 1569675945.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used to think 40% was max, but recently learned that it isn't... i pay around 20% on those month where i make 1000$",
            "author": null,
            "id": "f1pgqxh",
            "parent_id": "t1_f1n6lmp",
            "score": 1,
            "created_utc": 1569680096.0,
            "replies": []
        },
        {
            "body": "I'm right here rooting for you. I know you're gonna get better because I'm gonna get better",
            "author": "Mopsydoll",
            "id": "f1nsyys",
            "parent_id": "t1_f1no6r3",
            "score": 2,
            "created_utc": 1569625476.0,
            "replies": []
        },
        {
            "body": "When you're married and \"don't want to change that\" then yes, there's an emphasis on secret keeping.\n\nI don't need a sugary daddy to help sort through internships or grad school options. If you had connections to those grad schools or could give me an internship, then that would be fulfilling the SUGAR part. But there's so many other resources out there to help sort through grad school and internships. Unless the Daddy works in those fields, then his advice is going to be no better or worse than any one else I can get help from. Also, I don't go into sugaring for someone who can help me decide on grad schools...... \n\nI also have many people in my life i can trust and whom care for me, so that's not why I enter sugar relationships. I enter sugar relationships for sugar and to be pounded by an older man because I'm a sexual deviant. The support, etc is part of the \"emotional connection\" that I seek in SR's and the SDs I want to be with also want this connection. That's part of the deal, but I can also get that from literally anyone else without the SUGAR tag. The point of an SR is to provide sugar, get honey. \n\n\"What's the value... new tires\" so that's back to money, you're just proving my point.\n\n\"What's the value... when your vanilla boyfriend hits you?\" whoaaaa if you're in an abusive relationship, an SR is not going to make your life any better and being able to talk to an older gentleman about the abuse you endure is NOT going to help. Only leaving the relationship will help - I know this from personal experience.\n\n\"what's the value... not going to medical school?\" dude do you just assume all sugar babies DONT have any friends? These are all things I can get from a bestie or... you know... my parents. Which, sure, not all SBs have friends or parents, but the things you've listed all sound like very generic conversations that are not particularly exclusive to a sugar daddy. I can get them from friends, parents, college advisors, etc. I personally don't look for SRs for things like help deciding grad school.\n\nWE all have our reasons for getting into sugar relationships, mine are not for generic advice I can get from friends, parents, or college advisers and therefore I see no value in that beyond what is normally expected in a relationship.\n\nWhat is NOT normally expected in a relationship is to keep their secret, work your schedule around theirs, let them lead the sexual energy, ensure discretion,sneak around/frick in a hotel, and do your best to not let their wives find out.",
            "author": null,
            "id": "f1msxxx",
            "parent_id": "t1_f1mhrai",
            "score": 5,
            "created_utc": 1569601431.0,
            "replies": []
        },
        {
            "body": "you can use an hourly breakdown to determine a general range and still NOT treat it like a job. The two can be exclusive. Breaking it down to hourly is just one way to help someone determine their worth.",
            "author": null,
            "id": "f1nxfjk",
            "parent_id": "t1_f1nkjxf",
            "score": 0,
            "created_utc": 1569628973.0,
            "replies": [
                {
                    "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
                    "author": null,
                    "id": "f1phgbh",
                    "parent_id": "t1_f1nxfjk",
                    "score": 0,
                    "created_utc": 1569680571.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f1qcnyr",
                            "parent_id": "t1_f1phgbh",
                            "score": 1,
                            "created_utc": 1569698115.0,
                            "replies": [
                                {
                                    "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                                    "author": null,
                                    "id": "f1qm6dw",
                                    "parent_id": "t1_f1qcnyr",
                                    "score": 1,
                                    "created_utc": 1569703216.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think anyone making 250k a year would consider $500 a lot in exchange to screw a girl half their age who is enthusiastic and willing to fulfill the fantasies their wife wont.",
            "author": null,
            "id": "f1mt1cg",
            "parent_id": "t1_f1mgcio",
            "score": 2,
            "created_utc": 1569601489.0,
            "replies": []
        },
        {
            "body": "I wrote something out but now we have accidentally fallen into violating rule #4 so we gotta end the convo here.",
            "author": null,
            "id": "f1n8nny",
            "parent_id": "t1_f1n0sg2",
            "score": 1,
            "created_utc": 1569611502.0,
            "replies": []
        },
        {
            "body": "Yep, you? Fanny is kind of a norwegian name :)",
            "author": null,
            "id": "f1ni6g5",
            "parent_id": "t1_f1ni22i",
            "score": 1,
            "created_utc": 1569617851.0,
            "replies": [
                {
                    "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
                    "author": "fannyhoney",
                    "id": "f1p81y7",
                    "parent_id": "t1_f1ni6g5",
                    "score": 1,
                    "created_utc": 1569674599.0,
                    "replies": [
                        {
                            "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                            "author": null,
                            "id": "f1pa00o",
                            "parent_id": "t1_f1p81y7",
                            "score": 1,
                            "created_utc": 1569675945.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm trying to stay away from letting my allowance determine my worth.. We are all humans, we can't be measured in money just because we hsve nice tits. Idk",
            "author": null,
            "id": "f1phgbh",
            "parent_id": "t1_f1nxfjk",
            "score": 0,
            "created_utc": 1569680571.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f1qcnyr",
                    "parent_id": "t1_f1phgbh",
                    "score": 1,
                    "created_utc": 1569698115.0,
                    "replies": [
                        {
                            "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                            "author": null,
                            "id": "f1qm6dw",
                            "parent_id": "t1_f1qcnyr",
                            "score": 1,
                            "created_utc": 1569703216.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used it randomly but I’m not Norwegian. How’s the sugaring scene like in Norway? I would assume pretty small since it’s not a big country. How do you find your options!",
            "author": "fannyhoney",
            "id": "f1p81y7",
            "parent_id": "t1_f1ni6g5",
            "score": 1,
            "created_utc": 1569674599.0,
            "replies": [
                {
                    "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
                    "author": null,
                    "id": "f1pa00o",
                    "parent_id": "t1_f1p81y7",
                    "score": 1,
                    "created_utc": 1569675945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f1qcnyr",
            "parent_id": "t1_f1phgbh",
            "score": 1,
            "created_utc": 1569698115.0,
            "replies": [
                {
                    "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
                    "author": null,
                    "id": "f1qm6dw",
                    "parent_id": "t1_f1qcnyr",
                    "score": 1,
                    "created_utc": 1569703216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, i have little to compare it too. But there are some options. Very few scammers! Only bounced into one or two obvious ones i think.\nWe dont have a lot of super rich guys, and the biggest sugardating site here (sugardaters.com) is mostly taken over by men who want escorts to have dinner with.\nBut there are a few good ones! Trying to land one right now :)",
            "author": null,
            "id": "f1pa00o",
            "parent_id": "t1_f1p81y7",
            "score": 1,
            "created_utc": 1569675945.0,
            "replies": []
        },
        {
            "body": "I see your point. But theres a difference between \"i know what value I can bring to someone's life\" and \"i know what I'm worth\".",
            "author": null,
            "id": "f1qm6dw",
            "parent_id": "t1_f1qcnyr",
            "score": 1,
            "created_utc": 1569703216.0,
            "replies": []
        }
    ]
}