{
    "title": "The L Word",
    "post_id": "mx8uy5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mx8uy5/the_l_word/",
    "author": "Fair_Meal1725",
    "body": "Story time: Last night I met up with a POT for a second date. Admittedly, I was skeptical after the first date, but I said fuck it, I’ll give this guy another shot. Long story short, one thing led to another &amp; we hooked up. I told him what I liked (e.g., being choked) &amp; he knew what to do, so I was thoroughly enjoying myself... Until suddenly, to my horror, he struck me in the face, which I DID NOT consent to. Before I could even react, he finished &amp; told me he loved me as he was lying on top of me. 😳 I got the fuck up out of there real quick. He then proceeded to call me 15 times on my way home. I wish I were making this shit up.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mx8uy5/the_l_word/",
    "score": 100,
    "upvote_ratio": 0.92,
    "created_utc": 1619224015.0,
    "num_comments": 68,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Saying I love you on the second date and calling 15 times on the way home is enough reason to move on imo.  And that’s without factoring in the slap",
            "author": null,
            "id": "gvmskae",
            "parent_id": "t3_mx8uy5",
            "score": 101,
            "created_utc": 1619226194.0,
            "replies": [
                {
                    "body": "Yes, this is all complete nightmare fuel. Damn.",
                    "author": "TrumpsCovidfefe",
                    "id": "gvoixnk",
                    "parent_id": "t1_gvmskae",
                    "score": 3,
                    "created_utc": 1619265680.0,
                    "replies": []
                },
                {
                    "body": "My thoughts exactly.",
                    "author": "Fair_Meal1725",
                    "id": "gvmtf6j",
                    "parent_id": "t1_gvmskae",
                    "score": 11,
                    "created_utc": 1619226663.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvmvsk2",
            "parent_id": "t3_mx8uy5",
            "score": 67,
            "created_utc": 1619227957.0,
            "replies": [
                {
                    "body": "Oh I know. I've dealt with abusers before & there are so many alarm bells going off. I didn't even mention the fact that he lied about using a condom so I'm considering going to the police for physical & sexual assault (for lying about the condom). But I'm afraid he’ll spin it & say I'm a prostitute or something.\n\nGood advice overall.",
                    "author": "Fair_Meal1725",
                    "id": "gvmw8kk",
                    "parent_id": "t1_gvmvsk2",
                    "score": 26,
                    "created_utc": 1619228203.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gvmydld",
                            "parent_id": "t1_gvmw8kk",
                            "score": 12,
                            "created_utc": 1619229405.0,
                            "replies": [
                                {
                                    "body": "He said he was using a condom but I felt him cum inside me & the condom he “used” was empty. I’m in the US & prostitution is illegal.",
                                    "author": "Fair_Meal1725",
                                    "id": "gvmz9km",
                                    "parent_id": "t1_gvmydld",
                                    "score": 7,
                                    "created_utc": 1619229918.0,
                                    "replies": [
                                        {
                                            "body": "He choked you and slapped you and stealthed you... any marks? That’s assault. He can try and say that you consented to be choked ... but then would have to admit to striking you in the face and stealthing ... he’d be in a difficult situation.",
                                            "author": "daddoms",
                                            "id": "gvmzu7u",
                                            "parent_id": "t1_gvmz9km",
                                            "score": 17,
                                            "created_utc": 1619230255.0,
                                            "replies": [
                                                {
                                                    "body": "The only reason I’m reluctant to report it is because he is alluding to the idea that I am a prostitute & making comments that I'm trying to “blackmail” him.",
                                                    "author": "Fair_Meal1725",
                                                    "id": "gvn02he",
                                                    "parent_id": "t1_gvmzu7u",
                                                    "score": 12,
                                                    "created_utc": 1619230393.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
                                                            "author": "daddoms",
                                                            "id": "gvn094y",
                                                            "parent_id": "t1_gvn02he",
                                                            "score": 15,
                                                            "created_utc": 1619230501.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Idk maybe. The dude is nuts.",
                                                                    "author": "Fair_Meal1725",
                                                                    "id": "gvn0eaj",
                                                                    "parent_id": "t1_gvn094y",
                                                                    "score": 9,
                                                                    "created_utc": 1619230587.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                                                                            "author": "Mr_Curious_Cat",
                                                                            "id": "gvn4q5s",
                                                                            "parent_id": "t1_gvn0eaj",
                                                                            "score": 8,
                                                                            "created_utc": 1619233172.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                                                                    "author": "Fair_Meal1725",
                                                                                    "id": "gvn6aa4",
                                                                                    "parent_id": "t1_gvn4q5s",
                                                                                    "score": 8,
                                                                                    "created_utc": 1619234141.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                                                                            "author": "Mr_Curious_Cat",
                                                                                            "id": "gvn6glh",
                                                                                            "parent_id": "t1_gvn6aa4",
                                                                                            "score": 3,
                                                                                            "created_utc": 1619234250.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "🫂",
                                                                                                    "author": "Fair_Meal1725",
                                                                                                    "id": "gvn6j8v",
                                                                                                    "parent_id": "t1_gvn6glh",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1619234295.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
                                                            "author": null,
                                                            "id": "gvnuun9",
                                                            "parent_id": "t1_gvn02he",
                                                            "score": 5,
                                                            "created_utc": 1619253802.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Please get PREP , not sure what it’s called in your country just in case you’ve been exposed to HIV & AIDS. It’s most effective when taken within a 72 hour period.\n\nGo to your local clinic and tell them you’ve been exposed .  Also get a std and sti screening .\nAnd get a morning after pill , remember it only works if you have not ovulated. \n\nPLEASE DO THESE THINGS AS SOON AS YOU READ THIS MESSAGE !!!!",
                                            "author": "Momotheblack",
                                            "id": "gvntcio",
                                            "parent_id": "t1_gvmz9km",
                                            "score": 8,
                                            "created_utc": 1619252308.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "That's called stealthing and it's rape. It's illegal",
                                            "author": null,
                                            "id": "gvnuog9",
                                            "parent_id": "t1_gvmz9km",
                                            "score": 5,
                                            "created_utc": 1619253630.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "oh damn...yea, i recently came across that forum where johns brag about getting on SA and 'creaming' SB's. I would wait the 14 days, and go get check for STDs. Another reason why now i'm hesitant to even get on SA.",
                                            "author": "MiLocavida",
                                            "id": "gvp2sgp",
                                            "parent_id": "t1_gvmz9km",
                                            "score": 1,
                                            "created_utc": 1619271371.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If you plan on getting a rape kit, I would go sooner than later. I’m not sure it’s relevant at this point because it was consensual and that’s not what you’re saying happened, but physical evidence degenerates quickly. \n\nI’m so sorry this happened to you. I always make it clear that slapping me is not okay, but I’m always worried they think I’m just saying it. I hope you’re alright.",
                            "author": "the_sex_is_on_fire",
                            "id": "gvmx3d2",
                            "parent_id": "t1_gvmw8kk",
                            "score": 6,
                            "created_utc": 1619228680.0,
                            "replies": [
                                {
                                    "body": "It’s not consensual if you consent to sex with condom but the guy takes it off without mid act.\n\nBut I also totally understand not wanting to do anything about it, like report it, because there’s a point where it just seems like more hassle than it’s worth and could end up ruining your life instead. It sucks.",
                                    "author": "fakemoose",
                                    "id": "gvn6rbb",
                                    "parent_id": "t1_gvmx3d2",
                                    "score": 8,
                                    "created_utc": 1619234436.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I am SO sorry to read this. I was assaulted and honestly I wish I had reported it at the time and had a rape kit done for proof. Please do what you need to do, but eveb if you think there's a CHANCE you want to report it, please consider acting sooner rather than later. Again, I'm truly sorry this happened to you. You didn't deserve that.\n\nHere are some resources in the meantime. Let me know if you want me to look something up for you or make any calls to provide you with anything you need. You're in my prayers.\n\nRAINN National Sexual Assault Hotline #:1-800-656-4673\nhttps://www.rainn.org/\n\nhttp://www.partnershiphp.org/Community/Pages/Sexual-Assault-Resources.aspx",
                            "author": "Heartless_Weeknd",
                            "id": "gvnvvro",
                            "parent_id": "t1_gvmw8kk",
                            "score": 2,
                            "created_utc": 1619254856.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So there is a video that is causing all this talk about choking ???  What is going on ?",
                    "author": "shamloo77",
                    "id": "gvn22vk",
                    "parent_id": "t1_gvmvsk2",
                    "score": -2,
                    "created_utc": 1619231584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WHAT?! That's crazy! I'm so sorry he hit you, that's rude. \n\nWhy are some men like this",
            "author": "Ashleycakessssss",
            "id": "gvmot45",
            "parent_id": "t3_mx8uy5",
            "score": 37,
            "created_utc": 1619224149.0,
            "replies": [
                {
                    "body": "I ask myself that question at least once a week.",
                    "author": "Fair_Meal1725",
                    "id": "gvmov2e",
                    "parent_id": "t1_gvmot45",
                    "score": 17,
                    "created_utc": 1619224178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Until suddenly, to my horror, he struck me in the face, which I DID NOT consent to.\n\nHe hit you? 😳\n\nWtf. That's straight up assault. You should have kicked him in the nuts and called the cops on him.\n\nI'm sorry that happened to you.",
            "author": "non_giant_panda",
            "id": "gvmozar",
            "parent_id": "t3_mx8uy5",
            "score": 24,
            "created_utc": 1619224240.0,
            "replies": [
                {
                    "body": "I really didn't know what to do at the time other than leave as quickly as possible.",
                    "author": "Fair_Meal1725",
                    "id": "gvmp7gf",
                    "parent_id": "t1_gvmozar",
                    "score": 11,
                    "created_utc": 1619224362.0,
                    "replies": [
                        {
                            "body": "You probably did the right thing. Sorry again that happened.",
                            "author": "non_giant_panda",
                            "id": "gvmtbpx",
                            "parent_id": "t1_gvmp7gf",
                            "score": 11,
                            "created_utc": 1619226611.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sometimes I think that I could be a cross between Elephant Man, and the Hunchback of Notre Dame, and if I treated SB’s with decency and respect, I would be in the top 5 percentile of POT’s. What a jackass, and sorry you had to deal with this.\n\nPS - if he is a Minnesota Wild fan, all the more reason to kick him to the curb.",
            "author": "MrBuzzard",
            "id": "gvn19da",
            "parent_id": "t3_mx8uy5",
            "score": 7,
            "created_utc": 1619231101.0,
            "replies": []
        },
        {
            "body": "Sorry this happened. I suspect this was a mistake in his part, he doesn’t know that even if it’s ok to choke someone that face slapping isn’t ok. \n\nI want to warn you that being choked, particularly be someone inexperienced, can be surprisingly dangerous ie death is a risk.\n\n[edit: no mistake — abuser, so sorry this happened 😔]",
            "author": "daddoms",
            "id": "gvmpg0u",
            "parent_id": "t3_mx8uy5",
            "score": 6,
            "created_utc": 1619224490.0,
            "replies": [
                {
                    "body": "I am aware, but I appreciate the warning anyways!",
                    "author": "Fair_Meal1725",
                    "id": "gvmpmfk",
                    "parent_id": "t1_gvmpg0u",
                    "score": 2,
                    "created_utc": 1619224587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You were right to leave as fast as possible... Think he mistook you love being choked as you enjoying sadomasochism... Plus calling fifteen times sounds like toxicity",
            "author": "Viva_La_Vixen",
            "id": "gvn9rj4",
            "parent_id": "t3_mx8uy5",
            "score": 3,
            "created_utc": 1619236319.0,
            "replies": [
                {
                    "body": "I think it's more he used one kink as a foot in the door for abuse. Sadomasochism as far as BDSM is very consent based. He's just an abuser.",
                    "author": null,
                    "id": "gvnv0h2",
                    "parent_id": "t1_gvn9rj4",
                    "score": 6,
                    "created_utc": 1619253968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy shit, it's like he compounded horror on top of horror on top of horror. Treat yourself with extra compassion and care today.",
            "author": "Cledaddy23",
            "id": "gvph04z",
            "parent_id": "t3_mx8uy5",
            "score": 3,
            "created_utc": 1619275099.0,
            "replies": []
        },
        {
            "body": "Ugh are you ok?  I'm glad you were able to get out quickly and got home safely.  Self care and block his ass everywhere.",
            "author": "KittenReigns",
            "id": "gvq47wv",
            "parent_id": "t3_mx8uy5",
            "score": 3,
            "created_utc": 1619282556.0,
            "replies": []
        },
        {
            "body": "Oh honey the day one SD has the balls to strike me, he’ll be seeing god that day. He had in no way permission to do that. It’s rude and demeaning. Just cause you said you liked to be chocked and gave permission doesn’t mean he can follow through with his kinks (which seems to be slapping/hitting).",
            "author": null,
            "id": "gvmq8dt",
            "parent_id": "t3_mx8uy5",
            "score": 4,
            "created_utc": 1619224917.0,
            "replies": []
        },
        {
            "body": "I don’t know what men find hot about slapping someone during sex.",
            "author": "littlebobeep29",
            "id": "gvmt0a9",
            "parent_id": "t3_mx8uy5",
            "score": 6,
            "created_utc": 1619226439.0,
            "replies": [
                {
                    "body": "It’s not just men. Women also like it. The concern is not the action but the consent.",
                    "author": "Cdnsugarr",
                    "id": "gvn2yq9",
                    "parent_id": "t1_gvmt0a9",
                    "score": 35,
                    "created_utc": 1619232113.0,
                    "replies": []
                },
                {
                    "body": "But choking's totes reasonable?",
                    "author": "impartlycyborg",
                    "id": "gvwr3rm",
                    "parent_id": "t1_gvmt0a9",
                    "score": 1,
                    "created_utc": 1619426244.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yikes! Sorry that happened. Any chance this is guy #1 from your post a couple days ago?",
            "author": null,
            "id": "gvmoz4a",
            "parent_id": "t3_mx8uy5",
            "score": 2,
            "created_utc": 1619224237.0,
            "replies": [
                {
                    "body": "No, I ghosted #1. 🤣",
                    "author": "Fair_Meal1725",
                    "id": "gvmp2fe",
                    "parent_id": "t1_gvmoz4a",
                    "score": 2,
                    "created_utc": 1619224287.0,
                    "replies": [
                        {
                            "body": "Is he number 2 ???",
                            "author": "shamloo77",
                            "id": "gvn2fk7",
                            "parent_id": "t1_gvmp2fe",
                            "score": 1,
                            "created_utc": 1619231795.0,
                            "replies": [
                                {
                                    "body": "No. Completely different guy.",
                                    "author": "Fair_Meal1725",
                                    "id": "gvn2h2x",
                                    "parent_id": "t1_gvn2fk7",
                                    "score": 0,
                                    "created_utc": 1619231820.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvmvgo3",
            "parent_id": "t3_mx8uy5",
            "score": 2,
            "created_utc": 1619227781.0,
            "replies": [
                {
                    "body": "15 !! Bit much methinks 😂😂",
                    "author": "Mangas70",
                    "id": "gvn9o6r",
                    "parent_id": "t1_gvmvgo3",
                    "score": 1,
                    "created_utc": 1619236262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Too me the love statement is more fucked up than the slap. \nYes the slap was wrong but I can see him fucking up in the heat of the moment while they're already having rough sex.\n\nBut...seriously, he's not a teen or college kid, you should know not to say I love you during sex with a new partner.",
            "author": "Mr_Curious_Cat",
            "id": "gvn3wci",
            "parent_id": "t3_mx8uy5",
            "score": 2,
            "created_utc": 1619232674.0,
            "replies": [
                {
                    "body": "It wasn't even during sex. It was after & it was said more than once.",
                    "author": "Fair_Meal1725",
                    "id": "gvn61gt",
                    "parent_id": "t1_gvn3wci",
                    "score": 1,
                    "created_utc": 1619233989.0,
                    "replies": [
                        {
                            "body": "That's...insane. Once said in the afterglow is a stupid slip up but multiple times....wtf?",
                            "author": "Mr_Curious_Cat",
                            "id": "gvn6alm",
                            "parent_id": "t1_gvn61gt",
                            "score": 2,
                            "created_utc": 1619234146.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Happened to me once with a guy I was vanilla dating. He never effing saw my ass AGAIN. How dare you slap me in the face! Just because I enjoy being choked and hair pulled , does NOT mean you can take it THAT far. Disgusting.",
            "author": "D___Licious",
            "id": "gvnlyng",
            "parent_id": "t3_mx8uy5",
            "score": 2,
            "created_utc": 1619245403.0,
            "replies": []
        },
        {
            "body": "This is awful. You did not deserve this and he is completely at fault.",
            "author": null,
            "id": "gvo6tbu",
            "parent_id": "t3_mx8uy5",
            "score": 2,
            "created_utc": 1619261411.0,
            "replies": []
        },
        {
            "body": "Jesus.. this is like something out of a serial killer movie. BLOCK HIM IMMEDIATELY!!",
            "author": "Tough-Raisin1514",
            "id": "gvmrtqh",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619225787.0,
            "replies": []
        },
        {
            "body": "He's got some very odd ideas about what love is...",
            "author": "Ok-Tale-8876",
            "id": "gvpab50",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619273413.0,
            "replies": [
                {
                    "body": "Let's say we all do.",
                    "author": "impartlycyborg",
                    "id": "gvwrqc0",
                    "parent_id": "t1_gvpab50",
                    "score": 1,
                    "created_utc": 1619426863.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you get a ppm?",
            "author": "new_sd_acct",
            "id": "gvmsbw3",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619226065.0,
            "replies": [
                {
                    "body": "Yeah.",
                    "author": "Fair_Meal1725",
                    "id": "gvmtlcr",
                    "parent_id": "t1_gvmsbw3",
                    "score": 2,
                    "created_utc": 1619226758.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvmy8c9",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619229320.0,
            "replies": [
                {
                    "body": "Doing what someone likes is ok, doing something random is not ok (no consent) and stealthing is really bad (against consent) different levels of assault.",
                    "author": "daddoms",
                    "id": "gvmz47x",
                    "parent_id": "t1_gvmy8c9",
                    "score": 8,
                    "created_utc": 1619229830.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gvn0dx8",
                            "parent_id": "t1_gvmz47x",
                            "score": 1,
                            "created_utc": 1619230581.0,
                            "replies": [
                                {
                                    "body": "I get enthusiastic upfront permission to do anything and everything that I do.\n\nI use safewords even in phone or text conversations.",
                                    "author": "daddoms",
                                    "id": "gvn0iro",
                                    "parent_id": "t1_gvn0dx8",
                                    "score": 6,
                                    "created_utc": 1619230662.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Someone please explain stealthing? TIA ☺️☺️",
                            "author": "D___Licious",
                            "id": "gvnm976",
                            "parent_id": "t1_gvmz47x",
                            "score": 1,
                            "created_utc": 1619245662.0,
                            "replies": [
                                {
                                    "body": "[A post a while back on it](/r/sugarlifestyleforum/comments/8m3yk8/stealth_sex_what_it_is_amp_how_to_stop_an_asshole/).",
                                    "author": "SeattleLaserMeteor",
                                    "id": "gvnoz2d",
                                    "parent_id": "t1_gvnm976",
                                    "score": 3,
                                    "created_utc": 1619248121.0,
                                    "replies": [
                                        {
                                            "body": "Thanks a million!",
                                            "author": "D___Licious",
                                            "id": "gvnpbmi",
                                            "parent_id": "t1_gvnoz2d",
                                            "score": 1,
                                            "created_utc": 1619248447.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "if it was me and you asked me to choke you, i would have finished right quick and got the hell out of there. if this was discussed before the act, i would not have been in the act. any guy doing that leaves themselves wide open for a lawsuit or the cops.\n\ni don't know why everyone is carrying on about abuse. seems to me the choking was abusive to begin with.",
            "author": "captblood44",
            "id": "gvmzmvk",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619230134.0,
            "replies": [
                {
                    "body": "Choking is not abusive in any way if it is consented to and done correctly. This is true for ANY form of BDSM. Just because it's not your thing does not make it a form of abuse. \n\nWhat absolutely was abusive was the slap & stealthing. Neither were consented to. That consent is what makes the difference.",
                    "author": "ShaArt5",
                    "id": "gvnpg7m",
                    "parent_id": "t1_gvmzmvk",
                    "score": 7,
                    "created_utc": 1619248567.0,
                    "replies": [
                        {
                            "body": "Thank you.",
                            "author": "Fair_Meal1725",
                            "id": "gvsg351",
                            "parent_id": "t1_gvnpg7m",
                            "score": 2,
                            "created_utc": 1619327945.0,
                            "replies": [
                                {
                                    "body": "You're welcome, luv.",
                                    "author": "ShaArt5",
                                    "id": "gvtruvv",
                                    "parent_id": "t1_gvsg351",
                                    "score": 3,
                                    "created_utc": 1619365048.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting choice to bury the lead.",
            "author": "BinghamtonSD",
            "id": "gvmtqpx",
            "parent_id": "t3_mx8uy5",
            "score": -3,
            "created_utc": 1619226838.0,
            "replies": []
        },
        {
            "body": "Being hit in the face is some heavy BDSM. I've not met a submissive yet who said they liked it. So this \"SD\" is neither a SD, or an experienced Dom. Next the dickhead.",
            "author": "theend1sn1gh",
            "id": "gvn4z96",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619233329.0,
            "replies": [
                {
                    "body": "You know zip about BDSM.",
                    "author": "impartlycyborg",
                    "id": "gvwrntl",
                    "parent_id": "t1_gvn4z96",
                    "score": 0,
                    "created_utc": 1619426796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl I am so sorry. What the fuck is wrong with people?",
            "author": null,
            "id": "gvn98ky",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619235991.0,
            "replies": []
        },
        {
            "body": "Block that dude on everything and consider ditching the number you gave him to contact you.",
            "author": "misoramen28",
            "id": "gvnir97",
            "parent_id": "t3_mx8uy5",
            "score": 1,
            "created_utc": 1619242707.0,
            "replies": [
                {
                    "body": "Done & done.",
                    "author": "Fair_Meal1725",
                    "id": "gvnmbc2",
                    "parent_id": "t1_gvnir97",
                    "score": 2,
                    "created_utc": 1619245714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, this is all complete nightmare fuel. Damn.",
            "author": "TrumpsCovidfefe",
            "id": "gvoixnk",
            "parent_id": "t1_gvmskae",
            "score": 3,
            "created_utc": 1619265680.0,
            "replies": []
        },
        {
            "body": "My thoughts exactly.",
            "author": "Fair_Meal1725",
            "id": "gvmtf6j",
            "parent_id": "t1_gvmskae",
            "score": 11,
            "created_utc": 1619226663.0,
            "replies": []
        },
        {
            "body": "Oh I know. I've dealt with abusers before & there are so many alarm bells going off. I didn't even mention the fact that he lied about using a condom so I'm considering going to the police for physical & sexual assault (for lying about the condom). But I'm afraid he’ll spin it & say I'm a prostitute or something.\n\nGood advice overall.",
            "author": "Fair_Meal1725",
            "id": "gvmw8kk",
            "parent_id": "t1_gvmvsk2",
            "score": 26,
            "created_utc": 1619228203.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvmydld",
                    "parent_id": "t1_gvmw8kk",
                    "score": 12,
                    "created_utc": 1619229405.0,
                    "replies": [
                        {
                            "body": "He said he was using a condom but I felt him cum inside me & the condom he “used” was empty. I’m in the US & prostitution is illegal.",
                            "author": "Fair_Meal1725",
                            "id": "gvmz9km",
                            "parent_id": "t1_gvmydld",
                            "score": 7,
                            "created_utc": 1619229918.0,
                            "replies": [
                                {
                                    "body": "He choked you and slapped you and stealthed you... any marks? That’s assault. He can try and say that you consented to be choked ... but then would have to admit to striking you in the face and stealthing ... he’d be in a difficult situation.",
                                    "author": "daddoms",
                                    "id": "gvmzu7u",
                                    "parent_id": "t1_gvmz9km",
                                    "score": 17,
                                    "created_utc": 1619230255.0,
                                    "replies": [
                                        {
                                            "body": "The only reason I’m reluctant to report it is because he is alluding to the idea that I am a prostitute & making comments that I'm trying to “blackmail” him.",
                                            "author": "Fair_Meal1725",
                                            "id": "gvn02he",
                                            "parent_id": "t1_gvmzu7u",
                                            "score": 12,
                                            "created_utc": 1619230393.0,
                                            "replies": [
                                                {
                                                    "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
                                                    "author": "daddoms",
                                                    "id": "gvn094y",
                                                    "parent_id": "t1_gvn02he",
                                                    "score": 15,
                                                    "created_utc": 1619230501.0,
                                                    "replies": [
                                                        {
                                                            "body": "Idk maybe. The dude is nuts.",
                                                            "author": "Fair_Meal1725",
                                                            "id": "gvn0eaj",
                                                            "parent_id": "t1_gvn094y",
                                                            "score": 9,
                                                            "created_utc": 1619230587.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                                                                    "author": "Mr_Curious_Cat",
                                                                    "id": "gvn4q5s",
                                                                    "parent_id": "t1_gvn0eaj",
                                                                    "score": 8,
                                                                    "created_utc": 1619233172.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                                                            "author": "Fair_Meal1725",
                                                                            "id": "gvn6aa4",
                                                                            "parent_id": "t1_gvn4q5s",
                                                                            "score": 8,
                                                                            "created_utc": 1619234141.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                                                                    "author": "Mr_Curious_Cat",
                                                                                    "id": "gvn6glh",
                                                                                    "parent_id": "t1_gvn6aa4",
                                                                                    "score": 3,
                                                                                    "created_utc": 1619234250.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "🫂",
                                                                                            "author": "Fair_Meal1725",
                                                                                            "id": "gvn6j8v",
                                                                                            "parent_id": "t1_gvn6glh",
                                                                                            "score": 2,
                                                                                            "created_utc": 1619234295.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
                                                    "author": null,
                                                    "id": "gvnuun9",
                                                    "parent_id": "t1_gvn02he",
                                                    "score": 5,
                                                    "created_utc": 1619253802.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Please get PREP , not sure what it’s called in your country just in case you’ve been exposed to HIV & AIDS. It’s most effective when taken within a 72 hour period.\n\nGo to your local clinic and tell them you’ve been exposed .  Also get a std and sti screening .\nAnd get a morning after pill , remember it only works if you have not ovulated. \n\nPLEASE DO THESE THINGS AS SOON AS YOU READ THIS MESSAGE !!!!",
                                    "author": "Momotheblack",
                                    "id": "gvntcio",
                                    "parent_id": "t1_gvmz9km",
                                    "score": 8,
                                    "created_utc": 1619252308.0,
                                    "replies": []
                                },
                                {
                                    "body": "That's called stealthing and it's rape. It's illegal",
                                    "author": null,
                                    "id": "gvnuog9",
                                    "parent_id": "t1_gvmz9km",
                                    "score": 5,
                                    "created_utc": 1619253630.0,
                                    "replies": []
                                },
                                {
                                    "body": "oh damn...yea, i recently came across that forum where johns brag about getting on SA and 'creaming' SB's. I would wait the 14 days, and go get check for STDs. Another reason why now i'm hesitant to even get on SA.",
                                    "author": "MiLocavida",
                                    "id": "gvp2sgp",
                                    "parent_id": "t1_gvmz9km",
                                    "score": 1,
                                    "created_utc": 1619271371.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If you plan on getting a rape kit, I would go sooner than later. I’m not sure it’s relevant at this point because it was consensual and that’s not what you’re saying happened, but physical evidence degenerates quickly. \n\nI’m so sorry this happened to you. I always make it clear that slapping me is not okay, but I’m always worried they think I’m just saying it. I hope you’re alright.",
                    "author": "the_sex_is_on_fire",
                    "id": "gvmx3d2",
                    "parent_id": "t1_gvmw8kk",
                    "score": 6,
                    "created_utc": 1619228680.0,
                    "replies": [
                        {
                            "body": "It’s not consensual if you consent to sex with condom but the guy takes it off without mid act.\n\nBut I also totally understand not wanting to do anything about it, like report it, because there’s a point where it just seems like more hassle than it’s worth and could end up ruining your life instead. It sucks.",
                            "author": "fakemoose",
                            "id": "gvn6rbb",
                            "parent_id": "t1_gvmx3d2",
                            "score": 8,
                            "created_utc": 1619234436.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I am SO sorry to read this. I was assaulted and honestly I wish I had reported it at the time and had a rape kit done for proof. Please do what you need to do, but eveb if you think there's a CHANCE you want to report it, please consider acting sooner rather than later. Again, I'm truly sorry this happened to you. You didn't deserve that.\n\nHere are some resources in the meantime. Let me know if you want me to look something up for you or make any calls to provide you with anything you need. You're in my prayers.\n\nRAINN National Sexual Assault Hotline #:1-800-656-4673\nhttps://www.rainn.org/\n\nhttp://www.partnershiphp.org/Community/Pages/Sexual-Assault-Resources.aspx",
                    "author": "Heartless_Weeknd",
                    "id": "gvnvvro",
                    "parent_id": "t1_gvmw8kk",
                    "score": 2,
                    "created_utc": 1619254856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So there is a video that is causing all this talk about choking ???  What is going on ?",
            "author": "shamloo77",
            "id": "gvn22vk",
            "parent_id": "t1_gvmvsk2",
            "score": -2,
            "created_utc": 1619231584.0,
            "replies": []
        },
        {
            "body": "I ask myself that question at least once a week.",
            "author": "Fair_Meal1725",
            "id": "gvmov2e",
            "parent_id": "t1_gvmot45",
            "score": 17,
            "created_utc": 1619224178.0,
            "replies": []
        },
        {
            "body": "I really didn't know what to do at the time other than leave as quickly as possible.",
            "author": "Fair_Meal1725",
            "id": "gvmp7gf",
            "parent_id": "t1_gvmozar",
            "score": 11,
            "created_utc": 1619224362.0,
            "replies": [
                {
                    "body": "You probably did the right thing. Sorry again that happened.",
                    "author": "non_giant_panda",
                    "id": "gvmtbpx",
                    "parent_id": "t1_gvmp7gf",
                    "score": 11,
                    "created_utc": 1619226611.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am aware, but I appreciate the warning anyways!",
            "author": "Fair_Meal1725",
            "id": "gvmpmfk",
            "parent_id": "t1_gvmpg0u",
            "score": 2,
            "created_utc": 1619224587.0,
            "replies": []
        },
        {
            "body": "I think it's more he used one kink as a foot in the door for abuse. Sadomasochism as far as BDSM is very consent based. He's just an abuser.",
            "author": null,
            "id": "gvnv0h2",
            "parent_id": "t1_gvn9rj4",
            "score": 6,
            "created_utc": 1619253968.0,
            "replies": []
        },
        {
            "body": "It’s not just men. Women also like it. The concern is not the action but the consent.",
            "author": "Cdnsugarr",
            "id": "gvn2yq9",
            "parent_id": "t1_gvmt0a9",
            "score": 35,
            "created_utc": 1619232113.0,
            "replies": []
        },
        {
            "body": "But choking's totes reasonable?",
            "author": "impartlycyborg",
            "id": "gvwr3rm",
            "parent_id": "t1_gvmt0a9",
            "score": 1,
            "created_utc": 1619426244.0,
            "replies": []
        },
        {
            "body": "No, I ghosted #1. 🤣",
            "author": "Fair_Meal1725",
            "id": "gvmp2fe",
            "parent_id": "t1_gvmoz4a",
            "score": 2,
            "created_utc": 1619224287.0,
            "replies": [
                {
                    "body": "Is he number 2 ???",
                    "author": "shamloo77",
                    "id": "gvn2fk7",
                    "parent_id": "t1_gvmp2fe",
                    "score": 1,
                    "created_utc": 1619231795.0,
                    "replies": [
                        {
                            "body": "No. Completely different guy.",
                            "author": "Fair_Meal1725",
                            "id": "gvn2h2x",
                            "parent_id": "t1_gvn2fk7",
                            "score": 0,
                            "created_utc": 1619231820.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "15 !! Bit much methinks 😂😂",
            "author": "Mangas70",
            "id": "gvn9o6r",
            "parent_id": "t1_gvmvgo3",
            "score": 1,
            "created_utc": 1619236262.0,
            "replies": []
        },
        {
            "body": "It wasn't even during sex. It was after & it was said more than once.",
            "author": "Fair_Meal1725",
            "id": "gvn61gt",
            "parent_id": "t1_gvn3wci",
            "score": 1,
            "created_utc": 1619233989.0,
            "replies": [
                {
                    "body": "That's...insane. Once said in the afterglow is a stupid slip up but multiple times....wtf?",
                    "author": "Mr_Curious_Cat",
                    "id": "gvn6alm",
                    "parent_id": "t1_gvn61gt",
                    "score": 2,
                    "created_utc": 1619234146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let's say we all do.",
            "author": "impartlycyborg",
            "id": "gvwrqc0",
            "parent_id": "t1_gvpab50",
            "score": 1,
            "created_utc": 1619426863.0,
            "replies": []
        },
        {
            "body": "Yeah.",
            "author": "Fair_Meal1725",
            "id": "gvmtlcr",
            "parent_id": "t1_gvmsbw3",
            "score": 2,
            "created_utc": 1619226758.0,
            "replies": []
        },
        {
            "body": "Doing what someone likes is ok, doing something random is not ok (no consent) and stealthing is really bad (against consent) different levels of assault.",
            "author": "daddoms",
            "id": "gvmz47x",
            "parent_id": "t1_gvmy8c9",
            "score": 8,
            "created_utc": 1619229830.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvn0dx8",
                    "parent_id": "t1_gvmz47x",
                    "score": 1,
                    "created_utc": 1619230581.0,
                    "replies": [
                        {
                            "body": "I get enthusiastic upfront permission to do anything and everything that I do.\n\nI use safewords even in phone or text conversations.",
                            "author": "daddoms",
                            "id": "gvn0iro",
                            "parent_id": "t1_gvn0dx8",
                            "score": 6,
                            "created_utc": 1619230662.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Someone please explain stealthing? TIA ☺️☺️",
                    "author": "D___Licious",
                    "id": "gvnm976",
                    "parent_id": "t1_gvmz47x",
                    "score": 1,
                    "created_utc": 1619245662.0,
                    "replies": [
                        {
                            "body": "[A post a while back on it](/r/sugarlifestyleforum/comments/8m3yk8/stealth_sex_what_it_is_amp_how_to_stop_an_asshole/).",
                            "author": "SeattleLaserMeteor",
                            "id": "gvnoz2d",
                            "parent_id": "t1_gvnm976",
                            "score": 3,
                            "created_utc": 1619248121.0,
                            "replies": [
                                {
                                    "body": "Thanks a million!",
                                    "author": "D___Licious",
                                    "id": "gvnpbmi",
                                    "parent_id": "t1_gvnoz2d",
                                    "score": 1,
                                    "created_utc": 1619248447.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Choking is not abusive in any way if it is consented to and done correctly. This is true for ANY form of BDSM. Just because it's not your thing does not make it a form of abuse. \n\nWhat absolutely was abusive was the slap & stealthing. Neither were consented to. That consent is what makes the difference.",
            "author": "ShaArt5",
            "id": "gvnpg7m",
            "parent_id": "t1_gvmzmvk",
            "score": 7,
            "created_utc": 1619248567.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "Fair_Meal1725",
                    "id": "gvsg351",
                    "parent_id": "t1_gvnpg7m",
                    "score": 2,
                    "created_utc": 1619327945.0,
                    "replies": [
                        {
                            "body": "You're welcome, luv.",
                            "author": "ShaArt5",
                            "id": "gvtruvv",
                            "parent_id": "t1_gvsg351",
                            "score": 3,
                            "created_utc": 1619365048.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know zip about BDSM.",
            "author": "impartlycyborg",
            "id": "gvwrntl",
            "parent_id": "t1_gvn4z96",
            "score": 0,
            "created_utc": 1619426796.0,
            "replies": []
        },
        {
            "body": "Done & done.",
            "author": "Fair_Meal1725",
            "id": "gvnmbc2",
            "parent_id": "t1_gvnir97",
            "score": 2,
            "created_utc": 1619245714.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvmydld",
            "parent_id": "t1_gvmw8kk",
            "score": 12,
            "created_utc": 1619229405.0,
            "replies": [
                {
                    "body": "He said he was using a condom but I felt him cum inside me & the condom he “used” was empty. I’m in the US & prostitution is illegal.",
                    "author": "Fair_Meal1725",
                    "id": "gvmz9km",
                    "parent_id": "t1_gvmydld",
                    "score": 7,
                    "created_utc": 1619229918.0,
                    "replies": [
                        {
                            "body": "He choked you and slapped you and stealthed you... any marks? That’s assault. He can try and say that you consented to be choked ... but then would have to admit to striking you in the face and stealthing ... he’d be in a difficult situation.",
                            "author": "daddoms",
                            "id": "gvmzu7u",
                            "parent_id": "t1_gvmz9km",
                            "score": 17,
                            "created_utc": 1619230255.0,
                            "replies": [
                                {
                                    "body": "The only reason I’m reluctant to report it is because he is alluding to the idea that I am a prostitute & making comments that I'm trying to “blackmail” him.",
                                    "author": "Fair_Meal1725",
                                    "id": "gvn02he",
                                    "parent_id": "t1_gvmzu7u",
                                    "score": 12,
                                    "created_utc": 1619230393.0,
                                    "replies": [
                                        {
                                            "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
                                            "author": "daddoms",
                                            "id": "gvn094y",
                                            "parent_id": "t1_gvn02he",
                                            "score": 15,
                                            "created_utc": 1619230501.0,
                                            "replies": [
                                                {
                                                    "body": "Idk maybe. The dude is nuts.",
                                                    "author": "Fair_Meal1725",
                                                    "id": "gvn0eaj",
                                                    "parent_id": "t1_gvn094y",
                                                    "score": 9,
                                                    "created_utc": 1619230587.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                                                            "author": "Mr_Curious_Cat",
                                                            "id": "gvn4q5s",
                                                            "parent_id": "t1_gvn0eaj",
                                                            "score": 8,
                                                            "created_utc": 1619233172.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                                                    "author": "Fair_Meal1725",
                                                                    "id": "gvn6aa4",
                                                                    "parent_id": "t1_gvn4q5s",
                                                                    "score": 8,
                                                                    "created_utc": 1619234141.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                                                            "author": "Mr_Curious_Cat",
                                                                            "id": "gvn6glh",
                                                                            "parent_id": "t1_gvn6aa4",
                                                                            "score": 3,
                                                                            "created_utc": 1619234250.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "🫂",
                                                                                    "author": "Fair_Meal1725",
                                                                                    "id": "gvn6j8v",
                                                                                    "parent_id": "t1_gvn6glh",
                                                                                    "score": 2,
                                                                                    "created_utc": 1619234295.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
                                            "author": null,
                                            "id": "gvnuun9",
                                            "parent_id": "t1_gvn02he",
                                            "score": 5,
                                            "created_utc": 1619253802.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Please get PREP , not sure what it’s called in your country just in case you’ve been exposed to HIV & AIDS. It’s most effective when taken within a 72 hour period.\n\nGo to your local clinic and tell them you’ve been exposed .  Also get a std and sti screening .\nAnd get a morning after pill , remember it only works if you have not ovulated. \n\nPLEASE DO THESE THINGS AS SOON AS YOU READ THIS MESSAGE !!!!",
                            "author": "Momotheblack",
                            "id": "gvntcio",
                            "parent_id": "t1_gvmz9km",
                            "score": 8,
                            "created_utc": 1619252308.0,
                            "replies": []
                        },
                        {
                            "body": "That's called stealthing and it's rape. It's illegal",
                            "author": null,
                            "id": "gvnuog9",
                            "parent_id": "t1_gvmz9km",
                            "score": 5,
                            "created_utc": 1619253630.0,
                            "replies": []
                        },
                        {
                            "body": "oh damn...yea, i recently came across that forum where johns brag about getting on SA and 'creaming' SB's. I would wait the 14 days, and go get check for STDs. Another reason why now i'm hesitant to even get on SA.",
                            "author": "MiLocavida",
                            "id": "gvp2sgp",
                            "parent_id": "t1_gvmz9km",
                            "score": 1,
                            "created_utc": 1619271371.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you plan on getting a rape kit, I would go sooner than later. I’m not sure it’s relevant at this point because it was consensual and that’s not what you’re saying happened, but physical evidence degenerates quickly. \n\nI’m so sorry this happened to you. I always make it clear that slapping me is not okay, but I’m always worried they think I’m just saying it. I hope you’re alright.",
            "author": "the_sex_is_on_fire",
            "id": "gvmx3d2",
            "parent_id": "t1_gvmw8kk",
            "score": 6,
            "created_utc": 1619228680.0,
            "replies": [
                {
                    "body": "It’s not consensual if you consent to sex with condom but the guy takes it off without mid act.\n\nBut I also totally understand not wanting to do anything about it, like report it, because there’s a point where it just seems like more hassle than it’s worth and could end up ruining your life instead. It sucks.",
                    "author": "fakemoose",
                    "id": "gvn6rbb",
                    "parent_id": "t1_gvmx3d2",
                    "score": 8,
                    "created_utc": 1619234436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am SO sorry to read this. I was assaulted and honestly I wish I had reported it at the time and had a rape kit done for proof. Please do what you need to do, but eveb if you think there's a CHANCE you want to report it, please consider acting sooner rather than later. Again, I'm truly sorry this happened to you. You didn't deserve that.\n\nHere are some resources in the meantime. Let me know if you want me to look something up for you or make any calls to provide you with anything you need. You're in my prayers.\n\nRAINN National Sexual Assault Hotline #:1-800-656-4673\nhttps://www.rainn.org/\n\nhttp://www.partnershiphp.org/Community/Pages/Sexual-Assault-Resources.aspx",
            "author": "Heartless_Weeknd",
            "id": "gvnvvro",
            "parent_id": "t1_gvmw8kk",
            "score": 2,
            "created_utc": 1619254856.0,
            "replies": []
        },
        {
            "body": "You probably did the right thing. Sorry again that happened.",
            "author": "non_giant_panda",
            "id": "gvmtbpx",
            "parent_id": "t1_gvmp7gf",
            "score": 11,
            "created_utc": 1619226611.0,
            "replies": []
        },
        {
            "body": "Is he number 2 ???",
            "author": "shamloo77",
            "id": "gvn2fk7",
            "parent_id": "t1_gvmp2fe",
            "score": 1,
            "created_utc": 1619231795.0,
            "replies": [
                {
                    "body": "No. Completely different guy.",
                    "author": "Fair_Meal1725",
                    "id": "gvn2h2x",
                    "parent_id": "t1_gvn2fk7",
                    "score": 0,
                    "created_utc": 1619231820.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's...insane. Once said in the afterglow is a stupid slip up but multiple times....wtf?",
            "author": "Mr_Curious_Cat",
            "id": "gvn6alm",
            "parent_id": "t1_gvn61gt",
            "score": 2,
            "created_utc": 1619234146.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvn0dx8",
            "parent_id": "t1_gvmz47x",
            "score": 1,
            "created_utc": 1619230581.0,
            "replies": [
                {
                    "body": "I get enthusiastic upfront permission to do anything and everything that I do.\n\nI use safewords even in phone or text conversations.",
                    "author": "daddoms",
                    "id": "gvn0iro",
                    "parent_id": "t1_gvn0dx8",
                    "score": 6,
                    "created_utc": 1619230662.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone please explain stealthing? TIA ☺️☺️",
            "author": "D___Licious",
            "id": "gvnm976",
            "parent_id": "t1_gvmz47x",
            "score": 1,
            "created_utc": 1619245662.0,
            "replies": [
                {
                    "body": "[A post a while back on it](/r/sugarlifestyleforum/comments/8m3yk8/stealth_sex_what_it_is_amp_how_to_stop_an_asshole/).",
                    "author": "SeattleLaserMeteor",
                    "id": "gvnoz2d",
                    "parent_id": "t1_gvnm976",
                    "score": 3,
                    "created_utc": 1619248121.0,
                    "replies": [
                        {
                            "body": "Thanks a million!",
                            "author": "D___Licious",
                            "id": "gvnpbmi",
                            "parent_id": "t1_gvnoz2d",
                            "score": 1,
                            "created_utc": 1619248447.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you.",
            "author": "Fair_Meal1725",
            "id": "gvsg351",
            "parent_id": "t1_gvnpg7m",
            "score": 2,
            "created_utc": 1619327945.0,
            "replies": [
                {
                    "body": "You're welcome, luv.",
                    "author": "ShaArt5",
                    "id": "gvtruvv",
                    "parent_id": "t1_gvsg351",
                    "score": 3,
                    "created_utc": 1619365048.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He said he was using a condom but I felt him cum inside me & the condom he “used” was empty. I’m in the US & prostitution is illegal.",
            "author": "Fair_Meal1725",
            "id": "gvmz9km",
            "parent_id": "t1_gvmydld",
            "score": 7,
            "created_utc": 1619229918.0,
            "replies": [
                {
                    "body": "He choked you and slapped you and stealthed you... any marks? That’s assault. He can try and say that you consented to be choked ... but then would have to admit to striking you in the face and stealthing ... he’d be in a difficult situation.",
                    "author": "daddoms",
                    "id": "gvmzu7u",
                    "parent_id": "t1_gvmz9km",
                    "score": 17,
                    "created_utc": 1619230255.0,
                    "replies": [
                        {
                            "body": "The only reason I’m reluctant to report it is because he is alluding to the idea that I am a prostitute & making comments that I'm trying to “blackmail” him.",
                            "author": "Fair_Meal1725",
                            "id": "gvn02he",
                            "parent_id": "t1_gvmzu7u",
                            "score": 12,
                            "created_utc": 1619230393.0,
                            "replies": [
                                {
                                    "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
                                    "author": "daddoms",
                                    "id": "gvn094y",
                                    "parent_id": "t1_gvn02he",
                                    "score": 15,
                                    "created_utc": 1619230501.0,
                                    "replies": [
                                        {
                                            "body": "Idk maybe. The dude is nuts.",
                                            "author": "Fair_Meal1725",
                                            "id": "gvn0eaj",
                                            "parent_id": "t1_gvn094y",
                                            "score": 9,
                                            "created_utc": 1619230587.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                                                    "author": "Mr_Curious_Cat",
                                                    "id": "gvn4q5s",
                                                    "parent_id": "t1_gvn0eaj",
                                                    "score": 8,
                                                    "created_utc": 1619233172.0,
                                                    "replies": [
                                                        {
                                                            "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                                            "author": "Fair_Meal1725",
                                                            "id": "gvn6aa4",
                                                            "parent_id": "t1_gvn4q5s",
                                                            "score": 8,
                                                            "created_utc": 1619234141.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                                                    "author": "Mr_Curious_Cat",
                                                                    "id": "gvn6glh",
                                                                    "parent_id": "t1_gvn6aa4",
                                                                    "score": 3,
                                                                    "created_utc": 1619234250.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "🫂",
                                                                            "author": "Fair_Meal1725",
                                                                            "id": "gvn6j8v",
                                                                            "parent_id": "t1_gvn6glh",
                                                                            "score": 2,
                                                                            "created_utc": 1619234295.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
                                    "author": null,
                                    "id": "gvnuun9",
                                    "parent_id": "t1_gvn02he",
                                    "score": 5,
                                    "created_utc": 1619253802.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Please get PREP , not sure what it’s called in your country just in case you’ve been exposed to HIV & AIDS. It’s most effective when taken within a 72 hour period.\n\nGo to your local clinic and tell them you’ve been exposed .  Also get a std and sti screening .\nAnd get a morning after pill , remember it only works if you have not ovulated. \n\nPLEASE DO THESE THINGS AS SOON AS YOU READ THIS MESSAGE !!!!",
                    "author": "Momotheblack",
                    "id": "gvntcio",
                    "parent_id": "t1_gvmz9km",
                    "score": 8,
                    "created_utc": 1619252308.0,
                    "replies": []
                },
                {
                    "body": "That's called stealthing and it's rape. It's illegal",
                    "author": null,
                    "id": "gvnuog9",
                    "parent_id": "t1_gvmz9km",
                    "score": 5,
                    "created_utc": 1619253630.0,
                    "replies": []
                },
                {
                    "body": "oh damn...yea, i recently came across that forum where johns brag about getting on SA and 'creaming' SB's. I would wait the 14 days, and go get check for STDs. Another reason why now i'm hesitant to even get on SA.",
                    "author": "MiLocavida",
                    "id": "gvp2sgp",
                    "parent_id": "t1_gvmz9km",
                    "score": 1,
                    "created_utc": 1619271371.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not consensual if you consent to sex with condom but the guy takes it off without mid act.\n\nBut I also totally understand not wanting to do anything about it, like report it, because there’s a point where it just seems like more hassle than it’s worth and could end up ruining your life instead. It sucks.",
            "author": "fakemoose",
            "id": "gvn6rbb",
            "parent_id": "t1_gvmx3d2",
            "score": 8,
            "created_utc": 1619234436.0,
            "replies": []
        },
        {
            "body": "No. Completely different guy.",
            "author": "Fair_Meal1725",
            "id": "gvn2h2x",
            "parent_id": "t1_gvn2fk7",
            "score": 0,
            "created_utc": 1619231820.0,
            "replies": []
        },
        {
            "body": "I get enthusiastic upfront permission to do anything and everything that I do.\n\nI use safewords even in phone or text conversations.",
            "author": "daddoms",
            "id": "gvn0iro",
            "parent_id": "t1_gvn0dx8",
            "score": 6,
            "created_utc": 1619230662.0,
            "replies": []
        },
        {
            "body": "[A post a while back on it](/r/sugarlifestyleforum/comments/8m3yk8/stealth_sex_what_it_is_amp_how_to_stop_an_asshole/).",
            "author": "SeattleLaserMeteor",
            "id": "gvnoz2d",
            "parent_id": "t1_gvnm976",
            "score": 3,
            "created_utc": 1619248121.0,
            "replies": [
                {
                    "body": "Thanks a million!",
                    "author": "D___Licious",
                    "id": "gvnpbmi",
                    "parent_id": "t1_gvnoz2d",
                    "score": 1,
                    "created_utc": 1619248447.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're welcome, luv.",
            "author": "ShaArt5",
            "id": "gvtruvv",
            "parent_id": "t1_gvsg351",
            "score": 3,
            "created_utc": 1619365048.0,
            "replies": []
        },
        {
            "body": "He choked you and slapped you and stealthed you... any marks? That’s assault. He can try and say that you consented to be choked ... but then would have to admit to striking you in the face and stealthing ... he’d be in a difficult situation.",
            "author": "daddoms",
            "id": "gvmzu7u",
            "parent_id": "t1_gvmz9km",
            "score": 17,
            "created_utc": 1619230255.0,
            "replies": [
                {
                    "body": "The only reason I’m reluctant to report it is because he is alluding to the idea that I am a prostitute & making comments that I'm trying to “blackmail” him.",
                    "author": "Fair_Meal1725",
                    "id": "gvn02he",
                    "parent_id": "t1_gvmzu7u",
                    "score": 12,
                    "created_utc": 1619230393.0,
                    "replies": [
                        {
                            "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
                            "author": "daddoms",
                            "id": "gvn094y",
                            "parent_id": "t1_gvn02he",
                            "score": 15,
                            "created_utc": 1619230501.0,
                            "replies": [
                                {
                                    "body": "Idk maybe. The dude is nuts.",
                                    "author": "Fair_Meal1725",
                                    "id": "gvn0eaj",
                                    "parent_id": "t1_gvn094y",
                                    "score": 9,
                                    "created_utc": 1619230587.0,
                                    "replies": [
                                        {
                                            "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                                            "author": "Mr_Curious_Cat",
                                            "id": "gvn4q5s",
                                            "parent_id": "t1_gvn0eaj",
                                            "score": 8,
                                            "created_utc": 1619233172.0,
                                            "replies": [
                                                {
                                                    "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                                    "author": "Fair_Meal1725",
                                                    "id": "gvn6aa4",
                                                    "parent_id": "t1_gvn4q5s",
                                                    "score": 8,
                                                    "created_utc": 1619234141.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                                            "author": "Mr_Curious_Cat",
                                                            "id": "gvn6glh",
                                                            "parent_id": "t1_gvn6aa4",
                                                            "score": 3,
                                                            "created_utc": 1619234250.0,
                                                            "replies": [
                                                                {
                                                                    "body": "🫂",
                                                                    "author": "Fair_Meal1725",
                                                                    "id": "gvn6j8v",
                                                                    "parent_id": "t1_gvn6glh",
                                                                    "score": 2,
                                                                    "created_utc": 1619234295.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
                            "author": null,
                            "id": "gvnuun9",
                            "parent_id": "t1_gvn02he",
                            "score": 5,
                            "created_utc": 1619253802.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please get PREP , not sure what it’s called in your country just in case you’ve been exposed to HIV & AIDS. It’s most effective when taken within a 72 hour period.\n\nGo to your local clinic and tell them you’ve been exposed .  Also get a std and sti screening .\nAnd get a morning after pill , remember it only works if you have not ovulated. \n\nPLEASE DO THESE THINGS AS SOON AS YOU READ THIS MESSAGE !!!!",
            "author": "Momotheblack",
            "id": "gvntcio",
            "parent_id": "t1_gvmz9km",
            "score": 8,
            "created_utc": 1619252308.0,
            "replies": []
        },
        {
            "body": "That's called stealthing and it's rape. It's illegal",
            "author": null,
            "id": "gvnuog9",
            "parent_id": "t1_gvmz9km",
            "score": 5,
            "created_utc": 1619253630.0,
            "replies": []
        },
        {
            "body": "oh damn...yea, i recently came across that forum where johns brag about getting on SA and 'creaming' SB's. I would wait the 14 days, and go get check for STDs. Another reason why now i'm hesitant to even get on SA.",
            "author": "MiLocavida",
            "id": "gvp2sgp",
            "parent_id": "t1_gvmz9km",
            "score": 1,
            "created_utc": 1619271371.0,
            "replies": []
        },
        {
            "body": "Thanks a million!",
            "author": "D___Licious",
            "id": "gvnpbmi",
            "parent_id": "t1_gvnoz2d",
            "score": 1,
            "created_utc": 1619248447.0,
            "replies": []
        },
        {
            "body": "The only reason I’m reluctant to report it is because he is alluding to the idea that I am a prostitute & making comments that I'm trying to “blackmail” him.",
            "author": "Fair_Meal1725",
            "id": "gvn02he",
            "parent_id": "t1_gvmzu7u",
            "score": 12,
            "created_utc": 1619230393.0,
            "replies": [
                {
                    "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
                    "author": "daddoms",
                    "id": "gvn094y",
                    "parent_id": "t1_gvn02he",
                    "score": 15,
                    "created_utc": 1619230501.0,
                    "replies": [
                        {
                            "body": "Idk maybe. The dude is nuts.",
                            "author": "Fair_Meal1725",
                            "id": "gvn0eaj",
                            "parent_id": "t1_gvn094y",
                            "score": 9,
                            "created_utc": 1619230587.0,
                            "replies": [
                                {
                                    "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                                    "author": "Mr_Curious_Cat",
                                    "id": "gvn4q5s",
                                    "parent_id": "t1_gvn0eaj",
                                    "score": 8,
                                    "created_utc": 1619233172.0,
                                    "replies": [
                                        {
                                            "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                            "author": "Fair_Meal1725",
                                            "id": "gvn6aa4",
                                            "parent_id": "t1_gvn4q5s",
                                            "score": 8,
                                            "created_utc": 1619234141.0,
                                            "replies": [
                                                {
                                                    "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                                    "author": "Mr_Curious_Cat",
                                                    "id": "gvn6glh",
                                                    "parent_id": "t1_gvn6aa4",
                                                    "score": 3,
                                                    "created_utc": 1619234250.0,
                                                    "replies": [
                                                        {
                                                            "body": "🫂",
                                                            "author": "Fair_Meal1725",
                                                            "id": "gvn6j8v",
                                                            "parent_id": "t1_gvn6glh",
                                                            "score": 2,
                                                            "created_utc": 1619234295.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
                    "author": null,
                    "id": "gvnuun9",
                    "parent_id": "t1_gvn02he",
                    "score": 5,
                    "created_utc": 1619253802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you think he would admit to solicitation? He probably has a lot to lose.",
            "author": "daddoms",
            "id": "gvn094y",
            "parent_id": "t1_gvn02he",
            "score": 15,
            "created_utc": 1619230501.0,
            "replies": [
                {
                    "body": "Idk maybe. The dude is nuts.",
                    "author": "Fair_Meal1725",
                    "id": "gvn0eaj",
                    "parent_id": "t1_gvn094y",
                    "score": 9,
                    "created_utc": 1619230587.0,
                    "replies": [
                        {
                            "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                            "author": "Mr_Curious_Cat",
                            "id": "gvn4q5s",
                            "parent_id": "t1_gvn0eaj",
                            "score": 8,
                            "created_utc": 1619233172.0,
                            "replies": [
                                {
                                    "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                                    "author": "Fair_Meal1725",
                                    "id": "gvn6aa4",
                                    "parent_id": "t1_gvn4q5s",
                                    "score": 8,
                                    "created_utc": 1619234141.0,
                                    "replies": [
                                        {
                                            "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                            "author": "Mr_Curious_Cat",
                                            "id": "gvn6glh",
                                            "parent_id": "t1_gvn6aa4",
                                            "score": 3,
                                            "created_utc": 1619234250.0,
                                            "replies": [
                                                {
                                                    "body": "🫂",
                                                    "author": "Fair_Meal1725",
                                                    "id": "gvn6j8v",
                                                    "parent_id": "t1_gvn6glh",
                                                    "score": 2,
                                                    "created_utc": 1619234295.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You went on a date with someone and they slapped you and stealthed you. The burden of proof is on him about if you were enacting prostitution, but at least go get a rape kit done now. Don't bathe or shower.",
            "author": null,
            "id": "gvnuun9",
            "parent_id": "t1_gvn02he",
            "score": 5,
            "created_utc": 1619253802.0,
            "replies": []
        },
        {
            "body": "Idk maybe. The dude is nuts.",
            "author": "Fair_Meal1725",
            "id": "gvn0eaj",
            "parent_id": "t1_gvn094y",
            "score": 9,
            "created_utc": 1619230587.0,
            "replies": [
                {
                    "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
                    "author": "Mr_Curious_Cat",
                    "id": "gvn4q5s",
                    "parent_id": "t1_gvn0eaj",
                    "score": 8,
                    "created_utc": 1619233172.0,
                    "replies": [
                        {
                            "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                            "author": "Fair_Meal1725",
                            "id": "gvn6aa4",
                            "parent_id": "t1_gvn4q5s",
                            "score": 8,
                            "created_utc": 1619234141.0,
                            "replies": [
                                {
                                    "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                                    "author": "Mr_Curious_Cat",
                                    "id": "gvn6glh",
                                    "parent_id": "t1_gvn6aa4",
                                    "score": 3,
                                    "created_utc": 1619234250.0,
                                    "replies": [
                                        {
                                            "body": "🫂",
                                            "author": "Fair_Meal1725",
                                            "id": "gvn6j8v",
                                            "parent_id": "t1_gvn6glh",
                                            "score": 2,
                                            "created_utc": 1619234295.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to say but you don't have much of a leg to stand on legally. While his actioms were all kinds of wrong you probably wouldn't do well in court. \n\nFirst the fact you asked him to choke you, he can use that to make the claim that he thought you wanted more rough stuff. Whether anyone agrees he's right or wrong, it is at least a reasonable claim, especially since you said he only did it once and you didn't correct him. \n\nSecond, stealthing (SADLY) is often not illegal and it is impossible to prove unless you have a video tape. He xan always claim you agreed to it. \n\nLastly, it would be very easy for him to pin you as a prostitute.\n\nI want you to know, I'm not trying to blame you or make you feel in any way like this wasn't a big deal. He was fucked up in numerous ways, and you were done several wrongs. I'm sorry for you. \nBut all thses people saying to call the cops...do whatever helps you feel better but I'm just warning you a head of time, there will probably be little to nothing done.",
            "author": "Mr_Curious_Cat",
            "id": "gvn4q5s",
            "parent_id": "t1_gvn0eaj",
            "score": 8,
            "created_utc": 1619233172.0,
            "replies": [
                {
                    "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
                    "author": "Fair_Meal1725",
                    "id": "gvn6aa4",
                    "parent_id": "t1_gvn4q5s",
                    "score": 8,
                    "created_utc": 1619234141.0,
                    "replies": [
                        {
                            "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                            "author": "Mr_Curious_Cat",
                            "id": "gvn6glh",
                            "parent_id": "t1_gvn6aa4",
                            "score": 3,
                            "created_utc": 1619234250.0,
                            "replies": [
                                {
                                    "body": "🫂",
                                    "author": "Fair_Meal1725",
                                    "id": "gvn6j8v",
                                    "parent_id": "t1_gvn6glh",
                                    "score": 2,
                                    "created_utc": 1619234295.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I appreciate the rationalization from a legal perspective. I've decided not to do anything about it because it’s not worth my time nor the risk. Thanks for validating my decision.",
            "author": "Fair_Meal1725",
            "id": "gvn6aa4",
            "parent_id": "t1_gvn4q5s",
            "score": 8,
            "created_utc": 1619234141.0,
            "replies": [
                {
                    "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
                    "author": "Mr_Curious_Cat",
                    "id": "gvn6glh",
                    "parent_id": "t1_gvn6aa4",
                    "score": 3,
                    "created_utc": 1619234250.0,
                    "replies": [
                        {
                            "body": "🫂",
                            "author": "Fair_Meal1725",
                            "id": "gvn6j8v",
                            "parent_id": "t1_gvn6glh",
                            "score": 2,
                            "created_utc": 1619234295.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm glad I could help. I assume you've already planned on it, but get in contact with a doctor quickly fir an std screening, since he didn't use a condom. \n\nGood luck, I hope your future POT are better. Wishing you the best.",
            "author": "Mr_Curious_Cat",
            "id": "gvn6glh",
            "parent_id": "t1_gvn6aa4",
            "score": 3,
            "created_utc": 1619234250.0,
            "replies": [
                {
                    "body": "🫂",
                    "author": "Fair_Meal1725",
                    "id": "gvn6j8v",
                    "parent_id": "t1_gvn6glh",
                    "score": 2,
                    "created_utc": 1619234295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🫂",
            "author": "Fair_Meal1725",
            "id": "gvn6j8v",
            "parent_id": "t1_gvn6glh",
            "score": 2,
            "created_utc": 1619234295.0,
            "replies": []
        }
    ]
}