{
    "title": "Low content rant - Dad’s letting down their daughters😡",
    "post_id": "nlw82u",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nlw82u/low_content_rant_dads_letting_down_their_daughters/",
    "author": "MrBuzzard",
    "body": "I know this isn’t rant and rave day, but I am cranky, so here goes.   Almost everyone I have met in this lifestyle, has had a troubled relationship with their Dad.  Including current SB who comes from a broken home.  Her Dad reneges on commitments over-and-over again.  It is tough to watch how this hurts her.  She tries to pretend it is no big deal, but I know her well enough to see the truth.\n\nThe two of them had really cool plans for tomorrow, and of course he cancelled.  She was so excited about the plan.  I found this out, because she asked me in the sweetest way possible, if we could spend time together tomorrow. I love seeing her,  but in this case I wish her jackass of a Dad would honor a damn commitment to her once in a while.  Even if it would mean me being on my own tomorrow.  \n\nTears me up to see her hurt over and over again.   I make it a point to NEVER let her down or back out of seeing her when we set something up.  The appreciation and affection I get back is something else.  \n\nDads - try to be great to your daughters!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nlw82u/low_content_rant_dads_letting_down_their_daughters/",
    "score": 130,
    "upvote_ratio": 0.91,
    "created_utc": 1622077611.0,
    "num_comments": 68,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "He’s a fucking turd and she needs therapy to break out of that cycle and get as fucking far away from him as possible. \n\nUseless POS. Can you tell, I’m cranky too",
            "author": "sugarandaview",
            "id": "gzla37r",
            "parent_id": "t3_nlw82u",
            "score": 46,
            "created_utc": 1622081823.0,
            "replies": [
                {
                    "body": "Could you be a little more clear on what you think?  You sound a little on the fence😎",
                    "author": "MrBuzzard",
                    "id": "gzla8sx",
                    "parent_id": "t1_gzla37r",
                    "score": 19,
                    "created_utc": 1622081907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's something seldom discussed here.  When an SD fills that broader role between being an affectionate cheerleader/coach and sensitive lover. \n\nMy foundational rule is that I want the relationship to be something that is looked back upon in 20 years as a positive influence.  Yes it was crazy, but it was perfect for the time.",
            "author": "pinotandsugar",
            "id": "gzlmg1a",
            "parent_id": "t3_nlw82u",
            "score": 28,
            "created_utc": 1622089025.0,
            "replies": [
                {
                    "body": "Additionally I hope I change her view on how a man should act toward her.",
                    "author": "sdburner",
                    "id": "gzne6lo",
                    "parent_id": "t1_gzlmg1a",
                    "score": 8,
                    "created_utc": 1622130915.0,
                    "replies": [
                        {
                            "body": "Exactly............Actions speak louder than words and while she many not talk about it or even realize it  you will most likely have an impact.",
                            "author": "pinotandsugar",
                            "id": "gzni76v",
                            "parent_id": "t1_gzne6lo",
                            "score": 5,
                            "created_utc": 1622132639.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzpdua2",
                            "parent_id": "t1_gzne6lo",
                            "score": 1,
                            "created_utc": 1622163395.0,
                            "replies": [
                                {
                                    "body": "Oblige?",
                                    "author": "sdburner",
                                    "id": "gzpk4vc",
                                    "parent_id": "t1_gzpdua2",
                                    "score": 1,
                                    "created_utc": 1622166711.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Same for me. I would like to be remembered as an awesome time and a good experience.",
                    "author": "sdburner",
                    "id": "gzne3tv",
                    "parent_id": "t1_gzlmg1a",
                    "score": 2,
                    "created_utc": 1622130882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As another girl from a broken home, I feel her pain.  If I had to write a book about my life so far, 90% of it would cover how my dad destroyed any chance I had to be a normal person (think: emotional neglect and domestic violence, resulting in CPTSD). And I didn’t realize how all that affected me until I started looking around at all the other fathers and daughters and wondered what I was missing. I’ll be the first to say that I’m bitter and envious because no matter how hard I try to fit the pieces together I will never have a healthy understanding of relationships. So take it from me: tell your daughter that you love her. And thank you for posting this. It’s nice to see someone address the real problem instead of just making fun of women for having “daddy issues”.",
            "author": null,
            "id": "gzlmqyl",
            "parent_id": "t3_nlw82u",
            "score": 28,
            "created_utc": 1622089223.0,
            "replies": [
                {
                    "body": "I feel you. I resolved my problems with my father, but we don’t speak. Even when I was a little girl, a healthy father-daughter dynamic portrayed in tv always made me sad and wistful! One of my lady friends has a great relationship with her pop and her parents are still together and I always wonder what that must feel like when I see them all together.",
                    "author": null,
                    "id": "gzm6fex",
                    "parent_id": "t1_gzlmqyl",
                    "score": 8,
                    "created_utc": 1622105145.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I totally understand her. It’s the same way with my dad. He always prefers to be with friends rather than spend time with me or my sister. I will never forget that on my graduation day, he only brought me flowers and I really wanted to be with him that day and I passed by his house and I could see him having a laugh with his friends and I cried for hours. It sucks but I can’t do anything. That’s probably why I have daddy issues.",
            "author": null,
            "id": "gzl8y5d",
            "parent_id": "t3_nlw82u",
            "score": 35,
            "created_utc": 1622081192.0,
            "replies": [
                {
                    "body": "I gave you a like, not because of what happened to you,  but because I have at least a little understanding on how this impacted you.  Thanks for the reply.",
                    "author": "MrBuzzard",
                    "id": "gzl9ui0",
                    "parent_id": "t1_gzl8y5d",
                    "score": 13,
                    "created_utc": 1622081690.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzmghqt",
                    "parent_id": "t1_gzl8y5d",
                    "score": 6,
                    "created_utc": 1622114081.0,
                    "replies": [
                        {
                            "body": "Thank you so much for the book recommendation, I think it’ll be very useful to me.",
                            "author": null,
                            "id": "gzngktt",
                            "parent_id": "t1_gzmghqt",
                            "score": 1,
                            "created_utc": 1622131947.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I guess I’m in the minority but I have a great relationship with my dad, he raised me and my sisters as a single father. I don’t like the notion that all SBs have ‘daddy issues’ and that’s the only way someone would be attracted to older men. Some of us just enjoy this lifestyle. \n\nI do however think that being a “daddy’s girl” and being used to being taken care of by a man may have subconsciously drawn me to the sugar bowl.",
            "author": "ma-ri-ah",
            "id": "gzmpeo8",
            "parent_id": "t3_nlw82u",
            "score": 14,
            "created_utc": 1622119602.0,
            "replies": []
        },
        {
            "body": "Speaking for myself, I don’t have daddy issues, but I have a problem with my dad’s character. I turned to sugaring because a) I hit a wall of boredom dating men my age and b) the value I was adding to the life of men I dated far exceeded what they were adding to mine and I was generally disappointed with the dynamic/sex/being arm candy. \n\nYes daddy issues exist but you’ll find that in all types of dating, not just sugar. I’d think the ladies who habitually wind up with scummy boyfriends probably have more tangible dad issues than women who decided that they should be compensated for their time with men.",
            "author": null,
            "id": "gzm7d8d",
            "parent_id": "t3_nlw82u",
            "score": 11,
            "created_utc": 1622106058.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzl7d6h",
            "parent_id": "t3_nlw82u",
            "score": 21,
            "created_utc": 1622080108.0,
            "replies": [
                {
                    "body": "I am for sure seeing her tomorrow, and have told her how excited I am to see her.  \n\nThanks for your your other thoughts.  I definitely was not trying to drag out the “Daddy Issues” cliche.  I have a daughter myself, and could never imagine treating her the way this guy does.  Pisses me off.",
                    "author": "MrBuzzard",
                    "id": "gzl8qiz",
                    "parent_id": "t1_gzl7d6h",
                    "score": 8,
                    "created_utc": 1622081067.0,
                    "replies": [
                        {
                            "body": "Just curious. How will you feel if your daughter decides to become a SB?",
                            "author": "No-Reveal8042",
                            "id": "gzlylml",
                            "parent_id": "t1_gzl8qiz",
                            "score": 2,
                            "created_utc": 1622097934.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gzmgse0",
                                    "parent_id": "t1_gzlylml",
                                    "score": 1,
                                    "created_utc": 1622114294.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gzn4imz",
                                            "parent_id": "t1_gzmgse0",
                                            "score": 4,
                                            "created_utc": 1622126792.0,
                                            "replies": [
                                                {
                                                    "body": "It also implies something innately wrong with jointing the sugar community as a woman. I wonder, if it were a son, if the sentiments would be the same.",
                                                    "author": "ashwy16",
                                                    "id": "gzn6lbq",
                                                    "parent_id": "t1_gzn4imz",
                                                    "score": 3,
                                                    "created_utc": 1622127692.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gznl8he",
                                                    "parent_id": "t1_gzn4imz",
                                                    "score": 0,
                                                    "created_utc": 1622133937.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gznmtbk",
                                                            "parent_id": "t1_gznl8he",
                                                            "score": 5,
                                                            "created_utc": 1622134601.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gzo90dp",
                                                                    "parent_id": "t1_gznmtbk",
                                                                    "score": 1,
                                                                    "created_utc": 1622143963.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                                                                            "author": "jacknjilled",
                                                                            "id": "gzpt18b",
                                                                            "parent_id": "t1_gzo90dp",
                                                                            "score": 2,
                                                                            "created_utc": 1622171494.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzn5jtd",
                    "parent_id": "t1_gzl7d6h",
                    "score": 4,
                    "created_utc": 1622127241.0,
                    "replies": []
                },
                {
                    "body": "Totally agree with all of this!!",
                    "author": null,
                    "id": "gzla5on",
                    "parent_id": "t1_gzl7d6h",
                    "score": 2,
                    "created_utc": 1622081860.0,
                    "replies": []
                },
                {
                    "body": "A few have a great relationship with their father but it must less than 1%. Out of hundreds of POTs I've met, I've only met one.",
                    "author": "SLFSLF2021",
                    "id": "gzlf1qj",
                    "parent_id": "t1_gzl7d6h",
                    "score": 0,
                    "created_utc": 1622084562.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzlgq2x",
                            "parent_id": "t1_gzlf1qj",
                            "score": 4,
                            "created_utc": 1622085541.0,
                            "replies": [
                                {
                                    "body": "Maybe he has a selection bias issue lol",
                                    "author": null,
                                    "id": "gzmxmgr",
                                    "parent_id": "t1_gzlgq2x",
                                    "score": 6,
                                    "created_utc": 1622123713.0,
                                    "replies": [
                                        {
                                            "body": "Hm, it's possible - I do have a particular look I go for - the blonde, all-American cheerleader types who are really attractive. But kind of doubt it.\n\nAlmost every SBI've met have an absent father or don't get along with him. As I said, only one had a warm, stable relationship with her father - getting together often, going on fishing trips with him, being able to rely on him.",
                                            "author": "SLFSLF2021",
                                            "id": "gzn6lgr",
                                            "parent_id": "t1_gzmxmgr",
                                            "score": -1,
                                            "created_utc": 1622127694.0,
                                            "replies": [
                                                {
                                                    "body": "That says more about men these days than women . Why focus on the victims instead of realizing that a lot of men are awful people ? If you were talking to a bunch of young boys who suffered from their mom I think the outrage would be focused on the moms",
                                                    "author": "Disastrous_Author638",
                                                    "id": "gzndjfo",
                                                    "parent_id": "t1_gzn6lgr",
                                                    "score": 5,
                                                    "created_utc": 1622130674.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think I have Mommy issues. She was a boring, drunk ghost. Slept a lot...took lots of naps lol. My dad is amiable enough. Still good looking and fairly talented. Kind of dumb though. Sometimes he was around. It could have been worse.",
            "author": "sunlightonthewater",
            "id": "gzljsp0",
            "parent_id": "t3_nlw82u",
            "score": 5,
            "created_utc": 1622087354.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzm7j58",
            "parent_id": "t3_nlw82u",
            "score": 4,
            "created_utc": 1622106217.0,
            "replies": [
                {
                    "body": "I'm a \"daddy's girl\".  I was totally spoiled by my dad and prefer older men...always have.",
                    "author": "naughtychick9999",
                    "id": "gzmjfrz",
                    "parent_id": "t1_gzm7j58",
                    "score": 4,
                    "created_utc": 1622116093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is, oddly, not my experience.  The SBs I've met tend to mostly have good relationships with their parents.  Maybe this says more about the type of SB I prefer, as I would guess there are plenty of SBs out there who can relate to this post...",
            "author": "Gemini-Fox",
            "id": "gzn685w",
            "parent_id": "t3_nlw82u",
            "score": 5,
            "created_utc": 1622127534.0,
            "replies": []
        },
        {
            "body": "I dont think I have had an SGF nor SB who had a good or present father growing up. Not one. I have also noticed this trend with the trans women I have dated  (a gf, and sgf, and a pot / will they won't they type), none had great or present fathers either. \n\nIronically my mom bailed when I was about 12, and I was raised by a single father (who travelled a bit) and with help from my grandparents. So I didn't really have my mom for my latter childhood. Did have my grandmothers though. So I know there were / are some issues there... lol",
            "author": "BigBearSD",
            "id": "gzly9dl",
            "parent_id": "t3_nlw82u",
            "score": 3,
            "created_utc": 1622097652.0,
            "replies": []
        },
        {
            "body": "I haven’t had the same experience as most SDs here. Yes some people I have had relationships with have had “daddy issues” but certainly not most. My reality certainly has not reflected the cliche",
            "author": "thesuitelife2010",
            "id": "gzmtf1z",
            "parent_id": "t3_nlw82u",
            "score": 4,
            "created_utc": 1622121693.0,
            "replies": []
        },
        {
            "body": "Well a lot of men suck . We agree ! It’s why us gals need to be paid to hang out with some of you",
            "author": "Disastrous_Author638",
            "id": "gzlgecd",
            "parent_id": "t3_nlw82u",
            "score": 9,
            "created_utc": 1622085350.0,
            "replies": []
        },
        {
            "body": "There are jerk dads out there, but one counter example (and if you still stalk this forum A, feel free to clarify if I get a detail wrong by DM or post).  A dear friend of a SB was super close with her dad.  Her dad was notably supportive of her friends, both male and female, and was good when she started sleeping with some of those friends.  Her dad was notably older than her mom, possibly one factor in my dear friend having a legit thing for older guys sometimes.  She also dated folks her own age.  She told me stories of the older guy she really should NOT have dated, and the older guy she wanted to bang but had stopped herself, etc.  We were close and shared most stories, she quite possibly heard every one of mine over time.\n\nNow, there was some complexity.  Her dad had a job where he was physically absent for long stretches of time.  Her mom was the train wreck, on the spectrum and a super high achiever in a couple areas who did one of the Classic Bad Things.  My dear friend has a notable hip to waist ratio, something I and others found objectively attractive.  My dear friend's mother, when she was twelve, began calling her \"fat\" and literally withholding food when her beloved dad was away.  That did a bit of a number on her.  She felt unattractive, and surprised when other men and women hit on her.  \n\nOn the core point, though, I agree whole heartedly!  If you have a kid, do the best you can by them.  Always.",
            "author": "NCtriadSD",
            "id": "gzmz6gn",
            "parent_id": "t3_nlw82u",
            "score": 3,
            "created_utc": 1622124422.0,
            "replies": [
                {
                    "body": "That sounds like my mom.",
                    "author": null,
                    "id": "gzn7ube",
                    "parent_id": "t1_gzmz6gn",
                    "score": 2,
                    "created_utc": 1622128235.0,
                    "replies": [
                        {
                            "body": "Sadly, I do not think this is super uncommon.  As a man who enjoys a reasonable range of body types, I have been pleasantly surprised at some ladies' appreciation at being appreciated for the lack of better terms.  Some ladies who do not have a top 0.5% bikini image can be amazing good sugar partners in part because someone was a jerk to them.  Do not overlook people like this when considering a great partner!",
                            "author": "NCtriadSD",
                            "id": "gzn8ymn",
                            "parent_id": "t1_gzn7ube",
                            "score": 1,
                            "created_utc": 1622128720.0,
                            "replies": [
                                {
                                    "body": "Prey on insecurities??? Lol",
                                    "author": "Disastrous_Author638",
                                    "id": "gzndv02",
                                    "parent_id": "t1_gzn8ymn",
                                    "score": 2,
                                    "created_utc": 1622130779.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have learned a lot about how to be toward my daughter while in the bowl. I cannot imagine not talking to my kids at any point in my life. two I have met had amazing relationships with their parents. Coming from a broken home with an absent father, it makes me jealous seeing what a great family can be. Also makes me feel bad that my kids will not get that experience.",
            "author": "sdburner",
            "id": "gznek50",
            "parent_id": "t3_nlw82u",
            "score": 3,
            "created_utc": 1622131074.0,
            "replies": []
        },
        {
            "body": "I don’t have a troubled relationship with my dad. The only trouble we have had is when he asked me straight up “what are you, a sugar baby?” In a demeaning way when he definitely knew the older man I was dating was my SD. Lmfao. Oh well. \n\nSorry dad!",
            "author": "Federal-Strawberry-8",
            "id": "gznxa98",
            "parent_id": "t3_nlw82u",
            "score": 3,
            "created_utc": 1622138959.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzlkq0q",
            "parent_id": "t3_nlw82u",
            "score": 7,
            "created_utc": 1622087925.0,
            "replies": [
                {
                    "body": "Don’t understand why you need to be a jerk about this.  But, hey if it makes you feel better about yourself, then fill yer boots.",
                    "author": "MrBuzzard",
                    "id": "gzlo037",
                    "parent_id": "t1_gzlkq0q",
                    "score": 3,
                    "created_utc": 1622090043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rough him up.  Verbally, of course.",
            "author": "TY2022",
            "id": "gzl6g29",
            "parent_id": "t3_nlw82u",
            "score": 4,
            "created_utc": 1622079538.0,
            "replies": []
        },
        {
            "body": "From the SB pov, it’s great that you’re being there for her. I think people sometimes forget how wonderful sugar relationships can be for healing and growth (though that should never be the main intention ofc), because most set a precedent of communication and openness that you don’t get in many other (esp younger) relationships.",
            "author": "ashwy16",
            "id": "gzn6e0r",
            "parent_id": "t3_nlw82u",
            "score": 2,
            "created_utc": 1622127605.0,
            "replies": []
        },
        {
            "body": "It's sadly a common thread in most sex worker industries, whether sugar baby, stripper, prostitute, whatever. You just gotta be as good of a mentor as you can for them.",
            "author": "SDNH79",
            "id": "gzn9bdr",
            "parent_id": "t3_nlw82u",
            "score": 2,
            "created_utc": 1622128871.0,
            "replies": []
        },
        {
            "body": "Oof. The issues our parents can give us.. \n\nI think this is also a generational thing. Everyone was more hush hush about familial issues when my mother was young, so her traumas left untreated impacted my upbringing. I am all for therapy and figuring your life out, so I would hope that when (if) I have children, I’ll break the cycle. One of the big things I felt when I left my fiancé was “this man would be an (unintentionally) crappy father. I can’t procreate with him”",
            "author": "Cdnsugarr",
            "id": "gzngwiy",
            "parent_id": "t3_nlw82u",
            "score": 2,
            "created_utc": 1622132086.0,
            "replies": []
        },
        {
            "body": "My dad's dead,so basically that role in my life is gone all together,I'm not accepting any type of step parent or anyone trying to be my dad,the least I can do is live and be proud of myself",
            "author": "ThrOW_AwYfor_ReDDIt",
            "id": "gzo6ldg",
            "parent_id": "t3_nlw82u",
            "score": 2,
            "created_utc": 1622142914.0,
            "replies": []
        },
        {
            "body": "Haven't really seen it so much in sugaring. But I know in sex work more broadly the number of girls who were adopted/foster care was absurdly high. This was mostly survival/addiction fueled SW tho. \n\nI've seen some daddy issues in sugaring, but it's usually pretty normal stuff, ime. Like most people had a rough relationship with one of their parents.\n\nCurious, how old is she? Usually I don't see spending time with dad being so essential to an adult's well-being.\n\nEdit: you know what, now that I think more about it, two SBs I was pretty close to were adopted as well. One by a horrifically abusive family and one by a really supportive one.",
            "author": "OpenAirMarket901",
            "id": "gzl4av4",
            "parent_id": "t3_nlw82u",
            "score": 4,
            "created_utc": 1622078464.0,
            "replies": [
                {
                    "body": "She is 23.  They don’t see each other too often.  But it means a lot of to her, when she does see him.  I have known her since she was 21, and have seen her let down several times.",
                    "author": "MrBuzzard",
                    "id": "gzl5hja",
                    "parent_id": "t1_gzl4av4",
                    "score": 5,
                    "created_utc": 1622079056.0,
                    "replies": [
                        {
                            "body": "Do you know if he raised her? Or were her parents split and mom had custody? \n\nI can see if it's more like a pattern of emotional neglect stemming from childhood. \n\nAlways sucks to see someone you care about hurting and not be able to do much of anything.",
                            "author": "OpenAirMarket901",
                            "id": "gzl5ua6",
                            "parent_id": "t1_gzl5hja",
                            "score": 1,
                            "created_utc": 1622079235.0,
                            "replies": [
                                {
                                    "body": "Sounds like a mess.  She bounced from parent to parent and back again.  As if there was no real custody.  She has said a couple of times that she doesn’t understand why people have kids, when they never really wanted them in the first place.  Ya, definitely emotional neglect.  She was the youngest, and for whatever reason ended up with the most unstable situation.",
                                    "author": "MrBuzzard",
                                    "id": "gzl80k6",
                                    "parent_id": "t1_gzl5ua6",
                                    "score": 3,
                                    "created_utc": 1622080574.0,
                                    "replies": [
                                        {
                                            "body": "That sounds more like an upbringing issue than a 'daddy issue' as there are no specifics about the mother figure. Confirmation bias is a thing.\n\nStill, kind of you to care for her. When you finish the relationship, be mindful that it will affect her in a bad way.",
                                            "author": "AnSteall",
                                            "id": "gzlykhs",
                                            "parent_id": "t1_gzl80k6",
                                            "score": 3,
                                            "created_utc": 1622097908.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Uh no! You seem to have daughter issues and you aren’t their father.",
            "author": "daddoms",
            "id": "gzlguuj",
            "parent_id": "t3_nlw82u",
            "score": 1,
            "created_utc": 1622085615.0,
            "replies": [
                {
                    "body": "Pfff",
                    "author": "MrBuzzard",
                    "id": "gzliqyi",
                    "parent_id": "t1_gzlguuj",
                    "score": 1,
                    "created_utc": 1622086724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My own experience unfortunately has told me that most women in the bowl did not have a proper father figure growing up. I am sure my experiences may be unique but it’s amazing how often (and always) that was the case.",
            "author": null,
            "id": "gzl8bpg",
            "parent_id": "t3_nlw82u",
            "score": 3,
            "created_utc": 1622080808.0,
            "replies": [
                {
                    "body": "Well my three main East coast SBs (including the 1%er from CA) had pretty normal families. The LT one is darn close to dad, though she did miss him as a child while he was on military deployment in Asia for usual length. She was highly sexed since teenage years and super horny in college. So rather than daddy issues she is just very sex positive and, equally to the point, highly motivated to make money. She likes to be financially set to spend like the college peers “who never had to worry about expenses since parents bankrolled their every desire”. She’s quite normal coming from that comfortable but tighter middle of the middle class, with three children going to college.",
                    "author": "jacknjilled",
                    "id": "gzli9a7",
                    "parent_id": "t1_gzl8bpg",
                    "score": 7,
                    "created_utc": 1622086434.0,
                    "replies": [
                        {
                            "body": "Interesting that she needs to be in the bowl because she is sex positive! I get the financial part of course.",
                            "author": null,
                            "id": "gzmi90g",
                            "parent_id": "t1_gzli9a7",
                            "score": 2,
                            "created_utc": 1622115306.0,
                            "replies": [
                                {
                                    "body": "Hmm on the “needs to be” ... she says that having sex regularly is a requirement for her. I think that has everything to do with her other admission that for years she was quite the hoe (whatever the reasons for that); and she now feels she has put that period behind her at age 25 next month. Over the course of her college career she was a recruited D One athlete and champion, supported very much by family including father. She started sugaring after breaking up with LT BF who didn’t give her enough space and was cruel at times. As long as she was going to have sex in the future might as well get paid for it. She doesn’t claim any history of fancying or dating older men, even if she may have fucked the occasional M +5-10 years older. I summed all this up as “being sex positive”, showing imho much more follow through and less inhibitions than women of prior generations, and being able to manage the insinuation that sugaring is sex work or prostitution by another name, and so to be shunned. Again, in my experience, didn’t see daddy issues but thought this alternative best explained willingness of several young women to sleep with ~60 yo me. Another Ivy D One athlete, from a prominent CA family, wanted the sex and thrill of it, and spending money not from family, as opposed to a campus BF/time drain or a reputation for sex besmirching a well known family name. Third SB was another athlete from a “small Ivy” and similarly normal family. Come to think of it, if I continue to sugar in future think I’ll stick with college athletes or alumna!",
                                    "author": "jacknjilled",
                                    "id": "gzpr5wa",
                                    "parent_id": "t1_gzmi90g",
                                    "score": 1,
                                    "created_utc": 1622170458.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It is almost 100% for me.  And in one case, the Dad died in a completely freaky and terrible situation.",
                    "author": "MrBuzzard",
                    "id": "gzl93ij",
                    "parent_id": "t1_gzl8bpg",
                    "score": 4,
                    "created_utc": 1622081273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wonder how many SBs have \"Daddy Issues\" and turn to older men as a means to compensate (double entendre intended). I have dated a couple of SBs who said they joined the lifestyle for the money, and due to their \"Daddy issues\".",
            "author": "theend1sn1gh",
            "id": "gzl4lxu",
            "parent_id": "t3_nlw82u",
            "score": 0,
            "created_utc": 1622078615.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzl7moz",
                    "parent_id": "t1_gzl4lxu",
                    "score": 23,
                    "created_utc": 1622080288.0,
                    "replies": [
                        {
                            "body": "I wish I could upvote this a million times!!",
                            "author": "jellyfilling9",
                            "id": "gzlg8hp",
                            "parent_id": "t1_gzl7moz",
                            "score": 4,
                            "created_utc": 1622085256.0,
                            "replies": []
                        },
                        {
                            "body": "More like want to boink their daughter issues, which not acted upon get young SBs to boink. Win-win",
                            "author": "sugarandaview",
                            "id": "gzlabl1",
                            "parent_id": "t1_gzl7moz",
                            "score": 5,
                            "created_utc": 1622081950.0,
                            "replies": []
                        },
                        {
                            "body": "Not many",
                            "author": null,
                            "id": "gzl8een",
                            "parent_id": "t1_gzl7moz",
                            "score": -2,
                            "created_utc": 1622080860.0,
                            "replies": []
                        },
                        {
                            "body": "None",
                            "author": "SLFSLF2021",
                            "id": "gzlf2sr",
                            "parent_id": "t1_gzl7moz",
                            "score": -2,
                            "created_utc": 1622084579.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good advice. But unfortunately divorce often rears it's ugly head and no matter what, kids are impacted by that. Psychologists have opined either to 1) stay in the marriage for the sake of the kids or 2) the opposite. Obviously a brutal home life is a no-go and the kids are better off not being in that toxic soup.  Daughters(and sons) always think Dad left them,so they have feelings of abandonment. Annnd, the girls are looking for that Father figure-hence sugaring. But that often falls in the category \"looking for love in all the wrong places\"",
            "author": "GSSD",
            "id": "gzmlvml",
            "parent_id": "t3_nlw82u",
            "score": 1,
            "created_utc": 1622117588.0,
            "replies": [
                {
                    "body": "My parents are proof that staying in the marriage can screw up your kids worse than a divorce. Also NPD and BPD as parents are like growing up in a refugee camp. Rather than say \"daddy issues\", I think it makes more sense to say many SBs and SDs come from homes with untreated mental illness and antagonistic paternal relationships.",
                    "author": null,
                    "id": "gzn7f8m",
                    "parent_id": "t1_gzmlvml",
                    "score": 3,
                    "created_utc": 1622128053.0,
                    "replies": [
                        {
                            "body": "> antagonistic paternal relationships.\n\nMakes you wonder about the wisdom of marriage.",
                            "author": "GSSD",
                            "id": "gzncdd2",
                            "parent_id": "t1_gzn7f8m",
                            "score": 1,
                            "created_utc": 1622130185.0,
                            "replies": [
                                {
                                    "body": "I really liked one religious leader's take on marriage. They said:\n\n\"marriage is nothing more than a magnifying glass for people's sin. Spouses are mirrors that help identify and correct the lovelessness in each other so both individuals can grow.\"\n\nI think this is an apt description because some choose not to grow at all. Like my parents  :D",
                                    "author": null,
                                    "id": "gzq5twa",
                                    "parent_id": "t1_gzncdd2",
                                    "score": 2,
                                    "created_utc": 1622179105.0,
                                    "replies": [
                                        {
                                            "body": "> choose not to grow at al\n\nYes, Peter pan is alive and well",
                                            "author": "GSSD",
                                            "id": "gzr6aou",
                                            "parent_id": "t1_gzq5twa",
                                            "score": 2,
                                            "created_utc": 1622207259.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its a feature, not a bug.",
            "author": "vagatarian",
            "id": "gzlh3w1",
            "parent_id": "t3_nlw82u",
            "score": 0,
            "created_utc": 1622085761.0,
            "replies": []
        },
        {
            "body": "I from my experience with the sd thing along with owning a club for awhile many not all come from broken homes or have been traumatized in some way not all but many.I was asked by one I seen along time pretty early in our relationship if I had a daughter and if I had a daughter thing absolutely not. I just like spending time with younger women there more fun don’t tend to have some of baggage as older none bowl women do along with I like fit women it just my preference.",
            "author": "teach715",
            "id": "gzlbcvf",
            "parent_id": "t3_nlw82u",
            "score": -2,
            "created_utc": 1622082503.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzm7b99",
                    "parent_id": "t1_gzlbcvf",
                    "score": 9,
                    "created_utc": 1622106005.0,
                    "replies": [
                        {
                            "body": "Right? The double-standard is laughable. Also this guy can barely type a sentence and I always get fake SD vibes whenever that's the case.",
                            "author": null,
                            "id": "gzmje36",
                            "parent_id": "t1_gzm7b99",
                            "score": 9,
                            "created_utc": 1622116063.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Could it be possible that you have baggage, and the women you date are too young to know the difference yet? If your concern with older women is their lives are more complicated because of their experiences why is yours not?",
                    "author": null,
                    "id": "gzn6tik",
                    "parent_id": "t1_gzlbcvf",
                    "score": 5,
                    "created_utc": 1622127791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzlfq7p",
            "parent_id": "t3_nlw82u",
            "score": 1,
            "created_utc": 1622084957.0,
            "replies": [
                {
                    "body": "I have been with her over 2 years.  The extent of me inserting myself in this situation is the rant here.  I know better than to get involved.",
                    "author": "MrBuzzard",
                    "id": "gzlg6qk",
                    "parent_id": "t1_gzlfq7p",
                    "score": 1,
                    "created_utc": 1622085227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Could you be a little more clear on what you think?  You sound a little on the fence😎",
            "author": "MrBuzzard",
            "id": "gzla8sx",
            "parent_id": "t1_gzla37r",
            "score": 19,
            "created_utc": 1622081907.0,
            "replies": []
        },
        {
            "body": "Additionally I hope I change her view on how a man should act toward her.",
            "author": "sdburner",
            "id": "gzne6lo",
            "parent_id": "t1_gzlmg1a",
            "score": 8,
            "created_utc": 1622130915.0,
            "replies": [
                {
                    "body": "Exactly............Actions speak louder than words and while she many not talk about it or even realize it  you will most likely have an impact.",
                    "author": "pinotandsugar",
                    "id": "gzni76v",
                    "parent_id": "t1_gzne6lo",
                    "score": 5,
                    "created_utc": 1622132639.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzpdua2",
                    "parent_id": "t1_gzne6lo",
                    "score": 1,
                    "created_utc": 1622163395.0,
                    "replies": [
                        {
                            "body": "Oblige?",
                            "author": "sdburner",
                            "id": "gzpk4vc",
                            "parent_id": "t1_gzpdua2",
                            "score": 1,
                            "created_utc": 1622166711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same for me. I would like to be remembered as an awesome time and a good experience.",
            "author": "sdburner",
            "id": "gzne3tv",
            "parent_id": "t1_gzlmg1a",
            "score": 2,
            "created_utc": 1622130882.0,
            "replies": []
        },
        {
            "body": "I feel you. I resolved my problems with my father, but we don’t speak. Even when I was a little girl, a healthy father-daughter dynamic portrayed in tv always made me sad and wistful! One of my lady friends has a great relationship with her pop and her parents are still together and I always wonder what that must feel like when I see them all together.",
            "author": null,
            "id": "gzm6fex",
            "parent_id": "t1_gzlmqyl",
            "score": 8,
            "created_utc": 1622105145.0,
            "replies": []
        },
        {
            "body": "I gave you a like, not because of what happened to you,  but because I have at least a little understanding on how this impacted you.  Thanks for the reply.",
            "author": "MrBuzzard",
            "id": "gzl9ui0",
            "parent_id": "t1_gzl8y5d",
            "score": 13,
            "created_utc": 1622081690.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzmghqt",
            "parent_id": "t1_gzl8y5d",
            "score": 6,
            "created_utc": 1622114081.0,
            "replies": [
                {
                    "body": "Thank you so much for the book recommendation, I think it’ll be very useful to me.",
                    "author": null,
                    "id": "gzngktt",
                    "parent_id": "t1_gzmghqt",
                    "score": 1,
                    "created_utc": 1622131947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am for sure seeing her tomorrow, and have told her how excited I am to see her.  \n\nThanks for your your other thoughts.  I definitely was not trying to drag out the “Daddy Issues” cliche.  I have a daughter myself, and could never imagine treating her the way this guy does.  Pisses me off.",
            "author": "MrBuzzard",
            "id": "gzl8qiz",
            "parent_id": "t1_gzl7d6h",
            "score": 8,
            "created_utc": 1622081067.0,
            "replies": [
                {
                    "body": "Just curious. How will you feel if your daughter decides to become a SB?",
                    "author": "No-Reveal8042",
                    "id": "gzlylml",
                    "parent_id": "t1_gzl8qiz",
                    "score": 2,
                    "created_utc": 1622097934.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzmgse0",
                            "parent_id": "t1_gzlylml",
                            "score": 1,
                            "created_utc": 1622114294.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gzn4imz",
                                    "parent_id": "t1_gzmgse0",
                                    "score": 4,
                                    "created_utc": 1622126792.0,
                                    "replies": [
                                        {
                                            "body": "It also implies something innately wrong with jointing the sugar community as a woman. I wonder, if it were a son, if the sentiments would be the same.",
                                            "author": "ashwy16",
                                            "id": "gzn6lbq",
                                            "parent_id": "t1_gzn4imz",
                                            "score": 3,
                                            "created_utc": 1622127692.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gznl8he",
                                            "parent_id": "t1_gzn4imz",
                                            "score": 0,
                                            "created_utc": 1622133937.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gznmtbk",
                                                    "parent_id": "t1_gznl8he",
                                                    "score": 5,
                                                    "created_utc": 1622134601.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gzo90dp",
                                                            "parent_id": "t1_gznmtbk",
                                                            "score": 1,
                                                            "created_utc": 1622143963.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                                                                    "author": "jacknjilled",
                                                                    "id": "gzpt18b",
                                                                    "parent_id": "t1_gzo90dp",
                                                                    "score": 2,
                                                                    "created_utc": 1622171494.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzn5jtd",
            "parent_id": "t1_gzl7d6h",
            "score": 4,
            "created_utc": 1622127241.0,
            "replies": []
        },
        {
            "body": "Totally agree with all of this!!",
            "author": null,
            "id": "gzla5on",
            "parent_id": "t1_gzl7d6h",
            "score": 2,
            "created_utc": 1622081860.0,
            "replies": []
        },
        {
            "body": "A few have a great relationship with their father but it must less than 1%. Out of hundreds of POTs I've met, I've only met one.",
            "author": "SLFSLF2021",
            "id": "gzlf1qj",
            "parent_id": "t1_gzl7d6h",
            "score": 0,
            "created_utc": 1622084562.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzlgq2x",
                    "parent_id": "t1_gzlf1qj",
                    "score": 4,
                    "created_utc": 1622085541.0,
                    "replies": [
                        {
                            "body": "Maybe he has a selection bias issue lol",
                            "author": null,
                            "id": "gzmxmgr",
                            "parent_id": "t1_gzlgq2x",
                            "score": 6,
                            "created_utc": 1622123713.0,
                            "replies": [
                                {
                                    "body": "Hm, it's possible - I do have a particular look I go for - the blonde, all-American cheerleader types who are really attractive. But kind of doubt it.\n\nAlmost every SBI've met have an absent father or don't get along with him. As I said, only one had a warm, stable relationship with her father - getting together often, going on fishing trips with him, being able to rely on him.",
                                    "author": "SLFSLF2021",
                                    "id": "gzn6lgr",
                                    "parent_id": "t1_gzmxmgr",
                                    "score": -1,
                                    "created_utc": 1622127694.0,
                                    "replies": [
                                        {
                                            "body": "That says more about men these days than women . Why focus on the victims instead of realizing that a lot of men are awful people ? If you were talking to a bunch of young boys who suffered from their mom I think the outrage would be focused on the moms",
                                            "author": "Disastrous_Author638",
                                            "id": "gzndjfo",
                                            "parent_id": "t1_gzn6lgr",
                                            "score": 5,
                                            "created_utc": 1622130674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a \"daddy's girl\".  I was totally spoiled by my dad and prefer older men...always have.",
            "author": "naughtychick9999",
            "id": "gzmjfrz",
            "parent_id": "t1_gzm7j58",
            "score": 4,
            "created_utc": 1622116093.0,
            "replies": []
        },
        {
            "body": "That sounds like my mom.",
            "author": null,
            "id": "gzn7ube",
            "parent_id": "t1_gzmz6gn",
            "score": 2,
            "created_utc": 1622128235.0,
            "replies": [
                {
                    "body": "Sadly, I do not think this is super uncommon.  As a man who enjoys a reasonable range of body types, I have been pleasantly surprised at some ladies' appreciation at being appreciated for the lack of better terms.  Some ladies who do not have a top 0.5% bikini image can be amazing good sugar partners in part because someone was a jerk to them.  Do not overlook people like this when considering a great partner!",
                    "author": "NCtriadSD",
                    "id": "gzn8ymn",
                    "parent_id": "t1_gzn7ube",
                    "score": 1,
                    "created_utc": 1622128720.0,
                    "replies": [
                        {
                            "body": "Prey on insecurities??? Lol",
                            "author": "Disastrous_Author638",
                            "id": "gzndv02",
                            "parent_id": "t1_gzn8ymn",
                            "score": 2,
                            "created_utc": 1622130779.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t understand why you need to be a jerk about this.  But, hey if it makes you feel better about yourself, then fill yer boots.",
            "author": "MrBuzzard",
            "id": "gzlo037",
            "parent_id": "t1_gzlkq0q",
            "score": 3,
            "created_utc": 1622090043.0,
            "replies": []
        },
        {
            "body": "She is 23.  They don’t see each other too often.  But it means a lot of to her, when she does see him.  I have known her since she was 21, and have seen her let down several times.",
            "author": "MrBuzzard",
            "id": "gzl5hja",
            "parent_id": "t1_gzl4av4",
            "score": 5,
            "created_utc": 1622079056.0,
            "replies": [
                {
                    "body": "Do you know if he raised her? Or were her parents split and mom had custody? \n\nI can see if it's more like a pattern of emotional neglect stemming from childhood. \n\nAlways sucks to see someone you care about hurting and not be able to do much of anything.",
                    "author": "OpenAirMarket901",
                    "id": "gzl5ua6",
                    "parent_id": "t1_gzl5hja",
                    "score": 1,
                    "created_utc": 1622079235.0,
                    "replies": [
                        {
                            "body": "Sounds like a mess.  She bounced from parent to parent and back again.  As if there was no real custody.  She has said a couple of times that she doesn’t understand why people have kids, when they never really wanted them in the first place.  Ya, definitely emotional neglect.  She was the youngest, and for whatever reason ended up with the most unstable situation.",
                            "author": "MrBuzzard",
                            "id": "gzl80k6",
                            "parent_id": "t1_gzl5ua6",
                            "score": 3,
                            "created_utc": 1622080574.0,
                            "replies": [
                                {
                                    "body": "That sounds more like an upbringing issue than a 'daddy issue' as there are no specifics about the mother figure. Confirmation bias is a thing.\n\nStill, kind of you to care for her. When you finish the relationship, be mindful that it will affect her in a bad way.",
                                    "author": "AnSteall",
                                    "id": "gzlykhs",
                                    "parent_id": "t1_gzl80k6",
                                    "score": 3,
                                    "created_utc": 1622097908.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pfff",
            "author": "MrBuzzard",
            "id": "gzliqyi",
            "parent_id": "t1_gzlguuj",
            "score": 1,
            "created_utc": 1622086724.0,
            "replies": []
        },
        {
            "body": "Well my three main East coast SBs (including the 1%er from CA) had pretty normal families. The LT one is darn close to dad, though she did miss him as a child while he was on military deployment in Asia for usual length. She was highly sexed since teenage years and super horny in college. So rather than daddy issues she is just very sex positive and, equally to the point, highly motivated to make money. She likes to be financially set to spend like the college peers “who never had to worry about expenses since parents bankrolled their every desire”. She’s quite normal coming from that comfortable but tighter middle of the middle class, with three children going to college.",
            "author": "jacknjilled",
            "id": "gzli9a7",
            "parent_id": "t1_gzl8bpg",
            "score": 7,
            "created_utc": 1622086434.0,
            "replies": [
                {
                    "body": "Interesting that she needs to be in the bowl because she is sex positive! I get the financial part of course.",
                    "author": null,
                    "id": "gzmi90g",
                    "parent_id": "t1_gzli9a7",
                    "score": 2,
                    "created_utc": 1622115306.0,
                    "replies": [
                        {
                            "body": "Hmm on the “needs to be” ... she says that having sex regularly is a requirement for her. I think that has everything to do with her other admission that for years she was quite the hoe (whatever the reasons for that); and she now feels she has put that period behind her at age 25 next month. Over the course of her college career she was a recruited D One athlete and champion, supported very much by family including father. She started sugaring after breaking up with LT BF who didn’t give her enough space and was cruel at times. As long as she was going to have sex in the future might as well get paid for it. She doesn’t claim any history of fancying or dating older men, even if she may have fucked the occasional M +5-10 years older. I summed all this up as “being sex positive”, showing imho much more follow through and less inhibitions than women of prior generations, and being able to manage the insinuation that sugaring is sex work or prostitution by another name, and so to be shunned. Again, in my experience, didn’t see daddy issues but thought this alternative best explained willingness of several young women to sleep with ~60 yo me. Another Ivy D One athlete, from a prominent CA family, wanted the sex and thrill of it, and spending money not from family, as opposed to a campus BF/time drain or a reputation for sex besmirching a well known family name. Third SB was another athlete from a “small Ivy” and similarly normal family. Come to think of it, if I continue to sugar in future think I’ll stick with college athletes or alumna!",
                            "author": "jacknjilled",
                            "id": "gzpr5wa",
                            "parent_id": "t1_gzmi90g",
                            "score": 1,
                            "created_utc": 1622170458.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is almost 100% for me.  And in one case, the Dad died in a completely freaky and terrible situation.",
            "author": "MrBuzzard",
            "id": "gzl93ij",
            "parent_id": "t1_gzl8bpg",
            "score": 4,
            "created_utc": 1622081273.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzl7moz",
            "parent_id": "t1_gzl4lxu",
            "score": 23,
            "created_utc": 1622080288.0,
            "replies": [
                {
                    "body": "I wish I could upvote this a million times!!",
                    "author": "jellyfilling9",
                    "id": "gzlg8hp",
                    "parent_id": "t1_gzl7moz",
                    "score": 4,
                    "created_utc": 1622085256.0,
                    "replies": []
                },
                {
                    "body": "More like want to boink their daughter issues, which not acted upon get young SBs to boink. Win-win",
                    "author": "sugarandaview",
                    "id": "gzlabl1",
                    "parent_id": "t1_gzl7moz",
                    "score": 5,
                    "created_utc": 1622081950.0,
                    "replies": []
                },
                {
                    "body": "Not many",
                    "author": null,
                    "id": "gzl8een",
                    "parent_id": "t1_gzl7moz",
                    "score": -2,
                    "created_utc": 1622080860.0,
                    "replies": []
                },
                {
                    "body": "None",
                    "author": "SLFSLF2021",
                    "id": "gzlf2sr",
                    "parent_id": "t1_gzl7moz",
                    "score": -2,
                    "created_utc": 1622084579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My parents are proof that staying in the marriage can screw up your kids worse than a divorce. Also NPD and BPD as parents are like growing up in a refugee camp. Rather than say \"daddy issues\", I think it makes more sense to say many SBs and SDs come from homes with untreated mental illness and antagonistic paternal relationships.",
            "author": null,
            "id": "gzn7f8m",
            "parent_id": "t1_gzmlvml",
            "score": 3,
            "created_utc": 1622128053.0,
            "replies": [
                {
                    "body": "> antagonistic paternal relationships.\n\nMakes you wonder about the wisdom of marriage.",
                    "author": "GSSD",
                    "id": "gzncdd2",
                    "parent_id": "t1_gzn7f8m",
                    "score": 1,
                    "created_utc": 1622130185.0,
                    "replies": [
                        {
                            "body": "I really liked one religious leader's take on marriage. They said:\n\n\"marriage is nothing more than a magnifying glass for people's sin. Spouses are mirrors that help identify and correct the lovelessness in each other so both individuals can grow.\"\n\nI think this is an apt description because some choose not to grow at all. Like my parents  :D",
                            "author": null,
                            "id": "gzq5twa",
                            "parent_id": "t1_gzncdd2",
                            "score": 2,
                            "created_utc": 1622179105.0,
                            "replies": [
                                {
                                    "body": "> choose not to grow at al\n\nYes, Peter pan is alive and well",
                                    "author": "GSSD",
                                    "id": "gzr6aou",
                                    "parent_id": "t1_gzq5twa",
                                    "score": 2,
                                    "created_utc": 1622207259.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzm7b99",
            "parent_id": "t1_gzlbcvf",
            "score": 9,
            "created_utc": 1622106005.0,
            "replies": [
                {
                    "body": "Right? The double-standard is laughable. Also this guy can barely type a sentence and I always get fake SD vibes whenever that's the case.",
                    "author": null,
                    "id": "gzmje36",
                    "parent_id": "t1_gzm7b99",
                    "score": 9,
                    "created_utc": 1622116063.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Could it be possible that you have baggage, and the women you date are too young to know the difference yet? If your concern with older women is their lives are more complicated because of their experiences why is yours not?",
            "author": null,
            "id": "gzn6tik",
            "parent_id": "t1_gzlbcvf",
            "score": 5,
            "created_utc": 1622127791.0,
            "replies": []
        },
        {
            "body": "I have been with her over 2 years.  The extent of me inserting myself in this situation is the rant here.  I know better than to get involved.",
            "author": "MrBuzzard",
            "id": "gzlg6qk",
            "parent_id": "t1_gzlfq7p",
            "score": 1,
            "created_utc": 1622085227.0,
            "replies": []
        },
        {
            "body": "Exactly............Actions speak louder than words and while she many not talk about it or even realize it  you will most likely have an impact.",
            "author": "pinotandsugar",
            "id": "gzni76v",
            "parent_id": "t1_gzne6lo",
            "score": 5,
            "created_utc": 1622132639.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzpdua2",
            "parent_id": "t1_gzne6lo",
            "score": 1,
            "created_utc": 1622163395.0,
            "replies": [
                {
                    "body": "Oblige?",
                    "author": "sdburner",
                    "id": "gzpk4vc",
                    "parent_id": "t1_gzpdua2",
                    "score": 1,
                    "created_utc": 1622166711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much for the book recommendation, I think it’ll be very useful to me.",
            "author": null,
            "id": "gzngktt",
            "parent_id": "t1_gzmghqt",
            "score": 1,
            "created_utc": 1622131947.0,
            "replies": []
        },
        {
            "body": "Just curious. How will you feel if your daughter decides to become a SB?",
            "author": "No-Reveal8042",
            "id": "gzlylml",
            "parent_id": "t1_gzl8qiz",
            "score": 2,
            "created_utc": 1622097934.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzmgse0",
                    "parent_id": "t1_gzlylml",
                    "score": 1,
                    "created_utc": 1622114294.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzn4imz",
                            "parent_id": "t1_gzmgse0",
                            "score": 4,
                            "created_utc": 1622126792.0,
                            "replies": [
                                {
                                    "body": "It also implies something innately wrong with jointing the sugar community as a woman. I wonder, if it were a son, if the sentiments would be the same.",
                                    "author": "ashwy16",
                                    "id": "gzn6lbq",
                                    "parent_id": "t1_gzn4imz",
                                    "score": 3,
                                    "created_utc": 1622127692.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gznl8he",
                                    "parent_id": "t1_gzn4imz",
                                    "score": 0,
                                    "created_utc": 1622133937.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gznmtbk",
                                            "parent_id": "t1_gznl8he",
                                            "score": 5,
                                            "created_utc": 1622134601.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gzo90dp",
                                                    "parent_id": "t1_gznmtbk",
                                                    "score": 1,
                                                    "created_utc": 1622143963.0,
                                                    "replies": [
                                                        {
                                                            "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                                                            "author": "jacknjilled",
                                                            "id": "gzpt18b",
                                                            "parent_id": "t1_gzo90dp",
                                                            "score": 2,
                                                            "created_utc": 1622171494.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzlgq2x",
            "parent_id": "t1_gzlf1qj",
            "score": 4,
            "created_utc": 1622085541.0,
            "replies": [
                {
                    "body": "Maybe he has a selection bias issue lol",
                    "author": null,
                    "id": "gzmxmgr",
                    "parent_id": "t1_gzlgq2x",
                    "score": 6,
                    "created_utc": 1622123713.0,
                    "replies": [
                        {
                            "body": "Hm, it's possible - I do have a particular look I go for - the blonde, all-American cheerleader types who are really attractive. But kind of doubt it.\n\nAlmost every SBI've met have an absent father or don't get along with him. As I said, only one had a warm, stable relationship with her father - getting together often, going on fishing trips with him, being able to rely on him.",
                            "author": "SLFSLF2021",
                            "id": "gzn6lgr",
                            "parent_id": "t1_gzmxmgr",
                            "score": -1,
                            "created_utc": 1622127694.0,
                            "replies": [
                                {
                                    "body": "That says more about men these days than women . Why focus on the victims instead of realizing that a lot of men are awful people ? If you were talking to a bunch of young boys who suffered from their mom I think the outrage would be focused on the moms",
                                    "author": "Disastrous_Author638",
                                    "id": "gzndjfo",
                                    "parent_id": "t1_gzn6lgr",
                                    "score": 5,
                                    "created_utc": 1622130674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sadly, I do not think this is super uncommon.  As a man who enjoys a reasonable range of body types, I have been pleasantly surprised at some ladies' appreciation at being appreciated for the lack of better terms.  Some ladies who do not have a top 0.5% bikini image can be amazing good sugar partners in part because someone was a jerk to them.  Do not overlook people like this when considering a great partner!",
            "author": "NCtriadSD",
            "id": "gzn8ymn",
            "parent_id": "t1_gzn7ube",
            "score": 1,
            "created_utc": 1622128720.0,
            "replies": [
                {
                    "body": "Prey on insecurities??? Lol",
                    "author": "Disastrous_Author638",
                    "id": "gzndv02",
                    "parent_id": "t1_gzn8ymn",
                    "score": 2,
                    "created_utc": 1622130779.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you know if he raised her? Or were her parents split and mom had custody? \n\nI can see if it's more like a pattern of emotional neglect stemming from childhood. \n\nAlways sucks to see someone you care about hurting and not be able to do much of anything.",
            "author": "OpenAirMarket901",
            "id": "gzl5ua6",
            "parent_id": "t1_gzl5hja",
            "score": 1,
            "created_utc": 1622079235.0,
            "replies": [
                {
                    "body": "Sounds like a mess.  She bounced from parent to parent and back again.  As if there was no real custody.  She has said a couple of times that she doesn’t understand why people have kids, when they never really wanted them in the first place.  Ya, definitely emotional neglect.  She was the youngest, and for whatever reason ended up with the most unstable situation.",
                    "author": "MrBuzzard",
                    "id": "gzl80k6",
                    "parent_id": "t1_gzl5ua6",
                    "score": 3,
                    "created_utc": 1622080574.0,
                    "replies": [
                        {
                            "body": "That sounds more like an upbringing issue than a 'daddy issue' as there are no specifics about the mother figure. Confirmation bias is a thing.\n\nStill, kind of you to care for her. When you finish the relationship, be mindful that it will affect her in a bad way.",
                            "author": "AnSteall",
                            "id": "gzlykhs",
                            "parent_id": "t1_gzl80k6",
                            "score": 3,
                            "created_utc": 1622097908.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting that she needs to be in the bowl because she is sex positive! I get the financial part of course.",
            "author": null,
            "id": "gzmi90g",
            "parent_id": "t1_gzli9a7",
            "score": 2,
            "created_utc": 1622115306.0,
            "replies": [
                {
                    "body": "Hmm on the “needs to be” ... she says that having sex regularly is a requirement for her. I think that has everything to do with her other admission that for years she was quite the hoe (whatever the reasons for that); and she now feels she has put that period behind her at age 25 next month. Over the course of her college career she was a recruited D One athlete and champion, supported very much by family including father. She started sugaring after breaking up with LT BF who didn’t give her enough space and was cruel at times. As long as she was going to have sex in the future might as well get paid for it. She doesn’t claim any history of fancying or dating older men, even if she may have fucked the occasional M +5-10 years older. I summed all this up as “being sex positive”, showing imho much more follow through and less inhibitions than women of prior generations, and being able to manage the insinuation that sugaring is sex work or prostitution by another name, and so to be shunned. Again, in my experience, didn’t see daddy issues but thought this alternative best explained willingness of several young women to sleep with ~60 yo me. Another Ivy D One athlete, from a prominent CA family, wanted the sex and thrill of it, and spending money not from family, as opposed to a campus BF/time drain or a reputation for sex besmirching a well known family name. Third SB was another athlete from a “small Ivy” and similarly normal family. Come to think of it, if I continue to sugar in future think I’ll stick with college athletes or alumna!",
                    "author": "jacknjilled",
                    "id": "gzpr5wa",
                    "parent_id": "t1_gzmi90g",
                    "score": 1,
                    "created_utc": 1622170458.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish I could upvote this a million times!!",
            "author": "jellyfilling9",
            "id": "gzlg8hp",
            "parent_id": "t1_gzl7moz",
            "score": 4,
            "created_utc": 1622085256.0,
            "replies": []
        },
        {
            "body": "More like want to boink their daughter issues, which not acted upon get young SBs to boink. Win-win",
            "author": "sugarandaview",
            "id": "gzlabl1",
            "parent_id": "t1_gzl7moz",
            "score": 5,
            "created_utc": 1622081950.0,
            "replies": []
        },
        {
            "body": "Not many",
            "author": null,
            "id": "gzl8een",
            "parent_id": "t1_gzl7moz",
            "score": -2,
            "created_utc": 1622080860.0,
            "replies": []
        },
        {
            "body": "None",
            "author": "SLFSLF2021",
            "id": "gzlf2sr",
            "parent_id": "t1_gzl7moz",
            "score": -2,
            "created_utc": 1622084579.0,
            "replies": []
        },
        {
            "body": "> antagonistic paternal relationships.\n\nMakes you wonder about the wisdom of marriage.",
            "author": "GSSD",
            "id": "gzncdd2",
            "parent_id": "t1_gzn7f8m",
            "score": 1,
            "created_utc": 1622130185.0,
            "replies": [
                {
                    "body": "I really liked one religious leader's take on marriage. They said:\n\n\"marriage is nothing more than a magnifying glass for people's sin. Spouses are mirrors that help identify and correct the lovelessness in each other so both individuals can grow.\"\n\nI think this is an apt description because some choose not to grow at all. Like my parents  :D",
                    "author": null,
                    "id": "gzq5twa",
                    "parent_id": "t1_gzncdd2",
                    "score": 2,
                    "created_utc": 1622179105.0,
                    "replies": [
                        {
                            "body": "> choose not to grow at al\n\nYes, Peter pan is alive and well",
                            "author": "GSSD",
                            "id": "gzr6aou",
                            "parent_id": "t1_gzq5twa",
                            "score": 2,
                            "created_utc": 1622207259.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right? The double-standard is laughable. Also this guy can barely type a sentence and I always get fake SD vibes whenever that's the case.",
            "author": null,
            "id": "gzmje36",
            "parent_id": "t1_gzm7b99",
            "score": 9,
            "created_utc": 1622116063.0,
            "replies": []
        },
        {
            "body": "Oblige?",
            "author": "sdburner",
            "id": "gzpk4vc",
            "parent_id": "t1_gzpdua2",
            "score": 1,
            "created_utc": 1622166711.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzmgse0",
            "parent_id": "t1_gzlylml",
            "score": 1,
            "created_utc": 1622114294.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzn4imz",
                    "parent_id": "t1_gzmgse0",
                    "score": 4,
                    "created_utc": 1622126792.0,
                    "replies": [
                        {
                            "body": "It also implies something innately wrong with jointing the sugar community as a woman. I wonder, if it were a son, if the sentiments would be the same.",
                            "author": "ashwy16",
                            "id": "gzn6lbq",
                            "parent_id": "t1_gzn4imz",
                            "score": 3,
                            "created_utc": 1622127692.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gznl8he",
                            "parent_id": "t1_gzn4imz",
                            "score": 0,
                            "created_utc": 1622133937.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gznmtbk",
                                    "parent_id": "t1_gznl8he",
                                    "score": 5,
                                    "created_utc": 1622134601.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gzo90dp",
                                            "parent_id": "t1_gznmtbk",
                                            "score": 1,
                                            "created_utc": 1622143963.0,
                                            "replies": [
                                                {
                                                    "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                                                    "author": "jacknjilled",
                                                    "id": "gzpt18b",
                                                    "parent_id": "t1_gzo90dp",
                                                    "score": 2,
                                                    "created_utc": 1622171494.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe he has a selection bias issue lol",
            "author": null,
            "id": "gzmxmgr",
            "parent_id": "t1_gzlgq2x",
            "score": 6,
            "created_utc": 1622123713.0,
            "replies": [
                {
                    "body": "Hm, it's possible - I do have a particular look I go for - the blonde, all-American cheerleader types who are really attractive. But kind of doubt it.\n\nAlmost every SBI've met have an absent father or don't get along with him. As I said, only one had a warm, stable relationship with her father - getting together often, going on fishing trips with him, being able to rely on him.",
                    "author": "SLFSLF2021",
                    "id": "gzn6lgr",
                    "parent_id": "t1_gzmxmgr",
                    "score": -1,
                    "created_utc": 1622127694.0,
                    "replies": [
                        {
                            "body": "That says more about men these days than women . Why focus on the victims instead of realizing that a lot of men are awful people ? If you were talking to a bunch of young boys who suffered from their mom I think the outrage would be focused on the moms",
                            "author": "Disastrous_Author638",
                            "id": "gzndjfo",
                            "parent_id": "t1_gzn6lgr",
                            "score": 5,
                            "created_utc": 1622130674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Prey on insecurities??? Lol",
            "author": "Disastrous_Author638",
            "id": "gzndv02",
            "parent_id": "t1_gzn8ymn",
            "score": 2,
            "created_utc": 1622130779.0,
            "replies": []
        },
        {
            "body": "Sounds like a mess.  She bounced from parent to parent and back again.  As if there was no real custody.  She has said a couple of times that she doesn’t understand why people have kids, when they never really wanted them in the first place.  Ya, definitely emotional neglect.  She was the youngest, and for whatever reason ended up with the most unstable situation.",
            "author": "MrBuzzard",
            "id": "gzl80k6",
            "parent_id": "t1_gzl5ua6",
            "score": 3,
            "created_utc": 1622080574.0,
            "replies": [
                {
                    "body": "That sounds more like an upbringing issue than a 'daddy issue' as there are no specifics about the mother figure. Confirmation bias is a thing.\n\nStill, kind of you to care for her. When you finish the relationship, be mindful that it will affect her in a bad way.",
                    "author": "AnSteall",
                    "id": "gzlykhs",
                    "parent_id": "t1_gzl80k6",
                    "score": 3,
                    "created_utc": 1622097908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm on the “needs to be” ... she says that having sex regularly is a requirement for her. I think that has everything to do with her other admission that for years she was quite the hoe (whatever the reasons for that); and she now feels she has put that period behind her at age 25 next month. Over the course of her college career she was a recruited D One athlete and champion, supported very much by family including father. She started sugaring after breaking up with LT BF who didn’t give her enough space and was cruel at times. As long as she was going to have sex in the future might as well get paid for it. She doesn’t claim any history of fancying or dating older men, even if she may have fucked the occasional M +5-10 years older. I summed all this up as “being sex positive”, showing imho much more follow through and less inhibitions than women of prior generations, and being able to manage the insinuation that sugaring is sex work or prostitution by another name, and so to be shunned. Again, in my experience, didn’t see daddy issues but thought this alternative best explained willingness of several young women to sleep with ~60 yo me. Another Ivy D One athlete, from a prominent CA family, wanted the sex and thrill of it, and spending money not from family, as opposed to a campus BF/time drain or a reputation for sex besmirching a well known family name. Third SB was another athlete from a “small Ivy” and similarly normal family. Come to think of it, if I continue to sugar in future think I’ll stick with college athletes or alumna!",
            "author": "jacknjilled",
            "id": "gzpr5wa",
            "parent_id": "t1_gzmi90g",
            "score": 1,
            "created_utc": 1622170458.0,
            "replies": []
        },
        {
            "body": "I really liked one religious leader's take on marriage. They said:\n\n\"marriage is nothing more than a magnifying glass for people's sin. Spouses are mirrors that help identify and correct the lovelessness in each other so both individuals can grow.\"\n\nI think this is an apt description because some choose not to grow at all. Like my parents  :D",
            "author": null,
            "id": "gzq5twa",
            "parent_id": "t1_gzncdd2",
            "score": 2,
            "created_utc": 1622179105.0,
            "replies": [
                {
                    "body": "> choose not to grow at al\n\nYes, Peter pan is alive and well",
                    "author": "GSSD",
                    "id": "gzr6aou",
                    "parent_id": "t1_gzq5twa",
                    "score": 2,
                    "created_utc": 1622207259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzn4imz",
            "parent_id": "t1_gzmgse0",
            "score": 4,
            "created_utc": 1622126792.0,
            "replies": [
                {
                    "body": "It also implies something innately wrong with jointing the sugar community as a woman. I wonder, if it were a son, if the sentiments would be the same.",
                    "author": "ashwy16",
                    "id": "gzn6lbq",
                    "parent_id": "t1_gzn4imz",
                    "score": 3,
                    "created_utc": 1622127692.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gznl8he",
                    "parent_id": "t1_gzn4imz",
                    "score": 0,
                    "created_utc": 1622133937.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gznmtbk",
                            "parent_id": "t1_gznl8he",
                            "score": 5,
                            "created_utc": 1622134601.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gzo90dp",
                                    "parent_id": "t1_gznmtbk",
                                    "score": 1,
                                    "created_utc": 1622143963.0,
                                    "replies": [
                                        {
                                            "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                                            "author": "jacknjilled",
                                            "id": "gzpt18b",
                                            "parent_id": "t1_gzo90dp",
                                            "score": 2,
                                            "created_utc": 1622171494.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hm, it's possible - I do have a particular look I go for - the blonde, all-American cheerleader types who are really attractive. But kind of doubt it.\n\nAlmost every SBI've met have an absent father or don't get along with him. As I said, only one had a warm, stable relationship with her father - getting together often, going on fishing trips with him, being able to rely on him.",
            "author": "SLFSLF2021",
            "id": "gzn6lgr",
            "parent_id": "t1_gzmxmgr",
            "score": -1,
            "created_utc": 1622127694.0,
            "replies": [
                {
                    "body": "That says more about men these days than women . Why focus on the victims instead of realizing that a lot of men are awful people ? If you were talking to a bunch of young boys who suffered from their mom I think the outrage would be focused on the moms",
                    "author": "Disastrous_Author638",
                    "id": "gzndjfo",
                    "parent_id": "t1_gzn6lgr",
                    "score": 5,
                    "created_utc": 1622130674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That sounds more like an upbringing issue than a 'daddy issue' as there are no specifics about the mother figure. Confirmation bias is a thing.\n\nStill, kind of you to care for her. When you finish the relationship, be mindful that it will affect her in a bad way.",
            "author": "AnSteall",
            "id": "gzlykhs",
            "parent_id": "t1_gzl80k6",
            "score": 3,
            "created_utc": 1622097908.0,
            "replies": []
        },
        {
            "body": "> choose not to grow at al\n\nYes, Peter pan is alive and well",
            "author": "GSSD",
            "id": "gzr6aou",
            "parent_id": "t1_gzq5twa",
            "score": 2,
            "created_utc": 1622207259.0,
            "replies": []
        },
        {
            "body": "It also implies something innately wrong with jointing the sugar community as a woman. I wonder, if it were a son, if the sentiments would be the same.",
            "author": "ashwy16",
            "id": "gzn6lbq",
            "parent_id": "t1_gzn4imz",
            "score": 3,
            "created_utc": 1622127692.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gznl8he",
            "parent_id": "t1_gzn4imz",
            "score": 0,
            "created_utc": 1622133937.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gznmtbk",
                    "parent_id": "t1_gznl8he",
                    "score": 5,
                    "created_utc": 1622134601.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gzo90dp",
                            "parent_id": "t1_gznmtbk",
                            "score": 1,
                            "created_utc": 1622143963.0,
                            "replies": [
                                {
                                    "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                                    "author": "jacknjilled",
                                    "id": "gzpt18b",
                                    "parent_id": "t1_gzo90dp",
                                    "score": 2,
                                    "created_utc": 1622171494.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That says more about men these days than women . Why focus on the victims instead of realizing that a lot of men are awful people ? If you were talking to a bunch of young boys who suffered from their mom I think the outrage would be focused on the moms",
            "author": "Disastrous_Author638",
            "id": "gzndjfo",
            "parent_id": "t1_gzn6lgr",
            "score": 5,
            "created_utc": 1622130674.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gznmtbk",
            "parent_id": "t1_gznl8he",
            "score": 5,
            "created_utc": 1622134601.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gzo90dp",
                    "parent_id": "t1_gznmtbk",
                    "score": 1,
                    "created_utc": 1622143963.0,
                    "replies": [
                        {
                            "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                            "author": "jacknjilled",
                            "id": "gzpt18b",
                            "parent_id": "t1_gzo90dp",
                            "score": 2,
                            "created_utc": 1622171494.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gzo90dp",
            "parent_id": "t1_gznmtbk",
            "score": 1,
            "created_utc": 1622143963.0,
            "replies": [
                {
                    "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
                    "author": "jacknjilled",
                    "id": "gzpt18b",
                    "parent_id": "t1_gzo90dp",
                    "score": 2,
                    "created_utc": 1622171494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Taking a long, historical view, I suggest that it is “not normal” in America while other places and times it has been more accepted. And here it’s not normal because men have since 1607 led the way in making forever marriage a sacrosanct ideal, complete with double standards and the usual hypocrisy. Marriage conformity has rightfully been reconsidered during the various phases of modern feminism. IMHO it’s time for more SDs to identify with their SBs on an equal footing as to judging the propriety of our actions, and the value of our identities.",
            "author": "jacknjilled",
            "id": "gzpt18b",
            "parent_id": "t1_gzo90dp",
            "score": 2,
            "created_utc": 1622171494.0,
            "replies": []
        }
    ]
}