{
    "title": "A quick rant",
    "post_id": "lp52ox",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lp52ox/a_quick_rant/",
    "author": "littlemelaninmonroe",
    "body": "Why do some men think it’s appropriate to not be recently tested when you’re clearly in this lifestyle that can come with anything??? I met a nice guy and things were going well. Once we decided to start our arrangement I took all precautions so we can have stress free s*x life. Now that it’s his turn all I hear from him is excuses.\n\n“Oh they’ll send the results to my office and my staff will know.”\n\n“Will you be okay with a home testing kit?”\n\n“I promise I don’t take risks with my health. I’m a good guy.”\n\n“I’m not comfortable with getting online results cause either way it’ll be downloaded to my office computers and my staff will still know.”\n\nOkay....why would it be a problem if they know you’re having safe sex? Idgaf about home kits and i’m not reading an article about the accuracy. He even admitted he just hoped I’d “give in” and not ask for him to be tested anymore and did a head pusher move the last time we got together. \n\nFor someone in the medical field you really don’t have any self medical common sense. He just gave so many excuses and it wasn’t worth it. So now I’m back to looking 🙄\n\nLadies stick to your guns. No amount of money is worth your peace of mind.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lp52ox/a_quick_rant/",
    "score": 104,
    "upvote_ratio": 0.99,
    "created_utc": 1613937240.0,
    "num_comments": 42,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Does this grown wealthy man not have a personal laptop, tablet, phone? I've used Current by Everlywell health online. Seems legit. But anyway if you go to a clinic, how hard is it to go to a clinic and access results on a personal device?",
            "author": null,
            "id": "go9e8h0",
            "parent_id": "t3_lp52ox",
            "score": 42,
            "created_utc": 1613937643.0,
            "replies": [
                {
                    "body": "My point exactly. It just didn’t add up and I’m not dealing with the excuses!",
                    "author": "littlemelaninmonroe",
                    "id": "go9fctq",
                    "parent_id": "t1_go9e8h0",
                    "score": 22,
                    "created_utc": 1613938120.0,
                    "replies": [
                        {
                            "body": "Good for you! Excuses are lies.",
                            "author": null,
                            "id": "go9iw5l",
                            "parent_id": "t1_go9fctq",
                            "score": 13,
                            "created_utc": 1613939848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He definitely has something! Thank goodness you didn’t sleep with him .",
            "author": "angelhair12",
            "id": "go9gdw8",
            "parent_id": "t3_lp52ox",
            "score": 25,
            "created_utc": 1613938607.0,
            "replies": [
                {
                    "body": "I did but we used condoms. funny thing is even with being tested he still wanted to use condoms to prevent pregnancy (even though I would have been on bc. I have noooo intention of owning my own tiny human right now lol) he just wanted me to perform oral on him without one on 🙄",
                    "author": "littlemelaninmonroe",
                    "id": "go9i4ex",
                    "parent_id": "t1_go9gdw8",
                    "score": 9,
                    "created_utc": 1613939471.0,
                    "replies": [
                        {
                            "body": "Many STIs can spread even with condoms, for example HSV, HPV, syphilis, etc. So if he had one of these, it's possible you've picked it up from him.",
                            "author": "SeattleLaserMeteor",
                            "id": "goad6ad",
                            "parent_id": "t1_go9i4ex",
                            "score": 9,
                            "created_utc": 1613954939.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "goaifxj",
                            "parent_id": "t1_go9i4ex",
                            "score": 3,
                            "created_utc": 1613957665.0,
                            "replies": [
                                {
                                    "body": "I won’t perform oral unless a test is done. I offered to do it with a condom but he didn’t want that. I would hope it’s common for sugaring as well as regular vanilla sex. I go to planned parenthood. They check urine for chlymidia/gono. and then draw blood for HIV, tech, syph, etc. the only thing they don’t check for is herpes unless you have visible signs of possibly having it.",
                                    "author": "littlemelaninmonroe",
                                    "id": "goamhx4",
                                    "parent_id": "t1_goaifxj",
                                    "score": 7,
                                    "created_utc": 1613959757.0,
                                    "replies": [
                                        {
                                            "body": "I’ve never had a SB or vanilla partner insist on using a condom for oral sex. Most have said they don’t like the taste of the condom.",
                                            "author": "Fun_Focus8159",
                                            "id": "goaubsd",
                                            "parent_id": "t1_goamhx4",
                                            "score": 2,
                                            "created_utc": 1613963880.0,
                                            "replies": [
                                                {
                                                    "body": "At that point I offered just to get him to shut up about it but yes the taste is terrible 😂",
                                                    "author": "littlemelaninmonroe",
                                                    "id": "goauhdx",
                                                    "parent_id": "t1_goaubsd",
                                                    "score": 2,
                                                    "created_utc": 1613963968.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">Is it normal in the bowl to use condoms/dental dams with oral sex too?\n\nNo, it's not, in fact the vast majority of SB's will not even ask me to use a condom and that is the truth.",
                                    "author": null,
                                    "id": "gobz238",
                                    "parent_id": "t1_goaifxj",
                                    "score": -1,
                                    "created_utc": 1613995505.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">“I’m not comfortable with getting online results cause either way it’ll be downloaded to my office computers and my staff will still know.”\n\nWhat incredible bullshit.\n\n[stdcheck.com](https://stdcheck.com) will send the results to *any email address he chooses.* Like an [outlook.com](https://outlook.com) throwaway for example. Like you can log in on web and check that mail, in private. Jesus.\n\n>He even admitted he just hoped I’d “give in” and not ask for him to be tested anymore and did a head pusher move the last time we got together.\n\nF--- him. And by that I mean he's an ass. Don't f--- him.",
            "author": "marker3000",
            "id": "goatj35",
            "parent_id": "t3_lp52ox",
            "score": 9,
            "created_utc": 1613963440.0,
            "replies": [
                {
                    "body": "I already gave him the signature “Take care” Done!",
                    "author": "littlemelaninmonroe",
                    "id": "goatoih",
                    "parent_id": "t1_goatj35",
                    "score": 3,
                    "created_utc": 1613963523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a SD I can’t imagine not getting a new test at the start of a SR.  Personally I could not be comfortable having sex with someone if I was not 100% certain I was clean.  I will add that all of my SR have been exclusive with mutual agreement to not use protection, so testing is even more important",
            "author": "blk-tye",
            "id": "go9wudu",
            "parent_id": "t3_lp52ox",
            "score": 4,
            "created_utc": 1613946474.0,
            "replies": []
        },
        {
            "body": " No test, no sex. Simple",
            "author": "Zealousideal_Map8100",
            "id": "go9y7wp",
            "parent_id": "t3_lp52ox",
            "score": 4,
            "created_utc": 1613947174.0,
            "replies": []
        },
        {
            "body": "You're right, thats extremely inappropriate and suspicious. I would cut him off tbh!",
            "author": "melly-79",
            "id": "go9jzkj",
            "parent_id": "t3_lp52ox",
            "score": 5,
            "created_utc": 1613940380.0,
            "replies": []
        },
        {
            "body": "I have the same issue with SBs. I get tested all the time especially with a new partner. With m previous SB, I got tested before and after our relationship. And I shared my results with her.\n\nWith my current SB, I shared results before intimacy. I asked her to get tested and all I got was bs about how she’s clean and has been a good girl and has only slept with two guys yadayadayada. Anyways I use a condom. But I don’t see how a relationship I’m monogamous in would last very long with a condom. Something has gotta give.",
            "author": "RealisticSD",
            "id": "goaj9mu",
            "parent_id": "t3_lp52ox",
            "score": 3,
            "created_utc": 1613958080.0,
            "replies": [
                {
                    "body": "It’s the bs excuses that make it so much more difficult. We’re both adults. God luck to his next SB.",
                    "author": "littlemelaninmonroe",
                    "id": "goamryy",
                    "parent_id": "t1_goaj9mu",
                    "score": 1,
                    "created_utc": 1613959905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "**Why do some men think it’s appropriate to not be recently tested when you’re clearly in this lifestyle that can come with anything???**\n\nVanilla can come with anything, let's be clear here.  \n\nThere is SLF and then there is real life sugaring. In real life sugaring I have never once been asked for a STI panel. When it comes to a vanilla relationship even more so, I could never see that happening. \n\nI am going to be brutally honest here, if a pot sb asked me I would probably just pass on her. Again this has never happened in the 4 years I have been in the bowl so it's not a issue anyhow.",
            "author": null,
            "id": "gobyt2k",
            "parent_id": "t3_lp52ox",
            "score": -2,
            "created_utc": 1613995312.0,
            "replies": [
                {
                    "body": "Before I start sexual relationships, even vanilla ones, I ask for tests and also get tested myself. It's just being responsible and respectful. An std test is a must if you want anything exclusive and plan to ditch the condom eventually. If an SD, vanilla bf or fwb would refuse a test, I'd just pass on him.",
                    "author": "durtari",
                    "id": "gocglk2",
                    "parent_id": "t1_gobyt2k",
                    "score": 1,
                    "created_utc": 1614006281.0,
                    "replies": []
                },
                {
                    "body": ">In real life sugaring I have never once been asked for a STI panel. When it comes to a vanilla relationship even more so\n\n\"In scenario A, I've been asked zero times. In scenario B, I've been asked even fewer than zero times.\"",
                    "author": "Sophs_B",
                    "id": "gokadc0",
                    "parent_id": "t1_gobyt2k",
                    "score": 1,
                    "created_utc": 1614155353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have never gotten a test in my life & slept with over 40 women(quick guess) including one night stands & relationships and I’ve used a condom on maybe 2-3 of those.",
            "author": "Aarsquare",
            "id": "go9pcs4",
            "parent_id": "t3_lp52ox",
            "score": -24,
            "created_utc": 1613942952.0,
            "replies": [
                {
                    "body": "You're the reason why women need to demand testing. There are certain things men can carry and never show a symptom but can pass on to women who can have excruciating symptoms.",
                    "author": null,
                    "id": "go9sbwd",
                    "parent_id": "t1_go9pcs4",
                    "score": 20,
                    "created_utc": 1613944233.0,
                    "replies": []
                },
                {
                    "body": "Grim. Potentially spreading life threatening/infertility causing diseases to ladies is just irresponsible and inconsiderate lol. Care to share why you're so proud of yourself?",
                    "author": "AvenueLane96",
                    "id": "go9s10w",
                    "parent_id": "t1_go9pcs4",
                    "score": 12,
                    "created_utc": 1613944109.0,
                    "replies": []
                },
                {
                    "body": "Weird flex, bro. \"When it comes to my sexual health, I'm a completely unaccountable and reckless plague rat.\"\n\nAs others have said, you're the perfect example of why testing a new partner is so important.",
                    "author": "Intrepid_Egg_7722",
                    "id": "goa71gh",
                    "parent_id": "t1_go9pcs4",
                    "score": 10,
                    "created_utc": 1613951665.0,
                    "replies": []
                },
                {
                    "body": "Gross.  🤮",
                    "author": "naughtychick9999",
                    "id": "goa5xbi",
                    "parent_id": "t1_go9pcs4",
                    "score": 10,
                    "created_utc": 1613951092.0,
                    "replies": []
                },
                {
                    "body": "What in the actual fuck? 🥴",
                    "author": "Daisylil",
                    "id": "go9yvww",
                    "parent_id": "t1_go9pcs4",
                    "score": 9,
                    "created_utc": 1613947518.0,
                    "replies": []
                },
                {
                    "body": "Wouldn’t brag about this.",
                    "author": "Hairy-Fudge-8148",
                    "id": "go9sm48",
                    "parent_id": "t1_go9pcs4",
                    "score": 10,
                    "created_utc": 1613944366.0,
                    "replies": []
                },
                {
                    "body": "Yikes. Please don’t play with your life like that.",
                    "author": "littlemelaninmonroe",
                    "id": "goamx5i",
                    "parent_id": "t1_go9pcs4",
                    "score": 3,
                    "created_utc": 1613959982.0,
                    "replies": []
                },
                {
                    "body": "Cool story bro 🙄\n\nClown.",
                    "author": "viewfrom61",
                    "id": "goaslxd",
                    "parent_id": "t1_go9pcs4",
                    "score": 3,
                    "created_utc": 1613962928.0,
                    "replies": []
                },
                {
                    "body": "Ew.",
                    "author": "ladylunapluss",
                    "id": "gob178v",
                    "parent_id": "t1_go9pcs4",
                    "score": 2,
                    "created_utc": 1613967847.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Amen and hallelujah",
            "author": null,
            "id": "go9zyhf",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1613948055.0,
            "replies": []
        },
        {
            "body": "Only three reasons someone may be doing this (assuming they can afford the test because in the US #healthcareisBS\n\n&#x200B;\n\n1. They have something AND don't want you to know - in which case he's ok putting your health at jeopardy. Next. \n\n2. He doesn't have something but is using lines like this to get you to not wear condoms, in which case he is willing to purposefully mislead you to get what he wants. #next\n\nAnd 3, even if it's not # 1 or # 2 at the very least he's unwilling to take simple actions that you've said you'd need to feel more safe and secure in the relationship. #Next",
            "author": "mischiefmolly",
            "id": "goalux7",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1613959424.0,
            "replies": []
        },
        {
            "body": "Are you in Wisconsin by chance? \n\nI had an arrangement with a doctor who absolutely refused to get tested. He would say that STDs arent that bad as long as you don't get HIV. I always used condoms with him except for one time when I thought we were exclusive. I got tested right away when I found out otherwise. Haven't been in the bowl since.",
            "author": null,
            "id": "goan4kq",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1613960092.0,
            "replies": [
                {
                    "body": "No, I reside in Missouri. This guy would say the same thing. “You can’t catch anything from doing it just go ahead” or he’d think if he performed on me it would push me to do it. And I’m sorry this is TMI but he produced so much...pre-ejaculation I was completely turned off by even wanting to do it! Even if he got tested! 🤢 just thinking about it has my tummy turning",
                    "author": "littlemelaninmonroe",
                    "id": "goanpid",
                    "parent_id": "t1_goan4kq",
                    "score": 2,
                    "created_utc": 1613960394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "all bologna\n\ntakes 24-48 hours all online if needed.\n\nguy is full of it.",
            "author": "bookworm010101",
            "id": "goao6lc",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1613960640.0,
            "replies": []
        },
        {
            "body": "You’re talking Sti and not covid right?",
            "author": "pussy_impaler337",
            "id": "goasvm1",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1613963074.0,
            "replies": [
                {
                    "body": "Yes STI",
                    "author": "littlemelaninmonroe",
                    "id": "goasy7n",
                    "parent_id": "t1_goasvm1",
                    "score": 1,
                    "created_utc": 1613963115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So normally when you get test results sent to your office which is weird like send it to your home address or have them call his phone for the results, no medical professional is allowed to exploit anyone’s personal information to people that aren’t the person they are calling for they will get fired. \nBe careful babe he’s making up shit.",
            "author": "PaleFlow7068",
            "id": "gobqo9n",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1613988069.0,
            "replies": []
        },
        {
            "body": "I pretty much treat refusal to proactively test and share results as admittance of some form of unmanaged infection, then I move on.",
            "author": null,
            "id": "gocl73x",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1614008566.0,
            "replies": []
        },
        {
            "body": "Seriously, STD clinics are know for their discretion. I call bullshit.",
            "author": "peterharris100",
            "id": "gocw3yc",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1614013357.0,
            "replies": []
        },
        {
            "body": "“Oh no, my whole staff will know I don’t have STI’s...the horror....” 🤦🏽‍♂️",
            "author": "HotStool",
            "id": "goebd58",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1614035938.0,
            "replies": []
        },
        {
            "body": "fuuuuuck that guy- but metaphorically don't actually fuck him he definitely has something",
            "author": "ruasrules",
            "id": "gsmov7v",
            "parent_id": "t3_lp52ox",
            "score": 1,
            "created_utc": 1616973103.0,
            "replies": []
        },
        {
            "body": "My point exactly. It just didn’t add up and I’m not dealing with the excuses!",
            "author": "littlemelaninmonroe",
            "id": "go9fctq",
            "parent_id": "t1_go9e8h0",
            "score": 22,
            "created_utc": 1613938120.0,
            "replies": [
                {
                    "body": "Good for you! Excuses are lies.",
                    "author": null,
                    "id": "go9iw5l",
                    "parent_id": "t1_go9fctq",
                    "score": 13,
                    "created_utc": 1613939848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did but we used condoms. funny thing is even with being tested he still wanted to use condoms to prevent pregnancy (even though I would have been on bc. I have noooo intention of owning my own tiny human right now lol) he just wanted me to perform oral on him without one on 🙄",
            "author": "littlemelaninmonroe",
            "id": "go9i4ex",
            "parent_id": "t1_go9gdw8",
            "score": 9,
            "created_utc": 1613939471.0,
            "replies": [
                {
                    "body": "Many STIs can spread even with condoms, for example HSV, HPV, syphilis, etc. So if he had one of these, it's possible you've picked it up from him.",
                    "author": "SeattleLaserMeteor",
                    "id": "goad6ad",
                    "parent_id": "t1_go9i4ex",
                    "score": 9,
                    "created_utc": 1613954939.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "goaifxj",
                    "parent_id": "t1_go9i4ex",
                    "score": 3,
                    "created_utc": 1613957665.0,
                    "replies": [
                        {
                            "body": "I won’t perform oral unless a test is done. I offered to do it with a condom but he didn’t want that. I would hope it’s common for sugaring as well as regular vanilla sex. I go to planned parenthood. They check urine for chlymidia/gono. and then draw blood for HIV, tech, syph, etc. the only thing they don’t check for is herpes unless you have visible signs of possibly having it.",
                            "author": "littlemelaninmonroe",
                            "id": "goamhx4",
                            "parent_id": "t1_goaifxj",
                            "score": 7,
                            "created_utc": 1613959757.0,
                            "replies": [
                                {
                                    "body": "I’ve never had a SB or vanilla partner insist on using a condom for oral sex. Most have said they don’t like the taste of the condom.",
                                    "author": "Fun_Focus8159",
                                    "id": "goaubsd",
                                    "parent_id": "t1_goamhx4",
                                    "score": 2,
                                    "created_utc": 1613963880.0,
                                    "replies": [
                                        {
                                            "body": "At that point I offered just to get him to shut up about it but yes the taste is terrible 😂",
                                            "author": "littlemelaninmonroe",
                                            "id": "goauhdx",
                                            "parent_id": "t1_goaubsd",
                                            "score": 2,
                                            "created_utc": 1613963968.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">Is it normal in the bowl to use condoms/dental dams with oral sex too?\n\nNo, it's not, in fact the vast majority of SB's will not even ask me to use a condom and that is the truth.",
                            "author": null,
                            "id": "gobz238",
                            "parent_id": "t1_goaifxj",
                            "score": -1,
                            "created_utc": 1613995505.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I already gave him the signature “Take care” Done!",
            "author": "littlemelaninmonroe",
            "id": "goatoih",
            "parent_id": "t1_goatj35",
            "score": 3,
            "created_utc": 1613963523.0,
            "replies": []
        },
        {
            "body": "It’s the bs excuses that make it so much more difficult. We’re both adults. God luck to his next SB.",
            "author": "littlemelaninmonroe",
            "id": "goamryy",
            "parent_id": "t1_goaj9mu",
            "score": 1,
            "created_utc": 1613959905.0,
            "replies": []
        },
        {
            "body": "Before I start sexual relationships, even vanilla ones, I ask for tests and also get tested myself. It's just being responsible and respectful. An std test is a must if you want anything exclusive and plan to ditch the condom eventually. If an SD, vanilla bf or fwb would refuse a test, I'd just pass on him.",
            "author": "durtari",
            "id": "gocglk2",
            "parent_id": "t1_gobyt2k",
            "score": 1,
            "created_utc": 1614006281.0,
            "replies": []
        },
        {
            "body": ">In real life sugaring I have never once been asked for a STI panel. When it comes to a vanilla relationship even more so\n\n\"In scenario A, I've been asked zero times. In scenario B, I've been asked even fewer than zero times.\"",
            "author": "Sophs_B",
            "id": "gokadc0",
            "parent_id": "t1_gobyt2k",
            "score": 1,
            "created_utc": 1614155353.0,
            "replies": []
        },
        {
            "body": "You're the reason why women need to demand testing. There are certain things men can carry and never show a symptom but can pass on to women who can have excruciating symptoms.",
            "author": null,
            "id": "go9sbwd",
            "parent_id": "t1_go9pcs4",
            "score": 20,
            "created_utc": 1613944233.0,
            "replies": []
        },
        {
            "body": "Grim. Potentially spreading life threatening/infertility causing diseases to ladies is just irresponsible and inconsiderate lol. Care to share why you're so proud of yourself?",
            "author": "AvenueLane96",
            "id": "go9s10w",
            "parent_id": "t1_go9pcs4",
            "score": 12,
            "created_utc": 1613944109.0,
            "replies": []
        },
        {
            "body": "Weird flex, bro. \"When it comes to my sexual health, I'm a completely unaccountable and reckless plague rat.\"\n\nAs others have said, you're the perfect example of why testing a new partner is so important.",
            "author": "Intrepid_Egg_7722",
            "id": "goa71gh",
            "parent_id": "t1_go9pcs4",
            "score": 10,
            "created_utc": 1613951665.0,
            "replies": []
        },
        {
            "body": "Gross.  🤮",
            "author": "naughtychick9999",
            "id": "goa5xbi",
            "parent_id": "t1_go9pcs4",
            "score": 10,
            "created_utc": 1613951092.0,
            "replies": []
        },
        {
            "body": "What in the actual fuck? 🥴",
            "author": "Daisylil",
            "id": "go9yvww",
            "parent_id": "t1_go9pcs4",
            "score": 9,
            "created_utc": 1613947518.0,
            "replies": []
        },
        {
            "body": "Wouldn’t brag about this.",
            "author": "Hairy-Fudge-8148",
            "id": "go9sm48",
            "parent_id": "t1_go9pcs4",
            "score": 10,
            "created_utc": 1613944366.0,
            "replies": []
        },
        {
            "body": "Yikes. Please don’t play with your life like that.",
            "author": "littlemelaninmonroe",
            "id": "goamx5i",
            "parent_id": "t1_go9pcs4",
            "score": 3,
            "created_utc": 1613959982.0,
            "replies": []
        },
        {
            "body": "Cool story bro 🙄\n\nClown.",
            "author": "viewfrom61",
            "id": "goaslxd",
            "parent_id": "t1_go9pcs4",
            "score": 3,
            "created_utc": 1613962928.0,
            "replies": []
        },
        {
            "body": "Ew.",
            "author": "ladylunapluss",
            "id": "gob178v",
            "parent_id": "t1_go9pcs4",
            "score": 2,
            "created_utc": 1613967847.0,
            "replies": []
        },
        {
            "body": "No, I reside in Missouri. This guy would say the same thing. “You can’t catch anything from doing it just go ahead” or he’d think if he performed on me it would push me to do it. And I’m sorry this is TMI but he produced so much...pre-ejaculation I was completely turned off by even wanting to do it! Even if he got tested! 🤢 just thinking about it has my tummy turning",
            "author": "littlemelaninmonroe",
            "id": "goanpid",
            "parent_id": "t1_goan4kq",
            "score": 2,
            "created_utc": 1613960394.0,
            "replies": []
        },
        {
            "body": "Yes STI",
            "author": "littlemelaninmonroe",
            "id": "goasy7n",
            "parent_id": "t1_goasvm1",
            "score": 1,
            "created_utc": 1613963115.0,
            "replies": []
        },
        {
            "body": "Good for you! Excuses are lies.",
            "author": null,
            "id": "go9iw5l",
            "parent_id": "t1_go9fctq",
            "score": 13,
            "created_utc": 1613939848.0,
            "replies": []
        },
        {
            "body": "Many STIs can spread even with condoms, for example HSV, HPV, syphilis, etc. So if he had one of these, it's possible you've picked it up from him.",
            "author": "SeattleLaserMeteor",
            "id": "goad6ad",
            "parent_id": "t1_go9i4ex",
            "score": 9,
            "created_utc": 1613954939.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goaifxj",
            "parent_id": "t1_go9i4ex",
            "score": 3,
            "created_utc": 1613957665.0,
            "replies": [
                {
                    "body": "I won’t perform oral unless a test is done. I offered to do it with a condom but he didn’t want that. I would hope it’s common for sugaring as well as regular vanilla sex. I go to planned parenthood. They check urine for chlymidia/gono. and then draw blood for HIV, tech, syph, etc. the only thing they don’t check for is herpes unless you have visible signs of possibly having it.",
                    "author": "littlemelaninmonroe",
                    "id": "goamhx4",
                    "parent_id": "t1_goaifxj",
                    "score": 7,
                    "created_utc": 1613959757.0,
                    "replies": [
                        {
                            "body": "I’ve never had a SB or vanilla partner insist on using a condom for oral sex. Most have said they don’t like the taste of the condom.",
                            "author": "Fun_Focus8159",
                            "id": "goaubsd",
                            "parent_id": "t1_goamhx4",
                            "score": 2,
                            "created_utc": 1613963880.0,
                            "replies": [
                                {
                                    "body": "At that point I offered just to get him to shut up about it but yes the taste is terrible 😂",
                                    "author": "littlemelaninmonroe",
                                    "id": "goauhdx",
                                    "parent_id": "t1_goaubsd",
                                    "score": 2,
                                    "created_utc": 1613963968.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Is it normal in the bowl to use condoms/dental dams with oral sex too?\n\nNo, it's not, in fact the vast majority of SB's will not even ask me to use a condom and that is the truth.",
                    "author": null,
                    "id": "gobz238",
                    "parent_id": "t1_goaifxj",
                    "score": -1,
                    "created_utc": 1613995505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I won’t perform oral unless a test is done. I offered to do it with a condom but he didn’t want that. I would hope it’s common for sugaring as well as regular vanilla sex. I go to planned parenthood. They check urine for chlymidia/gono. and then draw blood for HIV, tech, syph, etc. the only thing they don’t check for is herpes unless you have visible signs of possibly having it.",
            "author": "littlemelaninmonroe",
            "id": "goamhx4",
            "parent_id": "t1_goaifxj",
            "score": 7,
            "created_utc": 1613959757.0,
            "replies": [
                {
                    "body": "I’ve never had a SB or vanilla partner insist on using a condom for oral sex. Most have said they don’t like the taste of the condom.",
                    "author": "Fun_Focus8159",
                    "id": "goaubsd",
                    "parent_id": "t1_goamhx4",
                    "score": 2,
                    "created_utc": 1613963880.0,
                    "replies": [
                        {
                            "body": "At that point I offered just to get him to shut up about it but yes the taste is terrible 😂",
                            "author": "littlemelaninmonroe",
                            "id": "goauhdx",
                            "parent_id": "t1_goaubsd",
                            "score": 2,
                            "created_utc": 1613963968.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Is it normal in the bowl to use condoms/dental dams with oral sex too?\n\nNo, it's not, in fact the vast majority of SB's will not even ask me to use a condom and that is the truth.",
            "author": null,
            "id": "gobz238",
            "parent_id": "t1_goaifxj",
            "score": -1,
            "created_utc": 1613995505.0,
            "replies": []
        },
        {
            "body": "I’ve never had a SB or vanilla partner insist on using a condom for oral sex. Most have said they don’t like the taste of the condom.",
            "author": "Fun_Focus8159",
            "id": "goaubsd",
            "parent_id": "t1_goamhx4",
            "score": 2,
            "created_utc": 1613963880.0,
            "replies": [
                {
                    "body": "At that point I offered just to get him to shut up about it but yes the taste is terrible 😂",
                    "author": "littlemelaninmonroe",
                    "id": "goauhdx",
                    "parent_id": "t1_goaubsd",
                    "score": 2,
                    "created_utc": 1613963968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At that point I offered just to get him to shut up about it but yes the taste is terrible 😂",
            "author": "littlemelaninmonroe",
            "id": "goauhdx",
            "parent_id": "t1_goaubsd",
            "score": 2,
            "created_utc": 1613963968.0,
            "replies": []
        }
    ]
}