{
    "title": "How would I get this type of wavy texture as well as a medium hold so it's still kinda loose?",
    "post_id": "e7yls5",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/e7yls5/how_would_i_get_this_type_of_wavy_texture_as_well/",
    "author": "ItzCW",
    "body": "",
    "url": "https://i.redd.it/poruilpisg341.jpg",
    "score": 351,
    "upvote_ratio": 0.97,
    "created_utc": 1575835385.0,
    "num_comments": 41,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "what type of hair do you have? His is coarse type 3a curly hair (curlier as it grows, typical hispanic curls). His hair is longer in the back than the front, so Im guessing the front of his hair is around 2 inches while the hair in the back of his head is 6-7 but dried with his hair pushed to front.",
            "author": "selfimprov101",
            "id": "fa7psqy",
            "parent_id": "t3_e7yls5",
            "score": 93,
            "created_utc": 1575836988.0,
            "replies": [
                {
                    "body": "my hair is quite thick and straight with a little bit of wave to it (not as wavy as his). it gets wavier when I leave it unwashed for a few days, my hair is relatively long thought I'm not sure exactly how long as I haven't really checked and my last haircut was at the start of November, however, my hair grows quite quickly too so\n\nedit: looking at the chart my hair is possibly a 1b or 2a",
                    "author": "ItzCW",
                    "id": "fa7t1uo",
                    "parent_id": "t1_fa7psqy",
                    "score": 27,
                    "created_utc": 1575837848.0,
                    "replies": [
                        {
                            "body": "If it gets curlier the longer you leave it unwashed sounds like you need to head over to r/curlyhair. They reccomend a shampoo with no sulfates aswell as a leave in conditioner to let curls take shape.",
                            "author": "selfimprov101",
                            "id": "fa7tgkj",
                            "parent_id": "t1_fa7t1uo",
                            "score": 29,
                            "created_utc": 1575837994.0,
                            "replies": [
                                {
                                    "body": "thanks, i'll go check it out",
                                    "author": "ItzCW",
                                    "id": "fa7ujfp",
                                    "parent_id": "t1_fa7tgkj",
                                    "score": 11,
                                    "created_utc": 1575838256.0,
                                    "replies": [
                                        {
                                            "body": "Ive gotten a hair cut similar, showed my barber the same dude in the photo. \n\nHeres the front view of this cut btw \n\n https://images.app.goo.gl/F3jZi9tabHjXtQLM9",
                                            "author": "selfimprov101",
                                            "id": "fa9bu2y",
                                            "parent_id": "t1_fa7ujfp",
                                            "score": 6,
                                            "created_utc": 1575868121.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "100% agree with the other commenter. As someone who followed their methods this has completely changed my hair texture and health!",
                                            "author": "Sleambean",
                                            "id": "fa8r9b9",
                                            "parent_id": "t1_fa7ujfp",
                                            "score": 2,
                                            "created_utc": 1575852782.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "chart?",
                            "author": "Abagofcheese",
                            "id": "fa882se",
                            "parent_id": "t1_fa7t1uo",
                            "score": 1,
                            "created_utc": 1575842590.0,
                            "replies": [
                                {
                                    "body": "just like the types of hair idk, not exactly a chart",
                                    "author": "ItzCW",
                                    "id": "fa8a8ry",
                                    "parent_id": "t1_fa882se",
                                    "score": 1,
                                    "created_utc": 1575843459.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fa8r4rr",
                    "parent_id": "t1_fa7psqy",
                    "score": 2,
                    "created_utc": 1575852695.0,
                    "replies": [
                        {
                            "body": "Curl chart? I use this one but its for longer hair obviously, its harder to determine for men sometimes. \n\nhttps://images.app.goo.gl/XNyetHzRoXAX296t5",
                            "author": "selfimprov101",
                            "id": "fa9afh4",
                            "parent_id": "t1_fa8r4rr",
                            "score": 4,
                            "created_utc": 1575866877.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How would I pull it off with 2b maybe 2c hair? Very thick and coarse",
                    "author": "SoggyNelco",
                    "id": "fa9a7md",
                    "parent_id": "t1_fa7psqy",
                    "score": 1,
                    "created_utc": 1575866686.0,
                    "replies": [
                        {
                            "body": "If you have 2c you could definitely pull this off, depends on how long your hair is now. But if your hair is already wavy and you havent vistied r/curlyhair then id recommend it.  I thought I had wavy hair until I visited that sub and went deep into their porosity/protein/moisture balance guides and figured out a routine that worked for me. Never knew I has 3c curls.",
                            "author": "selfimprov101",
                            "id": "fa9azp4",
                            "parent_id": "t1_fa9a7md",
                            "score": 4,
                            "created_utc": 1575867368.0,
                            "replies": [
                                {
                                    "body": "Yeah I'll have to check it out! Anything specific I should tell my barber?",
                                    "author": "SoggyNelco",
                                    "id": "fa9b7h4",
                                    "parent_id": "t1_fa9azp4",
                                    "score": 2,
                                    "created_utc": 1575867556.0,
                                    "replies": [
                                        {
                                            "body": "I would just show him the cut, ask for the same side length, or even a  fade, i would do this with a number 1 fade personally I think it would look sick. I would definitely make sure he knows to keep the length in the front half of your hair so he doesnt see it and start trimming everything evenly because most would probably look over the fact that you need the length in the back.",
                                            "author": "selfimprov101",
                                            "id": "fa9cb9n",
                                            "parent_id": "t1_fa9b7h4",
                                            "score": 2,
                                            "created_utc": 1575868561.0,
                                            "replies": [
                                                {
                                                    "body": "Awesome thank you so much!",
                                                    "author": "SoggyNelco",
                                                    "id": "fa9d30i",
                                                    "parent_id": "t1_fa9cb9n",
                                                    "score": 2,
                                                    "created_utc": 1575869290.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [I've been wearing my hair like the photo on the left for the majority of my life. I recently met someone who has encouraged me to embrace my inner curly girl!](https://i.redd.it/a04spr5pzxq21.jpg) | [501 comments](https://np.reddit.com/r/curlyhair/comments/banp7d/ive_been_wearing_my_hair_like_the_photo_on_the/)  \n\\#2: [Guys my wedding curls were freaking popping! Was so nervous cause I did it myself but loved it.](https://i.redd.it/cdlw6zn6hbd31.png) | [494 comments](https://np.reddit.com/r/curlyhair/comments/cjicci/guys_my_wedding_curls_were_freaking_popping_was/)  \n\\#3: [My 10 year curly glow up - from not even knowing I had curls to finding myself.](https://i.redd.it/94xzlqn1fw041.jpg) | [720 comments](https://np.reddit.com/r/curlyhair/comments/e1mukp/my_10_year_curly_glow_up_from_not_even_knowing_i/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
                                    "author": "sneakpeekbot",
                                    "id": "fa9b01h",
                                    "parent_id": "t1_fa9azp4",
                                    "score": 1,
                                    "created_utc": 1575867376.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a barber that specializes in perms. To get this I'd perm it with a wavy or gentle perm solution with purple rods, assuming your hair doesn't currently have this kind of texture already.",
            "author": "UglyBoi_801",
            "id": "fa85xop",
            "parent_id": "t3_e7yls5",
            "score": 29,
            "created_utc": 1575841572.0,
            "replies": [
                {
                    "body": "How do perms work? And can it be washed to keep its style? Asking because I’m interested in this.",
                    "author": "Ickiiis",
                    "id": "fa8mfck",
                    "parent_id": "t1_fa85xop",
                    "score": 12,
                    "created_utc": 1575849607.0,
                    "replies": [
                        {
                            "body": "The process of perming hair is by more or less forcing the hair to hold in a certain shape. This is achieved first by creating the desired effects with perm rods, which forms the curl or wave. Perm rods are color coded by size, which is a universal coding. Once the hair is rolled into the desired shape determined by your stylist, they then apply the perm solution. The solution is a rancid smelling liquid that breaks the disulfide bond in the hair. The hair has 3 bonds that each effect the hair in a certain way. The first bond is the hydrogen bond. This is a bond broken by water and heat. This is the primary bond in our hair's overall shape. The breaking of the hydrogen bond is why you shouldn't brush wet hair, because hair is more fragile when wet. The second bond is the salt bond. This accounts for 1/3 of our hairs overall strength.\nThe third is the disulfide bond, the bond affected in the perm process. This is a key bond in how hair lays longterm.  The perm solution comes in 2 key forms. Acidic, and Alkaline. The hair has a pH balance of about 5.0. An alkaline perm solution has a pH balance between 8.2 and 9.6, and is a stronger, but more damaging solution to the hair. Any sort of bleached hair is not a good candidate for an alkaline perm, as it can literally melt the hair off. But if your hair is virgin, i.e. not chemically altered in any previous way, your hair will be just fine with the heavier alkaline solution. Acid perm solution has a pH of around 4.5. To 6.5 and is a gentler solution, also great for releasing the curls overtime into gentle waves. After your hair has been processed. You will be rinsed out, and a neutralizing lotion will be applied. After 5 minutes, the rods are removed and the hair patted dry. The next 3 days is critical. NO washing, or getting the hair wet. NO blowdrying or styling products, and NO brushing. They will tell you 48 hours, I always recommend 72 for best results. After this period, you can wash it and style it as normal. The hair will hold and regain curl as it gets wet. If properly cared for, you can get about 3 to 6 months of great styles before it might be time to get it repermed. Lol kind of got in depth there, but i hope i provided you with enough info to make the right choice for you and what you're looking for.",
                            "author": "UglyBoi_801",
                            "id": "fa8wnfi",
                            "parent_id": "t1_fa8mfck",
                            "score": 68,
                            "created_utc": 1575856537.0,
                            "replies": [
                                {
                                    "body": "Damn, what a great comment. Kudos to you for taking the time to write it. I learned a lot about smth I didn’t expect to learn anything about!",
                                    "author": "TheGruesomeTwosome",
                                    "id": "fa90nta",
                                    "parent_id": "t1_fa8wnfi",
                                    "score": 13,
                                    "created_utc": 1575859395.0,
                                    "replies": []
                                },
                                {
                                    "body": "Wow that was amazing. Thank you. I have a thicker curly/wavy hair that kind of fros up when I wash and dry and I’ve been trying to find a way to tame it without having to straighten it. I may try this perm thing but I’d need to find a barber out here that does it. This has been a great help though!",
                                    "author": "Ickiiis",
                                    "id": "fa8z5g2",
                                    "parent_id": "t1_fa8wnfi",
                                    "score": 6,
                                    "created_utc": 1575858301.0,
                                    "replies": []
                                },
                                {
                                    "body": "My stylist had never told me to wait 48-72 hours and I never have. What the!!? What happens if I don’t wait?",
                                    "author": "BleachersLumineers",
                                    "id": "fa99ku0",
                                    "parent_id": "t1_fa8wnfi",
                                    "score": 3,
                                    "created_utc": 1575866137.0,
                                    "replies": [
                                        {
                                            "body": "Washing it is not recommended for a few days because the solution already breaks one bond in the hair, as you shower, you break the hydrogen bond. With 2 of 3 bonds compromised, it can lead to a lot of shedding, and loosen up the curls prematurely. 72 hours gives your hair a few days to recover and the bond to lay dormant.",
                                            "author": "UglyBoi_801",
                                            "id": "fa9cfee",
                                            "parent_id": "t1_fa99ku0",
                                            "score": 4,
                                            "created_utc": 1575868669.0,
                                            "replies": [
                                                {
                                                    "body": "Well now I know, thank you. Next time I’ll be prepared",
                                                    "author": "BleachersLumineers",
                                                    "id": "fa9dazf",
                                                    "parent_id": "t1_fa9cfee",
                                                    "score": 1,
                                                    "created_utc": 1575869506.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "How much is normal to pay for a perm? And would all stylists be able to do something like this, or would the style in this picture be difficult?\n\nThe owner of the salon I usually go to said she'd do it for £50 but the fancy salons charge a couple hundred, so I'm worried it might not be as good, or that she might make it too curly. I can't ask someone else to do it though because...you can't cheat on your stylist hahahaha",
                                    "author": "o0MSK0o",
                                    "id": "faa9n0b",
                                    "parent_id": "t1_fa8wnfi",
                                    "score": 1,
                                    "created_utc": 1575905616.0,
                                    "replies": [
                                        {
                                            "body": "The process of perms is pretty universal, it's not like coloring hair, where some people are good and some subpar, a £50 perm will be almost no different at all from £100+ perm. They won't make it too curly either. The first 2 days, your hair will have very tight curls that relax over the next 48 to 72 hours, so be sure to give it that grace period before you freak out!",
                                            "author": "UglyBoi_801",
                                            "id": "faab7hd",
                                            "parent_id": "t1_faa9n0b",
                                            "score": 2,
                                            "created_utc": 1575906406.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for the info!",
                                                    "author": "o0MSK0o",
                                                    "id": "faaimv7",
                                                    "parent_id": "t1_faab7hd",
                                                    "score": 1,
                                                    "created_utc": 1575909307.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "thanks for the advice however I don't wanna make it too curly, just enough wave to make it look like my hair when it isn't washed for a few days",
                    "author": "ItzCW",
                    "id": "fa8act2",
                    "parent_id": "t1_fa85xop",
                    "score": 2,
                    "created_utc": 1575843529.0,
                    "replies": [
                        {
                            "body": "You can still do that with a light perm. Look up Korean Perms as well. This pic is part of my collection for the style I’m considering and I’m planning on getting a perm to achieve it. There are many different types of perms.",
                            "author": null,
                            "id": "fa8imh1",
                            "parent_id": "t1_fa8act2",
                            "score": 3,
                            "created_utc": 1575847098.0,
                            "replies": [
                                {
                                    "body": "Oh really? I might look into that then too. Thanks for the suggestions they're much appreciated",
                                    "author": "ItzCW",
                                    "id": "fa8ippq",
                                    "parent_id": "t1_fa8imh1",
                                    "score": 1,
                                    "created_utc": 1575847159.0,
                                    "replies": [
                                        {
                                            "body": "Don't go for a perm if you can do it naturally! It's cheaper and healthier to see what your hair can do with its own texture.",
                                            "author": "Sleambean",
                                            "id": "fa8raol",
                                            "parent_id": "t1_fa8ippq",
                                            "score": 1,
                                            "created_utc": 1575852809.0,
                                            "replies": [
                                                {
                                                    "body": "I mean, I agree. I think my hair is a bit similar to OP though and I can’t really achieve the look I want. Its hard to get nice curls without doing something chemically and being a pain everyday.",
                                                    "author": null,
                                                    "id": "fa8yzwt",
                                                    "parent_id": "t1_fa8raol",
                                                    "score": 3,
                                                    "created_utc": 1575858189.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How would you describe the back and sides of this style?   The top is a bit too curly for me but I like the blend into the sides.",
            "author": "agonybreakfast",
            "id": "fa9tq8u",
            "parent_id": "t3_e7yls5",
            "score": 4,
            "created_utc": 1575891368.0,
            "replies": [
                {
                    "body": "I'm gonna leave this comment here because I want to know the response as well",
                    "author": "TheInsaneMind",
                    "id": "faaez1g",
                    "parent_id": "t1_fa9tq8u",
                    "score": 2,
                    "created_utc": 1575907915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sven Johnson?",
            "author": "Milohk",
            "id": "fa8xr1g",
            "parent_id": "t3_e7yls5",
            "score": 3,
            "created_utc": 1575857308.0,
            "replies": []
        },
        {
            "body": "What is this hairstyle called?",
            "author": "BleachersLumineers",
            "id": "fa99rld",
            "parent_id": "t3_e7yls5",
            "score": 3,
            "created_utc": 1575866298.0,
            "replies": []
        },
        {
            "body": "Where can I look at a hair chart and figure out my hair type?",
            "author": "ChrysosDraconem",
            "id": "fa9fudx",
            "parent_id": "t3_e7yls5",
            "score": 2,
            "created_utc": 1575872070.0,
            "replies": []
        },
        {
            "body": "I had hair like this before. Mine was a bit more frizzy but main thing was having naturally curly hair and getting the right cut. Try air drying your hair, when your hair is wet and naturally curly you can achieve this style with damp hair and let it air dry and it’ll have similar shape. Also do not blow dry without a diffuser. Blow drying will just mess your curls up. You can use a clay to give some hold but I haven’t used product in my hair in years and still can get it to stay up.",
            "author": "Goochmas",
            "id": "fa9awe0",
            "parent_id": "t3_e7yls5",
            "score": 1,
            "created_utc": 1575867286.0,
            "replies": []
        },
        {
            "body": "The hold is all about finding the right gel, applying when wet, and then “squeezing out the crunch” - basically you gently break up the over-gelled look with your hands until it looks soft and loose.",
            "author": "CAPTCHA_is_hard",
            "id": "faa6pt8",
            "parent_id": "t3_e7yls5",
            "score": 1,
            "created_utc": 1575903610.0,
            "replies": []
        },
        {
            "body": "Can I do this with 1a hair",
            "author": "isalgebruikt",
            "id": "faa8wik",
            "parent_id": "t3_e7yls5",
            "score": 1,
            "created_utc": 1575905136.0,
            "replies": []
        },
        {
            "body": "You don’t have the genes",
            "author": "Escape2003",
            "id": "fa9omyq",
            "parent_id": "t3_e7yls5",
            "score": 0,
            "created_utc": 1575883581.0,
            "replies": []
        },
        {
            "body": "my hair is quite thick and straight with a little bit of wave to it (not as wavy as his). it gets wavier when I leave it unwashed for a few days, my hair is relatively long thought I'm not sure exactly how long as I haven't really checked and my last haircut was at the start of November, however, my hair grows quite quickly too so\n\nedit: looking at the chart my hair is possibly a 1b or 2a",
            "author": "ItzCW",
            "id": "fa7t1uo",
            "parent_id": "t1_fa7psqy",
            "score": 27,
            "created_utc": 1575837848.0,
            "replies": [
                {
                    "body": "If it gets curlier the longer you leave it unwashed sounds like you need to head over to r/curlyhair. They reccomend a shampoo with no sulfates aswell as a leave in conditioner to let curls take shape.",
                    "author": "selfimprov101",
                    "id": "fa7tgkj",
                    "parent_id": "t1_fa7t1uo",
                    "score": 29,
                    "created_utc": 1575837994.0,
                    "replies": [
                        {
                            "body": "thanks, i'll go check it out",
                            "author": "ItzCW",
                            "id": "fa7ujfp",
                            "parent_id": "t1_fa7tgkj",
                            "score": 11,
                            "created_utc": 1575838256.0,
                            "replies": [
                                {
                                    "body": "Ive gotten a hair cut similar, showed my barber the same dude in the photo. \n\nHeres the front view of this cut btw \n\n https://images.app.goo.gl/F3jZi9tabHjXtQLM9",
                                    "author": "selfimprov101",
                                    "id": "fa9bu2y",
                                    "parent_id": "t1_fa7ujfp",
                                    "score": 6,
                                    "created_utc": 1575868121.0,
                                    "replies": []
                                },
                                {
                                    "body": "100% agree with the other commenter. As someone who followed their methods this has completely changed my hair texture and health!",
                                    "author": "Sleambean",
                                    "id": "fa8r9b9",
                                    "parent_id": "t1_fa7ujfp",
                                    "score": 2,
                                    "created_utc": 1575852782.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "chart?",
                    "author": "Abagofcheese",
                    "id": "fa882se",
                    "parent_id": "t1_fa7t1uo",
                    "score": 1,
                    "created_utc": 1575842590.0,
                    "replies": [
                        {
                            "body": "just like the types of hair idk, not exactly a chart",
                            "author": "ItzCW",
                            "id": "fa8a8ry",
                            "parent_id": "t1_fa882se",
                            "score": 1,
                            "created_utc": 1575843459.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fa8r4rr",
            "parent_id": "t1_fa7psqy",
            "score": 2,
            "created_utc": 1575852695.0,
            "replies": [
                {
                    "body": "Curl chart? I use this one but its for longer hair obviously, its harder to determine for men sometimes. \n\nhttps://images.app.goo.gl/XNyetHzRoXAX296t5",
                    "author": "selfimprov101",
                    "id": "fa9afh4",
                    "parent_id": "t1_fa8r4rr",
                    "score": 4,
                    "created_utc": 1575866877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How would I pull it off with 2b maybe 2c hair? Very thick and coarse",
            "author": "SoggyNelco",
            "id": "fa9a7md",
            "parent_id": "t1_fa7psqy",
            "score": 1,
            "created_utc": 1575866686.0,
            "replies": [
                {
                    "body": "If you have 2c you could definitely pull this off, depends on how long your hair is now. But if your hair is already wavy and you havent vistied r/curlyhair then id recommend it.  I thought I had wavy hair until I visited that sub and went deep into their porosity/protein/moisture balance guides and figured out a routine that worked for me. Never knew I has 3c curls.",
                    "author": "selfimprov101",
                    "id": "fa9azp4",
                    "parent_id": "t1_fa9a7md",
                    "score": 4,
                    "created_utc": 1575867368.0,
                    "replies": [
                        {
                            "body": "Yeah I'll have to check it out! Anything specific I should tell my barber?",
                            "author": "SoggyNelco",
                            "id": "fa9b7h4",
                            "parent_id": "t1_fa9azp4",
                            "score": 2,
                            "created_utc": 1575867556.0,
                            "replies": [
                                {
                                    "body": "I would just show him the cut, ask for the same side length, or even a  fade, i would do this with a number 1 fade personally I think it would look sick. I would definitely make sure he knows to keep the length in the front half of your hair so he doesnt see it and start trimming everything evenly because most would probably look over the fact that you need the length in the back.",
                                    "author": "selfimprov101",
                                    "id": "fa9cb9n",
                                    "parent_id": "t1_fa9b7h4",
                                    "score": 2,
                                    "created_utc": 1575868561.0,
                                    "replies": [
                                        {
                                            "body": "Awesome thank you so much!",
                                            "author": "SoggyNelco",
                                            "id": "fa9d30i",
                                            "parent_id": "t1_fa9cb9n",
                                            "score": 2,
                                            "created_utc": 1575869290.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [I've been wearing my hair like the photo on the left for the majority of my life. I recently met someone who has encouraged me to embrace my inner curly girl!](https://i.redd.it/a04spr5pzxq21.jpg) | [501 comments](https://np.reddit.com/r/curlyhair/comments/banp7d/ive_been_wearing_my_hair_like_the_photo_on_the/)  \n\\#2: [Guys my wedding curls were freaking popping! Was so nervous cause I did it myself but loved it.](https://i.redd.it/cdlw6zn6hbd31.png) | [494 comments](https://np.reddit.com/r/curlyhair/comments/cjicci/guys_my_wedding_curls_were_freaking_popping_was/)  \n\\#3: [My 10 year curly glow up - from not even knowing I had curls to finding myself.](https://i.redd.it/94xzlqn1fw041.jpg) | [720 comments](https://np.reddit.com/r/curlyhair/comments/e1mukp/my_10_year_curly_glow_up_from_not_even_knowing_i/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
                            "author": "sneakpeekbot",
                            "id": "fa9b01h",
                            "parent_id": "t1_fa9azp4",
                            "score": 1,
                            "created_utc": 1575867376.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How do perms work? And can it be washed to keep its style? Asking because I’m interested in this.",
            "author": "Ickiiis",
            "id": "fa8mfck",
            "parent_id": "t1_fa85xop",
            "score": 12,
            "created_utc": 1575849607.0,
            "replies": [
                {
                    "body": "The process of perming hair is by more or less forcing the hair to hold in a certain shape. This is achieved first by creating the desired effects with perm rods, which forms the curl or wave. Perm rods are color coded by size, which is a universal coding. Once the hair is rolled into the desired shape determined by your stylist, they then apply the perm solution. The solution is a rancid smelling liquid that breaks the disulfide bond in the hair. The hair has 3 bonds that each effect the hair in a certain way. The first bond is the hydrogen bond. This is a bond broken by water and heat. This is the primary bond in our hair's overall shape. The breaking of the hydrogen bond is why you shouldn't brush wet hair, because hair is more fragile when wet. The second bond is the salt bond. This accounts for 1/3 of our hairs overall strength.\nThe third is the disulfide bond, the bond affected in the perm process. This is a key bond in how hair lays longterm.  The perm solution comes in 2 key forms. Acidic, and Alkaline. The hair has a pH balance of about 5.0. An alkaline perm solution has a pH balance between 8.2 and 9.6, and is a stronger, but more damaging solution to the hair. Any sort of bleached hair is not a good candidate for an alkaline perm, as it can literally melt the hair off. But if your hair is virgin, i.e. not chemically altered in any previous way, your hair will be just fine with the heavier alkaline solution. Acid perm solution has a pH of around 4.5. To 6.5 and is a gentler solution, also great for releasing the curls overtime into gentle waves. After your hair has been processed. You will be rinsed out, and a neutralizing lotion will be applied. After 5 minutes, the rods are removed and the hair patted dry. The next 3 days is critical. NO washing, or getting the hair wet. NO blowdrying or styling products, and NO brushing. They will tell you 48 hours, I always recommend 72 for best results. After this period, you can wash it and style it as normal. The hair will hold and regain curl as it gets wet. If properly cared for, you can get about 3 to 6 months of great styles before it might be time to get it repermed. Lol kind of got in depth there, but i hope i provided you with enough info to make the right choice for you and what you're looking for.",
                    "author": "UglyBoi_801",
                    "id": "fa8wnfi",
                    "parent_id": "t1_fa8mfck",
                    "score": 68,
                    "created_utc": 1575856537.0,
                    "replies": [
                        {
                            "body": "Damn, what a great comment. Kudos to you for taking the time to write it. I learned a lot about smth I didn’t expect to learn anything about!",
                            "author": "TheGruesomeTwosome",
                            "id": "fa90nta",
                            "parent_id": "t1_fa8wnfi",
                            "score": 13,
                            "created_utc": 1575859395.0,
                            "replies": []
                        },
                        {
                            "body": "Wow that was amazing. Thank you. I have a thicker curly/wavy hair that kind of fros up when I wash and dry and I’ve been trying to find a way to tame it without having to straighten it. I may try this perm thing but I’d need to find a barber out here that does it. This has been a great help though!",
                            "author": "Ickiiis",
                            "id": "fa8z5g2",
                            "parent_id": "t1_fa8wnfi",
                            "score": 6,
                            "created_utc": 1575858301.0,
                            "replies": []
                        },
                        {
                            "body": "My stylist had never told me to wait 48-72 hours and I never have. What the!!? What happens if I don’t wait?",
                            "author": "BleachersLumineers",
                            "id": "fa99ku0",
                            "parent_id": "t1_fa8wnfi",
                            "score": 3,
                            "created_utc": 1575866137.0,
                            "replies": [
                                {
                                    "body": "Washing it is not recommended for a few days because the solution already breaks one bond in the hair, as you shower, you break the hydrogen bond. With 2 of 3 bonds compromised, it can lead to a lot of shedding, and loosen up the curls prematurely. 72 hours gives your hair a few days to recover and the bond to lay dormant.",
                                    "author": "UglyBoi_801",
                                    "id": "fa9cfee",
                                    "parent_id": "t1_fa99ku0",
                                    "score": 4,
                                    "created_utc": 1575868669.0,
                                    "replies": [
                                        {
                                            "body": "Well now I know, thank you. Next time I’ll be prepared",
                                            "author": "BleachersLumineers",
                                            "id": "fa9dazf",
                                            "parent_id": "t1_fa9cfee",
                                            "score": 1,
                                            "created_utc": 1575869506.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "How much is normal to pay for a perm? And would all stylists be able to do something like this, or would the style in this picture be difficult?\n\nThe owner of the salon I usually go to said she'd do it for £50 but the fancy salons charge a couple hundred, so I'm worried it might not be as good, or that she might make it too curly. I can't ask someone else to do it though because...you can't cheat on your stylist hahahaha",
                            "author": "o0MSK0o",
                            "id": "faa9n0b",
                            "parent_id": "t1_fa8wnfi",
                            "score": 1,
                            "created_utc": 1575905616.0,
                            "replies": [
                                {
                                    "body": "The process of perms is pretty universal, it's not like coloring hair, where some people are good and some subpar, a £50 perm will be almost no different at all from £100+ perm. They won't make it too curly either. The first 2 days, your hair will have very tight curls that relax over the next 48 to 72 hours, so be sure to give it that grace period before you freak out!",
                                    "author": "UglyBoi_801",
                                    "id": "faab7hd",
                                    "parent_id": "t1_faa9n0b",
                                    "score": 2,
                                    "created_utc": 1575906406.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for the info!",
                                            "author": "o0MSK0o",
                                            "id": "faaimv7",
                                            "parent_id": "t1_faab7hd",
                                            "score": 1,
                                            "created_utc": 1575909307.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "thanks for the advice however I don't wanna make it too curly, just enough wave to make it look like my hair when it isn't washed for a few days",
            "author": "ItzCW",
            "id": "fa8act2",
            "parent_id": "t1_fa85xop",
            "score": 2,
            "created_utc": 1575843529.0,
            "replies": [
                {
                    "body": "You can still do that with a light perm. Look up Korean Perms as well. This pic is part of my collection for the style I’m considering and I’m planning on getting a perm to achieve it. There are many different types of perms.",
                    "author": null,
                    "id": "fa8imh1",
                    "parent_id": "t1_fa8act2",
                    "score": 3,
                    "created_utc": 1575847098.0,
                    "replies": [
                        {
                            "body": "Oh really? I might look into that then too. Thanks for the suggestions they're much appreciated",
                            "author": "ItzCW",
                            "id": "fa8ippq",
                            "parent_id": "t1_fa8imh1",
                            "score": 1,
                            "created_utc": 1575847159.0,
                            "replies": [
                                {
                                    "body": "Don't go for a perm if you can do it naturally! It's cheaper and healthier to see what your hair can do with its own texture.",
                                    "author": "Sleambean",
                                    "id": "fa8raol",
                                    "parent_id": "t1_fa8ippq",
                                    "score": 1,
                                    "created_utc": 1575852809.0,
                                    "replies": [
                                        {
                                            "body": "I mean, I agree. I think my hair is a bit similar to OP though and I can’t really achieve the look I want. Its hard to get nice curls without doing something chemically and being a pain everyday.",
                                            "author": null,
                                            "id": "fa8yzwt",
                                            "parent_id": "t1_fa8raol",
                                            "score": 3,
                                            "created_utc": 1575858189.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm gonna leave this comment here because I want to know the response as well",
            "author": "TheInsaneMind",
            "id": "faaez1g",
            "parent_id": "t1_fa9tq8u",
            "score": 2,
            "created_utc": 1575907915.0,
            "replies": []
        },
        {
            "body": "If it gets curlier the longer you leave it unwashed sounds like you need to head over to r/curlyhair. They reccomend a shampoo with no sulfates aswell as a leave in conditioner to let curls take shape.",
            "author": "selfimprov101",
            "id": "fa7tgkj",
            "parent_id": "t1_fa7t1uo",
            "score": 29,
            "created_utc": 1575837994.0,
            "replies": [
                {
                    "body": "thanks, i'll go check it out",
                    "author": "ItzCW",
                    "id": "fa7ujfp",
                    "parent_id": "t1_fa7tgkj",
                    "score": 11,
                    "created_utc": 1575838256.0,
                    "replies": [
                        {
                            "body": "Ive gotten a hair cut similar, showed my barber the same dude in the photo. \n\nHeres the front view of this cut btw \n\n https://images.app.goo.gl/F3jZi9tabHjXtQLM9",
                            "author": "selfimprov101",
                            "id": "fa9bu2y",
                            "parent_id": "t1_fa7ujfp",
                            "score": 6,
                            "created_utc": 1575868121.0,
                            "replies": []
                        },
                        {
                            "body": "100% agree with the other commenter. As someone who followed their methods this has completely changed my hair texture and health!",
                            "author": "Sleambean",
                            "id": "fa8r9b9",
                            "parent_id": "t1_fa7ujfp",
                            "score": 2,
                            "created_utc": 1575852782.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "chart?",
            "author": "Abagofcheese",
            "id": "fa882se",
            "parent_id": "t1_fa7t1uo",
            "score": 1,
            "created_utc": 1575842590.0,
            "replies": [
                {
                    "body": "just like the types of hair idk, not exactly a chart",
                    "author": "ItzCW",
                    "id": "fa8a8ry",
                    "parent_id": "t1_fa882se",
                    "score": 1,
                    "created_utc": 1575843459.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Curl chart? I use this one but its for longer hair obviously, its harder to determine for men sometimes. \n\nhttps://images.app.goo.gl/XNyetHzRoXAX296t5",
            "author": "selfimprov101",
            "id": "fa9afh4",
            "parent_id": "t1_fa8r4rr",
            "score": 4,
            "created_utc": 1575866877.0,
            "replies": []
        },
        {
            "body": "If you have 2c you could definitely pull this off, depends on how long your hair is now. But if your hair is already wavy and you havent vistied r/curlyhair then id recommend it.  I thought I had wavy hair until I visited that sub and went deep into their porosity/protein/moisture balance guides and figured out a routine that worked for me. Never knew I has 3c curls.",
            "author": "selfimprov101",
            "id": "fa9azp4",
            "parent_id": "t1_fa9a7md",
            "score": 4,
            "created_utc": 1575867368.0,
            "replies": [
                {
                    "body": "Yeah I'll have to check it out! Anything specific I should tell my barber?",
                    "author": "SoggyNelco",
                    "id": "fa9b7h4",
                    "parent_id": "t1_fa9azp4",
                    "score": 2,
                    "created_utc": 1575867556.0,
                    "replies": [
                        {
                            "body": "I would just show him the cut, ask for the same side length, or even a  fade, i would do this with a number 1 fade personally I think it would look sick. I would definitely make sure he knows to keep the length in the front half of your hair so he doesnt see it and start trimming everything evenly because most would probably look over the fact that you need the length in the back.",
                            "author": "selfimprov101",
                            "id": "fa9cb9n",
                            "parent_id": "t1_fa9b7h4",
                            "score": 2,
                            "created_utc": 1575868561.0,
                            "replies": [
                                {
                                    "body": "Awesome thank you so much!",
                                    "author": "SoggyNelco",
                                    "id": "fa9d30i",
                                    "parent_id": "t1_fa9cb9n",
                                    "score": 2,
                                    "created_utc": 1575869290.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [I've been wearing my hair like the photo on the left for the majority of my life. I recently met someone who has encouraged me to embrace my inner curly girl!](https://i.redd.it/a04spr5pzxq21.jpg) | [501 comments](https://np.reddit.com/r/curlyhair/comments/banp7d/ive_been_wearing_my_hair_like_the_photo_on_the/)  \n\\#2: [Guys my wedding curls were freaking popping! Was so nervous cause I did it myself but loved it.](https://i.redd.it/cdlw6zn6hbd31.png) | [494 comments](https://np.reddit.com/r/curlyhair/comments/cjicci/guys_my_wedding_curls_were_freaking_popping_was/)  \n\\#3: [My 10 year curly glow up - from not even knowing I had curls to finding myself.](https://i.redd.it/94xzlqn1fw041.jpg) | [720 comments](https://np.reddit.com/r/curlyhair/comments/e1mukp/my_10_year_curly_glow_up_from_not_even_knowing_i/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
                    "author": "sneakpeekbot",
                    "id": "fa9b01h",
                    "parent_id": "t1_fa9azp4",
                    "score": 1,
                    "created_utc": 1575867376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The process of perming hair is by more or less forcing the hair to hold in a certain shape. This is achieved first by creating the desired effects with perm rods, which forms the curl or wave. Perm rods are color coded by size, which is a universal coding. Once the hair is rolled into the desired shape determined by your stylist, they then apply the perm solution. The solution is a rancid smelling liquid that breaks the disulfide bond in the hair. The hair has 3 bonds that each effect the hair in a certain way. The first bond is the hydrogen bond. This is a bond broken by water and heat. This is the primary bond in our hair's overall shape. The breaking of the hydrogen bond is why you shouldn't brush wet hair, because hair is more fragile when wet. The second bond is the salt bond. This accounts for 1/3 of our hairs overall strength.\nThe third is the disulfide bond, the bond affected in the perm process. This is a key bond in how hair lays longterm.  The perm solution comes in 2 key forms. Acidic, and Alkaline. The hair has a pH balance of about 5.0. An alkaline perm solution has a pH balance between 8.2 and 9.6, and is a stronger, but more damaging solution to the hair. Any sort of bleached hair is not a good candidate for an alkaline perm, as it can literally melt the hair off. But if your hair is virgin, i.e. not chemically altered in any previous way, your hair will be just fine with the heavier alkaline solution. Acid perm solution has a pH of around 4.5. To 6.5 and is a gentler solution, also great for releasing the curls overtime into gentle waves. After your hair has been processed. You will be rinsed out, and a neutralizing lotion will be applied. After 5 minutes, the rods are removed and the hair patted dry. The next 3 days is critical. NO washing, or getting the hair wet. NO blowdrying or styling products, and NO brushing. They will tell you 48 hours, I always recommend 72 for best results. After this period, you can wash it and style it as normal. The hair will hold and regain curl as it gets wet. If properly cared for, you can get about 3 to 6 months of great styles before it might be time to get it repermed. Lol kind of got in depth there, but i hope i provided you with enough info to make the right choice for you and what you're looking for.",
            "author": "UglyBoi_801",
            "id": "fa8wnfi",
            "parent_id": "t1_fa8mfck",
            "score": 68,
            "created_utc": 1575856537.0,
            "replies": [
                {
                    "body": "Damn, what a great comment. Kudos to you for taking the time to write it. I learned a lot about smth I didn’t expect to learn anything about!",
                    "author": "TheGruesomeTwosome",
                    "id": "fa90nta",
                    "parent_id": "t1_fa8wnfi",
                    "score": 13,
                    "created_utc": 1575859395.0,
                    "replies": []
                },
                {
                    "body": "Wow that was amazing. Thank you. I have a thicker curly/wavy hair that kind of fros up when I wash and dry and I’ve been trying to find a way to tame it without having to straighten it. I may try this perm thing but I’d need to find a barber out here that does it. This has been a great help though!",
                    "author": "Ickiiis",
                    "id": "fa8z5g2",
                    "parent_id": "t1_fa8wnfi",
                    "score": 6,
                    "created_utc": 1575858301.0,
                    "replies": []
                },
                {
                    "body": "My stylist had never told me to wait 48-72 hours and I never have. What the!!? What happens if I don’t wait?",
                    "author": "BleachersLumineers",
                    "id": "fa99ku0",
                    "parent_id": "t1_fa8wnfi",
                    "score": 3,
                    "created_utc": 1575866137.0,
                    "replies": [
                        {
                            "body": "Washing it is not recommended for a few days because the solution already breaks one bond in the hair, as you shower, you break the hydrogen bond. With 2 of 3 bonds compromised, it can lead to a lot of shedding, and loosen up the curls prematurely. 72 hours gives your hair a few days to recover and the bond to lay dormant.",
                            "author": "UglyBoi_801",
                            "id": "fa9cfee",
                            "parent_id": "t1_fa99ku0",
                            "score": 4,
                            "created_utc": 1575868669.0,
                            "replies": [
                                {
                                    "body": "Well now I know, thank you. Next time I’ll be prepared",
                                    "author": "BleachersLumineers",
                                    "id": "fa9dazf",
                                    "parent_id": "t1_fa9cfee",
                                    "score": 1,
                                    "created_utc": 1575869506.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "How much is normal to pay for a perm? And would all stylists be able to do something like this, or would the style in this picture be difficult?\n\nThe owner of the salon I usually go to said she'd do it for £50 but the fancy salons charge a couple hundred, so I'm worried it might not be as good, or that she might make it too curly. I can't ask someone else to do it though because...you can't cheat on your stylist hahahaha",
                    "author": "o0MSK0o",
                    "id": "faa9n0b",
                    "parent_id": "t1_fa8wnfi",
                    "score": 1,
                    "created_utc": 1575905616.0,
                    "replies": [
                        {
                            "body": "The process of perms is pretty universal, it's not like coloring hair, where some people are good and some subpar, a £50 perm will be almost no different at all from £100+ perm. They won't make it too curly either. The first 2 days, your hair will have very tight curls that relax over the next 48 to 72 hours, so be sure to give it that grace period before you freak out!",
                            "author": "UglyBoi_801",
                            "id": "faab7hd",
                            "parent_id": "t1_faa9n0b",
                            "score": 2,
                            "created_utc": 1575906406.0,
                            "replies": [
                                {
                                    "body": "Thanks for the info!",
                                    "author": "o0MSK0o",
                                    "id": "faaimv7",
                                    "parent_id": "t1_faab7hd",
                                    "score": 1,
                                    "created_utc": 1575909307.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can still do that with a light perm. Look up Korean Perms as well. This pic is part of my collection for the style I’m considering and I’m planning on getting a perm to achieve it. There are many different types of perms.",
            "author": null,
            "id": "fa8imh1",
            "parent_id": "t1_fa8act2",
            "score": 3,
            "created_utc": 1575847098.0,
            "replies": [
                {
                    "body": "Oh really? I might look into that then too. Thanks for the suggestions they're much appreciated",
                    "author": "ItzCW",
                    "id": "fa8ippq",
                    "parent_id": "t1_fa8imh1",
                    "score": 1,
                    "created_utc": 1575847159.0,
                    "replies": [
                        {
                            "body": "Don't go for a perm if you can do it naturally! It's cheaper and healthier to see what your hair can do with its own texture.",
                            "author": "Sleambean",
                            "id": "fa8raol",
                            "parent_id": "t1_fa8ippq",
                            "score": 1,
                            "created_utc": 1575852809.0,
                            "replies": [
                                {
                                    "body": "I mean, I agree. I think my hair is a bit similar to OP though and I can’t really achieve the look I want. Its hard to get nice curls without doing something chemically and being a pain everyday.",
                                    "author": null,
                                    "id": "fa8yzwt",
                                    "parent_id": "t1_fa8raol",
                                    "score": 3,
                                    "created_utc": 1575858189.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "thanks, i'll go check it out",
            "author": "ItzCW",
            "id": "fa7ujfp",
            "parent_id": "t1_fa7tgkj",
            "score": 11,
            "created_utc": 1575838256.0,
            "replies": [
                {
                    "body": "Ive gotten a hair cut similar, showed my barber the same dude in the photo. \n\nHeres the front view of this cut btw \n\n https://images.app.goo.gl/F3jZi9tabHjXtQLM9",
                    "author": "selfimprov101",
                    "id": "fa9bu2y",
                    "parent_id": "t1_fa7ujfp",
                    "score": 6,
                    "created_utc": 1575868121.0,
                    "replies": []
                },
                {
                    "body": "100% agree with the other commenter. As someone who followed their methods this has completely changed my hair texture and health!",
                    "author": "Sleambean",
                    "id": "fa8r9b9",
                    "parent_id": "t1_fa7ujfp",
                    "score": 2,
                    "created_utc": 1575852782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "just like the types of hair idk, not exactly a chart",
            "author": "ItzCW",
            "id": "fa8a8ry",
            "parent_id": "t1_fa882se",
            "score": 1,
            "created_utc": 1575843459.0,
            "replies": []
        },
        {
            "body": "Yeah I'll have to check it out! Anything specific I should tell my barber?",
            "author": "SoggyNelco",
            "id": "fa9b7h4",
            "parent_id": "t1_fa9azp4",
            "score": 2,
            "created_utc": 1575867556.0,
            "replies": [
                {
                    "body": "I would just show him the cut, ask for the same side length, or even a  fade, i would do this with a number 1 fade personally I think it would look sick. I would definitely make sure he knows to keep the length in the front half of your hair so he doesnt see it and start trimming everything evenly because most would probably look over the fact that you need the length in the back.",
                    "author": "selfimprov101",
                    "id": "fa9cb9n",
                    "parent_id": "t1_fa9b7h4",
                    "score": 2,
                    "created_utc": 1575868561.0,
                    "replies": [
                        {
                            "body": "Awesome thank you so much!",
                            "author": "SoggyNelco",
                            "id": "fa9d30i",
                            "parent_id": "t1_fa9cb9n",
                            "score": 2,
                            "created_utc": 1575869290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Here's a sneak peek of /r/curlyhair using the [top posts](https://np.reddit.com/r/curlyhair/top/?sort=top&t=year) of the year!\n\n\\#1: [I've been wearing my hair like the photo on the left for the majority of my life. I recently met someone who has encouraged me to embrace my inner curly girl!](https://i.redd.it/a04spr5pzxq21.jpg) | [501 comments](https://np.reddit.com/r/curlyhair/comments/banp7d/ive_been_wearing_my_hair_like_the_photo_on_the/)  \n\\#2: [Guys my wedding curls were freaking popping! Was so nervous cause I did it myself but loved it.](https://i.redd.it/cdlw6zn6hbd31.png) | [494 comments](https://np.reddit.com/r/curlyhair/comments/cjicci/guys_my_wedding_curls_were_freaking_popping_was/)  \n\\#3: [My 10 year curly glow up - from not even knowing I had curls to finding myself.](https://i.redd.it/94xzlqn1fw041.jpg) | [720 comments](https://np.reddit.com/r/curlyhair/comments/e1mukp/my_10_year_curly_glow_up_from_not_even_knowing_i/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
            "author": "sneakpeekbot",
            "id": "fa9b01h",
            "parent_id": "t1_fa9azp4",
            "score": 1,
            "created_utc": 1575867376.0,
            "replies": []
        },
        {
            "body": "Damn, what a great comment. Kudos to you for taking the time to write it. I learned a lot about smth I didn’t expect to learn anything about!",
            "author": "TheGruesomeTwosome",
            "id": "fa90nta",
            "parent_id": "t1_fa8wnfi",
            "score": 13,
            "created_utc": 1575859395.0,
            "replies": []
        },
        {
            "body": "Wow that was amazing. Thank you. I have a thicker curly/wavy hair that kind of fros up when I wash and dry and I’ve been trying to find a way to tame it without having to straighten it. I may try this perm thing but I’d need to find a barber out here that does it. This has been a great help though!",
            "author": "Ickiiis",
            "id": "fa8z5g2",
            "parent_id": "t1_fa8wnfi",
            "score": 6,
            "created_utc": 1575858301.0,
            "replies": []
        },
        {
            "body": "My stylist had never told me to wait 48-72 hours and I never have. What the!!? What happens if I don’t wait?",
            "author": "BleachersLumineers",
            "id": "fa99ku0",
            "parent_id": "t1_fa8wnfi",
            "score": 3,
            "created_utc": 1575866137.0,
            "replies": [
                {
                    "body": "Washing it is not recommended for a few days because the solution already breaks one bond in the hair, as you shower, you break the hydrogen bond. With 2 of 3 bonds compromised, it can lead to a lot of shedding, and loosen up the curls prematurely. 72 hours gives your hair a few days to recover and the bond to lay dormant.",
                    "author": "UglyBoi_801",
                    "id": "fa9cfee",
                    "parent_id": "t1_fa99ku0",
                    "score": 4,
                    "created_utc": 1575868669.0,
                    "replies": [
                        {
                            "body": "Well now I know, thank you. Next time I’ll be prepared",
                            "author": "BleachersLumineers",
                            "id": "fa9dazf",
                            "parent_id": "t1_fa9cfee",
                            "score": 1,
                            "created_utc": 1575869506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How much is normal to pay for a perm? And would all stylists be able to do something like this, or would the style in this picture be difficult?\n\nThe owner of the salon I usually go to said she'd do it for £50 but the fancy salons charge a couple hundred, so I'm worried it might not be as good, or that she might make it too curly. I can't ask someone else to do it though because...you can't cheat on your stylist hahahaha",
            "author": "o0MSK0o",
            "id": "faa9n0b",
            "parent_id": "t1_fa8wnfi",
            "score": 1,
            "created_utc": 1575905616.0,
            "replies": [
                {
                    "body": "The process of perms is pretty universal, it's not like coloring hair, where some people are good and some subpar, a £50 perm will be almost no different at all from £100+ perm. They won't make it too curly either. The first 2 days, your hair will have very tight curls that relax over the next 48 to 72 hours, so be sure to give it that grace period before you freak out!",
                    "author": "UglyBoi_801",
                    "id": "faab7hd",
                    "parent_id": "t1_faa9n0b",
                    "score": 2,
                    "created_utc": 1575906406.0,
                    "replies": [
                        {
                            "body": "Thanks for the info!",
                            "author": "o0MSK0o",
                            "id": "faaimv7",
                            "parent_id": "t1_faab7hd",
                            "score": 1,
                            "created_utc": 1575909307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh really? I might look into that then too. Thanks for the suggestions they're much appreciated",
            "author": "ItzCW",
            "id": "fa8ippq",
            "parent_id": "t1_fa8imh1",
            "score": 1,
            "created_utc": 1575847159.0,
            "replies": [
                {
                    "body": "Don't go for a perm if you can do it naturally! It's cheaper and healthier to see what your hair can do with its own texture.",
                    "author": "Sleambean",
                    "id": "fa8raol",
                    "parent_id": "t1_fa8ippq",
                    "score": 1,
                    "created_utc": 1575852809.0,
                    "replies": [
                        {
                            "body": "I mean, I agree. I think my hair is a bit similar to OP though and I can’t really achieve the look I want. Its hard to get nice curls without doing something chemically and being a pain everyday.",
                            "author": null,
                            "id": "fa8yzwt",
                            "parent_id": "t1_fa8raol",
                            "score": 3,
                            "created_utc": 1575858189.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ive gotten a hair cut similar, showed my barber the same dude in the photo. \n\nHeres the front view of this cut btw \n\n https://images.app.goo.gl/F3jZi9tabHjXtQLM9",
            "author": "selfimprov101",
            "id": "fa9bu2y",
            "parent_id": "t1_fa7ujfp",
            "score": 6,
            "created_utc": 1575868121.0,
            "replies": []
        },
        {
            "body": "100% agree with the other commenter. As someone who followed their methods this has completely changed my hair texture and health!",
            "author": "Sleambean",
            "id": "fa8r9b9",
            "parent_id": "t1_fa7ujfp",
            "score": 2,
            "created_utc": 1575852782.0,
            "replies": []
        },
        {
            "body": "I would just show him the cut, ask for the same side length, or even a  fade, i would do this with a number 1 fade personally I think it would look sick. I would definitely make sure he knows to keep the length in the front half of your hair so he doesnt see it and start trimming everything evenly because most would probably look over the fact that you need the length in the back.",
            "author": "selfimprov101",
            "id": "fa9cb9n",
            "parent_id": "t1_fa9b7h4",
            "score": 2,
            "created_utc": 1575868561.0,
            "replies": [
                {
                    "body": "Awesome thank you so much!",
                    "author": "SoggyNelco",
                    "id": "fa9d30i",
                    "parent_id": "t1_fa9cb9n",
                    "score": 2,
                    "created_utc": 1575869290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Washing it is not recommended for a few days because the solution already breaks one bond in the hair, as you shower, you break the hydrogen bond. With 2 of 3 bonds compromised, it can lead to a lot of shedding, and loosen up the curls prematurely. 72 hours gives your hair a few days to recover and the bond to lay dormant.",
            "author": "UglyBoi_801",
            "id": "fa9cfee",
            "parent_id": "t1_fa99ku0",
            "score": 4,
            "created_utc": 1575868669.0,
            "replies": [
                {
                    "body": "Well now I know, thank you. Next time I’ll be prepared",
                    "author": "BleachersLumineers",
                    "id": "fa9dazf",
                    "parent_id": "t1_fa9cfee",
                    "score": 1,
                    "created_utc": 1575869506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The process of perms is pretty universal, it's not like coloring hair, where some people are good and some subpar, a £50 perm will be almost no different at all from £100+ perm. They won't make it too curly either. The first 2 days, your hair will have very tight curls that relax over the next 48 to 72 hours, so be sure to give it that grace period before you freak out!",
            "author": "UglyBoi_801",
            "id": "faab7hd",
            "parent_id": "t1_faa9n0b",
            "score": 2,
            "created_utc": 1575906406.0,
            "replies": [
                {
                    "body": "Thanks for the info!",
                    "author": "o0MSK0o",
                    "id": "faaimv7",
                    "parent_id": "t1_faab7hd",
                    "score": 1,
                    "created_utc": 1575909307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don't go for a perm if you can do it naturally! It's cheaper and healthier to see what your hair can do with its own texture.",
            "author": "Sleambean",
            "id": "fa8raol",
            "parent_id": "t1_fa8ippq",
            "score": 1,
            "created_utc": 1575852809.0,
            "replies": [
                {
                    "body": "I mean, I agree. I think my hair is a bit similar to OP though and I can’t really achieve the look I want. Its hard to get nice curls without doing something chemically and being a pain everyday.",
                    "author": null,
                    "id": "fa8yzwt",
                    "parent_id": "t1_fa8raol",
                    "score": 3,
                    "created_utc": 1575858189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awesome thank you so much!",
            "author": "SoggyNelco",
            "id": "fa9d30i",
            "parent_id": "t1_fa9cb9n",
            "score": 2,
            "created_utc": 1575869290.0,
            "replies": []
        },
        {
            "body": "Well now I know, thank you. Next time I’ll be prepared",
            "author": "BleachersLumineers",
            "id": "fa9dazf",
            "parent_id": "t1_fa9cfee",
            "score": 1,
            "created_utc": 1575869506.0,
            "replies": []
        },
        {
            "body": "Thanks for the info!",
            "author": "o0MSK0o",
            "id": "faaimv7",
            "parent_id": "t1_faab7hd",
            "score": 1,
            "created_utc": 1575909307.0,
            "replies": []
        },
        {
            "body": "I mean, I agree. I think my hair is a bit similar to OP though and I can’t really achieve the look I want. Its hard to get nice curls without doing something chemically and being a pain everyday.",
            "author": null,
            "id": "fa8yzwt",
            "parent_id": "t1_fa8raol",
            "score": 3,
            "created_utc": 1575858189.0,
            "replies": []
        }
    ]
}