{
    "title": "I'm always seeing ppl afraid of having a receding hairline like I had since forever, but it might not always be or become that bad. You can still rock some solid hair. Make the best outta what you got.",
    "post_id": "i9itqj",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/i9itqj/im_always_seeing_ppl_afraid_of_having_a_receding/",
    "author": "valva-iama",
    "body": "",
    "url": "https://i.redd.it/kmths7x5sxg51.jpg",
    "score": 709,
    "upvote_ratio": 0.98,
    "created_utc": 1597397091.0,
    "num_comments": 33,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This looks solid on you man. Fade on a early receding hairline works just fine. And a trim every three weeks is my preferred option. \nAs others have pointed out if you could get a good beard you’d look the part for sure my man.",
            "author": "shashaankv2504",
            "id": "g1fgmg2",
            "parent_id": "t3_i9itqj",
            "score": 64,
            "created_utc": 1597402518.0,
            "replies": [
                {
                    "body": "Thanks a lot man.\n\nYea tell my barber, he completely fucked it up. Cheeks too low, neckline too high... no stache and I would've looked like I had a chin strap. Looked so terrible I had to get rid of it all, growing it out ended up looking baaad. I was at 2 cm of growth I believe. 😅\n\nBut I'm just at a few weeks of growing it out. Gotta be patient again I guess!",
                    "author": "valva-iama",
                    "id": "g1fmgpn",
                    "parent_id": "t1_g1fgmg2",
                    "score": 6,
                    "created_utc": 1597407020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm looking tired af because I just woke up so I went for a walk and checked out my hair. Truth is, I haven't cared much about my receding hairline anymore.\n\nI've had this since I was 17 or 18. I'm 24 now and it hasn't changed at all. Thought back then I couldn't have nice hair or care about hair styling because I thought at the start that I was pretty much fucked. Then thought I was fucked twice because I had a really pronounced widow's peak as a kid and with a receding hairline this made it even worse in my eyes back then.\n\nBut with a proper diet which I've started already to lose weight, some good quality products (some use DHT-blocking shampoos, Minoxidil but I haven't touched it so far) and a suiting haircut you can always make it better than worse and worse.\n\nI'm super happy with my hairstyle atm and I didn't succumb to this obsession over receding hairlines. Some post pictures up here that are more like a maturing hairline or a completely fine one. Even if the damage is done once you might start taking more care about your hair, you can still rock some really solid hair.",
            "author": "valva-iama",
            "id": "g1fcef1",
            "parent_id": "t3_i9itqj",
            "score": 42,
            "created_utc": 1597398444.0,
            "replies": [
                {
                    "body": "While I agree with 95% of your post, a proper diet and DHT shampoo is *not* enough for most people to stop hair loss.\n\nIf someone is balding  and wants to keep their hair they should take fin.  If they can’t tolerate it because of the sides they can always stop taking it, but most people do fine on it.",
                    "author": "michaelalex3",
                    "id": "g1fl8h4",
                    "parent_id": "t1_g1fcef1",
                    "score": 17,
                    "created_utc": 1597406171.0,
                    "replies": [
                        {
                            "body": "Yea I was mentioning Minoxidil, I was kiiiind of contemplating mentioning it but I don't want everybody to go crazy about it with the tiniest bit of recession I sometimes see on people. I personally would just grow out my beard and shave the top just to compensate hahaha.\n\nAddendum: But no, I wasn't intending on saying it as if it stops hair loss. Some people make things worse than they need to be though, that's why I think it's good to look after yourself even if it's \"just hair\".",
                            "author": "valva-iama",
                            "id": "g1fly7y",
                            "parent_id": "t1_g1fl8h4",
                            "score": 3,
                            "created_utc": 1597406656.0,
                            "replies": []
                        },
                        {
                            "body": "I think people should try things like the shampoo and being healthier at the first sign of thinning hair as a preventative measure and to see how they progress. If you do that and your hair gets worse then yea look into things like fin if you want.",
                            "author": null,
                            "id": "g1izwkp",
                            "parent_id": "t1_g1fl8h4",
                            "score": 1,
                            "created_utc": 1597467183.0,
                            "replies": []
                        },
                        {
                            "body": "I heard the side effects can be permenant",
                            "author": "Hararger",
                            "id": "g1g8ujn",
                            "parent_id": "t1_g1fl8h4",
                            "score": -1,
                            "created_utc": 1597419226.0,
                            "replies": [
                                {
                                    "body": "It’s incredibly rare for side effects to persist for very long after you stop taking it.  I’m not an expert, but I do know that millions of men have been taking the drug for decades, so if serious problems were even remotely common we’d be very aware.  If you want to convince yourself not to take it you can look up PFS.  I debated whether not not I should use it for a year or two before deciding it was worth the risk.  I’ve now been on it for 2.5 years and I’m doing just fine.",
                                    "author": "michaelalex3",
                                    "id": "g1gayg5",
                                    "parent_id": "t1_g1g8ujn",
                                    "score": 9,
                                    "created_utc": 1597420191.0,
                                    "replies": []
                                },
                                {
                                    "body": "You heard wrong for the majority of people",
                                    "author": "bornagainvirgin23",
                                    "id": "g1gga1x",
                                    "parent_id": "t1_g1g8ujn",
                                    "score": 3,
                                    "created_utc": 1597422592.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Looks great! Same hairline as well, since 17 or so, maybe younger. I turn 36 this month and I love my hair.",
                    "author": "iamabootdisk",
                    "id": "g1fksp5",
                    "parent_id": "t1_g1fcef1",
                    "score": 8,
                    "created_utc": 1597405881.0,
                    "replies": []
                },
                {
                    "body": "I’m really proud of you man! That’s awesome that you just roll with it cause I think your hair looks dope! \n\nI’m 17 and have had a pretty far receding hairline that leaves me with a widows peak since I was like 10 but it hasn’t changed much (*phew*), I’ve been trying to overcome the thought of it and haven’t been worried about it as much recently but seeing this post made me remember that other guys are going through the same too and that I’m not alone on this.",
                    "author": "Tsar-Kaleb",
                    "id": "g1fm3kj",
                    "parent_id": "t1_g1fcef1",
                    "score": 1,
                    "created_utc": 1597406765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that’s just my hairline since I was a kid, even my daughter and son have the same V shape widows peak like Vegeta or something lol. Rock it dude, no shame.",
            "author": "foreverland",
            "id": "g1fshzf",
            "parent_id": "t3_i9itqj",
            "score": 13,
            "created_utc": 1597410991.0,
            "replies": []
        },
        {
            "body": "You look tired of being the blonde Ricky Gervais.",
            "author": "premiumpinkgin",
            "id": "g1fiwzl",
            "parent_id": "t3_i9itqj",
            "score": 10,
            "created_utc": 1597404475.0,
            "replies": [
                {
                    "body": "I hear often enough from a friend that I look like a skinnier James Corden 😂",
                    "author": "valva-iama",
                    "id": "g1fm4bf",
                    "parent_id": "t1_g1fiwzl",
                    "score": 7,
                    "created_utc": 1597406779.0,
                    "replies": [
                        {
                            "body": "I immediately thought a beardy Gordon Ramsay",
                            "author": "ThestolenToast",
                            "id": "g1g7ceu",
                            "parent_id": "t1_g1fm4bf",
                            "score": 11,
                            "created_utc": 1597418541.0,
                            "replies": [
                                {
                                    "body": "Me too.",
                                    "author": null,
                                    "id": "g1hfapn",
                                    "parent_id": "t1_g1g7ceu",
                                    "score": 2,
                                    "created_utc": 1597438129.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1feffr",
            "parent_id": "t3_i9itqj",
            "score": 7,
            "created_utc": 1597400435.0,
            "replies": [
                {
                    "body": "Also the first half of your hair needs to be a bit longer than the rest of the top so it can rest on the hair behind it and hence keep the Pompadour in shape.",
                    "author": "arshhhhh",
                    "id": "g1feh8o",
                    "parent_id": "t1_g1feffr",
                    "score": 4,
                    "created_utc": 1597400482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You hair looks so great when I look at the photo I just think, 'wow that guy has great hair', I don't even notice the hairline, which isn't event that much of an issue anyway. Looking good buddy.",
            "author": "Acceptancehunter",
            "id": "g1ffuy8",
            "parent_id": "t3_i9itqj",
            "score": 11,
            "created_utc": 1597401804.0,
            "replies": []
        },
        {
            "body": "A mature hairline is a man’s hairline. No need to pine for the hairline of a teenage boy",
            "author": "Fr3xyR3xy",
            "id": "g1gu3ex",
            "parent_id": "t3_i9itqj",
            "score": 7,
            "created_utc": 1597428683.0,
            "replies": []
        },
        {
            "body": "I don't even call mine a receding hairline since I've had it seemingly my whole life. When I was 12 my friend, with a \"perfect hairline\", said I was going to be bald in my 20's. Well I still have the exact same \"receding\" hairline and he's starting to go bald lol.",
            "author": "3PNK",
            "id": "g1fwck4",
            "parent_id": "t3_i9itqj",
            "score": 8,
            "created_utc": 1597413181.0,
            "replies": [
                {
                    "body": "A long time ago the Houston Texans QB Matt Schaub called them his \"power alleys\". I've used the term ever since. I've also had the same hairline since I was young - and my dad had it up until his death. Maybe I'm in denial though - who knows.",
                    "author": "MrRabinowitz",
                    "id": "g1ht4ox",
                    "parent_id": "t1_g1fwck4",
                    "score": 1,
                    "created_utc": 1597444944.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks great! I honestly think people get way too concerned about having widow’s peaks on this sub. I’ve never seen someone with a widows peak and a full head of hair and thought “oh that dude’s balding”. I actually think they can look really good, it’s just a different hair line IMO",
            "author": null,
            "id": "g1g8cmw",
            "parent_id": "t3_i9itqj",
            "score": 5,
            "created_utc": 1597419008.0,
            "replies": []
        },
        {
            "body": "Hey what product are you using? It looks great.",
            "author": "MrRabinowitz",
            "id": "g1ht8np",
            "parent_id": "t3_i9itqj",
            "score": 2,
            "created_utc": 1597445000.0,
            "replies": [
                {
                    "body": "Hey, thanks a lot. It really depends on the day. In that one I've used Templeton Tonics Oasis Clay. I often use Tropics Matte Clay and Stickmore Clay Fiber aswell on other days.",
                    "author": "valva-iama",
                    "id": "g1idbk5",
                    "parent_id": "t1_g1ht8np",
                    "score": 1,
                    "created_utc": 1597456037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a similar hairline as yours maybe a bit less receding on the temples. But the haircut that works best for that hairline is getting a mid-level fade. That way the U-shaped hairline isn’t as pronounced 👍🏻 \n\nAnd your hair looks great!",
            "author": "ashareif",
            "id": "g1ff4hc",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1597401098.0,
            "replies": []
        },
        {
            "body": "James, Is that you on a diet?",
            "author": "Yahya_Muhammad",
            "id": "g1g4rc1",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1597417311.0,
            "replies": []
        },
        {
            "body": "Look handsome",
            "author": "glasgow19123",
            "id": "g1g584c",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1597417546.0,
            "replies": []
        },
        {
            "body": "You look like the italian TV host Alessandro Cattelan",
            "author": "Lilluzzo",
            "id": "g1glefz",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1597424854.0,
            "replies": []
        },
        {
            "body": "Confidence Is Key!",
            "author": "ExternalCrib",
            "id": "g1grwuj",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1597427723.0,
            "replies": []
        },
        {
            "body": "I feel you man, 28 here. I’ve always had a big widow’s peak, since my early 20’s certainly. I used to get anxious or self conscious about my hairline all the time. Then I hopped on finasteride and got the sides you hear people talk about, then said ahh hell with messing with my hormones. You can own the receding hairline, I feel like it’s almost expected for men a certain age. If you end up bald due to genetics, then just shave it and own it.\n\nCut looks good my man, keep flexin’",
            "author": "Goowop991",
            "id": "g1i30x9",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1597450205.0,
            "replies": []
        },
        {
            "body": "Kinda late to the party but I just had to comment. I have a receding hairline that gets worse and worse and I've been looking for someone who has a similar shaped hairline and my man you have and you fucking rock it!  \nI just wonder how long I need to grow my hair out to get your length. This is the kind of pic I would show my barber to make it the same.",
            "author": "-Zloy-",
            "id": "gevr9y6",
            "parent_id": "t3_i9itqj",
            "score": 1,
            "created_utc": 1607293783.0,
            "replies": []
        },
        {
            "body": "You say that but it really depends on your face structure. Not all people look good with a receding hairline. Yeah you are rockin it for sure.",
            "author": "redditbluepurplegold",
            "id": "g1ff564",
            "parent_id": "t3_i9itqj",
            "score": 0,
            "created_utc": 1597401116.0,
            "replies": [
                {
                    "body": "No doubt, but I think that's a whole different problem on its own. My message was just to do the best with what you've got and not be obsessed over some things that are naturally just bound to happen.",
                    "author": "valva-iama",
                    "id": "g1fiyql",
                    "parent_id": "t1_g1ff564",
                    "score": 1,
                    "created_utc": 1597404516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks a lot man.\n\nYea tell my barber, he completely fucked it up. Cheeks too low, neckline too high... no stache and I would've looked like I had a chin strap. Looked so terrible I had to get rid of it all, growing it out ended up looking baaad. I was at 2 cm of growth I believe. 😅\n\nBut I'm just at a few weeks of growing it out. Gotta be patient again I guess!",
            "author": "valva-iama",
            "id": "g1fmgpn",
            "parent_id": "t1_g1fgmg2",
            "score": 6,
            "created_utc": 1597407020.0,
            "replies": []
        },
        {
            "body": "While I agree with 95% of your post, a proper diet and DHT shampoo is *not* enough for most people to stop hair loss.\n\nIf someone is balding  and wants to keep their hair they should take fin.  If they can’t tolerate it because of the sides they can always stop taking it, but most people do fine on it.",
            "author": "michaelalex3",
            "id": "g1fl8h4",
            "parent_id": "t1_g1fcef1",
            "score": 17,
            "created_utc": 1597406171.0,
            "replies": [
                {
                    "body": "Yea I was mentioning Minoxidil, I was kiiiind of contemplating mentioning it but I don't want everybody to go crazy about it with the tiniest bit of recession I sometimes see on people. I personally would just grow out my beard and shave the top just to compensate hahaha.\n\nAddendum: But no, I wasn't intending on saying it as if it stops hair loss. Some people make things worse than they need to be though, that's why I think it's good to look after yourself even if it's \"just hair\".",
                    "author": "valva-iama",
                    "id": "g1fly7y",
                    "parent_id": "t1_g1fl8h4",
                    "score": 3,
                    "created_utc": 1597406656.0,
                    "replies": []
                },
                {
                    "body": "I think people should try things like the shampoo and being healthier at the first sign of thinning hair as a preventative measure and to see how they progress. If you do that and your hair gets worse then yea look into things like fin if you want.",
                    "author": null,
                    "id": "g1izwkp",
                    "parent_id": "t1_g1fl8h4",
                    "score": 1,
                    "created_utc": 1597467183.0,
                    "replies": []
                },
                {
                    "body": "I heard the side effects can be permenant",
                    "author": "Hararger",
                    "id": "g1g8ujn",
                    "parent_id": "t1_g1fl8h4",
                    "score": -1,
                    "created_utc": 1597419226.0,
                    "replies": [
                        {
                            "body": "It’s incredibly rare for side effects to persist for very long after you stop taking it.  I’m not an expert, but I do know that millions of men have been taking the drug for decades, so if serious problems were even remotely common we’d be very aware.  If you want to convince yourself not to take it you can look up PFS.  I debated whether not not I should use it for a year or two before deciding it was worth the risk.  I’ve now been on it for 2.5 years and I’m doing just fine.",
                            "author": "michaelalex3",
                            "id": "g1gayg5",
                            "parent_id": "t1_g1g8ujn",
                            "score": 9,
                            "created_utc": 1597420191.0,
                            "replies": []
                        },
                        {
                            "body": "You heard wrong for the majority of people",
                            "author": "bornagainvirgin23",
                            "id": "g1gga1x",
                            "parent_id": "t1_g1g8ujn",
                            "score": 3,
                            "created_utc": 1597422592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Looks great! Same hairline as well, since 17 or so, maybe younger. I turn 36 this month and I love my hair.",
            "author": "iamabootdisk",
            "id": "g1fksp5",
            "parent_id": "t1_g1fcef1",
            "score": 8,
            "created_utc": 1597405881.0,
            "replies": []
        },
        {
            "body": "I’m really proud of you man! That’s awesome that you just roll with it cause I think your hair looks dope! \n\nI’m 17 and have had a pretty far receding hairline that leaves me with a widows peak since I was like 10 but it hasn’t changed much (*phew*), I’ve been trying to overcome the thought of it and haven’t been worried about it as much recently but seeing this post made me remember that other guys are going through the same too and that I’m not alone on this.",
            "author": "Tsar-Kaleb",
            "id": "g1fm3kj",
            "parent_id": "t1_g1fcef1",
            "score": 1,
            "created_utc": 1597406765.0,
            "replies": []
        },
        {
            "body": "I hear often enough from a friend that I look like a skinnier James Corden 😂",
            "author": "valva-iama",
            "id": "g1fm4bf",
            "parent_id": "t1_g1fiwzl",
            "score": 7,
            "created_utc": 1597406779.0,
            "replies": [
                {
                    "body": "I immediately thought a beardy Gordon Ramsay",
                    "author": "ThestolenToast",
                    "id": "g1g7ceu",
                    "parent_id": "t1_g1fm4bf",
                    "score": 11,
                    "created_utc": 1597418541.0,
                    "replies": [
                        {
                            "body": "Me too.",
                            "author": null,
                            "id": "g1hfapn",
                            "parent_id": "t1_g1g7ceu",
                            "score": 2,
                            "created_utc": 1597438129.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also the first half of your hair needs to be a bit longer than the rest of the top so it can rest on the hair behind it and hence keep the Pompadour in shape.",
            "author": "arshhhhh",
            "id": "g1feh8o",
            "parent_id": "t1_g1feffr",
            "score": 4,
            "created_utc": 1597400482.0,
            "replies": []
        },
        {
            "body": "A long time ago the Houston Texans QB Matt Schaub called them his \"power alleys\". I've used the term ever since. I've also had the same hairline since I was young - and my dad had it up until his death. Maybe I'm in denial though - who knows.",
            "author": "MrRabinowitz",
            "id": "g1ht4ox",
            "parent_id": "t1_g1fwck4",
            "score": 1,
            "created_utc": 1597444944.0,
            "replies": []
        },
        {
            "body": "Hey, thanks a lot. It really depends on the day. In that one I've used Templeton Tonics Oasis Clay. I often use Tropics Matte Clay and Stickmore Clay Fiber aswell on other days.",
            "author": "valva-iama",
            "id": "g1idbk5",
            "parent_id": "t1_g1ht8np",
            "score": 1,
            "created_utc": 1597456037.0,
            "replies": []
        },
        {
            "body": "No doubt, but I think that's a whole different problem on its own. My message was just to do the best with what you've got and not be obsessed over some things that are naturally just bound to happen.",
            "author": "valva-iama",
            "id": "g1fiyql",
            "parent_id": "t1_g1ff564",
            "score": 1,
            "created_utc": 1597404516.0,
            "replies": []
        },
        {
            "body": "Yea I was mentioning Minoxidil, I was kiiiind of contemplating mentioning it but I don't want everybody to go crazy about it with the tiniest bit of recession I sometimes see on people. I personally would just grow out my beard and shave the top just to compensate hahaha.\n\nAddendum: But no, I wasn't intending on saying it as if it stops hair loss. Some people make things worse than they need to be though, that's why I think it's good to look after yourself even if it's \"just hair\".",
            "author": "valva-iama",
            "id": "g1fly7y",
            "parent_id": "t1_g1fl8h4",
            "score": 3,
            "created_utc": 1597406656.0,
            "replies": []
        },
        {
            "body": "I think people should try things like the shampoo and being healthier at the first sign of thinning hair as a preventative measure and to see how they progress. If you do that and your hair gets worse then yea look into things like fin if you want.",
            "author": null,
            "id": "g1izwkp",
            "parent_id": "t1_g1fl8h4",
            "score": 1,
            "created_utc": 1597467183.0,
            "replies": []
        },
        {
            "body": "I heard the side effects can be permenant",
            "author": "Hararger",
            "id": "g1g8ujn",
            "parent_id": "t1_g1fl8h4",
            "score": -1,
            "created_utc": 1597419226.0,
            "replies": [
                {
                    "body": "It’s incredibly rare for side effects to persist for very long after you stop taking it.  I’m not an expert, but I do know that millions of men have been taking the drug for decades, so if serious problems were even remotely common we’d be very aware.  If you want to convince yourself not to take it you can look up PFS.  I debated whether not not I should use it for a year or two before deciding it was worth the risk.  I’ve now been on it for 2.5 years and I’m doing just fine.",
                    "author": "michaelalex3",
                    "id": "g1gayg5",
                    "parent_id": "t1_g1g8ujn",
                    "score": 9,
                    "created_utc": 1597420191.0,
                    "replies": []
                },
                {
                    "body": "You heard wrong for the majority of people",
                    "author": "bornagainvirgin23",
                    "id": "g1gga1x",
                    "parent_id": "t1_g1g8ujn",
                    "score": 3,
                    "created_utc": 1597422592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I immediately thought a beardy Gordon Ramsay",
            "author": "ThestolenToast",
            "id": "g1g7ceu",
            "parent_id": "t1_g1fm4bf",
            "score": 11,
            "created_utc": 1597418541.0,
            "replies": [
                {
                    "body": "Me too.",
                    "author": null,
                    "id": "g1hfapn",
                    "parent_id": "t1_g1g7ceu",
                    "score": 2,
                    "created_utc": 1597438129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s incredibly rare for side effects to persist for very long after you stop taking it.  I’m not an expert, but I do know that millions of men have been taking the drug for decades, so if serious problems were even remotely common we’d be very aware.  If you want to convince yourself not to take it you can look up PFS.  I debated whether not not I should use it for a year or two before deciding it was worth the risk.  I’ve now been on it for 2.5 years and I’m doing just fine.",
            "author": "michaelalex3",
            "id": "g1gayg5",
            "parent_id": "t1_g1g8ujn",
            "score": 9,
            "created_utc": 1597420191.0,
            "replies": []
        },
        {
            "body": "You heard wrong for the majority of people",
            "author": "bornagainvirgin23",
            "id": "g1gga1x",
            "parent_id": "t1_g1g8ujn",
            "score": 3,
            "created_utc": 1597422592.0,
            "replies": []
        },
        {
            "body": "Me too.",
            "author": null,
            "id": "g1hfapn",
            "parent_id": "t1_g1g7ceu",
            "score": 2,
            "created_utc": 1597438129.0,
            "replies": []
        }
    ]
}