{
    "title": "[SNS] I can only imagine YSC is smiling wide with his gums showing in these shots~",
    "post_id": "107ed8y",
    "post_url": "https://www.reddit.com/r/runningman/comments/107ed8y/sns_i_can_only_imagine_ysc_is_smiling_wide_with/",
    "author": "Deroucadetoo",
    "body": "",
    "url": "https://www.instagram.com/p/CnMiFGRLPqO/?igshid=NDk5N2NlZjQ=",
    "score": 447,
    "upvote_ratio": 0.99,
    "created_utc": 1673270791.0,
    "num_comments": 33,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "i was genuinely surprised when i first saw the pics and not the caption TT\n\nanw, love their friendship so much! ^^",
            "author": "_abcj",
            "id": "j3lss16",
            "parent_id": "t3_107ed8y",
            "score": 74,
            "created_utc": 1673270975.0,
            "replies": []
        },
        {
            "body": "somin wake up and decided to supply us with all pictures with members",
            "author": "AkifSafwan02",
            "id": "j3lyniw",
            "parent_id": "t3_107ed8y",
            "score": 63,
            "created_utc": 1673273790.0,
            "replies": []
        },
        {
            "body": "I hope they grow old together, even if it’s just as friends 😊",
            "author": "Few-Particular1780",
            "id": "j3mqtgb",
            "parent_id": "t3_107ed8y",
            "score": 49,
            "created_utc": 1673285056.0,
            "replies": [
                {
                    "body": "Wow this is such a beautiful thought 🥺 a great consolation if the ship never sailed irl",
                    "author": "MontGenevieve",
                    "id": "j3pknjf",
                    "parent_id": "t1_j3mqtgb",
                    "score": 15,
                    "created_utc": 1673325231.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "reminds me of the recent family outing episode when both being ask about seeing each other parents XD",
            "author": "shems-2383",
            "id": "j3lt2b9",
            "parent_id": "t3_107ed8y",
            "score": 38,
            "created_utc": 1673271121.0,
            "replies": [
                {
                    "body": "The time JSM pretended to be pregnant was gold. She's great with such skits.",
                    "author": "BoneToBeWild",
                    "id": "j3lywn6",
                    "parent_id": "t1_j3lt2b9",
                    "score": 58,
                    "created_utc": 1673273908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OKAY I WAS NOT PREPARED!!! How can they not win couple of the year cmon SBS!! Do better 😤",
            "author": "MontGenevieve",
            "id": "j3lymof",
            "parent_id": "t3_107ed8y",
            "score": 57,
            "created_utc": 1673273779.0,
            "replies": [
                {
                    "body": "I would love to see them winning the best couple award, but they did not win(probably won't as well) because on-screen they are not seen as a couple. It is only YJS and sometimes JSJ starts the conversation, force them to be a couple, but most part of the show JSM and YSC plays the game as a member of RM. Sometimes JSM starts roleplaying but YSC doesn't seem to play the role even though he is good in skit and his skit of \"BF/GF\" with Jang Do-young was hit on Big Comedy League.\n\nIf you watch the episodes when LKS and JSM won the best couple of award, you'll realize the difference. It was natural between them, not forced like this.\n\nOff screen they are really friends and who knows what will happen in the future, but for now I don't think they will win the best couple award, unless something changes.",
                    "author": "kkang_kkang",
                    "id": "j3nlos7",
                    "parent_id": "t1_j3lymof",
                    "score": 19,
                    "created_utc": 1673296276.0,
                    "replies": [
                        {
                            "body": "Fishy for Sechan to not play along with JSM (Kidding, maybe he really had a girlfriend and was feeling awkward as hell) but Sechan please!!! 🤣",
                            "author": "glassesinglamour",
                            "id": "j3oeit8",
                            "parent_id": "t1_j3nlos7",
                            "score": 8,
                            "created_utc": 1673307135.0,
                            "replies": [
                                {
                                    "body": "YSC in general doesn't enjoy playing a fool, I've noticed. He can do that as a character he plays but not an extension of himself. He doesn't like being put down by the guest or brushed aside. I mean, nobody does; but he especially can't play along with that type of joke. So I think for him to play along with this loveline would mean he has to be the butler role again and he doesn't want that. Can't blame him. He spent his first four years on the show playing the butler to KJK! It could also be that it is difficult for him to joke about this because he has real feelings for her, something he doesn't want to play around with because it is just too personal. Sort of like a \"this isn't a joke to me\" feel. Or like you said, he might have someone in his life and is just being respectful. If that was the case though, I think he should have told the cast and crew and not even have the hints of lovelines. They're cringe anyways. 😁",
                                    "author": "Ancient_Reply4583",
                                    "id": "j3pkj8f",
                                    "parent_id": "t1_j3oeit8",
                                    "score": 11,
                                    "created_utc": 1673325168.0,
                                    "replies": [
                                        {
                                            "body": "ikr and i love him for that! a man is more charming when he knows his worth and is confident with himself. though he is not seen as fit to sk's beauty standards, i loved how he tries to shoot his shot with his one and only crush until today, son na eun. he seemed REALLY really smitten with and probably felt like he had no chance so didn't pursue her anymore. nevertheless, i'd only ever seen him in instances being pushed with a female celeb is with haha and mirani, i forgot the other one but i think that's it. also, we hear how great of a guy he is and how much sm's fam likes him but ig he's def eyeing someone else haha",
                                            "author": "taylorsanatomy13_",
                                            "id": "j3r34lq",
                                            "parent_id": "t1_j3pkj8f",
                                            "score": 0,
                                            "created_utc": 1673360960.0,
                                            "replies": [
                                                {
                                                    "body": "Not sure I would put it that way. Just because he isn't willing to go there doesn't mean those who are willing don't know their worth. KwangSoo is an example of someone who would do just about anything if the role requires him even if that role is a variety persona. I think I respect that more, to tell you the truth. Not being open to certain harmless jokes and characters is definitely not something I would consider a strong point. My comment wasn't praise, quite the contrary. I think he isn't as flexible as some of the other cast members and that is one reason it took him so long to integrate into this cast. \n\nA huge part of acting (which lets face it this is) is being open to trying new things and going for it. Think of all the great actors and actresses: they're fearless performers because they don't say no when a role demands something they're uncomfortable with. In fact, most look at it as a great challenge. This is also why I believe actors are better variety stars and guests than idols and comedians. They're more open to play up their roles and can more easily detach from themselves. (Of course not all actors. Even on the cast, SJH who is an actor is an example of someone who's not good at variety, and this isn't a diss. Even her fans acknowledge this. I'm trying to say I'm not overgeneralizing.) \n\nHaving said all of this, I'm not blaming him, not at all. He has every right to choose he isn't comfortable with something and not want to do it. I'm just saying that I don't think him not doing something means others that do those things have no self-respect. I hope that is clear. \n\nAbout him not pursuing someone like an Apink member, it makes total sense. You have to realize this is an Asian country and their jobs are very public. In SK society and in the entertainment industry, a comedian is the lowest \"class\" of entertainer in the sense that it isn't exactly a respectable job that is highly regarded. I think I've seen people saying it is usually actors on the top (the only group that get seating near stages and private dressing rooms at award shows), then singers, then idols and lastly comedians. He is already at a disadvantage, especially being the man. Think of it as a male office worker being interested in a female doctor. It shouldn't matter, people are not their jobs and there is nothing wrong with being a comedian or office worker - it is just that Asian countries especially put a huge emphasis on people's jobs and social standing. This is why we grow up being forced to become either a doctor, an engineering or a lawyer. (I'm from another Asian country, not SK) \n\nVisually, I don't think women care as much about looks as men do and I also genuinely think YSC is good looking enough. So if I were NE I wouldn't care. But it's not that simple. Idol fans worship their idols, and think nobody is good enough for them. So if a guy that is average looking at best by SK's made-up beauty standards started dating their idol, all hell will break loose. So he might have been worried about that too. He isn't as famous as these idols to have seen the flood of attention, so he might have been scared. I also don't know why people keep saying he must have someone else. Y'all do know that people can not like someone without having to be in love with someone else, right?",
                                                    "author": "Ancient_Reply4583",
                                                    "id": "j3rck7r",
                                                    "parent_id": "t1_j3r34lq",
                                                    "score": 4,
                                                    "created_utc": 1673364814.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was smiling for a whole minute because of the pictures 🥹🤧",
            "author": "Economy-Lab-6914",
            "id": "j3lvjb2",
            "parent_id": "t3_107ed8y",
            "score": 28,
            "created_utc": 1673272332.0,
            "replies": [
                {
                    "body": "This!! I even zoomed in and was even more dazzled!! SECHAN OPEN YOUR EYES, LOOK AT THAT WOMAN LOOKING AT YOU LIKE THAT 🥰",
                    "author": "MontGenevieve",
                    "id": "j3pkrne",
                    "parent_id": "t1_j3lvjb2",
                    "score": 13,
                    "created_utc": 1673325292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just give them Best Couple Award.",
            "author": "NavdeepNSG",
            "id": "j3mgb16",
            "parent_id": "t3_107ed8y",
            "score": 26,
            "created_utc": 1673281082.0,
            "replies": [
                {
                    "body": "Somin doing her best to win that award with anyone she can 🤣",
                    "author": "UnderOurPants",
                    "id": "j3nbfqo",
                    "parent_id": "t1_j3mgb16",
                    "score": 19,
                    "created_utc": 1673292532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aw she looks soooo cute!! So picturesque of them together",
            "author": "catsandtings",
            "id": "j3mvsg1",
            "parent_id": "t3_107ed8y",
            "score": 21,
            "created_utc": 1673286866.0,
            "replies": []
        },
        {
            "body": "When she looks back at the camera like they've been caught.  Lol",
            "author": "85fella",
            "id": "j3myfpi",
            "parent_id": "t3_107ed8y",
            "score": 15,
            "created_utc": 1673287831.0,
            "replies": []
        },
        {
            "body": "You can just FEEL the gums galore on the smile of YSC, idk if that’s from embarassment, giddiness or *something else* but I’m here for it!! 🤪 JSM knows how to push his buttons for real hahaha",
            "author": "MontGenevieve",
            "id": "j3qa49i",
            "parent_id": "t3_107ed8y",
            "score": 11,
            "created_utc": 1673342713.0,
            "replies": [
                {
                    "body": "Not me thinking he was asleep when she had this photo shoot!",
                    "author": "ImpossibleWarning6",
                    "id": "j4378xd",
                    "parent_id": "t1_j3qa49i",
                    "score": 1,
                    "created_utc": 1673558735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "![img](emote|t5_2u830|4971)",
            "author": "pencilcase_00",
            "id": "j3p1mf5",
            "parent_id": "t3_107ed8y",
            "score": 11,
            "created_utc": 1673316691.0,
            "replies": []
        },
        {
            "body": "That is a beautiful view. I personally like the fourth picture",
            "author": "Arktoscircle",
            "id": "j3qsg7e",
            "parent_id": "t3_107ed8y",
            "score": 8,
            "created_utc": 1673355871.0,
            "replies": []
        },
        {
            "body": "Lemme guess. Kjk is a cameraman.",
            "author": "ptolemyshark",
            "id": "j3r6tts",
            "parent_id": "t3_107ed8y",
            "score": 7,
            "created_utc": 1673362500.0,
            "replies": []
        },
        {
            "body": "I didn't ship this duo at first because I was a solid KookMin but why am I having butterflies seeing these photos?\n\nP.S. My girl JSM is looking GORG!!!!",
            "author": "glassesinglamour",
            "id": "j3ob59j",
            "parent_id": "t3_107ed8y",
            "score": 15,
            "created_utc": 1673305783.0,
            "replies": [
                {
                    "body": "Homegirl has wild chemistry with everyone!! Transferrable and unlimited in supply 🥰",
                    "author": "MontGenevieve",
                    "id": "j3pkvr6",
                    "parent_id": "t1_j3ob59j",
                    "score": 18,
                    "created_utc": 1673325352.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This made me tear up 🥹",
            "author": "Keeekx",
            "id": "j3tst3q",
            "parent_id": "t3_107ed8y",
            "score": 5,
            "created_utc": 1673397526.0,
            "replies": []
        },
        {
            "body": "Isn't this the day where IVE recorded RM?  Somin claiming \"he's mine\" in front of all the girls? haha",
            "author": "gyojoo",
            "id": "j3mny6p",
            "parent_id": "t3_107ed8y",
            "score": 2,
            "created_utc": 1673283992.0,
            "replies": [
                {
                    "body": "I don't think that's what she's doing but yeah it's either that or the episode for next week. They had bunny ears that IVE episode (twitter videos).",
                    "author": "Ancient_Reply4583",
                    "id": "j3n63gh",
                    "parent_id": "t1_j3mny6p",
                    "score": 6,
                    "created_utc": 1673290604.0,
                    "replies": []
                },
                {
                    "body": "i think (cmiiw) this pic is from the opening with the fighters. you can see the pink jackets in the preview. they've already been spotted filming with ive today. they're wearing rabbit ears on their heads.\n\ni remember seeing wjsn members teasing sechan by saying they're in the same agency as somin lol. imagine he gets teased in front of ive as well lol.",
                    "author": "botolsusu",
                    "id": "j3mslo9",
                    "parent_id": "t1_j3mny6p",
                    "score": 3,
                    "created_utc": 1673285714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "come on man.... somethings going on.",
            "author": "sd5510",
            "id": "j3p9b3y",
            "parent_id": "t3_107ed8y",
            "score": 2,
            "created_utc": 1673319915.0,
            "replies": []
        },
        {
            "body": "se chan be like: ok",
            "author": "littlek4za",
            "id": "j3mcbk8",
            "parent_id": "t3_107ed8y",
            "score": -10,
            "created_utc": 1673279518.0,
            "replies": [
                {
                    "body": "Pretty sure that's just you saying it.",
                    "author": "Ancient_Reply4583",
                    "id": "j3n6boz",
                    "parent_id": "t1_j3mcbk8",
                    "score": 21,
                    "created_utc": 1673290687.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow this is such a beautiful thought 🥺 a great consolation if the ship never sailed irl",
            "author": "MontGenevieve",
            "id": "j3pknjf",
            "parent_id": "t1_j3mqtgb",
            "score": 15,
            "created_utc": 1673325231.0,
            "replies": []
        },
        {
            "body": "The time JSM pretended to be pregnant was gold. She's great with such skits.",
            "author": "BoneToBeWild",
            "id": "j3lywn6",
            "parent_id": "t1_j3lt2b9",
            "score": 58,
            "created_utc": 1673273908.0,
            "replies": []
        },
        {
            "body": "I would love to see them winning the best couple award, but they did not win(probably won't as well) because on-screen they are not seen as a couple. It is only YJS and sometimes JSJ starts the conversation, force them to be a couple, but most part of the show JSM and YSC plays the game as a member of RM. Sometimes JSM starts roleplaying but YSC doesn't seem to play the role even though he is good in skit and his skit of \"BF/GF\" with Jang Do-young was hit on Big Comedy League.\n\nIf you watch the episodes when LKS and JSM won the best couple of award, you'll realize the difference. It was natural between them, not forced like this.\n\nOff screen they are really friends and who knows what will happen in the future, but for now I don't think they will win the best couple award, unless something changes.",
            "author": "kkang_kkang",
            "id": "j3nlos7",
            "parent_id": "t1_j3lymof",
            "score": 19,
            "created_utc": 1673296276.0,
            "replies": [
                {
                    "body": "Fishy for Sechan to not play along with JSM (Kidding, maybe he really had a girlfriend and was feeling awkward as hell) but Sechan please!!! 🤣",
                    "author": "glassesinglamour",
                    "id": "j3oeit8",
                    "parent_id": "t1_j3nlos7",
                    "score": 8,
                    "created_utc": 1673307135.0,
                    "replies": [
                        {
                            "body": "YSC in general doesn't enjoy playing a fool, I've noticed. He can do that as a character he plays but not an extension of himself. He doesn't like being put down by the guest or brushed aside. I mean, nobody does; but he especially can't play along with that type of joke. So I think for him to play along with this loveline would mean he has to be the butler role again and he doesn't want that. Can't blame him. He spent his first four years on the show playing the butler to KJK! It could also be that it is difficult for him to joke about this because he has real feelings for her, something he doesn't want to play around with because it is just too personal. Sort of like a \"this isn't a joke to me\" feel. Or like you said, he might have someone in his life and is just being respectful. If that was the case though, I think he should have told the cast and crew and not even have the hints of lovelines. They're cringe anyways. 😁",
                            "author": "Ancient_Reply4583",
                            "id": "j3pkj8f",
                            "parent_id": "t1_j3oeit8",
                            "score": 11,
                            "created_utc": 1673325168.0,
                            "replies": [
                                {
                                    "body": "ikr and i love him for that! a man is more charming when he knows his worth and is confident with himself. though he is not seen as fit to sk's beauty standards, i loved how he tries to shoot his shot with his one and only crush until today, son na eun. he seemed REALLY really smitten with and probably felt like he had no chance so didn't pursue her anymore. nevertheless, i'd only ever seen him in instances being pushed with a female celeb is with haha and mirani, i forgot the other one but i think that's it. also, we hear how great of a guy he is and how much sm's fam likes him but ig he's def eyeing someone else haha",
                                    "author": "taylorsanatomy13_",
                                    "id": "j3r34lq",
                                    "parent_id": "t1_j3pkj8f",
                                    "score": 0,
                                    "created_utc": 1673360960.0,
                                    "replies": [
                                        {
                                            "body": "Not sure I would put it that way. Just because he isn't willing to go there doesn't mean those who are willing don't know their worth. KwangSoo is an example of someone who would do just about anything if the role requires him even if that role is a variety persona. I think I respect that more, to tell you the truth. Not being open to certain harmless jokes and characters is definitely not something I would consider a strong point. My comment wasn't praise, quite the contrary. I think he isn't as flexible as some of the other cast members and that is one reason it took him so long to integrate into this cast. \n\nA huge part of acting (which lets face it this is) is being open to trying new things and going for it. Think of all the great actors and actresses: they're fearless performers because they don't say no when a role demands something they're uncomfortable with. In fact, most look at it as a great challenge. This is also why I believe actors are better variety stars and guests than idols and comedians. They're more open to play up their roles and can more easily detach from themselves. (Of course not all actors. Even on the cast, SJH who is an actor is an example of someone who's not good at variety, and this isn't a diss. Even her fans acknowledge this. I'm trying to say I'm not overgeneralizing.) \n\nHaving said all of this, I'm not blaming him, not at all. He has every right to choose he isn't comfortable with something and not want to do it. I'm just saying that I don't think him not doing something means others that do those things have no self-respect. I hope that is clear. \n\nAbout him not pursuing someone like an Apink member, it makes total sense. You have to realize this is an Asian country and their jobs are very public. In SK society and in the entertainment industry, a comedian is the lowest \"class\" of entertainer in the sense that it isn't exactly a respectable job that is highly regarded. I think I've seen people saying it is usually actors on the top (the only group that get seating near stages and private dressing rooms at award shows), then singers, then idols and lastly comedians. He is already at a disadvantage, especially being the man. Think of it as a male office worker being interested in a female doctor. It shouldn't matter, people are not their jobs and there is nothing wrong with being a comedian or office worker - it is just that Asian countries especially put a huge emphasis on people's jobs and social standing. This is why we grow up being forced to become either a doctor, an engineering or a lawyer. (I'm from another Asian country, not SK) \n\nVisually, I don't think women care as much about looks as men do and I also genuinely think YSC is good looking enough. So if I were NE I wouldn't care. But it's not that simple. Idol fans worship their idols, and think nobody is good enough for them. So if a guy that is average looking at best by SK's made-up beauty standards started dating their idol, all hell will break loose. So he might have been worried about that too. He isn't as famous as these idols to have seen the flood of attention, so he might have been scared. I also don't know why people keep saying he must have someone else. Y'all do know that people can not like someone without having to be in love with someone else, right?",
                                            "author": "Ancient_Reply4583",
                                            "id": "j3rck7r",
                                            "parent_id": "t1_j3r34lq",
                                            "score": 4,
                                            "created_utc": 1673364814.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This!! I even zoomed in and was even more dazzled!! SECHAN OPEN YOUR EYES, LOOK AT THAT WOMAN LOOKING AT YOU LIKE THAT 🥰",
            "author": "MontGenevieve",
            "id": "j3pkrne",
            "parent_id": "t1_j3lvjb2",
            "score": 13,
            "created_utc": 1673325292.0,
            "replies": []
        },
        {
            "body": "Somin doing her best to win that award with anyone she can 🤣",
            "author": "UnderOurPants",
            "id": "j3nbfqo",
            "parent_id": "t1_j3mgb16",
            "score": 19,
            "created_utc": 1673292532.0,
            "replies": []
        },
        {
            "body": "Not me thinking he was asleep when she had this photo shoot!",
            "author": "ImpossibleWarning6",
            "id": "j4378xd",
            "parent_id": "t1_j3qa49i",
            "score": 1,
            "created_utc": 1673558735.0,
            "replies": []
        },
        {
            "body": "Homegirl has wild chemistry with everyone!! Transferrable and unlimited in supply 🥰",
            "author": "MontGenevieve",
            "id": "j3pkvr6",
            "parent_id": "t1_j3ob59j",
            "score": 18,
            "created_utc": 1673325352.0,
            "replies": []
        },
        {
            "body": "I don't think that's what she's doing but yeah it's either that or the episode for next week. They had bunny ears that IVE episode (twitter videos).",
            "author": "Ancient_Reply4583",
            "id": "j3n63gh",
            "parent_id": "t1_j3mny6p",
            "score": 6,
            "created_utc": 1673290604.0,
            "replies": []
        },
        {
            "body": "i think (cmiiw) this pic is from the opening with the fighters. you can see the pink jackets in the preview. they've already been spotted filming with ive today. they're wearing rabbit ears on their heads.\n\ni remember seeing wjsn members teasing sechan by saying they're in the same agency as somin lol. imagine he gets teased in front of ive as well lol.",
            "author": "botolsusu",
            "id": "j3mslo9",
            "parent_id": "t1_j3mny6p",
            "score": 3,
            "created_utc": 1673285714.0,
            "replies": []
        },
        {
            "body": "Pretty sure that's just you saying it.",
            "author": "Ancient_Reply4583",
            "id": "j3n6boz",
            "parent_id": "t1_j3mcbk8",
            "score": 21,
            "created_utc": 1673290687.0,
            "replies": []
        },
        {
            "body": "Fishy for Sechan to not play along with JSM (Kidding, maybe he really had a girlfriend and was feeling awkward as hell) but Sechan please!!! 🤣",
            "author": "glassesinglamour",
            "id": "j3oeit8",
            "parent_id": "t1_j3nlos7",
            "score": 8,
            "created_utc": 1673307135.0,
            "replies": [
                {
                    "body": "YSC in general doesn't enjoy playing a fool, I've noticed. He can do that as a character he plays but not an extension of himself. He doesn't like being put down by the guest or brushed aside. I mean, nobody does; but he especially can't play along with that type of joke. So I think for him to play along with this loveline would mean he has to be the butler role again and he doesn't want that. Can't blame him. He spent his first four years on the show playing the butler to KJK! It could also be that it is difficult for him to joke about this because he has real feelings for her, something he doesn't want to play around with because it is just too personal. Sort of like a \"this isn't a joke to me\" feel. Or like you said, he might have someone in his life and is just being respectful. If that was the case though, I think he should have told the cast and crew and not even have the hints of lovelines. They're cringe anyways. 😁",
                    "author": "Ancient_Reply4583",
                    "id": "j3pkj8f",
                    "parent_id": "t1_j3oeit8",
                    "score": 11,
                    "created_utc": 1673325168.0,
                    "replies": [
                        {
                            "body": "ikr and i love him for that! a man is more charming when he knows his worth and is confident with himself. though he is not seen as fit to sk's beauty standards, i loved how he tries to shoot his shot with his one and only crush until today, son na eun. he seemed REALLY really smitten with and probably felt like he had no chance so didn't pursue her anymore. nevertheless, i'd only ever seen him in instances being pushed with a female celeb is with haha and mirani, i forgot the other one but i think that's it. also, we hear how great of a guy he is and how much sm's fam likes him but ig he's def eyeing someone else haha",
                            "author": "taylorsanatomy13_",
                            "id": "j3r34lq",
                            "parent_id": "t1_j3pkj8f",
                            "score": 0,
                            "created_utc": 1673360960.0,
                            "replies": [
                                {
                                    "body": "Not sure I would put it that way. Just because he isn't willing to go there doesn't mean those who are willing don't know their worth. KwangSoo is an example of someone who would do just about anything if the role requires him even if that role is a variety persona. I think I respect that more, to tell you the truth. Not being open to certain harmless jokes and characters is definitely not something I would consider a strong point. My comment wasn't praise, quite the contrary. I think he isn't as flexible as some of the other cast members and that is one reason it took him so long to integrate into this cast. \n\nA huge part of acting (which lets face it this is) is being open to trying new things and going for it. Think of all the great actors and actresses: they're fearless performers because they don't say no when a role demands something they're uncomfortable with. In fact, most look at it as a great challenge. This is also why I believe actors are better variety stars and guests than idols and comedians. They're more open to play up their roles and can more easily detach from themselves. (Of course not all actors. Even on the cast, SJH who is an actor is an example of someone who's not good at variety, and this isn't a diss. Even her fans acknowledge this. I'm trying to say I'm not overgeneralizing.) \n\nHaving said all of this, I'm not blaming him, not at all. He has every right to choose he isn't comfortable with something and not want to do it. I'm just saying that I don't think him not doing something means others that do those things have no self-respect. I hope that is clear. \n\nAbout him not pursuing someone like an Apink member, it makes total sense. You have to realize this is an Asian country and their jobs are very public. In SK society and in the entertainment industry, a comedian is the lowest \"class\" of entertainer in the sense that it isn't exactly a respectable job that is highly regarded. I think I've seen people saying it is usually actors on the top (the only group that get seating near stages and private dressing rooms at award shows), then singers, then idols and lastly comedians. He is already at a disadvantage, especially being the man. Think of it as a male office worker being interested in a female doctor. It shouldn't matter, people are not their jobs and there is nothing wrong with being a comedian or office worker - it is just that Asian countries especially put a huge emphasis on people's jobs and social standing. This is why we grow up being forced to become either a doctor, an engineering or a lawyer. (I'm from another Asian country, not SK) \n\nVisually, I don't think women care as much about looks as men do and I also genuinely think YSC is good looking enough. So if I were NE I wouldn't care. But it's not that simple. Idol fans worship their idols, and think nobody is good enough for them. So if a guy that is average looking at best by SK's made-up beauty standards started dating their idol, all hell will break loose. So he might have been worried about that too. He isn't as famous as these idols to have seen the flood of attention, so he might have been scared. I also don't know why people keep saying he must have someone else. Y'all do know that people can not like someone without having to be in love with someone else, right?",
                                    "author": "Ancient_Reply4583",
                                    "id": "j3rck7r",
                                    "parent_id": "t1_j3r34lq",
                                    "score": 4,
                                    "created_utc": 1673364814.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "YSC in general doesn't enjoy playing a fool, I've noticed. He can do that as a character he plays but not an extension of himself. He doesn't like being put down by the guest or brushed aside. I mean, nobody does; but he especially can't play along with that type of joke. So I think for him to play along with this loveline would mean he has to be the butler role again and he doesn't want that. Can't blame him. He spent his first four years on the show playing the butler to KJK! It could also be that it is difficult for him to joke about this because he has real feelings for her, something he doesn't want to play around with because it is just too personal. Sort of like a \"this isn't a joke to me\" feel. Or like you said, he might have someone in his life and is just being respectful. If that was the case though, I think he should have told the cast and crew and not even have the hints of lovelines. They're cringe anyways. 😁",
            "author": "Ancient_Reply4583",
            "id": "j3pkj8f",
            "parent_id": "t1_j3oeit8",
            "score": 11,
            "created_utc": 1673325168.0,
            "replies": [
                {
                    "body": "ikr and i love him for that! a man is more charming when he knows his worth and is confident with himself. though he is not seen as fit to sk's beauty standards, i loved how he tries to shoot his shot with his one and only crush until today, son na eun. he seemed REALLY really smitten with and probably felt like he had no chance so didn't pursue her anymore. nevertheless, i'd only ever seen him in instances being pushed with a female celeb is with haha and mirani, i forgot the other one but i think that's it. also, we hear how great of a guy he is and how much sm's fam likes him but ig he's def eyeing someone else haha",
                    "author": "taylorsanatomy13_",
                    "id": "j3r34lq",
                    "parent_id": "t1_j3pkj8f",
                    "score": 0,
                    "created_utc": 1673360960.0,
                    "replies": [
                        {
                            "body": "Not sure I would put it that way. Just because he isn't willing to go there doesn't mean those who are willing don't know their worth. KwangSoo is an example of someone who would do just about anything if the role requires him even if that role is a variety persona. I think I respect that more, to tell you the truth. Not being open to certain harmless jokes and characters is definitely not something I would consider a strong point. My comment wasn't praise, quite the contrary. I think he isn't as flexible as some of the other cast members and that is one reason it took him so long to integrate into this cast. \n\nA huge part of acting (which lets face it this is) is being open to trying new things and going for it. Think of all the great actors and actresses: they're fearless performers because they don't say no when a role demands something they're uncomfortable with. In fact, most look at it as a great challenge. This is also why I believe actors are better variety stars and guests than idols and comedians. They're more open to play up their roles and can more easily detach from themselves. (Of course not all actors. Even on the cast, SJH who is an actor is an example of someone who's not good at variety, and this isn't a diss. Even her fans acknowledge this. I'm trying to say I'm not overgeneralizing.) \n\nHaving said all of this, I'm not blaming him, not at all. He has every right to choose he isn't comfortable with something and not want to do it. I'm just saying that I don't think him not doing something means others that do those things have no self-respect. I hope that is clear. \n\nAbout him not pursuing someone like an Apink member, it makes total sense. You have to realize this is an Asian country and their jobs are very public. In SK society and in the entertainment industry, a comedian is the lowest \"class\" of entertainer in the sense that it isn't exactly a respectable job that is highly regarded. I think I've seen people saying it is usually actors on the top (the only group that get seating near stages and private dressing rooms at award shows), then singers, then idols and lastly comedians. He is already at a disadvantage, especially being the man. Think of it as a male office worker being interested in a female doctor. It shouldn't matter, people are not their jobs and there is nothing wrong with being a comedian or office worker - it is just that Asian countries especially put a huge emphasis on people's jobs and social standing. This is why we grow up being forced to become either a doctor, an engineering or a lawyer. (I'm from another Asian country, not SK) \n\nVisually, I don't think women care as much about looks as men do and I also genuinely think YSC is good looking enough. So if I were NE I wouldn't care. But it's not that simple. Idol fans worship their idols, and think nobody is good enough for them. So if a guy that is average looking at best by SK's made-up beauty standards started dating their idol, all hell will break loose. So he might have been worried about that too. He isn't as famous as these idols to have seen the flood of attention, so he might have been scared. I also don't know why people keep saying he must have someone else. Y'all do know that people can not like someone without having to be in love with someone else, right?",
                            "author": "Ancient_Reply4583",
                            "id": "j3rck7r",
                            "parent_id": "t1_j3r34lq",
                            "score": 4,
                            "created_utc": 1673364814.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "ikr and i love him for that! a man is more charming when he knows his worth and is confident with himself. though he is not seen as fit to sk's beauty standards, i loved how he tries to shoot his shot with his one and only crush until today, son na eun. he seemed REALLY really smitten with and probably felt like he had no chance so didn't pursue her anymore. nevertheless, i'd only ever seen him in instances being pushed with a female celeb is with haha and mirani, i forgot the other one but i think that's it. also, we hear how great of a guy he is and how much sm's fam likes him but ig he's def eyeing someone else haha",
            "author": "taylorsanatomy13_",
            "id": "j3r34lq",
            "parent_id": "t1_j3pkj8f",
            "score": 0,
            "created_utc": 1673360960.0,
            "replies": [
                {
                    "body": "Not sure I would put it that way. Just because he isn't willing to go there doesn't mean those who are willing don't know their worth. KwangSoo is an example of someone who would do just about anything if the role requires him even if that role is a variety persona. I think I respect that more, to tell you the truth. Not being open to certain harmless jokes and characters is definitely not something I would consider a strong point. My comment wasn't praise, quite the contrary. I think he isn't as flexible as some of the other cast members and that is one reason it took him so long to integrate into this cast. \n\nA huge part of acting (which lets face it this is) is being open to trying new things and going for it. Think of all the great actors and actresses: they're fearless performers because they don't say no when a role demands something they're uncomfortable with. In fact, most look at it as a great challenge. This is also why I believe actors are better variety stars and guests than idols and comedians. They're more open to play up their roles and can more easily detach from themselves. (Of course not all actors. Even on the cast, SJH who is an actor is an example of someone who's not good at variety, and this isn't a diss. Even her fans acknowledge this. I'm trying to say I'm not overgeneralizing.) \n\nHaving said all of this, I'm not blaming him, not at all. He has every right to choose he isn't comfortable with something and not want to do it. I'm just saying that I don't think him not doing something means others that do those things have no self-respect. I hope that is clear. \n\nAbout him not pursuing someone like an Apink member, it makes total sense. You have to realize this is an Asian country and their jobs are very public. In SK society and in the entertainment industry, a comedian is the lowest \"class\" of entertainer in the sense that it isn't exactly a respectable job that is highly regarded. I think I've seen people saying it is usually actors on the top (the only group that get seating near stages and private dressing rooms at award shows), then singers, then idols and lastly comedians. He is already at a disadvantage, especially being the man. Think of it as a male office worker being interested in a female doctor. It shouldn't matter, people are not their jobs and there is nothing wrong with being a comedian or office worker - it is just that Asian countries especially put a huge emphasis on people's jobs and social standing. This is why we grow up being forced to become either a doctor, an engineering or a lawyer. (I'm from another Asian country, not SK) \n\nVisually, I don't think women care as much about looks as men do and I also genuinely think YSC is good looking enough. So if I were NE I wouldn't care. But it's not that simple. Idol fans worship their idols, and think nobody is good enough for them. So if a guy that is average looking at best by SK's made-up beauty standards started dating their idol, all hell will break loose. So he might have been worried about that too. He isn't as famous as these idols to have seen the flood of attention, so he might have been scared. I also don't know why people keep saying he must have someone else. Y'all do know that people can not like someone without having to be in love with someone else, right?",
                    "author": "Ancient_Reply4583",
                    "id": "j3rck7r",
                    "parent_id": "t1_j3r34lq",
                    "score": 4,
                    "created_utc": 1673364814.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not sure I would put it that way. Just because he isn't willing to go there doesn't mean those who are willing don't know their worth. KwangSoo is an example of someone who would do just about anything if the role requires him even if that role is a variety persona. I think I respect that more, to tell you the truth. Not being open to certain harmless jokes and characters is definitely not something I would consider a strong point. My comment wasn't praise, quite the contrary. I think he isn't as flexible as some of the other cast members and that is one reason it took him so long to integrate into this cast. \n\nA huge part of acting (which lets face it this is) is being open to trying new things and going for it. Think of all the great actors and actresses: they're fearless performers because they don't say no when a role demands something they're uncomfortable with. In fact, most look at it as a great challenge. This is also why I believe actors are better variety stars and guests than idols and comedians. They're more open to play up their roles and can more easily detach from themselves. (Of course not all actors. Even on the cast, SJH who is an actor is an example of someone who's not good at variety, and this isn't a diss. Even her fans acknowledge this. I'm trying to say I'm not overgeneralizing.) \n\nHaving said all of this, I'm not blaming him, not at all. He has every right to choose he isn't comfortable with something and not want to do it. I'm just saying that I don't think him not doing something means others that do those things have no self-respect. I hope that is clear. \n\nAbout him not pursuing someone like an Apink member, it makes total sense. You have to realize this is an Asian country and their jobs are very public. In SK society and in the entertainment industry, a comedian is the lowest \"class\" of entertainer in the sense that it isn't exactly a respectable job that is highly regarded. I think I've seen people saying it is usually actors on the top (the only group that get seating near stages and private dressing rooms at award shows), then singers, then idols and lastly comedians. He is already at a disadvantage, especially being the man. Think of it as a male office worker being interested in a female doctor. It shouldn't matter, people are not their jobs and there is nothing wrong with being a comedian or office worker - it is just that Asian countries especially put a huge emphasis on people's jobs and social standing. This is why we grow up being forced to become either a doctor, an engineering or a lawyer. (I'm from another Asian country, not SK) \n\nVisually, I don't think women care as much about looks as men do and I also genuinely think YSC is good looking enough. So if I were NE I wouldn't care. But it's not that simple. Idol fans worship their idols, and think nobody is good enough for them. So if a guy that is average looking at best by SK's made-up beauty standards started dating their idol, all hell will break loose. So he might have been worried about that too. He isn't as famous as these idols to have seen the flood of attention, so he might have been scared. I also don't know why people keep saying he must have someone else. Y'all do know that people can not like someone without having to be in love with someone else, right?",
            "author": "Ancient_Reply4583",
            "id": "j3rck7r",
            "parent_id": "t1_j3r34lq",
            "score": 4,
            "created_utc": 1673364814.0,
            "replies": []
        }
    ]
}