{
    "title": "Lingerie or sex toy gifts are (mostly) selfish gifts given by SDs",
    "post_id": "kedgij",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kedgij/lingerie_or_sex_toy_gifts_are_mostly_selfish/",
    "author": "ExExpectations",
    "body": "So when it comes to gifts, I'm a practical woman. I like and want things that I can use, or eat, or wear frequently (and not just on *\"special occasions.\")*\n\n(Practical gifts like electronic gadgets, app subscriptions, shoes, staple clothing items, or timeless jewelry and or accessories for my wardrobe, winter jackets -- the Moncler jacket that was linked! Okay, maybe not that one because who needs that in California -- a wad of cash, or a preloaded Visa card to pay for things at my own choosing, etc. would be the best types of things IMO)\n\nWhile I \\*love\\* lingerie and love wearing them, I don't view them as gifts **FOR ME**. It's gifts that he gives FOR HIM to enjoy me. If it's lingerie, or sex toys, or whatever sexy thing that he and I would be using during our sexy times, it's a gift *FOR HIM/US.*\n\nOf course, lingerie and sex toy types of gifts are appreciated - with a thank you and a smile. But deep down, I wish there are gifts JUST FOR ME as well.\n\n**Practical gifts - just for me - are gifts that truly make me wet, I mean, appreciate.**\n\nAm I the only woman / SB who feels this way??!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kedgij/lingerie_or_sex_toy_gifts_are_mostly_selfish/",
    "score": 311,
    "upvote_ratio": 0.94,
    "created_utc": 1608139427.0,
    "num_comments": 81,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I remember an article written by a secretary (today they are called personal assistants) about the best gifts for \"Secretaries Day\" (is that still a thing?).   She reviewed many past gifts that actually included sexy items (long time ago).  Mostly bosses just took their assistants to a nice lunch.\n\nHer suggestion was to skip the boss-secretary lunch and instead just pay for a lunch of their choosing.  In other words, flip them the credit card and pray.   Ever since, that has been my preferred gift.  And I get great reviews.\n\nHints help!",
            "author": "sdphilly",
            "id": "gg1xykn",
            "parent_id": "t3_kedgij",
            "score": 43,
            "created_utc": 1608142360.0,
            "replies": [
                {
                    "body": "I have since lost the link, but I found a real vintage ad for lingerie directed at men for Secretary’s Day! I think it was stockings maybe but still, major mid century creep factor.",
                    "author": null,
                    "id": "gg2qq23",
                    "parent_id": "t1_gg1xykn",
                    "score": 23,
                    "created_utc": 1608155838.0,
                    "replies": [
                        {
                            "body": "Men truly are something else",
                            "author": "blissyblonde",
                            "id": "gg2voiw",
                            "parent_id": "t1_gg2qq23",
                            "score": 16,
                            "created_utc": 1608158300.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My SB often buys lingerie out of her own pocket to please me.  If I know she did I send her money to cover it and then some. Since she goes above and beyond she gets literally anything she asks for without question.",
            "author": null,
            "id": "gg1tqbw",
            "parent_id": "t3_kedgij",
            "score": 72,
            "created_utc": 1608140352.0,
            "replies": [
                {
                    "body": "I need you as my SD",
                    "author": null,
                    "id": "gg38erk",
                    "parent_id": "t1_gg1tqbw",
                    "score": 24,
                    "created_utc": 1608165108.0,
                    "replies": []
                },
                {
                    "body": "How does she go above and beyond?",
                    "author": "tahliawetnwild",
                    "id": "gg3wk6l",
                    "parent_id": "t1_gg1tqbw",
                    "score": 9,
                    "created_utc": 1608178120.0,
                    "replies": [
                        {
                            "body": "I am a priority in her life, she is extremely attentive and makes sure I am well loved and cared for.",
                            "author": null,
                            "id": "gg5cets",
                            "parent_id": "t1_gg3wk6l",
                            "score": 7,
                            "created_utc": 1608218710.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes!",
                    "author": "bloom_splat",
                    "id": "gg3cr68",
                    "parent_id": "t1_gg1tqbw",
                    "score": 2,
                    "created_utc": 1608167492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg23cup",
            "parent_id": "t3_kedgij",
            "score": 144,
            "created_utc": 1608144847.0,
            "replies": [
                {
                    "body": "“😂😂😂😂😂😂. I got you the extra heavy duty envelopes so they don’t tear in case you want to try to overload them with hundreds”.    So thoughtful",
                    "author": "LotBuilder",
                    "id": "gg3cxek",
                    "parent_id": "t1_gg23cup",
                    "score": 41,
                    "created_utc": 1608167586.0,
                    "replies": []
                },
                {
                    "body": "hahahaha hand painted envelopes actually sound quite exquisite.",
                    "author": "sbluxx",
                    "id": "gg2739x",
                    "parent_id": "t1_gg23cup",
                    "score": 25,
                    "created_utc": 1608146585.0,
                    "replies": []
                },
                {
                    "body": "🤣",
                    "author": "B1oodSugarSexMagik",
                    "id": "gg31w3k",
                    "parent_id": "t1_gg23cup",
                    "score": 6,
                    "created_utc": 1608161543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As an SD, can I pile on her with a \"duh\"! Even an SB who told me she liked lingerie, giving it was a gift for myself.\n\nMy (personal) take on gifts is in an SR focuses on two things:\n\n1. I want to find something that shows I've paid attention and shows I listened to her interests.\n2. I tend to keep gifts small - if I'm going to splurge on the dollar front, I typically see a surprise increase for her allowance to be more of an impact than an expensive item",
            "author": "sfwinefan",
            "id": "gg1ss8z",
            "parent_id": "t3_kedgij",
            "score": 43,
            "created_utc": 1608139899.0,
            "replies": []
        },
        {
            "body": "I very much enjoy lingerie. It makes me feel confident and sexy and I love the way he reacts to me. He can't even look me in the face, his eyes darting all over my body!\n\nThat said, at one point my SBF had gotten me like 12 lingerie outfits (all super cute and I wear them often).\nI decided to speak up and say that we had accumulated a generous variety of outfits and I was ready to switch gears to something else we could enjoy. He recieved my comment well and had no problem asking  and provided me anything else I wanted. \n\nSince then he has purchased a few more outfits which resulted in amazing memories 🤣 So why stop him?",
            "author": "ElementShow",
            "id": "gg21ofk",
            "parent_id": "t3_kedgij",
            "score": 23,
            "created_utc": 1608144080.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg1sbuz",
            "parent_id": "t3_kedgij",
            "score": 28,
            "created_utc": 1608139682.0,
            "replies": [
                {
                    "body": "I'm going to refresh and see if this post comes up a third or fourth time.",
                    "author": "BinghamtonSD",
                    "id": "gg1toaj",
                    "parent_id": "t1_gg1sbuz",
                    "score": 18,
                    "created_utc": 1608140324.0,
                    "replies": [
                        {
                            "body": "🤣",
                            "author": "ExExpectations",
                            "id": "gg1u2ng",
                            "parent_id": "t1_gg1toaj",
                            "score": 4,
                            "created_utc": 1608140514.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm just gonna put this right here.   \n[https://www.youtube.com/watch?v=03N2uIoXptU](https://www.youtube.com/watch?v=03N2uIoXptU)",
            "author": "SouthernGentSD",
            "id": "gg2xde0",
            "parent_id": "t3_kedgij",
            "score": 6,
            "created_utc": 1608159164.0,
            "replies": [
                {
                    "body": "LOL. Right??? Thank you for the laugh.",
                    "author": "ExExpectations",
                    "id": "gg38vmw",
                    "parent_id": "t1_gg2xde0",
                    "score": 3,
                    "created_utc": 1608165365.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Since my primary love language is receiving gifts, I appreciate when a man puts thought into buying a gift for me simply because they know that I will love it and they want to see me happy. I am totally happy to receive gifts of lingerie or sex toys, but not for significant occasions like Valentine’s Day or birthday gifts.… For those, I definitely have to agree with you...  spa gift cards, etc. are much preferred :)",
            "author": "RealEarthAngel",
            "id": "gg3ajq2",
            "parent_id": "t3_kedgij",
            "score": 5,
            "created_utc": 1608166286.0,
            "replies": []
        },
        {
            "body": "I only get gifts they request or gifts in addition to regular allowance.   Most need the extra cash more than the gift.  I have multiple SB’s so I keep holidays simple with an extra allowance and a Lulu gift card big enough for them to get a full outfit.    I am also down for a Trader Joe’s shopping spree if they are hosting family.",
            "author": "LotBuilder",
            "id": "gg3crcb",
            "parent_id": "t3_kedgij",
            "score": 6,
            "created_utc": 1608167495.0,
            "replies": []
        },
        {
            "body": "I have a slight lingerie obsession & I love to show it off for my person (when I have one). In fact I’ve spoken of it before, but my current SR of sorts is an online only where he often gifts me sexy things (lingerie, jewelry, sexy shoes or clothes, etc). It wasn’t a spoken arrangement & just kinda naturally occurred due to how we met. \n\nI love receiving his gifts & I’m always excited to show them off for him or find new ideas on how to show them off for him. He’s always super sweet to me & the gift are always a surprise. A very lovely & appreciated surprise. \n\nWhile it maybe slightly different then a traditional type of arrangement because we don’t meet in person. I know that if I were having a face to face relationship with him that I would be just as excited to please him.",
            "author": "5ft1ofSugarBabyfun",
            "id": "gg3u2px",
            "parent_id": "t3_kedgij",
            "score": 5,
            "created_utc": 1608176719.0,
            "replies": [
                {
                    "body": "I like this 😘",
                    "author": "HarleyQueen68",
                    "id": "gg6qosw",
                    "parent_id": "t1_gg3u2px",
                    "score": 3,
                    "created_utc": 1608243264.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m a SD and I agree",
            "author": null,
            "id": "gg1shw9",
            "parent_id": "t3_kedgij",
            "score": 10,
            "created_utc": 1608139761.0,
            "replies": [
                {
                    "body": "You looking for a sb?",
                    "author": "n_colee",
                    "id": "gg4ngxp",
                    "parent_id": "t1_gg1shw9",
                    "score": -1,
                    "created_utc": 1608199924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg31uf1",
            "parent_id": "t3_kedgij",
            "score": 11,
            "created_utc": 1608161519.0,
            "replies": [
                {
                    "body": "Costco...has clothing?",
                    "author": "longrunfun",
                    "id": "gg7gesl",
                    "parent_id": "t1_gg31uf1",
                    "score": 2,
                    "created_utc": 1608256705.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I try to get something they need, but the best version. Something handmade and will last a lifetime. Something they can hold in there hand and always remember me for.",
            "author": "parttimeSD",
            "id": "gg2tuf8",
            "parent_id": "t3_kedgij",
            "score": 4,
            "created_utc": 1608157371.0,
            "replies": []
        },
        {
            "body": "As someone who's had a lot of gifts received as packages or part of online shopping sessions, agree with this entirely. Getting new clothes or new intimate pieces as part of a SR is nice and gives me a kind of luxury that I wouldn't normally have access to, but the intention is just to straight up give a gift, I don't feel like it's the best option.",
            "author": "BunsGoSquish",
            "id": "gg2ytre",
            "parent_id": "t3_kedgij",
            "score": 5,
            "created_utc": 1608159918.0,
            "replies": []
        },
        {
            "body": "I observe your preference. I find it helpful... Never thought of myself as a SD but, with my baby being a couple of decades younger... I guess kinda. I’m giving the gift of cash 💵 \n\nI already bought numerous unworn outfits, plus she’s bought a couple too....You’re right! Those are definitely for me",
            "author": "BlvckOlives",
            "id": "gg2zjlj",
            "parent_id": "t3_kedgij",
            "score": 5,
            "created_utc": 1608160299.0,
            "replies": []
        },
        {
            "body": "I agree and frankly, I don't accept it. \n\nI tell them that it isn't a gift for me in mind, only them and that I expected more from them.",
            "author": null,
            "id": "gg3smt0",
            "parent_id": "t3_kedgij",
            "score": 3,
            "created_utc": 1608175922.0,
            "replies": []
        },
        {
            "body": "The most valuable gift is cash.",
            "author": null,
            "id": "gg5i74n",
            "parent_id": "t3_kedgij",
            "score": 3,
            "created_utc": 1608221625.0,
            "replies": []
        },
        {
            "body": "Interesting. You’re definitely correct now that I think of it....but honestly I’ve never thought of it that way I guess in part because lingerie never really did anything for me. I’ve always considered the naked female body the absolute best thing to look at and hate when it’s covered up. \n\nI used to buy lingerie for a vanilla gf of mine all the time because I know she liked to look/feel sexy and that stuff helped her do it....now I’m wondering if she was mirroring your thoughts all that time....which totally was not my intent. 🤔🤔",
            "author": "HotStool",
            "id": "gg2bmb1",
            "parent_id": "t3_kedgij",
            "score": 5,
            "created_utc": 1608148701.0,
            "replies": [
                {
                    "body": "Love the fact you've taken an introspect approach",
                    "author": "BadWolf1318",
                    "id": "gg3vpmn",
                    "parent_id": "t1_gg2bmb1",
                    "score": 4,
                    "created_utc": 1608177642.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like most things in this world, it depends. \n\nMy SB asked for a monthly subscription to a lingerie thing to update some of her stuff and have more choices. I told her I was happy to, my only request was the first time she wears what comes needs to be for me. \n\nI honestly don’t care for foo-foo lingerie (comes as no shock to Dori I’m sure).",
            "author": "mraspencer",
            "id": "gg349p7",
            "parent_id": "t3_kedgij",
            "score": 6,
            "created_utc": 1608162822.0,
            "replies": []
        },
        {
            "body": "I'm not an SB and I totally agree with you.  lol",
            "author": "HJ71",
            "id": "gg9hr6f",
            "parent_id": "t3_kedgij",
            "score": 3,
            "created_utc": 1608308507.0,
            "replies": []
        },
        {
            "body": "Listen, maybe I’m an outlier here, but my SD never gives me gifts. He just keeps it to our PPM, and that’s it. I feel like while thoughtful gifts are nice (I’ve been with an SD who was a big gifter), that’s just bonus. I’d be thankful for the lingerie and sex toys, but again maybe that’s just me.",
            "author": "Dax-718",
            "id": "gg3m5wm",
            "parent_id": "t3_kedgij",
            "score": 3,
            "created_utc": 1608172426.0,
            "replies": [
                {
                    "body": "You're not alone, that's why I quit the bowl. Only 3 of the SDs bought me gifts (all are whales, I can't see how a \"normal\" SD is willing to fork out extra $$$). While I met dozens. \n\nI'd be very very happy with Agent Provocateur as a gift.",
                    "author": "SnooDoggos512",
                    "id": "gg3snul",
                    "parent_id": "t1_gg3m5wm",
                    "score": 2,
                    "created_utc": 1608175938.0,
                    "replies": [
                        {
                            "body": ">I'd be very very happy with Agent Provocateur as a gift.\n\n....except, when these lingerie \"gifts\" is usually given, they are not typically AP brand or high-end brand. They're tacky, cheaply made, and cheap.",
                            "author": "ExExpectations",
                            "id": "gg5luls",
                            "parent_id": "t1_gg3snul",
                            "score": 3,
                            "created_utc": 1608223409.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes!",
            "author": "Bbygirlxxxx",
            "id": "gg3dpy7",
            "parent_id": "t3_kedgij",
            "score": 2,
            "created_utc": 1608168017.0,
            "replies": []
        },
        {
            "body": "I just see a gift as a gift but I know where you're conning from!",
            "author": "DistinctBluejay3584",
            "id": "gg3jrxp",
            "parent_id": "t3_kedgij",
            "score": 2,
            "created_utc": 1608171182.0,
            "replies": [
                {
                    "body": "From me",
                    "author": "sophiaandrew-244",
                    "id": "gg4vyxj",
                    "parent_id": "t1_gg3jrxp",
                    "score": 1,
                    "created_utc": 1608208155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To me the best option to make things easier for both parties is to make an Amazon wishlist.  Whether the SD buys anything off of it or not at least he gets the idea of what you might be interested in receiving.",
            "author": "Madisonesthe1",
            "id": "gg40p0n",
            "parent_id": "t3_kedgij",
            "score": 2,
            "created_utc": 1608180601.0,
            "replies": []
        },
        {
            "body": "For sds present sb can buy him something but most often they say to surprise him in lingerie etc.  For sbs present sd can buy her something & most often will not say surprise me with lingerie etc proving ops post.  However, if they both really want to get lingerie they can go to agent provacateur & get a bunch of sets.",
            "author": null,
            "id": "gpmzg2z",
            "parent_id": "t3_kedgij",
            "score": 2,
            "created_utc": 1614852255.0,
            "replies": []
        },
        {
            "body": "I try to view these kind of gifts as something for both of us. If the gift is for an occasion (birthday, Christmas, etc.) I will always spend at minimum half of my gift budget on things that are just for her, and for surprise gifts I try to keep it around 2:1 hers/ours to make sure she is happy about how things are going. I never want to make the impression, or worse actually fall into the trap of using gifting as a manipulative strategy to get what I want. Some people will construe all gifting as this, but I know that if my first consideration is on making her happy then I will not ever have to worry about being pampered in return.",
            "author": "LookingForTrueStuff",
            "id": "gg1uxy1",
            "parent_id": "t3_kedgij",
            "score": 5,
            "created_utc": 1608140929.0,
            "replies": [
                {
                    "body": "Also in my 2:1 hers/ours reckoning I include chocolates, wine, and other consumables we are likely to share in the ours category, not just lingerie and toys.",
                    "author": "LookingForTrueStuff",
                    "id": "gg1vmh0",
                    "parent_id": "t1_gg1uxy1",
                    "score": 3,
                    "created_utc": 1608141248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I bought her the first vibrator she ever owned and she had the first orgasms she ever had.. **I promise you that wasn't for me, it was for her**\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n(Still your point remains!)",
            "author": "marker3000",
            "id": "gg2ayg0",
            "parent_id": "t3_kedgij",
            "score": 6,
            "created_utc": 1608148397.0,
            "replies": [
                {
                    "body": "There is a huge difference between buying a toy for her to use in private, and buying, say, a vibrating cocking",
                    "author": "blissyblonde",
                    "id": "gg2vy59",
                    "parent_id": "t1_gg2ayg0",
                    "score": 10,
                    "created_utc": 1608158435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally, as an SB, I love lingerie so much. I love wearing it, I love owning designer brands, I love talking about it, I love shopping for it. The style and fit talk is addicting. I'm also not exclusive with my SD and I love wearing things he bought me for other people. I like taking photos in it and sharing them with him and other partners. So when he gets me lingerie it is most definitely a gift for me and I wear it how I want to, not just for his enjoyment.",
            "author": "pour_the_tea",
            "id": "gg3r4yz",
            "parent_id": "t3_kedgij",
            "score": 4,
            "created_utc": 1608175080.0,
            "replies": []
        },
        {
            "body": "100% Patriarchal gifts",
            "author": "Hellofarush",
            "id": "gg5fcnu",
            "parent_id": "t3_kedgij",
            "score": 2,
            "created_utc": 1608220206.0,
            "replies": []
        },
        {
            "body": "I agree the best gifts are thoughtful ones. I gave her two gifts and had a gift for us last night for our Xmas.\n\nGift 1-  3 foot golden teddy bear since she calls me her Honey Bear.  She loved it saying that she gets to cuddle with me everynight now.\n\nGift 2 - A dress shirt of mine that I wore. She loves my smell on her after we spend a night. Now she can have that while wearing my shirt. She was jumping with joy.\n\nGift 3- Coffee from Brazil her home country and Biscotti her other home country for breakfast the next morning.\n\nThe night and the morning was filled with passion.",
            "author": null,
            "id": "gg2cfpy",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608149092.0,
            "replies": []
        },
        {
            "body": "To each their own, I guess. I frequently give my SB's things like high-end vibrators and sex toys _specifically_ for them to use when not with me. \n\nThen again, my SB's tend to be more along the line of college-age engineering students who are as much gadget freaks as I am, so there's that.",
            "author": "SDRippington",
            "id": "gg3qkw7",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608174778.0,
            "replies": [
                {
                    "body": "Well you sound fun 😘😈",
                    "author": "HarleyQueen68",
                    "id": "gg6r0a7",
                    "parent_id": "t1_gg3qkw7",
                    "score": 1,
                    "created_utc": 1608243429.0,
                    "replies": [
                        {
                            "body": "I try to be. \n\nMany of the guys in their age-range are very vanilla, arrogant, annoyingly jealous and controlling little boy-apes (my SB's words - not mine) in frats (who they also call Rape Cults) and think they need to grade women by the pound. I very much enjoy showing the women subjected to that bullshit the possibilities of what is out there.\n\nI've set the bar WAY higher for some of those guys to reach and have received a great many thanks for that.\n\nAnd despite the downvotes this post gets, I make no excuses for it :-)",
                            "author": "SDRippington",
                            "id": "gg9fybh",
                            "parent_id": "t1_gg6r0a7",
                            "score": 1,
                            "created_utc": 1608307738.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg4fik7",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608192024.0,
            "replies": [
                {
                    "body": "And a good SD will be considerate and give the illusion that he cares ABOUT HER and her wishes.",
                    "author": "ExExpectations",
                    "id": "gg5ldbo",
                    "parent_id": "t1_gg4fik7",
                    "score": 2,
                    "created_utc": 1608223173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here is the other side of that. If I buy lingerie for an SB, and she wears it for her vanilla BF, or a hook up, or even a future SD, isn't that also a gift for her? How about a sex toy? Same deal. Uses it on her own, and with others now and in the future. It is a gift we can all benefit from.",
            "author": "Teejaynj",
            "id": "gg2eoho",
            "parent_id": "t3_kedgij",
            "score": -1,
            "created_utc": 1608150172.0,
            "replies": [
                {
                    "body": "I kinda agree with this. I like wearing sexy things for myself. Most of the men I go out with don’t even care about the lingerie and what I’m wearing then it becomes more about making me feel sexy and less about them. They just want to take it off. Plus they usually get way more exciting if I’m not wearing any underwear.",
                    "author": "Adira5",
                    "id": "gg2lo8p",
                    "parent_id": "t1_gg2eoho",
                    "score": 5,
                    "created_utc": 1608153436.0,
                    "replies": []
                },
                {
                    "body": "I see what you’re saying, but my SD buys me tons of sex toys (that I don’t want) and lingerie in styles that HE likes.  So what you’re saying is not always the case.",
                    "author": "BBSFSA",
                    "id": "gg3h6bf",
                    "parent_id": "t1_gg2eoho",
                    "score": 3,
                    "created_utc": 1608169843.0,
                    "replies": [
                        {
                            "body": "I get that. Another idea is to go lingerie shopping together and you can pick something out together. That is fun. Of course you may need to follow that with shoe and handbag shopping ad well",
                            "author": "Teejaynj",
                            "id": "gg3hldl",
                            "parent_id": "t1_gg3h6bf",
                            "score": 0,
                            "created_utc": 1608170048.0,
                            "replies": [
                                {
                                    "body": "Yeah that’s a good idea.  We went once and it’s just awkward during covid when hardly anyone else is in the store and the sales associate listening in on everything.  After that failure, he asked me to pick a style I liked from a website, but I think he prefers the tacky porn star styles (think cupless bras / teddies & crotchless panties) so now he just picks himself.  I mean it’s better than getting nothing and if it turns him on, sure I’ll wear it.  I mean it is kinda hot, but it’s just not really a gift I view that’s really for me and it makes me feel like a 100% sex object.  I guess that’s part of the SB role though. \n\nHave yet to be taken handbag or shoe shopping, maybe some day!  I should send him to take SD lessons from you lol",
                                    "author": "BBSFSA",
                                    "id": "gg3jabp",
                                    "parent_id": "t1_gg3hldl",
                                    "score": 2,
                                    "created_utc": 1608170930.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is nagging about gifts like the op that causes men to become sugar daddies in the first place. Stop being so entitled.",
            "author": null,
            "id": "gg3eo7k",
            "parent_id": "t3_kedgij",
            "score": -1,
            "created_utc": 1608168526.0,
            "replies": [
                {
                    "body": "I mean this is true",
                    "author": "HarleyQueen68",
                    "id": "gg6r579",
                    "parent_id": "t1_gg3eo7k",
                    "score": 2,
                    "created_utc": 1608243501.0,
                    "replies": []
                },
                {
                    "body": "LMAO.",
                    "author": "FoxyFreckles1989",
                    "id": "gg3gnk1",
                    "parent_id": "t1_gg3eo7k",
                    "score": 3,
                    "created_utc": 1608169567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally I would love lingerie or sex toys for Christmas haha",
            "author": "noodle--head",
            "id": "gg2yxt9",
            "parent_id": "t3_kedgij",
            "score": 0,
            "created_utc": 1608159977.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg2k4gf",
            "parent_id": "t3_kedgij",
            "score": -9,
            "created_utc": 1608152687.0,
            "replies": [
                {
                    "body": "I was 100% with this little exercise until the part about notes/cards/food/handmade gifts. I have seen dozens of SDs posting here saying how good those gifts made them feel. It’s difficult to buy a gift for a man who can buy anything he wants, so hand made and sentimental stuff is great! That’s the common consensus. I don’t see how you’d consider those gifts not **for you.** Sure, she felt good giving it. It should always feel good to give a gift; that isn’t the same as giving someone a gift because it’s self serving (lingerie/sex toys etc.) like discussed in the post. \n\nHowever, I agree that doing sexy things/dressing up/getting sexy gifts for a SD is perfect! I have absolutely no issues with the list you wrote in parentheses. \n\nSo, I’m not sure if your comment was intended to make fun of the OP, or not, but I wanted to chime in with that anyway. Edit: didn’t see the username at first, and now I’m 99.9% positive you were being condescending.",
                    "author": "FoxyFreckles1989",
                    "id": "gg2osyq",
                    "parent_id": "t1_gg2k4gf",
                    "score": 9,
                    "created_utc": 1608154940.0,
                    "replies": [
                        {
                            "body": "Of course he was being condescending. 100%. \n\nNot worthy of my time to engage. 😇😇",
                            "author": "ExExpectations",
                            "id": "gg2um30",
                            "parent_id": "t1_gg2osyq",
                            "score": 12,
                            "created_utc": 1608157761.0,
                            "replies": [
                                {
                                    "body": "He usually is. Lol.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gg2unj3",
                                    "parent_id": "t1_gg2um30",
                                    "score": 9,
                                    "created_utc": 1608157781.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gg3km7s",
                                    "parent_id": "t1_gg2um30",
                                    "score": -1,
                                    "created_utc": 1608171618.0,
                                    "replies": [
                                        {
                                            "body": "She responded to *me,* not you.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gg5wtev",
                                            "parent_id": "t1_gg3km7s",
                                            "score": 3,
                                            "created_utc": 1608228684.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are not his wife. You are not his girlfriend in real life. He is not being selfish, he is buying a gift for the both of you. You can always not accept  it if you are offended.",
            "author": "Hot-Farm5857",
            "id": "gg4euig",
            "parent_id": "t3_kedgij",
            "score": -1,
            "created_utc": 1608191421.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gg4znaw",
                    "parent_id": "t1_gg4euig",
                    "score": 3,
                    "created_utc": 1608211038.0,
                    "replies": [
                        {
                            "body": "Lost causes are just that, lost causes. LOL.",
                            "author": "ExExpectations",
                            "id": "gg5lj7c",
                            "parent_id": "t1_gg4znaw",
                            "score": 3,
                            "created_utc": 1608223253.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You seem to not understand that you are his sugar baby and not his wife.",
            "author": "bbmg69",
            "id": "gg4u67r",
            "parent_id": "t3_kedgij",
            "score": -1,
            "created_utc": 1608206528.0,
            "replies": [
                {
                    "body": "Over 230 upvotes. \n\nYou seem to in the rare “population” of not understanding that we SBs are not objects and have opinions and feelings. 🙄",
                    "author": "ExExpectations",
                    "id": "gg5jz1r",
                    "parent_id": "t1_gg4u67r",
                    "score": 6,
                    "created_utc": 1608222497.0,
                    "replies": [
                        {
                            "body": "Echo chambers usually have echos. Has nothing to do with your feelings. It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. You’re free to end the arrangement at any time...",
                            "author": "bbmg69",
                            "id": "gg5k7ra",
                            "parent_id": "t1_gg5jz1r",
                            "score": 0,
                            "created_utc": 1608222614.0,
                            "replies": [
                                {
                                    "body": ">It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. \n\nYou are in the minority - amongst men AND women here. Read the comments.  \nI feel sorry for your \"SBs\"   \n\n\nMy post isn't about me. Or my SDs. I wrote it because more than one SB has shared with me how they felt after getting cheap and cheaply made lingeries from their SD and no other gifts were given. \n\nBut you do you. I'm sure you need to schedule some \"service\" because you sound broken and cranky.",
                                    "author": "ExExpectations",
                                    "id": "gg5q4p4",
                                    "parent_id": "t1_gg5k7ra",
                                    "score": 3,
                                    "created_utc": 1608225484.0,
                                    "replies": [
                                        {
                                            "body": "🥱",
                                            "author": "bbmg69",
                                            "id": "gg5qabo",
                                            "parent_id": "t1_gg5q4p4",
                                            "score": -1,
                                            "created_utc": 1608225561.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yikes. You sound more suited for escorts (which is 100% fine, on your end and theirs). You truly can’t understand that just because a SR involves the exchanging of money, both people and their wants/needs/feelings still matter? It’s supposed to be a *relationship.*",
                                    "author": "FoxyFreckles1989",
                                    "id": "gg5wfqw",
                                    "parent_id": "t1_gg5k7ra",
                                    "score": 3,
                                    "created_utc": 1608228502.0,
                                    "replies": [
                                        {
                                            "body": "😂",
                                            "author": "bbmg69",
                                            "id": "gg5whv2",
                                            "parent_id": "t1_gg5wfqw",
                                            "score": -1,
                                            "created_utc": 1608228530.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "First of all you are the one wearing the lingerie, your the one using it so it isn't for him at all.\n\nSecond, if he dumps he won't see you wearing it anymore so even if it's for him to see, he won't benefit from it forever. \n\nIf I was a sugar daddy I rather see you nude than with lingerie/clothes so I get no pleasure from watching a sugar baby with those things.",
            "author": "Live_Abbreviations_5",
            "id": "gg5y4tu",
            "parent_id": "t3_kedgij",
            "score": -1,
            "created_utc": 1608229317.0,
            "replies": []
        },
        {
            "body": "I once bought an SB lingerie, she loved it, wore it once and never brought it out again.\nLater found out she loved wearing it for her vanilla BF lol.",
            "author": "Wildebot34",
            "id": "gg2n2t5",
            "parent_id": "t3_kedgij",
            "score": -2,
            "created_utc": 1608154106.0,
            "replies": []
        },
        {
            "body": "I agree but I've had neither. I once received a bar of chocolate, he said it was fancy. It was good just not expected from an SD.",
            "author": "eshtahnohs",
            "id": "gg3zuwl",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608180070.0,
            "replies": []
        },
        {
            "body": "> Of course, lingerie and sex toy types of gifts are appreciated - with a  thank you and a smile. But deep down, I wish there are gifts JUST FOR ME  as well. \n\nI think this is about accurate for me.  I'd like my SB to be appreciative regardless; but I have no illusions as to why I bought that specific lingerie, and who might enjoy it more.  I don't really consider this some largesse on my part.\n\nThat said, one basic correction:  I can go to Frederick's or even Wicked Temptations, and find some item that looks dirty and slutty and is at least as much of a turn on as anything I could find on Agent Provocateur at literally a tenth the price.  To the extent an SB is specifically asking for AP (or you get the idea -- any higher end lingerie), that's the extent to which the lingerie is for her.  I could easily spend $100 or less on any particular lingerie and experience everything I love about lingerie; if you ask me to spend nearly an order of magnitude more, that's definitely at least partially for you.",
            "author": "Azurecole",
            "id": "gg5xflo",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608228980.0,
            "replies": []
        },
        {
            "body": "Shooooooot I’ll take the sex toys and lingerie! I mean if it’s bought for you then you can send videos of yourself enjoying those things to your SD for his enjoyment \nWait what’s the problem here? 🤷🏼‍♀️",
            "author": "HarleyQueen68",
            "id": "gg6qfog",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608243132.0,
            "replies": []
        },
        {
            "body": "I have had the same group of sugar babies for about 3 years now. They get along with each other very well and they all treat me with extreme love, affection and respect (photos available on request). I do not buy them gifts they do not want. I take them shopping on their birthdays and let them pick out whatever they want. They love it. and everybody is happy. That's one reason we have been happy together for a long time. I recommend it.",
            "author": "inttrepidd",
            "id": "ggawcvv",
            "parent_id": "t3_kedgij",
            "score": 1,
            "created_utc": 1608330869.0,
            "replies": []
        },
        {
            "body": "I have since lost the link, but I found a real vintage ad for lingerie directed at men for Secretary’s Day! I think it was stockings maybe but still, major mid century creep factor.",
            "author": null,
            "id": "gg2qq23",
            "parent_id": "t1_gg1xykn",
            "score": 23,
            "created_utc": 1608155838.0,
            "replies": [
                {
                    "body": "Men truly are something else",
                    "author": "blissyblonde",
                    "id": "gg2voiw",
                    "parent_id": "t1_gg2qq23",
                    "score": 16,
                    "created_utc": 1608158300.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I need you as my SD",
            "author": null,
            "id": "gg38erk",
            "parent_id": "t1_gg1tqbw",
            "score": 24,
            "created_utc": 1608165108.0,
            "replies": []
        },
        {
            "body": "How does she go above and beyond?",
            "author": "tahliawetnwild",
            "id": "gg3wk6l",
            "parent_id": "t1_gg1tqbw",
            "score": 9,
            "created_utc": 1608178120.0,
            "replies": [
                {
                    "body": "I am a priority in her life, she is extremely attentive and makes sure I am well loved and cared for.",
                    "author": null,
                    "id": "gg5cets",
                    "parent_id": "t1_gg3wk6l",
                    "score": 7,
                    "created_utc": 1608218710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes!",
            "author": "bloom_splat",
            "id": "gg3cr68",
            "parent_id": "t1_gg1tqbw",
            "score": 2,
            "created_utc": 1608167492.0,
            "replies": []
        },
        {
            "body": "“😂😂😂😂😂😂. I got you the extra heavy duty envelopes so they don’t tear in case you want to try to overload them with hundreds”.    So thoughtful",
            "author": "LotBuilder",
            "id": "gg3cxek",
            "parent_id": "t1_gg23cup",
            "score": 41,
            "created_utc": 1608167586.0,
            "replies": []
        },
        {
            "body": "hahahaha hand painted envelopes actually sound quite exquisite.",
            "author": "sbluxx",
            "id": "gg2739x",
            "parent_id": "t1_gg23cup",
            "score": 25,
            "created_utc": 1608146585.0,
            "replies": []
        },
        {
            "body": "🤣",
            "author": "B1oodSugarSexMagik",
            "id": "gg31w3k",
            "parent_id": "t1_gg23cup",
            "score": 6,
            "created_utc": 1608161543.0,
            "replies": []
        },
        {
            "body": "I'm going to refresh and see if this post comes up a third or fourth time.",
            "author": "BinghamtonSD",
            "id": "gg1toaj",
            "parent_id": "t1_gg1sbuz",
            "score": 18,
            "created_utc": 1608140324.0,
            "replies": [
                {
                    "body": "🤣",
                    "author": "ExExpectations",
                    "id": "gg1u2ng",
                    "parent_id": "t1_gg1toaj",
                    "score": 4,
                    "created_utc": 1608140514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL. Right??? Thank you for the laugh.",
            "author": "ExExpectations",
            "id": "gg38vmw",
            "parent_id": "t1_gg2xde0",
            "score": 3,
            "created_utc": 1608165365.0,
            "replies": []
        },
        {
            "body": "I like this 😘",
            "author": "HarleyQueen68",
            "id": "gg6qosw",
            "parent_id": "t1_gg3u2px",
            "score": 3,
            "created_utc": 1608243264.0,
            "replies": []
        },
        {
            "body": "You looking for a sb?",
            "author": "n_colee",
            "id": "gg4ngxp",
            "parent_id": "t1_gg1shw9",
            "score": -1,
            "created_utc": 1608199924.0,
            "replies": []
        },
        {
            "body": "Costco...has clothing?",
            "author": "longrunfun",
            "id": "gg7gesl",
            "parent_id": "t1_gg31uf1",
            "score": 2,
            "created_utc": 1608256705.0,
            "replies": []
        },
        {
            "body": "Love the fact you've taken an introspect approach",
            "author": "BadWolf1318",
            "id": "gg3vpmn",
            "parent_id": "t1_gg2bmb1",
            "score": 4,
            "created_utc": 1608177642.0,
            "replies": []
        },
        {
            "body": "You're not alone, that's why I quit the bowl. Only 3 of the SDs bought me gifts (all are whales, I can't see how a \"normal\" SD is willing to fork out extra $$$). While I met dozens. \n\nI'd be very very happy with Agent Provocateur as a gift.",
            "author": "SnooDoggos512",
            "id": "gg3snul",
            "parent_id": "t1_gg3m5wm",
            "score": 2,
            "created_utc": 1608175938.0,
            "replies": [
                {
                    "body": ">I'd be very very happy with Agent Provocateur as a gift.\n\n....except, when these lingerie \"gifts\" is usually given, they are not typically AP brand or high-end brand. They're tacky, cheaply made, and cheap.",
                    "author": "ExExpectations",
                    "id": "gg5luls",
                    "parent_id": "t1_gg3snul",
                    "score": 3,
                    "created_utc": 1608223409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From me",
            "author": "sophiaandrew-244",
            "id": "gg4vyxj",
            "parent_id": "t1_gg3jrxp",
            "score": 1,
            "created_utc": 1608208155.0,
            "replies": []
        },
        {
            "body": "Also in my 2:1 hers/ours reckoning I include chocolates, wine, and other consumables we are likely to share in the ours category, not just lingerie and toys.",
            "author": "LookingForTrueStuff",
            "id": "gg1vmh0",
            "parent_id": "t1_gg1uxy1",
            "score": 3,
            "created_utc": 1608141248.0,
            "replies": []
        },
        {
            "body": "There is a huge difference between buying a toy for her to use in private, and buying, say, a vibrating cocking",
            "author": "blissyblonde",
            "id": "gg2vy59",
            "parent_id": "t1_gg2ayg0",
            "score": 10,
            "created_utc": 1608158435.0,
            "replies": []
        },
        {
            "body": "Well you sound fun 😘😈",
            "author": "HarleyQueen68",
            "id": "gg6r0a7",
            "parent_id": "t1_gg3qkw7",
            "score": 1,
            "created_utc": 1608243429.0,
            "replies": [
                {
                    "body": "I try to be. \n\nMany of the guys in their age-range are very vanilla, arrogant, annoyingly jealous and controlling little boy-apes (my SB's words - not mine) in frats (who they also call Rape Cults) and think they need to grade women by the pound. I very much enjoy showing the women subjected to that bullshit the possibilities of what is out there.\n\nI've set the bar WAY higher for some of those guys to reach and have received a great many thanks for that.\n\nAnd despite the downvotes this post gets, I make no excuses for it :-)",
                    "author": "SDRippington",
                    "id": "gg9fybh",
                    "parent_id": "t1_gg6r0a7",
                    "score": 1,
                    "created_utc": 1608307738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And a good SD will be considerate and give the illusion that he cares ABOUT HER and her wishes.",
            "author": "ExExpectations",
            "id": "gg5ldbo",
            "parent_id": "t1_gg4fik7",
            "score": 2,
            "created_utc": 1608223173.0,
            "replies": []
        },
        {
            "body": "I kinda agree with this. I like wearing sexy things for myself. Most of the men I go out with don’t even care about the lingerie and what I’m wearing then it becomes more about making me feel sexy and less about them. They just want to take it off. Plus they usually get way more exciting if I’m not wearing any underwear.",
            "author": "Adira5",
            "id": "gg2lo8p",
            "parent_id": "t1_gg2eoho",
            "score": 5,
            "created_utc": 1608153436.0,
            "replies": []
        },
        {
            "body": "I see what you’re saying, but my SD buys me tons of sex toys (that I don’t want) and lingerie in styles that HE likes.  So what you’re saying is not always the case.",
            "author": "BBSFSA",
            "id": "gg3h6bf",
            "parent_id": "t1_gg2eoho",
            "score": 3,
            "created_utc": 1608169843.0,
            "replies": [
                {
                    "body": "I get that. Another idea is to go lingerie shopping together and you can pick something out together. That is fun. Of course you may need to follow that with shoe and handbag shopping ad well",
                    "author": "Teejaynj",
                    "id": "gg3hldl",
                    "parent_id": "t1_gg3h6bf",
                    "score": 0,
                    "created_utc": 1608170048.0,
                    "replies": [
                        {
                            "body": "Yeah that’s a good idea.  We went once and it’s just awkward during covid when hardly anyone else is in the store and the sales associate listening in on everything.  After that failure, he asked me to pick a style I liked from a website, but I think he prefers the tacky porn star styles (think cupless bras / teddies & crotchless panties) so now he just picks himself.  I mean it’s better than getting nothing and if it turns him on, sure I’ll wear it.  I mean it is kinda hot, but it’s just not really a gift I view that’s really for me and it makes me feel like a 100% sex object.  I guess that’s part of the SB role though. \n\nHave yet to be taken handbag or shoe shopping, maybe some day!  I should send him to take SD lessons from you lol",
                            "author": "BBSFSA",
                            "id": "gg3jabp",
                            "parent_id": "t1_gg3hldl",
                            "score": 2,
                            "created_utc": 1608170930.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean this is true",
            "author": "HarleyQueen68",
            "id": "gg6r579",
            "parent_id": "t1_gg3eo7k",
            "score": 2,
            "created_utc": 1608243501.0,
            "replies": []
        },
        {
            "body": "LMAO.",
            "author": "FoxyFreckles1989",
            "id": "gg3gnk1",
            "parent_id": "t1_gg3eo7k",
            "score": 3,
            "created_utc": 1608169567.0,
            "replies": []
        },
        {
            "body": "I was 100% with this little exercise until the part about notes/cards/food/handmade gifts. I have seen dozens of SDs posting here saying how good those gifts made them feel. It’s difficult to buy a gift for a man who can buy anything he wants, so hand made and sentimental stuff is great! That’s the common consensus. I don’t see how you’d consider those gifts not **for you.** Sure, she felt good giving it. It should always feel good to give a gift; that isn’t the same as giving someone a gift because it’s self serving (lingerie/sex toys etc.) like discussed in the post. \n\nHowever, I agree that doing sexy things/dressing up/getting sexy gifts for a SD is perfect! I have absolutely no issues with the list you wrote in parentheses. \n\nSo, I’m not sure if your comment was intended to make fun of the OP, or not, but I wanted to chime in with that anyway. Edit: didn’t see the username at first, and now I’m 99.9% positive you were being condescending.",
            "author": "FoxyFreckles1989",
            "id": "gg2osyq",
            "parent_id": "t1_gg2k4gf",
            "score": 9,
            "created_utc": 1608154940.0,
            "replies": [
                {
                    "body": "Of course he was being condescending. 100%. \n\nNot worthy of my time to engage. 😇😇",
                    "author": "ExExpectations",
                    "id": "gg2um30",
                    "parent_id": "t1_gg2osyq",
                    "score": 12,
                    "created_utc": 1608157761.0,
                    "replies": [
                        {
                            "body": "He usually is. Lol.",
                            "author": "FoxyFreckles1989",
                            "id": "gg2unj3",
                            "parent_id": "t1_gg2um30",
                            "score": 9,
                            "created_utc": 1608157781.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gg3km7s",
                            "parent_id": "t1_gg2um30",
                            "score": -1,
                            "created_utc": 1608171618.0,
                            "replies": [
                                {
                                    "body": "She responded to *me,* not you.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gg5wtev",
                                    "parent_id": "t1_gg3km7s",
                                    "score": 3,
                                    "created_utc": 1608228684.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg4znaw",
            "parent_id": "t1_gg4euig",
            "score": 3,
            "created_utc": 1608211038.0,
            "replies": [
                {
                    "body": "Lost causes are just that, lost causes. LOL.",
                    "author": "ExExpectations",
                    "id": "gg5lj7c",
                    "parent_id": "t1_gg4znaw",
                    "score": 3,
                    "created_utc": 1608223253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Over 230 upvotes. \n\nYou seem to in the rare “population” of not understanding that we SBs are not objects and have opinions and feelings. 🙄",
            "author": "ExExpectations",
            "id": "gg5jz1r",
            "parent_id": "t1_gg4u67r",
            "score": 6,
            "created_utc": 1608222497.0,
            "replies": [
                {
                    "body": "Echo chambers usually have echos. Has nothing to do with your feelings. It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. You’re free to end the arrangement at any time...",
                    "author": "bbmg69",
                    "id": "gg5k7ra",
                    "parent_id": "t1_gg5jz1r",
                    "score": 0,
                    "created_utc": 1608222614.0,
                    "replies": [
                        {
                            "body": ">It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. \n\nYou are in the minority - amongst men AND women here. Read the comments.  \nI feel sorry for your \"SBs\"   \n\n\nMy post isn't about me. Or my SDs. I wrote it because more than one SB has shared with me how they felt after getting cheap and cheaply made lingeries from their SD and no other gifts were given. \n\nBut you do you. I'm sure you need to schedule some \"service\" because you sound broken and cranky.",
                            "author": "ExExpectations",
                            "id": "gg5q4p4",
                            "parent_id": "t1_gg5k7ra",
                            "score": 3,
                            "created_utc": 1608225484.0,
                            "replies": [
                                {
                                    "body": "🥱",
                                    "author": "bbmg69",
                                    "id": "gg5qabo",
                                    "parent_id": "t1_gg5q4p4",
                                    "score": -1,
                                    "created_utc": 1608225561.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yikes. You sound more suited for escorts (which is 100% fine, on your end and theirs). You truly can’t understand that just because a SR involves the exchanging of money, both people and their wants/needs/feelings still matter? It’s supposed to be a *relationship.*",
                            "author": "FoxyFreckles1989",
                            "id": "gg5wfqw",
                            "parent_id": "t1_gg5k7ra",
                            "score": 3,
                            "created_utc": 1608228502.0,
                            "replies": [
                                {
                                    "body": "😂",
                                    "author": "bbmg69",
                                    "id": "gg5whv2",
                                    "parent_id": "t1_gg5wfqw",
                                    "score": -1,
                                    "created_utc": 1608228530.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men truly are something else",
            "author": "blissyblonde",
            "id": "gg2voiw",
            "parent_id": "t1_gg2qq23",
            "score": 16,
            "created_utc": 1608158300.0,
            "replies": []
        },
        {
            "body": "I am a priority in her life, she is extremely attentive and makes sure I am well loved and cared for.",
            "author": null,
            "id": "gg5cets",
            "parent_id": "t1_gg3wk6l",
            "score": 7,
            "created_utc": 1608218710.0,
            "replies": []
        },
        {
            "body": "🤣",
            "author": "ExExpectations",
            "id": "gg1u2ng",
            "parent_id": "t1_gg1toaj",
            "score": 4,
            "created_utc": 1608140514.0,
            "replies": []
        },
        {
            "body": ">I'd be very very happy with Agent Provocateur as a gift.\n\n....except, when these lingerie \"gifts\" is usually given, they are not typically AP brand or high-end brand. They're tacky, cheaply made, and cheap.",
            "author": "ExExpectations",
            "id": "gg5luls",
            "parent_id": "t1_gg3snul",
            "score": 3,
            "created_utc": 1608223409.0,
            "replies": []
        },
        {
            "body": "I try to be. \n\nMany of the guys in their age-range are very vanilla, arrogant, annoyingly jealous and controlling little boy-apes (my SB's words - not mine) in frats (who they also call Rape Cults) and think they need to grade women by the pound. I very much enjoy showing the women subjected to that bullshit the possibilities of what is out there.\n\nI've set the bar WAY higher for some of those guys to reach and have received a great many thanks for that.\n\nAnd despite the downvotes this post gets, I make no excuses for it :-)",
            "author": "SDRippington",
            "id": "gg9fybh",
            "parent_id": "t1_gg6r0a7",
            "score": 1,
            "created_utc": 1608307738.0,
            "replies": []
        },
        {
            "body": "I get that. Another idea is to go lingerie shopping together and you can pick something out together. That is fun. Of course you may need to follow that with shoe and handbag shopping ad well",
            "author": "Teejaynj",
            "id": "gg3hldl",
            "parent_id": "t1_gg3h6bf",
            "score": 0,
            "created_utc": 1608170048.0,
            "replies": [
                {
                    "body": "Yeah that’s a good idea.  We went once and it’s just awkward during covid when hardly anyone else is in the store and the sales associate listening in on everything.  After that failure, he asked me to pick a style I liked from a website, but I think he prefers the tacky porn star styles (think cupless bras / teddies & crotchless panties) so now he just picks himself.  I mean it’s better than getting nothing and if it turns him on, sure I’ll wear it.  I mean it is kinda hot, but it’s just not really a gift I view that’s really for me and it makes me feel like a 100% sex object.  I guess that’s part of the SB role though. \n\nHave yet to be taken handbag or shoe shopping, maybe some day!  I should send him to take SD lessons from you lol",
                    "author": "BBSFSA",
                    "id": "gg3jabp",
                    "parent_id": "t1_gg3hldl",
                    "score": 2,
                    "created_utc": 1608170930.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Of course he was being condescending. 100%. \n\nNot worthy of my time to engage. 😇😇",
            "author": "ExExpectations",
            "id": "gg2um30",
            "parent_id": "t1_gg2osyq",
            "score": 12,
            "created_utc": 1608157761.0,
            "replies": [
                {
                    "body": "He usually is. Lol.",
                    "author": "FoxyFreckles1989",
                    "id": "gg2unj3",
                    "parent_id": "t1_gg2um30",
                    "score": 9,
                    "created_utc": 1608157781.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gg3km7s",
                    "parent_id": "t1_gg2um30",
                    "score": -1,
                    "created_utc": 1608171618.0,
                    "replies": [
                        {
                            "body": "She responded to *me,* not you.",
                            "author": "FoxyFreckles1989",
                            "id": "gg5wtev",
                            "parent_id": "t1_gg3km7s",
                            "score": 3,
                            "created_utc": 1608228684.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lost causes are just that, lost causes. LOL.",
            "author": "ExExpectations",
            "id": "gg5lj7c",
            "parent_id": "t1_gg4znaw",
            "score": 3,
            "created_utc": 1608223253.0,
            "replies": []
        },
        {
            "body": "Echo chambers usually have echos. Has nothing to do with your feelings. It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. You’re free to end the arrangement at any time...",
            "author": "bbmg69",
            "id": "gg5k7ra",
            "parent_id": "t1_gg5jz1r",
            "score": 0,
            "created_utc": 1608222614.0,
            "replies": [
                {
                    "body": ">It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. \n\nYou are in the minority - amongst men AND women here. Read the comments.  \nI feel sorry for your \"SBs\"   \n\n\nMy post isn't about me. Or my SDs. I wrote it because more than one SB has shared with me how they felt after getting cheap and cheaply made lingeries from their SD and no other gifts were given. \n\nBut you do you. I'm sure you need to schedule some \"service\" because you sound broken and cranky.",
                    "author": "ExExpectations",
                    "id": "gg5q4p4",
                    "parent_id": "t1_gg5k7ra",
                    "score": 3,
                    "created_utc": 1608225484.0,
                    "replies": [
                        {
                            "body": "🥱",
                            "author": "bbmg69",
                            "id": "gg5qabo",
                            "parent_id": "t1_gg5q4p4",
                            "score": -1,
                            "created_utc": 1608225561.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yikes. You sound more suited for escorts (which is 100% fine, on your end and theirs). You truly can’t understand that just because a SR involves the exchanging of money, both people and their wants/needs/feelings still matter? It’s supposed to be a *relationship.*",
                    "author": "FoxyFreckles1989",
                    "id": "gg5wfqw",
                    "parent_id": "t1_gg5k7ra",
                    "score": 3,
                    "created_utc": 1608228502.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "bbmg69",
                            "id": "gg5whv2",
                            "parent_id": "t1_gg5wfqw",
                            "score": -1,
                            "created_utc": 1608228530.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah that’s a good idea.  We went once and it’s just awkward during covid when hardly anyone else is in the store and the sales associate listening in on everything.  After that failure, he asked me to pick a style I liked from a website, but I think he prefers the tacky porn star styles (think cupless bras / teddies & crotchless panties) so now he just picks himself.  I mean it’s better than getting nothing and if it turns him on, sure I’ll wear it.  I mean it is kinda hot, but it’s just not really a gift I view that’s really for me and it makes me feel like a 100% sex object.  I guess that’s part of the SB role though. \n\nHave yet to be taken handbag or shoe shopping, maybe some day!  I should send him to take SD lessons from you lol",
            "author": "BBSFSA",
            "id": "gg3jabp",
            "parent_id": "t1_gg3hldl",
            "score": 2,
            "created_utc": 1608170930.0,
            "replies": []
        },
        {
            "body": "He usually is. Lol.",
            "author": "FoxyFreckles1989",
            "id": "gg2unj3",
            "parent_id": "t1_gg2um30",
            "score": 9,
            "created_utc": 1608157781.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg3km7s",
            "parent_id": "t1_gg2um30",
            "score": -1,
            "created_utc": 1608171618.0,
            "replies": [
                {
                    "body": "She responded to *me,* not you.",
                    "author": "FoxyFreckles1989",
                    "id": "gg5wtev",
                    "parent_id": "t1_gg3km7s",
                    "score": 3,
                    "created_utc": 1608228684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">It’s a gift and you’re paid for a service. Don’t whine about the gift being self serving. \n\nYou are in the minority - amongst men AND women here. Read the comments.  \nI feel sorry for your \"SBs\"   \n\n\nMy post isn't about me. Or my SDs. I wrote it because more than one SB has shared with me how they felt after getting cheap and cheaply made lingeries from their SD and no other gifts were given. \n\nBut you do you. I'm sure you need to schedule some \"service\" because you sound broken and cranky.",
            "author": "ExExpectations",
            "id": "gg5q4p4",
            "parent_id": "t1_gg5k7ra",
            "score": 3,
            "created_utc": 1608225484.0,
            "replies": [
                {
                    "body": "🥱",
                    "author": "bbmg69",
                    "id": "gg5qabo",
                    "parent_id": "t1_gg5q4p4",
                    "score": -1,
                    "created_utc": 1608225561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yikes. You sound more suited for escorts (which is 100% fine, on your end and theirs). You truly can’t understand that just because a SR involves the exchanging of money, both people and their wants/needs/feelings still matter? It’s supposed to be a *relationship.*",
            "author": "FoxyFreckles1989",
            "id": "gg5wfqw",
            "parent_id": "t1_gg5k7ra",
            "score": 3,
            "created_utc": 1608228502.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "bbmg69",
                    "id": "gg5whv2",
                    "parent_id": "t1_gg5wfqw",
                    "score": -1,
                    "created_utc": 1608228530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She responded to *me,* not you.",
            "author": "FoxyFreckles1989",
            "id": "gg5wtev",
            "parent_id": "t1_gg3km7s",
            "score": 3,
            "created_utc": 1608228684.0,
            "replies": []
        },
        {
            "body": "🥱",
            "author": "bbmg69",
            "id": "gg5qabo",
            "parent_id": "t1_gg5q4p4",
            "score": -1,
            "created_utc": 1608225561.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "bbmg69",
            "id": "gg5whv2",
            "parent_id": "t1_gg5wfqw",
            "score": -1,
            "created_utc": 1608228530.0,
            "replies": []
        }
    ]
}