{
    "title": "Met my perfect match and I’m so swooning with joy 🙈🙈🙈",
    "post_id": "l52c6q",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l52c6q/met_my_perfect_match_and_im_so_swooning_with_joy/",
    "author": "barkingatthecow",
    "body": "I had a M&G with an SD two weeks ago and this past weekend we had our second date no intimacy, but we absolutely hit it off!! He is incredibly sweet, ivy educated and isn’t married (thank god). The best part is, we didn’t even have to discuss the financials he simply threw out a ballpark range and it was right what I was looking for. Another best part is he gave me 2x what I expected for PPM ($XXXX) on our second date!!! I was honestly shocked by his generosity but I really need someone like that in my life and it is a wonderful feeling to have found him especially after months of waiting for the right person. We have similar hobbies, like the same foods and enjoy the same topics. I really lucked out with him, so my message is to those who are still looking. Keep going, you’ll find your charmer :)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l52c6q/met_my_perfect_match_and_im_so_swooning_with_joy/",
    "score": 185,
    "upvote_ratio": 0.96,
    "created_utc": 1611622671.0,
    "num_comments": 48,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I hear your sentiments and feel the same!!  Just back from seeing her for quite a beautiful evening - Jacuzzi, excellent conversation, awesome intimate connection.  After 2 1/2 years, we are slowing falling more deeply for each other.  The relationship just gets better over time.  \n\nThis lifestyle truly has its rewards!",
            "author": "HappyBear1952",
            "id": "gksle62",
            "parent_id": "t3_l52c6q",
            "score": 15,
            "created_utc": 1611637804.0,
            "replies": []
        },
        {
            "body": "Yay you!",
            "author": "BGDDDY1",
            "id": "gkrutbx",
            "parent_id": "t3_l52c6q",
            "score": 6,
            "created_utc": 1611623153.0,
            "replies": []
        },
        {
            "body": "Yay congrats!!! 🎉",
            "author": "TheMysteryRemains",
            "id": "gkrv4nb",
            "parent_id": "t3_l52c6q",
            "score": 7,
            "created_utc": 1611623319.0,
            "replies": []
        },
        {
            "body": "Yasssss 🥳🥂",
            "author": null,
            "id": "gkrvqpu",
            "parent_id": "t3_l52c6q",
            "score": 7,
            "created_utc": 1611623641.0,
            "replies": []
        },
        {
            "body": "You found a keeper! Yay!! 😍❤️❤️❤️",
            "author": "orangeyaglad",
            "id": "gkrx5a3",
            "parent_id": "t3_l52c6q",
            "score": 7,
            "created_utc": 1611624374.0,
            "replies": []
        },
        {
            "body": "Good for you!",
            "author": "shugadaddio",
            "id": "gkrwboe",
            "parent_id": "t3_l52c6q",
            "score": 5,
            "created_utc": 1611623943.0,
            "replies": []
        },
        {
            "body": "YAY",
            "author": null,
            "id": "gks1i0i",
            "parent_id": "t3_l52c6q",
            "score": 5,
            "created_utc": 1611626655.0,
            "replies": []
        },
        {
            "body": "All that with no intimacy and that’s how it’s supposed to be!!!",
            "author": "PsychologicalMud9673",
            "id": "gksjr8a",
            "parent_id": "t3_l52c6q",
            "score": 10,
            "created_utc": 1611636741.0,
            "replies": [
                {
                    "body": "why is no intimacy how it's suppose to be again? are we not adults? when I start a vanilla relationship, we have sex. when I start a sugar relationship, I want sex. \nI don't want to be in a relationship with someone that doesn't like having sex with me vanilla or sugar.",
                    "author": "fallingsd",
                    "id": "gktjkdx",
                    "parent_id": "t1_gksjr8a",
                    "score": 4,
                    "created_utc": 1611667226.0,
                    "replies": [
                        {
                            "body": "I don’t think they mean no sex ever. But not requiring sex to be generous. Rather expecting it will come naturally once you judge the person as honest and with good intentions.",
                            "author": "WandererOfInterwebs",
                            "id": "gktl2k1",
                            "parent_id": "t1_gktjkdx",
                            "score": 9,
                            "created_utc": 1611668171.0,
                            "replies": [
                                {
                                    "body": "I'm not sure what that means \"to be generous\" . I doubt the sex makes anyone more generous, that will come from better interactions with eachother.\nbut sex is part of the arrangement. work out the details and decide if you guys are on the same page and the try it out.\nsometimes I give something on a meet and greet but that's if I want to or we agreed on it beforehand. but there's no bigger turn off than girls who think they should get their allowance before they are comfortable with starting an arrangement. and yes that includes sex.",
                                    "author": "fallingsd",
                                    "id": "gktq80z",
                                    "parent_id": "t1_gktl2k1",
                                    "score": -3,
                                    "created_utc": 1611671053.0,
                                    "replies": [
                                        {
                                            "body": "What you describe “if I want to or that’s what we agreed to” is exactly what happened in the OP’s circumstances so I’m not sure what you are even objecting to here. If you don’t know what “generous” means, you may be on the wrong subreddit entirely :)",
                                            "author": "WandererOfInterwebs",
                                            "id": "gktz1ow",
                                            "parent_id": "t1_gktq80z",
                                            "score": 6,
                                            "created_utc": 1611675232.0,
                                            "replies": [
                                                {
                                                    "body": "I'm objecting to the comment I replied to on why she feels like the no intimacy part is \"how it should be\".\nshe's obviously hung up on the idea of sex and can't seem to wrap the idea that some girls are perfectly fine having sex right away after meeting you.\nyes there are a ton of scammers and some that really just want a cheap escort, but we good sds and sbs both go through having to deal with it.",
                                                    "author": "fallingsd",
                                                    "id": "gkugqhp",
                                                    "parent_id": "t1_gktz1ow",
                                                    "score": 0,
                                                    "created_utc": 1611682964.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "gkuqeyl",
                                                            "parent_id": "t1_gkugqhp",
                                                            "score": 5,
                                                            "created_utc": 1611686880.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                                                                    "author": "fallingsd",
                                                                    "id": "gkur7mc",
                                                                    "parent_id": "t1_gkuqeyl",
                                                                    "score": 2,
                                                                    "created_utc": 1611687206.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                                                                            "author": "WandererOfInterwebs",
                                                                            "id": "gkv5f7j",
                                                                            "parent_id": "t1_gkur7mc",
                                                                            "score": 2,
                                                                            "created_utc": 1611692995.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gktx07f",
                                    "parent_id": "t1_gktl2k1",
                                    "score": -1,
                                    "created_utc": 1611674299.0,
                                    "replies": [
                                        {
                                            "body": "Money is never required. I’m not sure how you are approaching your arrangements but my allowance has never been “for sex.” I get my allowance if I’m on my period or just not feeling up to intimacy because it’s not a trade.",
                                            "author": "WandererOfInterwebs",
                                            "id": "gktylpv",
                                            "parent_id": "t1_gktx07f",
                                            "score": 6,
                                            "created_utc": 1611675031.0,
                                            "replies": [
                                                {
                                                    "body": "you schedule your dates right. if we only get to hang out once a month or so, is it to much to expect eachother to schedule it at a time when we are both in the mood for sex? you know guys want sex in vanilla relationships when they see you once a week too right? \n\nalmost every chick I have met that is tied up in this sex and intimate part also thinks their \"time should be compensated\" lol. this shit goes both ways.\n \nI have PPM SBs and we spend anywhere between 3 hours to 3 nights together depending on the situation and what we schedule but the allowance expectations don't change and sex happens everytime (yeah even on their period, they are still in the mood, or she reschedule another time, no biggie on both ends).\n\nbut yeah it's fine if you want to find an SD who likes doing other things for your dates. just like it should be fine with an SD who does want to have sex during the limited times you guys can meet. if we start meeting so often, just mvoe it to monthly and don't worry about it. all this focus on the money and sex aspect instead of just finding someone on the same page.",
                                                    "author": "fallingsd",
                                                    "id": "gkv5bgn",
                                                    "parent_id": "t1_gktylpv",
                                                    "score": 0,
                                                    "created_utc": 1611692952.0,
                                                    "replies": [
                                                        {
                                                            "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "gkvj7nu",
                                                            "parent_id": "t1_gkv5bgn",
                                                            "score": 5,
                                                            "created_utc": 1611698565.0,
                                                            "replies": [
                                                                {
                                                                    "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                                                                    "author": "fallingsd",
                                                                    "id": "gkvjstr",
                                                                    "parent_id": "t1_gkvj7nu",
                                                                    "score": 2,
                                                                    "created_utc": 1611698816.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Sugaring has always been about the money... allowances...  an older man helping out a young beautiful woman just because he can, just because he wants to spend time with her... it’s time and companionship for money... sex can happen, of course... sex for money (ppm) is entirely something else ... and we all know what that it",
                                            "author": "PsychologicalMud9673",
                                            "id": "gktylmi",
                                            "parent_id": "t1_gktx07f",
                                            "score": 6,
                                            "created_utc": 1611675030.0,
                                            "replies": [
                                                {
                                                    "body": "\"All that with no intimacy and that’s how it’s supposed to be!!!\" No. What you're talking about is charity. That's not what Sugaring is about. There's an exchange. Two things, not one. Intimacy and generosity. Anything else is something else.",
                                                    "author": "UnEgo",
                                                    "id": "gku0e64",
                                                    "parent_id": "t1_gktylmi",
                                                    "score": -4,
                                                    "created_utc": 1611675819.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m guessing you guys are all under 55 😏",
                                                            "author": "PsychologicalMud9673",
                                                            "id": "gku0n5p",
                                                            "parent_id": "t1_gku0e64",
                                                            "score": 7,
                                                            "created_utc": 1611675933.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Far too young for me 😂",
                                                                    "author": "WandererOfInterwebs",
                                                                    "id": "gkuk4ip",
                                                                    "parent_id": "t1_gku0n5p",
                                                                    "score": 4,
                                                                    "created_utc": 1611684305.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                                                                            "author": "fallingsd",
                                                                            "id": "gkviwzb",
                                                                            "parent_id": "t1_gkuk4ip",
                                                                            "score": 1,
                                                                            "created_utc": 1611698439.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I’m not reading this tbh",
                                                                                    "author": "WandererOfInterwebs",
                                                                                    "id": "gkvjva0",
                                                                                    "parent_id": "t1_gkviwzb",
                                                                                    "score": 3,
                                                                                    "created_utc": 1611698846.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                                                                    "author": "fallingsd",
                                                                    "id": "gkv9nb0",
                                                                    "parent_id": "t1_gku0n5p",
                                                                    "score": 1,
                                                                    "created_utc": 1611694643.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "gkukdtv",
                                                            "parent_id": "t1_gku0e64",
                                                            "score": 2,
                                                            "created_utc": 1611684412.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "gkumuq9",
                                                                    "parent_id": "t1_gkukdtv",
                                                                    "score": 1,
                                                                    "created_utc": 1611685437.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It is to plenty of \"SDs\" here. They say as much.",
                                                                            "author": "ThrwHey2",
                                                                            "id": "gkvatbi",
                                                                            "parent_id": "t1_gkumuq9",
                                                                            "score": 0,
                                                                            "created_utc": 1611695112.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                                                                    "author": "joc13",
                                                                                    "id": "gkvoo8t",
                                                                                    "parent_id": "t1_gkvatbi",
                                                                                    "score": 1,
                                                                                    "created_utc": 1611701020.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                                                                    "author": "fallingsd",
                                                                    "id": "gkv877f",
                                                                    "parent_id": "t1_gkukdtv",
                                                                    "score": 1,
                                                                    "created_utc": 1611694065.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "u keep saying \"sex for money\" instead of ppm arrangement. it's cool you want a monthly thing. good for you. plenty of women want ppm and not commit to seeing someone and exact amount of times a month. \ngood ppm arrangements are made when you guys plan together and see eachother when you both want to. sometimes they ask me and sometimes I ask them. \n\nmake sure u have a real connection or don't have sex period and don't have the arrangement period. escorts get paid for companionship and no sex too sometimes.  the real difference is the escort is acting vs a sugar relationship the interactions should be genuine. i want you to be you. I don't want you to say shit you think I want to hear.",
                                                    "author": "fallingsd",
                                                    "id": "gkv7n2o",
                                                    "parent_id": "t1_gktylmi",
                                                    "score": 1,
                                                    "created_utc": 1611693854.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gktf5x2",
                    "parent_id": "t1_gksjr8a",
                    "score": 1,
                    "created_utc": 1611664146.0,
                    "replies": [
                        {
                            "body": "You know Splendid is very close to Splenda but I’m guessing you did that on purpose 😏",
                            "author": "PsychologicalMud9673",
                            "id": "gku1gs3",
                            "parent_id": "t1_gktf5x2",
                            "score": 5,
                            "created_utc": 1611676306.0,
                            "replies": []
                        },
                        {
                            "body": "This.",
                            "author": "Fun_Focus8159",
                            "id": "gkun7h2",
                            "parent_id": "t1_gktf5x2",
                            "score": 0,
                            "created_utc": 1611685583.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So happy for you! I just had a M&G for the first time in AGES, went great for me too! Fingers crossed everything works out for both of us xx",
            "author": "lookingforc6h12o6",
            "id": "gkv4tpu",
            "parent_id": "t3_l52c6q",
            "score": 3,
            "created_utc": 1611692756.0,
            "replies": []
        },
        {
            "body": "Good for you.  It sounds wonderful. I hope you have a long successful relationship.",
            "author": "ComplexAlternative10",
            "id": "gkuwk1c",
            "parent_id": "t3_l52c6q",
            "score": 2,
            "created_utc": 1611689430.0,
            "replies": []
        },
        {
            "body": "I'm not all that happy about this. It's one more beautiful babe off the market.",
            "author": "longknight8883",
            "id": "gkrw2lp",
            "parent_id": "t3_l52c6q",
            "score": 6,
            "created_utc": 1611623811.0,
            "replies": [
                {
                    "body": "From what I’ve seen there are still plenty for you to pick from babe",
                    "author": null,
                    "id": "gks92t0",
                    "parent_id": "t1_gkrw2lp",
                    "score": 6,
                    "created_utc": 1611630653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations!! I found one like that. It's AMAAAAAZING.",
            "author": "MistressVice",
            "id": "gksbpgj",
            "parent_id": "t3_l52c6q",
            "score": 2,
            "created_utc": 1611632058.0,
            "replies": []
        },
        {
            "body": "Hopefully he doesn’t ghost you!",
            "author": "lagrangianblunt",
            "id": "gksa433",
            "parent_id": "t3_l52c6q",
            "score": 1,
            "created_utc": 1611631206.0,
            "replies": []
        },
        {
            "body": "Actually, I am average looking but I have been lucky to have had 4 multi year SB relationships that I cherished and s few other short term ones. I have established 2 new ones that have only vanilla relationships. All of my SB relationships started as chance friendships that evolved into SR. Nine of them would admit to being a SB because I'm extremely generous and like to take care of some of their néds and all of their wants. Love,  romance, and friendship blossom.",
            "author": "longknight8883",
            "id": "gktbolx",
            "parent_id": "t3_l52c6q",
            "score": 1,
            "created_utc": 1611661268.0,
            "replies": []
        },
        {
            "body": "Make sure to come back and give us a 30 day update.",
            "author": null,
            "id": "gku21p2",
            "parent_id": "t3_l52c6q",
            "score": 1,
            "created_utc": 1611676565.0,
            "replies": []
        },
        {
            "body": "Now get pregnant and you can enjoy the financial benefits without having to have anything todo with him for the next 18-20 years",
            "author": "abigailismyname",
            "id": "gkta3of",
            "parent_id": "t3_l52c6q",
            "score": -10,
            "created_utc": 1611659844.0,
            "replies": [
                {
                    "body": "Not cool",
                    "author": "Meiosis_I",
                    "id": "gktvxld",
                    "parent_id": "t1_gkta3of",
                    "score": 2,
                    "created_utc": 1611673801.0,
                    "replies": []
                },
                {
                    "body": "And this is the type of things that make SDs skeptical about meeting new SBs. Saying things like this ruin it for the rest of us SBs who are still looking for our perfect SD.",
                    "author": "AlwaysArie220",
                    "id": "gkua6e0",
                    "parent_id": "t1_gkta3of",
                    "score": 1,
                    "created_utc": 1611680152.0,
                    "replies": [
                        {
                            "body": "It’s an Obvious joke. Relax.",
                            "author": "Fun_Focus8159",
                            "id": "gkunaz6",
                            "parent_id": "t1_gkua6e0",
                            "score": 4,
                            "created_utc": 1611685621.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "why is no intimacy how it's suppose to be again? are we not adults? when I start a vanilla relationship, we have sex. when I start a sugar relationship, I want sex. \nI don't want to be in a relationship with someone that doesn't like having sex with me vanilla or sugar.",
            "author": "fallingsd",
            "id": "gktjkdx",
            "parent_id": "t1_gksjr8a",
            "score": 4,
            "created_utc": 1611667226.0,
            "replies": [
                {
                    "body": "I don’t think they mean no sex ever. But not requiring sex to be generous. Rather expecting it will come naturally once you judge the person as honest and with good intentions.",
                    "author": "WandererOfInterwebs",
                    "id": "gktl2k1",
                    "parent_id": "t1_gktjkdx",
                    "score": 9,
                    "created_utc": 1611668171.0,
                    "replies": [
                        {
                            "body": "I'm not sure what that means \"to be generous\" . I doubt the sex makes anyone more generous, that will come from better interactions with eachother.\nbut sex is part of the arrangement. work out the details and decide if you guys are on the same page and the try it out.\nsometimes I give something on a meet and greet but that's if I want to or we agreed on it beforehand. but there's no bigger turn off than girls who think they should get their allowance before they are comfortable with starting an arrangement. and yes that includes sex.",
                            "author": "fallingsd",
                            "id": "gktq80z",
                            "parent_id": "t1_gktl2k1",
                            "score": -3,
                            "created_utc": 1611671053.0,
                            "replies": [
                                {
                                    "body": "What you describe “if I want to or that’s what we agreed to” is exactly what happened in the OP’s circumstances so I’m not sure what you are even objecting to here. If you don’t know what “generous” means, you may be on the wrong subreddit entirely :)",
                                    "author": "WandererOfInterwebs",
                                    "id": "gktz1ow",
                                    "parent_id": "t1_gktq80z",
                                    "score": 6,
                                    "created_utc": 1611675232.0,
                                    "replies": [
                                        {
                                            "body": "I'm objecting to the comment I replied to on why she feels like the no intimacy part is \"how it should be\".\nshe's obviously hung up on the idea of sex and can't seem to wrap the idea that some girls are perfectly fine having sex right away after meeting you.\nyes there are a ton of scammers and some that really just want a cheap escort, but we good sds and sbs both go through having to deal with it.",
                                            "author": "fallingsd",
                                            "id": "gkugqhp",
                                            "parent_id": "t1_gktz1ow",
                                            "score": 0,
                                            "created_utc": 1611682964.0,
                                            "replies": [
                                                {
                                                    "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "gkuqeyl",
                                                    "parent_id": "t1_gkugqhp",
                                                    "score": 5,
                                                    "created_utc": 1611686880.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                                                            "author": "fallingsd",
                                                            "id": "gkur7mc",
                                                            "parent_id": "t1_gkuqeyl",
                                                            "score": 2,
                                                            "created_utc": 1611687206.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                                                                    "author": "WandererOfInterwebs",
                                                                    "id": "gkv5f7j",
                                                                    "parent_id": "t1_gkur7mc",
                                                                    "score": 2,
                                                                    "created_utc": 1611692995.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gktx07f",
                            "parent_id": "t1_gktl2k1",
                            "score": -1,
                            "created_utc": 1611674299.0,
                            "replies": [
                                {
                                    "body": "Money is never required. I’m not sure how you are approaching your arrangements but my allowance has never been “for sex.” I get my allowance if I’m on my period or just not feeling up to intimacy because it’s not a trade.",
                                    "author": "WandererOfInterwebs",
                                    "id": "gktylpv",
                                    "parent_id": "t1_gktx07f",
                                    "score": 6,
                                    "created_utc": 1611675031.0,
                                    "replies": [
                                        {
                                            "body": "you schedule your dates right. if we only get to hang out once a month or so, is it to much to expect eachother to schedule it at a time when we are both in the mood for sex? you know guys want sex in vanilla relationships when they see you once a week too right? \n\nalmost every chick I have met that is tied up in this sex and intimate part also thinks their \"time should be compensated\" lol. this shit goes both ways.\n \nI have PPM SBs and we spend anywhere between 3 hours to 3 nights together depending on the situation and what we schedule but the allowance expectations don't change and sex happens everytime (yeah even on their period, they are still in the mood, or she reschedule another time, no biggie on both ends).\n\nbut yeah it's fine if you want to find an SD who likes doing other things for your dates. just like it should be fine with an SD who does want to have sex during the limited times you guys can meet. if we start meeting so often, just mvoe it to monthly and don't worry about it. all this focus on the money and sex aspect instead of just finding someone on the same page.",
                                            "author": "fallingsd",
                                            "id": "gkv5bgn",
                                            "parent_id": "t1_gktylpv",
                                            "score": 0,
                                            "created_utc": 1611692952.0,
                                            "replies": [
                                                {
                                                    "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "gkvj7nu",
                                                    "parent_id": "t1_gkv5bgn",
                                                    "score": 5,
                                                    "created_utc": 1611698565.0,
                                                    "replies": [
                                                        {
                                                            "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                                                            "author": "fallingsd",
                                                            "id": "gkvjstr",
                                                            "parent_id": "t1_gkvj7nu",
                                                            "score": 2,
                                                            "created_utc": 1611698816.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Sugaring has always been about the money... allowances...  an older man helping out a young beautiful woman just because he can, just because he wants to spend time with her... it’s time and companionship for money... sex can happen, of course... sex for money (ppm) is entirely something else ... and we all know what that it",
                                    "author": "PsychologicalMud9673",
                                    "id": "gktylmi",
                                    "parent_id": "t1_gktx07f",
                                    "score": 6,
                                    "created_utc": 1611675030.0,
                                    "replies": [
                                        {
                                            "body": "\"All that with no intimacy and that’s how it’s supposed to be!!!\" No. What you're talking about is charity. That's not what Sugaring is about. There's an exchange. Two things, not one. Intimacy and generosity. Anything else is something else.",
                                            "author": "UnEgo",
                                            "id": "gku0e64",
                                            "parent_id": "t1_gktylmi",
                                            "score": -4,
                                            "created_utc": 1611675819.0,
                                            "replies": [
                                                {
                                                    "body": "I’m guessing you guys are all under 55 😏",
                                                    "author": "PsychologicalMud9673",
                                                    "id": "gku0n5p",
                                                    "parent_id": "t1_gku0e64",
                                                    "score": 7,
                                                    "created_utc": 1611675933.0,
                                                    "replies": [
                                                        {
                                                            "body": "Far too young for me 😂",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "gkuk4ip",
                                                            "parent_id": "t1_gku0n5p",
                                                            "score": 4,
                                                            "created_utc": 1611684305.0,
                                                            "replies": [
                                                                {
                                                                    "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                                                                    "author": "fallingsd",
                                                                    "id": "gkviwzb",
                                                                    "parent_id": "t1_gkuk4ip",
                                                                    "score": 1,
                                                                    "created_utc": 1611698439.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I’m not reading this tbh",
                                                                            "author": "WandererOfInterwebs",
                                                                            "id": "gkvjva0",
                                                                            "parent_id": "t1_gkviwzb",
                                                                            "score": 3,
                                                                            "created_utc": 1611698846.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                                                            "author": "fallingsd",
                                                            "id": "gkv9nb0",
                                                            "parent_id": "t1_gku0n5p",
                                                            "score": 1,
                                                            "created_utc": 1611694643.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "gkukdtv",
                                                    "parent_id": "t1_gku0e64",
                                                    "score": 2,
                                                    "created_utc": 1611684412.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "gkumuq9",
                                                            "parent_id": "t1_gkukdtv",
                                                            "score": 1,
                                                            "created_utc": 1611685437.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It is to plenty of \"SDs\" here. They say as much.",
                                                                    "author": "ThrwHey2",
                                                                    "id": "gkvatbi",
                                                                    "parent_id": "t1_gkumuq9",
                                                                    "score": 0,
                                                                    "created_utc": 1611695112.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                                                            "author": "joc13",
                                                                            "id": "gkvoo8t",
                                                                            "parent_id": "t1_gkvatbi",
                                                                            "score": 1,
                                                                            "created_utc": 1611701020.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                                                            "author": "fallingsd",
                                                            "id": "gkv877f",
                                                            "parent_id": "t1_gkukdtv",
                                                            "score": 1,
                                                            "created_utc": 1611694065.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "u keep saying \"sex for money\" instead of ppm arrangement. it's cool you want a monthly thing. good for you. plenty of women want ppm and not commit to seeing someone and exact amount of times a month. \ngood ppm arrangements are made when you guys plan together and see eachother when you both want to. sometimes they ask me and sometimes I ask them. \n\nmake sure u have a real connection or don't have sex period and don't have the arrangement period. escorts get paid for companionship and no sex too sometimes.  the real difference is the escort is acting vs a sugar relationship the interactions should be genuine. i want you to be you. I don't want you to say shit you think I want to hear.",
                                            "author": "fallingsd",
                                            "id": "gkv7n2o",
                                            "parent_id": "t1_gktylmi",
                                            "score": 1,
                                            "created_utc": 1611693854.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gktf5x2",
            "parent_id": "t1_gksjr8a",
            "score": 1,
            "created_utc": 1611664146.0,
            "replies": [
                {
                    "body": "You know Splendid is very close to Splenda but I’m guessing you did that on purpose 😏",
                    "author": "PsychologicalMud9673",
                    "id": "gku1gs3",
                    "parent_id": "t1_gktf5x2",
                    "score": 5,
                    "created_utc": 1611676306.0,
                    "replies": []
                },
                {
                    "body": "This.",
                    "author": "Fun_Focus8159",
                    "id": "gkun7h2",
                    "parent_id": "t1_gktf5x2",
                    "score": 0,
                    "created_utc": 1611685583.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From what I’ve seen there are still plenty for you to pick from babe",
            "author": null,
            "id": "gks92t0",
            "parent_id": "t1_gkrw2lp",
            "score": 6,
            "created_utc": 1611630653.0,
            "replies": []
        },
        {
            "body": "Not cool",
            "author": "Meiosis_I",
            "id": "gktvxld",
            "parent_id": "t1_gkta3of",
            "score": 2,
            "created_utc": 1611673801.0,
            "replies": []
        },
        {
            "body": "And this is the type of things that make SDs skeptical about meeting new SBs. Saying things like this ruin it for the rest of us SBs who are still looking for our perfect SD.",
            "author": "AlwaysArie220",
            "id": "gkua6e0",
            "parent_id": "t1_gkta3of",
            "score": 1,
            "created_utc": 1611680152.0,
            "replies": [
                {
                    "body": "It’s an Obvious joke. Relax.",
                    "author": "Fun_Focus8159",
                    "id": "gkunaz6",
                    "parent_id": "t1_gkua6e0",
                    "score": 4,
                    "created_utc": 1611685621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think they mean no sex ever. But not requiring sex to be generous. Rather expecting it will come naturally once you judge the person as honest and with good intentions.",
            "author": "WandererOfInterwebs",
            "id": "gktl2k1",
            "parent_id": "t1_gktjkdx",
            "score": 9,
            "created_utc": 1611668171.0,
            "replies": [
                {
                    "body": "I'm not sure what that means \"to be generous\" . I doubt the sex makes anyone more generous, that will come from better interactions with eachother.\nbut sex is part of the arrangement. work out the details and decide if you guys are on the same page and the try it out.\nsometimes I give something on a meet and greet but that's if I want to or we agreed on it beforehand. but there's no bigger turn off than girls who think they should get their allowance before they are comfortable with starting an arrangement. and yes that includes sex.",
                    "author": "fallingsd",
                    "id": "gktq80z",
                    "parent_id": "t1_gktl2k1",
                    "score": -3,
                    "created_utc": 1611671053.0,
                    "replies": [
                        {
                            "body": "What you describe “if I want to or that’s what we agreed to” is exactly what happened in the OP’s circumstances so I’m not sure what you are even objecting to here. If you don’t know what “generous” means, you may be on the wrong subreddit entirely :)",
                            "author": "WandererOfInterwebs",
                            "id": "gktz1ow",
                            "parent_id": "t1_gktq80z",
                            "score": 6,
                            "created_utc": 1611675232.0,
                            "replies": [
                                {
                                    "body": "I'm objecting to the comment I replied to on why she feels like the no intimacy part is \"how it should be\".\nshe's obviously hung up on the idea of sex and can't seem to wrap the idea that some girls are perfectly fine having sex right away after meeting you.\nyes there are a ton of scammers and some that really just want a cheap escort, but we good sds and sbs both go through having to deal with it.",
                                    "author": "fallingsd",
                                    "id": "gkugqhp",
                                    "parent_id": "t1_gktz1ow",
                                    "score": 0,
                                    "created_utc": 1611682964.0,
                                    "replies": [
                                        {
                                            "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
                                            "author": "WandererOfInterwebs",
                                            "id": "gkuqeyl",
                                            "parent_id": "t1_gkugqhp",
                                            "score": 5,
                                            "created_utc": 1611686880.0,
                                            "replies": [
                                                {
                                                    "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                                                    "author": "fallingsd",
                                                    "id": "gkur7mc",
                                                    "parent_id": "t1_gkuqeyl",
                                                    "score": 2,
                                                    "created_utc": 1611687206.0,
                                                    "replies": [
                                                        {
                                                            "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "gkv5f7j",
                                                            "parent_id": "t1_gkur7mc",
                                                            "score": 2,
                                                            "created_utc": 1611692995.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gktx07f",
                    "parent_id": "t1_gktl2k1",
                    "score": -1,
                    "created_utc": 1611674299.0,
                    "replies": [
                        {
                            "body": "Money is never required. I’m not sure how you are approaching your arrangements but my allowance has never been “for sex.” I get my allowance if I’m on my period or just not feeling up to intimacy because it’s not a trade.",
                            "author": "WandererOfInterwebs",
                            "id": "gktylpv",
                            "parent_id": "t1_gktx07f",
                            "score": 6,
                            "created_utc": 1611675031.0,
                            "replies": [
                                {
                                    "body": "you schedule your dates right. if we only get to hang out once a month or so, is it to much to expect eachother to schedule it at a time when we are both in the mood for sex? you know guys want sex in vanilla relationships when they see you once a week too right? \n\nalmost every chick I have met that is tied up in this sex and intimate part also thinks their \"time should be compensated\" lol. this shit goes both ways.\n \nI have PPM SBs and we spend anywhere between 3 hours to 3 nights together depending on the situation and what we schedule but the allowance expectations don't change and sex happens everytime (yeah even on their period, they are still in the mood, or she reschedule another time, no biggie on both ends).\n\nbut yeah it's fine if you want to find an SD who likes doing other things for your dates. just like it should be fine with an SD who does want to have sex during the limited times you guys can meet. if we start meeting so often, just mvoe it to monthly and don't worry about it. all this focus on the money and sex aspect instead of just finding someone on the same page.",
                                    "author": "fallingsd",
                                    "id": "gkv5bgn",
                                    "parent_id": "t1_gktylpv",
                                    "score": 0,
                                    "created_utc": 1611692952.0,
                                    "replies": [
                                        {
                                            "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
                                            "author": "WandererOfInterwebs",
                                            "id": "gkvj7nu",
                                            "parent_id": "t1_gkv5bgn",
                                            "score": 5,
                                            "created_utc": 1611698565.0,
                                            "replies": [
                                                {
                                                    "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                                                    "author": "fallingsd",
                                                    "id": "gkvjstr",
                                                    "parent_id": "t1_gkvj7nu",
                                                    "score": 2,
                                                    "created_utc": 1611698816.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Sugaring has always been about the money... allowances...  an older man helping out a young beautiful woman just because he can, just because he wants to spend time with her... it’s time and companionship for money... sex can happen, of course... sex for money (ppm) is entirely something else ... and we all know what that it",
                            "author": "PsychologicalMud9673",
                            "id": "gktylmi",
                            "parent_id": "t1_gktx07f",
                            "score": 6,
                            "created_utc": 1611675030.0,
                            "replies": [
                                {
                                    "body": "\"All that with no intimacy and that’s how it’s supposed to be!!!\" No. What you're talking about is charity. That's not what Sugaring is about. There's an exchange. Two things, not one. Intimacy and generosity. Anything else is something else.",
                                    "author": "UnEgo",
                                    "id": "gku0e64",
                                    "parent_id": "t1_gktylmi",
                                    "score": -4,
                                    "created_utc": 1611675819.0,
                                    "replies": [
                                        {
                                            "body": "I’m guessing you guys are all under 55 😏",
                                            "author": "PsychologicalMud9673",
                                            "id": "gku0n5p",
                                            "parent_id": "t1_gku0e64",
                                            "score": 7,
                                            "created_utc": 1611675933.0,
                                            "replies": [
                                                {
                                                    "body": "Far too young for me 😂",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "gkuk4ip",
                                                    "parent_id": "t1_gku0n5p",
                                                    "score": 4,
                                                    "created_utc": 1611684305.0,
                                                    "replies": [
                                                        {
                                                            "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                                                            "author": "fallingsd",
                                                            "id": "gkviwzb",
                                                            "parent_id": "t1_gkuk4ip",
                                                            "score": 1,
                                                            "created_utc": 1611698439.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m not reading this tbh",
                                                                    "author": "WandererOfInterwebs",
                                                                    "id": "gkvjva0",
                                                                    "parent_id": "t1_gkviwzb",
                                                                    "score": 3,
                                                                    "created_utc": 1611698846.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                                                    "author": "fallingsd",
                                                    "id": "gkv9nb0",
                                                    "parent_id": "t1_gku0n5p",
                                                    "score": 1,
                                                    "created_utc": 1611694643.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
                                            "author": "WandererOfInterwebs",
                                            "id": "gkukdtv",
                                            "parent_id": "t1_gku0e64",
                                            "score": 2,
                                            "created_utc": 1611684412.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "gkumuq9",
                                                    "parent_id": "t1_gkukdtv",
                                                    "score": 1,
                                                    "created_utc": 1611685437.0,
                                                    "replies": [
                                                        {
                                                            "body": "It is to plenty of \"SDs\" here. They say as much.",
                                                            "author": "ThrwHey2",
                                                            "id": "gkvatbi",
                                                            "parent_id": "t1_gkumuq9",
                                                            "score": 0,
                                                            "created_utc": 1611695112.0,
                                                            "replies": [
                                                                {
                                                                    "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                                                    "author": "joc13",
                                                                    "id": "gkvoo8t",
                                                                    "parent_id": "t1_gkvatbi",
                                                                    "score": 1,
                                                                    "created_utc": 1611701020.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                                                    "author": "fallingsd",
                                                    "id": "gkv877f",
                                                    "parent_id": "t1_gkukdtv",
                                                    "score": 1,
                                                    "created_utc": 1611694065.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "u keep saying \"sex for money\" instead of ppm arrangement. it's cool you want a monthly thing. good for you. plenty of women want ppm and not commit to seeing someone and exact amount of times a month. \ngood ppm arrangements are made when you guys plan together and see eachother when you both want to. sometimes they ask me and sometimes I ask them. \n\nmake sure u have a real connection or don't have sex period and don't have the arrangement period. escorts get paid for companionship and no sex too sometimes.  the real difference is the escort is acting vs a sugar relationship the interactions should be genuine. i want you to be you. I don't want you to say shit you think I want to hear.",
                                    "author": "fallingsd",
                                    "id": "gkv7n2o",
                                    "parent_id": "t1_gktylmi",
                                    "score": 1,
                                    "created_utc": 1611693854.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know Splendid is very close to Splenda but I’m guessing you did that on purpose 😏",
            "author": "PsychologicalMud9673",
            "id": "gku1gs3",
            "parent_id": "t1_gktf5x2",
            "score": 5,
            "created_utc": 1611676306.0,
            "replies": []
        },
        {
            "body": "This.",
            "author": "Fun_Focus8159",
            "id": "gkun7h2",
            "parent_id": "t1_gktf5x2",
            "score": 0,
            "created_utc": 1611685583.0,
            "replies": []
        },
        {
            "body": "It’s an Obvious joke. Relax.",
            "author": "Fun_Focus8159",
            "id": "gkunaz6",
            "parent_id": "t1_gkua6e0",
            "score": 4,
            "created_utc": 1611685621.0,
            "replies": []
        },
        {
            "body": "I'm not sure what that means \"to be generous\" . I doubt the sex makes anyone more generous, that will come from better interactions with eachother.\nbut sex is part of the arrangement. work out the details and decide if you guys are on the same page and the try it out.\nsometimes I give something on a meet and greet but that's if I want to or we agreed on it beforehand. but there's no bigger turn off than girls who think they should get their allowance before they are comfortable with starting an arrangement. and yes that includes sex.",
            "author": "fallingsd",
            "id": "gktq80z",
            "parent_id": "t1_gktl2k1",
            "score": -3,
            "created_utc": 1611671053.0,
            "replies": [
                {
                    "body": "What you describe “if I want to or that’s what we agreed to” is exactly what happened in the OP’s circumstances so I’m not sure what you are even objecting to here. If you don’t know what “generous” means, you may be on the wrong subreddit entirely :)",
                    "author": "WandererOfInterwebs",
                    "id": "gktz1ow",
                    "parent_id": "t1_gktq80z",
                    "score": 6,
                    "created_utc": 1611675232.0,
                    "replies": [
                        {
                            "body": "I'm objecting to the comment I replied to on why she feels like the no intimacy part is \"how it should be\".\nshe's obviously hung up on the idea of sex and can't seem to wrap the idea that some girls are perfectly fine having sex right away after meeting you.\nyes there are a ton of scammers and some that really just want a cheap escort, but we good sds and sbs both go through having to deal with it.",
                            "author": "fallingsd",
                            "id": "gkugqhp",
                            "parent_id": "t1_gktz1ow",
                            "score": 0,
                            "created_utc": 1611682964.0,
                            "replies": [
                                {
                                    "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
                                    "author": "WandererOfInterwebs",
                                    "id": "gkuqeyl",
                                    "parent_id": "t1_gkugqhp",
                                    "score": 5,
                                    "created_utc": 1611686880.0,
                                    "replies": [
                                        {
                                            "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                                            "author": "fallingsd",
                                            "id": "gkur7mc",
                                            "parent_id": "t1_gkuqeyl",
                                            "score": 2,
                                            "created_utc": 1611687206.0,
                                            "replies": [
                                                {
                                                    "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "gkv5f7j",
                                                    "parent_id": "t1_gkur7mc",
                                                    "score": 2,
                                                    "created_utc": 1611692995.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gktx07f",
            "parent_id": "t1_gktl2k1",
            "score": -1,
            "created_utc": 1611674299.0,
            "replies": [
                {
                    "body": "Money is never required. I’m not sure how you are approaching your arrangements but my allowance has never been “for sex.” I get my allowance if I’m on my period or just not feeling up to intimacy because it’s not a trade.",
                    "author": "WandererOfInterwebs",
                    "id": "gktylpv",
                    "parent_id": "t1_gktx07f",
                    "score": 6,
                    "created_utc": 1611675031.0,
                    "replies": [
                        {
                            "body": "you schedule your dates right. if we only get to hang out once a month or so, is it to much to expect eachother to schedule it at a time when we are both in the mood for sex? you know guys want sex in vanilla relationships when they see you once a week too right? \n\nalmost every chick I have met that is tied up in this sex and intimate part also thinks their \"time should be compensated\" lol. this shit goes both ways.\n \nI have PPM SBs and we spend anywhere between 3 hours to 3 nights together depending on the situation and what we schedule but the allowance expectations don't change and sex happens everytime (yeah even on their period, they are still in the mood, or she reschedule another time, no biggie on both ends).\n\nbut yeah it's fine if you want to find an SD who likes doing other things for your dates. just like it should be fine with an SD who does want to have sex during the limited times you guys can meet. if we start meeting so often, just mvoe it to monthly and don't worry about it. all this focus on the money and sex aspect instead of just finding someone on the same page.",
                            "author": "fallingsd",
                            "id": "gkv5bgn",
                            "parent_id": "t1_gktylpv",
                            "score": 0,
                            "created_utc": 1611692952.0,
                            "replies": [
                                {
                                    "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
                                    "author": "WandererOfInterwebs",
                                    "id": "gkvj7nu",
                                    "parent_id": "t1_gkv5bgn",
                                    "score": 5,
                                    "created_utc": 1611698565.0,
                                    "replies": [
                                        {
                                            "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                                            "author": "fallingsd",
                                            "id": "gkvjstr",
                                            "parent_id": "t1_gkvj7nu",
                                            "score": 2,
                                            "created_utc": 1611698816.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sugaring has always been about the money... allowances...  an older man helping out a young beautiful woman just because he can, just because he wants to spend time with her... it’s time and companionship for money... sex can happen, of course... sex for money (ppm) is entirely something else ... and we all know what that it",
                    "author": "PsychologicalMud9673",
                    "id": "gktylmi",
                    "parent_id": "t1_gktx07f",
                    "score": 6,
                    "created_utc": 1611675030.0,
                    "replies": [
                        {
                            "body": "\"All that with no intimacy and that’s how it’s supposed to be!!!\" No. What you're talking about is charity. That's not what Sugaring is about. There's an exchange. Two things, not one. Intimacy and generosity. Anything else is something else.",
                            "author": "UnEgo",
                            "id": "gku0e64",
                            "parent_id": "t1_gktylmi",
                            "score": -4,
                            "created_utc": 1611675819.0,
                            "replies": [
                                {
                                    "body": "I’m guessing you guys are all under 55 😏",
                                    "author": "PsychologicalMud9673",
                                    "id": "gku0n5p",
                                    "parent_id": "t1_gku0e64",
                                    "score": 7,
                                    "created_utc": 1611675933.0,
                                    "replies": [
                                        {
                                            "body": "Far too young for me 😂",
                                            "author": "WandererOfInterwebs",
                                            "id": "gkuk4ip",
                                            "parent_id": "t1_gku0n5p",
                                            "score": 4,
                                            "created_utc": 1611684305.0,
                                            "replies": [
                                                {
                                                    "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                                                    "author": "fallingsd",
                                                    "id": "gkviwzb",
                                                    "parent_id": "t1_gkuk4ip",
                                                    "score": 1,
                                                    "created_utc": 1611698439.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m not reading this tbh",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "gkvjva0",
                                                            "parent_id": "t1_gkviwzb",
                                                            "score": 3,
                                                            "created_utc": 1611698846.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                                            "author": "fallingsd",
                                            "id": "gkv9nb0",
                                            "parent_id": "t1_gku0n5p",
                                            "score": 1,
                                            "created_utc": 1611694643.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
                                    "author": "WandererOfInterwebs",
                                    "id": "gkukdtv",
                                    "parent_id": "t1_gku0e64",
                                    "score": 2,
                                    "created_utc": 1611684412.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gkumuq9",
                                            "parent_id": "t1_gkukdtv",
                                            "score": 1,
                                            "created_utc": 1611685437.0,
                                            "replies": [
                                                {
                                                    "body": "It is to plenty of \"SDs\" here. They say as much.",
                                                    "author": "ThrwHey2",
                                                    "id": "gkvatbi",
                                                    "parent_id": "t1_gkumuq9",
                                                    "score": 0,
                                                    "created_utc": 1611695112.0,
                                                    "replies": [
                                                        {
                                                            "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                                            "author": "joc13",
                                                            "id": "gkvoo8t",
                                                            "parent_id": "t1_gkvatbi",
                                                            "score": 1,
                                                            "created_utc": 1611701020.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                                            "author": "fallingsd",
                                            "id": "gkv877f",
                                            "parent_id": "t1_gkukdtv",
                                            "score": 1,
                                            "created_utc": 1611694065.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "u keep saying \"sex for money\" instead of ppm arrangement. it's cool you want a monthly thing. good for you. plenty of women want ppm and not commit to seeing someone and exact amount of times a month. \ngood ppm arrangements are made when you guys plan together and see eachother when you both want to. sometimes they ask me and sometimes I ask them. \n\nmake sure u have a real connection or don't have sex period and don't have the arrangement period. escorts get paid for companionship and no sex too sometimes.  the real difference is the escort is acting vs a sugar relationship the interactions should be genuine. i want you to be you. I don't want you to say shit you think I want to hear.",
                            "author": "fallingsd",
                            "id": "gkv7n2o",
                            "parent_id": "t1_gktylmi",
                            "score": 1,
                            "created_utc": 1611693854.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What you describe “if I want to or that’s what we agreed to” is exactly what happened in the OP’s circumstances so I’m not sure what you are even objecting to here. If you don’t know what “generous” means, you may be on the wrong subreddit entirely :)",
            "author": "WandererOfInterwebs",
            "id": "gktz1ow",
            "parent_id": "t1_gktq80z",
            "score": 6,
            "created_utc": 1611675232.0,
            "replies": [
                {
                    "body": "I'm objecting to the comment I replied to on why she feels like the no intimacy part is \"how it should be\".\nshe's obviously hung up on the idea of sex and can't seem to wrap the idea that some girls are perfectly fine having sex right away after meeting you.\nyes there are a ton of scammers and some that really just want a cheap escort, but we good sds and sbs both go through having to deal with it.",
                    "author": "fallingsd",
                    "id": "gkugqhp",
                    "parent_id": "t1_gktz1ow",
                    "score": 0,
                    "created_utc": 1611682964.0,
                    "replies": [
                        {
                            "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
                            "author": "WandererOfInterwebs",
                            "id": "gkuqeyl",
                            "parent_id": "t1_gkugqhp",
                            "score": 5,
                            "created_utc": 1611686880.0,
                            "replies": [
                                {
                                    "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                                    "author": "fallingsd",
                                    "id": "gkur7mc",
                                    "parent_id": "t1_gkuqeyl",
                                    "score": 2,
                                    "created_utc": 1611687206.0,
                                    "replies": [
                                        {
                                            "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                                            "author": "WandererOfInterwebs",
                                            "id": "gkv5f7j",
                                            "parent_id": "t1_gkur7mc",
                                            "score": 2,
                                            "created_utc": 1611692995.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Money is never required. I’m not sure how you are approaching your arrangements but my allowance has never been “for sex.” I get my allowance if I’m on my period or just not feeling up to intimacy because it’s not a trade.",
            "author": "WandererOfInterwebs",
            "id": "gktylpv",
            "parent_id": "t1_gktx07f",
            "score": 6,
            "created_utc": 1611675031.0,
            "replies": [
                {
                    "body": "you schedule your dates right. if we only get to hang out once a month or so, is it to much to expect eachother to schedule it at a time when we are both in the mood for sex? you know guys want sex in vanilla relationships when they see you once a week too right? \n\nalmost every chick I have met that is tied up in this sex and intimate part also thinks their \"time should be compensated\" lol. this shit goes both ways.\n \nI have PPM SBs and we spend anywhere between 3 hours to 3 nights together depending on the situation and what we schedule but the allowance expectations don't change and sex happens everytime (yeah even on their period, they are still in the mood, or she reschedule another time, no biggie on both ends).\n\nbut yeah it's fine if you want to find an SD who likes doing other things for your dates. just like it should be fine with an SD who does want to have sex during the limited times you guys can meet. if we start meeting so often, just mvoe it to monthly and don't worry about it. all this focus on the money and sex aspect instead of just finding someone on the same page.",
                    "author": "fallingsd",
                    "id": "gkv5bgn",
                    "parent_id": "t1_gktylpv",
                    "score": 0,
                    "created_utc": 1611692952.0,
                    "replies": [
                        {
                            "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
                            "author": "WandererOfInterwebs",
                            "id": "gkvj7nu",
                            "parent_id": "t1_gkv5bgn",
                            "score": 5,
                            "created_utc": 1611698565.0,
                            "replies": [
                                {
                                    "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                                    "author": "fallingsd",
                                    "id": "gkvjstr",
                                    "parent_id": "t1_gkvj7nu",
                                    "score": 2,
                                    "created_utc": 1611698816.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugaring has always been about the money... allowances...  an older man helping out a young beautiful woman just because he can, just because he wants to spend time with her... it’s time and companionship for money... sex can happen, of course... sex for money (ppm) is entirely something else ... and we all know what that it",
            "author": "PsychologicalMud9673",
            "id": "gktylmi",
            "parent_id": "t1_gktx07f",
            "score": 6,
            "created_utc": 1611675030.0,
            "replies": [
                {
                    "body": "\"All that with no intimacy and that’s how it’s supposed to be!!!\" No. What you're talking about is charity. That's not what Sugaring is about. There's an exchange. Two things, not one. Intimacy and generosity. Anything else is something else.",
                    "author": "UnEgo",
                    "id": "gku0e64",
                    "parent_id": "t1_gktylmi",
                    "score": -4,
                    "created_utc": 1611675819.0,
                    "replies": [
                        {
                            "body": "I’m guessing you guys are all under 55 😏",
                            "author": "PsychologicalMud9673",
                            "id": "gku0n5p",
                            "parent_id": "t1_gku0e64",
                            "score": 7,
                            "created_utc": 1611675933.0,
                            "replies": [
                                {
                                    "body": "Far too young for me 😂",
                                    "author": "WandererOfInterwebs",
                                    "id": "gkuk4ip",
                                    "parent_id": "t1_gku0n5p",
                                    "score": 4,
                                    "created_utc": 1611684305.0,
                                    "replies": [
                                        {
                                            "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                                            "author": "fallingsd",
                                            "id": "gkviwzb",
                                            "parent_id": "t1_gkuk4ip",
                                            "score": 1,
                                            "created_utc": 1611698439.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not reading this tbh",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "gkvjva0",
                                                    "parent_id": "t1_gkviwzb",
                                                    "score": 3,
                                                    "created_utc": 1611698846.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                                    "author": "fallingsd",
                                    "id": "gkv9nb0",
                                    "parent_id": "t1_gku0n5p",
                                    "score": 1,
                                    "created_utc": 1611694643.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
                            "author": "WandererOfInterwebs",
                            "id": "gkukdtv",
                            "parent_id": "t1_gku0e64",
                            "score": 2,
                            "created_utc": 1611684412.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gkumuq9",
                                    "parent_id": "t1_gkukdtv",
                                    "score": 1,
                                    "created_utc": 1611685437.0,
                                    "replies": [
                                        {
                                            "body": "It is to plenty of \"SDs\" here. They say as much.",
                                            "author": "ThrwHey2",
                                            "id": "gkvatbi",
                                            "parent_id": "t1_gkumuq9",
                                            "score": 0,
                                            "created_utc": 1611695112.0,
                                            "replies": [
                                                {
                                                    "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                                    "author": "joc13",
                                                    "id": "gkvoo8t",
                                                    "parent_id": "t1_gkvatbi",
                                                    "score": 1,
                                                    "created_utc": 1611701020.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                                    "author": "fallingsd",
                                    "id": "gkv877f",
                                    "parent_id": "t1_gkukdtv",
                                    "score": 1,
                                    "created_utc": 1611694065.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "u keep saying \"sex for money\" instead of ppm arrangement. it's cool you want a monthly thing. good for you. plenty of women want ppm and not commit to seeing someone and exact amount of times a month. \ngood ppm arrangements are made when you guys plan together and see eachother when you both want to. sometimes they ask me and sometimes I ask them. \n\nmake sure u have a real connection or don't have sex period and don't have the arrangement period. escorts get paid for companionship and no sex too sometimes.  the real difference is the escort is acting vs a sugar relationship the interactions should be genuine. i want you to be you. I don't want you to say shit you think I want to hear.",
                    "author": "fallingsd",
                    "id": "gkv7n2o",
                    "parent_id": "t1_gktylmi",
                    "score": 1,
                    "created_utc": 1611693854.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm objecting to the comment I replied to on why she feels like the no intimacy part is \"how it should be\".\nshe's obviously hung up on the idea of sex and can't seem to wrap the idea that some girls are perfectly fine having sex right away after meeting you.\nyes there are a ton of scammers and some that really just want a cheap escort, but we good sds and sbs both go through having to deal with it.",
            "author": "fallingsd",
            "id": "gkugqhp",
            "parent_id": "t1_gktz1ow",
            "score": 0,
            "created_utc": 1611682964.0,
            "replies": [
                {
                    "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
                    "author": "WandererOfInterwebs",
                    "id": "gkuqeyl",
                    "parent_id": "t1_gkugqhp",
                    "score": 5,
                    "created_utc": 1611686880.0,
                    "replies": [
                        {
                            "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                            "author": "fallingsd",
                            "id": "gkur7mc",
                            "parent_id": "t1_gkuqeyl",
                            "score": 2,
                            "created_utc": 1611687206.0,
                            "replies": [
                                {
                                    "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                                    "author": "WandererOfInterwebs",
                                    "id": "gkv5f7j",
                                    "parent_id": "t1_gkur7mc",
                                    "score": 2,
                                    "created_utc": 1611692995.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you schedule your dates right. if we only get to hang out once a month or so, is it to much to expect eachother to schedule it at a time when we are both in the mood for sex? you know guys want sex in vanilla relationships when they see you once a week too right? \n\nalmost every chick I have met that is tied up in this sex and intimate part also thinks their \"time should be compensated\" lol. this shit goes both ways.\n \nI have PPM SBs and we spend anywhere between 3 hours to 3 nights together depending on the situation and what we schedule but the allowance expectations don't change and sex happens everytime (yeah even on their period, they are still in the mood, or she reschedule another time, no biggie on both ends).\n\nbut yeah it's fine if you want to find an SD who likes doing other things for your dates. just like it should be fine with an SD who does want to have sex during the limited times you guys can meet. if we start meeting so often, just mvoe it to monthly and don't worry about it. all this focus on the money and sex aspect instead of just finding someone on the same page.",
            "author": "fallingsd",
            "id": "gkv5bgn",
            "parent_id": "t1_gktylpv",
            "score": 0,
            "created_utc": 1611692952.0,
            "replies": [
                {
                    "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
                    "author": "WandererOfInterwebs",
                    "id": "gkvj7nu",
                    "parent_id": "t1_gkv5bgn",
                    "score": 5,
                    "created_utc": 1611698565.0,
                    "replies": [
                        {
                            "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                            "author": "fallingsd",
                            "id": "gkvjstr",
                            "parent_id": "t1_gkvj7nu",
                            "score": 2,
                            "created_utc": 1611698816.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"All that with no intimacy and that’s how it’s supposed to be!!!\" No. What you're talking about is charity. That's not what Sugaring is about. There's an exchange. Two things, not one. Intimacy and generosity. Anything else is something else.",
            "author": "UnEgo",
            "id": "gku0e64",
            "parent_id": "t1_gktylmi",
            "score": -4,
            "created_utc": 1611675819.0,
            "replies": [
                {
                    "body": "I’m guessing you guys are all under 55 😏",
                    "author": "PsychologicalMud9673",
                    "id": "gku0n5p",
                    "parent_id": "t1_gku0e64",
                    "score": 7,
                    "created_utc": 1611675933.0,
                    "replies": [
                        {
                            "body": "Far too young for me 😂",
                            "author": "WandererOfInterwebs",
                            "id": "gkuk4ip",
                            "parent_id": "t1_gku0n5p",
                            "score": 4,
                            "created_utc": 1611684305.0,
                            "replies": [
                                {
                                    "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                                    "author": "fallingsd",
                                    "id": "gkviwzb",
                                    "parent_id": "t1_gkuk4ip",
                                    "score": 1,
                                    "created_utc": 1611698439.0,
                                    "replies": [
                                        {
                                            "body": "I’m not reading this tbh",
                                            "author": "WandererOfInterwebs",
                                            "id": "gkvjva0",
                                            "parent_id": "t1_gkviwzb",
                                            "score": 3,
                                            "created_utc": 1611698846.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                            "author": "fallingsd",
                            "id": "gkv9nb0",
                            "parent_id": "t1_gku0n5p",
                            "score": 1,
                            "created_utc": 1611694643.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
                    "author": "WandererOfInterwebs",
                    "id": "gkukdtv",
                    "parent_id": "t1_gku0e64",
                    "score": 2,
                    "created_utc": 1611684412.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gkumuq9",
                            "parent_id": "t1_gkukdtv",
                            "score": 1,
                            "created_utc": 1611685437.0,
                            "replies": [
                                {
                                    "body": "It is to plenty of \"SDs\" here. They say as much.",
                                    "author": "ThrwHey2",
                                    "id": "gkvatbi",
                                    "parent_id": "t1_gkumuq9",
                                    "score": 0,
                                    "created_utc": 1611695112.0,
                                    "replies": [
                                        {
                                            "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                            "author": "joc13",
                                            "id": "gkvoo8t",
                                            "parent_id": "t1_gkvatbi",
                                            "score": 1,
                                            "created_utc": 1611701020.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                            "author": "fallingsd",
                            "id": "gkv877f",
                            "parent_id": "t1_gkukdtv",
                            "score": 1,
                            "created_utc": 1611694065.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "u keep saying \"sex for money\" instead of ppm arrangement. it's cool you want a monthly thing. good for you. plenty of women want ppm and not commit to seeing someone and exact amount of times a month. \ngood ppm arrangements are made when you guys plan together and see eachother when you both want to. sometimes they ask me and sometimes I ask them. \n\nmake sure u have a real connection or don't have sex period and don't have the arrangement period. escorts get paid for companionship and no sex too sometimes.  the real difference is the escort is acting vs a sugar relationship the interactions should be genuine. i want you to be you. I don't want you to say shit you think I want to hear.",
            "author": "fallingsd",
            "id": "gkv7n2o",
            "parent_id": "t1_gktylmi",
            "score": 1,
            "created_utc": 1611693854.0,
            "replies": []
        },
        {
            "body": "I mean...you sound like the one hung up on sex, frankly. Nothing on the OP or the reply is about men or women wanting to have sex on the first or second date. OP went on a great date, wasn’t pressured into sex and he stayed a perfect gentleman. And others are thrilled for her. How you could read such negativity into that exchange is beyond me.",
            "author": "WandererOfInterwebs",
            "id": "gkuqeyl",
            "parent_id": "t1_gkugqhp",
            "score": 5,
            "created_utc": 1611686880.0,
            "replies": [
                {
                    "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
                    "author": "fallingsd",
                    "id": "gkur7mc",
                    "parent_id": "t1_gkuqeyl",
                    "score": 2,
                    "created_utc": 1611687206.0,
                    "replies": [
                        {
                            "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                            "author": "WandererOfInterwebs",
                            "id": "gkv5f7j",
                            "parent_id": "t1_gkur7mc",
                            "score": 2,
                            "created_utc": 1611692995.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "....this is a lot of unsolicited advice for a problem I didn’t and don’t have.\n\nMy dates were scheduled “right” because sex was not required.",
            "author": "WandererOfInterwebs",
            "id": "gkvj7nu",
            "parent_id": "t1_gkv5bgn",
            "score": 5,
            "created_utc": 1611698565.0,
            "replies": [
                {
                    "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
                    "author": "fallingsd",
                    "id": "gkvjstr",
                    "parent_id": "t1_gkvj7nu",
                    "score": 2,
                    "created_utc": 1611698816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m guessing you guys are all under 55 😏",
            "author": "PsychologicalMud9673",
            "id": "gku0n5p",
            "parent_id": "t1_gku0e64",
            "score": 7,
            "created_utc": 1611675933.0,
            "replies": [
                {
                    "body": "Far too young for me 😂",
                    "author": "WandererOfInterwebs",
                    "id": "gkuk4ip",
                    "parent_id": "t1_gku0n5p",
                    "score": 4,
                    "created_utc": 1611684305.0,
                    "replies": [
                        {
                            "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                            "author": "fallingsd",
                            "id": "gkviwzb",
                            "parent_id": "t1_gkuk4ip",
                            "score": 1,
                            "created_utc": 1611698439.0,
                            "replies": [
                                {
                                    "body": "I’m not reading this tbh",
                                    "author": "WandererOfInterwebs",
                                    "id": "gkvjva0",
                                    "parent_id": "t1_gkviwzb",
                                    "score": 3,
                                    "created_utc": 1611698846.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
                    "author": "fallingsd",
                    "id": "gkv9nb0",
                    "parent_id": "t1_gku0n5p",
                    "score": 1,
                    "created_utc": 1611694643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Intimacy” is not limited to sex. If you mean just sex, then stop with the childish euphemisms and say you think sugaring is an exchange of sex for “money.”",
            "author": "WandererOfInterwebs",
            "id": "gkukdtv",
            "parent_id": "t1_gku0e64",
            "score": 2,
            "created_utc": 1611684412.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gkumuq9",
                    "parent_id": "t1_gkukdtv",
                    "score": 1,
                    "created_utc": 1611685437.0,
                    "replies": [
                        {
                            "body": "It is to plenty of \"SDs\" here. They say as much.",
                            "author": "ThrwHey2",
                            "id": "gkvatbi",
                            "parent_id": "t1_gkumuq9",
                            "score": 0,
                            "created_utc": 1611695112.0,
                            "replies": [
                                {
                                    "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                                    "author": "joc13",
                                    "id": "gkvoo8t",
                                    "parent_id": "t1_gkvatbi",
                                    "score": 1,
                                    "created_utc": 1611701020.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
                    "author": "fallingsd",
                    "id": "gkv877f",
                    "parent_id": "t1_gkukdtv",
                    "score": 1,
                    "created_utc": 1611694065.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm cool with the op. that is awesome. I was responding to psychologicalmind comments about \"how it should be\" in regards to intimacy.\nand honestly, it's that exact attitude that is why so many good Sds are unwilling to give an allowance before intimacy. too many scammers and rinsers on the female side of it, it's hard to know who's genuine sometimes without being sure they were okay with intimacy.\nyou can literally remove the word intimacy from the ops post and we would all still congratulate her.",
            "author": "fallingsd",
            "id": "gkur7mc",
            "parent_id": "t1_gkuqeyl",
            "score": 2,
            "created_utc": 1611687206.0,
            "replies": [
                {
                    "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
                    "author": "WandererOfInterwebs",
                    "id": "gkv5f7j",
                    "parent_id": "t1_gkur7mc",
                    "score": 2,
                    "created_utc": 1611692995.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "all this unsolicited advice for a problem I don't have either. also a lot of judgment over having sex as a part of the arrangement everytime. I'm not allowed to communicate my needs and wants and find someone who feels the same? I don't have to pressure anyone because I just don't see girls who don't enjoy the sex part.",
            "author": "fallingsd",
            "id": "gkvjstr",
            "parent_id": "t1_gkvj7nu",
            "score": 2,
            "created_utc": 1611698816.0,
            "replies": []
        },
        {
            "body": "Far too young for me 😂",
            "author": "WandererOfInterwebs",
            "id": "gkuk4ip",
            "parent_id": "t1_gku0n5p",
            "score": 4,
            "created_utc": 1611684305.0,
            "replies": [
                {
                    "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
                    "author": "fallingsd",
                    "id": "gkviwzb",
                    "parent_id": "t1_gkuk4ip",
                    "score": 1,
                    "created_utc": 1611698439.0,
                    "replies": [
                        {
                            "body": "I’m not reading this tbh",
                            "author": "WandererOfInterwebs",
                            "id": "gkvjva0",
                            "parent_id": "t1_gkviwzb",
                            "score": 3,
                            "created_utc": 1611698846.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah. and I have actual friends to spend time with and have companionship from. I have my kids. I have my mom, my sister, my cousins. I'm looking for a gf pretty much, but without the headaches of a regular relationship outside of it. I want to be able to get together and genuinely enjoy each other and then go back to our own lives. and yeah dude, we are freaking adults, of course I want sex. I find sbs who like having sex too!! girls be sleeping with a dude they meet at a party with no hang ups but because there was some kind of cash exchange, one is better than the other all of a sudden? get over it dude. guys want sex. girls want sex to. and sometimes a little bit of extra cash, a vacation, a nice bag they wouldn't be able to afford.",
            "author": "fallingsd",
            "id": "gkv9nb0",
            "parent_id": "t1_gku0n5p",
            "score": 1,
            "created_utc": 1611694643.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gkumuq9",
            "parent_id": "t1_gkukdtv",
            "score": 1,
            "created_utc": 1611685437.0,
            "replies": [
                {
                    "body": "It is to plenty of \"SDs\" here. They say as much.",
                    "author": "ThrwHey2",
                    "id": "gkvatbi",
                    "parent_id": "t1_gkumuq9",
                    "score": 0,
                    "created_utc": 1611695112.0,
                    "replies": [
                        {
                            "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                            "author": "joc13",
                            "id": "gkvoo8t",
                            "parent_id": "t1_gkvatbi",
                            "score": 1,
                            "created_utc": 1611701020.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "sugaring is about having a relationship with some kind of financial agreement. how about that?",
            "author": "fallingsd",
            "id": "gkv877f",
            "parent_id": "t1_gkukdtv",
            "score": 1,
            "created_utc": 1611694065.0,
            "replies": []
        },
        {
            "body": "I just didn’t read that attitude or intent in the comment like you did. I read it as “great you didn’t feel pressured into sex got the first two dates and everything still went really well.” The “as it should be” is mutual respect despite no sex imo.",
            "author": "WandererOfInterwebs",
            "id": "gkv5f7j",
            "parent_id": "t1_gkur7mc",
            "score": 2,
            "created_utc": 1611692995.0,
            "replies": []
        },
        {
            "body": "cool, but you guys feel the need to dictate what intimacy is for two different individuals?\nwhat's the purpose of trying to say when is the right time to have sex and the right time to give an allowance.\nwe all know sex is part of a sugar arrangement and Financials are, but you want to jump through all these hoops just so you can distinguish it from prostitution in your eyes. why? to make yourself feel superior? let people define the terms of their own relationship. the only difference i can see between the different type of vanilla relationships and sugar is the financial agreement. you act like there aren't plenty of vanilla relationships where sex is the main basis of.",
            "author": "fallingsd",
            "id": "gkviwzb",
            "parent_id": "t1_gkuk4ip",
            "score": 1,
            "created_utc": 1611698439.0,
            "replies": [
                {
                    "body": "I’m not reading this tbh",
                    "author": "WandererOfInterwebs",
                    "id": "gkvjva0",
                    "parent_id": "t1_gkviwzb",
                    "score": 3,
                    "created_utc": 1611698846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is to plenty of \"SDs\" here. They say as much.",
            "author": "ThrwHey2",
            "id": "gkvatbi",
            "parent_id": "t1_gkumuq9",
            "score": 0,
            "created_utc": 1611695112.0,
            "replies": [
                {
                    "body": "so do the SBs who say they're not going to have sex unless they are getting money",
                    "author": "joc13",
                    "id": "gkvoo8t",
                    "parent_id": "t1_gkvatbi",
                    "score": 1,
                    "created_utc": 1611701020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not reading this tbh",
            "author": "WandererOfInterwebs",
            "id": "gkvjva0",
            "parent_id": "t1_gkviwzb",
            "score": 3,
            "created_utc": 1611698846.0,
            "replies": []
        },
        {
            "body": "so do the SBs who say they're not going to have sex unless they are getting money",
            "author": "joc13",
            "id": "gkvoo8t",
            "parent_id": "t1_gkvatbi",
            "score": 1,
            "created_utc": 1611701020.0,
            "replies": []
        }
    ]
}