{
    "title": "Quality meme",
    "post_id": "kdar9e",
    "post_url": "https://www.reddit.com/r/dankruto/comments/kdar9e/quality_meme/",
    "author": "Adrianb4902",
    "body": "",
    "url": "https://i.redd.it/h48h0iwly8561.jpg",
    "score": 9735,
    "upvote_ratio": 0.99,
    "created_utc": 1607992786.0,
    "num_comments": 52,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sasuke: having the fight of his life, pushing himself to limits he never knew possible dodging fireballs and kunai, using all of his skills that he's taken years to hone, and utilizing jutsu he's never had to use before\n\nItachi: sitting in his throne checking snapchat",
            "author": "Poknberry",
            "id": "gfw45ds",
            "parent_id": "t3_kdar9e",
            "score": 614,
            "created_utc": 1608007676.0,
            "replies": [
                {
                    "body": "*sasuke looking over at itachi after realizing he was fighting an illusion* tch damnit\n\n*Itachi looking up from his phone* oh hey sorry um blah blah blah still to weak, ok you ready for real this time?",
                    "author": "thelaughingmansghost",
                    "id": "gfw5vie",
                    "parent_id": "t1_gfw45ds",
                    "score": 242,
                    "created_utc": 1608008725.0,
                    "replies": [
                        {
                            "body": "Nobody: \n\nItachi: Yall hear something?",
                            "author": "Adrianb4902",
                            "id": "gfw7h0v",
                            "parent_id": "t1_gfw5vie",
                            "score": 120,
                            "created_utc": 1608009801.0,
                            "replies": [
                                {
                                    "body": "r/UselessNobody",
                                    "author": "Negrizzy153",
                                    "id": "gfws4qe",
                                    "parent_id": "t1_gfw7h0v",
                                    "score": 31,
                                    "created_utc": 1608028867.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If i remember correctly, wasn't sasuke also behind him the whole time?",
                    "author": null,
                    "id": "gfwbttq",
                    "parent_id": "t1_gfw45ds",
                    "score": 46,
                    "created_utc": 1608013047.0,
                    "replies": [
                        {
                            "body": "But then Itachi was behind-behind. High level lmao what Itachi can do in terms of genjutsu. It's just ridiculous how he can control that and use that to trick literally anyone.",
                            "author": "Markemberke",
                            "id": "gfwcxww",
                            "parent_id": "t1_gfwbttq",
                            "score": 109,
                            "created_utc": 1608013945.0,
                            "replies": [
                                {
                                    "body": "Other ninjas: I have trained hard all my life to become powerful \n\nItachi: mf don’t even look at me or its over. I decide what’s real.",
                                    "author": "DvrkHors3",
                                    "id": "gfwglra",
                                    "parent_id": "t1_gfwcxww",
                                    "score": 113,
                                    "created_utc": 1608017125.0,
                                    "replies": [
                                        {
                                            "body": "straight up",
                                            "author": "HG21Reaper",
                                            "id": "gfx6mg9",
                                            "parent_id": "t1_gfwglra",
                                            "score": 12,
                                            "created_utc": 1608041040.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It's like that meme where people have guns pointed behind ppls back then there's the dude with the sniper. But the sniper was itachi all along. Whoa..",
                                    "author": null,
                                    "id": "gfwkqn4",
                                    "parent_id": "t1_gfwcxww",
                                    "score": 35,
                                    "created_utc": 1608021019.0,
                                    "replies": []
                                },
                                {
                                    "body": "That’s why they say uchiha a can never be defeated solo. You always have to have 2 or more people cause genjutsu lock.",
                                    "author": null,
                                    "id": "gfx9idx",
                                    "parent_id": "t1_gfwcxww",
                                    "score": 6,
                                    "created_utc": 1608042770.0,
                                    "replies": [
                                        {
                                            "body": "Who says that? Only Itachi is so ridiculously OP with genjutsu. Regular Uchihas can be countered by other genjutsu practicioners. For example everyone laughs at Kurenai, just because she lose against Itachi. But Obito couldn't genjutsu Itachi's teammate, who was a genjutsu user, but actually regular human, so not Uchiha. The guy could resist Obito's genjutsu. And I don't think that guy is better at genjutsu than Kurenai. Kurenai is very skilled at genjutsu, she just faced the literally worst opponent ever, Itachi. But it doesn't makes her bad. Kurenai could easily fight every other Uchihas in terms of genjutsu.",
                                            "author": "Markemberke",
                                            "id": "gfxewkg",
                                            "parent_id": "t1_gfx9idx",
                                            "score": 9,
                                            "created_utc": 1608045695.0,
                                            "replies": [
                                                {
                                                    "body": "It’s one of those old databool entries from the start that’s technically canon but was so early on that it doesn’t sound right, but I believe it. You need someone or yourself to wake you out of genjutsu, for a fact. That takes time, for a fact. During that time the uchiha just kills you. I can believe that. Itachi stomped orochimaru solo with just a look, obito stomped Kurama solo with just a look, if you aren’t a perfect jin or hashirama who is immune to anything that makes him weaker than anyone else, than you’re kinda screwed against even basic genjutsu. Against uchiha genjutsu you’re gonna die unless you get help. That’s why obito never genjutsu’d minato because it would have been a instant stomp. Genjutsu fell off as the series went on because it’s unbeatable if you’re alone or not a jinjuriki. All madara had to do was genjutsu guy and non of that could have happened because he would have interrupted them until someone could physically get to guy, wake him up, and get him fighting all over again. Jiraiya last ditch survival move was genjutsu because he knew if pain got caught by himself, it’s an instant win for him. Genjutsu is boosted. Genjutsu is a instant win in a one on one fight and you trap the other person. Orochimaru trapped hiruzen in a basic genjutsu and it took the most experienced hokage all his effort to barley make it out. A normal shinobi solo is not defeating a uchiha or a uchiha genjutsu.",
                                                    "author": null,
                                                    "id": "gfxfbky",
                                                    "parent_id": "t1_gfxewkg",
                                                    "score": 2,
                                                    "created_utc": 1608045914.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
                                                            "author": "Markemberke",
                                                            "id": "gfxg484",
                                                            "parent_id": "t1_gfxfbky",
                                                            "score": 3,
                                                            "created_utc": 1608046324.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                                                                    "author": null,
                                                                    "id": "gfxgtrm",
                                                                    "parent_id": "t1_gfxg484",
                                                                    "score": 2,
                                                                    "created_utc": 1608046687.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                                                                            "author": "Markemberke",
                                                                            "id": "gfxhrau",
                                                                            "parent_id": "t1_gfxgtrm",
                                                                            "score": 6,
                                                                            "created_utc": 1608047158.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                                                                    "author": null,
                                                                                    "id": "gfxiaf5",
                                                                                    "parent_id": "t1_gfxhrau",
                                                                                    "score": 2,
                                                                                    "created_utc": 1608047429.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Just rewatched the episode and they were both having a genjutsu fight the whole time.",
                                    "author": null,
                                    "id": "gfwna09",
                                    "parent_id": "t1_gfwcxww",
                                    "score": 8,
                                    "created_utc": 1608023635.0,
                                    "replies": [
                                        {
                                            "body": "Nah, not the whole time, bro. Itachi had to drain himself out because he noticed Sasuke has no chance against him. And also wanted to test him, how powerful he became. Yes, there were a tonns of genjutsu, but there were ninjutsu and thaijutsu too.",
                                            "author": "Markemberke",
                                            "id": "gfwx28f",
                                            "parent_id": "t1_gfwna09",
                                            "score": 8,
                                            "created_utc": 1608033822.0,
                                            "replies": [
                                                {
                                                    "body": "I think the opposite. Itachi was toying with him not taking him seriously, until sasuke did that shuriken string thing and embedded a giant blade in itachis thigh. After that moment you saw the look in itachis face and he knew he couldn’t toy around in reality with sasuke. Too smart. He started trying after that point, but he was never serious he could kill sasuke any second and he proved that by letting sasuke throw everything he had at him until he had 0 chakra, and only then did Itachi fight back and he still had susanoo. Sasuke would have been a skid mark if it was a real fight",
                                                    "author": null,
                                                    "id": "gfx9t75",
                                                    "parent_id": "t1_gfwx28f",
                                                    "score": 10,
                                                    "created_utc": 1608042939.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Zetsu was watching the fight and literally said : what are they doing? they haven't moved ever since they came face to face.",
                                                    "author": null,
                                                    "id": "gfxld5z",
                                                    "parent_id": "t1_gfwx28f",
                                                    "score": 7,
                                                    "created_utc": 1608048961.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
                                                            "author": "Markemberke",
                                                            "id": "gfxlq9i",
                                                            "parent_id": "t1_gfxld5z",
                                                            "score": 4,
                                                            "created_utc": 1608049138.0,
                                                            "replies": [
                                                                {
                                                                    "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                                                                    "author": null,
                                                                    "id": "gfxrsgu",
                                                                    "parent_id": "t1_gfxlq9i",
                                                                    "score": 5,
                                                                    "created_utc": 1608052043.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine Itachi tapped Sasuke’s head one last time, told him to look to his left, and Itachi’s sitting in that damn chair again.",
            "author": "CoraxtheRavenLord",
            "id": "gfw5q2j",
            "parent_id": "t3_kdar9e",
            "score": 236,
            "created_utc": 1608008625.0,
            "replies": [
                {
                    "body": "I’d willingly rip out both my eyeballs and hand them to him",
                    "author": "SaintAhmad",
                    "id": "gfw7o7t",
                    "parent_id": "t1_gfw5q2j",
                    "score": 139,
                    "created_utc": 1608009939.0,
                    "replies": [
                        {
                            "body": "Fr. I'd be super confused whether im doing this because I'm *heavily* impressed at his performance or just because I want to get tf out of here from this madman to the blond simp but the sentiment's same.",
                            "author": "Not_noice",
                            "id": "gfwdtsb",
                            "parent_id": "t1_gfw7o7t",
                            "score": 41,
                            "created_utc": 1608014685.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There was a thread about a year ago asking what people would change in Naruto if they could and some commented the same thing. Great minds must think alike.",
                    "author": "blalokjpg",
                    "id": "gfx7aaw",
                    "parent_id": "t1_gfw5q2j",
                    "score": 12,
                    "created_utc": 1608041457.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fighting Itachi in a nutshell.",
            "author": "Markemberke",
            "id": "gfvr1j9",
            "parent_id": "t3_kdar9e",
            "score": 96,
            "created_utc": 1608000481.0,
            "replies": [
                {
                    "body": "Add some crows to the picture and yeah",
                    "author": "3727rhfh",
                    "id": "gfwbgfb",
                    "parent_id": "t1_gfvr1j9",
                    "score": 35,
                    "created_utc": 1608012752.0,
                    "replies": [
                        {
                            "body": "Happy cake day!",
                            "author": "xgovindx",
                            "id": "gfwrufe",
                            "parent_id": "t1_gfwbgfb",
                            "score": 1,
                            "created_utc": 1608028558.0,
                            "replies": [
                                {
                                    "body": "Thank you",
                                    "author": "3727rhfh",
                                    "id": "gfwt3zx",
                                    "parent_id": "t1_gfwrufe",
                                    "score": 1,
                                    "created_utc": 1608029899.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Itachi should have just given Sasuke the illusion of killing him and then just disappeared.",
            "author": "TyrionGoldenLion",
            "id": "gfw917k",
            "parent_id": "t3_kdar9e",
            "score": 60,
            "created_utc": 1608010914.0,
            "replies": [
                {
                    "body": "His illness was killing him anyway, and he thought dying at his hands was his way of redemption",
                    "author": "Yogami_asura",
                    "id": "gfwulny",
                    "parent_id": "t1_gfw917k",
                    "score": 30,
                    "created_utc": 1608031423.0,
                    "replies": [
                        {
                            "body": "Yeah honestly it’s a question if Itachi even liked himself after what he did. He treated himself kinda poorly. Always had that aura like he wanted to die",
                            "author": null,
                            "id": "gfxaiaq",
                            "parent_id": "t1_gfwulny",
                            "score": 17,
                            "created_utc": 1608043327.0,
                            "replies": []
                        },
                        {
                            "body": "We don't know much about the nature of Itachi's illness, just that he had stopped taking his meds.\n\nHe should have faked his death, stayed alive and watched out for Sasuke from afar.",
                            "author": "TyrionGoldenLion",
                            "id": "gfwvqhl",
                            "parent_id": "t1_gfwulny",
                            "score": 15,
                            "created_utc": 1608032545.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude is drinking tea, while his PTSD-infested semi-psychotic brother, his last living family is literally trying to kill him",
            "author": "Perseus-TheGreekHero",
            "id": "gfw50qe",
            "parent_id": "t3_kdar9e",
            "score": 111,
            "created_utc": 1608008190.0,
            "replies": [
                {
                    "body": "“BRUH IM SIPPIN TEA IN YO HOOD, WHAT THE FUCK IS UP, YOU BUTTERCUP?!”  -XXXTENTACION",
                    "author": null,
                    "id": "gfxaddt",
                    "parent_id": "t1_gfw50qe",
                    "score": 10,
                    "created_utc": 1608043251.0,
                    "replies": []
                },
                {
                    "body": "🤣🤣🤣🤣😓",
                    "author": "blee216e",
                    "id": "gfw9333",
                    "parent_id": "t1_gfw50qe",
                    "score": 4,
                    "created_utc": 1608010953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Top notch Quality indeed.",
            "author": null,
            "id": "gfw129b",
            "parent_id": "t3_kdar9e",
            "score": 9,
            "created_utc": 1608005940.0,
            "replies": []
        },
        {
            "body": "Yeah Yeah *Quality*",
            "author": "loneabhi",
            "id": "gfw64ir",
            "parent_id": "t3_kdar9e",
            "score": 8,
            "created_utc": 1608008889.0,
            "replies": []
        },
        {
            "body": "This is so fucking fire dude. I gotta share this to my fb group",
            "author": "blee216e",
            "id": "gfw8xrm",
            "parent_id": "t3_kdar9e",
            "score": 6,
            "created_utc": 1608010844.0,
            "replies": [
                {
                    "body": "Facebook",
                    "author": "SolerFlereTEE",
                    "id": "gfz7o38",
                    "parent_id": "t1_gfw8xrm",
                    "score": 2,
                    "created_utc": 1608076586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Best use of the template lol",
            "author": "03nevam",
            "id": "gfweaxx",
            "parent_id": "t3_kdar9e",
            "score": 2,
            "created_utc": 1608015086.0,
            "replies": []
        },
        {
            "body": "This from Naruto Jutsuposting right? Lol",
            "author": "dongerthegreat",
            "id": "gfwcf5z",
            "parent_id": "t3_kdar9e",
            "score": 3,
            "created_utc": 1608013524.0,
            "replies": [
                {
                    "body": "At this point idk who gets what from who.",
                    "author": "blalokjpg",
                    "id": "gfx7c78",
                    "parent_id": "t1_gfwcf5z",
                    "score": 1,
                    "created_utc": 1608041489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One of my friends shared this the other day and I nearly shat my pants",
            "author": "dietbongwater",
            "id": "gfxmx56",
            "parent_id": "t3_kdar9e",
            "score": 3,
            "created_utc": 1608049720.0,
            "replies": [
                {
                    "body": "*One of my friends shared*\n\n*This the other day and I*\n\n*Nearly shat my pants*\n\n\\- dietbongwater\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "author": "haikusbot",
                    "id": "gfxmy4d",
                    "parent_id": "t1_gfxmx56",
                    "score": 2,
                    "created_utc": 1608049733.0,
                    "replies": [
                        {
                            "body": "good bot",
                            "author": "dietbongwater",
                            "id": "gfxmzxd",
                            "parent_id": "t1_gfxmy4d",
                            "score": 1,
                            "created_utc": 1608049757.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "O r i g i n a l",
            "author": "BonglordShepdawg",
            "id": "gfwsk2y",
            "parent_id": "t3_kdar9e",
            "score": 1,
            "created_utc": 1608029319.0,
            "replies": []
        },
        {
            "body": "Sasuke definitely didn't skip leg day",
            "author": "unholymanserpent",
            "id": "gfxk8r5",
            "parent_id": "t3_kdar9e",
            "score": 1,
            "created_utc": 1608048405.0,
            "replies": []
        },
        {
            "body": "True art.",
            "author": "-_Lazarus-_",
            "id": "gfy50gd",
            "parent_id": "t3_kdar9e",
            "score": 1,
            "created_utc": 1608058140.0,
            "replies": []
        },
        {
            "body": "I don't either of them actually moved throughout the whole Genjutsu fight. Itachi put oneon Sasuke, Sasuke brok out and put one on Itachi, Itachi broke out and put one on Sasuke, Sasuke broke out and said \"Fuck it, Chidori.\"",
            "author": "JesseGolo",
            "id": "gg0afuq",
            "parent_id": "t3_kdar9e",
            "score": 1,
            "created_utc": 1608100261.0,
            "replies": []
        },
        {
            "body": "itachi is best",
            "author": "AsashinTsyuoi",
            "id": "gg3okev",
            "parent_id": "t3_kdar9e",
            "score": 1,
            "created_utc": 1608173681.0,
            "replies": []
        },
        {
            "body": "*sasuke looking over at itachi after realizing he was fighting an illusion* tch damnit\n\n*Itachi looking up from his phone* oh hey sorry um blah blah blah still to weak, ok you ready for real this time?",
            "author": "thelaughingmansghost",
            "id": "gfw5vie",
            "parent_id": "t1_gfw45ds",
            "score": 242,
            "created_utc": 1608008725.0,
            "replies": [
                {
                    "body": "Nobody: \n\nItachi: Yall hear something?",
                    "author": "Adrianb4902",
                    "id": "gfw7h0v",
                    "parent_id": "t1_gfw5vie",
                    "score": 120,
                    "created_utc": 1608009801.0,
                    "replies": [
                        {
                            "body": "r/UselessNobody",
                            "author": "Negrizzy153",
                            "id": "gfws4qe",
                            "parent_id": "t1_gfw7h0v",
                            "score": 31,
                            "created_utc": 1608028867.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If i remember correctly, wasn't sasuke also behind him the whole time?",
            "author": null,
            "id": "gfwbttq",
            "parent_id": "t1_gfw45ds",
            "score": 46,
            "created_utc": 1608013047.0,
            "replies": [
                {
                    "body": "But then Itachi was behind-behind. High level lmao what Itachi can do in terms of genjutsu. It's just ridiculous how he can control that and use that to trick literally anyone.",
                    "author": "Markemberke",
                    "id": "gfwcxww",
                    "parent_id": "t1_gfwbttq",
                    "score": 109,
                    "created_utc": 1608013945.0,
                    "replies": [
                        {
                            "body": "Other ninjas: I have trained hard all my life to become powerful \n\nItachi: mf don’t even look at me or its over. I decide what’s real.",
                            "author": "DvrkHors3",
                            "id": "gfwglra",
                            "parent_id": "t1_gfwcxww",
                            "score": 113,
                            "created_utc": 1608017125.0,
                            "replies": [
                                {
                                    "body": "straight up",
                                    "author": "HG21Reaper",
                                    "id": "gfx6mg9",
                                    "parent_id": "t1_gfwglra",
                                    "score": 12,
                                    "created_utc": 1608041040.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's like that meme where people have guns pointed behind ppls back then there's the dude with the sniper. But the sniper was itachi all along. Whoa..",
                            "author": null,
                            "id": "gfwkqn4",
                            "parent_id": "t1_gfwcxww",
                            "score": 35,
                            "created_utc": 1608021019.0,
                            "replies": []
                        },
                        {
                            "body": "That’s why they say uchiha a can never be defeated solo. You always have to have 2 or more people cause genjutsu lock.",
                            "author": null,
                            "id": "gfx9idx",
                            "parent_id": "t1_gfwcxww",
                            "score": 6,
                            "created_utc": 1608042770.0,
                            "replies": [
                                {
                                    "body": "Who says that? Only Itachi is so ridiculously OP with genjutsu. Regular Uchihas can be countered by other genjutsu practicioners. For example everyone laughs at Kurenai, just because she lose against Itachi. But Obito couldn't genjutsu Itachi's teammate, who was a genjutsu user, but actually regular human, so not Uchiha. The guy could resist Obito's genjutsu. And I don't think that guy is better at genjutsu than Kurenai. Kurenai is very skilled at genjutsu, she just faced the literally worst opponent ever, Itachi. But it doesn't makes her bad. Kurenai could easily fight every other Uchihas in terms of genjutsu.",
                                    "author": "Markemberke",
                                    "id": "gfxewkg",
                                    "parent_id": "t1_gfx9idx",
                                    "score": 9,
                                    "created_utc": 1608045695.0,
                                    "replies": [
                                        {
                                            "body": "It’s one of those old databool entries from the start that’s technically canon but was so early on that it doesn’t sound right, but I believe it. You need someone or yourself to wake you out of genjutsu, for a fact. That takes time, for a fact. During that time the uchiha just kills you. I can believe that. Itachi stomped orochimaru solo with just a look, obito stomped Kurama solo with just a look, if you aren’t a perfect jin or hashirama who is immune to anything that makes him weaker than anyone else, than you’re kinda screwed against even basic genjutsu. Against uchiha genjutsu you’re gonna die unless you get help. That’s why obito never genjutsu’d minato because it would have been a instant stomp. Genjutsu fell off as the series went on because it’s unbeatable if you’re alone or not a jinjuriki. All madara had to do was genjutsu guy and non of that could have happened because he would have interrupted them until someone could physically get to guy, wake him up, and get him fighting all over again. Jiraiya last ditch survival move was genjutsu because he knew if pain got caught by himself, it’s an instant win for him. Genjutsu is boosted. Genjutsu is a instant win in a one on one fight and you trap the other person. Orochimaru trapped hiruzen in a basic genjutsu and it took the most experienced hokage all his effort to barley make it out. A normal shinobi solo is not defeating a uchiha or a uchiha genjutsu.",
                                            "author": null,
                                            "id": "gfxfbky",
                                            "parent_id": "t1_gfxewkg",
                                            "score": 2,
                                            "created_utc": 1608045914.0,
                                            "replies": [
                                                {
                                                    "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
                                                    "author": "Markemberke",
                                                    "id": "gfxg484",
                                                    "parent_id": "t1_gfxfbky",
                                                    "score": 3,
                                                    "created_utc": 1608046324.0,
                                                    "replies": [
                                                        {
                                                            "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                                                            "author": null,
                                                            "id": "gfxgtrm",
                                                            "parent_id": "t1_gfxg484",
                                                            "score": 2,
                                                            "created_utc": 1608046687.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                                                                    "author": "Markemberke",
                                                                    "id": "gfxhrau",
                                                                    "parent_id": "t1_gfxgtrm",
                                                                    "score": 6,
                                                                    "created_utc": 1608047158.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                                                            "author": null,
                                                                            "id": "gfxiaf5",
                                                                            "parent_id": "t1_gfxhrau",
                                                                            "score": 2,
                                                                            "created_utc": 1608047429.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Just rewatched the episode and they were both having a genjutsu fight the whole time.",
                            "author": null,
                            "id": "gfwna09",
                            "parent_id": "t1_gfwcxww",
                            "score": 8,
                            "created_utc": 1608023635.0,
                            "replies": [
                                {
                                    "body": "Nah, not the whole time, bro. Itachi had to drain himself out because he noticed Sasuke has no chance against him. And also wanted to test him, how powerful he became. Yes, there were a tonns of genjutsu, but there were ninjutsu and thaijutsu too.",
                                    "author": "Markemberke",
                                    "id": "gfwx28f",
                                    "parent_id": "t1_gfwna09",
                                    "score": 8,
                                    "created_utc": 1608033822.0,
                                    "replies": [
                                        {
                                            "body": "I think the opposite. Itachi was toying with him not taking him seriously, until sasuke did that shuriken string thing and embedded a giant blade in itachis thigh. After that moment you saw the look in itachis face and he knew he couldn’t toy around in reality with sasuke. Too smart. He started trying after that point, but he was never serious he could kill sasuke any second and he proved that by letting sasuke throw everything he had at him until he had 0 chakra, and only then did Itachi fight back and he still had susanoo. Sasuke would have been a skid mark if it was a real fight",
                                            "author": null,
                                            "id": "gfx9t75",
                                            "parent_id": "t1_gfwx28f",
                                            "score": 10,
                                            "created_utc": 1608042939.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Zetsu was watching the fight and literally said : what are they doing? they haven't moved ever since they came face to face.",
                                            "author": null,
                                            "id": "gfxld5z",
                                            "parent_id": "t1_gfwx28f",
                                            "score": 7,
                                            "created_utc": 1608048961.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
                                                    "author": "Markemberke",
                                                    "id": "gfxlq9i",
                                                    "parent_id": "t1_gfxld5z",
                                                    "score": 4,
                                                    "created_utc": 1608049138.0,
                                                    "replies": [
                                                        {
                                                            "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                                                            "author": null,
                                                            "id": "gfxrsgu",
                                                            "parent_id": "t1_gfxlq9i",
                                                            "score": 5,
                                                            "created_utc": 1608052043.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d willingly rip out both my eyeballs and hand them to him",
            "author": "SaintAhmad",
            "id": "gfw7o7t",
            "parent_id": "t1_gfw5q2j",
            "score": 139,
            "created_utc": 1608009939.0,
            "replies": [
                {
                    "body": "Fr. I'd be super confused whether im doing this because I'm *heavily* impressed at his performance or just because I want to get tf out of here from this madman to the blond simp but the sentiment's same.",
                    "author": "Not_noice",
                    "id": "gfwdtsb",
                    "parent_id": "t1_gfw7o7t",
                    "score": 41,
                    "created_utc": 1608014685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There was a thread about a year ago asking what people would change in Naruto if they could and some commented the same thing. Great minds must think alike.",
            "author": "blalokjpg",
            "id": "gfx7aaw",
            "parent_id": "t1_gfw5q2j",
            "score": 12,
            "created_utc": 1608041457.0,
            "replies": []
        },
        {
            "body": "Add some crows to the picture and yeah",
            "author": "3727rhfh",
            "id": "gfwbgfb",
            "parent_id": "t1_gfvr1j9",
            "score": 35,
            "created_utc": 1608012752.0,
            "replies": [
                {
                    "body": "Happy cake day!",
                    "author": "xgovindx",
                    "id": "gfwrufe",
                    "parent_id": "t1_gfwbgfb",
                    "score": 1,
                    "created_utc": 1608028558.0,
                    "replies": [
                        {
                            "body": "Thank you",
                            "author": "3727rhfh",
                            "id": "gfwt3zx",
                            "parent_id": "t1_gfwrufe",
                            "score": 1,
                            "created_utc": 1608029899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His illness was killing him anyway, and he thought dying at his hands was his way of redemption",
            "author": "Yogami_asura",
            "id": "gfwulny",
            "parent_id": "t1_gfw917k",
            "score": 30,
            "created_utc": 1608031423.0,
            "replies": [
                {
                    "body": "Yeah honestly it’s a question if Itachi even liked himself after what he did. He treated himself kinda poorly. Always had that aura like he wanted to die",
                    "author": null,
                    "id": "gfxaiaq",
                    "parent_id": "t1_gfwulny",
                    "score": 17,
                    "created_utc": 1608043327.0,
                    "replies": []
                },
                {
                    "body": "We don't know much about the nature of Itachi's illness, just that he had stopped taking his meds.\n\nHe should have faked his death, stayed alive and watched out for Sasuke from afar.",
                    "author": "TyrionGoldenLion",
                    "id": "gfwvqhl",
                    "parent_id": "t1_gfwulny",
                    "score": 15,
                    "created_utc": 1608032545.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“BRUH IM SIPPIN TEA IN YO HOOD, WHAT THE FUCK IS UP, YOU BUTTERCUP?!”  -XXXTENTACION",
            "author": null,
            "id": "gfxaddt",
            "parent_id": "t1_gfw50qe",
            "score": 10,
            "created_utc": 1608043251.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣🤣😓",
            "author": "blee216e",
            "id": "gfw9333",
            "parent_id": "t1_gfw50qe",
            "score": 4,
            "created_utc": 1608010953.0,
            "replies": []
        },
        {
            "body": "Facebook",
            "author": "SolerFlereTEE",
            "id": "gfz7o38",
            "parent_id": "t1_gfw8xrm",
            "score": 2,
            "created_utc": 1608076586.0,
            "replies": []
        },
        {
            "body": "At this point idk who gets what from who.",
            "author": "blalokjpg",
            "id": "gfx7c78",
            "parent_id": "t1_gfwcf5z",
            "score": 1,
            "created_utc": 1608041489.0,
            "replies": []
        },
        {
            "body": "*One of my friends shared*\n\n*This the other day and I*\n\n*Nearly shat my pants*\n\n\\- dietbongwater\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "author": "haikusbot",
            "id": "gfxmy4d",
            "parent_id": "t1_gfxmx56",
            "score": 2,
            "created_utc": 1608049733.0,
            "replies": [
                {
                    "body": "good bot",
                    "author": "dietbongwater",
                    "id": "gfxmzxd",
                    "parent_id": "t1_gfxmy4d",
                    "score": 1,
                    "created_utc": 1608049757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nobody: \n\nItachi: Yall hear something?",
            "author": "Adrianb4902",
            "id": "gfw7h0v",
            "parent_id": "t1_gfw5vie",
            "score": 120,
            "created_utc": 1608009801.0,
            "replies": [
                {
                    "body": "r/UselessNobody",
                    "author": "Negrizzy153",
                    "id": "gfws4qe",
                    "parent_id": "t1_gfw7h0v",
                    "score": 31,
                    "created_utc": 1608028867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But then Itachi was behind-behind. High level lmao what Itachi can do in terms of genjutsu. It's just ridiculous how he can control that and use that to trick literally anyone.",
            "author": "Markemberke",
            "id": "gfwcxww",
            "parent_id": "t1_gfwbttq",
            "score": 109,
            "created_utc": 1608013945.0,
            "replies": [
                {
                    "body": "Other ninjas: I have trained hard all my life to become powerful \n\nItachi: mf don’t even look at me or its over. I decide what’s real.",
                    "author": "DvrkHors3",
                    "id": "gfwglra",
                    "parent_id": "t1_gfwcxww",
                    "score": 113,
                    "created_utc": 1608017125.0,
                    "replies": [
                        {
                            "body": "straight up",
                            "author": "HG21Reaper",
                            "id": "gfx6mg9",
                            "parent_id": "t1_gfwglra",
                            "score": 12,
                            "created_utc": 1608041040.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's like that meme where people have guns pointed behind ppls back then there's the dude with the sniper. But the sniper was itachi all along. Whoa..",
                    "author": null,
                    "id": "gfwkqn4",
                    "parent_id": "t1_gfwcxww",
                    "score": 35,
                    "created_utc": 1608021019.0,
                    "replies": []
                },
                {
                    "body": "That’s why they say uchiha a can never be defeated solo. You always have to have 2 or more people cause genjutsu lock.",
                    "author": null,
                    "id": "gfx9idx",
                    "parent_id": "t1_gfwcxww",
                    "score": 6,
                    "created_utc": 1608042770.0,
                    "replies": [
                        {
                            "body": "Who says that? Only Itachi is so ridiculously OP with genjutsu. Regular Uchihas can be countered by other genjutsu practicioners. For example everyone laughs at Kurenai, just because she lose against Itachi. But Obito couldn't genjutsu Itachi's teammate, who was a genjutsu user, but actually regular human, so not Uchiha. The guy could resist Obito's genjutsu. And I don't think that guy is better at genjutsu than Kurenai. Kurenai is very skilled at genjutsu, she just faced the literally worst opponent ever, Itachi. But it doesn't makes her bad. Kurenai could easily fight every other Uchihas in terms of genjutsu.",
                            "author": "Markemberke",
                            "id": "gfxewkg",
                            "parent_id": "t1_gfx9idx",
                            "score": 9,
                            "created_utc": 1608045695.0,
                            "replies": [
                                {
                                    "body": "It’s one of those old databool entries from the start that’s technically canon but was so early on that it doesn’t sound right, but I believe it. You need someone or yourself to wake you out of genjutsu, for a fact. That takes time, for a fact. During that time the uchiha just kills you. I can believe that. Itachi stomped orochimaru solo with just a look, obito stomped Kurama solo with just a look, if you aren’t a perfect jin or hashirama who is immune to anything that makes him weaker than anyone else, than you’re kinda screwed against even basic genjutsu. Against uchiha genjutsu you’re gonna die unless you get help. That’s why obito never genjutsu’d minato because it would have been a instant stomp. Genjutsu fell off as the series went on because it’s unbeatable if you’re alone or not a jinjuriki. All madara had to do was genjutsu guy and non of that could have happened because he would have interrupted them until someone could physically get to guy, wake him up, and get him fighting all over again. Jiraiya last ditch survival move was genjutsu because he knew if pain got caught by himself, it’s an instant win for him. Genjutsu is boosted. Genjutsu is a instant win in a one on one fight and you trap the other person. Orochimaru trapped hiruzen in a basic genjutsu and it took the most experienced hokage all his effort to barley make it out. A normal shinobi solo is not defeating a uchiha or a uchiha genjutsu.",
                                    "author": null,
                                    "id": "gfxfbky",
                                    "parent_id": "t1_gfxewkg",
                                    "score": 2,
                                    "created_utc": 1608045914.0,
                                    "replies": [
                                        {
                                            "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
                                            "author": "Markemberke",
                                            "id": "gfxg484",
                                            "parent_id": "t1_gfxfbky",
                                            "score": 3,
                                            "created_utc": 1608046324.0,
                                            "replies": [
                                                {
                                                    "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                                                    "author": null,
                                                    "id": "gfxgtrm",
                                                    "parent_id": "t1_gfxg484",
                                                    "score": 2,
                                                    "created_utc": 1608046687.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                                                            "author": "Markemberke",
                                                            "id": "gfxhrau",
                                                            "parent_id": "t1_gfxgtrm",
                                                            "score": 6,
                                                            "created_utc": 1608047158.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                                                    "author": null,
                                                                    "id": "gfxiaf5",
                                                                    "parent_id": "t1_gfxhrau",
                                                                    "score": 2,
                                                                    "created_utc": 1608047429.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Just rewatched the episode and they were both having a genjutsu fight the whole time.",
                    "author": null,
                    "id": "gfwna09",
                    "parent_id": "t1_gfwcxww",
                    "score": 8,
                    "created_utc": 1608023635.0,
                    "replies": [
                        {
                            "body": "Nah, not the whole time, bro. Itachi had to drain himself out because he noticed Sasuke has no chance against him. And also wanted to test him, how powerful he became. Yes, there were a tonns of genjutsu, but there were ninjutsu and thaijutsu too.",
                            "author": "Markemberke",
                            "id": "gfwx28f",
                            "parent_id": "t1_gfwna09",
                            "score": 8,
                            "created_utc": 1608033822.0,
                            "replies": [
                                {
                                    "body": "I think the opposite. Itachi was toying with him not taking him seriously, until sasuke did that shuriken string thing and embedded a giant blade in itachis thigh. After that moment you saw the look in itachis face and he knew he couldn’t toy around in reality with sasuke. Too smart. He started trying after that point, but he was never serious he could kill sasuke any second and he proved that by letting sasuke throw everything he had at him until he had 0 chakra, and only then did Itachi fight back and he still had susanoo. Sasuke would have been a skid mark if it was a real fight",
                                    "author": null,
                                    "id": "gfx9t75",
                                    "parent_id": "t1_gfwx28f",
                                    "score": 10,
                                    "created_utc": 1608042939.0,
                                    "replies": []
                                },
                                {
                                    "body": "Zetsu was watching the fight and literally said : what are they doing? they haven't moved ever since they came face to face.",
                                    "author": null,
                                    "id": "gfxld5z",
                                    "parent_id": "t1_gfwx28f",
                                    "score": 7,
                                    "created_utc": 1608048961.0,
                                    "replies": [
                                        {
                                            "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
                                            "author": "Markemberke",
                                            "id": "gfxlq9i",
                                            "parent_id": "t1_gfxld5z",
                                            "score": 4,
                                            "created_utc": 1608049138.0,
                                            "replies": [
                                                {
                                                    "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                                                    "author": null,
                                                    "id": "gfxrsgu",
                                                    "parent_id": "t1_gfxlq9i",
                                                    "score": 5,
                                                    "created_utc": 1608052043.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fr. I'd be super confused whether im doing this because I'm *heavily* impressed at his performance or just because I want to get tf out of here from this madman to the blond simp but the sentiment's same.",
            "author": "Not_noice",
            "id": "gfwdtsb",
            "parent_id": "t1_gfw7o7t",
            "score": 41,
            "created_utc": 1608014685.0,
            "replies": []
        },
        {
            "body": "Happy cake day!",
            "author": "xgovindx",
            "id": "gfwrufe",
            "parent_id": "t1_gfwbgfb",
            "score": 1,
            "created_utc": 1608028558.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "3727rhfh",
                    "id": "gfwt3zx",
                    "parent_id": "t1_gfwrufe",
                    "score": 1,
                    "created_utc": 1608029899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah honestly it’s a question if Itachi even liked himself after what he did. He treated himself kinda poorly. Always had that aura like he wanted to die",
            "author": null,
            "id": "gfxaiaq",
            "parent_id": "t1_gfwulny",
            "score": 17,
            "created_utc": 1608043327.0,
            "replies": []
        },
        {
            "body": "We don't know much about the nature of Itachi's illness, just that he had stopped taking his meds.\n\nHe should have faked his death, stayed alive and watched out for Sasuke from afar.",
            "author": "TyrionGoldenLion",
            "id": "gfwvqhl",
            "parent_id": "t1_gfwulny",
            "score": 15,
            "created_utc": 1608032545.0,
            "replies": []
        },
        {
            "body": "good bot",
            "author": "dietbongwater",
            "id": "gfxmzxd",
            "parent_id": "t1_gfxmy4d",
            "score": 1,
            "created_utc": 1608049757.0,
            "replies": []
        },
        {
            "body": "r/UselessNobody",
            "author": "Negrizzy153",
            "id": "gfws4qe",
            "parent_id": "t1_gfw7h0v",
            "score": 31,
            "created_utc": 1608028867.0,
            "replies": []
        },
        {
            "body": "Other ninjas: I have trained hard all my life to become powerful \n\nItachi: mf don’t even look at me or its over. I decide what’s real.",
            "author": "DvrkHors3",
            "id": "gfwglra",
            "parent_id": "t1_gfwcxww",
            "score": 113,
            "created_utc": 1608017125.0,
            "replies": [
                {
                    "body": "straight up",
                    "author": "HG21Reaper",
                    "id": "gfx6mg9",
                    "parent_id": "t1_gfwglra",
                    "score": 12,
                    "created_utc": 1608041040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's like that meme where people have guns pointed behind ppls back then there's the dude with the sniper. But the sniper was itachi all along. Whoa..",
            "author": null,
            "id": "gfwkqn4",
            "parent_id": "t1_gfwcxww",
            "score": 35,
            "created_utc": 1608021019.0,
            "replies": []
        },
        {
            "body": "That’s why they say uchiha a can never be defeated solo. You always have to have 2 or more people cause genjutsu lock.",
            "author": null,
            "id": "gfx9idx",
            "parent_id": "t1_gfwcxww",
            "score": 6,
            "created_utc": 1608042770.0,
            "replies": [
                {
                    "body": "Who says that? Only Itachi is so ridiculously OP with genjutsu. Regular Uchihas can be countered by other genjutsu practicioners. For example everyone laughs at Kurenai, just because she lose against Itachi. But Obito couldn't genjutsu Itachi's teammate, who was a genjutsu user, but actually regular human, so not Uchiha. The guy could resist Obito's genjutsu. And I don't think that guy is better at genjutsu than Kurenai. Kurenai is very skilled at genjutsu, she just faced the literally worst opponent ever, Itachi. But it doesn't makes her bad. Kurenai could easily fight every other Uchihas in terms of genjutsu.",
                    "author": "Markemberke",
                    "id": "gfxewkg",
                    "parent_id": "t1_gfx9idx",
                    "score": 9,
                    "created_utc": 1608045695.0,
                    "replies": [
                        {
                            "body": "It’s one of those old databool entries from the start that’s technically canon but was so early on that it doesn’t sound right, but I believe it. You need someone or yourself to wake you out of genjutsu, for a fact. That takes time, for a fact. During that time the uchiha just kills you. I can believe that. Itachi stomped orochimaru solo with just a look, obito stomped Kurama solo with just a look, if you aren’t a perfect jin or hashirama who is immune to anything that makes him weaker than anyone else, than you’re kinda screwed against even basic genjutsu. Against uchiha genjutsu you’re gonna die unless you get help. That’s why obito never genjutsu’d minato because it would have been a instant stomp. Genjutsu fell off as the series went on because it’s unbeatable if you’re alone or not a jinjuriki. All madara had to do was genjutsu guy and non of that could have happened because he would have interrupted them until someone could physically get to guy, wake him up, and get him fighting all over again. Jiraiya last ditch survival move was genjutsu because he knew if pain got caught by himself, it’s an instant win for him. Genjutsu is boosted. Genjutsu is a instant win in a one on one fight and you trap the other person. Orochimaru trapped hiruzen in a basic genjutsu and it took the most experienced hokage all his effort to barley make it out. A normal shinobi solo is not defeating a uchiha or a uchiha genjutsu.",
                            "author": null,
                            "id": "gfxfbky",
                            "parent_id": "t1_gfxewkg",
                            "score": 2,
                            "created_utc": 1608045914.0,
                            "replies": [
                                {
                                    "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
                                    "author": "Markemberke",
                                    "id": "gfxg484",
                                    "parent_id": "t1_gfxfbky",
                                    "score": 3,
                                    "created_utc": 1608046324.0,
                                    "replies": [
                                        {
                                            "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                                            "author": null,
                                            "id": "gfxgtrm",
                                            "parent_id": "t1_gfxg484",
                                            "score": 2,
                                            "created_utc": 1608046687.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                                                    "author": "Markemberke",
                                                    "id": "gfxhrau",
                                                    "parent_id": "t1_gfxgtrm",
                                                    "score": 6,
                                                    "created_utc": 1608047158.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                                            "author": null,
                                                            "id": "gfxiaf5",
                                                            "parent_id": "t1_gfxhrau",
                                                            "score": 2,
                                                            "created_utc": 1608047429.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just rewatched the episode and they were both having a genjutsu fight the whole time.",
            "author": null,
            "id": "gfwna09",
            "parent_id": "t1_gfwcxww",
            "score": 8,
            "created_utc": 1608023635.0,
            "replies": [
                {
                    "body": "Nah, not the whole time, bro. Itachi had to drain himself out because he noticed Sasuke has no chance against him. And also wanted to test him, how powerful he became. Yes, there were a tonns of genjutsu, but there were ninjutsu and thaijutsu too.",
                    "author": "Markemberke",
                    "id": "gfwx28f",
                    "parent_id": "t1_gfwna09",
                    "score": 8,
                    "created_utc": 1608033822.0,
                    "replies": [
                        {
                            "body": "I think the opposite. Itachi was toying with him not taking him seriously, until sasuke did that shuriken string thing and embedded a giant blade in itachis thigh. After that moment you saw the look in itachis face and he knew he couldn’t toy around in reality with sasuke. Too smart. He started trying after that point, but he was never serious he could kill sasuke any second and he proved that by letting sasuke throw everything he had at him until he had 0 chakra, and only then did Itachi fight back and he still had susanoo. Sasuke would have been a skid mark if it was a real fight",
                            "author": null,
                            "id": "gfx9t75",
                            "parent_id": "t1_gfwx28f",
                            "score": 10,
                            "created_utc": 1608042939.0,
                            "replies": []
                        },
                        {
                            "body": "Zetsu was watching the fight and literally said : what are they doing? they haven't moved ever since they came face to face.",
                            "author": null,
                            "id": "gfxld5z",
                            "parent_id": "t1_gfwx28f",
                            "score": 7,
                            "created_utc": 1608048961.0,
                            "replies": [
                                {
                                    "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
                                    "author": "Markemberke",
                                    "id": "gfxlq9i",
                                    "parent_id": "t1_gfxld5z",
                                    "score": 4,
                                    "created_utc": 1608049138.0,
                                    "replies": [
                                        {
                                            "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                                            "author": null,
                                            "id": "gfxrsgu",
                                            "parent_id": "t1_gfxlq9i",
                                            "score": 5,
                                            "created_utc": 1608052043.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "3727rhfh",
            "id": "gfwt3zx",
            "parent_id": "t1_gfwrufe",
            "score": 1,
            "created_utc": 1608029899.0,
            "replies": []
        },
        {
            "body": "straight up",
            "author": "HG21Reaper",
            "id": "gfx6mg9",
            "parent_id": "t1_gfwglra",
            "score": 12,
            "created_utc": 1608041040.0,
            "replies": []
        },
        {
            "body": "Who says that? Only Itachi is so ridiculously OP with genjutsu. Regular Uchihas can be countered by other genjutsu practicioners. For example everyone laughs at Kurenai, just because she lose against Itachi. But Obito couldn't genjutsu Itachi's teammate, who was a genjutsu user, but actually regular human, so not Uchiha. The guy could resist Obito's genjutsu. And I don't think that guy is better at genjutsu than Kurenai. Kurenai is very skilled at genjutsu, she just faced the literally worst opponent ever, Itachi. But it doesn't makes her bad. Kurenai could easily fight every other Uchihas in terms of genjutsu.",
            "author": "Markemberke",
            "id": "gfxewkg",
            "parent_id": "t1_gfx9idx",
            "score": 9,
            "created_utc": 1608045695.0,
            "replies": [
                {
                    "body": "It’s one of those old databool entries from the start that’s technically canon but was so early on that it doesn’t sound right, but I believe it. You need someone or yourself to wake you out of genjutsu, for a fact. That takes time, for a fact. During that time the uchiha just kills you. I can believe that. Itachi stomped orochimaru solo with just a look, obito stomped Kurama solo with just a look, if you aren’t a perfect jin or hashirama who is immune to anything that makes him weaker than anyone else, than you’re kinda screwed against even basic genjutsu. Against uchiha genjutsu you’re gonna die unless you get help. That’s why obito never genjutsu’d minato because it would have been a instant stomp. Genjutsu fell off as the series went on because it’s unbeatable if you’re alone or not a jinjuriki. All madara had to do was genjutsu guy and non of that could have happened because he would have interrupted them until someone could physically get to guy, wake him up, and get him fighting all over again. Jiraiya last ditch survival move was genjutsu because he knew if pain got caught by himself, it’s an instant win for him. Genjutsu is boosted. Genjutsu is a instant win in a one on one fight and you trap the other person. Orochimaru trapped hiruzen in a basic genjutsu and it took the most experienced hokage all his effort to barley make it out. A normal shinobi solo is not defeating a uchiha or a uchiha genjutsu.",
                    "author": null,
                    "id": "gfxfbky",
                    "parent_id": "t1_gfxewkg",
                    "score": 2,
                    "created_utc": 1608045914.0,
                    "replies": [
                        {
                            "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
                            "author": "Markemberke",
                            "id": "gfxg484",
                            "parent_id": "t1_gfxfbky",
                            "score": 3,
                            "created_utc": 1608046324.0,
                            "replies": [
                                {
                                    "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                                    "author": null,
                                    "id": "gfxgtrm",
                                    "parent_id": "t1_gfxg484",
                                    "score": 2,
                                    "created_utc": 1608046687.0,
                                    "replies": [
                                        {
                                            "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                                            "author": "Markemberke",
                                            "id": "gfxhrau",
                                            "parent_id": "t1_gfxgtrm",
                                            "score": 6,
                                            "created_utc": 1608047158.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                                    "author": null,
                                                    "id": "gfxiaf5",
                                                    "parent_id": "t1_gfxhrau",
                                                    "score": 2,
                                                    "created_utc": 1608047429.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah, not the whole time, bro. Itachi had to drain himself out because he noticed Sasuke has no chance against him. And also wanted to test him, how powerful he became. Yes, there were a tonns of genjutsu, but there were ninjutsu and thaijutsu too.",
            "author": "Markemberke",
            "id": "gfwx28f",
            "parent_id": "t1_gfwna09",
            "score": 8,
            "created_utc": 1608033822.0,
            "replies": [
                {
                    "body": "I think the opposite. Itachi was toying with him not taking him seriously, until sasuke did that shuriken string thing and embedded a giant blade in itachis thigh. After that moment you saw the look in itachis face and he knew he couldn’t toy around in reality with sasuke. Too smart. He started trying after that point, but he was never serious he could kill sasuke any second and he proved that by letting sasuke throw everything he had at him until he had 0 chakra, and only then did Itachi fight back and he still had susanoo. Sasuke would have been a skid mark if it was a real fight",
                    "author": null,
                    "id": "gfx9t75",
                    "parent_id": "t1_gfwx28f",
                    "score": 10,
                    "created_utc": 1608042939.0,
                    "replies": []
                },
                {
                    "body": "Zetsu was watching the fight and literally said : what are they doing? they haven't moved ever since they came face to face.",
                    "author": null,
                    "id": "gfxld5z",
                    "parent_id": "t1_gfwx28f",
                    "score": 7,
                    "created_utc": 1608048961.0,
                    "replies": [
                        {
                            "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
                            "author": "Markemberke",
                            "id": "gfxlq9i",
                            "parent_id": "t1_gfxld5z",
                            "score": 4,
                            "created_utc": 1608049138.0,
                            "replies": [
                                {
                                    "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                                    "author": null,
                                    "id": "gfxrsgu",
                                    "parent_id": "t1_gfxlq9i",
                                    "score": 5,
                                    "created_utc": 1608052043.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s one of those old databool entries from the start that’s technically canon but was so early on that it doesn’t sound right, but I believe it. You need someone or yourself to wake you out of genjutsu, for a fact. That takes time, for a fact. During that time the uchiha just kills you. I can believe that. Itachi stomped orochimaru solo with just a look, obito stomped Kurama solo with just a look, if you aren’t a perfect jin or hashirama who is immune to anything that makes him weaker than anyone else, than you’re kinda screwed against even basic genjutsu. Against uchiha genjutsu you’re gonna die unless you get help. That’s why obito never genjutsu’d minato because it would have been a instant stomp. Genjutsu fell off as the series went on because it’s unbeatable if you’re alone or not a jinjuriki. All madara had to do was genjutsu guy and non of that could have happened because he would have interrupted them until someone could physically get to guy, wake him up, and get him fighting all over again. Jiraiya last ditch survival move was genjutsu because he knew if pain got caught by himself, it’s an instant win for him. Genjutsu is boosted. Genjutsu is a instant win in a one on one fight and you trap the other person. Orochimaru trapped hiruzen in a basic genjutsu and it took the most experienced hokage all his effort to barley make it out. A normal shinobi solo is not defeating a uchiha or a uchiha genjutsu.",
            "author": null,
            "id": "gfxfbky",
            "parent_id": "t1_gfxewkg",
            "score": 2,
            "created_utc": 1608045914.0,
            "replies": [
                {
                    "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
                    "author": "Markemberke",
                    "id": "gfxg484",
                    "parent_id": "t1_gfxfbky",
                    "score": 3,
                    "created_utc": 1608046324.0,
                    "replies": [
                        {
                            "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                            "author": null,
                            "id": "gfxgtrm",
                            "parent_id": "t1_gfxg484",
                            "score": 2,
                            "created_utc": 1608046687.0,
                            "replies": [
                                {
                                    "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                                    "author": "Markemberke",
                                    "id": "gfxhrau",
                                    "parent_id": "t1_gfxgtrm",
                                    "score": 6,
                                    "created_utc": 1608047158.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                            "author": null,
                                            "id": "gfxiaf5",
                                            "parent_id": "t1_gfxhrau",
                                            "score": 2,
                                            "created_utc": 1608047429.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think the opposite. Itachi was toying with him not taking him seriously, until sasuke did that shuriken string thing and embedded a giant blade in itachis thigh. After that moment you saw the look in itachis face and he knew he couldn’t toy around in reality with sasuke. Too smart. He started trying after that point, but he was never serious he could kill sasuke any second and he proved that by letting sasuke throw everything he had at him until he had 0 chakra, and only then did Itachi fight back and he still had susanoo. Sasuke would have been a skid mark if it was a real fight",
            "author": null,
            "id": "gfx9t75",
            "parent_id": "t1_gfwx28f",
            "score": 10,
            "created_utc": 1608042939.0,
            "replies": []
        },
        {
            "body": "Zetsu was watching the fight and literally said : what are they doing? they haven't moved ever since they came face to face.",
            "author": null,
            "id": "gfxld5z",
            "parent_id": "t1_gfwx28f",
            "score": 7,
            "created_utc": 1608048961.0,
            "replies": [
                {
                    "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
                    "author": "Markemberke",
                    "id": "gfxlq9i",
                    "parent_id": "t1_gfxld5z",
                    "score": 4,
                    "created_utc": 1608049138.0,
                    "replies": [
                        {
                            "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                            "author": null,
                            "id": "gfxrsgu",
                            "parent_id": "t1_gfxlq9i",
                            "score": 5,
                            "created_utc": 1608052043.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, you're right about Minato, but I think Obito didn't genjutsu him, because 1) he was controlling Kurama, 2) he wanted to fight Minato, because idk., why not? 3) Obito isn't really into genjutsu. I mean sure, he can do Sharingan genjutsus like every Uchiha can, but he really isn't as strong. He uses Kamui, so he likes physical combat, coz he is OP in that.\n\nAnd yes, you're actually right. I mean genjutsu is underrated by many people, while it is just as strong as ninjutsu, if you are good enough with it. And regular ninjas have literally no chance to escape from a genjutsu, casted by an Uchiha.",
            "author": "Markemberke",
            "id": "gfxg484",
            "parent_id": "t1_gfxfbky",
            "score": 3,
            "created_utc": 1608046324.0,
            "replies": [
                {
                    "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
                    "author": null,
                    "id": "gfxgtrm",
                    "parent_id": "t1_gfxg484",
                    "score": 2,
                    "created_utc": 1608046687.0,
                    "replies": [
                        {
                            "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                            "author": "Markemberke",
                            "id": "gfxhrau",
                            "parent_id": "t1_gfxgtrm",
                            "score": 6,
                            "created_utc": 1608047158.0,
                            "replies": [
                                {
                                    "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                                    "author": null,
                                    "id": "gfxiaf5",
                                    "parent_id": "t1_gfxhrau",
                                    "score": 2,
                                    "created_utc": 1608047429.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, there were a lot of genjutsu, and then ninjutsu, thaijutsu. What do you think, where injured Itachi by the big shurikens? Where did he spammed the amaterasu? Where did Sasuke use the Kirin, Itachi the Susanoo? Why Itachi got tired? Not because of genjutsu. He had to drain himself out physically to die in his illness, but also had to look like Sasuke kills him.",
            "author": "Markemberke",
            "id": "gfxlq9i",
            "parent_id": "t1_gfxld5z",
            "score": 4,
            "created_utc": 1608049138.0,
            "replies": [
                {
                    "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
                    "author": null,
                    "id": "gfxrsgu",
                    "parent_id": "t1_gfxlq9i",
                    "score": 5,
                    "created_utc": 1608052043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Solo king. Itachi might lose against a group of people but he has a shot of winning against anyone solo with that boosted ass genjutsu. The only question is.....does having a rinnegan or being more godly make you immune? Kaguya was not immune to Amaterasu, was not immune to Kamui, so I can’t just assume she would be immune to another eye jutsu just because she’s a higher level uchiha. She might have a way easier time fighting off Amaterasu, or Kamui, or tsyukiomi, but I do not think anyone is immune to the genjutsu. Just have easier times with it. Sasuke wasn’t even immune to it, he just said he was starting to see through it, as well as see it.",
            "author": null,
            "id": "gfxgtrm",
            "parent_id": "t1_gfxg484",
            "score": 2,
            "created_utc": 1608046687.0,
            "replies": [
                {
                    "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
                    "author": "Markemberke",
                    "id": "gfxhrau",
                    "parent_id": "t1_gfxgtrm",
                    "score": 6,
                    "created_utc": 1608047158.0,
                    "replies": [
                        {
                            "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                            "author": null,
                            "id": "gfxiaf5",
                            "parent_id": "t1_gfxhrau",
                            "score": 2,
                            "created_utc": 1608047429.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes i know, i was specifically talking about the beginning of the fight which this meme depicts wrong.",
            "author": null,
            "id": "gfxrsgu",
            "parent_id": "t1_gfxlq9i",
            "score": 5,
            "created_utc": 1608052043.0,
            "replies": []
        },
        {
            "body": "Yes, Rinnegan makes you immune to it, or at least so damn high resistance, so it's basically immune. Madara with EMS would be able to resist Itachi most of the time. Long enough to pull out the Perfect Susanoo and destroy the place. And the Otsutsukis are generally OP. I mean they don't give a fuck about anything. In Boruto when one of them attacked the Chuunin exam or what (idk. I never watched it, just saw the fight), Shikamaru catched him with shadow possession and the guy just casually broke out of it. I don't think any Otsutsuki can be genjutsud or at least they can break out of it for sure. Otherwise Sasuke would just genjutsu them with his Rinnegan+Sharingan and would be GG. IMO.",
            "author": "Markemberke",
            "id": "gfxhrau",
            "parent_id": "t1_gfxgtrm",
            "score": 6,
            "created_utc": 1608047158.0,
            "replies": [
                {
                    "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
                    "author": null,
                    "id": "gfxiaf5",
                    "parent_id": "t1_gfxhrau",
                    "score": 2,
                    "created_utc": 1608047429.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I feel that. I think the biggest gap is the reality of fighting and then fighting in a show. In reality with these people a second for an opening is all you need, where as in the show madara can get kicked in half and be about to die and everyone just stands there and let’s him heal.",
            "author": null,
            "id": "gfxiaf5",
            "parent_id": "t1_gfxhrau",
            "score": 2,
            "created_utc": 1608047429.0,
            "replies": []
        }
    ]
}