{
    "title": "Yup",
    "post_id": "nre7i0",
    "post_url": "https://www.reddit.com/r/dankruto/comments/nre7i0/yup/",
    "author": "potlu_party",
    "body": "",
    "url": "https://i.redd.it/di9m9r6g42371.jpg",
    "score": 5941,
    "upvote_ratio": 0.99,
    "created_utc": 1622728837.0,
    "num_comments": 126,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "sorry sai, since you removed your tattoo you can't be team 7 anymore",
            "author": "skyderper13",
            "id": "h0fw6xf",
            "parent_id": "t3_nre7i0",
            "score": 721,
            "created_utc": 1622729330.0,
            "replies": [
                {
                    "body": "Danzo died, its not his fault man :(",
                    "author": "potlu_party",
                    "id": "h0fwdx0",
                    "parent_id": "t1_h0fw6xf",
                    "score": 276,
                    "created_utc": 1622729414.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h0jb6k5",
                            "parent_id": "t1_h0fwdx0",
                            "score": -15,
                            "created_utc": 1622786175.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Worth it to be free of Danzo.\n\nTeam 7 dissolved though. Sakura became chief medical ninja, Naruto became Hokage, Kakashi retired, and Sasuke is travelling the multiverse.",
                    "author": "SmallerBork",
                    "id": "h0g1gd7",
                    "parent_id": "t1_h0fw6xf",
                    "score": 332,
                    "created_utc": 1622731567.0,
                    "replies": [
                        {
                            "body": "Is that really \"dissolved\"? Imo \"dissolved\" is the sannin, where they just went and did their own thing. Team 7 is all serving the village, except kakashi after his hokage term",
                            "author": "WindyCityAssasin2",
                            "id": "h0guxh3",
                            "parent_id": "t1_h0g1gd7",
                            "score": 128,
                            "created_utc": 1622743733.0,
                            "replies": [
                                {
                                    "body": "I think it fits, Team 7 is a squad and as hokage Naruto's not doing traditional missions  and if he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\noh wait Shin arc, nevermind",
                                    "author": "whitey-ofwgkta",
                                    "id": "h0gvta2",
                                    "parent_id": "t1_h0guxh3",
                                    "score": 67,
                                    "created_utc": 1622744101.0,
                                    "replies": [
                                        {
                                            "body": "That wasn't a mission though. It just kinda happened because Sakura refused to explain anything to Sarada.",
                                            "author": "SmallerBork",
                                            "id": "h0gwnaw",
                                            "parent_id": "t1_h0gvta2",
                                            "score": 38,
                                            "created_utc": 1622744447.0,
                                            "replies": [
                                                {
                                                    "body": "Because sasuke asked her not to",
                                                    "author": "WindyCityAssasin2",
                                                    "id": "h0h8dqt",
                                                    "parent_id": "t1_h0gwnaw",
                                                    "score": 18,
                                                    "created_utc": 1622749416.0,
                                                    "replies": [
                                                        {
                                                            "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
                                                            "author": "SmallerBork",
                                                            "id": "h0hn54p",
                                                            "parent_id": "t1_h0h8dqt",
                                                            "score": 14,
                                                            "created_utc": 1622755538.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                                                                    "author": "WindyCityAssasin2",
                                                                    "id": "h0hubbx",
                                                                    "parent_id": "t1_h0hn54p",
                                                                    "score": 14,
                                                                    "created_utc": 1622758768.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                                                                            "author": "SmallerBork",
                                                                            "id": "h0hzo0s",
                                                                            "parent_id": "t1_h0hubbx",
                                                                            "score": 5,
                                                                            "created_utc": 1622761331.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                                                                    "author": "WindyCityAssasin2",
                                                                                    "id": "h0i3dwh",
                                                                                    "parent_id": "t1_h0hzo0s",
                                                                                    "score": 5,
                                                                                    "created_utc": 1622763188.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                                                                            "author": "SmallerBork",
                                                                                            "id": "h0iu9bs",
                                                                                            "parent_id": "t1_h0i3dwh",
                                                                                            "score": 2,
                                                                                            "created_utc": 1622776311.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                                                                    "author": "WindyCityAssasin2",
                                                                                                    "id": "h0iz5w8",
                                                                                                    "parent_id": "t1_h0iu9bs",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1622778867.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\nWym?",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0gwp5a",
                                            "parent_id": "t1_h0gvta2",
                                            "score": 5,
                                            "created_utc": 1622744468.0,
                                            "replies": [
                                                {
                                                    "body": "talking out of my ass but I feel like if Naruto had to go on a non-diplomatic mission and he needed a 3-man squad there would be a convenient reason that it wouldn't be either version of team-7",
                                                    "author": "whitey-ofwgkta",
                                                    "id": "h0gxcx8",
                                                    "parent_id": "t1_h0gwp5a",
                                                    "score": 9,
                                                    "created_utc": 1622744745.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
                                                            "author": "WindyCityAssasin2",
                                                            "id": "h0gy3fb",
                                                            "parent_id": "t1_h0gxcx8",
                                                            "score": 17,
                                                            "created_utc": 1622745051.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
                                                            "author": null,
                                                            "id": "h0h9kge",
                                                            "parent_id": "t1_h0gxcx8",
                                                            "score": 5,
                                                            "created_utc": 1622749913.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Well Kakashi does investigate stuff like Danzo's legacy and the kidnappings by the Hidan fanboy but officially he's retired.\n\nTeam 7 is dissolved because they don't go on missions together anymore. If they did, Konohamaru's team couldn't have the number.",
                                    "author": "SmallerBork",
                                    "id": "h0gwibw",
                                    "parent_id": "t1_h0guxh3",
                                    "score": 12,
                                    "created_utc": 1622744390.0,
                                    "replies": [
                                        {
                                            "body": "Yeah but by that logic isn't *every* old gen team dissolved?",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0gwv52",
                                            "parent_id": "t1_h0gwibw",
                                            "score": 7,
                                            "created_utc": 1622744536.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, that's what I'm saying.",
                                                    "author": "SmallerBork",
                                                    "id": "h0gxqor",
                                                    "parent_id": "t1_h0gwv52",
                                                    "score": 6,
                                                    "created_utc": 1622744904.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh ok I missed ur point",
                                                            "author": "WindyCityAssasin2",
                                                            "id": "h0gy63u",
                                                            "parent_id": "t1_h0gxqor",
                                                            "score": 2,
                                                            "created_utc": 1622745082.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I mean Kakashi is still helping out around the village, he has been advising Naruto and helped teach some of the children",
                                    "author": "AutistChan",
                                    "id": "h0hzqhb",
                                    "parent_id": "t1_h0guxh3",
                                    "score": 1,
                                    "created_utc": 1622761364.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And Sai became Director of the ANBU.",
                            "author": "Accomplished-Cycle73",
                            "id": "h0ghewd",
                            "parent_id": "t1_h0g1gd7",
                            "score": 57,
                            "created_utc": 1622738164.0,
                            "replies": []
                        },
                        {
                            "body": "Wait is Sasuke actually traveling the multiverse? Cuz I thought he was teleporting around the world. If he has enough chakra to travel the multiverse, how he always running out of chakra in small fights in Boruto?",
                            "author": null,
                            "id": "h0i99nz",
                            "parent_id": "t1_h0g1gd7",
                            "score": 6,
                            "created_utc": 1622766122.0,
                            "replies": [
                                {
                                    "body": "It's stated that Otsutsuki exist outside their dimension. If he were just traveling around the world, anyone could investigate them since there are other transportation jutsu.\n\nIt could easily just be other planets in that universe, but that's not what's been established.\n\nAs for running out of chakra, they nerfed him sadly. There are a lot of things that don't make sense like Sakura having a picture of Sasuke with team Taka in Akatsuki cloaks. Sarada doesn't know that Orochimaru attacked the village and killed Hiruzen. This isn't exclusive to Boruto though, Naruto and Sasuke didn't know who Madara was before Kurama told them.",
                                    "author": "SmallerBork",
                                    "id": "h0isk79",
                                    "parent_id": "t1_h0i99nz",
                                    "score": 4,
                                    "created_utc": 1622775463.0,
                                    "replies": [
                                        {
                                            "body": "That just reflects badly on the education system tho",
                                            "author": "ulfric_stormcloack",
                                            "id": "h0jkcse",
                                            "parent_id": "t1_h0isk79",
                                            "score": 1,
                                            "created_utc": 1622793486.0,
                                            "replies": [
                                                {
                                                    "body": "Even without learning it in school, the characters should have heard about it from their parents.\n\nIt's possible they tried to cover it up, but that's like the government trying to hide the fact that 9/11 even happened.",
                                                    "author": "SmallerBork",
                                                    "id": "h0kqb3c",
                                                    "parent_id": "t1_h0jkcse",
                                                    "score": 2,
                                                    "created_utc": 1622819465.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Nah sasukes looking for ONE PEICE!!!",
                            "author": "soupgogg2459",
                            "id": "h0h2ni4",
                            "parent_id": "t1_h0g1gd7",
                            "score": 2,
                            "created_utc": 1622746953.0,
                            "replies": []
                        },
                        {
                            "body": "sasuke is doing what?",
                            "author": "ulfric_stormcloack",
                            "id": "h0jk9gj",
                            "parent_id": "t1_h0g1gd7",
                            "score": 1,
                            "created_utc": 1622793408.0,
                            "replies": [
                                {
                                    "body": "His wormhole jutsu let's him leave Earth. Where'd you think he was going to find information on the Otsutsuki?\n\nhttps://naruto.fandom.com/wiki/Unidentified_World\n\nhttps://naruto.fandom.com/wiki/Momoshiki%27s_Planet",
                                    "author": "SmallerBork",
                                    "id": "h0kr4l1",
                                    "parent_id": "t1_h0jk9gj",
                                    "score": 2,
                                    "created_utc": 1622819828.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sasuke also removed his curse mark?",
                    "author": "SSj3Rambo",
                    "id": "h0gnfn3",
                    "parent_id": "t1_h0fw6xf",
                    "score": 27,
                    "created_utc": 1622740672.0,
                    "replies": [
                        {
                            "body": "Itachi removed it for him iirc",
                            "author": null,
                            "id": "h0i9bpy",
                            "parent_id": "t1_h0gnfn3",
                            "score": 5,
                            "created_utc": 1622766151.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Correct me if I'm wrong but doesn't Sai,Kakashi and Yamato have the mark of the Anbu Black Ops?",
                    "author": "FinalSusanoo7",
                    "id": "h0h44rx",
                    "parent_id": "t1_h0fw6xf",
                    "score": 7,
                    "created_utc": 1622747592.0,
                    "replies": []
                },
                {
                    "body": "He don’t care, he gets to pipe Ino he goochi",
                    "author": "l4dlouis",
                    "id": "h0h9weu",
                    "parent_id": "t1_h0fw6xf",
                    "score": 6,
                    "created_utc": 1622750050.0,
                    "replies": []
                },
                {
                    "body": "Oh yeah. Sasuke too. \n\nwelp... they can start like.. shadow team 07. \n\nwith kakashi and yamato. ooh..",
                    "author": "Purplegrey_ink",
                    "id": "h0gwxpa",
                    "parent_id": "t1_h0fw6xf",
                    "score": 2,
                    "created_utc": 1622744566.0,
                    "replies": []
                },
                {
                    "body": "but same thing with sasuke no?",
                    "author": "jstabs7",
                    "id": "h0hm2l3",
                    "parent_id": "t1_h0fw6xf",
                    "score": 1,
                    "created_utc": 1622755197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess Yamato had one too and it dissolved when Danzo died but we never saw it.",
            "author": "SmallerBork",
            "id": "h0g1jl2",
            "parent_id": "t3_nre7i0",
            "score": 171,
            "created_utc": 1622731604.0,
            "replies": [
                {
                    "body": "Does Yamato still get the hand notification if Naruto goes into tailed beast mode after Naruto became friends with Kurama?",
                    "author": "MisterTeapot",
                    "id": "h0g2k7d",
                    "parent_id": "t1_h0g1jl2",
                    "score": 103,
                    "created_utc": 1622732027.0,
                    "replies": [
                        {
                            "body": "From what I read on the wiki, it was the necklace activating that showed that to him. It was never explained how that happened in the anime though.",
                            "author": "SmallerBork",
                            "id": "h0g40fn",
                            "parent_id": "t1_h0g2k7d",
                            "score": 65,
                            "created_utc": 1622732634.0,
                            "replies": [
                                {
                                    "body": "I’m assuming Tsunade set that up",
                                    "author": "agonizedn",
                                    "id": "h0gx7hi",
                                    "parent_id": "t1_h0g40fn",
                                    "score": 28,
                                    "created_utc": 1622744680.0,
                                    "replies": [
                                        {
                                            "body": "Ya that's a good theory actually. What would she have done if Naruto lost that bet though?\n\nIruka, Kakashi, and Jiraiya were Father figures to him. She's the closest thing he had to a Mother. I wish they'd developed that a little more.",
                                            "author": "SmallerBork",
                                            "id": "h0gxl0w",
                                            "parent_id": "t1_h0gx7hi",
                                            "score": 32,
                                            "created_utc": 1622744839.0,
                                            "replies": [
                                                {
                                                    "body": "Man that’s so true. Kishimoto really wasted their relationship in past part 1. It was really sweet how much Naruto ended up meaning to Tsunade and not much was really done with it.",
                                                    "author": "Kazewatch",
                                                    "id": "h0h54sh",
                                                    "parent_id": "t1_h0gxl0w",
                                                    "score": 21,
                                                    "created_utc": 1622748017.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "But the stone was Hashirama's i thought? And i thought it alerted Yamato cuz he also had Hashirama Cells™️",
                                            "author": null,
                                            "id": "h0gz9qs",
                                            "parent_id": "t1_h0gx7hi",
                                            "score": 13,
                                            "created_utc": 1622745540.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Imagine Yamato not knowing Naruto became friends with Kurama and trying to supress Naruto getting into tailed beast mode",
                            "author": "wisdomsharerv2",
                            "id": "h0h4xio",
                            "parent_id": "t1_h0g2k7d",
                            "score": 10,
                            "created_utc": 1622747933.0,
                            "replies": []
                        },
                        {
                            "body": "I thought that only showed up *while* he was using his Tailed Beast suppression jutsu",
                            "author": "whitey-ofwgkta",
                            "id": "h0gwb5m",
                            "parent_id": "t1_h0g2k7d",
                            "score": 2,
                            "created_utc": 1622744308.0,
                            "replies": [
                                {
                                    "body": "Nah, when naruto hit 8 (almost 9) tails while fighting Pain, Yamato could see the tails the whole time even though he was not in the leaf village at all",
                                    "author": "coopstar777",
                                    "id": "h0idvwj",
                                    "parent_id": "t1_h0gwb5m",
                                    "score": 2,
                                    "created_utc": 1622768304.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Kakashi and Yamato have the anbu tattoo",
                    "author": "MikelDaPickle",
                    "id": "h0iie5k",
                    "parent_id": "t1_h0g1jl2",
                    "score": 4,
                    "created_utc": 1622770521.0,
                    "replies": []
                },
                {
                    "body": "Anbu tattoo: crying in the corner",
                    "author": "anime_gamerr",
                    "id": "h0hwu58",
                    "parent_id": "t1_h0g1jl2",
                    "score": 2,
                    "created_utc": 1622759991.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h0h0zyo",
                    "parent_id": "t1_h0g1jl2",
                    "score": 1,
                    "created_utc": 1622746256.0,
                    "replies": [
                        {
                            "body": "Yes in those episodes, Danzo said he wouldn't remove the curse mark from him though when Kakashi and Hiruzen came to get him.",
                            "author": "SmallerBork",
                            "id": "h0h4gb2",
                            "parent_id": "t1_h0h0zyo",
                            "score": 1,
                            "created_utc": 1622747727.0,
                            "replies": [
                                {
                                    "body": "After rewatching the scene, I can confirm that you are right. I'll delete my previous comment in order not to cause confusion.",
                                    "author": "Thely4i",
                                    "id": "h0h92f8",
                                    "parent_id": "t1_h0h4gb2",
                                    "score": 2,
                                    "created_utc": 1622749706.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn, Sasuke had the time to leave before Sakura could even join",
            "author": "ScyperRim",
            "id": "h0geq2p",
            "parent_id": "t3_nre7i0",
            "score": 57,
            "created_utc": 1622737034.0,
            "replies": []
        },
        {
            "body": "Bet Ino is glad Sai's tattoo is gone, she didn't want to see that every time she was about to get eaten",
            "author": "BigStinkyNipples",
            "id": "h0h0hj4",
            "parent_id": "t3_nre7i0",
            "score": 30,
            "created_utc": 1622746046.0,
            "replies": [
                {
                    "body": "That's an interesting username",
                    "author": "cjs1298",
                    "id": "h0i5n7o",
                    "parent_id": "t1_h0h0hj4",
                    "score": 17,
                    "created_utc": 1622764314.0,
                    "replies": []
                },
                {
                    "body": "Hahahaha yeah you are right",
                    "author": "potlu_party",
                    "id": "h0h0nu2",
                    "parent_id": "t1_h0h0hj4",
                    "score": 5,
                    "created_utc": 1622746117.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. Never really taught of this.\nAlso, did Sai really have a tongue 'tattoo'?",
            "author": null,
            "id": "h0gmy8f",
            "parent_id": "t3_nre7i0",
            "score": 23,
            "created_utc": 1622740471.0,
            "replies": [
                {
                    "body": "Yeah , he had , danzo gave it to every foundation member",
                    "author": "potlu_party",
                    "id": "h0gos6q",
                    "parent_id": "t1_h0gmy8f",
                    "score": 36,
                    "created_utc": 1622741226.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t forget about Kakashi’s tattoo. Could’ve included the Sensei’s as well.",
            "author": "BeardedMedic99",
            "id": "h0gx9ny",
            "parent_id": "t3_nre7i0",
            "score": 15,
            "created_utc": 1622744707.0,
            "replies": []
        },
        {
            "body": "Sai ahegao😳😳😳😳😳😳😳",
            "author": "Danizin_Jeronzin",
            "id": "h0gx3bz",
            "parent_id": "t3_nre7i0",
            "score": 22,
            "created_utc": 1622744631.0,
            "replies": []
        },
        {
            "body": "sakura is the only one who keep the tattoo .",
            "author": "AndreiCezar",
            "id": "h0gi3hs",
            "parent_id": "t3_nre7i0",
            "score": 7,
            "created_utc": 1622738452.0,
            "replies": [
                {
                    "body": "Naruto still has his tattoo. Its what keep kurama inside him",
                    "author": "not_some_username",
                    "id": "h0jtb5w",
                    "parent_id": "t1_h0gi3hs",
                    "score": 5,
                    "created_utc": 1622801395.0,
                    "replies": [
                        {
                            "body": "oh sweet summer child",
                            "author": "iinaomii",
                            "id": "h0p3god",
                            "parent_id": "t1_h0jtb5w",
                            "score": 3,
                            "created_utc": 1622907833.0,
                            "replies": [
                                {
                                    "body": "Dont take it out of context you pervert",
                                    "author": "not_some_username",
                                    "id": "h0ssgq0",
                                    "parent_id": "t1_h0p3god",
                                    "score": 2,
                                    "created_utc": 1622990738.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have a birth mark",
            "author": "Pure-Painter-5129",
            "id": "h0h9pvo",
            "parent_id": "t3_nre7i0",
            "score": 3,
            "created_utc": 1622749975.0,
            "replies": []
        },
        {
            "body": "Yo, even Kakashi has a sick tat too.",
            "author": "MrSourPatchMan",
            "id": "h0hlrpc",
            "parent_id": "t3_nre7i0",
            "score": 3,
            "created_utc": 1622755065.0,
            "replies": []
        },
        {
            "body": "Oh guess I'm on team 7 now. (Heavens Curse on my shoulder)",
            "author": "PickledRicks",
            "id": "h0grocf",
            "parent_id": "t3_nre7i0",
            "score": 6,
            "created_utc": 1622742407.0,
            "replies": [
                {
                    "body": "Congrats",
                    "author": "potlu_party",
                    "id": "h0gufjm",
                    "parent_id": "t1_h0grocf",
                    "score": 4,
                    "created_utc": 1622743529.0,
                    "replies": []
                },
                {
                    "body": "Same here",
                    "author": "savethesnails42",
                    "id": "h0gvxym",
                    "parent_id": "t1_h0grocf",
                    "score": 1,
                    "created_utc": 1622744155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How can't I see that",
            "author": "Ehkaweeb",
            "id": "h0grdob",
            "parent_id": "t3_nre7i0",
            "score": 5,
            "created_utc": 1622742286.0,
            "replies": []
        },
        {
            "body": "Kakashi has no sweet tats :(",
            "author": "GoodboyGotter",
            "id": "h0g0d78",
            "parent_id": "t3_nre7i0",
            "score": 11,
            "created_utc": 1622731109.0,
            "replies": [
                {
                    "body": "No, he has the anbu tattoo\n\nu/potlu_party",
                    "author": "SmallerBork",
                    "id": "h0g1lm6",
                    "parent_id": "t1_h0g0d78",
                    "score": 46,
                    "created_utc": 1622731629.0,
                    "replies": [
                        {
                            "body": "Oh yeah , now I remember",
                            "author": "potlu_party",
                            "id": "h0g724l",
                            "parent_id": "t1_h0g1lm6",
                            "score": 8,
                            "created_utc": 1622733887.0,
                            "replies": []
                        },
                        {
                            "body": "Not anymore iirc",
                            "author": "GoodboyGotter",
                            "id": "h0g5g9g",
                            "parent_id": "t1_h0g1lm6",
                            "score": -10,
                            "created_utc": 1622733236.0,
                            "replies": [
                                {
                                    "body": "No they keep them for life",
                                    "author": "SmallerBork",
                                    "id": "h0g5y54",
                                    "parent_id": "t1_h0g5g9g",
                                    "score": 10,
                                    "created_utc": 1622733440.0,
                                    "replies": [
                                        {
                                            "body": "Prove it",
                                            "author": "GoodboyGotter",
                                            "id": "h0g62eu",
                                            "parent_id": "t1_h0g5y54",
                                            "score": -19,
                                            "created_utc": 1622733488.0,
                                            "replies": [
                                                {
                                                    "body": "No you prove when he got it lasered off. We see him have it when in the hospital after he's no longer an anbu.\n\nWhy get rid of it later rather than immediately after he stopped being an anbu. They're like Navy Seals and other special forces, they don't just get rid of the insignia they earned.",
                                                    "author": "SmallerBork",
                                                    "id": "h0g83up",
                                                    "parent_id": "t1_h0g62eu",
                                                    "score": 22,
                                                    "created_utc": 1622734322.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fuck it , enjoy the meme",
                                                            "author": "potlu_party",
                                                            "id": "h0gve2c",
                                                            "parent_id": "t1_h0g83up",
                                                            "score": 5,
                                                            "created_utc": 1622743925.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He has , on the eye(when it was cut)",
                    "author": "potlu_party",
                    "id": "h0g0tzu",
                    "parent_id": "t1_h0g0d78",
                    "score": 3,
                    "created_utc": 1622731306.0,
                    "replies": [
                        {
                            "body": "Scars are not tats",
                            "author": "GoodboyGotter",
                            "id": "h0g5dby",
                            "parent_id": "t1_h0g0tzu",
                            "score": 6,
                            "created_utc": 1622733202.0,
                            "replies": [
                                {
                                    "body": "blood tats.",
                                    "author": "nicostein",
                                    "id": "h0gjcxv",
                                    "parent_id": "t1_h0g5dby",
                                    "score": 11,
                                    "created_utc": 1622738978.0,
                                    "replies": [
                                        {
                                            "body": "Gonna have problems with anyone with Crips tats",
                                            "author": "DisneyPrincessDVorah",
                                            "id": "h0gy723",
                                            "parent_id": "t1_h0gjcxv",
                                            "score": 6,
                                            "created_utc": 1622745093.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Maybe, he has a tramp stamp...",
                    "author": "Aweguy1998",
                    "id": "h0gux3u",
                    "parent_id": "t1_h0g0d78",
                    "score": 1,
                    "created_utc": 1622743729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pain gave Kakashi a tattoo too but he pushed the needle in too hard.",
            "author": "Any-Throat-2645",
            "id": "h0ilcgt",
            "parent_id": "t3_nre7i0",
            "score": 2,
            "created_utc": 1622772011.0,
            "replies": []
        },
        {
            "body": "Where Kakashi?",
            "author": "Moudy47",
            "id": "h0gx7zp",
            "parent_id": "t3_nre7i0",
            "score": 2,
            "created_utc": 1622744686.0,
            "replies": [
                {
                    "body": "No space",
                    "author": "potlu_party",
                    "id": "h0gyv3c",
                    "parent_id": "t1_h0gx7zp",
                    "score": 2,
                    "created_utc": 1622745372.0,
                    "replies": [
                        {
                            "body": "You know, six-panel comics are a thing.",
                            "author": "DagitabPH",
                            "id": "h0hqegb",
                            "parent_id": "t1_h0gyv3c",
                            "score": 2,
                            "created_utc": 1622757026.0,
                            "replies": []
                        },
                        {
                            "body": "Remove the trash can or the pale sheep",
                            "author": "Moudy47",
                            "id": "h0h06s8",
                            "parent_id": "t1_h0gyv3c",
                            "score": -4,
                            "created_utc": 1622745923.0,
                            "replies": [
                                {
                                    "body": "Cease fire",
                                    "author": "Va_Mukuwane",
                                    "id": "h0h9ijo",
                                    "parent_id": "t1_h0h06s8",
                                    "score": 7,
                                    "created_utc": 1622749891.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And kakashi?",
            "author": "SecretumOmega-IsLost",
            "id": "h0gpwsu",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622741688.0,
            "replies": [
                {
                    "body": "Annu tattoo on his shoulder",
                    "author": "PZYCLON369",
                    "id": "h0gqzty",
                    "parent_id": "t1_h0gpwsu",
                    "score": 6,
                    "created_utc": 1622742130.0,
                    "replies": [
                        {
                            "body": "Ohhh",
                            "author": "SecretumOmega-IsLost",
                            "id": "h0h4dzd",
                            "parent_id": "t1_h0gqzty",
                            "score": 1,
                            "created_utc": 1622747701.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "wait what does sai’s tattoo represent i forgot isnt it like a seal for his words?",
            "author": "Racist_Azerbaijan",
            "id": "h0gsf9g",
            "parent_id": "t3_nre7i0",
            "score": -4,
            "created_utc": 1622742714.0,
            "replies": [
                {
                    "body": "Sorry I won't talk to you , you are racist",
                    "author": "potlu_party",
                    "id": "h0guted",
                    "parent_id": "t1_h0gsf9g",
                    "score": 4,
                    "created_utc": 1622743685.0,
                    "replies": [
                        {
                            "body": "…You just did.",
                            "author": "DagitabPH",
                            "id": "h0hqlb5",
                            "parent_id": "t1_h0guted",
                            "score": -1,
                            "created_utc": 1622757111.0,
                            "replies": [
                                {
                                    "body": "It was a joke",
                                    "author": "potlu_party",
                                    "id": "h0j0vzb",
                                    "parent_id": "t1_h0hqlb5",
                                    "score": 1,
                                    "created_utc": 1622779843.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What about kakashi",
            "author": "TrimStream",
            "id": "h0gzt3n",
            "parent_id": "t3_nre7i0",
            "score": 0,
            "created_utc": 1622745764.0,
            "replies": []
        },
        {
            "body": "What about kakashi and Yamato",
            "author": "Disastrous-Target654",
            "id": "h0h9x2q",
            "parent_id": "t3_nre7i0",
            "score": 0,
            "created_utc": 1622750057.0,
            "replies": []
        },
        {
            "body": "Sorry but this is a repost\nWe dont tolerate repost",
            "author": "saadi_mahdi",
            "id": "h0jqjgh",
            "parent_id": "t3_nre7i0",
            "score": 0,
            "created_utc": 1622798956.0,
            "replies": []
        },
        {
            "body": "lmfao",
            "author": "AquaTwo",
            "id": "h0jsffb",
            "parent_id": "t3_nre7i0",
            "score": 0,
            "created_utc": 1622800633.0,
            "replies": []
        },
        {
            "body": "Sounds about right. lol",
            "author": "LIMELIMBO",
            "id": "h0h03gx",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622745884.0,
            "replies": []
        },
        {
            "body": "And Kakashi with the arm tattoo too",
            "author": "ThePhenomNoku",
            "id": "h0hmusc",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622755407.0,
            "replies": []
        },
        {
            "body": "At what episode does Sakura get her tattoo",
            "author": "WhiteninjaAlex",
            "id": "h0hth5e",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622758366.0,
            "replies": [
                {
                    "body": "Should be 373",
                    "author": "General_War5917",
                    "id": "h0j1fpo",
                    "parent_id": "t1_h0hth5e",
                    "score": 1,
                    "created_utc": 1622780168.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Stick the tat to make it slap",
            "author": "Cryptic3CH0",
            "id": "h0hvxn8",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622759555.0,
            "replies": []
        },
        {
            "body": "Anbu tattoo: crying in the corner",
            "author": "anime_gamerr",
            "id": "h0hwyih",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622760050.0,
            "replies": []
        },
        {
            "body": "Sasukes is a magic hickey not a tattoo",
            "author": "betweenboundary",
            "id": "h0i4eyn",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622763701.0,
            "replies": []
        },
        {
            "body": "Fucking mission winnow Sai",
            "author": "-T1mme-",
            "id": "h0i53gd",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622764043.0,
            "replies": []
        },
        {
            "body": "Kakashi has the ANBU one on his shoulder as well so he fits right in",
            "author": "FalloutLover7",
            "id": "h0iat3p",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622766880.0,
            "replies": []
        },
        {
            "body": "Same as with Team Sarutobi the sannin :) But it's more about make up for the lads while Tsunade has the tattoo/gem plus makeup",
            "author": "Zuukal",
            "id": "h0if66w",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622768887.0,
            "replies": [
                {
                    "body": ":D",
                    "author": "comfort_bot_1962",
                    "id": "h0ig08l",
                    "parent_id": "t1_h0if66w",
                    "score": 1,
                    "created_utc": 1622769307.0,
                    "replies": [
                        {
                            "body": "Thanks comfort bot! I am comforted.\n\nGood bot~",
                            "author": "Zuukal",
                            "id": "h0igba1",
                            "parent_id": "t1_h0ig08l",
                            "score": 1,
                            "created_utc": 1622769463.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ":D",
                    "author": "comfort_bot_1962",
                    "id": "h0iouop",
                    "parent_id": "t1_h0if66w",
                    "score": 1,
                    "created_utc": 1622773635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Both sasuke and sai don’t have “tats” anymore tho and Sakura only recently got hers. Naruto the only one who’s had his since day 1",
            "author": "donniesuave",
            "id": "h0imnav",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622772601.0,
            "replies": [
                {
                    "body": "Recently? it’s been over 20 years like bruh",
                    "author": "GroovyCookie08",
                    "id": "h0jf0tu",
                    "parent_id": "t1_h0imnav",
                    "score": 1,
                    "created_utc": 1622789038.0,
                    "replies": [
                        {
                            "body": "20 years??",
                            "author": "donniesuave",
                            "id": "h0k43ev",
                            "parent_id": "t1_h0jf0tu",
                            "score": 1,
                            "created_utc": 1622808696.0,
                            "replies": [
                                {
                                    "body": "My b for replying like a day late but yeah she got hears almost 20 years ago",
                                    "author": "GroovyCookie08",
                                    "id": "h0raqgk",
                                    "parent_id": "t1_h0k43ev",
                                    "score": 1,
                                    "created_utc": 1622949908.0,
                                    "replies": [
                                        {
                                            "body": "Time skip?",
                                            "author": "donniesuave",
                                            "id": "h0s35re",
                                            "parent_id": "t1_h0raqgk",
                                            "score": 1,
                                            "created_utc": 1622973206.0,
                                            "replies": [
                                                {
                                                    "body": "Yup",
                                                    "author": "GroovyCookie08",
                                                    "id": "h0tnerh",
                                                    "parent_id": "t1_h0s35re",
                                                    "score": 1,
                                                    "created_utc": 1623005685.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmaoooo",
            "author": "Socalvibin-88",
            "id": "h0iodc9",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622773398.0,
            "replies": []
        },
        {
            "body": "Damn, I kinda forgot Sai had one.",
            "author": "Intelligent-Win-4517",
            "id": "h0ivbb6",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622776830.0,
            "replies": []
        },
        {
            "body": "They didn’t even show kakashi’s tattoo or Yamato",
            "author": "Jorddan97",
            "id": "h0iyggt",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622778494.0,
            "replies": []
        },
        {
            "body": "what about kakashi",
            "author": null,
            "id": "h0jl8bq",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622794241.0,
            "replies": []
        },
        {
            "body": "kakashi?",
            "author": "Projeffboy",
            "id": "h0jnoy5",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622796408.0,
            "replies": []
        },
        {
            "body": "May be wrong, but didn’t Sasuke lose his after reviving Orochimaru?",
            "author": "Sonicmaster06",
            "id": "h0jrymp",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622800224.0,
            "replies": [
                {
                    "body": "He lost his when Itachi used the Totsuka blade on Orochimaru and ripped him out of Sasuke's body",
                    "author": "gotumms146",
                    "id": "h0yn4ry",
                    "parent_id": "t1_h0jrymp",
                    "score": 1,
                    "created_utc": 1623103702.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "so that's why sasuke wanted to kill danzo",
            "author": "Expert-Drawer978",
            "id": "h0jv0ti",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1622802811.0,
            "replies": []
        },
        {
            "body": "Is Sai considered Anbu?",
            "author": null,
            "id": "h6k34ym",
            "parent_id": "t3_nre7i0",
            "score": 1,
            "created_utc": 1627278978.0,
            "replies": []
        },
        {
            "body": "Danzo died, its not his fault man :(",
            "author": "potlu_party",
            "id": "h0fwdx0",
            "parent_id": "t1_h0fw6xf",
            "score": 276,
            "created_utc": 1622729414.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h0jb6k5",
                    "parent_id": "t1_h0fwdx0",
                    "score": -15,
                    "created_utc": 1622786175.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Worth it to be free of Danzo.\n\nTeam 7 dissolved though. Sakura became chief medical ninja, Naruto became Hokage, Kakashi retired, and Sasuke is travelling the multiverse.",
            "author": "SmallerBork",
            "id": "h0g1gd7",
            "parent_id": "t1_h0fw6xf",
            "score": 332,
            "created_utc": 1622731567.0,
            "replies": [
                {
                    "body": "Is that really \"dissolved\"? Imo \"dissolved\" is the sannin, where they just went and did their own thing. Team 7 is all serving the village, except kakashi after his hokage term",
                    "author": "WindyCityAssasin2",
                    "id": "h0guxh3",
                    "parent_id": "t1_h0g1gd7",
                    "score": 128,
                    "created_utc": 1622743733.0,
                    "replies": [
                        {
                            "body": "I think it fits, Team 7 is a squad and as hokage Naruto's not doing traditional missions  and if he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\noh wait Shin arc, nevermind",
                            "author": "whitey-ofwgkta",
                            "id": "h0gvta2",
                            "parent_id": "t1_h0guxh3",
                            "score": 67,
                            "created_utc": 1622744101.0,
                            "replies": [
                                {
                                    "body": "That wasn't a mission though. It just kinda happened because Sakura refused to explain anything to Sarada.",
                                    "author": "SmallerBork",
                                    "id": "h0gwnaw",
                                    "parent_id": "t1_h0gvta2",
                                    "score": 38,
                                    "created_utc": 1622744447.0,
                                    "replies": [
                                        {
                                            "body": "Because sasuke asked her not to",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0h8dqt",
                                            "parent_id": "t1_h0gwnaw",
                                            "score": 18,
                                            "created_utc": 1622749416.0,
                                            "replies": [
                                                {
                                                    "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
                                                    "author": "SmallerBork",
                                                    "id": "h0hn54p",
                                                    "parent_id": "t1_h0h8dqt",
                                                    "score": 14,
                                                    "created_utc": 1622755538.0,
                                                    "replies": [
                                                        {
                                                            "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                                                            "author": "WindyCityAssasin2",
                                                            "id": "h0hubbx",
                                                            "parent_id": "t1_h0hn54p",
                                                            "score": 14,
                                                            "created_utc": 1622758768.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                                                                    "author": "SmallerBork",
                                                                    "id": "h0hzo0s",
                                                                    "parent_id": "t1_h0hubbx",
                                                                    "score": 5,
                                                                    "created_utc": 1622761331.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                                                            "author": "WindyCityAssasin2",
                                                                            "id": "h0i3dwh",
                                                                            "parent_id": "t1_h0hzo0s",
                                                                            "score": 5,
                                                                            "created_utc": 1622763188.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                                                                    "author": "SmallerBork",
                                                                                    "id": "h0iu9bs",
                                                                                    "parent_id": "t1_h0i3dwh",
                                                                                    "score": 2,
                                                                                    "created_utc": 1622776311.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                                                            "author": "WindyCityAssasin2",
                                                                                            "id": "h0iz5w8",
                                                                                            "parent_id": "t1_h0iu9bs",
                                                                                            "score": 3,
                                                                                            "created_utc": 1622778867.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\nWym?",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0gwp5a",
                                    "parent_id": "t1_h0gvta2",
                                    "score": 5,
                                    "created_utc": 1622744468.0,
                                    "replies": [
                                        {
                                            "body": "talking out of my ass but I feel like if Naruto had to go on a non-diplomatic mission and he needed a 3-man squad there would be a convenient reason that it wouldn't be either version of team-7",
                                            "author": "whitey-ofwgkta",
                                            "id": "h0gxcx8",
                                            "parent_id": "t1_h0gwp5a",
                                            "score": 9,
                                            "created_utc": 1622744745.0,
                                            "replies": [
                                                {
                                                    "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
                                                    "author": "WindyCityAssasin2",
                                                    "id": "h0gy3fb",
                                                    "parent_id": "t1_h0gxcx8",
                                                    "score": 17,
                                                    "created_utc": 1622745051.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
                                                    "author": null,
                                                    "id": "h0h9kge",
                                                    "parent_id": "t1_h0gxcx8",
                                                    "score": 5,
                                                    "created_utc": 1622749913.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well Kakashi does investigate stuff like Danzo's legacy and the kidnappings by the Hidan fanboy but officially he's retired.\n\nTeam 7 is dissolved because they don't go on missions together anymore. If they did, Konohamaru's team couldn't have the number.",
                            "author": "SmallerBork",
                            "id": "h0gwibw",
                            "parent_id": "t1_h0guxh3",
                            "score": 12,
                            "created_utc": 1622744390.0,
                            "replies": [
                                {
                                    "body": "Yeah but by that logic isn't *every* old gen team dissolved?",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0gwv52",
                                    "parent_id": "t1_h0gwibw",
                                    "score": 7,
                                    "created_utc": 1622744536.0,
                                    "replies": [
                                        {
                                            "body": "Yes, that's what I'm saying.",
                                            "author": "SmallerBork",
                                            "id": "h0gxqor",
                                            "parent_id": "t1_h0gwv52",
                                            "score": 6,
                                            "created_utc": 1622744904.0,
                                            "replies": [
                                                {
                                                    "body": "Oh ok I missed ur point",
                                                    "author": "WindyCityAssasin2",
                                                    "id": "h0gy63u",
                                                    "parent_id": "t1_h0gxqor",
                                                    "score": 2,
                                                    "created_utc": 1622745082.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I mean Kakashi is still helping out around the village, he has been advising Naruto and helped teach some of the children",
                            "author": "AutistChan",
                            "id": "h0hzqhb",
                            "parent_id": "t1_h0guxh3",
                            "score": 1,
                            "created_utc": 1622761364.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And Sai became Director of the ANBU.",
                    "author": "Accomplished-Cycle73",
                    "id": "h0ghewd",
                    "parent_id": "t1_h0g1gd7",
                    "score": 57,
                    "created_utc": 1622738164.0,
                    "replies": []
                },
                {
                    "body": "Wait is Sasuke actually traveling the multiverse? Cuz I thought he was teleporting around the world. If he has enough chakra to travel the multiverse, how he always running out of chakra in small fights in Boruto?",
                    "author": null,
                    "id": "h0i99nz",
                    "parent_id": "t1_h0g1gd7",
                    "score": 6,
                    "created_utc": 1622766122.0,
                    "replies": [
                        {
                            "body": "It's stated that Otsutsuki exist outside their dimension. If he were just traveling around the world, anyone could investigate them since there are other transportation jutsu.\n\nIt could easily just be other planets in that universe, but that's not what's been established.\n\nAs for running out of chakra, they nerfed him sadly. There are a lot of things that don't make sense like Sakura having a picture of Sasuke with team Taka in Akatsuki cloaks. Sarada doesn't know that Orochimaru attacked the village and killed Hiruzen. This isn't exclusive to Boruto though, Naruto and Sasuke didn't know who Madara was before Kurama told them.",
                            "author": "SmallerBork",
                            "id": "h0isk79",
                            "parent_id": "t1_h0i99nz",
                            "score": 4,
                            "created_utc": 1622775463.0,
                            "replies": [
                                {
                                    "body": "That just reflects badly on the education system tho",
                                    "author": "ulfric_stormcloack",
                                    "id": "h0jkcse",
                                    "parent_id": "t1_h0isk79",
                                    "score": 1,
                                    "created_utc": 1622793486.0,
                                    "replies": [
                                        {
                                            "body": "Even without learning it in school, the characters should have heard about it from their parents.\n\nIt's possible they tried to cover it up, but that's like the government trying to hide the fact that 9/11 even happened.",
                                            "author": "SmallerBork",
                                            "id": "h0kqb3c",
                                            "parent_id": "t1_h0jkcse",
                                            "score": 2,
                                            "created_utc": 1622819465.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nah sasukes looking for ONE PEICE!!!",
                    "author": "soupgogg2459",
                    "id": "h0h2ni4",
                    "parent_id": "t1_h0g1gd7",
                    "score": 2,
                    "created_utc": 1622746953.0,
                    "replies": []
                },
                {
                    "body": "sasuke is doing what?",
                    "author": "ulfric_stormcloack",
                    "id": "h0jk9gj",
                    "parent_id": "t1_h0g1gd7",
                    "score": 1,
                    "created_utc": 1622793408.0,
                    "replies": [
                        {
                            "body": "His wormhole jutsu let's him leave Earth. Where'd you think he was going to find information on the Otsutsuki?\n\nhttps://naruto.fandom.com/wiki/Unidentified_World\n\nhttps://naruto.fandom.com/wiki/Momoshiki%27s_Planet",
                            "author": "SmallerBork",
                            "id": "h0kr4l1",
                            "parent_id": "t1_h0jk9gj",
                            "score": 2,
                            "created_utc": 1622819828.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sasuke also removed his curse mark?",
            "author": "SSj3Rambo",
            "id": "h0gnfn3",
            "parent_id": "t1_h0fw6xf",
            "score": 27,
            "created_utc": 1622740672.0,
            "replies": [
                {
                    "body": "Itachi removed it for him iirc",
                    "author": null,
                    "id": "h0i9bpy",
                    "parent_id": "t1_h0gnfn3",
                    "score": 5,
                    "created_utc": 1622766151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Correct me if I'm wrong but doesn't Sai,Kakashi and Yamato have the mark of the Anbu Black Ops?",
            "author": "FinalSusanoo7",
            "id": "h0h44rx",
            "parent_id": "t1_h0fw6xf",
            "score": 7,
            "created_utc": 1622747592.0,
            "replies": []
        },
        {
            "body": "He don’t care, he gets to pipe Ino he goochi",
            "author": "l4dlouis",
            "id": "h0h9weu",
            "parent_id": "t1_h0fw6xf",
            "score": 6,
            "created_utc": 1622750050.0,
            "replies": []
        },
        {
            "body": "Oh yeah. Sasuke too. \n\nwelp... they can start like.. shadow team 07. \n\nwith kakashi and yamato. ooh..",
            "author": "Purplegrey_ink",
            "id": "h0gwxpa",
            "parent_id": "t1_h0fw6xf",
            "score": 2,
            "created_utc": 1622744566.0,
            "replies": []
        },
        {
            "body": "but same thing with sasuke no?",
            "author": "jstabs7",
            "id": "h0hm2l3",
            "parent_id": "t1_h0fw6xf",
            "score": 1,
            "created_utc": 1622755197.0,
            "replies": []
        },
        {
            "body": "Does Yamato still get the hand notification if Naruto goes into tailed beast mode after Naruto became friends with Kurama?",
            "author": "MisterTeapot",
            "id": "h0g2k7d",
            "parent_id": "t1_h0g1jl2",
            "score": 103,
            "created_utc": 1622732027.0,
            "replies": [
                {
                    "body": "From what I read on the wiki, it was the necklace activating that showed that to him. It was never explained how that happened in the anime though.",
                    "author": "SmallerBork",
                    "id": "h0g40fn",
                    "parent_id": "t1_h0g2k7d",
                    "score": 65,
                    "created_utc": 1622732634.0,
                    "replies": [
                        {
                            "body": "I’m assuming Tsunade set that up",
                            "author": "agonizedn",
                            "id": "h0gx7hi",
                            "parent_id": "t1_h0g40fn",
                            "score": 28,
                            "created_utc": 1622744680.0,
                            "replies": [
                                {
                                    "body": "Ya that's a good theory actually. What would she have done if Naruto lost that bet though?\n\nIruka, Kakashi, and Jiraiya were Father figures to him. She's the closest thing he had to a Mother. I wish they'd developed that a little more.",
                                    "author": "SmallerBork",
                                    "id": "h0gxl0w",
                                    "parent_id": "t1_h0gx7hi",
                                    "score": 32,
                                    "created_utc": 1622744839.0,
                                    "replies": [
                                        {
                                            "body": "Man that’s so true. Kishimoto really wasted their relationship in past part 1. It was really sweet how much Naruto ended up meaning to Tsunade and not much was really done with it.",
                                            "author": "Kazewatch",
                                            "id": "h0h54sh",
                                            "parent_id": "t1_h0gxl0w",
                                            "score": 21,
                                            "created_utc": 1622748017.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "But the stone was Hashirama's i thought? And i thought it alerted Yamato cuz he also had Hashirama Cells™️",
                                    "author": null,
                                    "id": "h0gz9qs",
                                    "parent_id": "t1_h0gx7hi",
                                    "score": 13,
                                    "created_utc": 1622745540.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Imagine Yamato not knowing Naruto became friends with Kurama and trying to supress Naruto getting into tailed beast mode",
                    "author": "wisdomsharerv2",
                    "id": "h0h4xio",
                    "parent_id": "t1_h0g2k7d",
                    "score": 10,
                    "created_utc": 1622747933.0,
                    "replies": []
                },
                {
                    "body": "I thought that only showed up *while* he was using his Tailed Beast suppression jutsu",
                    "author": "whitey-ofwgkta",
                    "id": "h0gwb5m",
                    "parent_id": "t1_h0g2k7d",
                    "score": 2,
                    "created_utc": 1622744308.0,
                    "replies": [
                        {
                            "body": "Nah, when naruto hit 8 (almost 9) tails while fighting Pain, Yamato could see the tails the whole time even though he was not in the leaf village at all",
                            "author": "coopstar777",
                            "id": "h0idvwj",
                            "parent_id": "t1_h0gwb5m",
                            "score": 2,
                            "created_utc": 1622768304.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kakashi and Yamato have the anbu tattoo",
            "author": "MikelDaPickle",
            "id": "h0iie5k",
            "parent_id": "t1_h0g1jl2",
            "score": 4,
            "created_utc": 1622770521.0,
            "replies": []
        },
        {
            "body": "Anbu tattoo: crying in the corner",
            "author": "anime_gamerr",
            "id": "h0hwu58",
            "parent_id": "t1_h0g1jl2",
            "score": 2,
            "created_utc": 1622759991.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h0h0zyo",
            "parent_id": "t1_h0g1jl2",
            "score": 1,
            "created_utc": 1622746256.0,
            "replies": [
                {
                    "body": "Yes in those episodes, Danzo said he wouldn't remove the curse mark from him though when Kakashi and Hiruzen came to get him.",
                    "author": "SmallerBork",
                    "id": "h0h4gb2",
                    "parent_id": "t1_h0h0zyo",
                    "score": 1,
                    "created_utc": 1622747727.0,
                    "replies": [
                        {
                            "body": "After rewatching the scene, I can confirm that you are right. I'll delete my previous comment in order not to cause confusion.",
                            "author": "Thely4i",
                            "id": "h0h92f8",
                            "parent_id": "t1_h0h4gb2",
                            "score": 2,
                            "created_utc": 1622749706.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's an interesting username",
            "author": "cjs1298",
            "id": "h0i5n7o",
            "parent_id": "t1_h0h0hj4",
            "score": 17,
            "created_utc": 1622764314.0,
            "replies": []
        },
        {
            "body": "Hahahaha yeah you are right",
            "author": "potlu_party",
            "id": "h0h0nu2",
            "parent_id": "t1_h0h0hj4",
            "score": 5,
            "created_utc": 1622746117.0,
            "replies": []
        },
        {
            "body": "Yeah , he had , danzo gave it to every foundation member",
            "author": "potlu_party",
            "id": "h0gos6q",
            "parent_id": "t1_h0gmy8f",
            "score": 36,
            "created_utc": 1622741226.0,
            "replies": []
        },
        {
            "body": "Naruto still has his tattoo. Its what keep kurama inside him",
            "author": "not_some_username",
            "id": "h0jtb5w",
            "parent_id": "t1_h0gi3hs",
            "score": 5,
            "created_utc": 1622801395.0,
            "replies": [
                {
                    "body": "oh sweet summer child",
                    "author": "iinaomii",
                    "id": "h0p3god",
                    "parent_id": "t1_h0jtb5w",
                    "score": 3,
                    "created_utc": 1622907833.0,
                    "replies": [
                        {
                            "body": "Dont take it out of context you pervert",
                            "author": "not_some_username",
                            "id": "h0ssgq0",
                            "parent_id": "t1_h0p3god",
                            "score": 2,
                            "created_utc": 1622990738.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congrats",
            "author": "potlu_party",
            "id": "h0gufjm",
            "parent_id": "t1_h0grocf",
            "score": 4,
            "created_utc": 1622743529.0,
            "replies": []
        },
        {
            "body": "Same here",
            "author": "savethesnails42",
            "id": "h0gvxym",
            "parent_id": "t1_h0grocf",
            "score": 1,
            "created_utc": 1622744155.0,
            "replies": []
        },
        {
            "body": "No, he has the anbu tattoo\n\nu/potlu_party",
            "author": "SmallerBork",
            "id": "h0g1lm6",
            "parent_id": "t1_h0g0d78",
            "score": 46,
            "created_utc": 1622731629.0,
            "replies": [
                {
                    "body": "Oh yeah , now I remember",
                    "author": "potlu_party",
                    "id": "h0g724l",
                    "parent_id": "t1_h0g1lm6",
                    "score": 8,
                    "created_utc": 1622733887.0,
                    "replies": []
                },
                {
                    "body": "Not anymore iirc",
                    "author": "GoodboyGotter",
                    "id": "h0g5g9g",
                    "parent_id": "t1_h0g1lm6",
                    "score": -10,
                    "created_utc": 1622733236.0,
                    "replies": [
                        {
                            "body": "No they keep them for life",
                            "author": "SmallerBork",
                            "id": "h0g5y54",
                            "parent_id": "t1_h0g5g9g",
                            "score": 10,
                            "created_utc": 1622733440.0,
                            "replies": [
                                {
                                    "body": "Prove it",
                                    "author": "GoodboyGotter",
                                    "id": "h0g62eu",
                                    "parent_id": "t1_h0g5y54",
                                    "score": -19,
                                    "created_utc": 1622733488.0,
                                    "replies": [
                                        {
                                            "body": "No you prove when he got it lasered off. We see him have it when in the hospital after he's no longer an anbu.\n\nWhy get rid of it later rather than immediately after he stopped being an anbu. They're like Navy Seals and other special forces, they don't just get rid of the insignia they earned.",
                                            "author": "SmallerBork",
                                            "id": "h0g83up",
                                            "parent_id": "t1_h0g62eu",
                                            "score": 22,
                                            "created_utc": 1622734322.0,
                                            "replies": [
                                                {
                                                    "body": "Fuck it , enjoy the meme",
                                                    "author": "potlu_party",
                                                    "id": "h0gve2c",
                                                    "parent_id": "t1_h0g83up",
                                                    "score": 5,
                                                    "created_utc": 1622743925.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He has , on the eye(when it was cut)",
            "author": "potlu_party",
            "id": "h0g0tzu",
            "parent_id": "t1_h0g0d78",
            "score": 3,
            "created_utc": 1622731306.0,
            "replies": [
                {
                    "body": "Scars are not tats",
                    "author": "GoodboyGotter",
                    "id": "h0g5dby",
                    "parent_id": "t1_h0g0tzu",
                    "score": 6,
                    "created_utc": 1622733202.0,
                    "replies": [
                        {
                            "body": "blood tats.",
                            "author": "nicostein",
                            "id": "h0gjcxv",
                            "parent_id": "t1_h0g5dby",
                            "score": 11,
                            "created_utc": 1622738978.0,
                            "replies": [
                                {
                                    "body": "Gonna have problems with anyone with Crips tats",
                                    "author": "DisneyPrincessDVorah",
                                    "id": "h0gy723",
                                    "parent_id": "t1_h0gjcxv",
                                    "score": 6,
                                    "created_utc": 1622745093.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe, he has a tramp stamp...",
            "author": "Aweguy1998",
            "id": "h0gux3u",
            "parent_id": "t1_h0g0d78",
            "score": 1,
            "created_utc": 1622743729.0,
            "replies": []
        },
        {
            "body": "No space",
            "author": "potlu_party",
            "id": "h0gyv3c",
            "parent_id": "t1_h0gx7zp",
            "score": 2,
            "created_utc": 1622745372.0,
            "replies": [
                {
                    "body": "You know, six-panel comics are a thing.",
                    "author": "DagitabPH",
                    "id": "h0hqegb",
                    "parent_id": "t1_h0gyv3c",
                    "score": 2,
                    "created_utc": 1622757026.0,
                    "replies": []
                },
                {
                    "body": "Remove the trash can or the pale sheep",
                    "author": "Moudy47",
                    "id": "h0h06s8",
                    "parent_id": "t1_h0gyv3c",
                    "score": -4,
                    "created_utc": 1622745923.0,
                    "replies": [
                        {
                            "body": "Cease fire",
                            "author": "Va_Mukuwane",
                            "id": "h0h9ijo",
                            "parent_id": "t1_h0h06s8",
                            "score": 7,
                            "created_utc": 1622749891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Annu tattoo on his shoulder",
            "author": "PZYCLON369",
            "id": "h0gqzty",
            "parent_id": "t1_h0gpwsu",
            "score": 6,
            "created_utc": 1622742130.0,
            "replies": [
                {
                    "body": "Ohhh",
                    "author": "SecretumOmega-IsLost",
                    "id": "h0h4dzd",
                    "parent_id": "t1_h0gqzty",
                    "score": 1,
                    "created_utc": 1622747701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry I won't talk to you , you are racist",
            "author": "potlu_party",
            "id": "h0guted",
            "parent_id": "t1_h0gsf9g",
            "score": 4,
            "created_utc": 1622743685.0,
            "replies": [
                {
                    "body": "…You just did.",
                    "author": "DagitabPH",
                    "id": "h0hqlb5",
                    "parent_id": "t1_h0guted",
                    "score": -1,
                    "created_utc": 1622757111.0,
                    "replies": [
                        {
                            "body": "It was a joke",
                            "author": "potlu_party",
                            "id": "h0j0vzb",
                            "parent_id": "t1_h0hqlb5",
                            "score": 1,
                            "created_utc": 1622779843.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Should be 373",
            "author": "General_War5917",
            "id": "h0j1fpo",
            "parent_id": "t1_h0hth5e",
            "score": 1,
            "created_utc": 1622780168.0,
            "replies": []
        },
        {
            "body": ":D",
            "author": "comfort_bot_1962",
            "id": "h0ig08l",
            "parent_id": "t1_h0if66w",
            "score": 1,
            "created_utc": 1622769307.0,
            "replies": [
                {
                    "body": "Thanks comfort bot! I am comforted.\n\nGood bot~",
                    "author": "Zuukal",
                    "id": "h0igba1",
                    "parent_id": "t1_h0ig08l",
                    "score": 1,
                    "created_utc": 1622769463.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ":D",
            "author": "comfort_bot_1962",
            "id": "h0iouop",
            "parent_id": "t1_h0if66w",
            "score": 1,
            "created_utc": 1622773635.0,
            "replies": []
        },
        {
            "body": "Recently? it’s been over 20 years like bruh",
            "author": "GroovyCookie08",
            "id": "h0jf0tu",
            "parent_id": "t1_h0imnav",
            "score": 1,
            "created_utc": 1622789038.0,
            "replies": [
                {
                    "body": "20 years??",
                    "author": "donniesuave",
                    "id": "h0k43ev",
                    "parent_id": "t1_h0jf0tu",
                    "score": 1,
                    "created_utc": 1622808696.0,
                    "replies": [
                        {
                            "body": "My b for replying like a day late but yeah she got hears almost 20 years ago",
                            "author": "GroovyCookie08",
                            "id": "h0raqgk",
                            "parent_id": "t1_h0k43ev",
                            "score": 1,
                            "created_utc": 1622949908.0,
                            "replies": [
                                {
                                    "body": "Time skip?",
                                    "author": "donniesuave",
                                    "id": "h0s35re",
                                    "parent_id": "t1_h0raqgk",
                                    "score": 1,
                                    "created_utc": 1622973206.0,
                                    "replies": [
                                        {
                                            "body": "Yup",
                                            "author": "GroovyCookie08",
                                            "id": "h0tnerh",
                                            "parent_id": "t1_h0s35re",
                                            "score": 1,
                                            "created_utc": 1623005685.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He lost his when Itachi used the Totsuka blade on Orochimaru and ripped him out of Sasuke's body",
            "author": "gotumms146",
            "id": "h0yn4ry",
            "parent_id": "t1_h0jrymp",
            "score": 1,
            "created_utc": 1623103702.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h0jb6k5",
            "parent_id": "t1_h0fwdx0",
            "score": -15,
            "created_utc": 1622786175.0,
            "replies": []
        },
        {
            "body": "Is that really \"dissolved\"? Imo \"dissolved\" is the sannin, where they just went and did their own thing. Team 7 is all serving the village, except kakashi after his hokage term",
            "author": "WindyCityAssasin2",
            "id": "h0guxh3",
            "parent_id": "t1_h0g1gd7",
            "score": 128,
            "created_utc": 1622743733.0,
            "replies": [
                {
                    "body": "I think it fits, Team 7 is a squad and as hokage Naruto's not doing traditional missions  and if he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\noh wait Shin arc, nevermind",
                    "author": "whitey-ofwgkta",
                    "id": "h0gvta2",
                    "parent_id": "t1_h0guxh3",
                    "score": 67,
                    "created_utc": 1622744101.0,
                    "replies": [
                        {
                            "body": "That wasn't a mission though. It just kinda happened because Sakura refused to explain anything to Sarada.",
                            "author": "SmallerBork",
                            "id": "h0gwnaw",
                            "parent_id": "t1_h0gvta2",
                            "score": 38,
                            "created_utc": 1622744447.0,
                            "replies": [
                                {
                                    "body": "Because sasuke asked her not to",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0h8dqt",
                                    "parent_id": "t1_h0gwnaw",
                                    "score": 18,
                                    "created_utc": 1622749416.0,
                                    "replies": [
                                        {
                                            "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
                                            "author": "SmallerBork",
                                            "id": "h0hn54p",
                                            "parent_id": "t1_h0h8dqt",
                                            "score": 14,
                                            "created_utc": 1622755538.0,
                                            "replies": [
                                                {
                                                    "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                                                    "author": "WindyCityAssasin2",
                                                    "id": "h0hubbx",
                                                    "parent_id": "t1_h0hn54p",
                                                    "score": 14,
                                                    "created_utc": 1622758768.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                                                            "author": "SmallerBork",
                                                            "id": "h0hzo0s",
                                                            "parent_id": "t1_h0hubbx",
                                                            "score": 5,
                                                            "created_utc": 1622761331.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                                                    "author": "WindyCityAssasin2",
                                                                    "id": "h0i3dwh",
                                                                    "parent_id": "t1_h0hzo0s",
                                                                    "score": 5,
                                                                    "created_utc": 1622763188.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                                                            "author": "SmallerBork",
                                                                            "id": "h0iu9bs",
                                                                            "parent_id": "t1_h0i3dwh",
                                                                            "score": 2,
                                                                            "created_utc": 1622776311.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                                                    "author": "WindyCityAssasin2",
                                                                                    "id": "h0iz5w8",
                                                                                    "parent_id": "t1_h0iu9bs",
                                                                                    "score": 3,
                                                                                    "created_utc": 1622778867.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\nWym?",
                            "author": "WindyCityAssasin2",
                            "id": "h0gwp5a",
                            "parent_id": "t1_h0gvta2",
                            "score": 5,
                            "created_utc": 1622744468.0,
                            "replies": [
                                {
                                    "body": "talking out of my ass but I feel like if Naruto had to go on a non-diplomatic mission and he needed a 3-man squad there would be a convenient reason that it wouldn't be either version of team-7",
                                    "author": "whitey-ofwgkta",
                                    "id": "h0gxcx8",
                                    "parent_id": "t1_h0gwp5a",
                                    "score": 9,
                                    "created_utc": 1622744745.0,
                                    "replies": [
                                        {
                                            "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0gy3fb",
                                            "parent_id": "t1_h0gxcx8",
                                            "score": 17,
                                            "created_utc": 1622745051.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
                                            "author": null,
                                            "id": "h0h9kge",
                                            "parent_id": "t1_h0gxcx8",
                                            "score": 5,
                                            "created_utc": 1622749913.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well Kakashi does investigate stuff like Danzo's legacy and the kidnappings by the Hidan fanboy but officially he's retired.\n\nTeam 7 is dissolved because they don't go on missions together anymore. If they did, Konohamaru's team couldn't have the number.",
                    "author": "SmallerBork",
                    "id": "h0gwibw",
                    "parent_id": "t1_h0guxh3",
                    "score": 12,
                    "created_utc": 1622744390.0,
                    "replies": [
                        {
                            "body": "Yeah but by that logic isn't *every* old gen team dissolved?",
                            "author": "WindyCityAssasin2",
                            "id": "h0gwv52",
                            "parent_id": "t1_h0gwibw",
                            "score": 7,
                            "created_utc": 1622744536.0,
                            "replies": [
                                {
                                    "body": "Yes, that's what I'm saying.",
                                    "author": "SmallerBork",
                                    "id": "h0gxqor",
                                    "parent_id": "t1_h0gwv52",
                                    "score": 6,
                                    "created_utc": 1622744904.0,
                                    "replies": [
                                        {
                                            "body": "Oh ok I missed ur point",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0gy63u",
                                            "parent_id": "t1_h0gxqor",
                                            "score": 2,
                                            "created_utc": 1622745082.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean Kakashi is still helping out around the village, he has been advising Naruto and helped teach some of the children",
                    "author": "AutistChan",
                    "id": "h0hzqhb",
                    "parent_id": "t1_h0guxh3",
                    "score": 1,
                    "created_utc": 1622761364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And Sai became Director of the ANBU.",
            "author": "Accomplished-Cycle73",
            "id": "h0ghewd",
            "parent_id": "t1_h0g1gd7",
            "score": 57,
            "created_utc": 1622738164.0,
            "replies": []
        },
        {
            "body": "Wait is Sasuke actually traveling the multiverse? Cuz I thought he was teleporting around the world. If he has enough chakra to travel the multiverse, how he always running out of chakra in small fights in Boruto?",
            "author": null,
            "id": "h0i99nz",
            "parent_id": "t1_h0g1gd7",
            "score": 6,
            "created_utc": 1622766122.0,
            "replies": [
                {
                    "body": "It's stated that Otsutsuki exist outside their dimension. If he were just traveling around the world, anyone could investigate them since there are other transportation jutsu.\n\nIt could easily just be other planets in that universe, but that's not what's been established.\n\nAs for running out of chakra, they nerfed him sadly. There are a lot of things that don't make sense like Sakura having a picture of Sasuke with team Taka in Akatsuki cloaks. Sarada doesn't know that Orochimaru attacked the village and killed Hiruzen. This isn't exclusive to Boruto though, Naruto and Sasuke didn't know who Madara was before Kurama told them.",
                    "author": "SmallerBork",
                    "id": "h0isk79",
                    "parent_id": "t1_h0i99nz",
                    "score": 4,
                    "created_utc": 1622775463.0,
                    "replies": [
                        {
                            "body": "That just reflects badly on the education system tho",
                            "author": "ulfric_stormcloack",
                            "id": "h0jkcse",
                            "parent_id": "t1_h0isk79",
                            "score": 1,
                            "created_utc": 1622793486.0,
                            "replies": [
                                {
                                    "body": "Even without learning it in school, the characters should have heard about it from their parents.\n\nIt's possible they tried to cover it up, but that's like the government trying to hide the fact that 9/11 even happened.",
                                    "author": "SmallerBork",
                                    "id": "h0kqb3c",
                                    "parent_id": "t1_h0jkcse",
                                    "score": 2,
                                    "created_utc": 1622819465.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah sasukes looking for ONE PEICE!!!",
            "author": "soupgogg2459",
            "id": "h0h2ni4",
            "parent_id": "t1_h0g1gd7",
            "score": 2,
            "created_utc": 1622746953.0,
            "replies": []
        },
        {
            "body": "sasuke is doing what?",
            "author": "ulfric_stormcloack",
            "id": "h0jk9gj",
            "parent_id": "t1_h0g1gd7",
            "score": 1,
            "created_utc": 1622793408.0,
            "replies": [
                {
                    "body": "His wormhole jutsu let's him leave Earth. Where'd you think he was going to find information on the Otsutsuki?\n\nhttps://naruto.fandom.com/wiki/Unidentified_World\n\nhttps://naruto.fandom.com/wiki/Momoshiki%27s_Planet",
                    "author": "SmallerBork",
                    "id": "h0kr4l1",
                    "parent_id": "t1_h0jk9gj",
                    "score": 2,
                    "created_utc": 1622819828.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Itachi removed it for him iirc",
            "author": null,
            "id": "h0i9bpy",
            "parent_id": "t1_h0gnfn3",
            "score": 5,
            "created_utc": 1622766151.0,
            "replies": []
        },
        {
            "body": "From what I read on the wiki, it was the necklace activating that showed that to him. It was never explained how that happened in the anime though.",
            "author": "SmallerBork",
            "id": "h0g40fn",
            "parent_id": "t1_h0g2k7d",
            "score": 65,
            "created_utc": 1622732634.0,
            "replies": [
                {
                    "body": "I’m assuming Tsunade set that up",
                    "author": "agonizedn",
                    "id": "h0gx7hi",
                    "parent_id": "t1_h0g40fn",
                    "score": 28,
                    "created_utc": 1622744680.0,
                    "replies": [
                        {
                            "body": "Ya that's a good theory actually. What would she have done if Naruto lost that bet though?\n\nIruka, Kakashi, and Jiraiya were Father figures to him. She's the closest thing he had to a Mother. I wish they'd developed that a little more.",
                            "author": "SmallerBork",
                            "id": "h0gxl0w",
                            "parent_id": "t1_h0gx7hi",
                            "score": 32,
                            "created_utc": 1622744839.0,
                            "replies": [
                                {
                                    "body": "Man that’s so true. Kishimoto really wasted their relationship in past part 1. It was really sweet how much Naruto ended up meaning to Tsunade and not much was really done with it.",
                                    "author": "Kazewatch",
                                    "id": "h0h54sh",
                                    "parent_id": "t1_h0gxl0w",
                                    "score": 21,
                                    "created_utc": 1622748017.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But the stone was Hashirama's i thought? And i thought it alerted Yamato cuz he also had Hashirama Cells™️",
                            "author": null,
                            "id": "h0gz9qs",
                            "parent_id": "t1_h0gx7hi",
                            "score": 13,
                            "created_utc": 1622745540.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine Yamato not knowing Naruto became friends with Kurama and trying to supress Naruto getting into tailed beast mode",
            "author": "wisdomsharerv2",
            "id": "h0h4xio",
            "parent_id": "t1_h0g2k7d",
            "score": 10,
            "created_utc": 1622747933.0,
            "replies": []
        },
        {
            "body": "I thought that only showed up *while* he was using his Tailed Beast suppression jutsu",
            "author": "whitey-ofwgkta",
            "id": "h0gwb5m",
            "parent_id": "t1_h0g2k7d",
            "score": 2,
            "created_utc": 1622744308.0,
            "replies": [
                {
                    "body": "Nah, when naruto hit 8 (almost 9) tails while fighting Pain, Yamato could see the tails the whole time even though he was not in the leaf village at all",
                    "author": "coopstar777",
                    "id": "h0idvwj",
                    "parent_id": "t1_h0gwb5m",
                    "score": 2,
                    "created_utc": 1622768304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes in those episodes, Danzo said he wouldn't remove the curse mark from him though when Kakashi and Hiruzen came to get him.",
            "author": "SmallerBork",
            "id": "h0h4gb2",
            "parent_id": "t1_h0h0zyo",
            "score": 1,
            "created_utc": 1622747727.0,
            "replies": [
                {
                    "body": "After rewatching the scene, I can confirm that you are right. I'll delete my previous comment in order not to cause confusion.",
                    "author": "Thely4i",
                    "id": "h0h92f8",
                    "parent_id": "t1_h0h4gb2",
                    "score": 2,
                    "created_utc": 1622749706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oh sweet summer child",
            "author": "iinaomii",
            "id": "h0p3god",
            "parent_id": "t1_h0jtb5w",
            "score": 3,
            "created_utc": 1622907833.0,
            "replies": [
                {
                    "body": "Dont take it out of context you pervert",
                    "author": "not_some_username",
                    "id": "h0ssgq0",
                    "parent_id": "t1_h0p3god",
                    "score": 2,
                    "created_utc": 1622990738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh yeah , now I remember",
            "author": "potlu_party",
            "id": "h0g724l",
            "parent_id": "t1_h0g1lm6",
            "score": 8,
            "created_utc": 1622733887.0,
            "replies": []
        },
        {
            "body": "Not anymore iirc",
            "author": "GoodboyGotter",
            "id": "h0g5g9g",
            "parent_id": "t1_h0g1lm6",
            "score": -10,
            "created_utc": 1622733236.0,
            "replies": [
                {
                    "body": "No they keep them for life",
                    "author": "SmallerBork",
                    "id": "h0g5y54",
                    "parent_id": "t1_h0g5g9g",
                    "score": 10,
                    "created_utc": 1622733440.0,
                    "replies": [
                        {
                            "body": "Prove it",
                            "author": "GoodboyGotter",
                            "id": "h0g62eu",
                            "parent_id": "t1_h0g5y54",
                            "score": -19,
                            "created_utc": 1622733488.0,
                            "replies": [
                                {
                                    "body": "No you prove when he got it lasered off. We see him have it when in the hospital after he's no longer an anbu.\n\nWhy get rid of it later rather than immediately after he stopped being an anbu. They're like Navy Seals and other special forces, they don't just get rid of the insignia they earned.",
                                    "author": "SmallerBork",
                                    "id": "h0g83up",
                                    "parent_id": "t1_h0g62eu",
                                    "score": 22,
                                    "created_utc": 1622734322.0,
                                    "replies": [
                                        {
                                            "body": "Fuck it , enjoy the meme",
                                            "author": "potlu_party",
                                            "id": "h0gve2c",
                                            "parent_id": "t1_h0g83up",
                                            "score": 5,
                                            "created_utc": 1622743925.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Scars are not tats",
            "author": "GoodboyGotter",
            "id": "h0g5dby",
            "parent_id": "t1_h0g0tzu",
            "score": 6,
            "created_utc": 1622733202.0,
            "replies": [
                {
                    "body": "blood tats.",
                    "author": "nicostein",
                    "id": "h0gjcxv",
                    "parent_id": "t1_h0g5dby",
                    "score": 11,
                    "created_utc": 1622738978.0,
                    "replies": [
                        {
                            "body": "Gonna have problems with anyone with Crips tats",
                            "author": "DisneyPrincessDVorah",
                            "id": "h0gy723",
                            "parent_id": "t1_h0gjcxv",
                            "score": 6,
                            "created_utc": 1622745093.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know, six-panel comics are a thing.",
            "author": "DagitabPH",
            "id": "h0hqegb",
            "parent_id": "t1_h0gyv3c",
            "score": 2,
            "created_utc": 1622757026.0,
            "replies": []
        },
        {
            "body": "Remove the trash can or the pale sheep",
            "author": "Moudy47",
            "id": "h0h06s8",
            "parent_id": "t1_h0gyv3c",
            "score": -4,
            "created_utc": 1622745923.0,
            "replies": [
                {
                    "body": "Cease fire",
                    "author": "Va_Mukuwane",
                    "id": "h0h9ijo",
                    "parent_id": "t1_h0h06s8",
                    "score": 7,
                    "created_utc": 1622749891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ohhh",
            "author": "SecretumOmega-IsLost",
            "id": "h0h4dzd",
            "parent_id": "t1_h0gqzty",
            "score": 1,
            "created_utc": 1622747701.0,
            "replies": []
        },
        {
            "body": "…You just did.",
            "author": "DagitabPH",
            "id": "h0hqlb5",
            "parent_id": "t1_h0guted",
            "score": -1,
            "created_utc": 1622757111.0,
            "replies": [
                {
                    "body": "It was a joke",
                    "author": "potlu_party",
                    "id": "h0j0vzb",
                    "parent_id": "t1_h0hqlb5",
                    "score": 1,
                    "created_utc": 1622779843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks comfort bot! I am comforted.\n\nGood bot~",
            "author": "Zuukal",
            "id": "h0igba1",
            "parent_id": "t1_h0ig08l",
            "score": 1,
            "created_utc": 1622769463.0,
            "replies": []
        },
        {
            "body": "20 years??",
            "author": "donniesuave",
            "id": "h0k43ev",
            "parent_id": "t1_h0jf0tu",
            "score": 1,
            "created_utc": 1622808696.0,
            "replies": [
                {
                    "body": "My b for replying like a day late but yeah she got hears almost 20 years ago",
                    "author": "GroovyCookie08",
                    "id": "h0raqgk",
                    "parent_id": "t1_h0k43ev",
                    "score": 1,
                    "created_utc": 1622949908.0,
                    "replies": [
                        {
                            "body": "Time skip?",
                            "author": "donniesuave",
                            "id": "h0s35re",
                            "parent_id": "t1_h0raqgk",
                            "score": 1,
                            "created_utc": 1622973206.0,
                            "replies": [
                                {
                                    "body": "Yup",
                                    "author": "GroovyCookie08",
                                    "id": "h0tnerh",
                                    "parent_id": "t1_h0s35re",
                                    "score": 1,
                                    "created_utc": 1623005685.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think it fits, Team 7 is a squad and as hokage Naruto's not doing traditional missions  and if he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\noh wait Shin arc, nevermind",
            "author": "whitey-ofwgkta",
            "id": "h0gvta2",
            "parent_id": "t1_h0guxh3",
            "score": 67,
            "created_utc": 1622744101.0,
            "replies": [
                {
                    "body": "That wasn't a mission though. It just kinda happened because Sakura refused to explain anything to Sarada.",
                    "author": "SmallerBork",
                    "id": "h0gwnaw",
                    "parent_id": "t1_h0gvta2",
                    "score": 38,
                    "created_utc": 1622744447.0,
                    "replies": [
                        {
                            "body": "Because sasuke asked her not to",
                            "author": "WindyCityAssasin2",
                            "id": "h0h8dqt",
                            "parent_id": "t1_h0gwnaw",
                            "score": 18,
                            "created_utc": 1622749416.0,
                            "replies": [
                                {
                                    "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
                                    "author": "SmallerBork",
                                    "id": "h0hn54p",
                                    "parent_id": "t1_h0h8dqt",
                                    "score": 14,
                                    "created_utc": 1622755538.0,
                                    "replies": [
                                        {
                                            "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0hubbx",
                                            "parent_id": "t1_h0hn54p",
                                            "score": 14,
                                            "created_utc": 1622758768.0,
                                            "replies": [
                                                {
                                                    "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                                                    "author": "SmallerBork",
                                                    "id": "h0hzo0s",
                                                    "parent_id": "t1_h0hubbx",
                                                    "score": 5,
                                                    "created_utc": 1622761331.0,
                                                    "replies": [
                                                        {
                                                            "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                                            "author": "WindyCityAssasin2",
                                                            "id": "h0i3dwh",
                                                            "parent_id": "t1_h0hzo0s",
                                                            "score": 5,
                                                            "created_utc": 1622763188.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                                                    "author": "SmallerBork",
                                                                    "id": "h0iu9bs",
                                                                    "parent_id": "t1_h0i3dwh",
                                                                    "score": 2,
                                                                    "created_utc": 1622776311.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                                            "author": "WindyCityAssasin2",
                                                                            "id": "h0iz5w8",
                                                                            "parent_id": "t1_h0iu9bs",
                                                                            "score": 3,
                                                                            "created_utc": 1622778867.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\nWym?",
                    "author": "WindyCityAssasin2",
                    "id": "h0gwp5a",
                    "parent_id": "t1_h0gvta2",
                    "score": 5,
                    "created_utc": 1622744468.0,
                    "replies": [
                        {
                            "body": "talking out of my ass but I feel like if Naruto had to go on a non-diplomatic mission and he needed a 3-man squad there would be a convenient reason that it wouldn't be either version of team-7",
                            "author": "whitey-ofwgkta",
                            "id": "h0gxcx8",
                            "parent_id": "t1_h0gwp5a",
                            "score": 9,
                            "created_utc": 1622744745.0,
                            "replies": [
                                {
                                    "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0gy3fb",
                                    "parent_id": "t1_h0gxcx8",
                                    "score": 17,
                                    "created_utc": 1622745051.0,
                                    "replies": []
                                },
                                {
                                    "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
                                    "author": null,
                                    "id": "h0h9kge",
                                    "parent_id": "t1_h0gxcx8",
                                    "score": 5,
                                    "created_utc": 1622749913.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well Kakashi does investigate stuff like Danzo's legacy and the kidnappings by the Hidan fanboy but officially he's retired.\n\nTeam 7 is dissolved because they don't go on missions together anymore. If they did, Konohamaru's team couldn't have the number.",
            "author": "SmallerBork",
            "id": "h0gwibw",
            "parent_id": "t1_h0guxh3",
            "score": 12,
            "created_utc": 1622744390.0,
            "replies": [
                {
                    "body": "Yeah but by that logic isn't *every* old gen team dissolved?",
                    "author": "WindyCityAssasin2",
                    "id": "h0gwv52",
                    "parent_id": "t1_h0gwibw",
                    "score": 7,
                    "created_utc": 1622744536.0,
                    "replies": [
                        {
                            "body": "Yes, that's what I'm saying.",
                            "author": "SmallerBork",
                            "id": "h0gxqor",
                            "parent_id": "t1_h0gwv52",
                            "score": 6,
                            "created_utc": 1622744904.0,
                            "replies": [
                                {
                                    "body": "Oh ok I missed ur point",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0gy63u",
                                    "parent_id": "t1_h0gxqor",
                                    "score": 2,
                                    "created_utc": 1622745082.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean Kakashi is still helping out around the village, he has been advising Naruto and helped teach some of the children",
            "author": "AutistChan",
            "id": "h0hzqhb",
            "parent_id": "t1_h0guxh3",
            "score": 1,
            "created_utc": 1622761364.0,
            "replies": []
        },
        {
            "body": "It's stated that Otsutsuki exist outside their dimension. If he were just traveling around the world, anyone could investigate them since there are other transportation jutsu.\n\nIt could easily just be other planets in that universe, but that's not what's been established.\n\nAs for running out of chakra, they nerfed him sadly. There are a lot of things that don't make sense like Sakura having a picture of Sasuke with team Taka in Akatsuki cloaks. Sarada doesn't know that Orochimaru attacked the village and killed Hiruzen. This isn't exclusive to Boruto though, Naruto and Sasuke didn't know who Madara was before Kurama told them.",
            "author": "SmallerBork",
            "id": "h0isk79",
            "parent_id": "t1_h0i99nz",
            "score": 4,
            "created_utc": 1622775463.0,
            "replies": [
                {
                    "body": "That just reflects badly on the education system tho",
                    "author": "ulfric_stormcloack",
                    "id": "h0jkcse",
                    "parent_id": "t1_h0isk79",
                    "score": 1,
                    "created_utc": 1622793486.0,
                    "replies": [
                        {
                            "body": "Even without learning it in school, the characters should have heard about it from their parents.\n\nIt's possible they tried to cover it up, but that's like the government trying to hide the fact that 9/11 even happened.",
                            "author": "SmallerBork",
                            "id": "h0kqb3c",
                            "parent_id": "t1_h0jkcse",
                            "score": 2,
                            "created_utc": 1622819465.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His wormhole jutsu let's him leave Earth. Where'd you think he was going to find information on the Otsutsuki?\n\nhttps://naruto.fandom.com/wiki/Unidentified_World\n\nhttps://naruto.fandom.com/wiki/Momoshiki%27s_Planet",
            "author": "SmallerBork",
            "id": "h0kr4l1",
            "parent_id": "t1_h0jk9gj",
            "score": 2,
            "created_utc": 1622819828.0,
            "replies": []
        },
        {
            "body": "I’m assuming Tsunade set that up",
            "author": "agonizedn",
            "id": "h0gx7hi",
            "parent_id": "t1_h0g40fn",
            "score": 28,
            "created_utc": 1622744680.0,
            "replies": [
                {
                    "body": "Ya that's a good theory actually. What would she have done if Naruto lost that bet though?\n\nIruka, Kakashi, and Jiraiya were Father figures to him. She's the closest thing he had to a Mother. I wish they'd developed that a little more.",
                    "author": "SmallerBork",
                    "id": "h0gxl0w",
                    "parent_id": "t1_h0gx7hi",
                    "score": 32,
                    "created_utc": 1622744839.0,
                    "replies": [
                        {
                            "body": "Man that’s so true. Kishimoto really wasted their relationship in past part 1. It was really sweet how much Naruto ended up meaning to Tsunade and not much was really done with it.",
                            "author": "Kazewatch",
                            "id": "h0h54sh",
                            "parent_id": "t1_h0gxl0w",
                            "score": 21,
                            "created_utc": 1622748017.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But the stone was Hashirama's i thought? And i thought it alerted Yamato cuz he also had Hashirama Cells™️",
                    "author": null,
                    "id": "h0gz9qs",
                    "parent_id": "t1_h0gx7hi",
                    "score": 13,
                    "created_utc": 1622745540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, when naruto hit 8 (almost 9) tails while fighting Pain, Yamato could see the tails the whole time even though he was not in the leaf village at all",
            "author": "coopstar777",
            "id": "h0idvwj",
            "parent_id": "t1_h0gwb5m",
            "score": 2,
            "created_utc": 1622768304.0,
            "replies": []
        },
        {
            "body": "After rewatching the scene, I can confirm that you are right. I'll delete my previous comment in order not to cause confusion.",
            "author": "Thely4i",
            "id": "h0h92f8",
            "parent_id": "t1_h0h4gb2",
            "score": 2,
            "created_utc": 1622749706.0,
            "replies": []
        },
        {
            "body": "Dont take it out of context you pervert",
            "author": "not_some_username",
            "id": "h0ssgq0",
            "parent_id": "t1_h0p3god",
            "score": 2,
            "created_utc": 1622990738.0,
            "replies": []
        },
        {
            "body": "No they keep them for life",
            "author": "SmallerBork",
            "id": "h0g5y54",
            "parent_id": "t1_h0g5g9g",
            "score": 10,
            "created_utc": 1622733440.0,
            "replies": [
                {
                    "body": "Prove it",
                    "author": "GoodboyGotter",
                    "id": "h0g62eu",
                    "parent_id": "t1_h0g5y54",
                    "score": -19,
                    "created_utc": 1622733488.0,
                    "replies": [
                        {
                            "body": "No you prove when he got it lasered off. We see him have it when in the hospital after he's no longer an anbu.\n\nWhy get rid of it later rather than immediately after he stopped being an anbu. They're like Navy Seals and other special forces, they don't just get rid of the insignia they earned.",
                            "author": "SmallerBork",
                            "id": "h0g83up",
                            "parent_id": "t1_h0g62eu",
                            "score": 22,
                            "created_utc": 1622734322.0,
                            "replies": [
                                {
                                    "body": "Fuck it , enjoy the meme",
                                    "author": "potlu_party",
                                    "id": "h0gve2c",
                                    "parent_id": "t1_h0g83up",
                                    "score": 5,
                                    "created_utc": 1622743925.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "blood tats.",
            "author": "nicostein",
            "id": "h0gjcxv",
            "parent_id": "t1_h0g5dby",
            "score": 11,
            "created_utc": 1622738978.0,
            "replies": [
                {
                    "body": "Gonna have problems with anyone with Crips tats",
                    "author": "DisneyPrincessDVorah",
                    "id": "h0gy723",
                    "parent_id": "t1_h0gjcxv",
                    "score": 6,
                    "created_utc": 1622745093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cease fire",
            "author": "Va_Mukuwane",
            "id": "h0h9ijo",
            "parent_id": "t1_h0h06s8",
            "score": 7,
            "created_utc": 1622749891.0,
            "replies": []
        },
        {
            "body": "It was a joke",
            "author": "potlu_party",
            "id": "h0j0vzb",
            "parent_id": "t1_h0hqlb5",
            "score": 1,
            "created_utc": 1622779843.0,
            "replies": []
        },
        {
            "body": "My b for replying like a day late but yeah she got hears almost 20 years ago",
            "author": "GroovyCookie08",
            "id": "h0raqgk",
            "parent_id": "t1_h0k43ev",
            "score": 1,
            "created_utc": 1622949908.0,
            "replies": [
                {
                    "body": "Time skip?",
                    "author": "donniesuave",
                    "id": "h0s35re",
                    "parent_id": "t1_h0raqgk",
                    "score": 1,
                    "created_utc": 1622973206.0,
                    "replies": [
                        {
                            "body": "Yup",
                            "author": "GroovyCookie08",
                            "id": "h0tnerh",
                            "parent_id": "t1_h0s35re",
                            "score": 1,
                            "created_utc": 1623005685.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That wasn't a mission though. It just kinda happened because Sakura refused to explain anything to Sarada.",
            "author": "SmallerBork",
            "id": "h0gwnaw",
            "parent_id": "t1_h0gvta2",
            "score": 38,
            "created_utc": 1622744447.0,
            "replies": [
                {
                    "body": "Because sasuke asked her not to",
                    "author": "WindyCityAssasin2",
                    "id": "h0h8dqt",
                    "parent_id": "t1_h0gwnaw",
                    "score": 18,
                    "created_utc": 1622749416.0,
                    "replies": [
                        {
                            "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
                            "author": "SmallerBork",
                            "id": "h0hn54p",
                            "parent_id": "t1_h0h8dqt",
                            "score": 14,
                            "created_utc": 1622755538.0,
                            "replies": [
                                {
                                    "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0hubbx",
                                    "parent_id": "t1_h0hn54p",
                                    "score": 14,
                                    "created_utc": 1622758768.0,
                                    "replies": [
                                        {
                                            "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                                            "author": "SmallerBork",
                                            "id": "h0hzo0s",
                                            "parent_id": "t1_h0hubbx",
                                            "score": 5,
                                            "created_utc": 1622761331.0,
                                            "replies": [
                                                {
                                                    "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                                    "author": "WindyCityAssasin2",
                                                    "id": "h0i3dwh",
                                                    "parent_id": "t1_h0hzo0s",
                                                    "score": 5,
                                                    "created_utc": 1622763188.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                                            "author": "SmallerBork",
                                                            "id": "h0iu9bs",
                                                            "parent_id": "t1_h0i3dwh",
                                                            "score": 2,
                                                            "created_utc": 1622776311.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                                    "author": "WindyCityAssasin2",
                                                                    "id": "h0iz5w8",
                                                                    "parent_id": "t1_h0iu9bs",
                                                                    "score": 3,
                                                                    "created_utc": 1622778867.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">he were there's not a whole lot of opportunity for either team 7 composition to be the ideal skill distribution\n\nWym?",
            "author": "WindyCityAssasin2",
            "id": "h0gwp5a",
            "parent_id": "t1_h0gvta2",
            "score": 5,
            "created_utc": 1622744468.0,
            "replies": [
                {
                    "body": "talking out of my ass but I feel like if Naruto had to go on a non-diplomatic mission and he needed a 3-man squad there would be a convenient reason that it wouldn't be either version of team-7",
                    "author": "whitey-ofwgkta",
                    "id": "h0gxcx8",
                    "parent_id": "t1_h0gwp5a",
                    "score": 9,
                    "created_utc": 1622744745.0,
                    "replies": [
                        {
                            "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
                            "author": "WindyCityAssasin2",
                            "id": "h0gy3fb",
                            "parent_id": "t1_h0gxcx8",
                            "score": 17,
                            "created_utc": 1622745051.0,
                            "replies": []
                        },
                        {
                            "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
                            "author": null,
                            "id": "h0h9kge",
                            "parent_id": "t1_h0gxcx8",
                            "score": 5,
                            "created_utc": 1622749913.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah but by that logic isn't *every* old gen team dissolved?",
            "author": "WindyCityAssasin2",
            "id": "h0gwv52",
            "parent_id": "t1_h0gwibw",
            "score": 7,
            "created_utc": 1622744536.0,
            "replies": [
                {
                    "body": "Yes, that's what I'm saying.",
                    "author": "SmallerBork",
                    "id": "h0gxqor",
                    "parent_id": "t1_h0gwv52",
                    "score": 6,
                    "created_utc": 1622744904.0,
                    "replies": [
                        {
                            "body": "Oh ok I missed ur point",
                            "author": "WindyCityAssasin2",
                            "id": "h0gy63u",
                            "parent_id": "t1_h0gxqor",
                            "score": 2,
                            "created_utc": 1622745082.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That just reflects badly on the education system tho",
            "author": "ulfric_stormcloack",
            "id": "h0jkcse",
            "parent_id": "t1_h0isk79",
            "score": 1,
            "created_utc": 1622793486.0,
            "replies": [
                {
                    "body": "Even without learning it in school, the characters should have heard about it from their parents.\n\nIt's possible they tried to cover it up, but that's like the government trying to hide the fact that 9/11 even happened.",
                    "author": "SmallerBork",
                    "id": "h0kqb3c",
                    "parent_id": "t1_h0jkcse",
                    "score": 2,
                    "created_utc": 1622819465.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ya that's a good theory actually. What would she have done if Naruto lost that bet though?\n\nIruka, Kakashi, and Jiraiya were Father figures to him. She's the closest thing he had to a Mother. I wish they'd developed that a little more.",
            "author": "SmallerBork",
            "id": "h0gxl0w",
            "parent_id": "t1_h0gx7hi",
            "score": 32,
            "created_utc": 1622744839.0,
            "replies": [
                {
                    "body": "Man that’s so true. Kishimoto really wasted their relationship in past part 1. It was really sweet how much Naruto ended up meaning to Tsunade and not much was really done with it.",
                    "author": "Kazewatch",
                    "id": "h0h54sh",
                    "parent_id": "t1_h0gxl0w",
                    "score": 21,
                    "created_utc": 1622748017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But the stone was Hashirama's i thought? And i thought it alerted Yamato cuz he also had Hashirama Cells™️",
            "author": null,
            "id": "h0gz9qs",
            "parent_id": "t1_h0gx7hi",
            "score": 13,
            "created_utc": 1622745540.0,
            "replies": []
        },
        {
            "body": "Prove it",
            "author": "GoodboyGotter",
            "id": "h0g62eu",
            "parent_id": "t1_h0g5y54",
            "score": -19,
            "created_utc": 1622733488.0,
            "replies": [
                {
                    "body": "No you prove when he got it lasered off. We see him have it when in the hospital after he's no longer an anbu.\n\nWhy get rid of it later rather than immediately after he stopped being an anbu. They're like Navy Seals and other special forces, they don't just get rid of the insignia they earned.",
                    "author": "SmallerBork",
                    "id": "h0g83up",
                    "parent_id": "t1_h0g62eu",
                    "score": 22,
                    "created_utc": 1622734322.0,
                    "replies": [
                        {
                            "body": "Fuck it , enjoy the meme",
                            "author": "potlu_party",
                            "id": "h0gve2c",
                            "parent_id": "t1_h0g83up",
                            "score": 5,
                            "created_utc": 1622743925.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gonna have problems with anyone with Crips tats",
            "author": "DisneyPrincessDVorah",
            "id": "h0gy723",
            "parent_id": "t1_h0gjcxv",
            "score": 6,
            "created_utc": 1622745093.0,
            "replies": []
        },
        {
            "body": "Time skip?",
            "author": "donniesuave",
            "id": "h0s35re",
            "parent_id": "t1_h0raqgk",
            "score": 1,
            "created_utc": 1622973206.0,
            "replies": [
                {
                    "body": "Yup",
                    "author": "GroovyCookie08",
                    "id": "h0tnerh",
                    "parent_id": "t1_h0s35re",
                    "score": 1,
                    "created_utc": 1623005685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because sasuke asked her not to",
            "author": "WindyCityAssasin2",
            "id": "h0h8dqt",
            "parent_id": "t1_h0gwnaw",
            "score": 18,
            "created_utc": 1622749416.0,
            "replies": [
                {
                    "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
                    "author": "SmallerBork",
                    "id": "h0hn54p",
                    "parent_id": "t1_h0h8dqt",
                    "score": 14,
                    "created_utc": 1622755538.0,
                    "replies": [
                        {
                            "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                            "author": "WindyCityAssasin2",
                            "id": "h0hubbx",
                            "parent_id": "t1_h0hn54p",
                            "score": 14,
                            "created_utc": 1622758768.0,
                            "replies": [
                                {
                                    "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                                    "author": "SmallerBork",
                                    "id": "h0hzo0s",
                                    "parent_id": "t1_h0hubbx",
                                    "score": 5,
                                    "created_utc": 1622761331.0,
                                    "replies": [
                                        {
                                            "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0i3dwh",
                                            "parent_id": "t1_h0hzo0s",
                                            "score": 5,
                                            "created_utc": 1622763188.0,
                                            "replies": [
                                                {
                                                    "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                                    "author": "SmallerBork",
                                                    "id": "h0iu9bs",
                                                    "parent_id": "t1_h0i3dwh",
                                                    "score": 2,
                                                    "created_utc": 1622776311.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                            "author": "WindyCityAssasin2",
                                                            "id": "h0iz5w8",
                                                            "parent_id": "t1_h0iu9bs",
                                                            "score": 3,
                                                            "created_utc": 1622778867.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "talking out of my ass but I feel like if Naruto had to go on a non-diplomatic mission and he needed a 3-man squad there would be a convenient reason that it wouldn't be either version of team-7",
            "author": "whitey-ofwgkta",
            "id": "h0gxcx8",
            "parent_id": "t1_h0gwp5a",
            "score": 9,
            "created_utc": 1622744745.0,
            "replies": [
                {
                    "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
                    "author": "WindyCityAssasin2",
                    "id": "h0gy3fb",
                    "parent_id": "t1_h0gxcx8",
                    "score": 17,
                    "created_utc": 1622745051.0,
                    "replies": []
                },
                {
                    "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
                    "author": null,
                    "id": "h0h9kge",
                    "parent_id": "t1_h0gxcx8",
                    "score": 5,
                    "created_utc": 1622749913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, that's what I'm saying.",
            "author": "SmallerBork",
            "id": "h0gxqor",
            "parent_id": "t1_h0gwv52",
            "score": 6,
            "created_utc": 1622744904.0,
            "replies": [
                {
                    "body": "Oh ok I missed ur point",
                    "author": "WindyCityAssasin2",
                    "id": "h0gy63u",
                    "parent_id": "t1_h0gxqor",
                    "score": 2,
                    "created_utc": 1622745082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even without learning it in school, the characters should have heard about it from their parents.\n\nIt's possible they tried to cover it up, but that's like the government trying to hide the fact that 9/11 even happened.",
            "author": "SmallerBork",
            "id": "h0kqb3c",
            "parent_id": "t1_h0jkcse",
            "score": 2,
            "created_utc": 1622819465.0,
            "replies": []
        },
        {
            "body": "Man that’s so true. Kishimoto really wasted their relationship in past part 1. It was really sweet how much Naruto ended up meaning to Tsunade and not much was really done with it.",
            "author": "Kazewatch",
            "id": "h0h54sh",
            "parent_id": "t1_h0gxl0w",
            "score": 21,
            "created_utc": 1622748017.0,
            "replies": []
        },
        {
            "body": "No you prove when he got it lasered off. We see him have it when in the hospital after he's no longer an anbu.\n\nWhy get rid of it later rather than immediately after he stopped being an anbu. They're like Navy Seals and other special forces, they don't just get rid of the insignia they earned.",
            "author": "SmallerBork",
            "id": "h0g83up",
            "parent_id": "t1_h0g62eu",
            "score": 22,
            "created_utc": 1622734322.0,
            "replies": [
                {
                    "body": "Fuck it , enjoy the meme",
                    "author": "potlu_party",
                    "id": "h0gve2c",
                    "parent_id": "t1_h0g83up",
                    "score": 5,
                    "created_utc": 1622743925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup",
            "author": "GroovyCookie08",
            "id": "h0tnerh",
            "parent_id": "t1_h0s35re",
            "score": 1,
            "created_utc": 1623005685.0,
            "replies": []
        },
        {
            "body": "I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nYou really think he told Sakura not to tell her she got her glasses from Karin? That would have cleared things up much quicker and she wouldn't have had an existential crisis over it.\n\nAnd how does Suigetsu know about the umbilical cord and never ask how she got it? He should have been able to get some dna they actually knew was hers too though. Also phones exist in the Boruto era or he could have used some ninja magic to contact Karin but nooo.",
            "author": "SmallerBork",
            "id": "h0hn54p",
            "parent_id": "t1_h0h8dqt",
            "score": 14,
            "created_utc": 1622755538.0,
            "replies": [
                {
                    "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
                    "author": "WindyCityAssasin2",
                    "id": "h0hubbx",
                    "parent_id": "t1_h0hn54p",
                    "score": 14,
                    "created_utc": 1622758768.0,
                    "replies": [
                        {
                            "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                            "author": "SmallerBork",
                            "id": "h0hzo0s",
                            "parent_id": "t1_h0hubbx",
                            "score": 5,
                            "created_utc": 1622761331.0,
                            "replies": [
                                {
                                    "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0i3dwh",
                                    "parent_id": "t1_h0hzo0s",
                                    "score": 5,
                                    "created_utc": 1622763188.0,
                                    "replies": [
                                        {
                                            "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                            "author": "SmallerBork",
                                            "id": "h0iu9bs",
                                            "parent_id": "t1_h0i3dwh",
                                            "score": 2,
                                            "created_utc": 1622776311.0,
                                            "replies": [
                                                {
                                                    "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                                    "author": "WindyCityAssasin2",
                                                    "id": "h0iz5w8",
                                                    "parent_id": "t1_h0iu9bs",
                                                    "score": 3,
                                                    "created_utc": 1622778867.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I mean if there's a *huge* threat and he needed a 3 man team he'd probably bring sasuke, and sakura is really the only one who can fight on the same field as them out of all the konoha ninja",
            "author": "WindyCityAssasin2",
            "id": "h0gy3fb",
            "parent_id": "t1_h0gxcx8",
            "score": 17,
            "created_utc": 1622745051.0,
            "replies": []
        },
        {
            "body": "If I'm not wrong team 7 was meant to be the heavy hitting squad. Like their speciality is power. Think about we have the 9 tails jinchuriki, an Uchiha, and a medical ninja(she had great Chakra control from the start).",
            "author": null,
            "id": "h0h9kge",
            "parent_id": "t1_h0gxcx8",
            "score": 5,
            "created_utc": 1622749913.0,
            "replies": []
        },
        {
            "body": "Oh ok I missed ur point",
            "author": "WindyCityAssasin2",
            "id": "h0gy63u",
            "parent_id": "t1_h0gxqor",
            "score": 2,
            "created_utc": 1622745082.0,
            "replies": []
        },
        {
            "body": "Fuck it , enjoy the meme",
            "author": "potlu_party",
            "id": "h0gve2c",
            "parent_id": "t1_h0g83up",
            "score": 5,
            "created_utc": 1622743925.0,
            "replies": []
        },
        {
            "body": ">I remember Sasuke saying that he needed to protect the village in a flashback, but not that he asked Sakura not to say anything at all. Was that in the manga?\n\nI don't remember that exactly where but iirc they said something about how they were scared sarada would find out about sasukes past and about how she would react.\n\n\n\n\n\n\nEverything else was just plot induced stupidity imo. You're right in that there isn't really a logical reason for a lot the stuff in that arc. \n\n\n\n\nLike, it makes no sense for sakura to have a picture of sasuke in an Akatsuki robe in the first place, and even if she did, it makes no sense for her to frame it. \n\n\nI find it much easier to just ignore that kind of bullshit and just enjoy the what they're trying to do lol",
            "author": "WindyCityAssasin2",
            "id": "h0hubbx",
            "parent_id": "t1_h0hn54p",
            "score": 14,
            "created_utc": 1622758768.0,
            "replies": [
                {
                    "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
                    "author": "SmallerBork",
                    "id": "h0hzo0s",
                    "parent_id": "t1_h0hubbx",
                    "score": 5,
                    "created_utc": 1622761331.0,
                    "replies": [
                        {
                            "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                            "author": "WindyCityAssasin2",
                            "id": "h0i3dwh",
                            "parent_id": "t1_h0hzo0s",
                            "score": 5,
                            "created_utc": 1622763188.0,
                            "replies": [
                                {
                                    "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                                    "author": "SmallerBork",
                                    "id": "h0iu9bs",
                                    "parent_id": "t1_h0i3dwh",
                                    "score": 2,
                                    "created_utc": 1622776311.0,
                                    "replies": [
                                        {
                                            "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                            "author": "WindyCityAssasin2",
                                            "id": "h0iz5w8",
                                            "parent_id": "t1_h0iu9bs",
                                            "score": 3,
                                            "created_utc": 1622778867.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes I agree, but that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nThe authors have made great emotional scenes but the circumstances make no sense, which isn't exclusive to Boruto. Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nI think if they kept hiding everything from her and hadn't met Sasuke, she'd sneak into where they keep classified documents to figure out what happened. I kind of wish they'd taken that route, it would have been a lot more interesting.",
            "author": "SmallerBork",
            "id": "h0hzo0s",
            "parent_id": "t1_h0hubbx",
            "score": 5,
            "created_utc": 1622761331.0,
            "replies": [
                {
                    "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
                    "author": "WindyCityAssasin2",
                    "id": "h0i3dwh",
                    "parent_id": "t1_h0hzo0s",
                    "score": 5,
                    "created_utc": 1622763188.0,
                    "replies": [
                        {
                            "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                            "author": "SmallerBork",
                            "id": "h0iu9bs",
                            "parent_id": "t1_h0i3dwh",
                            "score": 2,
                            "created_utc": 1622776311.0,
                            "replies": [
                                {
                                    "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                                    "author": "WindyCityAssasin2",
                                    "id": "h0iz5w8",
                                    "parent_id": "t1_h0iu9bs",
                                    "score": 3,
                                    "created_utc": 1622778867.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">that still doesn't explain why he never came home when he has a wormhole jutsu and could 100% learn flying raijin or anything similar.\n\nWhile it's not a 100% defense it's partly because it takes a lot of chakra to use it and sasuke can't just use it constantly. However, him not coming home for 10 years is nothing short of stupid. He definitely has the means and for him to be gone *long* without even a letter doesn't make any sense.\n\n>Naruto and Sasuke had never heard of Madara until Kurama mentioned him, does the academy not have history class? It hits hard when Itachi tells Sasuke that was his partner though.\n\nTbf the leaf probably hid things like that. Like how info on the Uchiha clan is restricted now in boruto.\n\n>I kind of wish they'd taken that route, it would have been a lot more interesting.\n\nYeah but I think they want sasuke to be the one to tell her and create an emotional scene from it",
            "author": "WindyCityAssasin2",
            "id": "h0i3dwh",
            "parent_id": "t1_h0hzo0s",
            "score": 5,
            "created_utc": 1622763188.0,
            "replies": [
                {
                    "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
                    "author": "SmallerBork",
                    "id": "h0iu9bs",
                    "parent_id": "t1_h0i3dwh",
                    "score": 2,
                    "created_utc": 1622776311.0,
                    "replies": [
                        {
                            "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                            "author": "WindyCityAssasin2",
                            "id": "h0iz5w8",
                            "parent_id": "t1_h0iu9bs",
                            "score": 3,
                            "created_utc": 1622778867.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nMadara was world famous, such that they built a giant statue of him. What if they got sent on a mission in that area? One of them would ask Kakashi who the guy Hashirama was fighting. They also go on vacation to hot springs and what not, it's obviously a historical landmark so people would visit for sure. There's just no way they could cover all that up. It also should have come up at some point by Orochimaru.\n\nInfo on Orochimaru is restricted too, but Sarada didn't even Orochimaru killed Hiruzen.\n\nYes I agree that's how it's going to go, but I wish it had gone differently where the Shin arc didn't happen.",
            "author": "SmallerBork",
            "id": "h0iu9bs",
            "parent_id": "t1_h0i3dwh",
            "score": 2,
            "created_utc": 1622776311.0,
            "replies": [
                {
                    "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
                    "author": "WindyCityAssasin2",
                    "id": "h0iz5w8",
                    "parent_id": "t1_h0iu9bs",
                    "score": 3,
                    "created_utc": 1622778867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Well I just said he could learn flying raijin so anytime he's on Earth he jump home. Sharingan can copy any jutsu that isn't a kekkei genkei and the rinnegan makes it possible to learn all nature types instantly. There are also a bunch of other transportation techniques too.\n\nYeah but... Then sasuke would be way too powerful.\n\n>One of them would ask Kakashi who the guy Hashirama was fighting\n\nTbf naruto never asked kakashi who he was after the VOTE fight so it's not necessarily a given.\n\n\n\n\n\nAll of this though is very clearly just stupid things to allow the plot to progress. \n\n>I wish it had gone differently where the Shin arc didn't happen.\n\nEither that or they just write the story better",
            "author": "WindyCityAssasin2",
            "id": "h0iz5w8",
            "parent_id": "t1_h0iu9bs",
            "score": 3,
            "created_utc": 1622778867.0,
            "replies": []
        }
    ]
}