{
    "title": "Losing to his eternal rival is not new to him.",
    "post_id": "11xhchj",
    "post_url": "https://www.reddit.com/r/dankruto/comments/11xhchj/losing_to_his_eternal_rival_is_not_new_to_him/",
    "author": "beep_rockz",
    "body": "",
    "url": "https://i.redd.it/om5ayjwmj3pa1.png",
    "score": 5410,
    "upvote_ratio": 0.99,
    "created_utc": 1679406340.0,
    "num_comments": 173,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "To be fair his students all got the most unfair matchups",
            "author": "JayDaGod1206",
            "id": "jd3k88r",
            "parent_id": "t3_11xhchj",
            "score": 1404,
            "created_utc": 1679415275.0,
            "replies": [
                {
                    "body": "Gaara was a manace at that point, and naruto used 9 tails chakra.......",
                    "author": "european_jello",
                    "id": "jd3sfqx",
                    "parent_id": "t1_jd3k88r",
                    "score": 850,
                    "created_utc": 1679418404.0,
                    "replies": [
                        {
                            "body": "And TenTen got an opponent who’s the exact counter to her skills",
                            "author": "JayDaGod1206",
                            "id": "jd3t6tp",
                            "parent_id": "t1_jd3sfqx",
                            "score": 722,
                            "created_utc": 1679418689.0,
                            "replies": [
                                {
                                    "body": "I know right, it's soo unfair that Temari had the power to be strong while TenTen just happened to have the power to be weak.",
                                    "author": "JojoFag420",
                                    "id": "jd49e3l",
                                    "parent_id": "t1_jd3t6tp",
                                    "score": 460,
                                    "created_utc": 1679424799.0,
                                    "replies": [
                                        {
                                            "body": "Nah, man. At that point in time Tenten could have easily cleared like half the competing roster or more. She had good to fantastic odds of beating anyone except Gaara, Temari, Lee, Neji and Sasuke. Probably Naruto too just for his hax powers.",
                                            "author": "XishengTheUltimate",
                                            "id": "jd4aord",
                                            "parent_id": "t1_jd49e3l",
                                            "score": 271,
                                            "created_utc": 1679425284.0,
                                            "replies": [
                                                {
                                                    "body": "Well she'd also lose to the sound ninjas. And shit when kiba does fang over fang his rotation repels any kunai so I think she has bad odds there too.",
                                                    "author": "hoeassbitchasshoe",
                                                    "id": "jd4wk6k",
                                                    "parent_id": "t1_jd4aord",
                                                    "score": 90,
                                                    "created_utc": 1679433531.0,
                                                    "replies": [
                                                        {
                                                            "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
                                                            "author": "XishengTheUltimate",
                                                            "id": "jd5a9kz",
                                                            "parent_id": "t1_jd4wk6k",
                                                            "score": 43,
                                                            "created_utc": 1679439019.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "That’s cap. We all know thrown weapons never hurt anybody regardless of how many you throw.",
                                                    "author": "Xandril",
                                                    "id": "jdgpz8y",
                                                    "parent_id": "t1_jd4aord",
                                                    "score": 3,
                                                    "created_utc": 1679643600.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "if kishimoto had tried to develop tenten abilitys, temari's winds would be nothing to chakra-coated nest weapons, it would be resistant to natural elements like wind but he didn't even try and just made her a loser",
                                            "author": "EternalMemes30",
                                            "id": "jd4ax9n",
                                            "parent_id": "t1_jd49e3l",
                                            "score": 100,
                                            "created_utc": 1679425375.0,
                                            "replies": [
                                                {
                                                    "body": "> I can throw shuriken like, really really good\n\nYeah honestly wtf was he thinking lol",
                                                    "author": "iamkira01",
                                                    "id": "jd5ehed",
                                                    "parent_id": "t1_jd4ax9n",
                                                    "score": 58,
                                                    "created_utc": 1679440740.0,
                                                    "replies": [
                                                        {
                                                            "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
                                                            "author": "DeusVulticus13",
                                                            "id": "jd7qqb5",
                                                            "parent_id": "t1_jd5ehed",
                                                            "score": 12,
                                                            "created_utc": 1679491290.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "By jonin rank most ninja develop 2 changes in chakra nature but we never saw jonin level tenten or any of the konoha 12 at jonin rank other than Neji and Sakura.",
                                                    "author": "lilgleesh1901",
                                                    "id": "jd5nnbi",
                                                    "parent_id": "t1_jd4ax9n",
                                                    "score": 22,
                                                    "created_utc": 1679444670.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "He didn't even bother to draw the fight 😂",
                                                    "author": "Quakson82736",
                                                    "id": "jd744v8",
                                                    "parent_id": "t1_jd4ax9n",
                                                    "score": 4,
                                                    "created_utc": 1679477261.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Tenten underrated because of her comparison to geniuses. She doesn’t have to be a genius to be the best ninja tool specialist.",
                                            "author": "lilgleesh1901",
                                            "id": "jd5nfbq",
                                            "parent_id": "t1_jd49e3l",
                                            "score": 16,
                                            "created_utc": 1679444574.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Tenten with that extreme speed",
                                    "author": "DevaPath_Winchester",
                                    "id": "jd4ykup",
                                    "parent_id": "t1_jd3t6tp",
                                    "score": 3,
                                    "created_utc": 1679434305.0,
                                    "replies": []
                                },
                                {
                                    "body": "Would she have beat Shikimaru, Hinata, or the sound ninja? Sasuke? Which matchup would Tenten have a good one on one with, I don’t think she ever really gets a good fight.",
                                    "author": "Silver-Animator-1905",
                                    "id": "jd67fzh",
                                    "parent_id": "t1_jd3t6tp",
                                    "score": 1,
                                    "created_utc": 1679453619.0,
                                    "replies": [
                                        {
                                            "body": "She would've beaten every single kunoichi except temari. I am not sure about Shikamaru.",
                                            "author": "Immediate_Ad_8138",
                                            "id": "jdd1854",
                                            "parent_id": "t1_jd67fzh",
                                            "score": 2,
                                            "created_utc": 1679583606.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "While it's true he did use the nine-tails chakra (HUGE advantage), his name is also Naruto. The show isn't called \"Neji\" lol. Poor Neji never stood a chance. Reminds me of Kabuto in the scene immediately after Naruto learned Rasengan. 😅",
                            "author": "holylink718",
                            "id": "jd44ds8",
                            "parent_id": "t1_jd3sfqx",
                            "score": 54,
                            "created_utc": 1679422904.0,
                            "replies": []
                        },
                        {
                            "body": "Neji would’ve won without the bs clone",
                            "author": "Unfair_Priority_3125",
                            "id": "jd4vazk",
                            "parent_id": "t1_jd3sfqx",
                            "score": -13,
                            "created_utc": 1679433056.0,
                            "replies": [
                                {
                                    "body": "Okay, but considering how intense Kurama’s Chakra tends to be, it’d be pretty hard to be a Ninja if your hands have nothing but 3rd degree burns on them and lose the ability to channel chakra to them, and that’s not if Naruto figures out Killing Intent over the prior month and gives all present Pissed Off Kushina flashbacks, flashbacks to the worst Birthday Naruto ever had, or flashbacks to when his eldest brother got fed up with his shenanigans in Shukaku’s case, and there’s also if Naruto ends up learning seals and by extension the Hiraishin, how to unfuck his Waifu’s family, and the Rasengan which might result in Iwa slapping him with the same designation as his dad A.K.A. Flee on sight",
                                    "author": "Ashbr1ng3r",
                                    "id": "jd626gj",
                                    "parent_id": "t1_jd4vazk",
                                    "score": 2,
                                    "created_utc": 1679451133.0,
                                    "replies": [
                                        {
                                            "body": "Huh?",
                                            "author": "afrika210",
                                            "id": "jd6wds7",
                                            "parent_id": "t1_jd626gj",
                                            "score": 3,
                                            "created_utc": 1679470515.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I didn't get a thing yoh said but it felt great to listen to u🙂",
                                            "author": "Dark_Silver007",
                                            "id": "jd6x2z7",
                                            "parent_id": "t1_jd626gj",
                                            "score": 2,
                                            "created_utc": 1679471110.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For real. Gaara was the only person that would’ve defeated Lee at this stage, Temari’s wind moves were a perfect counter to Tenten’s style, and Neji had to fight the protagonist. They got screwed lmao",
                    "author": "whalemix",
                    "id": "jd4nzm6",
                    "parent_id": "t1_jd3k88r",
                    "score": 102,
                    "created_utc": 1679430319.0,
                    "replies": [
                        {
                            "body": "Exactly my point",
                            "author": "JayDaGod1206",
                            "id": "jd4o30h",
                            "parent_id": "t1_jd4nzm6",
                            "score": 20,
                            "created_utc": 1679430353.0,
                            "replies": []
                        },
                        {
                            "body": "That's the point of the exams though. The straws are served  at random, and either through strategy or skill they have to get the best possible outcome. \n\nLee would've absolutely moved on in just the ability to show the mastery of the inner gates. Naruto won against neji but got lucky and relied on a crutch and was not offered the promotion. \n\nShikamaru was completely out matched skill wise vs temari, however he displayed his critical thinking skills in such a way that it even impressed the black ops. Even though it was a tie / loss and a boring match. Ten Ten failed herself. And neji was way to over confidant.",
                            "author": "DylanMartin97",
                            "id": "jd7a4fa",
                            "parent_id": "t1_jd4nzm6",
                            "score": 5,
                            "created_utc": 1679482029.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "2 Jinchurikis and the daughter of a Kage (well all 3 were children of Kages)",
                    "author": "I_C_Weiner__",
                    "id": "jd618jc",
                    "parent_id": "t1_jd3k88r",
                    "score": 10,
                    "created_utc": 1679450698.0,
                    "replies": []
                },
                {
                    "body": "bro was born with magic eyes that had xray vision. it was a fair fight. he just wasn't the main character",
                    "author": "darkkite",
                    "id": "jd5nzw3",
                    "parent_id": "t1_jd3k88r",
                    "score": 14,
                    "created_utc": 1679444821.0,
                    "replies": [
                        {
                            "body": "That’s my point. He had the misfortune of being placed against the main protagonist",
                            "author": "JayDaGod1206",
                            "id": "jd5otsr",
                            "parent_id": "t1_jd5nzw3",
                            "score": 23,
                            "created_utc": 1679445186.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Counterpoint: Neiji pulled *Hinata* in the prelims.",
                    "author": "SlightlySychotic",
                    "id": "jd7zfo5",
                    "parent_id": "t1_jd3k88r",
                    "score": 3,
                    "created_utc": 1679495027.0,
                    "replies": []
                },
                {
                    "body": "Yeah really tenten got fucked over the most. She already wasn't the best but then any advantage she could have had just went to 0. Neji had the better chance but lost to plot armor lol.",
                    "author": "Sakosaga",
                    "id": "jd7gu6r",
                    "parent_id": "t1_jd3k88r",
                    "score": 2,
                    "created_utc": 1679486300.0,
                    "replies": []
                },
                {
                    "body": "You know you're fucked when you match up against the main character",
                    "author": "electrorazor",
                    "id": "jd8tbhh",
                    "parent_id": "t1_jd3k88r",
                    "score": 1,
                    "created_utc": 1679506434.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gai-sensei wanted to see his bro and hang out together.",
            "author": "RadleyCunningham",
            "id": "jd40k15",
            "parent_id": "t3_11xhchj",
            "score": 264,
            "created_utc": 1679421458.0,
            "replies": [
                {
                    "body": "The real answer",
                    "author": "__sublime__1",
                    "id": "jd43plt",
                    "parent_id": "t1_jd40k15",
                    "score": 57,
                    "created_utc": 1679422650.0,
                    "replies": []
                },
                {
                    "body": "I mean they see each other all the time already given does constantly challenge Kakashi.",
                    "author": "Cautious-Affect7907",
                    "id": "jd5h4yi",
                    "parent_id": "t1_jd40k15",
                    "score": 16,
                    "created_utc": 1679441869.0,
                    "replies": [
                        {
                            "body": "Unlike anime, in manga we see Kakashi rather trying to avoid Gai's challenges...  \nor... just Gai alone.",
                            "author": "DrunkSaruman",
                            "id": "jd82ln8",
                            "parent_id": "t1_jd5h4yi",
                            "score": 2,
                            "created_utc": 1679496303.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lee did pretty good compared to all the rest. Gaara solos whole chunnin exam lol",
            "author": "Zeus21-",
            "id": "jd42c54",
            "parent_id": "t3_11xhchj",
            "score": 225,
            "created_utc": 1679422128.0,
            "replies": [
                {
                    "body": "Except Sasuke when he chidori'ed his ass.\n\nAnd Naruto when he headbutt'ed his ass.",
                    "author": "Goofydood9",
                    "id": "jd5g73y",
                    "parent_id": "t1_jd42c54",
                    "score": 54,
                    "created_utc": 1679441464.0,
                    "replies": [
                        {
                            "body": "I doubt Gaara beating Neji as well.",
                            "author": "death_warrant",
                            "id": "jd66hqv",
                            "parent_id": "t1_jd5g73y",
                            "score": 6,
                            "created_utc": 1679453165.0,
                            "replies": [
                                {
                                    "body": "Would be a good match but gaara wins. I dont see neji coming near gaara to disable his chakra points.",
                                    "author": "Shadow_Clone_007",
                                    "id": "jd6bla3",
                                    "parent_id": "t1_jd66hqv",
                                    "score": 44,
                                    "created_utc": 1679455757.0,
                                    "replies": [
                                        {
                                            "body": "Neji could dismantle the sand constructs by injecting chakra into them.\n\nHe can use kaiten to repel attacks\n\nAnd use full body blow in case he's caught in sand burial.\n\nThere's a reason why Kankuro and Temari considered him as much a monster as Gaara",
                                            "author": "Blood-Emperor",
                                            "id": "jd6zxb7",
                                            "parent_id": "t1_jd6bla3",
                                            "score": 9,
                                            "created_utc": 1679473572.0,
                                            "replies": [
                                                {
                                                    "body": ">Neji could dismantle the sand constructs by injecting chakra into them.\n\nWould this work? The sand is not like a body which has Chakra points.",
                                                    "author": "MrInfinitumEnd",
                                                    "id": "jd73t0s",
                                                    "parent_id": "t1_jd6zxb7",
                                                    "score": 7,
                                                    "created_utc": 1679476985.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
                                                            "author": "Blood-Emperor",
                                                            "id": "jd746oe",
                                                            "parent_id": "t1_jd73t0s",
                                                            "score": 9,
                                                            "created_utc": 1679477302.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Lee was also attacking the sand with punches and kicks and just about won and I firmly put Neji above Lee. I highly doubt Gaara wants those problems.",
                                                    "author": "death_warrant",
                                                    "id": "jd73t2h",
                                                    "parent_id": "t1_jd6zxb7",
                                                    "score": 3,
                                                    "created_utc": 1679476986.0,
                                                    "replies": [
                                                        {
                                                            "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
                                                            "author": "Blood-Emperor",
                                                            "id": "jd74eck",
                                                            "parent_id": "t1_jd73t2h",
                                                            "score": 7,
                                                            "created_utc": 1679477480.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That’s because Gaara was actively hallucinating during that’s fight.",
                            "author": "That_opossum",
                            "id": "jetrplu",
                            "parent_id": "t1_jd5g73y",
                            "score": 1,
                            "created_utc": 1680551239.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How do y'all think neji would have done against temari at this stage?",
            "author": "offendingotter",
            "id": "jd31gpn",
            "parent_id": "t3_11xhchj",
            "score": 184,
            "created_utc": 1679407737.0,
            "replies": [
                {
                    "body": "Neji beat the shit out of her. One 64 Palms and it's over",
                    "author": "Born-Middle-8815",
                    "id": "jd3ke3r",
                    "parent_id": "t1_jd31gpn",
                    "score": 208,
                    "created_utc": 1679415336.0,
                    "replies": [
                        {
                            "body": "I’m pretty certain Neji could have beaten the three sound ninja that stomped Lee on his own.",
                            "author": "HeraldofblueRP",
                            "id": "jd3vypr",
                            "parent_id": "t1_jd3ke3r",
                            "score": 125,
                            "created_utc": 1679419727.0,
                            "replies": [
                                {
                                    "body": "Dosu was shaking in fear from Neji's gaze. Neji smokes them",
                                    "author": "Born-Middle-8815",
                                    "id": "jd3w71o",
                                    "parent_id": "t1_jd3vypr",
                                    "score": 101,
                                    "created_utc": 1679419814.0,
                                    "replies": [
                                        {
                                            "body": "Wasn’t that the aura from Sasuke’s curse mark?",
                                            "author": "X-Force-32",
                                            "id": "jd43p8i",
                                            "parent_id": "t1_jd3w71o",
                                            "score": 4,
                                            "created_utc": 1679422646.0,
                                            "replies": [
                                                {
                                                    "body": "That happened later. When Neji activated Byakugan, Dosu trembled a bit",
                                                    "author": "Born-Middle-8815",
                                                    "id": "jd43z0h",
                                                    "parent_id": "t1_jd43p8i",
                                                    "score": 55,
                                                    "created_utc": 1679422750.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Now to be fair, Lee was holding back like a mf there, If he'd taken off his weights or used any of the gates, he could have happily murdered the lot of them with no trouble",
                                    "author": "Teh-Cthulhu",
                                    "id": "jd6k6x1",
                                    "parent_id": "t1_jd3vypr",
                                    "score": 8,
                                    "created_utc": 1679460960.0,
                                    "replies": [
                                        {
                                            "body": "He used the first gate for primary lotus",
                                            "author": "HeraldofblueRP",
                                            "id": "jd7o8k0",
                                            "parent_id": "t1_jd6k6x1",
                                            "score": 2,
                                            "created_utc": 1679490130.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah sure the primary lotus but thats practically negligible compared to the effects of the other gates",
                                                    "author": "Teh-Cthulhu",
                                                    "id": "jd7qu65",
                                                    "parent_id": "t1_jd7o8k0",
                                                    "score": 0,
                                                    "created_utc": 1679491340.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Idk how. But at this point in the story, neji was supposed to be the byakugan badass😂. He would have beat teamari.",
                    "author": "__akshittt",
                    "id": "jd3tw6k",
                    "parent_id": "t1_jd31gpn",
                    "score": 38,
                    "created_utc": 1679418953.0,
                    "replies": []
                },
                {
                    "body": "If Temari manages to keep a long distance between them and keep whooshing Neji away she probably stands a solid chance of winning, but if Neji closes the gap enough to strike her chakra points it would be over for her.",
                    "author": null,
                    "id": "jd3buk9",
                    "parent_id": "t1_jd31gpn",
                    "score": 54,
                    "created_utc": 1679412024.0,
                    "replies": [
                        {
                            "body": "She doesn't at all. Neji would slap her wind attacks away",
                            "author": "Blood-Emperor",
                            "id": "jd700lx",
                            "parent_id": "t1_jd3buk9",
                            "score": 2,
                            "created_utc": 1679473652.0,
                            "replies": [
                                {
                                    "body": "How? Best he could do is use rotation to deflect them, but Temari is relentless especially if she summons that weasel thing",
                                    "author": null,
                                    "id": "jd703os",
                                    "parent_id": "t1_jd700lx",
                                    "score": 0,
                                    "created_utc": 1679473727.0,
                                    "replies": [
                                        {
                                            "body": "Again, Neji would slap everything away😂😂😂\n\nJyuken. Temari's attacks are made from chakra. And the weasel would also get slapped away.\n\nThis Neji, Taijutsu specialist. Have you seen what he could do against his worst possible enemy, known as Kidomaru, who had stronger, numerous and faster attacks beyond what Temari has?",
                                            "author": "Blood-Emperor",
                                            "id": "jd70d14",
                                            "parent_id": "t1_jd703os",
                                            "score": 3,
                                            "created_utc": 1679473964.0,
                                            "replies": [
                                                {
                                                    "body": "If it's chakra and not wind and vulnerable to chakra dispelling then yeah, Neji wins",
                                                    "author": null,
                                                    "id": "jd71vq4",
                                                    "parent_id": "t1_jd70d14",
                                                    "score": 1,
                                                    "created_utc": 1679475303.0,
                                                    "replies": [
                                                        {
                                                            "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
                                                            "author": "Blood-Emperor",
                                                            "id": "jd730kt",
                                                            "parent_id": "t1_jd71vq4",
                                                            "score": 2,
                                                            "created_utc": 1679476297.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I wonder, did Neji only know Hyuga palm techniques? What about nature attacks? If he had nature attacks too he would be more of a complete ninja...\n\nThe Palm techniques on their own are cool but with chakra nature attacks, the ninja is more complete, has better stats.",
                            "author": "MrInfinitumEnd",
                            "id": "jd74209",
                            "parent_id": "t1_jd3buk9",
                            "score": 1,
                            "created_utc": 1679477195.0,
                            "replies": [
                                {
                                    "body": "It's likely that Gentle Fist takes a lifetime to master and in order to become really competent at it you need to devote all your time to it, so no learning chakra transformation or anything beyond basic ninja techniques.",
                                    "author": null,
                                    "id": "jd75vqm",
                                    "parent_id": "t1_jd74209",
                                    "score": 2,
                                    "created_utc": 1679478715.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He’d have won",
                    "author": "haunted_ramens",
                    "id": "jd4dugb",
                    "parent_id": "t1_jd31gpn",
                    "score": 5,
                    "created_utc": 1679426503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lee vs Gaara is still one of my all time favorite fights in the series. Really, thinking back on it, most of my favorite fights are Lee or Gai. Opening the gates and beating the piss out of someone is just more entertaining to watch than people throwing ninjutsu at each other from 30ft away.",
            "author": "No_Seaweed6739",
            "id": "jd4f0sl",
            "parent_id": "t3_11xhchj",
            "score": 90,
            "created_utc": 1679426955.0,
            "replies": [
                {
                    "body": "Drunken boxing one was good",
                    "author": "Matiti60",
                    "id": "jd53p3e",
                    "parent_id": "t1_jd4f0sl",
                    "score": 43,
                    "created_utc": 1679436298.0,
                    "replies": [
                        {
                            "body": "Give lee a bottle of jack he would’ve soloed kaguya",
                            "author": "No_Seaweed6739",
                            "id": "jd5ik64",
                            "parent_id": "t1_jd53p3e",
                            "score": 35,
                            "created_utc": 1679442463.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I liked when Shino threatened to blow the guys arms off and the teachers were like 'nah, he's bluffing' but then he did. Also Shino vs Kankuro. Basically, Shino when he was good.",
                    "author": "Jack-The-Reddit",
                    "id": "jd78rxr",
                    "parent_id": "t1_jd4f0sl",
                    "score": 6,
                    "created_utc": 1679481030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Neji lost by thinking he already won the fight",
            "author": "TheUnsnappedTag",
            "id": "jd3ukn9",
            "parent_id": "t3_11xhchj",
            "score": 136,
            "created_utc": 1679419207.0,
            "replies": [
                {
                    "body": "He could have won at any point if he just continued beating the shit out of naruto instead of telling him his life story",
                    "author": "louai-MT",
                    "id": "jd477u6",
                    "parent_id": "t1_jd3ukn9",
                    "score": 172,
                    "created_utc": 1679423982.0,
                    "replies": []
                },
                {
                    "body": "Neji thought he was the chosen one little did he know did Naruto was the reincarnation of a alien ninja god",
                    "author": "ChineseNeptune",
                    "id": "jd44l6r",
                    "parent_id": "t1_jd3ukn9",
                    "score": 94,
                    "created_utc": 1679422983.0,
                    "replies": [
                        {
                            "body": "Kishimoto himself didn’t know Naruto was the reincarnation of an alien demigod back then.",
                            "author": "ZillaJrKaijuKing",
                            "id": "jd4mqke",
                            "parent_id": "t1_jd44l6r",
                            "score": 39,
                            "created_utc": 1679429864.0,
                            "replies": [
                                {
                                    "body": "The signs were all there, you just need to go big brain",
                                    "author": "ChineseNeptune",
                                    "id": "jd58los",
                                    "parent_id": "t1_jd4mqke",
                                    "score": 23,
                                    "created_utc": 1679438321.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Little did he know the name of the anime is Naruto",
                            "author": "guymanthing",
                            "id": "jd6ow5t",
                            "parent_id": "t1_jd44l6r",
                            "score": 5,
                            "created_utc": 1679464391.0,
                            "replies": []
                        },
                        {
                            "body": "I haven't been watching Boruto... wtf am i missing?",
                            "author": "khovel",
                            "id": "je9lfxd",
                            "parent_id": "t1_jd44l6r",
                            "score": 1,
                            "created_utc": 1680179834.0,
                            "replies": [
                                {
                                    "body": "Kaguya is a space alien god",
                                    "author": "ChineseNeptune",
                                    "id": "je9rzym",
                                    "parent_id": "t1_je9lfxd",
                                    "score": 1,
                                    "created_utc": 1680183021.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Neji lost by bullshit tbh. Wrecks naruto the whole fight and then gets beat by a single punch. Honestly worst fight in the exams.",
                    "author": "StockPassenger2994",
                    "id": "jd4da2k",
                    "parent_id": "t1_jd3ukn9",
                    "score": 36,
                    "created_utc": 1679426283.0,
                    "replies": [
                        {
                            "body": "It's like real life. You can throw a bunch of punches, sure. But if you can't take a punch, better not get hit.",
                            "author": "nottme1",
                            "id": "jd4ioxc",
                            "parent_id": "t1_jd4da2k",
                            "score": 14,
                            "created_utc": 1679428346.0,
                            "replies": [
                                {
                                    "body": "Wtf are you on. If it were like real life then naruto suffered the equivalent of his nervous system failing and then still managed ro throw a punch and knock out the strongest genin in the leaf. If it wasn't for the emotional impact and character development behind the fight it'd probably be the worst of the series",
                                    "author": "StockPassenger2994",
                                    "id": "jd4jptu",
                                    "parent_id": "t1_jd4ioxc",
                                    "score": 26,
                                    "created_utc": 1679428732.0,
                                    "replies": [
                                        {
                                            "body": "Naruto punched him square in the jaw though.\n\nIf you’ve ever been punched in the jaw before, it can rattle your brain and make you dizzy sometimes if you’re hit real hard you could get knocked the f out.",
                                            "author": "Cautious-Affect7907",
                                            "id": "jd5hi19",
                                            "parent_id": "t1_jd4jptu",
                                            "score": 8,
                                            "created_utc": 1679442022.0,
                                            "replies": [
                                                {
                                                    "body": "Have you ever been punched 64 times across your whole body effectively destroying your second nervousvdystem\n\nNaruto pulled some goofy ass shenanigans",
                                                    "author": "fuckedbyturtles",
                                                    "id": "jd5nxzn",
                                                    "parent_id": "t1_jd5hi19",
                                                    "score": 4,
                                                    "created_utc": 1679444797.0,
                                                    "replies": [
                                                        {
                                                            "body": "More like poked 64 times but your point still stands.",
                                                            "author": "Valedictorian117",
                                                            "id": "jd69xpa",
                                                            "parent_id": "t1_jd5nxzn",
                                                            "score": 2,
                                                            "created_utc": 1679454878.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                                                                    "author": "Individual-Ad9753",
                                                                    "id": "jd6pay3",
                                                                    "parent_id": "t1_jd69xpa",
                                                                    "score": 3,
                                                                    "created_utc": 1679464707.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
                                                            "author": "FantasticDucks",
                                                            "id": "jd7omj4",
                                                            "parent_id": "t1_jd5nxzn",
                                                            "score": 2,
                                                            "created_utc": 1679490317.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                                                                    "author": "fuckedbyturtles",
                                                                    "id": "jd9zibu",
                                                                    "parent_id": "t1_jd7omj4",
                                                                    "score": 0,
                                                                    "created_utc": 1679522607.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It’s called suspension of disbelief.",
                                                                            "author": "That_opossum",
                                                                            "id": "jettyom",
                                                                            "parent_id": "t1_jd9zibu",
                                                                            "score": 1,
                                                                            "created_utc": 1680552114.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I agree but plot armor saved Naruto more than I can count",
                                                                                    "author": "fuckedbyturtles",
                                                                                    "id": "jetxeml",
                                                                                    "parent_id": "t1_jettyom",
                                                                                    "score": 1,
                                                                                    "created_utc": 1680553451.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                                                                            "author": "That_opossum",
                                                                                            "id": "jeudrrj",
                                                                                            "parent_id": "t1_jetxeml",
                                                                                            "score": 1,
                                                                                            "created_utc": 1680560088.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
                                                            "author": "Previous_Royal2168",
                                                            "id": "jd7958r",
                                                            "parent_id": "t1_jd5nxzn",
                                                            "score": 1,
                                                            "created_utc": 1679481314.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He technically did win the fight he sealed all of Naruto’s natural chakra",
                    "author": "Fetial",
                    "id": "jd4mveq",
                    "parent_id": "t1_jd3ukn9",
                    "score": 7,
                    "created_utc": 1679429908.0,
                    "replies": []
                },
                {
                    "body": "Tbf who could've predicted that a tired injured boy could dig an entire underground tunnel in a short time not displacing the dirt in such a way or making noise that would give him away using ONLY his hands? Setting aside ninja magic that feat is some actual bullshit in Narutos favor.",
                    "author": "TheOnlyFraen",
                    "id": "jd71noc",
                    "parent_id": "t1_jd3ukn9",
                    "score": 3,
                    "created_utc": 1679475110.0,
                    "replies": [
                        {
                            "body": "Lol, this is actually crazy. Neji's arrogance played a role though.",
                            "author": "MrInfinitumEnd",
                            "id": "jd74af2",
                            "parent_id": "t1_jd71noc",
                            "score": 1,
                            "created_utc": 1679477388.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aside from ten ten being trash both his other students were fighting against jinchurikis.",
            "author": "bilbo_swagginz_boi",
            "id": "jd40rkr",
            "parent_id": "t3_11xhchj",
            "score": 115,
            "created_utc": 1679421537.0,
            "replies": [
                {
                    "body": "And Temari isn’t exactly weak either. Like a few weeks after that she cuts down a small forest with just one technique.",
                    "author": "Renkin92",
                    "id": "jd44bvg",
                    "parent_id": "t1_jd40rkr",
                    "score": 79,
                    "created_utc": 1679422885.0,
                    "replies": [
                        {
                            "body": "I often forget that Part 1's timeline is at least under a year…",
                            "author": "Electrifying-Guy-Eli",
                            "id": "jd6mcvi",
                            "parent_id": "t1_jd44bvg",
                            "score": 2,
                            "created_utc": 1679462489.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tenten isn't weak SHe Rained Irons and could beat most of them  \n**Sakura** \\- very easy, Rained!  \n**Choji**\\- Big Target too easy for her  \n**Guy who Lost to Sasuke**\\- Rained!  \n**Guy Who Lost to Kankuro** \\- Rained!  \n**Shikamaru**\\- His shadow and thinking wont stop Iron rains  \n**Shino**\\- Bugs will help him little but still Rained  \n**Kin**\\- Nidlde bells  vs 10000 kunais? in her dream  \n**Ino**\\- running from Iron rain and mind transfer? very slim chance! 85% Rained!  \n**Zaku-** he might has chance but it's about durability he's injured and doesn't has much.  \n**Hinata**\\- She's weaker version of neji maybe she can maybe she can't  \n**Naruto** \\- He wasn't good shape when he been fighting kiba. he won't give up but judge will stop cause too dangerous to be rained again.  \n**Sasuke**\\- Weak version of him needs one good shot (Lee's copy) or he will loss  \n**Kankuro** \\- Depends who use weapons Better? 55% on Kankuro I think  \n**Dosu**\\- if she keep distance she will be fine but he's fast, not easy.  \n**Hinata**\\- She's weaker version of neji maybe she can maybe she can't  \n**Lee**\\- he won't take off weights or Gates (Guy wouldn't allow it against tenten) He'll win not easily  \n**Kiba**(edit for takamurarules comment)- fang over fang is bad match up  \n**Temari**\\- Bad match up  \n**Neji**\\- Forget it, He's Superior  \n**Gaara**\\- Guy will save her from him.  \n\n\nEdited and fixed some mistake thank Quick\\_Camping4358 for pointing out.",
                    "author": "Lexcomp7",
                    "id": "jd4vs7b",
                    "parent_id": "t1_jd40rkr",
                    "score": 15,
                    "created_utc": 1679433236.0,
                    "replies": [
                        {
                            "body": "Kiba’s fang over fang repels weapons so that would probably be a bad matchup too.",
                            "author": "Takamurarules",
                            "id": "jd58hw6",
                            "parent_id": "t1_jd4vs7b",
                            "score": 8,
                            "created_utc": 1679438276.0,
                            "replies": []
                        },
                        {
                            "body": "Read it again, you repeated some guys",
                            "author": "Formal_Mundane",
                            "id": "jd612sr",
                            "parent_id": "t1_jd4vs7b",
                            "score": 3,
                            "created_utc": 1679450625.0,
                            "replies": [
                                {
                                    "body": "yeah I thought I deleted it.",
                                    "author": "Lexcomp7",
                                    "id": "jd7tq7j",
                                    "parent_id": "t1_jd612sr",
                                    "score": 1,
                                    "created_utc": 1679492640.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You forgot Zaku who might actually have a chance against her",
                            "author": "Quick_Campaign4358",
                            "id": "jd7l4aa",
                            "parent_id": "t1_jd4vs7b",
                            "score": 2,
                            "created_utc": 1679488598.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eh. Rock Lee got the worst possible matchup, Neji got matched against a MC, and for Tenten is Tenten.",
            "author": "velicinanijebitna",
            "id": "jd4loph",
            "parent_id": "t3_11xhchj",
            "score": 17,
            "created_utc": 1679429472.0,
            "replies": []
        },
        {
            "body": "Lee did pretty well but he was put against fucking gaara man, and gaara was an absolute beast at this point, Tenten was pretty skilled but against temari with wind she didn’t stand a chance, and neji had to fight the main character with 9 tails chakra so he was practically always destined to lose 😭",
            "author": "Practical_Door_1934",
            "id": "jd4mz12",
            "parent_id": "t3_11xhchj",
            "score": 17,
            "created_utc": 1679429942.0,
            "replies": [
                {
                    "body": "Yep, he was fight against a modern Ashura xd. Although Ashura wasn't skillful, he was a joke compared to Indra in terms of skills.",
                    "author": "MrInfinitumEnd",
                    "id": "jd74xoy",
                    "parent_id": "t1_jd4mz12",
                    "score": 2,
                    "created_utc": 1679477932.0,
                    "replies": []
                },
                {
                    "body": "*savage beast",
                    "author": "ObjectFancy",
                    "id": "jd626lm",
                    "parent_id": "t1_jd4mz12",
                    "score": 1,
                    "created_utc": 1679451135.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It gets worse the more you think about it:\n\n1) Lee lost to a natural prodigy with an unfair advantage since birth, thus shattering his conception that hard work can overcome natural talent.\n\n2) Neji lost to a guy preaching about the value of hard work while also being naturally gifted with what was essentially a cheat code for chakra reserves (and would later turn out to actually be a child of destiny)\n\n3) And Ten Ten got beat so badly that in the manga her fight was entirely off panel.",
            "author": "Subject_Tutor",
            "id": "jd5vt6a",
            "parent_id": "t3_11xhchj",
            "score": 16,
            "created_utc": 1679448266.0,
            "replies": [
                {
                    "body": "Because Kishi was probably making it up as he goes",
                    "author": null,
                    "id": "jd71tna",
                    "parent_id": "t1_jd5vt6a",
                    "score": 3,
                    "created_utc": 1679475254.0,
                    "replies": [
                        {
                            "body": "Oh yeah definitely. He clearly had a general idea (ninjas, fox demon, plucky main character goes to extreme lengths to save his best friend) but he stretched it out way too thin after shippuden and some parts were clearly written by the seat of his pants.",
                            "author": "Subject_Tutor",
                            "id": "jd75vde",
                            "parent_id": "t1_jd71tna",
                            "score": 3,
                            "created_utc": 1679478706.0,
                            "replies": [
                                {
                                    "body": "Pretty much, yeah. It's a shame really a bit more focus and diligence (especially for the female characters) and Naruto would've been a masterpiece, and I don't say this lightly as an anime hater.",
                                    "author": null,
                                    "id": "jd768g2",
                                    "parent_id": "t1_jd75vde",
                                    "score": 1,
                                    "created_utc": 1679479004.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lee and Tenten got paired with jonin level shinobi pretending to be genin. Lee was fighting a Jinchuriki. \n\nPeople like to pretend that Temari lost against Shikamaru, but she didn’t. Shikamaru lost. He just outsmarted her for 10 seconds. He was trying to prove a point, that he can outsmart her and catch her with Kagemane, in order to look good to the audience, he probably wasn’t even aiming to win, because he knew she was stronger. Had the fight continue she would’ve destroyed Shikamaru. It wasn’t necessary because he knew that and gave up. Tenten losing against Temari is completely acceptable. She’s on a whole different level from any of them. She could probably go against Neji and Sasuke (pre-Kakashi training) and win. \n\nNeji lost because he blocked Naruto’s chakra points, which made it possible for him to acces Kurama’s chakra. Had that not happend, Neji would’ve won. Most of it was a series of unfortunate events for Team Gai.",
            "author": "EmmaThais",
            "id": "jd4ajk3",
            "parent_id": "t3_11xhchj",
            "score": 66,
            "created_utc": 1679425229.0,
            "replies": [
                {
                    "body": ">People like to pretend that Temari lost against Shikamaru, but she didn’t. Shikamaru lost. He just outsmarted her for 10 seconds\n\nHe didn't outsmart her for 10 seconds, he outsmarted her the entire match. Everything he did was for his final plan. He even stated he thought even more moves ahead had she not fell for the last trap. \n\nHe gave up fighting because he was lazy and low Chakra. He didn't feel like continuing under those circumstances. Remember he didn't care so much about winning, just not losing on her terms.",
                    "author": "OhGoshIts",
                    "id": "jd5cefv",
                    "parent_id": "t1_jd4ajk3",
                    "score": 28,
                    "created_utc": 1679439882.0,
                    "replies": [
                        {
                            "body": "“He gave up fighting because he was low on chakra” - That’s losing.",
                            "author": "EmmaThais",
                            "id": "jd5hv1y",
                            "parent_id": "t1_jd5cefv",
                            "score": 20,
                            "created_utc": 1679442173.0,
                            "replies": [
                                {
                                    "body": "Consider it from this perspective: Had Shikamaru won, he would've had to fight Shino. Had he beat Shino, he would've had to fight either Naruto or Gaara (Sasuke was late, and only managed to stay in the fight based on Orochimaru convincing Hiruzen to keep him in).\n\nShikamaru knew this (not the stuff with Sasuke). He knew he'd have to fight Shino, and Naruto or Gaara.\n\nThis *context* is important, because it means his line about being low on chakra doesn't necessarily mean \"if this fight continues, I will run out of chakra, then lose.\" It very well could mean \"I could continue this fight for a while longer, but I might not have enough chakra for the rest of the tournament.\"\n\nHe did not need to win *to win*. The tournament isn't about who the best fighter is. It's about showing off your new toys to the world, and showing off whether someone would make a capable chunin.\n\nShikamaru did not lose. He forfeited. He could've won had he wanted to, but that would mean he'd be up against his next opponent. If he goes up against another fighter, he might not have enough chakra to make a good showing, which would ruin the previous fight retroactively. Him forfeiting means Temari won the battle but lost the war. *Everyone* now knows that Temari only won because Shikamaru decided to forfeit, and then she'd be forced to fight against Shino.\n\nAlso, Tamari, Kankuro, and Gaara are not jonin level shinobi. They're *chunin* at the most. Gaara's only point in his favour is that he's got a nuke inside him, but he does *not* have the skill for jonin at that time.\n\nEDIT: The way Shikamaru losing the next fight would hurt his previous fight, is due to it sending some very specific messages to the audience. First off: he's a good strategist, but he needs to learn his limits. Or, perhaps, Shikamaru had a month to prepare against Temari, maybe part of his failure was not being able to think on the fly? Or his loss would just erase his previous fight in some eyes.",
                                    "author": "advena_phillips",
                                    "id": "jd6ujoh",
                                    "parent_id": "t1_jd5hv1y",
                                    "score": 11,
                                    "created_utc": 1679468956.0,
                                    "replies": [
                                        {
                                            "body": "Now I wanna see Shikamaru vs Shino - the two people who faked out being asleep in the stadium.",
                                            "author": "Jack-The-Reddit",
                                            "id": "jd793an",
                                            "parent_id": "t1_jd6ujoh",
                                            "score": 5,
                                            "created_utc": 1679481272.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "This is an excellent comment 👏. I hadn't thought of the fight of Shikamaru with Temari that way.",
                                            "author": "MrInfinitumEnd",
                                            "id": "jd74p4n",
                                            "parent_id": "t1_jd6ujoh",
                                            "score": 1,
                                            "created_utc": 1679477735.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "And it's fine because in order to win, sometimes you have to lose.",
                                    "author": "ChunkyChuckles",
                                    "id": "jd6g2ok",
                                    "parent_id": "t1_jd5hv1y",
                                    "score": 3,
                                    "created_utc": 1679458328.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neji made it to the finals right, thats something. But ya the year before probably would've been nicer to em",
            "author": "bigstillz",
            "id": "jd4hl3n",
            "parent_id": "t3_11xhchj",
            "score": 11,
            "created_utc": 1679427927.0,
            "replies": []
        },
        {
            "body": "To be fair Guy didn't delay a year, all the younger genin just went a year early",
            "author": "wilhayrog",
            "id": "jd4n9zv",
            "parent_id": "t3_11xhchj",
            "score": 10,
            "created_utc": 1679430052.0,
            "replies": []
        },
        {
            "body": "I felt so bad for naruto during this arc. Sasuke uses copy paste no jutsu to pull of his version of the primary lotus and he’s a genius. Naruto does the same to thing without cheater eyes and Kakashi makes fun of him for being copy cat. Then he beats the strongest genin in the leaf, and people are like whatever, where’s Uchiha?",
            "author": "Felsig27",
            "id": "jd5b1hb",
            "parent_id": "t3_11xhchj",
            "score": 10,
            "created_utc": 1679439336.0,
            "replies": [
                {
                    "body": "Hold on a second you can’t say sasuke is cheating while ignoring the fact that naruto has a demon in him that gives him all the chakra he needs and is ninja Jesus.",
                    "author": "That_opossum",
                    "id": "jetupei",
                    "parent_id": "t1_jd5b1hb",
                    "score": 1,
                    "created_utc": 1680552408.0,
                    "replies": [
                        {
                            "body": "The 9 tails is often cheating, which is why I prefer sage naruto to any other powered up form by the end. But at this point in the story it was actually making him weaker, as Orochimaru has janked his seal, and Jiraya hadn’t fixed it yet, at least not before the Kiba fight, which is mostly where I thing Naruto got a bad wrap. Also, he didn’t use 9 tail chakra to defeat Kiba.",
                            "author": "Felsig27",
                            "id": "jeung1s",
                            "parent_id": "t1_jetupei",
                            "score": 1,
                            "created_utc": 1680564272.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lee did pretty well but he was put against fucking gaara man, and gaara was an absolute beast at this point, Tenten was pretty skilled but against temari with wind she didn’t stand a chance, and neji had to fight the main character with 9 tails chakra so he was practically always destined to lose 😭",
            "author": "Practical_Door_1934",
            "id": "jd4n04n",
            "parent_id": "t3_11xhchj",
            "score": 7,
            "created_utc": 1679429952.0,
            "replies": []
        },
        {
            "body": "Tbh i wonder how neji wouldve faired against gara.",
            "author": "burnerbaddie",
            "id": "jd4125m",
            "parent_id": "t3_11xhchj",
            "score": 10,
            "created_utc": 1679421647.0,
            "replies": [
                {
                    "body": "This would have not been a fight - it’s would be a BEATDOWN.\n\nNeji lacks the speed to counter Gaara’s shield and his palm jutsu is nothing against the ultimate defense (you must touch the opponent and have access to their unprotected body for this jutsu to work properly)\n\nNot even Naruto could have defeated Gaara in the Chunin Exams terms. Gaara at that moment had only one counter - Lee. Sasuke is also no since he doesn’t have Chidori at that moment, but with Chidori it’s bye bye Gaara.\n\nIf only Lee was smarter with utilazation of his powers, he would have wiped the floor with the Sand Jinchuriki.",
                    "author": "Olya_roo",
                    "id": "jd4psf5",
                    "parent_id": "t1_jd4125m",
                    "score": 14,
                    "created_utc": 1679430987.0,
                    "replies": [
                        {
                            "body": "Given that naruto had an extra seal messing with his chakra and blocking the 9 tails he would straight up lose even if they fought during the preliminary matches",
                            "author": "Visible-Effective944",
                            "id": "jd5cho0",
                            "parent_id": "t1_jd4psf5",
                            "score": 8,
                            "created_utc": 1679439918.0,
                            "replies": []
                        },
                        {
                            "body": "Lee wasn’t a counter at all. After that impressive showing it turned out to not even lay a single scratch on Gaara’s body. No one in the prelims was touching Gaara except Kabuto if he hadn’t quit.",
                            "author": "Valedictorian117",
                            "id": "jd6afqn",
                            "parent_id": "t1_jd4psf5",
                            "score": 0,
                            "created_utc": 1679455145.0,
                            "replies": []
                        },
                        {
                            "body": "The only thing is, Neji did have the speed to fight Garra.   He was stated to be as fast as weightless Lee at the time, who was shown to be able to land hits on Gaarra, only the gentle fist would be more effective since he's tatgeting chakra rather than a knockout.  \n\nIf Lee's primary lotus didn't task him as hard as it did, he would've got the same result as Sasuke without Gates and would've just had to figure out how to break the sand cocoon (probably would've needed the gates).",
                            "author": "IMSABU",
                            "id": "jd6fzdv",
                            "parent_id": "t1_jd4psf5",
                            "score": 0,
                            "created_utc": 1679458271.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tenten should be in a wheelchair from a landing like that 💀💀💀",
            "author": "Unknown_User_66",
            "id": "jd506lq",
            "parent_id": "t3_11xhchj",
            "score": 5,
            "created_utc": 1679434921.0,
            "replies": []
        },
        {
            "body": "Fuck you rock lee had the hardest fight of all",
            "author": "Forgetaboutit0001",
            "id": "jd52afh",
            "parent_id": "t3_11xhchj",
            "score": 5,
            "created_utc": 1679435735.0,
            "replies": []
        },
        {
            "body": "Agreed, so I guess it would come down to if they were aware of each other's abilities",
            "author": "offendingotter",
            "id": "jd3cd4k",
            "parent_id": "t3_11xhchj",
            "score": 8,
            "created_utc": 1679412224.0,
            "replies": []
        },
        {
            "body": "Neiji had the bad luck to be paired against the gutsiest ninja (who was actually the reincarnation of ninja god)",
            "author": "gengarvibes",
            "id": "jd512qj",
            "parent_id": "t3_11xhchj",
            "score": 4,
            "created_utc": 1679435264.0,
            "replies": []
        },
        {
            "body": "When your only impressive students both fight jinchuriki",
            "author": "BoobyTooth",
            "id": "jd58nkt",
            "parent_id": "t3_11xhchj",
            "score": 5,
            "created_utc": 1679438343.0,
            "replies": []
        },
        {
            "body": "Lee V Gaara was one of the sickest fights though let’s be real",
            "author": "hater94",
            "id": "jd6g7ds",
            "parent_id": "t3_11xhchj",
            "score": 4,
            "created_utc": 1679458408.0,
            "replies": []
        },
        {
            "body": "Its Neiji's fault for not recognizing his blindspot is underground. He still doesn't address it in his fight with Spiderguy, who in fairness doesn't even recognize it either.",
            "author": "JVOz671",
            "id": "jd62647",
            "parent_id": "t3_11xhchj",
            "score": 3,
            "created_utc": 1679451129.0,
            "replies": []
        },
        {
            "body": "To be fair, Neji DESERVED his loss for being such an arrogant dickwad.",
            "author": "Ryumancer",
            "id": "jd4hss7",
            "parent_id": "t3_11xhchj",
            "score": 6,
            "created_utc": 1679428007.0,
            "replies": []
        },
        {
            "body": "Neji and Naruto is probably one of the worst fights in the series.\n\nNaruto didn't outskill Neji, he used a Kurama boost to win.\n\nAnd unlike the Byakugan which you have to train *hard* to master it, and train excessively to use the gentle fist in way Neji did.\n\nNaruto just took a bootycrumb from Kurama and called it a day.\n\nI think it would've been cooler if he *refused* to use Kurama and beat Neji by insulting him and getting in his head, ultimately making him as sloppy as Naruto and costing him the match.",
            "author": "Koharu_Hidaka",
            "id": "jd4e7kf",
            "parent_id": "t3_11xhchj",
            "score": 9,
            "created_utc": 1679426643.0,
            "replies": [
                {
                    "body": "Naruto didn't choose to use Kurama. His chakara points got blocked, which allowed Kurama to feed his chakra to Naruto.",
                    "author": "nottme1",
                    "id": "jd4j863",
                    "parent_id": "t1_jd4e7kf",
                    "score": 14,
                    "created_utc": 1679428545.0,
                    "replies": [
                        {
                            "body": "At point in the series he only ever *chose* to get Kurama's chakra for Gamabunta.\n\nBut even then there's numerous examples of Kurama feeding Naruto chakra even without him having blocked chakra points.\n\nThe point being Naruto was almost destined to beat Neji:\n\nHe had way bigger chakra by default, if Neji tried fighting back then Kurama's chakra comes out and he loses.\n\nSo either way Neji's philosophy is proven correct with the only thing he got wrong was that *he'd* win instead of Naruto.\n\nThen y'know, Neji was born to die for the main branch and despite all the changes to the clan he chooses to die just like his father, just as fate planned.\n\nNeji never could run from fate as much as he tried.",
                            "author": "Koharu_Hidaka",
                            "id": "jd4ls9f",
                            "parent_id": "t1_jd4j863",
                            "score": 4,
                            "created_utc": 1679429509.0,
                            "replies": [
                                {
                                    "body": "His philosophy gotten proven right in the war Arc, but Narito still had to train in order to be able to access the 9 tails' power without being in a life and death circumstance and enraged.",
                                    "author": "Visible-Effective944",
                                    "id": "jd5cr7e",
                                    "parent_id": "t1_jd4ls9f",
                                    "score": 2,
                                    "created_utc": 1679440027.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tenten and Lee got hard countered and Neji was never going to win against the protag",
            "author": "romuli777",
            "id": "jd4vo1l",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679433193.0,
            "replies": []
        },
        {
            "body": "Nobody can convince me tenten realistically survived her fight with temari\n\nFalling from the air and landing back-first onto a metal fan",
            "author": "hibok1",
            "id": "jd4x6ma",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679433772.0,
            "replies": []
        },
        {
            "body": "DON'T TALK SHIT ABOUT MY BOY ROCK LEE. I'm pretty sure anyone without plot armor like Naruto would be dead moments after start of a fight.",
            "author": "Panwanilia1",
            "id": "jd4x6r7",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679433774.0,
            "replies": []
        },
        {
            "body": "Lee got snuck though so props to Lee",
            "author": "ExistingComposer4555",
            "id": "jd5g255",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679441406.0,
            "replies": []
        },
        {
            "body": "To be fair, lees fight with gaara was one of the most badass fights in the naruto verse, og and shippuden",
            "author": "ginsataka",
            "id": "jd6cmw7",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679456329.0,
            "replies": []
        },
        {
            "body": "2 of them losses were handed out by Sand village members.  1 from the son of the (then) kazekage, who was also a carrier of a beast.\n\n&#x200B;\n\n2 of the losses were in fact to Jinkuryiki.  Not all that much of a loss considering...",
            "author": "Kanus_oq_Seruna",
            "id": "jd6q4fo",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679465344.0,
            "replies": []
        },
        {
            "body": "The thing is, Lee easily could’ve beaten anyone else that was there. I \n\nHe got the short end of the stick with his matchup.",
            "author": "Cautious-Affect7907",
            "id": "jd5gyup",
            "parent_id": "t3_11xhchj",
            "score": 2,
            "created_utc": 1679441796.0,
            "replies": []
        },
        {
            "body": "Naruto was just better. Lee had a super unfair fight. And Tenten is literally tenten should we have expected anything else?",
            "author": "haunted_ramens",
            "id": "jd4dspw",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679426484.0,
            "replies": []
        },
        {
            "body": "Well, Neji should have won tbh.",
            "author": "BlueForte",
            "id": "jd47qum",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679424179.0,
            "replies": []
        },
        {
            "body": "Ten ten is just trash\nGarra cheated Lee should get at least one W he always get them stolen fr\nNaruto cheated",
            "author": "SchemeFlimsy6319",
            "id": "jd51gmm",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679435414.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jd3kije",
            "parent_id": "t3_11xhchj",
            "score": -9,
            "created_utc": 1679415384.0,
            "replies": [
                {
                    "body": "I mean he literally hit him once…..",
                    "author": "Massive-Lime7193",
                    "id": "jd3ksj8",
                    "parent_id": "t1_jd3kije",
                    "score": 17,
                    "created_utc": 1679415491.0,
                    "replies": []
                },
                {
                    "body": "In my opinion Sakura vs Ino was one the worst fights in the show",
                    "author": "Huge_Ad6338",
                    "id": "jd3md2b",
                    "parent_id": "t1_jd3kije",
                    "score": 9,
                    "created_utc": 1679416087.0,
                    "replies": [
                        {
                            "body": "That shit is not even a fight",
                            "author": "Born-Middle-8815",
                            "id": "jd3mgyi",
                            "parent_id": "t1_jd3md2b",
                            "score": 12,
                            "created_utc": 1679416128.0,
                            "replies": [
                                {
                                    "body": "Yeah",
                                    "author": "Huge_Ad6338",
                                    "id": "jd3mttz",
                                    "parent_id": "t1_jd3mgyi",
                                    "score": 2,
                                    "created_utc": 1679416263.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wrong, Naruto hit him once. But i agree that this fight sucks ass, Neji should have won",
                    "author": "yahzy",
                    "id": "jd3tjsc",
                    "parent_id": "t1_jd3kije",
                    "score": 9,
                    "created_utc": 1679418825.0,
                    "replies": []
                },
                {
                    "body": "He hit him twice",
                    "author": "SaintAhmad",
                    "id": "jd3tzmj",
                    "parent_id": "t1_jd3kije",
                    "score": 1,
                    "created_utc": 1679418988.0,
                    "replies": [
                        {
                            "body": "Any hit other than the KO?",
                            "author": "Born-Middle-8815",
                            "id": "jd3u8up",
                            "parent_id": "t1_jd3tzmj",
                            "score": 1,
                            "created_utc": 1679419084.0,
                            "replies": [
                                {
                                    "body": "The 9 tails chakra powered punch that collided with Neji’s rotation and [drilled him into the ground.](https://official-complete-2.eorzea.us/manga/Naruto/0104-013.png)\n\nI’d say that actually did the majority of the damage, the surprise uppercut KO wouldn’t be possible without it",
                                    "author": "SaintAhmad",
                                    "id": "jd3unxd",
                                    "parent_id": "t1_jd3u8up",
                                    "score": 2,
                                    "created_utc": 1679419241.0,
                                    "replies": [
                                        {
                                            "body": "Didn't Naruto's punch collide with the rotation which caused a huge explosion? It's more like Neji was out of chakra rather than psychically injured. If he was, then it would be from the shockwave, not Naruto's punch",
                                            "author": "Born-Middle-8815",
                                            "id": "jd3uz15",
                                            "parent_id": "t1_jd3unxd",
                                            "score": 2,
                                            "created_utc": 1679419358.0,
                                            "replies": [
                                                {
                                                    "body": "The shockwave is caused by the punch, so it’s still a significant hit. \n\nHeck, the proctor thought that alone was enough to take down [Neji](https://official-complete-2.eorzea.us/manga/Naruto/0104-011.png). And you can see how damaged Neji is following it, so it wasn’t just him being low on chakra.",
                                                    "author": "SaintAhmad",
                                                    "id": "jd3vrln",
                                                    "parent_id": "t1_jd3uz15",
                                                    "score": 4,
                                                    "created_utc": 1679419654.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Big oof!",
            "author": "Suberizu",
            "id": "jd4899p",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679424371.0,
            "replies": []
        },
        {
            "body": "NGL, we were robbed with Tenten. Her skill set has SO much potential, but Kishimoto didn't have the stones to show her being a badass! 😩",
            "author": "twinkletoes-rp",
            "id": "jd4hpdp",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679427971.0,
            "replies": []
        },
        {
            "body": "Just bad matchups",
            "author": "AdDazzling1892",
            "id": "jd4mdna",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679429733.0,
            "replies": []
        },
        {
            "body": "Skill issue",
            "author": "Professional-Line-82",
            "id": "jd4zhmg",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679434658.0,
            "replies": []
        },
        {
            "body": "Lol Gaara and Naruto were the 2 most powerful genin at the time.",
            "author": "AngBigKid",
            "id": "jd5t4at",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679447081.0,
            "replies": []
        },
        {
            "body": "None of them stood a chance. Rock Lee had no genjutsu or ninjitsu. Tenten and her weapons couldn’t even get close. But I feel Neji had it the worst due to plot armor.",
            "author": "tcs0",
            "id": "jd5ubg2",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679447606.0,
            "replies": []
        },
        {
            "body": "In martial arts competitions we call this [sandbagging](https://en.m.wikipedia.org/wiki/Sandbagging_(grappling\\)).",
            "author": "cptstupendous",
            "id": "jd5ydi0",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679449401.0,
            "replies": []
        },
        {
            "body": "By this logic they would have been killed during the previous years written exam",
            "author": "TPJchief87",
            "id": "jd64v4n",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679452392.0,
            "replies": []
        },
        {
            "body": "I hope Neiji learn how to dodge after getting defeated by Naruto :)",
            "author": "KyleBroflovski505",
            "id": "jd78cvg",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679480702.0,
            "replies": []
        },
        {
            "body": "This hurts way more than it looks — TenTen",
            "author": "Beerasaurus",
            "id": "jd7qb0b",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679491096.0,
            "replies": []
        },
        {
            "body": "Ten ten just hide her sage of six path power....",
            "author": "Old_Most_6061",
            "id": "jd7qmz6",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679491249.0,
            "replies": []
        },
        {
            "body": "I like how tenten’s fight was just her throwing some metal awkwardly and then got her spine crushed like a digestive cookie 💀",
            "author": "dumbass2364859948",
            "id": "jd9az0k",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679513077.0,
            "replies": []
        },
        {
            "body": "ah, yes. overpowered by the sand, overpowered by the wind, aaaand overpowered by the village idiot. good times",
            "author": "salatsol3e",
            "id": "jd9bk7h",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679513303.0,
            "replies": []
        },
        {
            "body": "To be fair, Gaara only won because of the plot.",
            "author": "Worldly-Ad-5196",
            "id": "jdapeql",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1679533534.0,
            "replies": []
        },
        {
            "body": "😭😭",
            "author": "Happy-Bake-5718",
            "id": "je3byi3",
            "parent_id": "t3_11xhchj",
            "score": 1,
            "created_utc": 1680057458.0,
            "replies": []
        },
        {
            "body": "Gaara was a manace at that point, and naruto used 9 tails chakra.......",
            "author": "european_jello",
            "id": "jd3sfqx",
            "parent_id": "t1_jd3k88r",
            "score": 850,
            "created_utc": 1679418404.0,
            "replies": [
                {
                    "body": "And TenTen got an opponent who’s the exact counter to her skills",
                    "author": "JayDaGod1206",
                    "id": "jd3t6tp",
                    "parent_id": "t1_jd3sfqx",
                    "score": 722,
                    "created_utc": 1679418689.0,
                    "replies": [
                        {
                            "body": "I know right, it's soo unfair that Temari had the power to be strong while TenTen just happened to have the power to be weak.",
                            "author": "JojoFag420",
                            "id": "jd49e3l",
                            "parent_id": "t1_jd3t6tp",
                            "score": 460,
                            "created_utc": 1679424799.0,
                            "replies": [
                                {
                                    "body": "Nah, man. At that point in time Tenten could have easily cleared like half the competing roster or more. She had good to fantastic odds of beating anyone except Gaara, Temari, Lee, Neji and Sasuke. Probably Naruto too just for his hax powers.",
                                    "author": "XishengTheUltimate",
                                    "id": "jd4aord",
                                    "parent_id": "t1_jd49e3l",
                                    "score": 271,
                                    "created_utc": 1679425284.0,
                                    "replies": [
                                        {
                                            "body": "Well she'd also lose to the sound ninjas. And shit when kiba does fang over fang his rotation repels any kunai so I think she has bad odds there too.",
                                            "author": "hoeassbitchasshoe",
                                            "id": "jd4wk6k",
                                            "parent_id": "t1_jd4aord",
                                            "score": 90,
                                            "created_utc": 1679433531.0,
                                            "replies": [
                                                {
                                                    "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
                                                    "author": "XishengTheUltimate",
                                                    "id": "jd5a9kz",
                                                    "parent_id": "t1_jd4wk6k",
                                                    "score": 43,
                                                    "created_utc": 1679439019.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That’s cap. We all know thrown weapons never hurt anybody regardless of how many you throw.",
                                            "author": "Xandril",
                                            "id": "jdgpz8y",
                                            "parent_id": "t1_jd4aord",
                                            "score": 3,
                                            "created_utc": 1679643600.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "if kishimoto had tried to develop tenten abilitys, temari's winds would be nothing to chakra-coated nest weapons, it would be resistant to natural elements like wind but he didn't even try and just made her a loser",
                                    "author": "EternalMemes30",
                                    "id": "jd4ax9n",
                                    "parent_id": "t1_jd49e3l",
                                    "score": 100,
                                    "created_utc": 1679425375.0,
                                    "replies": [
                                        {
                                            "body": "> I can throw shuriken like, really really good\n\nYeah honestly wtf was he thinking lol",
                                            "author": "iamkira01",
                                            "id": "jd5ehed",
                                            "parent_id": "t1_jd4ax9n",
                                            "score": 58,
                                            "created_utc": 1679440740.0,
                                            "replies": [
                                                {
                                                    "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
                                                    "author": "DeusVulticus13",
                                                    "id": "jd7qqb5",
                                                    "parent_id": "t1_jd5ehed",
                                                    "score": 12,
                                                    "created_utc": 1679491290.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "By jonin rank most ninja develop 2 changes in chakra nature but we never saw jonin level tenten or any of the konoha 12 at jonin rank other than Neji and Sakura.",
                                            "author": "lilgleesh1901",
                                            "id": "jd5nnbi",
                                            "parent_id": "t1_jd4ax9n",
                                            "score": 22,
                                            "created_utc": 1679444670.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "He didn't even bother to draw the fight 😂",
                                            "author": "Quakson82736",
                                            "id": "jd744v8",
                                            "parent_id": "t1_jd4ax9n",
                                            "score": 4,
                                            "created_utc": 1679477261.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Tenten underrated because of her comparison to geniuses. She doesn’t have to be a genius to be the best ninja tool specialist.",
                                    "author": "lilgleesh1901",
                                    "id": "jd5nfbq",
                                    "parent_id": "t1_jd49e3l",
                                    "score": 16,
                                    "created_utc": 1679444574.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Tenten with that extreme speed",
                            "author": "DevaPath_Winchester",
                            "id": "jd4ykup",
                            "parent_id": "t1_jd3t6tp",
                            "score": 3,
                            "created_utc": 1679434305.0,
                            "replies": []
                        },
                        {
                            "body": "Would she have beat Shikimaru, Hinata, or the sound ninja? Sasuke? Which matchup would Tenten have a good one on one with, I don’t think she ever really gets a good fight.",
                            "author": "Silver-Animator-1905",
                            "id": "jd67fzh",
                            "parent_id": "t1_jd3t6tp",
                            "score": 1,
                            "created_utc": 1679453619.0,
                            "replies": [
                                {
                                    "body": "She would've beaten every single kunoichi except temari. I am not sure about Shikamaru.",
                                    "author": "Immediate_Ad_8138",
                                    "id": "jdd1854",
                                    "parent_id": "t1_jd67fzh",
                                    "score": 2,
                                    "created_utc": 1679583606.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "While it's true he did use the nine-tails chakra (HUGE advantage), his name is also Naruto. The show isn't called \"Neji\" lol. Poor Neji never stood a chance. Reminds me of Kabuto in the scene immediately after Naruto learned Rasengan. 😅",
                    "author": "holylink718",
                    "id": "jd44ds8",
                    "parent_id": "t1_jd3sfqx",
                    "score": 54,
                    "created_utc": 1679422904.0,
                    "replies": []
                },
                {
                    "body": "Neji would’ve won without the bs clone",
                    "author": "Unfair_Priority_3125",
                    "id": "jd4vazk",
                    "parent_id": "t1_jd3sfqx",
                    "score": -13,
                    "created_utc": 1679433056.0,
                    "replies": [
                        {
                            "body": "Okay, but considering how intense Kurama’s Chakra tends to be, it’d be pretty hard to be a Ninja if your hands have nothing but 3rd degree burns on them and lose the ability to channel chakra to them, and that’s not if Naruto figures out Killing Intent over the prior month and gives all present Pissed Off Kushina flashbacks, flashbacks to the worst Birthday Naruto ever had, or flashbacks to when his eldest brother got fed up with his shenanigans in Shukaku’s case, and there’s also if Naruto ends up learning seals and by extension the Hiraishin, how to unfuck his Waifu’s family, and the Rasengan which might result in Iwa slapping him with the same designation as his dad A.K.A. Flee on sight",
                            "author": "Ashbr1ng3r",
                            "id": "jd626gj",
                            "parent_id": "t1_jd4vazk",
                            "score": 2,
                            "created_utc": 1679451133.0,
                            "replies": [
                                {
                                    "body": "Huh?",
                                    "author": "afrika210",
                                    "id": "jd6wds7",
                                    "parent_id": "t1_jd626gj",
                                    "score": 3,
                                    "created_utc": 1679470515.0,
                                    "replies": []
                                },
                                {
                                    "body": "I didn't get a thing yoh said but it felt great to listen to u🙂",
                                    "author": "Dark_Silver007",
                                    "id": "jd6x2z7",
                                    "parent_id": "t1_jd626gj",
                                    "score": 2,
                                    "created_utc": 1679471110.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For real. Gaara was the only person that would’ve defeated Lee at this stage, Temari’s wind moves were a perfect counter to Tenten’s style, and Neji had to fight the protagonist. They got screwed lmao",
            "author": "whalemix",
            "id": "jd4nzm6",
            "parent_id": "t1_jd3k88r",
            "score": 102,
            "created_utc": 1679430319.0,
            "replies": [
                {
                    "body": "Exactly my point",
                    "author": "JayDaGod1206",
                    "id": "jd4o30h",
                    "parent_id": "t1_jd4nzm6",
                    "score": 20,
                    "created_utc": 1679430353.0,
                    "replies": []
                },
                {
                    "body": "That's the point of the exams though. The straws are served  at random, and either through strategy or skill they have to get the best possible outcome. \n\nLee would've absolutely moved on in just the ability to show the mastery of the inner gates. Naruto won against neji but got lucky and relied on a crutch and was not offered the promotion. \n\nShikamaru was completely out matched skill wise vs temari, however he displayed his critical thinking skills in such a way that it even impressed the black ops. Even though it was a tie / loss and a boring match. Ten Ten failed herself. And neji was way to over confidant.",
                    "author": "DylanMartin97",
                    "id": "jd7a4fa",
                    "parent_id": "t1_jd4nzm6",
                    "score": 5,
                    "created_utc": 1679482029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "2 Jinchurikis and the daughter of a Kage (well all 3 were children of Kages)",
            "author": "I_C_Weiner__",
            "id": "jd618jc",
            "parent_id": "t1_jd3k88r",
            "score": 10,
            "created_utc": 1679450698.0,
            "replies": []
        },
        {
            "body": "bro was born with magic eyes that had xray vision. it was a fair fight. he just wasn't the main character",
            "author": "darkkite",
            "id": "jd5nzw3",
            "parent_id": "t1_jd3k88r",
            "score": 14,
            "created_utc": 1679444821.0,
            "replies": [
                {
                    "body": "That’s my point. He had the misfortune of being placed against the main protagonist",
                    "author": "JayDaGod1206",
                    "id": "jd5otsr",
                    "parent_id": "t1_jd5nzw3",
                    "score": 23,
                    "created_utc": 1679445186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Counterpoint: Neiji pulled *Hinata* in the prelims.",
            "author": "SlightlySychotic",
            "id": "jd7zfo5",
            "parent_id": "t1_jd3k88r",
            "score": 3,
            "created_utc": 1679495027.0,
            "replies": []
        },
        {
            "body": "Yeah really tenten got fucked over the most. She already wasn't the best but then any advantage she could have had just went to 0. Neji had the better chance but lost to plot armor lol.",
            "author": "Sakosaga",
            "id": "jd7gu6r",
            "parent_id": "t1_jd3k88r",
            "score": 2,
            "created_utc": 1679486300.0,
            "replies": []
        },
        {
            "body": "You know you're fucked when you match up against the main character",
            "author": "electrorazor",
            "id": "jd8tbhh",
            "parent_id": "t1_jd3k88r",
            "score": 1,
            "created_utc": 1679506434.0,
            "replies": []
        },
        {
            "body": "The real answer",
            "author": "__sublime__1",
            "id": "jd43plt",
            "parent_id": "t1_jd40k15",
            "score": 57,
            "created_utc": 1679422650.0,
            "replies": []
        },
        {
            "body": "I mean they see each other all the time already given does constantly challenge Kakashi.",
            "author": "Cautious-Affect7907",
            "id": "jd5h4yi",
            "parent_id": "t1_jd40k15",
            "score": 16,
            "created_utc": 1679441869.0,
            "replies": [
                {
                    "body": "Unlike anime, in manga we see Kakashi rather trying to avoid Gai's challenges...  \nor... just Gai alone.",
                    "author": "DrunkSaruman",
                    "id": "jd82ln8",
                    "parent_id": "t1_jd5h4yi",
                    "score": 2,
                    "created_utc": 1679496303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Except Sasuke when he chidori'ed his ass.\n\nAnd Naruto when he headbutt'ed his ass.",
            "author": "Goofydood9",
            "id": "jd5g73y",
            "parent_id": "t1_jd42c54",
            "score": 54,
            "created_utc": 1679441464.0,
            "replies": [
                {
                    "body": "I doubt Gaara beating Neji as well.",
                    "author": "death_warrant",
                    "id": "jd66hqv",
                    "parent_id": "t1_jd5g73y",
                    "score": 6,
                    "created_utc": 1679453165.0,
                    "replies": [
                        {
                            "body": "Would be a good match but gaara wins. I dont see neji coming near gaara to disable his chakra points.",
                            "author": "Shadow_Clone_007",
                            "id": "jd6bla3",
                            "parent_id": "t1_jd66hqv",
                            "score": 44,
                            "created_utc": 1679455757.0,
                            "replies": [
                                {
                                    "body": "Neji could dismantle the sand constructs by injecting chakra into them.\n\nHe can use kaiten to repel attacks\n\nAnd use full body blow in case he's caught in sand burial.\n\nThere's a reason why Kankuro and Temari considered him as much a monster as Gaara",
                                    "author": "Blood-Emperor",
                                    "id": "jd6zxb7",
                                    "parent_id": "t1_jd6bla3",
                                    "score": 9,
                                    "created_utc": 1679473572.0,
                                    "replies": [
                                        {
                                            "body": ">Neji could dismantle the sand constructs by injecting chakra into them.\n\nWould this work? The sand is not like a body which has Chakra points.",
                                            "author": "MrInfinitumEnd",
                                            "id": "jd73t0s",
                                            "parent_id": "t1_jd6zxb7",
                                            "score": 7,
                                            "created_utc": 1679476985.0,
                                            "replies": [
                                                {
                                                    "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
                                                    "author": "Blood-Emperor",
                                                    "id": "jd746oe",
                                                    "parent_id": "t1_jd73t0s",
                                                    "score": 9,
                                                    "created_utc": 1679477302.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Lee was also attacking the sand with punches and kicks and just about won and I firmly put Neji above Lee. I highly doubt Gaara wants those problems.",
                                            "author": "death_warrant",
                                            "id": "jd73t2h",
                                            "parent_id": "t1_jd6zxb7",
                                            "score": 3,
                                            "created_utc": 1679476986.0,
                                            "replies": [
                                                {
                                                    "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
                                                    "author": "Blood-Emperor",
                                                    "id": "jd74eck",
                                                    "parent_id": "t1_jd73t2h",
                                                    "score": 7,
                                                    "created_utc": 1679477480.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s because Gaara was actively hallucinating during that’s fight.",
                    "author": "That_opossum",
                    "id": "jetrplu",
                    "parent_id": "t1_jd5g73y",
                    "score": 1,
                    "created_utc": 1680551239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Neji beat the shit out of her. One 64 Palms and it's over",
            "author": "Born-Middle-8815",
            "id": "jd3ke3r",
            "parent_id": "t1_jd31gpn",
            "score": 208,
            "created_utc": 1679415336.0,
            "replies": [
                {
                    "body": "I’m pretty certain Neji could have beaten the three sound ninja that stomped Lee on his own.",
                    "author": "HeraldofblueRP",
                    "id": "jd3vypr",
                    "parent_id": "t1_jd3ke3r",
                    "score": 125,
                    "created_utc": 1679419727.0,
                    "replies": [
                        {
                            "body": "Dosu was shaking in fear from Neji's gaze. Neji smokes them",
                            "author": "Born-Middle-8815",
                            "id": "jd3w71o",
                            "parent_id": "t1_jd3vypr",
                            "score": 101,
                            "created_utc": 1679419814.0,
                            "replies": [
                                {
                                    "body": "Wasn’t that the aura from Sasuke’s curse mark?",
                                    "author": "X-Force-32",
                                    "id": "jd43p8i",
                                    "parent_id": "t1_jd3w71o",
                                    "score": 4,
                                    "created_utc": 1679422646.0,
                                    "replies": [
                                        {
                                            "body": "That happened later. When Neji activated Byakugan, Dosu trembled a bit",
                                            "author": "Born-Middle-8815",
                                            "id": "jd43z0h",
                                            "parent_id": "t1_jd43p8i",
                                            "score": 55,
                                            "created_utc": 1679422750.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Now to be fair, Lee was holding back like a mf there, If he'd taken off his weights or used any of the gates, he could have happily murdered the lot of them with no trouble",
                            "author": "Teh-Cthulhu",
                            "id": "jd6k6x1",
                            "parent_id": "t1_jd3vypr",
                            "score": 8,
                            "created_utc": 1679460960.0,
                            "replies": [
                                {
                                    "body": "He used the first gate for primary lotus",
                                    "author": "HeraldofblueRP",
                                    "id": "jd7o8k0",
                                    "parent_id": "t1_jd6k6x1",
                                    "score": 2,
                                    "created_utc": 1679490130.0,
                                    "replies": [
                                        {
                                            "body": "Yeah sure the primary lotus but thats practically negligible compared to the effects of the other gates",
                                            "author": "Teh-Cthulhu",
                                            "id": "jd7qu65",
                                            "parent_id": "t1_jd7o8k0",
                                            "score": 0,
                                            "created_utc": 1679491340.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Idk how. But at this point in the story, neji was supposed to be the byakugan badass😂. He would have beat teamari.",
            "author": "__akshittt",
            "id": "jd3tw6k",
            "parent_id": "t1_jd31gpn",
            "score": 38,
            "created_utc": 1679418953.0,
            "replies": []
        },
        {
            "body": "If Temari manages to keep a long distance between them and keep whooshing Neji away she probably stands a solid chance of winning, but if Neji closes the gap enough to strike her chakra points it would be over for her.",
            "author": null,
            "id": "jd3buk9",
            "parent_id": "t1_jd31gpn",
            "score": 54,
            "created_utc": 1679412024.0,
            "replies": [
                {
                    "body": "She doesn't at all. Neji would slap her wind attacks away",
                    "author": "Blood-Emperor",
                    "id": "jd700lx",
                    "parent_id": "t1_jd3buk9",
                    "score": 2,
                    "created_utc": 1679473652.0,
                    "replies": [
                        {
                            "body": "How? Best he could do is use rotation to deflect them, but Temari is relentless especially if she summons that weasel thing",
                            "author": null,
                            "id": "jd703os",
                            "parent_id": "t1_jd700lx",
                            "score": 0,
                            "created_utc": 1679473727.0,
                            "replies": [
                                {
                                    "body": "Again, Neji would slap everything away😂😂😂\n\nJyuken. Temari's attacks are made from chakra. And the weasel would also get slapped away.\n\nThis Neji, Taijutsu specialist. Have you seen what he could do against his worst possible enemy, known as Kidomaru, who had stronger, numerous and faster attacks beyond what Temari has?",
                                    "author": "Blood-Emperor",
                                    "id": "jd70d14",
                                    "parent_id": "t1_jd703os",
                                    "score": 3,
                                    "created_utc": 1679473964.0,
                                    "replies": [
                                        {
                                            "body": "If it's chakra and not wind and vulnerable to chakra dispelling then yeah, Neji wins",
                                            "author": null,
                                            "id": "jd71vq4",
                                            "parent_id": "t1_jd70d14",
                                            "score": 1,
                                            "created_utc": 1679475303.0,
                                            "replies": [
                                                {
                                                    "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
                                                    "author": "Blood-Emperor",
                                                    "id": "jd730kt",
                                                    "parent_id": "t1_jd71vq4",
                                                    "score": 2,
                                                    "created_utc": 1679476297.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wonder, did Neji only know Hyuga palm techniques? What about nature attacks? If he had nature attacks too he would be more of a complete ninja...\n\nThe Palm techniques on their own are cool but with chakra nature attacks, the ninja is more complete, has better stats.",
                    "author": "MrInfinitumEnd",
                    "id": "jd74209",
                    "parent_id": "t1_jd3buk9",
                    "score": 1,
                    "created_utc": 1679477195.0,
                    "replies": [
                        {
                            "body": "It's likely that Gentle Fist takes a lifetime to master and in order to become really competent at it you need to devote all your time to it, so no learning chakra transformation or anything beyond basic ninja techniques.",
                            "author": null,
                            "id": "jd75vqm",
                            "parent_id": "t1_jd74209",
                            "score": 2,
                            "created_utc": 1679478715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’d have won",
            "author": "haunted_ramens",
            "id": "jd4dugb",
            "parent_id": "t1_jd31gpn",
            "score": 5,
            "created_utc": 1679426503.0,
            "replies": []
        },
        {
            "body": "Drunken boxing one was good",
            "author": "Matiti60",
            "id": "jd53p3e",
            "parent_id": "t1_jd4f0sl",
            "score": 43,
            "created_utc": 1679436298.0,
            "replies": [
                {
                    "body": "Give lee a bottle of jack he would’ve soloed kaguya",
                    "author": "No_Seaweed6739",
                    "id": "jd5ik64",
                    "parent_id": "t1_jd53p3e",
                    "score": 35,
                    "created_utc": 1679442463.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I liked when Shino threatened to blow the guys arms off and the teachers were like 'nah, he's bluffing' but then he did. Also Shino vs Kankuro. Basically, Shino when he was good.",
            "author": "Jack-The-Reddit",
            "id": "jd78rxr",
            "parent_id": "t1_jd4f0sl",
            "score": 6,
            "created_utc": 1679481030.0,
            "replies": []
        },
        {
            "body": "He could have won at any point if he just continued beating the shit out of naruto instead of telling him his life story",
            "author": "louai-MT",
            "id": "jd477u6",
            "parent_id": "t1_jd3ukn9",
            "score": 172,
            "created_utc": 1679423982.0,
            "replies": []
        },
        {
            "body": "Neji thought he was the chosen one little did he know did Naruto was the reincarnation of a alien ninja god",
            "author": "ChineseNeptune",
            "id": "jd44l6r",
            "parent_id": "t1_jd3ukn9",
            "score": 94,
            "created_utc": 1679422983.0,
            "replies": [
                {
                    "body": "Kishimoto himself didn’t know Naruto was the reincarnation of an alien demigod back then.",
                    "author": "ZillaJrKaijuKing",
                    "id": "jd4mqke",
                    "parent_id": "t1_jd44l6r",
                    "score": 39,
                    "created_utc": 1679429864.0,
                    "replies": [
                        {
                            "body": "The signs were all there, you just need to go big brain",
                            "author": "ChineseNeptune",
                            "id": "jd58los",
                            "parent_id": "t1_jd4mqke",
                            "score": 23,
                            "created_utc": 1679438321.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Little did he know the name of the anime is Naruto",
                    "author": "guymanthing",
                    "id": "jd6ow5t",
                    "parent_id": "t1_jd44l6r",
                    "score": 5,
                    "created_utc": 1679464391.0,
                    "replies": []
                },
                {
                    "body": "I haven't been watching Boruto... wtf am i missing?",
                    "author": "khovel",
                    "id": "je9lfxd",
                    "parent_id": "t1_jd44l6r",
                    "score": 1,
                    "created_utc": 1680179834.0,
                    "replies": [
                        {
                            "body": "Kaguya is a space alien god",
                            "author": "ChineseNeptune",
                            "id": "je9rzym",
                            "parent_id": "t1_je9lfxd",
                            "score": 1,
                            "created_utc": 1680183021.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neji lost by bullshit tbh. Wrecks naruto the whole fight and then gets beat by a single punch. Honestly worst fight in the exams.",
            "author": "StockPassenger2994",
            "id": "jd4da2k",
            "parent_id": "t1_jd3ukn9",
            "score": 36,
            "created_utc": 1679426283.0,
            "replies": [
                {
                    "body": "It's like real life. You can throw a bunch of punches, sure. But if you can't take a punch, better not get hit.",
                    "author": "nottme1",
                    "id": "jd4ioxc",
                    "parent_id": "t1_jd4da2k",
                    "score": 14,
                    "created_utc": 1679428346.0,
                    "replies": [
                        {
                            "body": "Wtf are you on. If it were like real life then naruto suffered the equivalent of his nervous system failing and then still managed ro throw a punch and knock out the strongest genin in the leaf. If it wasn't for the emotional impact and character development behind the fight it'd probably be the worst of the series",
                            "author": "StockPassenger2994",
                            "id": "jd4jptu",
                            "parent_id": "t1_jd4ioxc",
                            "score": 26,
                            "created_utc": 1679428732.0,
                            "replies": [
                                {
                                    "body": "Naruto punched him square in the jaw though.\n\nIf you’ve ever been punched in the jaw before, it can rattle your brain and make you dizzy sometimes if you’re hit real hard you could get knocked the f out.",
                                    "author": "Cautious-Affect7907",
                                    "id": "jd5hi19",
                                    "parent_id": "t1_jd4jptu",
                                    "score": 8,
                                    "created_utc": 1679442022.0,
                                    "replies": [
                                        {
                                            "body": "Have you ever been punched 64 times across your whole body effectively destroying your second nervousvdystem\n\nNaruto pulled some goofy ass shenanigans",
                                            "author": "fuckedbyturtles",
                                            "id": "jd5nxzn",
                                            "parent_id": "t1_jd5hi19",
                                            "score": 4,
                                            "created_utc": 1679444797.0,
                                            "replies": [
                                                {
                                                    "body": "More like poked 64 times but your point still stands.",
                                                    "author": "Valedictorian117",
                                                    "id": "jd69xpa",
                                                    "parent_id": "t1_jd5nxzn",
                                                    "score": 2,
                                                    "created_utc": 1679454878.0,
                                                    "replies": [
                                                        {
                                                            "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                                                            "author": "Individual-Ad9753",
                                                            "id": "jd6pay3",
                                                            "parent_id": "t1_jd69xpa",
                                                            "score": 3,
                                                            "created_utc": 1679464707.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
                                                    "author": "FantasticDucks",
                                                    "id": "jd7omj4",
                                                    "parent_id": "t1_jd5nxzn",
                                                    "score": 2,
                                                    "created_utc": 1679490317.0,
                                                    "replies": [
                                                        {
                                                            "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                                                            "author": "fuckedbyturtles",
                                                            "id": "jd9zibu",
                                                            "parent_id": "t1_jd7omj4",
                                                            "score": 0,
                                                            "created_utc": 1679522607.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It’s called suspension of disbelief.",
                                                                    "author": "That_opossum",
                                                                    "id": "jettyom",
                                                                    "parent_id": "t1_jd9zibu",
                                                                    "score": 1,
                                                                    "created_utc": 1680552114.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I agree but plot armor saved Naruto more than I can count",
                                                                            "author": "fuckedbyturtles",
                                                                            "id": "jetxeml",
                                                                            "parent_id": "t1_jettyom",
                                                                            "score": 1,
                                                                            "created_utc": 1680553451.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                                                                    "author": "That_opossum",
                                                                                    "id": "jeudrrj",
                                                                                    "parent_id": "t1_jetxeml",
                                                                                    "score": 1,
                                                                                    "created_utc": 1680560088.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
                                                    "author": "Previous_Royal2168",
                                                    "id": "jd7958r",
                                                    "parent_id": "t1_jd5nxzn",
                                                    "score": 1,
                                                    "created_utc": 1679481314.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He technically did win the fight he sealed all of Naruto’s natural chakra",
            "author": "Fetial",
            "id": "jd4mveq",
            "parent_id": "t1_jd3ukn9",
            "score": 7,
            "created_utc": 1679429908.0,
            "replies": []
        },
        {
            "body": "Tbf who could've predicted that a tired injured boy could dig an entire underground tunnel in a short time not displacing the dirt in such a way or making noise that would give him away using ONLY his hands? Setting aside ninja magic that feat is some actual bullshit in Narutos favor.",
            "author": "TheOnlyFraen",
            "id": "jd71noc",
            "parent_id": "t1_jd3ukn9",
            "score": 3,
            "created_utc": 1679475110.0,
            "replies": [
                {
                    "body": "Lol, this is actually crazy. Neji's arrogance played a role though.",
                    "author": "MrInfinitumEnd",
                    "id": "jd74af2",
                    "parent_id": "t1_jd71noc",
                    "score": 1,
                    "created_utc": 1679477388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And Temari isn’t exactly weak either. Like a few weeks after that she cuts down a small forest with just one technique.",
            "author": "Renkin92",
            "id": "jd44bvg",
            "parent_id": "t1_jd40rkr",
            "score": 79,
            "created_utc": 1679422885.0,
            "replies": [
                {
                    "body": "I often forget that Part 1's timeline is at least under a year…",
                    "author": "Electrifying-Guy-Eli",
                    "id": "jd6mcvi",
                    "parent_id": "t1_jd44bvg",
                    "score": 2,
                    "created_utc": 1679462489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tenten isn't weak SHe Rained Irons and could beat most of them  \n**Sakura** \\- very easy, Rained!  \n**Choji**\\- Big Target too easy for her  \n**Guy who Lost to Sasuke**\\- Rained!  \n**Guy Who Lost to Kankuro** \\- Rained!  \n**Shikamaru**\\- His shadow and thinking wont stop Iron rains  \n**Shino**\\- Bugs will help him little but still Rained  \n**Kin**\\- Nidlde bells  vs 10000 kunais? in her dream  \n**Ino**\\- running from Iron rain and mind transfer? very slim chance! 85% Rained!  \n**Zaku-** he might has chance but it's about durability he's injured and doesn't has much.  \n**Hinata**\\- She's weaker version of neji maybe she can maybe she can't  \n**Naruto** \\- He wasn't good shape when he been fighting kiba. he won't give up but judge will stop cause too dangerous to be rained again.  \n**Sasuke**\\- Weak version of him needs one good shot (Lee's copy) or he will loss  \n**Kankuro** \\- Depends who use weapons Better? 55% on Kankuro I think  \n**Dosu**\\- if she keep distance she will be fine but he's fast, not easy.  \n**Hinata**\\- She's weaker version of neji maybe she can maybe she can't  \n**Lee**\\- he won't take off weights or Gates (Guy wouldn't allow it against tenten) He'll win not easily  \n**Kiba**(edit for takamurarules comment)- fang over fang is bad match up  \n**Temari**\\- Bad match up  \n**Neji**\\- Forget it, He's Superior  \n**Gaara**\\- Guy will save her from him.  \n\n\nEdited and fixed some mistake thank Quick\\_Camping4358 for pointing out.",
            "author": "Lexcomp7",
            "id": "jd4vs7b",
            "parent_id": "t1_jd40rkr",
            "score": 15,
            "created_utc": 1679433236.0,
            "replies": [
                {
                    "body": "Kiba’s fang over fang repels weapons so that would probably be a bad matchup too.",
                    "author": "Takamurarules",
                    "id": "jd58hw6",
                    "parent_id": "t1_jd4vs7b",
                    "score": 8,
                    "created_utc": 1679438276.0,
                    "replies": []
                },
                {
                    "body": "Read it again, you repeated some guys",
                    "author": "Formal_Mundane",
                    "id": "jd612sr",
                    "parent_id": "t1_jd4vs7b",
                    "score": 3,
                    "created_utc": 1679450625.0,
                    "replies": [
                        {
                            "body": "yeah I thought I deleted it.",
                            "author": "Lexcomp7",
                            "id": "jd7tq7j",
                            "parent_id": "t1_jd612sr",
                            "score": 1,
                            "created_utc": 1679492640.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You forgot Zaku who might actually have a chance against her",
                    "author": "Quick_Campaign4358",
                    "id": "jd7l4aa",
                    "parent_id": "t1_jd4vs7b",
                    "score": 2,
                    "created_utc": 1679488598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, he was fight against a modern Ashura xd. Although Ashura wasn't skillful, he was a joke compared to Indra in terms of skills.",
            "author": "MrInfinitumEnd",
            "id": "jd74xoy",
            "parent_id": "t1_jd4mz12",
            "score": 2,
            "created_utc": 1679477932.0,
            "replies": []
        },
        {
            "body": "*savage beast",
            "author": "ObjectFancy",
            "id": "jd626lm",
            "parent_id": "t1_jd4mz12",
            "score": 1,
            "created_utc": 1679451135.0,
            "replies": []
        },
        {
            "body": "Because Kishi was probably making it up as he goes",
            "author": null,
            "id": "jd71tna",
            "parent_id": "t1_jd5vt6a",
            "score": 3,
            "created_utc": 1679475254.0,
            "replies": [
                {
                    "body": "Oh yeah definitely. He clearly had a general idea (ninjas, fox demon, plucky main character goes to extreme lengths to save his best friend) but he stretched it out way too thin after shippuden and some parts were clearly written by the seat of his pants.",
                    "author": "Subject_Tutor",
                    "id": "jd75vde",
                    "parent_id": "t1_jd71tna",
                    "score": 3,
                    "created_utc": 1679478706.0,
                    "replies": [
                        {
                            "body": "Pretty much, yeah. It's a shame really a bit more focus and diligence (especially for the female characters) and Naruto would've been a masterpiece, and I don't say this lightly as an anime hater.",
                            "author": null,
                            "id": "jd768g2",
                            "parent_id": "t1_jd75vde",
                            "score": 1,
                            "created_utc": 1679479004.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">People like to pretend that Temari lost against Shikamaru, but she didn’t. Shikamaru lost. He just outsmarted her for 10 seconds\n\nHe didn't outsmart her for 10 seconds, he outsmarted her the entire match. Everything he did was for his final plan. He even stated he thought even more moves ahead had she not fell for the last trap. \n\nHe gave up fighting because he was lazy and low Chakra. He didn't feel like continuing under those circumstances. Remember he didn't care so much about winning, just not losing on her terms.",
            "author": "OhGoshIts",
            "id": "jd5cefv",
            "parent_id": "t1_jd4ajk3",
            "score": 28,
            "created_utc": 1679439882.0,
            "replies": [
                {
                    "body": "“He gave up fighting because he was low on chakra” - That’s losing.",
                    "author": "EmmaThais",
                    "id": "jd5hv1y",
                    "parent_id": "t1_jd5cefv",
                    "score": 20,
                    "created_utc": 1679442173.0,
                    "replies": [
                        {
                            "body": "Consider it from this perspective: Had Shikamaru won, he would've had to fight Shino. Had he beat Shino, he would've had to fight either Naruto or Gaara (Sasuke was late, and only managed to stay in the fight based on Orochimaru convincing Hiruzen to keep him in).\n\nShikamaru knew this (not the stuff with Sasuke). He knew he'd have to fight Shino, and Naruto or Gaara.\n\nThis *context* is important, because it means his line about being low on chakra doesn't necessarily mean \"if this fight continues, I will run out of chakra, then lose.\" It very well could mean \"I could continue this fight for a while longer, but I might not have enough chakra for the rest of the tournament.\"\n\nHe did not need to win *to win*. The tournament isn't about who the best fighter is. It's about showing off your new toys to the world, and showing off whether someone would make a capable chunin.\n\nShikamaru did not lose. He forfeited. He could've won had he wanted to, but that would mean he'd be up against his next opponent. If he goes up against another fighter, he might not have enough chakra to make a good showing, which would ruin the previous fight retroactively. Him forfeiting means Temari won the battle but lost the war. *Everyone* now knows that Temari only won because Shikamaru decided to forfeit, and then she'd be forced to fight against Shino.\n\nAlso, Tamari, Kankuro, and Gaara are not jonin level shinobi. They're *chunin* at the most. Gaara's only point in his favour is that he's got a nuke inside him, but he does *not* have the skill for jonin at that time.\n\nEDIT: The way Shikamaru losing the next fight would hurt his previous fight, is due to it sending some very specific messages to the audience. First off: he's a good strategist, but he needs to learn his limits. Or, perhaps, Shikamaru had a month to prepare against Temari, maybe part of his failure was not being able to think on the fly? Or his loss would just erase his previous fight in some eyes.",
                            "author": "advena_phillips",
                            "id": "jd6ujoh",
                            "parent_id": "t1_jd5hv1y",
                            "score": 11,
                            "created_utc": 1679468956.0,
                            "replies": [
                                {
                                    "body": "Now I wanna see Shikamaru vs Shino - the two people who faked out being asleep in the stadium.",
                                    "author": "Jack-The-Reddit",
                                    "id": "jd793an",
                                    "parent_id": "t1_jd6ujoh",
                                    "score": 5,
                                    "created_utc": 1679481272.0,
                                    "replies": []
                                },
                                {
                                    "body": "This is an excellent comment 👏. I hadn't thought of the fight of Shikamaru with Temari that way.",
                                    "author": "MrInfinitumEnd",
                                    "id": "jd74p4n",
                                    "parent_id": "t1_jd6ujoh",
                                    "score": 1,
                                    "created_utc": 1679477735.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And it's fine because in order to win, sometimes you have to lose.",
                            "author": "ChunkyChuckles",
                            "id": "jd6g2ok",
                            "parent_id": "t1_jd5hv1y",
                            "score": 3,
                            "created_utc": 1679458328.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hold on a second you can’t say sasuke is cheating while ignoring the fact that naruto has a demon in him that gives him all the chakra he needs and is ninja Jesus.",
            "author": "That_opossum",
            "id": "jetupei",
            "parent_id": "t1_jd5b1hb",
            "score": 1,
            "created_utc": 1680552408.0,
            "replies": [
                {
                    "body": "The 9 tails is often cheating, which is why I prefer sage naruto to any other powered up form by the end. But at this point in the story it was actually making him weaker, as Orochimaru has janked his seal, and Jiraya hadn’t fixed it yet, at least not before the Kiba fight, which is mostly where I thing Naruto got a bad wrap. Also, he didn’t use 9 tail chakra to defeat Kiba.",
                    "author": "Felsig27",
                    "id": "jeung1s",
                    "parent_id": "t1_jetupei",
                    "score": 1,
                    "created_utc": 1680564272.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This would have not been a fight - it’s would be a BEATDOWN.\n\nNeji lacks the speed to counter Gaara’s shield and his palm jutsu is nothing against the ultimate defense (you must touch the opponent and have access to their unprotected body for this jutsu to work properly)\n\nNot even Naruto could have defeated Gaara in the Chunin Exams terms. Gaara at that moment had only one counter - Lee. Sasuke is also no since he doesn’t have Chidori at that moment, but with Chidori it’s bye bye Gaara.\n\nIf only Lee was smarter with utilazation of his powers, he would have wiped the floor with the Sand Jinchuriki.",
            "author": "Olya_roo",
            "id": "jd4psf5",
            "parent_id": "t1_jd4125m",
            "score": 14,
            "created_utc": 1679430987.0,
            "replies": [
                {
                    "body": "Given that naruto had an extra seal messing with his chakra and blocking the 9 tails he would straight up lose even if they fought during the preliminary matches",
                    "author": "Visible-Effective944",
                    "id": "jd5cho0",
                    "parent_id": "t1_jd4psf5",
                    "score": 8,
                    "created_utc": 1679439918.0,
                    "replies": []
                },
                {
                    "body": "Lee wasn’t a counter at all. After that impressive showing it turned out to not even lay a single scratch on Gaara’s body. No one in the prelims was touching Gaara except Kabuto if he hadn’t quit.",
                    "author": "Valedictorian117",
                    "id": "jd6afqn",
                    "parent_id": "t1_jd4psf5",
                    "score": 0,
                    "created_utc": 1679455145.0,
                    "replies": []
                },
                {
                    "body": "The only thing is, Neji did have the speed to fight Garra.   He was stated to be as fast as weightless Lee at the time, who was shown to be able to land hits on Gaarra, only the gentle fist would be more effective since he's tatgeting chakra rather than a knockout.  \n\nIf Lee's primary lotus didn't task him as hard as it did, he would've got the same result as Sasuke without Gates and would've just had to figure out how to break the sand cocoon (probably would've needed the gates).",
                    "author": "IMSABU",
                    "id": "jd6fzdv",
                    "parent_id": "t1_jd4psf5",
                    "score": 0,
                    "created_utc": 1679458271.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto didn't choose to use Kurama. His chakara points got blocked, which allowed Kurama to feed his chakra to Naruto.",
            "author": "nottme1",
            "id": "jd4j863",
            "parent_id": "t1_jd4e7kf",
            "score": 14,
            "created_utc": 1679428545.0,
            "replies": [
                {
                    "body": "At point in the series he only ever *chose* to get Kurama's chakra for Gamabunta.\n\nBut even then there's numerous examples of Kurama feeding Naruto chakra even without him having blocked chakra points.\n\nThe point being Naruto was almost destined to beat Neji:\n\nHe had way bigger chakra by default, if Neji tried fighting back then Kurama's chakra comes out and he loses.\n\nSo either way Neji's philosophy is proven correct with the only thing he got wrong was that *he'd* win instead of Naruto.\n\nThen y'know, Neji was born to die for the main branch and despite all the changes to the clan he chooses to die just like his father, just as fate planned.\n\nNeji never could run from fate as much as he tried.",
                    "author": "Koharu_Hidaka",
                    "id": "jd4ls9f",
                    "parent_id": "t1_jd4j863",
                    "score": 4,
                    "created_utc": 1679429509.0,
                    "replies": [
                        {
                            "body": "His philosophy gotten proven right in the war Arc, but Narito still had to train in order to be able to access the 9 tails' power without being in a life and death circumstance and enraged.",
                            "author": "Visible-Effective944",
                            "id": "jd5cr7e",
                            "parent_id": "t1_jd4ls9f",
                            "score": 2,
                            "created_utc": 1679440027.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean he literally hit him once…..",
            "author": "Massive-Lime7193",
            "id": "jd3ksj8",
            "parent_id": "t1_jd3kije",
            "score": 17,
            "created_utc": 1679415491.0,
            "replies": []
        },
        {
            "body": "In my opinion Sakura vs Ino was one the worst fights in the show",
            "author": "Huge_Ad6338",
            "id": "jd3md2b",
            "parent_id": "t1_jd3kije",
            "score": 9,
            "created_utc": 1679416087.0,
            "replies": [
                {
                    "body": "That shit is not even a fight",
                    "author": "Born-Middle-8815",
                    "id": "jd3mgyi",
                    "parent_id": "t1_jd3md2b",
                    "score": 12,
                    "created_utc": 1679416128.0,
                    "replies": [
                        {
                            "body": "Yeah",
                            "author": "Huge_Ad6338",
                            "id": "jd3mttz",
                            "parent_id": "t1_jd3mgyi",
                            "score": 2,
                            "created_utc": 1679416263.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wrong, Naruto hit him once. But i agree that this fight sucks ass, Neji should have won",
            "author": "yahzy",
            "id": "jd3tjsc",
            "parent_id": "t1_jd3kije",
            "score": 9,
            "created_utc": 1679418825.0,
            "replies": []
        },
        {
            "body": "He hit him twice",
            "author": "SaintAhmad",
            "id": "jd3tzmj",
            "parent_id": "t1_jd3kije",
            "score": 1,
            "created_utc": 1679418988.0,
            "replies": [
                {
                    "body": "Any hit other than the KO?",
                    "author": "Born-Middle-8815",
                    "id": "jd3u8up",
                    "parent_id": "t1_jd3tzmj",
                    "score": 1,
                    "created_utc": 1679419084.0,
                    "replies": [
                        {
                            "body": "The 9 tails chakra powered punch that collided with Neji’s rotation and [drilled him into the ground.](https://official-complete-2.eorzea.us/manga/Naruto/0104-013.png)\n\nI’d say that actually did the majority of the damage, the surprise uppercut KO wouldn’t be possible without it",
                            "author": "SaintAhmad",
                            "id": "jd3unxd",
                            "parent_id": "t1_jd3u8up",
                            "score": 2,
                            "created_utc": 1679419241.0,
                            "replies": [
                                {
                                    "body": "Didn't Naruto's punch collide with the rotation which caused a huge explosion? It's more like Neji was out of chakra rather than psychically injured. If he was, then it would be from the shockwave, not Naruto's punch",
                                    "author": "Born-Middle-8815",
                                    "id": "jd3uz15",
                                    "parent_id": "t1_jd3unxd",
                                    "score": 2,
                                    "created_utc": 1679419358.0,
                                    "replies": [
                                        {
                                            "body": "The shockwave is caused by the punch, so it’s still a significant hit. \n\nHeck, the proctor thought that alone was enough to take down [Neji](https://official-complete-2.eorzea.us/manga/Naruto/0104-011.png). And you can see how damaged Neji is following it, so it wasn’t just him being low on chakra.",
                                            "author": "SaintAhmad",
                                            "id": "jd3vrln",
                                            "parent_id": "t1_jd3uz15",
                                            "score": 4,
                                            "created_utc": 1679419654.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And TenTen got an opponent who’s the exact counter to her skills",
            "author": "JayDaGod1206",
            "id": "jd3t6tp",
            "parent_id": "t1_jd3sfqx",
            "score": 722,
            "created_utc": 1679418689.0,
            "replies": [
                {
                    "body": "I know right, it's soo unfair that Temari had the power to be strong while TenTen just happened to have the power to be weak.",
                    "author": "JojoFag420",
                    "id": "jd49e3l",
                    "parent_id": "t1_jd3t6tp",
                    "score": 460,
                    "created_utc": 1679424799.0,
                    "replies": [
                        {
                            "body": "Nah, man. At that point in time Tenten could have easily cleared like half the competing roster or more. She had good to fantastic odds of beating anyone except Gaara, Temari, Lee, Neji and Sasuke. Probably Naruto too just for his hax powers.",
                            "author": "XishengTheUltimate",
                            "id": "jd4aord",
                            "parent_id": "t1_jd49e3l",
                            "score": 271,
                            "created_utc": 1679425284.0,
                            "replies": [
                                {
                                    "body": "Well she'd also lose to the sound ninjas. And shit when kiba does fang over fang his rotation repels any kunai so I think she has bad odds there too.",
                                    "author": "hoeassbitchasshoe",
                                    "id": "jd4wk6k",
                                    "parent_id": "t1_jd4aord",
                                    "score": 90,
                                    "created_utc": 1679433531.0,
                                    "replies": [
                                        {
                                            "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
                                            "author": "XishengTheUltimate",
                                            "id": "jd5a9kz",
                                            "parent_id": "t1_jd4wk6k",
                                            "score": 43,
                                            "created_utc": 1679439019.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That’s cap. We all know thrown weapons never hurt anybody regardless of how many you throw.",
                                    "author": "Xandril",
                                    "id": "jdgpz8y",
                                    "parent_id": "t1_jd4aord",
                                    "score": 3,
                                    "created_utc": 1679643600.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "if kishimoto had tried to develop tenten abilitys, temari's winds would be nothing to chakra-coated nest weapons, it would be resistant to natural elements like wind but he didn't even try and just made her a loser",
                            "author": "EternalMemes30",
                            "id": "jd4ax9n",
                            "parent_id": "t1_jd49e3l",
                            "score": 100,
                            "created_utc": 1679425375.0,
                            "replies": [
                                {
                                    "body": "> I can throw shuriken like, really really good\n\nYeah honestly wtf was he thinking lol",
                                    "author": "iamkira01",
                                    "id": "jd5ehed",
                                    "parent_id": "t1_jd4ax9n",
                                    "score": 58,
                                    "created_utc": 1679440740.0,
                                    "replies": [
                                        {
                                            "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
                                            "author": "DeusVulticus13",
                                            "id": "jd7qqb5",
                                            "parent_id": "t1_jd5ehed",
                                            "score": 12,
                                            "created_utc": 1679491290.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "By jonin rank most ninja develop 2 changes in chakra nature but we never saw jonin level tenten or any of the konoha 12 at jonin rank other than Neji and Sakura.",
                                    "author": "lilgleesh1901",
                                    "id": "jd5nnbi",
                                    "parent_id": "t1_jd4ax9n",
                                    "score": 22,
                                    "created_utc": 1679444670.0,
                                    "replies": []
                                },
                                {
                                    "body": "He didn't even bother to draw the fight 😂",
                                    "author": "Quakson82736",
                                    "id": "jd744v8",
                                    "parent_id": "t1_jd4ax9n",
                                    "score": 4,
                                    "created_utc": 1679477261.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Tenten underrated because of her comparison to geniuses. She doesn’t have to be a genius to be the best ninja tool specialist.",
                            "author": "lilgleesh1901",
                            "id": "jd5nfbq",
                            "parent_id": "t1_jd49e3l",
                            "score": 16,
                            "created_utc": 1679444574.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tenten with that extreme speed",
                    "author": "DevaPath_Winchester",
                    "id": "jd4ykup",
                    "parent_id": "t1_jd3t6tp",
                    "score": 3,
                    "created_utc": 1679434305.0,
                    "replies": []
                },
                {
                    "body": "Would she have beat Shikimaru, Hinata, or the sound ninja? Sasuke? Which matchup would Tenten have a good one on one with, I don’t think she ever really gets a good fight.",
                    "author": "Silver-Animator-1905",
                    "id": "jd67fzh",
                    "parent_id": "t1_jd3t6tp",
                    "score": 1,
                    "created_utc": 1679453619.0,
                    "replies": [
                        {
                            "body": "She would've beaten every single kunoichi except temari. I am not sure about Shikamaru.",
                            "author": "Immediate_Ad_8138",
                            "id": "jdd1854",
                            "parent_id": "t1_jd67fzh",
                            "score": 2,
                            "created_utc": 1679583606.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "While it's true he did use the nine-tails chakra (HUGE advantage), his name is also Naruto. The show isn't called \"Neji\" lol. Poor Neji never stood a chance. Reminds me of Kabuto in the scene immediately after Naruto learned Rasengan. 😅",
            "author": "holylink718",
            "id": "jd44ds8",
            "parent_id": "t1_jd3sfqx",
            "score": 54,
            "created_utc": 1679422904.0,
            "replies": []
        },
        {
            "body": "Neji would’ve won without the bs clone",
            "author": "Unfair_Priority_3125",
            "id": "jd4vazk",
            "parent_id": "t1_jd3sfqx",
            "score": -13,
            "created_utc": 1679433056.0,
            "replies": [
                {
                    "body": "Okay, but considering how intense Kurama’s Chakra tends to be, it’d be pretty hard to be a Ninja if your hands have nothing but 3rd degree burns on them and lose the ability to channel chakra to them, and that’s not if Naruto figures out Killing Intent over the prior month and gives all present Pissed Off Kushina flashbacks, flashbacks to the worst Birthday Naruto ever had, or flashbacks to when his eldest brother got fed up with his shenanigans in Shukaku’s case, and there’s also if Naruto ends up learning seals and by extension the Hiraishin, how to unfuck his Waifu’s family, and the Rasengan which might result in Iwa slapping him with the same designation as his dad A.K.A. Flee on sight",
                    "author": "Ashbr1ng3r",
                    "id": "jd626gj",
                    "parent_id": "t1_jd4vazk",
                    "score": 2,
                    "created_utc": 1679451133.0,
                    "replies": [
                        {
                            "body": "Huh?",
                            "author": "afrika210",
                            "id": "jd6wds7",
                            "parent_id": "t1_jd626gj",
                            "score": 3,
                            "created_utc": 1679470515.0,
                            "replies": []
                        },
                        {
                            "body": "I didn't get a thing yoh said but it felt great to listen to u🙂",
                            "author": "Dark_Silver007",
                            "id": "jd6x2z7",
                            "parent_id": "t1_jd626gj",
                            "score": 2,
                            "created_utc": 1679471110.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly my point",
            "author": "JayDaGod1206",
            "id": "jd4o30h",
            "parent_id": "t1_jd4nzm6",
            "score": 20,
            "created_utc": 1679430353.0,
            "replies": []
        },
        {
            "body": "That's the point of the exams though. The straws are served  at random, and either through strategy or skill they have to get the best possible outcome. \n\nLee would've absolutely moved on in just the ability to show the mastery of the inner gates. Naruto won against neji but got lucky and relied on a crutch and was not offered the promotion. \n\nShikamaru was completely out matched skill wise vs temari, however he displayed his critical thinking skills in such a way that it even impressed the black ops. Even though it was a tie / loss and a boring match. Ten Ten failed herself. And neji was way to over confidant.",
            "author": "DylanMartin97",
            "id": "jd7a4fa",
            "parent_id": "t1_jd4nzm6",
            "score": 5,
            "created_utc": 1679482029.0,
            "replies": []
        },
        {
            "body": "That’s my point. He had the misfortune of being placed against the main protagonist",
            "author": "JayDaGod1206",
            "id": "jd5otsr",
            "parent_id": "t1_jd5nzw3",
            "score": 23,
            "created_utc": 1679445186.0,
            "replies": []
        },
        {
            "body": "Unlike anime, in manga we see Kakashi rather trying to avoid Gai's challenges...  \nor... just Gai alone.",
            "author": "DrunkSaruman",
            "id": "jd82ln8",
            "parent_id": "t1_jd5h4yi",
            "score": 2,
            "created_utc": 1679496303.0,
            "replies": []
        },
        {
            "body": "I doubt Gaara beating Neji as well.",
            "author": "death_warrant",
            "id": "jd66hqv",
            "parent_id": "t1_jd5g73y",
            "score": 6,
            "created_utc": 1679453165.0,
            "replies": [
                {
                    "body": "Would be a good match but gaara wins. I dont see neji coming near gaara to disable his chakra points.",
                    "author": "Shadow_Clone_007",
                    "id": "jd6bla3",
                    "parent_id": "t1_jd66hqv",
                    "score": 44,
                    "created_utc": 1679455757.0,
                    "replies": [
                        {
                            "body": "Neji could dismantle the sand constructs by injecting chakra into them.\n\nHe can use kaiten to repel attacks\n\nAnd use full body blow in case he's caught in sand burial.\n\nThere's a reason why Kankuro and Temari considered him as much a monster as Gaara",
                            "author": "Blood-Emperor",
                            "id": "jd6zxb7",
                            "parent_id": "t1_jd6bla3",
                            "score": 9,
                            "created_utc": 1679473572.0,
                            "replies": [
                                {
                                    "body": ">Neji could dismantle the sand constructs by injecting chakra into them.\n\nWould this work? The sand is not like a body which has Chakra points.",
                                    "author": "MrInfinitumEnd",
                                    "id": "jd73t0s",
                                    "parent_id": "t1_jd6zxb7",
                                    "score": 7,
                                    "created_utc": 1679476985.0,
                                    "replies": [
                                        {
                                            "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
                                            "author": "Blood-Emperor",
                                            "id": "jd746oe",
                                            "parent_id": "t1_jd73t0s",
                                            "score": 9,
                                            "created_utc": 1679477302.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Lee was also attacking the sand with punches and kicks and just about won and I firmly put Neji above Lee. I highly doubt Gaara wants those problems.",
                                    "author": "death_warrant",
                                    "id": "jd73t2h",
                                    "parent_id": "t1_jd6zxb7",
                                    "score": 3,
                                    "created_utc": 1679476986.0,
                                    "replies": [
                                        {
                                            "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
                                            "author": "Blood-Emperor",
                                            "id": "jd74eck",
                                            "parent_id": "t1_jd73t2h",
                                            "score": 7,
                                            "created_utc": 1679477480.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s because Gaara was actively hallucinating during that’s fight.",
            "author": "That_opossum",
            "id": "jetrplu",
            "parent_id": "t1_jd5g73y",
            "score": 1,
            "created_utc": 1680551239.0,
            "replies": []
        },
        {
            "body": "I’m pretty certain Neji could have beaten the three sound ninja that stomped Lee on his own.",
            "author": "HeraldofblueRP",
            "id": "jd3vypr",
            "parent_id": "t1_jd3ke3r",
            "score": 125,
            "created_utc": 1679419727.0,
            "replies": [
                {
                    "body": "Dosu was shaking in fear from Neji's gaze. Neji smokes them",
                    "author": "Born-Middle-8815",
                    "id": "jd3w71o",
                    "parent_id": "t1_jd3vypr",
                    "score": 101,
                    "created_utc": 1679419814.0,
                    "replies": [
                        {
                            "body": "Wasn’t that the aura from Sasuke’s curse mark?",
                            "author": "X-Force-32",
                            "id": "jd43p8i",
                            "parent_id": "t1_jd3w71o",
                            "score": 4,
                            "created_utc": 1679422646.0,
                            "replies": [
                                {
                                    "body": "That happened later. When Neji activated Byakugan, Dosu trembled a bit",
                                    "author": "Born-Middle-8815",
                                    "id": "jd43z0h",
                                    "parent_id": "t1_jd43p8i",
                                    "score": 55,
                                    "created_utc": 1679422750.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Now to be fair, Lee was holding back like a mf there, If he'd taken off his weights or used any of the gates, he could have happily murdered the lot of them with no trouble",
                    "author": "Teh-Cthulhu",
                    "id": "jd6k6x1",
                    "parent_id": "t1_jd3vypr",
                    "score": 8,
                    "created_utc": 1679460960.0,
                    "replies": [
                        {
                            "body": "He used the first gate for primary lotus",
                            "author": "HeraldofblueRP",
                            "id": "jd7o8k0",
                            "parent_id": "t1_jd6k6x1",
                            "score": 2,
                            "created_utc": 1679490130.0,
                            "replies": [
                                {
                                    "body": "Yeah sure the primary lotus but thats practically negligible compared to the effects of the other gates",
                                    "author": "Teh-Cthulhu",
                                    "id": "jd7qu65",
                                    "parent_id": "t1_jd7o8k0",
                                    "score": 0,
                                    "created_utc": 1679491340.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She doesn't at all. Neji would slap her wind attacks away",
            "author": "Blood-Emperor",
            "id": "jd700lx",
            "parent_id": "t1_jd3buk9",
            "score": 2,
            "created_utc": 1679473652.0,
            "replies": [
                {
                    "body": "How? Best he could do is use rotation to deflect them, but Temari is relentless especially if she summons that weasel thing",
                    "author": null,
                    "id": "jd703os",
                    "parent_id": "t1_jd700lx",
                    "score": 0,
                    "created_utc": 1679473727.0,
                    "replies": [
                        {
                            "body": "Again, Neji would slap everything away😂😂😂\n\nJyuken. Temari's attacks are made from chakra. And the weasel would also get slapped away.\n\nThis Neji, Taijutsu specialist. Have you seen what he could do against his worst possible enemy, known as Kidomaru, who had stronger, numerous and faster attacks beyond what Temari has?",
                            "author": "Blood-Emperor",
                            "id": "jd70d14",
                            "parent_id": "t1_jd703os",
                            "score": 3,
                            "created_utc": 1679473964.0,
                            "replies": [
                                {
                                    "body": "If it's chakra and not wind and vulnerable to chakra dispelling then yeah, Neji wins",
                                    "author": null,
                                    "id": "jd71vq4",
                                    "parent_id": "t1_jd70d14",
                                    "score": 1,
                                    "created_utc": 1679475303.0,
                                    "replies": [
                                        {
                                            "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
                                            "author": "Blood-Emperor",
                                            "id": "jd730kt",
                                            "parent_id": "t1_jd71vq4",
                                            "score": 2,
                                            "created_utc": 1679476297.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wonder, did Neji only know Hyuga palm techniques? What about nature attacks? If he had nature attacks too he would be more of a complete ninja...\n\nThe Palm techniques on their own are cool but with chakra nature attacks, the ninja is more complete, has better stats.",
            "author": "MrInfinitumEnd",
            "id": "jd74209",
            "parent_id": "t1_jd3buk9",
            "score": 1,
            "created_utc": 1679477195.0,
            "replies": [
                {
                    "body": "It's likely that Gentle Fist takes a lifetime to master and in order to become really competent at it you need to devote all your time to it, so no learning chakra transformation or anything beyond basic ninja techniques.",
                    "author": null,
                    "id": "jd75vqm",
                    "parent_id": "t1_jd74209",
                    "score": 2,
                    "created_utc": 1679478715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Give lee a bottle of jack he would’ve soloed kaguya",
            "author": "No_Seaweed6739",
            "id": "jd5ik64",
            "parent_id": "t1_jd53p3e",
            "score": 35,
            "created_utc": 1679442463.0,
            "replies": []
        },
        {
            "body": "Kishimoto himself didn’t know Naruto was the reincarnation of an alien demigod back then.",
            "author": "ZillaJrKaijuKing",
            "id": "jd4mqke",
            "parent_id": "t1_jd44l6r",
            "score": 39,
            "created_utc": 1679429864.0,
            "replies": [
                {
                    "body": "The signs were all there, you just need to go big brain",
                    "author": "ChineseNeptune",
                    "id": "jd58los",
                    "parent_id": "t1_jd4mqke",
                    "score": 23,
                    "created_utc": 1679438321.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Little did he know the name of the anime is Naruto",
            "author": "guymanthing",
            "id": "jd6ow5t",
            "parent_id": "t1_jd44l6r",
            "score": 5,
            "created_utc": 1679464391.0,
            "replies": []
        },
        {
            "body": "I haven't been watching Boruto... wtf am i missing?",
            "author": "khovel",
            "id": "je9lfxd",
            "parent_id": "t1_jd44l6r",
            "score": 1,
            "created_utc": 1680179834.0,
            "replies": [
                {
                    "body": "Kaguya is a space alien god",
                    "author": "ChineseNeptune",
                    "id": "je9rzym",
                    "parent_id": "t1_je9lfxd",
                    "score": 1,
                    "created_utc": 1680183021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's like real life. You can throw a bunch of punches, sure. But if you can't take a punch, better not get hit.",
            "author": "nottme1",
            "id": "jd4ioxc",
            "parent_id": "t1_jd4da2k",
            "score": 14,
            "created_utc": 1679428346.0,
            "replies": [
                {
                    "body": "Wtf are you on. If it were like real life then naruto suffered the equivalent of his nervous system failing and then still managed ro throw a punch and knock out the strongest genin in the leaf. If it wasn't for the emotional impact and character development behind the fight it'd probably be the worst of the series",
                    "author": "StockPassenger2994",
                    "id": "jd4jptu",
                    "parent_id": "t1_jd4ioxc",
                    "score": 26,
                    "created_utc": 1679428732.0,
                    "replies": [
                        {
                            "body": "Naruto punched him square in the jaw though.\n\nIf you’ve ever been punched in the jaw before, it can rattle your brain and make you dizzy sometimes if you’re hit real hard you could get knocked the f out.",
                            "author": "Cautious-Affect7907",
                            "id": "jd5hi19",
                            "parent_id": "t1_jd4jptu",
                            "score": 8,
                            "created_utc": 1679442022.0,
                            "replies": [
                                {
                                    "body": "Have you ever been punched 64 times across your whole body effectively destroying your second nervousvdystem\n\nNaruto pulled some goofy ass shenanigans",
                                    "author": "fuckedbyturtles",
                                    "id": "jd5nxzn",
                                    "parent_id": "t1_jd5hi19",
                                    "score": 4,
                                    "created_utc": 1679444797.0,
                                    "replies": [
                                        {
                                            "body": "More like poked 64 times but your point still stands.",
                                            "author": "Valedictorian117",
                                            "id": "jd69xpa",
                                            "parent_id": "t1_jd5nxzn",
                                            "score": 2,
                                            "created_utc": 1679454878.0,
                                            "replies": [
                                                {
                                                    "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                                                    "author": "Individual-Ad9753",
                                                    "id": "jd6pay3",
                                                    "parent_id": "t1_jd69xpa",
                                                    "score": 3,
                                                    "created_utc": 1679464707.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
                                            "author": "FantasticDucks",
                                            "id": "jd7omj4",
                                            "parent_id": "t1_jd5nxzn",
                                            "score": 2,
                                            "created_utc": 1679490317.0,
                                            "replies": [
                                                {
                                                    "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                                                    "author": "fuckedbyturtles",
                                                    "id": "jd9zibu",
                                                    "parent_id": "t1_jd7omj4",
                                                    "score": 0,
                                                    "created_utc": 1679522607.0,
                                                    "replies": [
                                                        {
                                                            "body": "It’s called suspension of disbelief.",
                                                            "author": "That_opossum",
                                                            "id": "jettyom",
                                                            "parent_id": "t1_jd9zibu",
                                                            "score": 1,
                                                            "created_utc": 1680552114.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I agree but plot armor saved Naruto more than I can count",
                                                                    "author": "fuckedbyturtles",
                                                                    "id": "jetxeml",
                                                                    "parent_id": "t1_jettyom",
                                                                    "score": 1,
                                                                    "created_utc": 1680553451.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                                                            "author": "That_opossum",
                                                                            "id": "jeudrrj",
                                                                            "parent_id": "t1_jetxeml",
                                                                            "score": 1,
                                                                            "created_utc": 1680560088.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
                                            "author": "Previous_Royal2168",
                                            "id": "jd7958r",
                                            "parent_id": "t1_jd5nxzn",
                                            "score": 1,
                                            "created_utc": 1679481314.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol, this is actually crazy. Neji's arrogance played a role though.",
            "author": "MrInfinitumEnd",
            "id": "jd74af2",
            "parent_id": "t1_jd71noc",
            "score": 1,
            "created_utc": 1679477388.0,
            "replies": []
        },
        {
            "body": "I often forget that Part 1's timeline is at least under a year…",
            "author": "Electrifying-Guy-Eli",
            "id": "jd6mcvi",
            "parent_id": "t1_jd44bvg",
            "score": 2,
            "created_utc": 1679462489.0,
            "replies": []
        },
        {
            "body": "Kiba’s fang over fang repels weapons so that would probably be a bad matchup too.",
            "author": "Takamurarules",
            "id": "jd58hw6",
            "parent_id": "t1_jd4vs7b",
            "score": 8,
            "created_utc": 1679438276.0,
            "replies": []
        },
        {
            "body": "Read it again, you repeated some guys",
            "author": "Formal_Mundane",
            "id": "jd612sr",
            "parent_id": "t1_jd4vs7b",
            "score": 3,
            "created_utc": 1679450625.0,
            "replies": [
                {
                    "body": "yeah I thought I deleted it.",
                    "author": "Lexcomp7",
                    "id": "jd7tq7j",
                    "parent_id": "t1_jd612sr",
                    "score": 1,
                    "created_utc": 1679492640.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You forgot Zaku who might actually have a chance against her",
            "author": "Quick_Campaign4358",
            "id": "jd7l4aa",
            "parent_id": "t1_jd4vs7b",
            "score": 2,
            "created_utc": 1679488598.0,
            "replies": []
        },
        {
            "body": "Oh yeah definitely. He clearly had a general idea (ninjas, fox demon, plucky main character goes to extreme lengths to save his best friend) but he stretched it out way too thin after shippuden and some parts were clearly written by the seat of his pants.",
            "author": "Subject_Tutor",
            "id": "jd75vde",
            "parent_id": "t1_jd71tna",
            "score": 3,
            "created_utc": 1679478706.0,
            "replies": [
                {
                    "body": "Pretty much, yeah. It's a shame really a bit more focus and diligence (especially for the female characters) and Naruto would've been a masterpiece, and I don't say this lightly as an anime hater.",
                    "author": null,
                    "id": "jd768g2",
                    "parent_id": "t1_jd75vde",
                    "score": 1,
                    "created_utc": 1679479004.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“He gave up fighting because he was low on chakra” - That’s losing.",
            "author": "EmmaThais",
            "id": "jd5hv1y",
            "parent_id": "t1_jd5cefv",
            "score": 20,
            "created_utc": 1679442173.0,
            "replies": [
                {
                    "body": "Consider it from this perspective: Had Shikamaru won, he would've had to fight Shino. Had he beat Shino, he would've had to fight either Naruto or Gaara (Sasuke was late, and only managed to stay in the fight based on Orochimaru convincing Hiruzen to keep him in).\n\nShikamaru knew this (not the stuff with Sasuke). He knew he'd have to fight Shino, and Naruto or Gaara.\n\nThis *context* is important, because it means his line about being low on chakra doesn't necessarily mean \"if this fight continues, I will run out of chakra, then lose.\" It very well could mean \"I could continue this fight for a while longer, but I might not have enough chakra for the rest of the tournament.\"\n\nHe did not need to win *to win*. The tournament isn't about who the best fighter is. It's about showing off your new toys to the world, and showing off whether someone would make a capable chunin.\n\nShikamaru did not lose. He forfeited. He could've won had he wanted to, but that would mean he'd be up against his next opponent. If he goes up against another fighter, he might not have enough chakra to make a good showing, which would ruin the previous fight retroactively. Him forfeiting means Temari won the battle but lost the war. *Everyone* now knows that Temari only won because Shikamaru decided to forfeit, and then she'd be forced to fight against Shino.\n\nAlso, Tamari, Kankuro, and Gaara are not jonin level shinobi. They're *chunin* at the most. Gaara's only point in his favour is that he's got a nuke inside him, but he does *not* have the skill for jonin at that time.\n\nEDIT: The way Shikamaru losing the next fight would hurt his previous fight, is due to it sending some very specific messages to the audience. First off: he's a good strategist, but he needs to learn his limits. Or, perhaps, Shikamaru had a month to prepare against Temari, maybe part of his failure was not being able to think on the fly? Or his loss would just erase his previous fight in some eyes.",
                    "author": "advena_phillips",
                    "id": "jd6ujoh",
                    "parent_id": "t1_jd5hv1y",
                    "score": 11,
                    "created_utc": 1679468956.0,
                    "replies": [
                        {
                            "body": "Now I wanna see Shikamaru vs Shino - the two people who faked out being asleep in the stadium.",
                            "author": "Jack-The-Reddit",
                            "id": "jd793an",
                            "parent_id": "t1_jd6ujoh",
                            "score": 5,
                            "created_utc": 1679481272.0,
                            "replies": []
                        },
                        {
                            "body": "This is an excellent comment 👏. I hadn't thought of the fight of Shikamaru with Temari that way.",
                            "author": "MrInfinitumEnd",
                            "id": "jd74p4n",
                            "parent_id": "t1_jd6ujoh",
                            "score": 1,
                            "created_utc": 1679477735.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And it's fine because in order to win, sometimes you have to lose.",
                    "author": "ChunkyChuckles",
                    "id": "jd6g2ok",
                    "parent_id": "t1_jd5hv1y",
                    "score": 3,
                    "created_utc": 1679458328.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The 9 tails is often cheating, which is why I prefer sage naruto to any other powered up form by the end. But at this point in the story it was actually making him weaker, as Orochimaru has janked his seal, and Jiraya hadn’t fixed it yet, at least not before the Kiba fight, which is mostly where I thing Naruto got a bad wrap. Also, he didn’t use 9 tail chakra to defeat Kiba.",
            "author": "Felsig27",
            "id": "jeung1s",
            "parent_id": "t1_jetupei",
            "score": 1,
            "created_utc": 1680564272.0,
            "replies": []
        },
        {
            "body": "Given that naruto had an extra seal messing with his chakra and blocking the 9 tails he would straight up lose even if they fought during the preliminary matches",
            "author": "Visible-Effective944",
            "id": "jd5cho0",
            "parent_id": "t1_jd4psf5",
            "score": 8,
            "created_utc": 1679439918.0,
            "replies": []
        },
        {
            "body": "Lee wasn’t a counter at all. After that impressive showing it turned out to not even lay a single scratch on Gaara’s body. No one in the prelims was touching Gaara except Kabuto if he hadn’t quit.",
            "author": "Valedictorian117",
            "id": "jd6afqn",
            "parent_id": "t1_jd4psf5",
            "score": 0,
            "created_utc": 1679455145.0,
            "replies": []
        },
        {
            "body": "The only thing is, Neji did have the speed to fight Garra.   He was stated to be as fast as weightless Lee at the time, who was shown to be able to land hits on Gaarra, only the gentle fist would be more effective since he's tatgeting chakra rather than a knockout.  \n\nIf Lee's primary lotus didn't task him as hard as it did, he would've got the same result as Sasuke without Gates and would've just had to figure out how to break the sand cocoon (probably would've needed the gates).",
            "author": "IMSABU",
            "id": "jd6fzdv",
            "parent_id": "t1_jd4psf5",
            "score": 0,
            "created_utc": 1679458271.0,
            "replies": []
        },
        {
            "body": "At point in the series he only ever *chose* to get Kurama's chakra for Gamabunta.\n\nBut even then there's numerous examples of Kurama feeding Naruto chakra even without him having blocked chakra points.\n\nThe point being Naruto was almost destined to beat Neji:\n\nHe had way bigger chakra by default, if Neji tried fighting back then Kurama's chakra comes out and he loses.\n\nSo either way Neji's philosophy is proven correct with the only thing he got wrong was that *he'd* win instead of Naruto.\n\nThen y'know, Neji was born to die for the main branch and despite all the changes to the clan he chooses to die just like his father, just as fate planned.\n\nNeji never could run from fate as much as he tried.",
            "author": "Koharu_Hidaka",
            "id": "jd4ls9f",
            "parent_id": "t1_jd4j863",
            "score": 4,
            "created_utc": 1679429509.0,
            "replies": [
                {
                    "body": "His philosophy gotten proven right in the war Arc, but Narito still had to train in order to be able to access the 9 tails' power without being in a life and death circumstance and enraged.",
                    "author": "Visible-Effective944",
                    "id": "jd5cr7e",
                    "parent_id": "t1_jd4ls9f",
                    "score": 2,
                    "created_utc": 1679440027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That shit is not even a fight",
            "author": "Born-Middle-8815",
            "id": "jd3mgyi",
            "parent_id": "t1_jd3md2b",
            "score": 12,
            "created_utc": 1679416128.0,
            "replies": [
                {
                    "body": "Yeah",
                    "author": "Huge_Ad6338",
                    "id": "jd3mttz",
                    "parent_id": "t1_jd3mgyi",
                    "score": 2,
                    "created_utc": 1679416263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any hit other than the KO?",
            "author": "Born-Middle-8815",
            "id": "jd3u8up",
            "parent_id": "t1_jd3tzmj",
            "score": 1,
            "created_utc": 1679419084.0,
            "replies": [
                {
                    "body": "The 9 tails chakra powered punch that collided with Neji’s rotation and [drilled him into the ground.](https://official-complete-2.eorzea.us/manga/Naruto/0104-013.png)\n\nI’d say that actually did the majority of the damage, the surprise uppercut KO wouldn’t be possible without it",
                    "author": "SaintAhmad",
                    "id": "jd3unxd",
                    "parent_id": "t1_jd3u8up",
                    "score": 2,
                    "created_utc": 1679419241.0,
                    "replies": [
                        {
                            "body": "Didn't Naruto's punch collide with the rotation which caused a huge explosion? It's more like Neji was out of chakra rather than psychically injured. If he was, then it would be from the shockwave, not Naruto's punch",
                            "author": "Born-Middle-8815",
                            "id": "jd3uz15",
                            "parent_id": "t1_jd3unxd",
                            "score": 2,
                            "created_utc": 1679419358.0,
                            "replies": [
                                {
                                    "body": "The shockwave is caused by the punch, so it’s still a significant hit. \n\nHeck, the proctor thought that alone was enough to take down [Neji](https://official-complete-2.eorzea.us/manga/Naruto/0104-011.png). And you can see how damaged Neji is following it, so it wasn’t just him being low on chakra.",
                                    "author": "SaintAhmad",
                                    "id": "jd3vrln",
                                    "parent_id": "t1_jd3uz15",
                                    "score": 4,
                                    "created_utc": 1679419654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know right, it's soo unfair that Temari had the power to be strong while TenTen just happened to have the power to be weak.",
            "author": "JojoFag420",
            "id": "jd49e3l",
            "parent_id": "t1_jd3t6tp",
            "score": 460,
            "created_utc": 1679424799.0,
            "replies": [
                {
                    "body": "Nah, man. At that point in time Tenten could have easily cleared like half the competing roster or more. She had good to fantastic odds of beating anyone except Gaara, Temari, Lee, Neji and Sasuke. Probably Naruto too just for his hax powers.",
                    "author": "XishengTheUltimate",
                    "id": "jd4aord",
                    "parent_id": "t1_jd49e3l",
                    "score": 271,
                    "created_utc": 1679425284.0,
                    "replies": [
                        {
                            "body": "Well she'd also lose to the sound ninjas. And shit when kiba does fang over fang his rotation repels any kunai so I think she has bad odds there too.",
                            "author": "hoeassbitchasshoe",
                            "id": "jd4wk6k",
                            "parent_id": "t1_jd4aord",
                            "score": 90,
                            "created_utc": 1679433531.0,
                            "replies": [
                                {
                                    "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
                                    "author": "XishengTheUltimate",
                                    "id": "jd5a9kz",
                                    "parent_id": "t1_jd4wk6k",
                                    "score": 43,
                                    "created_utc": 1679439019.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That’s cap. We all know thrown weapons never hurt anybody regardless of how many you throw.",
                            "author": "Xandril",
                            "id": "jdgpz8y",
                            "parent_id": "t1_jd4aord",
                            "score": 3,
                            "created_utc": 1679643600.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "if kishimoto had tried to develop tenten abilitys, temari's winds would be nothing to chakra-coated nest weapons, it would be resistant to natural elements like wind but he didn't even try and just made her a loser",
                    "author": "EternalMemes30",
                    "id": "jd4ax9n",
                    "parent_id": "t1_jd49e3l",
                    "score": 100,
                    "created_utc": 1679425375.0,
                    "replies": [
                        {
                            "body": "> I can throw shuriken like, really really good\n\nYeah honestly wtf was he thinking lol",
                            "author": "iamkira01",
                            "id": "jd5ehed",
                            "parent_id": "t1_jd4ax9n",
                            "score": 58,
                            "created_utc": 1679440740.0,
                            "replies": [
                                {
                                    "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
                                    "author": "DeusVulticus13",
                                    "id": "jd7qqb5",
                                    "parent_id": "t1_jd5ehed",
                                    "score": 12,
                                    "created_utc": 1679491290.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "By jonin rank most ninja develop 2 changes in chakra nature but we never saw jonin level tenten or any of the konoha 12 at jonin rank other than Neji and Sakura.",
                            "author": "lilgleesh1901",
                            "id": "jd5nnbi",
                            "parent_id": "t1_jd4ax9n",
                            "score": 22,
                            "created_utc": 1679444670.0,
                            "replies": []
                        },
                        {
                            "body": "He didn't even bother to draw the fight 😂",
                            "author": "Quakson82736",
                            "id": "jd744v8",
                            "parent_id": "t1_jd4ax9n",
                            "score": 4,
                            "created_utc": 1679477261.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tenten underrated because of her comparison to geniuses. She doesn’t have to be a genius to be the best ninja tool specialist.",
                    "author": "lilgleesh1901",
                    "id": "jd5nfbq",
                    "parent_id": "t1_jd49e3l",
                    "score": 16,
                    "created_utc": 1679444574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tenten with that extreme speed",
            "author": "DevaPath_Winchester",
            "id": "jd4ykup",
            "parent_id": "t1_jd3t6tp",
            "score": 3,
            "created_utc": 1679434305.0,
            "replies": []
        },
        {
            "body": "Would she have beat Shikimaru, Hinata, or the sound ninja? Sasuke? Which matchup would Tenten have a good one on one with, I don’t think she ever really gets a good fight.",
            "author": "Silver-Animator-1905",
            "id": "jd67fzh",
            "parent_id": "t1_jd3t6tp",
            "score": 1,
            "created_utc": 1679453619.0,
            "replies": [
                {
                    "body": "She would've beaten every single kunoichi except temari. I am not sure about Shikamaru.",
                    "author": "Immediate_Ad_8138",
                    "id": "jdd1854",
                    "parent_id": "t1_jd67fzh",
                    "score": 2,
                    "created_utc": 1679583606.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay, but considering how intense Kurama’s Chakra tends to be, it’d be pretty hard to be a Ninja if your hands have nothing but 3rd degree burns on them and lose the ability to channel chakra to them, and that’s not if Naruto figures out Killing Intent over the prior month and gives all present Pissed Off Kushina flashbacks, flashbacks to the worst Birthday Naruto ever had, or flashbacks to when his eldest brother got fed up with his shenanigans in Shukaku’s case, and there’s also if Naruto ends up learning seals and by extension the Hiraishin, how to unfuck his Waifu’s family, and the Rasengan which might result in Iwa slapping him with the same designation as his dad A.K.A. Flee on sight",
            "author": "Ashbr1ng3r",
            "id": "jd626gj",
            "parent_id": "t1_jd4vazk",
            "score": 2,
            "created_utc": 1679451133.0,
            "replies": [
                {
                    "body": "Huh?",
                    "author": "afrika210",
                    "id": "jd6wds7",
                    "parent_id": "t1_jd626gj",
                    "score": 3,
                    "created_utc": 1679470515.0,
                    "replies": []
                },
                {
                    "body": "I didn't get a thing yoh said but it felt great to listen to u🙂",
                    "author": "Dark_Silver007",
                    "id": "jd6x2z7",
                    "parent_id": "t1_jd626gj",
                    "score": 2,
                    "created_utc": 1679471110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would be a good match but gaara wins. I dont see neji coming near gaara to disable his chakra points.",
            "author": "Shadow_Clone_007",
            "id": "jd6bla3",
            "parent_id": "t1_jd66hqv",
            "score": 44,
            "created_utc": 1679455757.0,
            "replies": [
                {
                    "body": "Neji could dismantle the sand constructs by injecting chakra into them.\n\nHe can use kaiten to repel attacks\n\nAnd use full body blow in case he's caught in sand burial.\n\nThere's a reason why Kankuro and Temari considered him as much a monster as Gaara",
                    "author": "Blood-Emperor",
                    "id": "jd6zxb7",
                    "parent_id": "t1_jd6bla3",
                    "score": 9,
                    "created_utc": 1679473572.0,
                    "replies": [
                        {
                            "body": ">Neji could dismantle the sand constructs by injecting chakra into them.\n\nWould this work? The sand is not like a body which has Chakra points.",
                            "author": "MrInfinitumEnd",
                            "id": "jd73t0s",
                            "parent_id": "t1_jd6zxb7",
                            "score": 7,
                            "created_utc": 1679476985.0,
                            "replies": [
                                {
                                    "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
                                    "author": "Blood-Emperor",
                                    "id": "jd746oe",
                                    "parent_id": "t1_jd73t0s",
                                    "score": 9,
                                    "created_utc": 1679477302.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Lee was also attacking the sand with punches and kicks and just about won and I firmly put Neji above Lee. I highly doubt Gaara wants those problems.",
                            "author": "death_warrant",
                            "id": "jd73t2h",
                            "parent_id": "t1_jd6zxb7",
                            "score": 3,
                            "created_utc": 1679476986.0,
                            "replies": [
                                {
                                    "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
                                    "author": "Blood-Emperor",
                                    "id": "jd74eck",
                                    "parent_id": "t1_jd73t2h",
                                    "score": 7,
                                    "created_utc": 1679477480.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dosu was shaking in fear from Neji's gaze. Neji smokes them",
            "author": "Born-Middle-8815",
            "id": "jd3w71o",
            "parent_id": "t1_jd3vypr",
            "score": 101,
            "created_utc": 1679419814.0,
            "replies": [
                {
                    "body": "Wasn’t that the aura from Sasuke’s curse mark?",
                    "author": "X-Force-32",
                    "id": "jd43p8i",
                    "parent_id": "t1_jd3w71o",
                    "score": 4,
                    "created_utc": 1679422646.0,
                    "replies": [
                        {
                            "body": "That happened later. When Neji activated Byakugan, Dosu trembled a bit",
                            "author": "Born-Middle-8815",
                            "id": "jd43z0h",
                            "parent_id": "t1_jd43p8i",
                            "score": 55,
                            "created_utc": 1679422750.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now to be fair, Lee was holding back like a mf there, If he'd taken off his weights or used any of the gates, he could have happily murdered the lot of them with no trouble",
            "author": "Teh-Cthulhu",
            "id": "jd6k6x1",
            "parent_id": "t1_jd3vypr",
            "score": 8,
            "created_utc": 1679460960.0,
            "replies": [
                {
                    "body": "He used the first gate for primary lotus",
                    "author": "HeraldofblueRP",
                    "id": "jd7o8k0",
                    "parent_id": "t1_jd6k6x1",
                    "score": 2,
                    "created_utc": 1679490130.0,
                    "replies": [
                        {
                            "body": "Yeah sure the primary lotus but thats practically negligible compared to the effects of the other gates",
                            "author": "Teh-Cthulhu",
                            "id": "jd7qu65",
                            "parent_id": "t1_jd7o8k0",
                            "score": 0,
                            "created_utc": 1679491340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How? Best he could do is use rotation to deflect them, but Temari is relentless especially if she summons that weasel thing",
            "author": null,
            "id": "jd703os",
            "parent_id": "t1_jd700lx",
            "score": 0,
            "created_utc": 1679473727.0,
            "replies": [
                {
                    "body": "Again, Neji would slap everything away😂😂😂\n\nJyuken. Temari's attacks are made from chakra. And the weasel would also get slapped away.\n\nThis Neji, Taijutsu specialist. Have you seen what he could do against his worst possible enemy, known as Kidomaru, who had stronger, numerous and faster attacks beyond what Temari has?",
                    "author": "Blood-Emperor",
                    "id": "jd70d14",
                    "parent_id": "t1_jd703os",
                    "score": 3,
                    "created_utc": 1679473964.0,
                    "replies": [
                        {
                            "body": "If it's chakra and not wind and vulnerable to chakra dispelling then yeah, Neji wins",
                            "author": null,
                            "id": "jd71vq4",
                            "parent_id": "t1_jd70d14",
                            "score": 1,
                            "created_utc": 1679475303.0,
                            "replies": [
                                {
                                    "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
                                    "author": "Blood-Emperor",
                                    "id": "jd730kt",
                                    "parent_id": "t1_jd71vq4",
                                    "score": 2,
                                    "created_utc": 1679476297.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's likely that Gentle Fist takes a lifetime to master and in order to become really competent at it you need to devote all your time to it, so no learning chakra transformation or anything beyond basic ninja techniques.",
            "author": null,
            "id": "jd75vqm",
            "parent_id": "t1_jd74209",
            "score": 2,
            "created_utc": 1679478715.0,
            "replies": []
        },
        {
            "body": "The signs were all there, you just need to go big brain",
            "author": "ChineseNeptune",
            "id": "jd58los",
            "parent_id": "t1_jd4mqke",
            "score": 23,
            "created_utc": 1679438321.0,
            "replies": []
        },
        {
            "body": "Kaguya is a space alien god",
            "author": "ChineseNeptune",
            "id": "je9rzym",
            "parent_id": "t1_je9lfxd",
            "score": 1,
            "created_utc": 1680183021.0,
            "replies": []
        },
        {
            "body": "Wtf are you on. If it were like real life then naruto suffered the equivalent of his nervous system failing and then still managed ro throw a punch and knock out the strongest genin in the leaf. If it wasn't for the emotional impact and character development behind the fight it'd probably be the worst of the series",
            "author": "StockPassenger2994",
            "id": "jd4jptu",
            "parent_id": "t1_jd4ioxc",
            "score": 26,
            "created_utc": 1679428732.0,
            "replies": [
                {
                    "body": "Naruto punched him square in the jaw though.\n\nIf you’ve ever been punched in the jaw before, it can rattle your brain and make you dizzy sometimes if you’re hit real hard you could get knocked the f out.",
                    "author": "Cautious-Affect7907",
                    "id": "jd5hi19",
                    "parent_id": "t1_jd4jptu",
                    "score": 8,
                    "created_utc": 1679442022.0,
                    "replies": [
                        {
                            "body": "Have you ever been punched 64 times across your whole body effectively destroying your second nervousvdystem\n\nNaruto pulled some goofy ass shenanigans",
                            "author": "fuckedbyturtles",
                            "id": "jd5nxzn",
                            "parent_id": "t1_jd5hi19",
                            "score": 4,
                            "created_utc": 1679444797.0,
                            "replies": [
                                {
                                    "body": "More like poked 64 times but your point still stands.",
                                    "author": "Valedictorian117",
                                    "id": "jd69xpa",
                                    "parent_id": "t1_jd5nxzn",
                                    "score": 2,
                                    "created_utc": 1679454878.0,
                                    "replies": [
                                        {
                                            "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                                            "author": "Individual-Ad9753",
                                            "id": "jd6pay3",
                                            "parent_id": "t1_jd69xpa",
                                            "score": 3,
                                            "created_utc": 1679464707.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
                                    "author": "FantasticDucks",
                                    "id": "jd7omj4",
                                    "parent_id": "t1_jd5nxzn",
                                    "score": 2,
                                    "created_utc": 1679490317.0,
                                    "replies": [
                                        {
                                            "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                                            "author": "fuckedbyturtles",
                                            "id": "jd9zibu",
                                            "parent_id": "t1_jd7omj4",
                                            "score": 0,
                                            "created_utc": 1679522607.0,
                                            "replies": [
                                                {
                                                    "body": "It’s called suspension of disbelief.",
                                                    "author": "That_opossum",
                                                    "id": "jettyom",
                                                    "parent_id": "t1_jd9zibu",
                                                    "score": 1,
                                                    "created_utc": 1680552114.0,
                                                    "replies": [
                                                        {
                                                            "body": "I agree but plot armor saved Naruto more than I can count",
                                                            "author": "fuckedbyturtles",
                                                            "id": "jetxeml",
                                                            "parent_id": "t1_jettyom",
                                                            "score": 1,
                                                            "created_utc": 1680553451.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                                                    "author": "That_opossum",
                                                                    "id": "jeudrrj",
                                                                    "parent_id": "t1_jetxeml",
                                                                    "score": 1,
                                                                    "created_utc": 1680560088.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
                                    "author": "Previous_Royal2168",
                                    "id": "jd7958r",
                                    "parent_id": "t1_jd5nxzn",
                                    "score": 1,
                                    "created_utc": 1679481314.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah I thought I deleted it.",
            "author": "Lexcomp7",
            "id": "jd7tq7j",
            "parent_id": "t1_jd612sr",
            "score": 1,
            "created_utc": 1679492640.0,
            "replies": []
        },
        {
            "body": "Pretty much, yeah. It's a shame really a bit more focus and diligence (especially for the female characters) and Naruto would've been a masterpiece, and I don't say this lightly as an anime hater.",
            "author": null,
            "id": "jd768g2",
            "parent_id": "t1_jd75vde",
            "score": 1,
            "created_utc": 1679479004.0,
            "replies": []
        },
        {
            "body": "Consider it from this perspective: Had Shikamaru won, he would've had to fight Shino. Had he beat Shino, he would've had to fight either Naruto or Gaara (Sasuke was late, and only managed to stay in the fight based on Orochimaru convincing Hiruzen to keep him in).\n\nShikamaru knew this (not the stuff with Sasuke). He knew he'd have to fight Shino, and Naruto or Gaara.\n\nThis *context* is important, because it means his line about being low on chakra doesn't necessarily mean \"if this fight continues, I will run out of chakra, then lose.\" It very well could mean \"I could continue this fight for a while longer, but I might not have enough chakra for the rest of the tournament.\"\n\nHe did not need to win *to win*. The tournament isn't about who the best fighter is. It's about showing off your new toys to the world, and showing off whether someone would make a capable chunin.\n\nShikamaru did not lose. He forfeited. He could've won had he wanted to, but that would mean he'd be up against his next opponent. If he goes up against another fighter, he might not have enough chakra to make a good showing, which would ruin the previous fight retroactively. Him forfeiting means Temari won the battle but lost the war. *Everyone* now knows that Temari only won because Shikamaru decided to forfeit, and then she'd be forced to fight against Shino.\n\nAlso, Tamari, Kankuro, and Gaara are not jonin level shinobi. They're *chunin* at the most. Gaara's only point in his favour is that he's got a nuke inside him, but he does *not* have the skill for jonin at that time.\n\nEDIT: The way Shikamaru losing the next fight would hurt his previous fight, is due to it sending some very specific messages to the audience. First off: he's a good strategist, but he needs to learn his limits. Or, perhaps, Shikamaru had a month to prepare against Temari, maybe part of his failure was not being able to think on the fly? Or his loss would just erase his previous fight in some eyes.",
            "author": "advena_phillips",
            "id": "jd6ujoh",
            "parent_id": "t1_jd5hv1y",
            "score": 11,
            "created_utc": 1679468956.0,
            "replies": [
                {
                    "body": "Now I wanna see Shikamaru vs Shino - the two people who faked out being asleep in the stadium.",
                    "author": "Jack-The-Reddit",
                    "id": "jd793an",
                    "parent_id": "t1_jd6ujoh",
                    "score": 5,
                    "created_utc": 1679481272.0,
                    "replies": []
                },
                {
                    "body": "This is an excellent comment 👏. I hadn't thought of the fight of Shikamaru with Temari that way.",
                    "author": "MrInfinitumEnd",
                    "id": "jd74p4n",
                    "parent_id": "t1_jd6ujoh",
                    "score": 1,
                    "created_utc": 1679477735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And it's fine because in order to win, sometimes you have to lose.",
            "author": "ChunkyChuckles",
            "id": "jd6g2ok",
            "parent_id": "t1_jd5hv1y",
            "score": 3,
            "created_utc": 1679458328.0,
            "replies": []
        },
        {
            "body": "His philosophy gotten proven right in the war Arc, but Narito still had to train in order to be able to access the 9 tails' power without being in a life and death circumstance and enraged.",
            "author": "Visible-Effective944",
            "id": "jd5cr7e",
            "parent_id": "t1_jd4ls9f",
            "score": 2,
            "created_utc": 1679440027.0,
            "replies": []
        },
        {
            "body": "Yeah",
            "author": "Huge_Ad6338",
            "id": "jd3mttz",
            "parent_id": "t1_jd3mgyi",
            "score": 2,
            "created_utc": 1679416263.0,
            "replies": []
        },
        {
            "body": "The 9 tails chakra powered punch that collided with Neji’s rotation and [drilled him into the ground.](https://official-complete-2.eorzea.us/manga/Naruto/0104-013.png)\n\nI’d say that actually did the majority of the damage, the surprise uppercut KO wouldn’t be possible without it",
            "author": "SaintAhmad",
            "id": "jd3unxd",
            "parent_id": "t1_jd3u8up",
            "score": 2,
            "created_utc": 1679419241.0,
            "replies": [
                {
                    "body": "Didn't Naruto's punch collide with the rotation which caused a huge explosion? It's more like Neji was out of chakra rather than psychically injured. If he was, then it would be from the shockwave, not Naruto's punch",
                    "author": "Born-Middle-8815",
                    "id": "jd3uz15",
                    "parent_id": "t1_jd3unxd",
                    "score": 2,
                    "created_utc": 1679419358.0,
                    "replies": [
                        {
                            "body": "The shockwave is caused by the punch, so it’s still a significant hit. \n\nHeck, the proctor thought that alone was enough to take down [Neji](https://official-complete-2.eorzea.us/manga/Naruto/0104-011.png). And you can see how damaged Neji is following it, so it wasn’t just him being low on chakra.",
                            "author": "SaintAhmad",
                            "id": "jd3vrln",
                            "parent_id": "t1_jd3uz15",
                            "score": 4,
                            "created_utc": 1679419654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah, man. At that point in time Tenten could have easily cleared like half the competing roster or more. She had good to fantastic odds of beating anyone except Gaara, Temari, Lee, Neji and Sasuke. Probably Naruto too just for his hax powers.",
            "author": "XishengTheUltimate",
            "id": "jd4aord",
            "parent_id": "t1_jd49e3l",
            "score": 271,
            "created_utc": 1679425284.0,
            "replies": [
                {
                    "body": "Well she'd also lose to the sound ninjas. And shit when kiba does fang over fang his rotation repels any kunai so I think she has bad odds there too.",
                    "author": "hoeassbitchasshoe",
                    "id": "jd4wk6k",
                    "parent_id": "t1_jd4aord",
                    "score": 90,
                    "created_utc": 1679433531.0,
                    "replies": [
                        {
                            "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
                            "author": "XishengTheUltimate",
                            "id": "jd5a9kz",
                            "parent_id": "t1_jd4wk6k",
                            "score": 43,
                            "created_utc": 1679439019.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That’s cap. We all know thrown weapons never hurt anybody regardless of how many you throw.",
                    "author": "Xandril",
                    "id": "jdgpz8y",
                    "parent_id": "t1_jd4aord",
                    "score": 3,
                    "created_utc": 1679643600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "if kishimoto had tried to develop tenten abilitys, temari's winds would be nothing to chakra-coated nest weapons, it would be resistant to natural elements like wind but he didn't even try and just made her a loser",
            "author": "EternalMemes30",
            "id": "jd4ax9n",
            "parent_id": "t1_jd49e3l",
            "score": 100,
            "created_utc": 1679425375.0,
            "replies": [
                {
                    "body": "> I can throw shuriken like, really really good\n\nYeah honestly wtf was he thinking lol",
                    "author": "iamkira01",
                    "id": "jd5ehed",
                    "parent_id": "t1_jd4ax9n",
                    "score": 58,
                    "created_utc": 1679440740.0,
                    "replies": [
                        {
                            "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
                            "author": "DeusVulticus13",
                            "id": "jd7qqb5",
                            "parent_id": "t1_jd5ehed",
                            "score": 12,
                            "created_utc": 1679491290.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "By jonin rank most ninja develop 2 changes in chakra nature but we never saw jonin level tenten or any of the konoha 12 at jonin rank other than Neji and Sakura.",
                    "author": "lilgleesh1901",
                    "id": "jd5nnbi",
                    "parent_id": "t1_jd4ax9n",
                    "score": 22,
                    "created_utc": 1679444670.0,
                    "replies": []
                },
                {
                    "body": "He didn't even bother to draw the fight 😂",
                    "author": "Quakson82736",
                    "id": "jd744v8",
                    "parent_id": "t1_jd4ax9n",
                    "score": 4,
                    "created_utc": 1679477261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tenten underrated because of her comparison to geniuses. She doesn’t have to be a genius to be the best ninja tool specialist.",
            "author": "lilgleesh1901",
            "id": "jd5nfbq",
            "parent_id": "t1_jd49e3l",
            "score": 16,
            "created_utc": 1679444574.0,
            "replies": []
        },
        {
            "body": "She would've beaten every single kunoichi except temari. I am not sure about Shikamaru.",
            "author": "Immediate_Ad_8138",
            "id": "jdd1854",
            "parent_id": "t1_jd67fzh",
            "score": 2,
            "created_utc": 1679583606.0,
            "replies": []
        },
        {
            "body": "Huh?",
            "author": "afrika210",
            "id": "jd6wds7",
            "parent_id": "t1_jd626gj",
            "score": 3,
            "created_utc": 1679470515.0,
            "replies": []
        },
        {
            "body": "I didn't get a thing yoh said but it felt great to listen to u🙂",
            "author": "Dark_Silver007",
            "id": "jd6x2z7",
            "parent_id": "t1_jd626gj",
            "score": 2,
            "created_utc": 1679471110.0,
            "replies": []
        },
        {
            "body": "Neji could dismantle the sand constructs by injecting chakra into them.\n\nHe can use kaiten to repel attacks\n\nAnd use full body blow in case he's caught in sand burial.\n\nThere's a reason why Kankuro and Temari considered him as much a monster as Gaara",
            "author": "Blood-Emperor",
            "id": "jd6zxb7",
            "parent_id": "t1_jd6bla3",
            "score": 9,
            "created_utc": 1679473572.0,
            "replies": [
                {
                    "body": ">Neji could dismantle the sand constructs by injecting chakra into them.\n\nWould this work? The sand is not like a body which has Chakra points.",
                    "author": "MrInfinitumEnd",
                    "id": "jd73t0s",
                    "parent_id": "t1_jd6zxb7",
                    "score": 7,
                    "created_utc": 1679476985.0,
                    "replies": [
                        {
                            "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
                            "author": "Blood-Emperor",
                            "id": "jd746oe",
                            "parent_id": "t1_jd73t0s",
                            "score": 9,
                            "created_utc": 1679477302.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lee was also attacking the sand with punches and kicks and just about won and I firmly put Neji above Lee. I highly doubt Gaara wants those problems.",
                    "author": "death_warrant",
                    "id": "jd73t2h",
                    "parent_id": "t1_jd6zxb7",
                    "score": 3,
                    "created_utc": 1679476986.0,
                    "replies": [
                        {
                            "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
                            "author": "Blood-Emperor",
                            "id": "jd74eck",
                            "parent_id": "t1_jd73t2h",
                            "score": 7,
                            "created_utc": 1679477480.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wasn’t that the aura from Sasuke’s curse mark?",
            "author": "X-Force-32",
            "id": "jd43p8i",
            "parent_id": "t1_jd3w71o",
            "score": 4,
            "created_utc": 1679422646.0,
            "replies": [
                {
                    "body": "That happened later. When Neji activated Byakugan, Dosu trembled a bit",
                    "author": "Born-Middle-8815",
                    "id": "jd43z0h",
                    "parent_id": "t1_jd43p8i",
                    "score": 55,
                    "created_utc": 1679422750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He used the first gate for primary lotus",
            "author": "HeraldofblueRP",
            "id": "jd7o8k0",
            "parent_id": "t1_jd6k6x1",
            "score": 2,
            "created_utc": 1679490130.0,
            "replies": [
                {
                    "body": "Yeah sure the primary lotus but thats practically negligible compared to the effects of the other gates",
                    "author": "Teh-Cthulhu",
                    "id": "jd7qu65",
                    "parent_id": "t1_jd7o8k0",
                    "score": 0,
                    "created_utc": 1679491340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, Neji would slap everything away😂😂😂\n\nJyuken. Temari's attacks are made from chakra. And the weasel would also get slapped away.\n\nThis Neji, Taijutsu specialist. Have you seen what he could do against his worst possible enemy, known as Kidomaru, who had stronger, numerous and faster attacks beyond what Temari has?",
            "author": "Blood-Emperor",
            "id": "jd70d14",
            "parent_id": "t1_jd703os",
            "score": 3,
            "created_utc": 1679473964.0,
            "replies": [
                {
                    "body": "If it's chakra and not wind and vulnerable to chakra dispelling then yeah, Neji wins",
                    "author": null,
                    "id": "jd71vq4",
                    "parent_id": "t1_jd70d14",
                    "score": 1,
                    "created_utc": 1679475303.0,
                    "replies": [
                        {
                            "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
                            "author": "Blood-Emperor",
                            "id": "jd730kt",
                            "parent_id": "t1_jd71vq4",
                            "score": 2,
                            "created_utc": 1679476297.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto punched him square in the jaw though.\n\nIf you’ve ever been punched in the jaw before, it can rattle your brain and make you dizzy sometimes if you’re hit real hard you could get knocked the f out.",
            "author": "Cautious-Affect7907",
            "id": "jd5hi19",
            "parent_id": "t1_jd4jptu",
            "score": 8,
            "created_utc": 1679442022.0,
            "replies": [
                {
                    "body": "Have you ever been punched 64 times across your whole body effectively destroying your second nervousvdystem\n\nNaruto pulled some goofy ass shenanigans",
                    "author": "fuckedbyturtles",
                    "id": "jd5nxzn",
                    "parent_id": "t1_jd5hi19",
                    "score": 4,
                    "created_utc": 1679444797.0,
                    "replies": [
                        {
                            "body": "More like poked 64 times but your point still stands.",
                            "author": "Valedictorian117",
                            "id": "jd69xpa",
                            "parent_id": "t1_jd5nxzn",
                            "score": 2,
                            "created_utc": 1679454878.0,
                            "replies": [
                                {
                                    "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                                    "author": "Individual-Ad9753",
                                    "id": "jd6pay3",
                                    "parent_id": "t1_jd69xpa",
                                    "score": 3,
                                    "created_utc": 1679464707.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
                            "author": "FantasticDucks",
                            "id": "jd7omj4",
                            "parent_id": "t1_jd5nxzn",
                            "score": 2,
                            "created_utc": 1679490317.0,
                            "replies": [
                                {
                                    "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                                    "author": "fuckedbyturtles",
                                    "id": "jd9zibu",
                                    "parent_id": "t1_jd7omj4",
                                    "score": 0,
                                    "created_utc": 1679522607.0,
                                    "replies": [
                                        {
                                            "body": "It’s called suspension of disbelief.",
                                            "author": "That_opossum",
                                            "id": "jettyom",
                                            "parent_id": "t1_jd9zibu",
                                            "score": 1,
                                            "created_utc": 1680552114.0,
                                            "replies": [
                                                {
                                                    "body": "I agree but plot armor saved Naruto more than I can count",
                                                    "author": "fuckedbyturtles",
                                                    "id": "jetxeml",
                                                    "parent_id": "t1_jettyom",
                                                    "score": 1,
                                                    "created_utc": 1680553451.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                                            "author": "That_opossum",
                                                            "id": "jeudrrj",
                                                            "parent_id": "t1_jetxeml",
                                                            "score": 1,
                                                            "created_utc": 1680560088.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
                            "author": "Previous_Royal2168",
                            "id": "jd7958r",
                            "parent_id": "t1_jd5nxzn",
                            "score": 1,
                            "created_utc": 1679481314.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now I wanna see Shikamaru vs Shino - the two people who faked out being asleep in the stadium.",
            "author": "Jack-The-Reddit",
            "id": "jd793an",
            "parent_id": "t1_jd6ujoh",
            "score": 5,
            "created_utc": 1679481272.0,
            "replies": []
        },
        {
            "body": "This is an excellent comment 👏. I hadn't thought of the fight of Shikamaru with Temari that way.",
            "author": "MrInfinitumEnd",
            "id": "jd74p4n",
            "parent_id": "t1_jd6ujoh",
            "score": 1,
            "created_utc": 1679477735.0,
            "replies": []
        },
        {
            "body": "Didn't Naruto's punch collide with the rotation which caused a huge explosion? It's more like Neji was out of chakra rather than psychically injured. If he was, then it would be from the shockwave, not Naruto's punch",
            "author": "Born-Middle-8815",
            "id": "jd3uz15",
            "parent_id": "t1_jd3unxd",
            "score": 2,
            "created_utc": 1679419358.0,
            "replies": [
                {
                    "body": "The shockwave is caused by the punch, so it’s still a significant hit. \n\nHeck, the proctor thought that alone was enough to take down [Neji](https://official-complete-2.eorzea.us/manga/Naruto/0104-011.png). And you can see how damaged Neji is following it, so it wasn’t just him being low on chakra.",
                    "author": "SaintAhmad",
                    "id": "jd3vrln",
                    "parent_id": "t1_jd3uz15",
                    "score": 4,
                    "created_utc": 1679419654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well she'd also lose to the sound ninjas. And shit when kiba does fang over fang his rotation repels any kunai so I think she has bad odds there too.",
            "author": "hoeassbitchasshoe",
            "id": "jd4wk6k",
            "parent_id": "t1_jd4aord",
            "score": 90,
            "created_utc": 1679433531.0,
            "replies": [
                {
                    "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
                    "author": "XishengTheUltimate",
                    "id": "jd5a9kz",
                    "parent_id": "t1_jd4wk6k",
                    "score": 43,
                    "created_utc": 1679439019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s cap. We all know thrown weapons never hurt anybody regardless of how many you throw.",
            "author": "Xandril",
            "id": "jdgpz8y",
            "parent_id": "t1_jd4aord",
            "score": 3,
            "created_utc": 1679643600.0,
            "replies": []
        },
        {
            "body": "> I can throw shuriken like, really really good\n\nYeah honestly wtf was he thinking lol",
            "author": "iamkira01",
            "id": "jd5ehed",
            "parent_id": "t1_jd4ax9n",
            "score": 58,
            "created_utc": 1679440740.0,
            "replies": [
                {
                    "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
                    "author": "DeusVulticus13",
                    "id": "jd7qqb5",
                    "parent_id": "t1_jd5ehed",
                    "score": 12,
                    "created_utc": 1679491290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "By jonin rank most ninja develop 2 changes in chakra nature but we never saw jonin level tenten or any of the konoha 12 at jonin rank other than Neji and Sakura.",
            "author": "lilgleesh1901",
            "id": "jd5nnbi",
            "parent_id": "t1_jd4ax9n",
            "score": 22,
            "created_utc": 1679444670.0,
            "replies": []
        },
        {
            "body": "He didn't even bother to draw the fight 😂",
            "author": "Quakson82736",
            "id": "jd744v8",
            "parent_id": "t1_jd4ax9n",
            "score": 4,
            "created_utc": 1679477261.0,
            "replies": []
        },
        {
            "body": ">Neji could dismantle the sand constructs by injecting chakra into them.\n\nWould this work? The sand is not like a body which has Chakra points.",
            "author": "MrInfinitumEnd",
            "id": "jd73t0s",
            "parent_id": "t1_jd6zxb7",
            "score": 7,
            "created_utc": 1679476985.0,
            "replies": [
                {
                    "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
                    "author": "Blood-Emperor",
                    "id": "jd746oe",
                    "parent_id": "t1_jd73t0s",
                    "score": 9,
                    "created_utc": 1679477302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lee was also attacking the sand with punches and kicks and just about won and I firmly put Neji above Lee. I highly doubt Gaara wants those problems.",
            "author": "death_warrant",
            "id": "jd73t2h",
            "parent_id": "t1_jd6zxb7",
            "score": 3,
            "created_utc": 1679476986.0,
            "replies": [
                {
                    "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
                    "author": "Blood-Emperor",
                    "id": "jd74eck",
                    "parent_id": "t1_jd73t2h",
                    "score": 7,
                    "created_utc": 1679477480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That happened later. When Neji activated Byakugan, Dosu trembled a bit",
            "author": "Born-Middle-8815",
            "id": "jd43z0h",
            "parent_id": "t1_jd43p8i",
            "score": 55,
            "created_utc": 1679422750.0,
            "replies": []
        },
        {
            "body": "Yeah sure the primary lotus but thats practically negligible compared to the effects of the other gates",
            "author": "Teh-Cthulhu",
            "id": "jd7qu65",
            "parent_id": "t1_jd7o8k0",
            "score": 0,
            "created_utc": 1679491340.0,
            "replies": []
        },
        {
            "body": "If it's chakra and not wind and vulnerable to chakra dispelling then yeah, Neji wins",
            "author": null,
            "id": "jd71vq4",
            "parent_id": "t1_jd70d14",
            "score": 1,
            "created_utc": 1679475303.0,
            "replies": [
                {
                    "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
                    "author": "Blood-Emperor",
                    "id": "jd730kt",
                    "parent_id": "t1_jd71vq4",
                    "score": 2,
                    "created_utc": 1679476297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have you ever been punched 64 times across your whole body effectively destroying your second nervousvdystem\n\nNaruto pulled some goofy ass shenanigans",
            "author": "fuckedbyturtles",
            "id": "jd5nxzn",
            "parent_id": "t1_jd5hi19",
            "score": 4,
            "created_utc": 1679444797.0,
            "replies": [
                {
                    "body": "More like poked 64 times but your point still stands.",
                    "author": "Valedictorian117",
                    "id": "jd69xpa",
                    "parent_id": "t1_jd5nxzn",
                    "score": 2,
                    "created_utc": 1679454878.0,
                    "replies": [
                        {
                            "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                            "author": "Individual-Ad9753",
                            "id": "jd6pay3",
                            "parent_id": "t1_jd69xpa",
                            "score": 3,
                            "created_utc": 1679464707.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
                    "author": "FantasticDucks",
                    "id": "jd7omj4",
                    "parent_id": "t1_jd5nxzn",
                    "score": 2,
                    "created_utc": 1679490317.0,
                    "replies": [
                        {
                            "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                            "author": "fuckedbyturtles",
                            "id": "jd9zibu",
                            "parent_id": "t1_jd7omj4",
                            "score": 0,
                            "created_utc": 1679522607.0,
                            "replies": [
                                {
                                    "body": "It’s called suspension of disbelief.",
                                    "author": "That_opossum",
                                    "id": "jettyom",
                                    "parent_id": "t1_jd9zibu",
                                    "score": 1,
                                    "created_utc": 1680552114.0,
                                    "replies": [
                                        {
                                            "body": "I agree but plot armor saved Naruto more than I can count",
                                            "author": "fuckedbyturtles",
                                            "id": "jetxeml",
                                            "parent_id": "t1_jettyom",
                                            "score": 1,
                                            "created_utc": 1680553451.0,
                                            "replies": [
                                                {
                                                    "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                                    "author": "That_opossum",
                                                    "id": "jeudrrj",
                                                    "parent_id": "t1_jetxeml",
                                                    "score": 1,
                                                    "created_utc": 1680560088.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
                    "author": "Previous_Royal2168",
                    "id": "jd7958r",
                    "parent_id": "t1_jd5nxzn",
                    "score": 1,
                    "created_utc": 1679481314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The shockwave is caused by the punch, so it’s still a significant hit. \n\nHeck, the proctor thought that alone was enough to take down [Neji](https://official-complete-2.eorzea.us/manga/Naruto/0104-011.png). And you can see how damaged Neji is following it, so it wasn’t just him being low on chakra.",
            "author": "SaintAhmad",
            "id": "jd3vrln",
            "parent_id": "t1_jd3uz15",
            "score": 4,
            "created_utc": 1679419654.0,
            "replies": []
        },
        {
            "body": "I did forget about Zaku, who is pretty much discount Temari, so I’ll give you that one. But Dosu has to actually get close to her to do his thing, which isn’t a guarantee, and to the best of our knowledge he has no particular formidable defense. Nothing to negate a weapon barrage, at least. Kin has a good chance of winning but that depends on how Tenten reacts to her needles. Does she deflect them? Dodge wide instead of just barely cocking her head to the side like Shikamaru? It’s definitely not a guaranteed loss, and theoretically Kin could have defeated anyone (except Gaara probably) at the Exams if they reacted the wrong way against her Jutsu.\n\nKiba is actually debatable, because how long can he do fang over fang? His chakra and stamina isn’t unlimited, so even if it can deflect every type of weapon, which isn’t a guarantee, it’s a limited defensive option. If Tenten plays keep away until he burns himself out she’ll have him dead to rights (theoretically she could do this to Neji too, but it’s dependent on the ability to maintain distance).\n\nEither way, against all of those guys except Zaku, I maintain that her odds of winning are good to great.",
            "author": "XishengTheUltimate",
            "id": "jd5a9kz",
            "parent_id": "t1_jd4wk6k",
            "score": 43,
            "created_utc": 1679439019.0,
            "replies": []
        },
        {
            "body": "That one flashback of Itachi using a Kunai to redirect another Kunai and hitting a bullseye behind a rock is unfortunately more impressive than anything we ever see from Temari.",
            "author": "DeusVulticus13",
            "id": "jd7qqb5",
            "parent_id": "t1_jd5ehed",
            "score": 12,
            "created_utc": 1679491290.0,
            "replies": []
        },
        {
            "body": "Nope, it works against chakra constructs too.\n\nJust as how he did with Kidomaru's more solid constructs.\n\nNeji needs to use his chakra to disrupt the connection between Gaara's sand particles.\n\nAnd even better, Neji can hit Gaara's chakra points ignoring the sand armour entirely.\n\nAnd more better, Neji can channel his chakra through chakra conducting materials, making Gaara manipulating sand directly in contact to him dangerous, as Neji could use it to paralyze him just as he did with Kidomaru",
            "author": "Blood-Emperor",
            "id": "jd746oe",
            "parent_id": "t1_jd73t0s",
            "score": 9,
            "created_utc": 1679477302.0,
            "replies": []
        },
        {
            "body": "It would've been awesome to see what Neji and Hyuga in general can do if pushed to their fullest. It's a shame they're always paired against their worst enemies.\n\nHiashi defeated Kumo's highest ranked Jonin in 1 move. And deflected a Juubi arm on his own without any amps. Neji and Hinata were also done dirty given they never got their time to shine at all",
            "author": "Blood-Emperor",
            "id": "jd74eck",
            "parent_id": "t1_jd73t2h",
            "score": 7,
            "created_utc": 1679477480.0,
            "replies": []
        },
        {
            "body": "It is chakra, it's wind nature chakra, propelled by the fan.\n\nJyuken dismantles chakra constructs, even solid ones, much less wind based",
            "author": "Blood-Emperor",
            "id": "jd730kt",
            "parent_id": "t1_jd71vq4",
            "score": 2,
            "created_utc": 1679476297.0,
            "replies": []
        },
        {
            "body": "More like poked 64 times but your point still stands.",
            "author": "Valedictorian117",
            "id": "jd69xpa",
            "parent_id": "t1_jd5nxzn",
            "score": 2,
            "created_utc": 1679454878.0,
            "replies": [
                {
                    "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
                    "author": "Individual-Ad9753",
                    "id": "jd6pay3",
                    "parent_id": "t1_jd69xpa",
                    "score": 3,
                    "created_utc": 1679464707.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You ever fought a guy with a fuckin angry fox demon in his belly?\n\nTalking about \"real life\" and shit. In real life Neji spun in a circle and poked Naruto, then Naruto hit em with that floor-to-ceiling uppercut. That's gonna win in real life too",
            "author": "FantasticDucks",
            "id": "jd7omj4",
            "parent_id": "t1_jd5nxzn",
            "score": 2,
            "created_utc": 1679490317.0,
            "replies": [
                {
                    "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
                    "author": "fuckedbyturtles",
                    "id": "jd9zibu",
                    "parent_id": "t1_jd7omj4",
                    "score": 0,
                    "created_utc": 1679522607.0,
                    "replies": [
                        {
                            "body": "It’s called suspension of disbelief.",
                            "author": "That_opossum",
                            "id": "jettyom",
                            "parent_id": "t1_jd9zibu",
                            "score": 1,
                            "created_utc": 1680552114.0,
                            "replies": [
                                {
                                    "body": "I agree but plot armor saved Naruto more than I can count",
                                    "author": "fuckedbyturtles",
                                    "id": "jetxeml",
                                    "parent_id": "t1_jettyom",
                                    "score": 1,
                                    "created_utc": 1680553451.0,
                                    "replies": [
                                        {
                                            "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                            "author": "That_opossum",
                                            "id": "jeudrrj",
                                            "parent_id": "t1_jetxeml",
                                            "score": 1,
                                            "created_utc": 1680560088.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah but if they're one thing we know about Naruto it's that he can take a lot of beating",
            "author": "Previous_Royal2168",
            "id": "jd7958r",
            "parent_id": "t1_jd5nxzn",
            "score": 1,
            "created_utc": 1679481314.0,
            "replies": []
        },
        {
            "body": "The poking is insane btw it can not only suppress chakra but also significantly bruise muscles, rupture arteries, veins and organs. Naruto won by plot story and one lucky hit. Which I am fine with even when acknowledge it",
            "author": "Individual-Ad9753",
            "id": "jd6pay3",
            "parent_id": "t1_jd69xpa",
            "score": 3,
            "created_utc": 1679464707.0,
            "replies": []
        },
        {
            "body": "But on real life at this point neii would of butt fucked Naruto at least 5 times",
            "author": "fuckedbyturtles",
            "id": "jd9zibu",
            "parent_id": "t1_jd7omj4",
            "score": 0,
            "created_utc": 1679522607.0,
            "replies": [
                {
                    "body": "It’s called suspension of disbelief.",
                    "author": "That_opossum",
                    "id": "jettyom",
                    "parent_id": "t1_jd9zibu",
                    "score": 1,
                    "created_utc": 1680552114.0,
                    "replies": [
                        {
                            "body": "I agree but plot armor saved Naruto more than I can count",
                            "author": "fuckedbyturtles",
                            "id": "jetxeml",
                            "parent_id": "t1_jettyom",
                            "score": 1,
                            "created_utc": 1680553451.0,
                            "replies": [
                                {
                                    "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                                    "author": "That_opossum",
                                    "id": "jeudrrj",
                                    "parent_id": "t1_jetxeml",
                                    "score": 1,
                                    "created_utc": 1680560088.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s called suspension of disbelief.",
            "author": "That_opossum",
            "id": "jettyom",
            "parent_id": "t1_jd9zibu",
            "score": 1,
            "created_utc": 1680552114.0,
            "replies": [
                {
                    "body": "I agree but plot armor saved Naruto more than I can count",
                    "author": "fuckedbyturtles",
                    "id": "jetxeml",
                    "parent_id": "t1_jettyom",
                    "score": 1,
                    "created_utc": 1680553451.0,
                    "replies": [
                        {
                            "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                            "author": "That_opossum",
                            "id": "jeudrrj",
                            "parent_id": "t1_jetxeml",
                            "score": 1,
                            "created_utc": 1680560088.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree but plot armor saved Naruto more than I can count",
            "author": "fuckedbyturtles",
            "id": "jetxeml",
            "parent_id": "t1_jettyom",
            "score": 1,
            "created_utc": 1680553451.0,
            "replies": [
                {
                    "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
                    "author": "That_opossum",
                    "id": "jeudrrj",
                    "parent_id": "t1_jetxeml",
                    "score": 1,
                    "created_utc": 1680560088.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh weird I meant to reply to the comment above yours, I totally agree naruto should have got his ass beat.",
            "author": "That_opossum",
            "id": "jeudrrj",
            "parent_id": "t1_jetxeml",
            "score": 1,
            "created_utc": 1680560088.0,
            "replies": []
        }
    ]
}