{
    "title": "\"Just bring a picture bro\"",
    "post_id": "nf2452",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/nf2452/just_bring_a_picture_bro/",
    "author": "BubbaGoom",
    "body": "",
    "url": "https://i.redd.it/182fylxgdtz61.jpg",
    "score": 793,
    "upvote_ratio": 0.98,
    "created_utc": 1621315384.0,
    "num_comments": 117,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "That's me on both. Brought up the photo on the left from a previous cut. Same barber shop, different barbers though. \n\n&#x200B;\n\nHow do you guys deal with bad barbers?",
            "author": "BubbaGoom",
            "id": "gyjbr7t",
            "parent_id": "t3_nf2452",
            "score": 299,
            "created_utc": 1621315478.0,
            "replies": [
                {
                    "body": "You should probably find a better place if the barbers are so inconsistent. If you could get someone to recommend a place or take a look at reviews, you should probably do that.",
                    "author": "ClassroomExtension",
                    "id": "gyjkrg4",
                    "parent_id": "t1_gyjbr7t",
                    "score": 177,
                    "created_utc": 1621322653.0,
                    "replies": [
                        {
                            "body": "Yea I got that, it's just you know sometimes you'll think \"maybe this time, I'll get lucky\" 😂 especially when it's one of the closer and more affordable haircut places and you've had successes there before. But yea, def gon find another place to go to regularly.",
                            "author": "BubbaGoom",
                            "id": "gyjlmat",
                            "parent_id": "t1_gyjkrg4",
                            "score": 71,
                            "created_utc": 1621323413.0,
                            "replies": [
                                {
                                    "body": "Yeah, finding the right balance in price and a good haircut is for sure hard. But the lower the price, the less time they want to spend per person, so they might end up rushing the cut.",
                                    "author": "ClassroomExtension",
                                    "id": "gyjm9e0",
                                    "parent_id": "t1_gyjlmat",
                                    "score": 32,
                                    "created_utc": 1621323988.0,
                                    "replies": []
                                },
                                {
                                    "body": "If you figure out who your people are that you trust you only see them. If you notice you're going to need a trim soon you call/email and make an appointment with them.",
                                    "author": "drunky_crowette",
                                    "id": "gyl4fio",
                                    "parent_id": "t1_gyjlmat",
                                    "score": 4,
                                    "created_utc": 1621355561.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Lmao this shit is as useless as “show your barber a pic” you can’t look up a barber’s portfolio and even if they do quality cuts that doesn’t mean they’ll give you what you want. This sub should really learn barber vocabulary instead of just commenting “show your barber” on every advice post.",
                            "author": "medina_ds3",
                            "id": "gylu657",
                            "parent_id": "t1_gyjkrg4",
                            "score": 10,
                            "created_utc": 1621365971.0,
                            "replies": [
                                {
                                    "body": "When I went to my barber I showed him like 10 photos of what I wanted (mid curtain) and the dude has never done a curtain before, I helped him with the process and was talking to him about the cut constantly, he was careful as to not fuck up. In the end the cut looked fucking fresh.\n\nYou don’t just show pictures, it’s a joint effort with you AND the barber to get you what you want. You help them help you.",
                                    "author": "ButterStick212",
                                    "id": "gym34tm",
                                    "parent_id": "t1_gylu657",
                                    "score": 13,
                                    "created_utc": 1621369593.0,
                                    "replies": [
                                        {
                                            "body": "Unless you’re a barber too i don’t see how you managed to walk him through a haircut neither of you have done and have it look good on the first try.",
                                            "author": "medina_ds3",
                                            "id": "gymdtjk",
                                            "parent_id": "t1_gym34tm",
                                            "score": 8,
                                            "created_utc": 1621374039.0,
                                            "replies": [
                                                {
                                                    "body": "It’s just I cut my hair all the time, but I was running late for a driving test and didn’t have time to cut it myself. So I said fuck it and went to the barber",
                                                    "author": "ButterStick212",
                                                    "id": "gymmka0",
                                                    "parent_id": "t1_gymdtjk",
                                                    "score": 4,
                                                    "created_utc": 1621378154.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Can you make an appointment next time with a barber you know is better?",
                    "author": "JstVisitingThsPlanet",
                    "id": "gyjh6as",
                    "parent_id": "t1_gyjbr7t",
                    "score": 39,
                    "created_utc": 1621319657.0,
                    "replies": [
                        {
                            "body": "It's just a walk-in place and the guy who did the left photo wasn't there. 🤷‍♂️ But even the guy who did the haircut on the left is pretty inconsistent sometimes imo, although he's the one who did some haircuts that I was pretty happy with, there were times when he would give me cuts that I felt were inadequate 😢",
                            "author": "BubbaGoom",
                            "id": "gyjhqgl",
                            "parent_id": "t1_gyjh6as",
                            "score": 25,
                            "created_utc": 1621320106.0,
                            "replies": [
                                {
                                    "body": "Best is to find a place where you know the guy is gay and thinks you are hot. He will always make sure that you look great when leaving the place. 😁",
                                    "author": "forseti_",
                                    "id": "gyk1q94",
                                    "parent_id": "t1_gyjhqgl",
                                    "score": 30,
                                    "created_utc": 1621337328.0,
                                    "replies": [
                                        {
                                            "body": "😂I honestly believed the same thing when I was still in the Philippines lmao. If a gay person were to cut my hair, it was guaranteed to be fuego🔥",
                                            "author": "BubbaGoom",
                                            "id": "gyk2m1h",
                                            "parent_id": "t1_gyk1q94",
                                            "score": 12,
                                            "created_utc": 1621337922.0,
                                            "replies": [
                                                {
                                                    "body": "Always get your barber's number and Instagram.  Then just dm them whens the next time you can get a cut. If they don't have a social media page they aren't serious about their craft. Move on to the next.",
                                                    "author": "nodiso",
                                                    "id": "gylirx4",
                                                    "parent_id": "t1_gyk2m1h",
                                                    "score": 6,
                                                    "created_utc": 1621361364.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "So true.  Had a guy that crossedressed on the weekends cut my hair once.  He had long nails with bad polish job, but similar thin, straight, yet dense hair just like me.  Best haircut ever, but the next time i tried to get my haircut he had fallen off face of earth according to the shop owner.",
                                            "author": "HeKnee",
                                            "id": "gyle1sx",
                                            "parent_id": "t1_gyk1q94",
                                            "score": 6,
                                            "created_utc": 1621359449.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "All of my best barbers have been older (more years of experience) gay men. Same for many of my friends that stay stylish and sexy.",
                                            "author": "AlfredKinsey",
                                            "id": "gynacze",
                                            "parent_id": "t1_gyk1q94",
                                            "score": 2,
                                            "created_utc": 1621389906.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Just call ahead and check what the barber's schedule is. Almost every shop will let you prebook w someone. No need to find a new place, first cut looks great",
                                    "author": "scottyLogJobs",
                                    "id": "gykipnj",
                                    "parent_id": "t1_gyjhqgl",
                                    "score": 2,
                                    "created_utc": 1621346504.0,
                                    "replies": [
                                        {
                                            "body": "very good point, but idk, might try to find one of those higher priced venues, kinda wanna experience the vibe etc of those kinda places",
                                            "author": "BubbaGoom",
                                            "id": "gykjr6h",
                                            "parent_id": "t1_gykipnj",
                                            "score": 1,
                                            "created_utc": 1621346962.0,
                                            "replies": [
                                                {
                                                    "body": "Still pick a person if you can at the place. Usually walkins go to whoever isnt booked. And the people that arent booked but are there are usually newer or just not as good. It applies to any shop",
                                                    "author": "benigntugboat",
                                                    "id": "gyl2sjr",
                                                    "parent_id": "t1_gykjr6h",
                                                    "score": 3,
                                                    "created_utc": 1621354888.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Learn the name of the barber you like and request them in advance. If they’re inconsistent, first try saying something, noting what you didn’t like in a bad cut. If they still can’t get it right consistently, ask around, shop around, and get a new one.",
                                    "author": "AlfredKinsey",
                                    "id": "gynaf8d",
                                    "parent_id": "t1_gyjhqgl",
                                    "score": 1,
                                    "created_utc": 1621389935.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bro stick with one barber! Eventually he'll know your hair in and out, so it will become so easy to communicate and you both will know what works and what don't.\n\nI've been getting my haircut from the same barber for 16 years, never had to worry about a haircut because he knows what to do.",
                    "author": "7sendeee",
                    "id": "gyk5v1o",
                    "parent_id": "t1_gyjbr7t",
                    "score": 11,
                    "created_utc": 1621339981.0,
                    "replies": []
                },
                {
                    "body": "Go to the same barber every time.",
                    "author": "Ryan_enO",
                    "id": "gyk3zd4",
                    "parent_id": "t1_gyjbr7t",
                    "score": 10,
                    "created_utc": 1621338815.0,
                    "replies": []
                },
                {
                    "body": ">How do you guys deal with bad barbers?\n\nI don't. I find a good barber and I keep going back to the same barber.",
                    "author": "Dpan",
                    "id": "gyjqnu7",
                    "parent_id": "t1_gyjbr7t",
                    "score": 15,
                    "created_utc": 1621328056.0,
                    "replies": []
                },
                {
                    "body": "I always go to the same barber.     \n       \nAs I get older I realize that your barber is such a huge part of your appearance, and its notnworth playing around with. Schedule a few days before and sxhedule with someone whos already cut your hair right before and remembers how to do it again. If theh make good suggestions and style it well before you leave all the better. Ask for recommendations and dont listen to snyone who doesnt have a good haircut, at least periodically.",
                    "author": "benigntugboat",
                    "id": "gyl2eie",
                    "parent_id": "t1_gyjbr7t",
                    "score": 4,
                    "created_utc": 1621354728.0,
                    "replies": [
                        {
                            "body": "awesome tips my dude, cheers G!",
                            "author": "BubbaGoom",
                            "id": "gyl9rad",
                            "parent_id": "t1_gyl2eie",
                            "score": 2,
                            "created_utc": 1621357718.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That guy is not a barber. I could've done that cut on you. Or your mom. Or even yourself.",
                    "author": "coopersterlingdrapee",
                    "id": "gym33nr",
                    "parent_id": "t1_gyjbr7t",
                    "score": 2,
                    "created_utc": 1621369579.0,
                    "replies": []
                },
                {
                    "body": "Always go to the same barber if they do a good job. I wasted haircuts trying new people twice.",
                    "author": "HoboWithABoobJob",
                    "id": "gymy93z",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621383888.0,
                    "replies": []
                },
                {
                    "body": "I usually say 'i'd like to have an appointment, the boss please,\" (bad english oops) because i know he cuts good 🤷🏻‍♂️",
                    "author": "chestnutriceee",
                    "id": "gyk8uwi",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621341672.0,
                    "replies": []
                },
                {
                    "body": "Couldn't you ask for the same barber you had in picture one?",
                    "author": "Laser-Nipples",
                    "id": "gykmkvt",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621348191.0,
                    "replies": []
                },
                {
                    "body": "I've demanded a refund twice in my life. If they say anything other than \"ok\" tell them this side-by-side is going on the yelp page.",
                    "author": "Vegasmmj",
                    "id": "gyl3zr7",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621355379.0,
                    "replies": []
                },
                {
                    "body": "When the barber asks \"how's this feel?\" or \"how's this look?\", *be honest*. Take a good, long look at what they've done and tell them if they've done something wrong.\n\n\"I have to be honest, I feel like you did a bad job on my fade and this isn't what I asked for. I don't want to pay for this and I want to book the first available appointment with my regular barber to correct this.\"",
                    "author": "astronoob",
                    "id": "gylztb6",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621368250.0,
                    "replies": []
                },
                {
                    "body": "As a barber myself if you liked the first haircut why not make an appointment with the previous barber. Also with your hair texture the angle you took the photo will show more scalp on the sides. Also the lighting is much better in the second picture. It looks to me the second barber had the right idea just took the crown/top a little to short.",
                    "author": "RayEazy",
                    "id": "gym72s3",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621371198.0,
                    "replies": []
                },
                {
                    "body": "Shit man. Had this happen to me. Went to the same barber 3 times. Each with a different barber. First 2 were great. Last one was so bad I won’t be going back. My recommendation is ask the barber you like for their Instagram handle so you can go to their new shops if they move around.",
                    "author": "dickpicmck",
                    "id": "gymiz06",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621376425.0,
                    "replies": []
                },
                {
                    "body": "I never go to the bad barber again. If a shop can’t get me the artist/stylist I want, I wait until they can or go to another good one.",
                    "author": "AlfredKinsey",
                    "id": "gyna8ho",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1621389845.0,
                    "replies": []
                },
                {
                    "body": "My friend, I am suffering from the same problem. My sides could be better, but made the back and top too short for me.",
                    "author": "Pope_FrancisBaconJr",
                    "id": "h0qsgwv",
                    "parent_id": "t1_gyjbr7t",
                    "score": 1,
                    "created_utc": 1622939139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The dude carved you an early bald spot",
            "author": null,
            "id": "gyjfv1n",
            "parent_id": "t3_nf2452",
            "score": 394,
            "created_utc": 1621318616.0,
            "replies": [
                {
                    "body": "im dead 🤣",
                    "author": "BubbaGoom",
                    "id": "gyjg60r",
                    "parent_id": "t1_gyjfv1n",
                    "score": 108,
                    "created_utc": 1621318852.0,
                    "replies": []
                },
                {
                    "body": "That's a light issue, on the left is backlighted so more shadows on the front, it makes it feel like he has more hair, picture on right the light comes from the front, which makes the scalp to shine more, looks like less hair.",
                    "author": "jmarlboro",
                    "id": "gyml98j",
                    "parent_id": "t1_gyjfv1n",
                    "score": 10,
                    "created_utc": 1621377522.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gymu9a1",
                            "parent_id": "t1_gyml98j",
                            "score": 3,
                            "created_utc": 1621381908.0,
                            "replies": [
                                {
                                    "body": "Asian hair isn't thinner, in fact I can have a full mop of hair if I let it grow. It's the way our hair grows due to how thick the strands are, our's grow perpendicular to our scalp (it grows out) while caucasian hair grows down parallel to theirs. That's why when we get a 0.5 or 1 fade, our scalps shows much more.",
                                    "author": "BubbaGoom",
                                    "id": "gynz1r7",
                                    "parent_id": "t1_gymu9a1",
                                    "score": 4,
                                    "created_utc": 1621404178.0,
                                    "replies": [
                                        {
                                            "body": "I think im a rare type, im Caucasian but have extremely thick asian hair, so I either grow it long or keep it very short lol",
                                            "author": null,
                                            "id": "gyobre1",
                                            "parent_id": "t1_gynz1r7",
                                            "score": 2,
                                            "created_utc": 1621415102.0,
                                            "replies": [
                                                {
                                                    "body": "I know the feels 😢",
                                                    "author": "BubbaGoom",
                                                    "id": "gypfp4h",
                                                    "parent_id": "t1_gyobre1",
                                                    "score": 2,
                                                    "created_utc": 1621437575.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Generalizing though. I'm white as fuck and my hair grows straight out",
                                            "author": "nahfoo",
                                            "id": "h1k5j3w",
                                            "parent_id": "t1_gynz1r7",
                                            "score": 1,
                                            "created_utc": 1623535454.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gotta find a regular barber. Every time you go to a brand new person you’re rolling the dice.",
            "author": "wakeup325",
            "id": "gyjp1xf",
            "parent_id": "t3_nf2452",
            "score": 97,
            "created_utc": 1621326545.0,
            "replies": [
                {
                    "body": "I agree that you’re rolling the dice, but you can lower the chances of landing on a shit cut by communicating with the barber.\n\nOne time I went to a new barber who had never done a mid curtain before, I showed him like 10 pictures and walked him through the whole purpose, I was lucky that he was actually trying to not fuck it up, in the end it looked good. The way I see it is that you need to help them help you, they can’t read you mind, but the barber also has to try and ask questions when stuck or unsure. It’s a joint effort",
                    "author": "ButterStick212",
                    "id": "gym3nh0",
                    "parent_id": "t1_gyjp1xf",
                    "score": 6,
                    "created_utc": 1621369807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Left looks so nice. Trying to go with a shorter style and now I'm just going to show this to my barber.",
            "author": "chrismiles94",
            "id": "gyjw42g",
            "parent_id": "t3_nf2452",
            "score": 30,
            "created_utc": 1621333009.0,
            "replies": [
                {
                    "body": "I'm a big fan of keeping hair on the crown of the head, it is just a much nicer silhouette than just fading all the way to the top.",
                    "author": "jlktrl",
                    "id": "gyl5lk0",
                    "parent_id": "t1_gyjw42g",
                    "score": 7,
                    "created_utc": 1621356033.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haircut on the left looks very good imo. Is it high maintenance ? How often do you have to cut your hair with that hairstyle ?",
            "author": "amopi1",
            "id": "gykc5yw",
            "parent_id": "t3_nf2452",
            "score": 14,
            "created_utc": 1621343379.0,
            "replies": [
                {
                    "body": "It was low maintenance in the sense that you could leave it messy and it would still look alright, for example, I'm pretty sure I took that photo after a nap or something. \n\nThe frequency of haircuts though was like every 2-3 weeks; because of asian hair if I left it for more than a month, the side would poof out on the sides quite a bit, especially on the thicker/darker part of the side (upper part). Nothing egregious though.",
                    "author": "BubbaGoom",
                    "id": "gyke2dg",
                    "parent_id": "t1_gykc5yw",
                    "score": 13,
                    "created_utc": 1621344329.0,
                    "replies": []
                },
                {
                    "body": "As a barber.. haircut on the left is trash. Haircut on the right is done better but took more hair off",
                    "author": "icantbelieveiclicked",
                    "id": "gynvspi",
                    "parent_id": "t1_gykc5yw",
                    "score": 2,
                    "created_utc": 1621401837.0,
                    "replies": [
                        {
                            "body": "As someone with eyes I disagree",
                            "author": "bigplateofpasta",
                            "id": "gyqd7mj",
                            "parent_id": "t1_gynvspi",
                            "score": 4,
                            "created_utc": 1621451506.0,
                            "replies": [
                                {
                                    "body": "Good for you,  I make a living doing this, I've been cutting hair for 5 years now with 1 year apprenticeship. I've participated and placed in fade competition.\n\nTo be fair, both these cuts are trash, the technique on the second is better though",
                                    "author": "icantbelieveiclicked",
                                    "id": "gyqn622",
                                    "parent_id": "t1_gyqd7mj",
                                    "score": 2,
                                    "created_utc": 1621455785.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "2nd",
                            "author": null,
                            "id": "gypgp65",
                            "parent_id": "t1_gynvspi",
                            "score": 1,
                            "created_utc": 1621437983.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This was a Great Clips, wasn't it?",
            "author": "dyljeridu",
            "id": "gyjiu70",
            "parent_id": "t3_nf2452",
            "score": 22,
            "created_utc": 1621321006.0,
            "replies": [
                {
                    "body": "I assume that's US? nah man, some independent shop in Straya.",
                    "author": "BubbaGoom",
                    "id": "gyjiygf",
                    "parent_id": "t1_gyjiu70",
                    "score": 36,
                    "created_utc": 1621321105.0,
                    "replies": [
                        {
                            "body": "Yeah, US company. Notorious for ruining hair, but somehow the entire chain is still thriving",
                            "author": "dyljeridu",
                            "id": "gyjj0rv",
                            "parent_id": "t1_gyjiygf",
                            "score": 21,
                            "created_utc": 1621321158.0,
                            "replies": [
                                {
                                    "body": "Its cuz they all get their buisness from old people and kids who were forced by their moms cuz it was cheap.",
                                    "author": "SSjGRaj",
                                    "id": "gyjk5o6",
                                    "parent_id": "t1_gyjj0rv",
                                    "score": 26,
                                    "created_utc": 1621322131.0,
                                    "replies": [
                                        {
                                            "body": "whats crazy, is that great clips will always mess up my hair. its always blended with the grace of a jackhammer(you can see literally what lines they drew to blend it the whole way up)\n\nYet back up north(im in the south now) there was a place called cost cutters that had the same business model, but always did me right no matter what. Was a great place if I couldnt afford the barber at the time or if it was an odd hours barber like i had at one point.",
                                            "author": "Pewkie",
                                            "id": "gykckoj",
                                            "parent_id": "t1_gyjk5o6",
                                            "score": 3,
                                            "created_utc": 1621343588.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Where I live Great clips charging almost the same as all the good local barber shops… blows my mind that they can even charge half of what a good barbershop charges.",
                                            "author": null,
                                            "id": "gylq5rj",
                                            "parent_id": "t1_gyjk5o6",
                                            "score": 1,
                                            "created_utc": 1621364335.0,
                                            "replies": [
                                                {
                                                    "body": "Dam really? Great clips is like 12 dollars including tip in my area (10$+2$ tip),  while the barber I go to is 30 including tip.(25+5$ tip) which includes eyebrows.",
                                                    "author": "SSjGRaj",
                                                    "id": "gyluszk",
                                                    "parent_id": "t1_gylq5rj",
                                                    "score": 1,
                                                    "created_utc": 1621366232.0,
                                                    "replies": [
                                                        {
                                                            "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
                                                            "author": null,
                                                            "id": "gylw9n3",
                                                            "parent_id": "t1_gyluszk",
                                                            "score": 2,
                                                            "created_utc": 1621366826.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                                                                    "author": "SSjGRaj",
                                                                    "id": "gymkq3d",
                                                                    "parent_id": "t1_gylw9n3",
                                                                    "score": 1,
                                                                    "created_utc": 1621377264.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                                                                            "author": null,
                                                                            "id": "gymx616",
                                                                            "parent_id": "t1_gymkq3d",
                                                                            "score": 1,
                                                                            "created_utc": 1621383349.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not that bad",
            "author": "FrogPaintings",
            "id": "gykfc3o",
            "parent_id": "t3_nf2452",
            "score": 6,
            "created_utc": 1621344945.0,
            "replies": [
                {
                    "body": "Cheers m8. Sorta, it looks okay on the front, its just the sides man, especially the part towards the crown. Made me look like I have a bald spot 😢",
                    "author": "BubbaGoom",
                    "id": "gyki3po",
                    "parent_id": "t1_gykfc3o",
                    "score": 2,
                    "created_utc": 1621346231.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can’t stand the “just bring a picture”. Last time I went to the barber I showed him 5 pictures of 5 different people all with the same haircut and then 1 picture of what I absolutely did not want. He cut my hair, no wait.... he fucked my shit up, and said if I wanted what was in the picture I need to go to a hair stylist but he could tell I trusted him so he did his own thing. He gave me what I didn’t want but in the worst way possible. My haircut is entirely uneven.",
            "author": null,
            "id": "gyjwthx",
            "parent_id": "t3_nf2452",
            "score": 24,
            "created_utc": 1621333595.0,
            "replies": [
                {
                    "body": "Showing the picture wont matter at all if your showing it to me (not a barber). Finding a good barber is the first step. Telling them how to cut your hair is the 2nd. The best way to do step 2 is by showing a picture. But you cant skip step 1.",
                    "author": "benigntugboat",
                    "id": "gyl34y2",
                    "parent_id": "t1_gyjwthx",
                    "score": 8,
                    "created_utc": 1621355029.0,
                    "replies": [
                        {
                            "body": "It’s a gamble trying to find one. A lot of the “best barbers” and ones that left a shop to start their own because they were better than the last, are the ones that are the worst. There also seems to be a trend of haircuts in men. Hard cut in parts, Brad Pitt Fury, Peaky blinders, etc. and telling/showing a barber that you want (insert photo here) they seem to still go back to the same generic haircut they’ve pumped out 100 times that week.",
                            "author": null,
                            "id": "gyl5r4b",
                            "parent_id": "t1_gyl34y2",
                            "score": 5,
                            "created_utc": 1621356096.0,
                            "replies": [
                                {
                                    "body": "I would ask people with good haircuts who they use. Luckily i found my current barber by chance but ive since realized a lot of the better styled acquaintances i know go to him too. Social media will give you a kot of poor recommendations but usually the people with the most are legit.",
                                    "author": "benigntugboat",
                                    "id": "gyl6f55",
                                    "parent_id": "t1_gyl5r4b",
                                    "score": 3,
                                    "created_utc": 1621356367.0,
                                    "replies": []
                                },
                                {
                                    "body": "This is exactly what happens, honestly I think they zone out and just go to the default haircut sometimes",
                                    "author": "dudewithlettuce",
                                    "id": "gym5mmb",
                                    "parent_id": "t1_gyl5r4b",
                                    "score": 2,
                                    "created_utc": 1621370610.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Agreed. I take you’re statement of “finding a good barber first” is a barber that has a great consultation. I ask when your last cut was, how often you get it cut(realistically) how/if you style it, what products if you do, what shampoo/conditioner you use, which side you push it to (if at all) etc. I’ll also analyze the scalp a bit for bumps and flat spots if it’s a fade that’s way over do- we talk cowlicks. Then show me a pic and we will discuss what’s realistic and the best way to achieve what you want and what works for you and your life style. This is not a long conversation. \n\nIf you show a new barber a pic and they go “Mk” and start cutting without further questions.. I would be a bit nervous.",
                            "author": null,
                            "id": "gyphja9",
                            "parent_id": "t1_gyl34y2",
                            "score": 2,
                            "created_utc": 1621438324.0,
                            "replies": []
                        },
                        {
                            "body": "How the hell do you know if a barber is good for you before they cut your hair 😐 even good barbers can fuck up and give you something different than what you show them or ask for. How about try actually learning the proper terms for haircuts instead of giving useless advice.",
                            "author": "medina_ds3",
                            "id": "gyluyso",
                            "parent_id": "t1_gyl34y2",
                            "score": 2,
                            "created_utc": 1621366299.0,
                            "replies": [
                                {
                                    "body": "I gave some suggestions to finding one in another comment. But honestly trial and errorsnalways a part of it. I used to have a giant mohawk and had a great stylist for that. But now that i lean towards cleaner cuts like fades and undercuts I have a different barber because the stylist really wasnt great at mens hair, just dye jobs and the specific style i had. My current barbers a great guy who gets paid to teach and cut at events/conventions (not sure on the details tbh) and has done a fantastic job on any style ive tried since. His instagram shows a lot of interesting cuts hes done, i know a few peoplr who go tonhim and always had great hair and he was at a shop id already liked while i was trying people out.     \n     \nNot sure why you seem annoyed about something that had literally 0 mention in my comments. Using the proper terms wont help if your barber doesnt know them, or cant execute them well or consistently. Me knowing the difference between a crew cut or a buzz cut doesnt matter because I dont want either and Im not cutting anyone elses hair.",
                                    "author": "benigntugboat",
                                    "id": "gylybmm",
                                    "parent_id": "t1_gyluyso",
                                    "score": 1,
                                    "created_utc": 1621367653.0,
                                    "replies": []
                                },
                                {
                                    "body": "A lot of tears...a lot of tears",
                                    "author": "dudewithlettuce",
                                    "id": "gym5py5",
                                    "parent_id": "t1_gyluyso",
                                    "score": -1,
                                    "created_utc": 1621370647.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gyl1g63",
                    "parent_id": "t1_gyjwthx",
                    "score": 1,
                    "created_utc": 1621354331.0,
                    "replies": [
                        {
                            "body": "Yah I’ll never return and I want to slam them on Yelp but it isn’t even worth it. But I spent the better part of a full year growing my hair out long, to have it hacked to shit.",
                            "author": null,
                            "id": "gyl5xo0",
                            "parent_id": "t1_gyl1g63",
                            "score": 1,
                            "created_utc": 1621356172.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Spend the time to cultivate a relationship with a good barber, tip them 20-30% ALWAYS. I would also get their number, whenever I needed a haircut or even my neck cleaned up, they would be more than happy to pass a walk-in to another less skilled/new barber. \nWhen I used to get a bad cut early on, I would get a faux-hawk with disconnected sides.",
            "author": "stinkystonkz",
            "id": "gyjm1oe",
            "parent_id": "t3_nf2452",
            "score": 15,
            "created_utc": 1621323797.0,
            "replies": [
                {
                    "body": "They dont tip outside of murica",
                    "author": "Icyfire11",
                    "id": "gyjq4q4",
                    "parent_id": "t1_gyjm1oe",
                    "score": 32,
                    "created_utc": 1621327558.0,
                    "replies": [
                        {
                            "body": "£20 note keep the change mate",
                            "author": "Komaric_",
                            "id": "gykd9ez",
                            "parent_id": "t1_gyjq4q4",
                            "score": 10,
                            "created_utc": 1621343934.0,
                            "replies": []
                        },
                        {
                            "body": "i tip in turkey",
                            "author": "eercelik21",
                            "id": "gyjsoou",
                            "parent_id": "t1_gyjq4q4",
                            "score": 4,
                            "created_utc": 1621329954.0,
                            "replies": [
                                {
                                    "body": "i tip my car",
                                    "author": "huitlacoche",
                                    "id": "gyky7ft",
                                    "parent_id": "t1_gyjsoou",
                                    "score": 1,
                                    "created_utc": 1621353000.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sure they do. I tip my barber in Germany.",
                            "author": "forseti_",
                            "id": "gyk26ev",
                            "parent_id": "t1_gyjq4q4",
                            "score": 1,
                            "created_utc": 1621337633.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gyjqn87",
                            "parent_id": "t1_gyjq4q4",
                            "score": -15,
                            "created_utc": 1621328040.0,
                            "replies": [
                                {
                                    "body": "Try to tip here and the people you're giving tips to will just look at you weird lmao",
                                    "author": "BubbaGoom",
                                    "id": "gyjvjgs",
                                    "parent_id": "t1_gyjqn87",
                                    "score": 11,
                                    "created_utc": 1621332521.0,
                                    "replies": [
                                        {
                                            "body": "Bruh that’s the same here in Australia too",
                                            "author": "BigFooz",
                                            "id": "gyjy8xj",
                                            "parent_id": "t1_gyjvjgs",
                                            "score": 6,
                                            "created_utc": 1621334758.0,
                                            "replies": [
                                                {
                                                    "body": "He's talking about Australia as well haha",
                                                    "author": "VirtuosoX",
                                                    "id": "gyk5ya7",
                                                    "parent_id": "t1_gyjy8xj",
                                                    "score": 5,
                                                    "created_utc": 1621340034.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh shit LMAAO",
                                                            "author": "BigFooz",
                                                            "id": "gyk8n2h",
                                                            "parent_id": "t1_gyk5ya7",
                                                            "score": 3,
                                                            "created_utc": 1621341554.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Lol no we just have a proper wages system",
                                    "author": "Icyfire11",
                                    "id": "gyjqrcq",
                                    "parent_id": "t1_gyjqn87",
                                    "score": 21,
                                    "created_utc": 1621328151.0,
                                    "replies": [
                                        {
                                            "body": "Tipping is used to boost their wages. If their tipping makes them earn less than minimum wage. They get paid the difference until they make minimum wage.",
                                            "author": "bob3908",
                                            "id": "gyjswas",
                                            "parent_id": "t1_gyjqrcq",
                                            "score": 5,
                                            "created_utc": 1621330147.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Not really 😅",
                                            "author": "forseti_",
                                            "id": "gyk29at",
                                            "parent_id": "t1_gyjqrcq",
                                            "score": -3,
                                            "created_utc": 1621337688.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "thats is straight outta broom broom. I find rarely maybe even one barber/stylist. No matter what i do or explain or how many picture you showed to them. they couldnt just get it.",
            "author": null,
            "id": "gykemow",
            "parent_id": "t3_nf2452",
            "score": 4,
            "created_utc": 1621344600.0,
            "replies": []
        },
        {
            "body": "Find a barber and stick to the good one. Build a relationship and trust me, once that relationship has been established you’re gonna have a consistent cuts. Also, its not bad to pay a little bit more when it comes to cuts. You will always get what you paid for",
            "author": "crookedup",
            "id": "gykrlj2",
            "parent_id": "t3_nf2452",
            "score": 4,
            "created_utc": 1621350284.0,
            "replies": []
        },
        {
            "body": "Is there a name for the haircut on the left?",
            "author": "Artheyn88",
            "id": "gyjoaba",
            "parent_id": "t3_nf2452",
            "score": 8,
            "created_utc": 1621325840.0,
            "replies": [
                {
                    "body": "If there is I don't know, but when I got the left I asked for a drop fade and specified how low I wanted it to be. For the top, I just asked to leave it longer.",
                    "author": "BubbaGoom",
                    "id": "gyjp0e8",
                    "parent_id": "t1_gyjoaba",
                    "score": 10,
                    "created_utc": 1621326505.0,
                    "replies": []
                },
                {
                    "body": "Mid fade textured top. Specify you want the hair down to eyebrow level and ask him to cut into the top of your hair to layer it",
                    "author": "Komaric_",
                    "id": "gykde9i",
                    "parent_id": "t1_gyjoaba",
                    "score": 3,
                    "created_utc": 1621343998.0,
                    "replies": [
                        {
                            "body": "I'd say low fade textured top.",
                            "author": "bigred91224",
                            "id": "gykz5xm",
                            "parent_id": "t1_gykde9i",
                            "score": 2,
                            "created_utc": 1621353389.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Mid Shadow fade texture on top",
                    "author": "RayEazy",
                    "id": "gym89xh",
                    "parent_id": "t1_gyjoaba",
                    "score": 2,
                    "created_utc": 1621371697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bad barbers are the absolute worst.\n\nFound one close to my place, with very good reviews and very consistent so far but pricy af",
            "author": "Bruh-bruhman",
            "id": "gylejge",
            "parent_id": "t3_nf2452",
            "score": 2,
            "created_utc": 1621359645.0,
            "replies": []
        },
        {
            "body": "Nothing you do will fix a shit barber… this is why you find someone good and stick with them.",
            "author": null,
            "id": "gylpy2e",
            "parent_id": "t3_nf2452",
            "score": 2,
            "created_utc": 1621364248.0,
            "replies": []
        },
        {
            "body": "And that's why I don't deal with fades. For real though, I think the only possibility here would be to just wait it out.",
            "author": "Pihrahni",
            "id": "gyk597q",
            "parent_id": "t3_nf2452",
            "score": 4,
            "created_utc": 1621339613.0,
            "replies": []
        },
        {
            "body": "Mate, Barbers are always either the worst or the best person. If they're good, they know what you want without explaining too much. If they're bad, you can explain all you want, show as many pictures as you want, and they'll still fuck it up, and they've all got bad attitudes as well. Sadly the latter is way (understatement) more common than the former.",
            "author": "Chip673",
            "id": "gyk8vp9",
            "parent_id": "t3_nf2452",
            "score": 3,
            "created_utc": 1621341684.0,
            "replies": []
        },
        {
            "body": "What's the name of this haircut?",
            "author": "6elixircommon",
            "id": "gyk57tf",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621339589.0,
            "replies": [
                {
                    "body": "The one on the right? Just go in and say \"just fuck my shit up fam\" and bam you got the haircut from the right photo 😂\n\n&#x200B;\n\nFor the left photo, just ask for a drop fade and show him how low you want it, then just leave the top longish (if you pull it down to your face, it should reach just the top of your eyes). Might want to ask for a lil bit of texture on top as well.",
                    "author": "BubbaGoom",
                    "id": "gyk7noc",
                    "parent_id": "t1_gyk57tf",
                    "score": 3,
                    "created_utc": 1621341012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "man-at this point just go with the mohawk. own it. lol",
            "author": "the_neophyte",
            "id": "gykn84e",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621348467.0,
            "replies": []
        },
        {
            "body": "Damn bro not trying to dog on you but it looks The thorn from destiny haha\n\nEdit: [pic for context ](https://imgur.com/gallery/tWuOUqs)",
            "author": "Powak",
            "id": "gynfrcn",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621392606.0,
            "replies": []
        },
        {
            "body": "I mean, different head shape and hair growth patter, idk",
            "author": "TheGoldenRaven",
            "id": "gyl5jnq",
            "parent_id": "t3_nf2452",
            "score": -1,
            "created_utc": 1621356012.0,
            "replies": [
                {
                    "body": "Genius! why didn't I think of that?              \n\n^(that's me on both 😂)",
                    "author": "BubbaGoom",
                    "id": "gyl9fro",
                    "parent_id": "t1_gyl5jnq",
                    "score": 9,
                    "created_utc": 1621357585.0,
                    "replies": []
                },
                {
                    "body": "But it's the same person",
                    "author": "wafflenuggets",
                    "id": "gyl6m10",
                    "parent_id": "t1_gyl5jnq",
                    "score": 7,
                    "created_utc": 1621356446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn haha it’s not the worst but I can see how the picture technique didn’t work in this specific scenario. \n\nReading through the comments, it seems like this was your first time w this particular stylist, but at the same salon. \n\nFirst off - you have find a barber that you like. Be consistent with them, you may have to create a flexible schedule to get in with them. Ask to see their work (previous cuts they’ve done, etc). Then you can show the stylist a picture lol",
            "author": "NOTYOURCHEESEboi",
            "id": "gykxve7",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621352863.0,
            "replies": []
        },
        {
            "body": "Time to find a new barber",
            "author": "morchorchorman",
            "id": "gyl2rx6",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621354881.0,
            "replies": []
        },
        {
            "body": "Should not have cut the top so short. Go to an experienced barber.",
            "author": "Starboyz10",
            "id": "gymbjhy",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621373054.0,
            "replies": []
        },
        {
            "body": "He wouldn't  of got paid that day he gave you a slight mr burns on the side time to find a new home",
            "author": "GODKINGZION",
            "id": "gymeqb0",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621374446.0,
            "replies": []
        },
        {
            "body": "give it maybe two weeks and you can probably try again but just with shorter buzzes/fades.",
            "author": "o_spacereturn",
            "id": "gymxhs0",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621383509.0,
            "replies": []
        },
        {
            "body": "Do you conversate a lot with your barber? I once had a conversation almost the entire haircut, and it turned out horrible. Now I have found a barber who doesn't really talk much, and it's been great lol we exchange hello's / goodbyes, and that's pretty much it. I feel like they are actually focusing.",
            "author": "o_spacereturn",
            "id": "gymxst9",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621383661.0,
            "replies": []
        },
        {
            "body": "I've had better success at an asian salon, costs more but they can usually give you a great haircut based off of explaination and a picture, whereas a barber i had no dice with no matter how many i visited.  I had a similar haircut to the right pic since barbers always try to go for a standard \"long top short side\" for all their clients, but for thick asian hair i found it best to go for a 2 block cut.  However, I really do like the style of your hair on the left.  Def saving it for my next visit, unless they butcher it and make it look like the right LOOOOOLLLL",
            "author": "armysblood",
            "id": "gynlin7",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621395516.0,
            "replies": []
        },
        {
            "body": "Get some peppermint oil and dilute it in a carrier.  Apply that to your premature bald spot lol.  It will make it grow faster relative to the other hair.",
            "author": "idriveawhitecamry",
            "id": "gyorqhg",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1621426963.0,
            "replies": []
        },
        {
            "body": "Is that like a low fade on the picture on the left?",
            "author": "ScootsBuddy",
            "id": "gzkthwf",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1622073152.0,
            "replies": []
        },
        {
            "body": "Forgive me if someone already said it, but whenever I go to someone Ive never been to before/backup when my barber isnt around, I make sure to speak up if it isn’t coming out how I want it. Always kinda awkward but I feel like they appreciate doing it well and having the thought that you’re happy. Have had a few guys leave my fade to low and after telling them that it usually ends up coming out fine. Obviously there’s gonna be times where nothing will help a bad barber, but I know alot of guys hate saying something when it’s not what they want in the mirror.",
            "author": "MedSchoolTuition",
            "id": "h0ucjae",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1623017470.0,
            "replies": []
        },
        {
            "body": "Did you get it cut by an asian stylist? honestly I kinda have the same issue in the past, where I would show an old pic of myself with a fade and it come out looking like the right where they just dont know how to properly fade it  \n\n\nEspecially if they're like an immigrant or like OG asian, then they probably don't know how to do fades as its not really a typical style in asia and more developed in the west but i will say its getting better. especially if your barber is a younger person who probably \"gets\" it.\n\n\n\nI know there are asians who can do fades but just personally all the best fades I got were from latinos/black people. And I also know that as an Asian, one may feel more comfortable going to an asian salon or going to cut their hair in chinatown or something, but can try something different if you get the chance. Total assumption and just sharing my experience btw.",
            "author": "supabrahh",
            "id": "h1tf9w8",
            "parent_id": "t3_nf2452",
            "score": 1,
            "created_utc": 1623733822.0,
            "replies": []
        },
        {
            "body": "You should probably find a better place if the barbers are so inconsistent. If you could get someone to recommend a place or take a look at reviews, you should probably do that.",
            "author": "ClassroomExtension",
            "id": "gyjkrg4",
            "parent_id": "t1_gyjbr7t",
            "score": 177,
            "created_utc": 1621322653.0,
            "replies": [
                {
                    "body": "Yea I got that, it's just you know sometimes you'll think \"maybe this time, I'll get lucky\" 😂 especially when it's one of the closer and more affordable haircut places and you've had successes there before. But yea, def gon find another place to go to regularly.",
                    "author": "BubbaGoom",
                    "id": "gyjlmat",
                    "parent_id": "t1_gyjkrg4",
                    "score": 71,
                    "created_utc": 1621323413.0,
                    "replies": [
                        {
                            "body": "Yeah, finding the right balance in price and a good haircut is for sure hard. But the lower the price, the less time they want to spend per person, so they might end up rushing the cut.",
                            "author": "ClassroomExtension",
                            "id": "gyjm9e0",
                            "parent_id": "t1_gyjlmat",
                            "score": 32,
                            "created_utc": 1621323988.0,
                            "replies": []
                        },
                        {
                            "body": "If you figure out who your people are that you trust you only see them. If you notice you're going to need a trim soon you call/email and make an appointment with them.",
                            "author": "drunky_crowette",
                            "id": "gyl4fio",
                            "parent_id": "t1_gyjlmat",
                            "score": 4,
                            "created_utc": 1621355561.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lmao this shit is as useless as “show your barber a pic” you can’t look up a barber’s portfolio and even if they do quality cuts that doesn’t mean they’ll give you what you want. This sub should really learn barber vocabulary instead of just commenting “show your barber” on every advice post.",
                    "author": "medina_ds3",
                    "id": "gylu657",
                    "parent_id": "t1_gyjkrg4",
                    "score": 10,
                    "created_utc": 1621365971.0,
                    "replies": [
                        {
                            "body": "When I went to my barber I showed him like 10 photos of what I wanted (mid curtain) and the dude has never done a curtain before, I helped him with the process and was talking to him about the cut constantly, he was careful as to not fuck up. In the end the cut looked fucking fresh.\n\nYou don’t just show pictures, it’s a joint effort with you AND the barber to get you what you want. You help them help you.",
                            "author": "ButterStick212",
                            "id": "gym34tm",
                            "parent_id": "t1_gylu657",
                            "score": 13,
                            "created_utc": 1621369593.0,
                            "replies": [
                                {
                                    "body": "Unless you’re a barber too i don’t see how you managed to walk him through a haircut neither of you have done and have it look good on the first try.",
                                    "author": "medina_ds3",
                                    "id": "gymdtjk",
                                    "parent_id": "t1_gym34tm",
                                    "score": 8,
                                    "created_utc": 1621374039.0,
                                    "replies": [
                                        {
                                            "body": "It’s just I cut my hair all the time, but I was running late for a driving test and didn’t have time to cut it myself. So I said fuck it and went to the barber",
                                            "author": "ButterStick212",
                                            "id": "gymmka0",
                                            "parent_id": "t1_gymdtjk",
                                            "score": 4,
                                            "created_utc": 1621378154.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can you make an appointment next time with a barber you know is better?",
            "author": "JstVisitingThsPlanet",
            "id": "gyjh6as",
            "parent_id": "t1_gyjbr7t",
            "score": 39,
            "created_utc": 1621319657.0,
            "replies": [
                {
                    "body": "It's just a walk-in place and the guy who did the left photo wasn't there. 🤷‍♂️ But even the guy who did the haircut on the left is pretty inconsistent sometimes imo, although he's the one who did some haircuts that I was pretty happy with, there were times when he would give me cuts that I felt were inadequate 😢",
                    "author": "BubbaGoom",
                    "id": "gyjhqgl",
                    "parent_id": "t1_gyjh6as",
                    "score": 25,
                    "created_utc": 1621320106.0,
                    "replies": [
                        {
                            "body": "Best is to find a place where you know the guy is gay and thinks you are hot. He will always make sure that you look great when leaving the place. 😁",
                            "author": "forseti_",
                            "id": "gyk1q94",
                            "parent_id": "t1_gyjhqgl",
                            "score": 30,
                            "created_utc": 1621337328.0,
                            "replies": [
                                {
                                    "body": "😂I honestly believed the same thing when I was still in the Philippines lmao. If a gay person were to cut my hair, it was guaranteed to be fuego🔥",
                                    "author": "BubbaGoom",
                                    "id": "gyk2m1h",
                                    "parent_id": "t1_gyk1q94",
                                    "score": 12,
                                    "created_utc": 1621337922.0,
                                    "replies": [
                                        {
                                            "body": "Always get your barber's number and Instagram.  Then just dm them whens the next time you can get a cut. If they don't have a social media page they aren't serious about their craft. Move on to the next.",
                                            "author": "nodiso",
                                            "id": "gylirx4",
                                            "parent_id": "t1_gyk2m1h",
                                            "score": 6,
                                            "created_utc": 1621361364.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "So true.  Had a guy that crossedressed on the weekends cut my hair once.  He had long nails with bad polish job, but similar thin, straight, yet dense hair just like me.  Best haircut ever, but the next time i tried to get my haircut he had fallen off face of earth according to the shop owner.",
                                    "author": "HeKnee",
                                    "id": "gyle1sx",
                                    "parent_id": "t1_gyk1q94",
                                    "score": 6,
                                    "created_utc": 1621359449.0,
                                    "replies": []
                                },
                                {
                                    "body": "All of my best barbers have been older (more years of experience) gay men. Same for many of my friends that stay stylish and sexy.",
                                    "author": "AlfredKinsey",
                                    "id": "gynacze",
                                    "parent_id": "t1_gyk1q94",
                                    "score": 2,
                                    "created_utc": 1621389906.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Just call ahead and check what the barber's schedule is. Almost every shop will let you prebook w someone. No need to find a new place, first cut looks great",
                            "author": "scottyLogJobs",
                            "id": "gykipnj",
                            "parent_id": "t1_gyjhqgl",
                            "score": 2,
                            "created_utc": 1621346504.0,
                            "replies": [
                                {
                                    "body": "very good point, but idk, might try to find one of those higher priced venues, kinda wanna experience the vibe etc of those kinda places",
                                    "author": "BubbaGoom",
                                    "id": "gykjr6h",
                                    "parent_id": "t1_gykipnj",
                                    "score": 1,
                                    "created_utc": 1621346962.0,
                                    "replies": [
                                        {
                                            "body": "Still pick a person if you can at the place. Usually walkins go to whoever isnt booked. And the people that arent booked but are there are usually newer or just not as good. It applies to any shop",
                                            "author": "benigntugboat",
                                            "id": "gyl2sjr",
                                            "parent_id": "t1_gykjr6h",
                                            "score": 3,
                                            "created_utc": 1621354888.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Learn the name of the barber you like and request them in advance. If they’re inconsistent, first try saying something, noting what you didn’t like in a bad cut. If they still can’t get it right consistently, ask around, shop around, and get a new one.",
                            "author": "AlfredKinsey",
                            "id": "gynaf8d",
                            "parent_id": "t1_gyjhqgl",
                            "score": 1,
                            "created_utc": 1621389935.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bro stick with one barber! Eventually he'll know your hair in and out, so it will become so easy to communicate and you both will know what works and what don't.\n\nI've been getting my haircut from the same barber for 16 years, never had to worry about a haircut because he knows what to do.",
            "author": "7sendeee",
            "id": "gyk5v1o",
            "parent_id": "t1_gyjbr7t",
            "score": 11,
            "created_utc": 1621339981.0,
            "replies": []
        },
        {
            "body": "Go to the same barber every time.",
            "author": "Ryan_enO",
            "id": "gyk3zd4",
            "parent_id": "t1_gyjbr7t",
            "score": 10,
            "created_utc": 1621338815.0,
            "replies": []
        },
        {
            "body": ">How do you guys deal with bad barbers?\n\nI don't. I find a good barber and I keep going back to the same barber.",
            "author": "Dpan",
            "id": "gyjqnu7",
            "parent_id": "t1_gyjbr7t",
            "score": 15,
            "created_utc": 1621328056.0,
            "replies": []
        },
        {
            "body": "I always go to the same barber.     \n       \nAs I get older I realize that your barber is such a huge part of your appearance, and its notnworth playing around with. Schedule a few days before and sxhedule with someone whos already cut your hair right before and remembers how to do it again. If theh make good suggestions and style it well before you leave all the better. Ask for recommendations and dont listen to snyone who doesnt have a good haircut, at least periodically.",
            "author": "benigntugboat",
            "id": "gyl2eie",
            "parent_id": "t1_gyjbr7t",
            "score": 4,
            "created_utc": 1621354728.0,
            "replies": [
                {
                    "body": "awesome tips my dude, cheers G!",
                    "author": "BubbaGoom",
                    "id": "gyl9rad",
                    "parent_id": "t1_gyl2eie",
                    "score": 2,
                    "created_utc": 1621357718.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That guy is not a barber. I could've done that cut on you. Or your mom. Or even yourself.",
            "author": "coopersterlingdrapee",
            "id": "gym33nr",
            "parent_id": "t1_gyjbr7t",
            "score": 2,
            "created_utc": 1621369579.0,
            "replies": []
        },
        {
            "body": "Always go to the same barber if they do a good job. I wasted haircuts trying new people twice.",
            "author": "HoboWithABoobJob",
            "id": "gymy93z",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621383888.0,
            "replies": []
        },
        {
            "body": "I usually say 'i'd like to have an appointment, the boss please,\" (bad english oops) because i know he cuts good 🤷🏻‍♂️",
            "author": "chestnutriceee",
            "id": "gyk8uwi",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621341672.0,
            "replies": []
        },
        {
            "body": "Couldn't you ask for the same barber you had in picture one?",
            "author": "Laser-Nipples",
            "id": "gykmkvt",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621348191.0,
            "replies": []
        },
        {
            "body": "I've demanded a refund twice in my life. If they say anything other than \"ok\" tell them this side-by-side is going on the yelp page.",
            "author": "Vegasmmj",
            "id": "gyl3zr7",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621355379.0,
            "replies": []
        },
        {
            "body": "When the barber asks \"how's this feel?\" or \"how's this look?\", *be honest*. Take a good, long look at what they've done and tell them if they've done something wrong.\n\n\"I have to be honest, I feel like you did a bad job on my fade and this isn't what I asked for. I don't want to pay for this and I want to book the first available appointment with my regular barber to correct this.\"",
            "author": "astronoob",
            "id": "gylztb6",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621368250.0,
            "replies": []
        },
        {
            "body": "As a barber myself if you liked the first haircut why not make an appointment with the previous barber. Also with your hair texture the angle you took the photo will show more scalp on the sides. Also the lighting is much better in the second picture. It looks to me the second barber had the right idea just took the crown/top a little to short.",
            "author": "RayEazy",
            "id": "gym72s3",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621371198.0,
            "replies": []
        },
        {
            "body": "Shit man. Had this happen to me. Went to the same barber 3 times. Each with a different barber. First 2 were great. Last one was so bad I won’t be going back. My recommendation is ask the barber you like for their Instagram handle so you can go to their new shops if they move around.",
            "author": "dickpicmck",
            "id": "gymiz06",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621376425.0,
            "replies": []
        },
        {
            "body": "I never go to the bad barber again. If a shop can’t get me the artist/stylist I want, I wait until they can or go to another good one.",
            "author": "AlfredKinsey",
            "id": "gyna8ho",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1621389845.0,
            "replies": []
        },
        {
            "body": "My friend, I am suffering from the same problem. My sides could be better, but made the back and top too short for me.",
            "author": "Pope_FrancisBaconJr",
            "id": "h0qsgwv",
            "parent_id": "t1_gyjbr7t",
            "score": 1,
            "created_utc": 1622939139.0,
            "replies": []
        },
        {
            "body": "im dead 🤣",
            "author": "BubbaGoom",
            "id": "gyjg60r",
            "parent_id": "t1_gyjfv1n",
            "score": 108,
            "created_utc": 1621318852.0,
            "replies": []
        },
        {
            "body": "That's a light issue, on the left is backlighted so more shadows on the front, it makes it feel like he has more hair, picture on right the light comes from the front, which makes the scalp to shine more, looks like less hair.",
            "author": "jmarlboro",
            "id": "gyml98j",
            "parent_id": "t1_gyjfv1n",
            "score": 10,
            "created_utc": 1621377522.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gymu9a1",
                    "parent_id": "t1_gyml98j",
                    "score": 3,
                    "created_utc": 1621381908.0,
                    "replies": [
                        {
                            "body": "Asian hair isn't thinner, in fact I can have a full mop of hair if I let it grow. It's the way our hair grows due to how thick the strands are, our's grow perpendicular to our scalp (it grows out) while caucasian hair grows down parallel to theirs. That's why when we get a 0.5 or 1 fade, our scalps shows much more.",
                            "author": "BubbaGoom",
                            "id": "gynz1r7",
                            "parent_id": "t1_gymu9a1",
                            "score": 4,
                            "created_utc": 1621404178.0,
                            "replies": [
                                {
                                    "body": "I think im a rare type, im Caucasian but have extremely thick asian hair, so I either grow it long or keep it very short lol",
                                    "author": null,
                                    "id": "gyobre1",
                                    "parent_id": "t1_gynz1r7",
                                    "score": 2,
                                    "created_utc": 1621415102.0,
                                    "replies": [
                                        {
                                            "body": "I know the feels 😢",
                                            "author": "BubbaGoom",
                                            "id": "gypfp4h",
                                            "parent_id": "t1_gyobre1",
                                            "score": 2,
                                            "created_utc": 1621437575.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Generalizing though. I'm white as fuck and my hair grows straight out",
                                    "author": "nahfoo",
                                    "id": "h1k5j3w",
                                    "parent_id": "t1_gynz1r7",
                                    "score": 1,
                                    "created_utc": 1623535454.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree that you’re rolling the dice, but you can lower the chances of landing on a shit cut by communicating with the barber.\n\nOne time I went to a new barber who had never done a mid curtain before, I showed him like 10 pictures and walked him through the whole purpose, I was lucky that he was actually trying to not fuck it up, in the end it looked good. The way I see it is that you need to help them help you, they can’t read you mind, but the barber also has to try and ask questions when stuck or unsure. It’s a joint effort",
            "author": "ButterStick212",
            "id": "gym3nh0",
            "parent_id": "t1_gyjp1xf",
            "score": 6,
            "created_utc": 1621369807.0,
            "replies": []
        },
        {
            "body": "I'm a big fan of keeping hair on the crown of the head, it is just a much nicer silhouette than just fading all the way to the top.",
            "author": "jlktrl",
            "id": "gyl5lk0",
            "parent_id": "t1_gyjw42g",
            "score": 7,
            "created_utc": 1621356033.0,
            "replies": []
        },
        {
            "body": "It was low maintenance in the sense that you could leave it messy and it would still look alright, for example, I'm pretty sure I took that photo after a nap or something. \n\nThe frequency of haircuts though was like every 2-3 weeks; because of asian hair if I left it for more than a month, the side would poof out on the sides quite a bit, especially on the thicker/darker part of the side (upper part). Nothing egregious though.",
            "author": "BubbaGoom",
            "id": "gyke2dg",
            "parent_id": "t1_gykc5yw",
            "score": 13,
            "created_utc": 1621344329.0,
            "replies": []
        },
        {
            "body": "As a barber.. haircut on the left is trash. Haircut on the right is done better but took more hair off",
            "author": "icantbelieveiclicked",
            "id": "gynvspi",
            "parent_id": "t1_gykc5yw",
            "score": 2,
            "created_utc": 1621401837.0,
            "replies": [
                {
                    "body": "As someone with eyes I disagree",
                    "author": "bigplateofpasta",
                    "id": "gyqd7mj",
                    "parent_id": "t1_gynvspi",
                    "score": 4,
                    "created_utc": 1621451506.0,
                    "replies": [
                        {
                            "body": "Good for you,  I make a living doing this, I've been cutting hair for 5 years now with 1 year apprenticeship. I've participated and placed in fade competition.\n\nTo be fair, both these cuts are trash, the technique on the second is better though",
                            "author": "icantbelieveiclicked",
                            "id": "gyqn622",
                            "parent_id": "t1_gyqd7mj",
                            "score": 2,
                            "created_utc": 1621455785.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "2nd",
                    "author": null,
                    "id": "gypgp65",
                    "parent_id": "t1_gynvspi",
                    "score": 1,
                    "created_utc": 1621437983.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I assume that's US? nah man, some independent shop in Straya.",
            "author": "BubbaGoom",
            "id": "gyjiygf",
            "parent_id": "t1_gyjiu70",
            "score": 36,
            "created_utc": 1621321105.0,
            "replies": [
                {
                    "body": "Yeah, US company. Notorious for ruining hair, but somehow the entire chain is still thriving",
                    "author": "dyljeridu",
                    "id": "gyjj0rv",
                    "parent_id": "t1_gyjiygf",
                    "score": 21,
                    "created_utc": 1621321158.0,
                    "replies": [
                        {
                            "body": "Its cuz they all get their buisness from old people and kids who were forced by their moms cuz it was cheap.",
                            "author": "SSjGRaj",
                            "id": "gyjk5o6",
                            "parent_id": "t1_gyjj0rv",
                            "score": 26,
                            "created_utc": 1621322131.0,
                            "replies": [
                                {
                                    "body": "whats crazy, is that great clips will always mess up my hair. its always blended with the grace of a jackhammer(you can see literally what lines they drew to blend it the whole way up)\n\nYet back up north(im in the south now) there was a place called cost cutters that had the same business model, but always did me right no matter what. Was a great place if I couldnt afford the barber at the time or if it was an odd hours barber like i had at one point.",
                                    "author": "Pewkie",
                                    "id": "gykckoj",
                                    "parent_id": "t1_gyjk5o6",
                                    "score": 3,
                                    "created_utc": 1621343588.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where I live Great clips charging almost the same as all the good local barber shops… blows my mind that they can even charge half of what a good barbershop charges.",
                                    "author": null,
                                    "id": "gylq5rj",
                                    "parent_id": "t1_gyjk5o6",
                                    "score": 1,
                                    "created_utc": 1621364335.0,
                                    "replies": [
                                        {
                                            "body": "Dam really? Great clips is like 12 dollars including tip in my area (10$+2$ tip),  while the barber I go to is 30 including tip.(25+5$ tip) which includes eyebrows.",
                                            "author": "SSjGRaj",
                                            "id": "gyluszk",
                                            "parent_id": "t1_gylq5rj",
                                            "score": 1,
                                            "created_utc": 1621366232.0,
                                            "replies": [
                                                {
                                                    "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
                                                    "author": null,
                                                    "id": "gylw9n3",
                                                    "parent_id": "t1_gyluszk",
                                                    "score": 2,
                                                    "created_utc": 1621366826.0,
                                                    "replies": [
                                                        {
                                                            "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                                                            "author": "SSjGRaj",
                                                            "id": "gymkq3d",
                                                            "parent_id": "t1_gylw9n3",
                                                            "score": 1,
                                                            "created_utc": 1621377264.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                                                                    "author": null,
                                                                    "id": "gymx616",
                                                                    "parent_id": "t1_gymkq3d",
                                                                    "score": 1,
                                                                    "created_utc": 1621383349.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cheers m8. Sorta, it looks okay on the front, its just the sides man, especially the part towards the crown. Made me look like I have a bald spot 😢",
            "author": "BubbaGoom",
            "id": "gyki3po",
            "parent_id": "t1_gykfc3o",
            "score": 2,
            "created_utc": 1621346231.0,
            "replies": []
        },
        {
            "body": "Showing the picture wont matter at all if your showing it to me (not a barber). Finding a good barber is the first step. Telling them how to cut your hair is the 2nd. The best way to do step 2 is by showing a picture. But you cant skip step 1.",
            "author": "benigntugboat",
            "id": "gyl34y2",
            "parent_id": "t1_gyjwthx",
            "score": 8,
            "created_utc": 1621355029.0,
            "replies": [
                {
                    "body": "It’s a gamble trying to find one. A lot of the “best barbers” and ones that left a shop to start their own because they were better than the last, are the ones that are the worst. There also seems to be a trend of haircuts in men. Hard cut in parts, Brad Pitt Fury, Peaky blinders, etc. and telling/showing a barber that you want (insert photo here) they seem to still go back to the same generic haircut they’ve pumped out 100 times that week.",
                    "author": null,
                    "id": "gyl5r4b",
                    "parent_id": "t1_gyl34y2",
                    "score": 5,
                    "created_utc": 1621356096.0,
                    "replies": [
                        {
                            "body": "I would ask people with good haircuts who they use. Luckily i found my current barber by chance but ive since realized a lot of the better styled acquaintances i know go to him too. Social media will give you a kot of poor recommendations but usually the people with the most are legit.",
                            "author": "benigntugboat",
                            "id": "gyl6f55",
                            "parent_id": "t1_gyl5r4b",
                            "score": 3,
                            "created_utc": 1621356367.0,
                            "replies": []
                        },
                        {
                            "body": "This is exactly what happens, honestly I think they zone out and just go to the default haircut sometimes",
                            "author": "dudewithlettuce",
                            "id": "gym5mmb",
                            "parent_id": "t1_gyl5r4b",
                            "score": 2,
                            "created_utc": 1621370610.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed. I take you’re statement of “finding a good barber first” is a barber that has a great consultation. I ask when your last cut was, how often you get it cut(realistically) how/if you style it, what products if you do, what shampoo/conditioner you use, which side you push it to (if at all) etc. I’ll also analyze the scalp a bit for bumps and flat spots if it’s a fade that’s way over do- we talk cowlicks. Then show me a pic and we will discuss what’s realistic and the best way to achieve what you want and what works for you and your life style. This is not a long conversation. \n\nIf you show a new barber a pic and they go “Mk” and start cutting without further questions.. I would be a bit nervous.",
                    "author": null,
                    "id": "gyphja9",
                    "parent_id": "t1_gyl34y2",
                    "score": 2,
                    "created_utc": 1621438324.0,
                    "replies": []
                },
                {
                    "body": "How the hell do you know if a barber is good for you before they cut your hair 😐 even good barbers can fuck up and give you something different than what you show them or ask for. How about try actually learning the proper terms for haircuts instead of giving useless advice.",
                    "author": "medina_ds3",
                    "id": "gyluyso",
                    "parent_id": "t1_gyl34y2",
                    "score": 2,
                    "created_utc": 1621366299.0,
                    "replies": [
                        {
                            "body": "I gave some suggestions to finding one in another comment. But honestly trial and errorsnalways a part of it. I used to have a giant mohawk and had a great stylist for that. But now that i lean towards cleaner cuts like fades and undercuts I have a different barber because the stylist really wasnt great at mens hair, just dye jobs and the specific style i had. My current barbers a great guy who gets paid to teach and cut at events/conventions (not sure on the details tbh) and has done a fantastic job on any style ive tried since. His instagram shows a lot of interesting cuts hes done, i know a few peoplr who go tonhim and always had great hair and he was at a shop id already liked while i was trying people out.     \n     \nNot sure why you seem annoyed about something that had literally 0 mention in my comments. Using the proper terms wont help if your barber doesnt know them, or cant execute them well or consistently. Me knowing the difference between a crew cut or a buzz cut doesnt matter because I dont want either and Im not cutting anyone elses hair.",
                            "author": "benigntugboat",
                            "id": "gylybmm",
                            "parent_id": "t1_gyluyso",
                            "score": 1,
                            "created_utc": 1621367653.0,
                            "replies": []
                        },
                        {
                            "body": "A lot of tears...a lot of tears",
                            "author": "dudewithlettuce",
                            "id": "gym5py5",
                            "parent_id": "t1_gyluyso",
                            "score": -1,
                            "created_utc": 1621370647.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gyl1g63",
            "parent_id": "t1_gyjwthx",
            "score": 1,
            "created_utc": 1621354331.0,
            "replies": [
                {
                    "body": "Yah I’ll never return and I want to slam them on Yelp but it isn’t even worth it. But I spent the better part of a full year growing my hair out long, to have it hacked to shit.",
                    "author": null,
                    "id": "gyl5xo0",
                    "parent_id": "t1_gyl1g63",
                    "score": 1,
                    "created_utc": 1621356172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They dont tip outside of murica",
            "author": "Icyfire11",
            "id": "gyjq4q4",
            "parent_id": "t1_gyjm1oe",
            "score": 32,
            "created_utc": 1621327558.0,
            "replies": [
                {
                    "body": "£20 note keep the change mate",
                    "author": "Komaric_",
                    "id": "gykd9ez",
                    "parent_id": "t1_gyjq4q4",
                    "score": 10,
                    "created_utc": 1621343934.0,
                    "replies": []
                },
                {
                    "body": "i tip in turkey",
                    "author": "eercelik21",
                    "id": "gyjsoou",
                    "parent_id": "t1_gyjq4q4",
                    "score": 4,
                    "created_utc": 1621329954.0,
                    "replies": [
                        {
                            "body": "i tip my car",
                            "author": "huitlacoche",
                            "id": "gyky7ft",
                            "parent_id": "t1_gyjsoou",
                            "score": 1,
                            "created_utc": 1621353000.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sure they do. I tip my barber in Germany.",
                    "author": "forseti_",
                    "id": "gyk26ev",
                    "parent_id": "t1_gyjq4q4",
                    "score": 1,
                    "created_utc": 1621337633.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gyjqn87",
                    "parent_id": "t1_gyjq4q4",
                    "score": -15,
                    "created_utc": 1621328040.0,
                    "replies": [
                        {
                            "body": "Try to tip here and the people you're giving tips to will just look at you weird lmao",
                            "author": "BubbaGoom",
                            "id": "gyjvjgs",
                            "parent_id": "t1_gyjqn87",
                            "score": 11,
                            "created_utc": 1621332521.0,
                            "replies": [
                                {
                                    "body": "Bruh that’s the same here in Australia too",
                                    "author": "BigFooz",
                                    "id": "gyjy8xj",
                                    "parent_id": "t1_gyjvjgs",
                                    "score": 6,
                                    "created_utc": 1621334758.0,
                                    "replies": [
                                        {
                                            "body": "He's talking about Australia as well haha",
                                            "author": "VirtuosoX",
                                            "id": "gyk5ya7",
                                            "parent_id": "t1_gyjy8xj",
                                            "score": 5,
                                            "created_utc": 1621340034.0,
                                            "replies": [
                                                {
                                                    "body": "Oh shit LMAAO",
                                                    "author": "BigFooz",
                                                    "id": "gyk8n2h",
                                                    "parent_id": "t1_gyk5ya7",
                                                    "score": 3,
                                                    "created_utc": 1621341554.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Lol no we just have a proper wages system",
                            "author": "Icyfire11",
                            "id": "gyjqrcq",
                            "parent_id": "t1_gyjqn87",
                            "score": 21,
                            "created_utc": 1621328151.0,
                            "replies": [
                                {
                                    "body": "Tipping is used to boost their wages. If their tipping makes them earn less than minimum wage. They get paid the difference until they make minimum wage.",
                                    "author": "bob3908",
                                    "id": "gyjswas",
                                    "parent_id": "t1_gyjqrcq",
                                    "score": 5,
                                    "created_utc": 1621330147.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not really 😅",
                                    "author": "forseti_",
                                    "id": "gyk29at",
                                    "parent_id": "t1_gyjqrcq",
                                    "score": -3,
                                    "created_utc": 1621337688.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If there is I don't know, but when I got the left I asked for a drop fade and specified how low I wanted it to be. For the top, I just asked to leave it longer.",
            "author": "BubbaGoom",
            "id": "gyjp0e8",
            "parent_id": "t1_gyjoaba",
            "score": 10,
            "created_utc": 1621326505.0,
            "replies": []
        },
        {
            "body": "Mid fade textured top. Specify you want the hair down to eyebrow level and ask him to cut into the top of your hair to layer it",
            "author": "Komaric_",
            "id": "gykde9i",
            "parent_id": "t1_gyjoaba",
            "score": 3,
            "created_utc": 1621343998.0,
            "replies": [
                {
                    "body": "I'd say low fade textured top.",
                    "author": "bigred91224",
                    "id": "gykz5xm",
                    "parent_id": "t1_gykde9i",
                    "score": 2,
                    "created_utc": 1621353389.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mid Shadow fade texture on top",
            "author": "RayEazy",
            "id": "gym89xh",
            "parent_id": "t1_gyjoaba",
            "score": 2,
            "created_utc": 1621371697.0,
            "replies": []
        },
        {
            "body": "The one on the right? Just go in and say \"just fuck my shit up fam\" and bam you got the haircut from the right photo 😂\n\n&#x200B;\n\nFor the left photo, just ask for a drop fade and show him how low you want it, then just leave the top longish (if you pull it down to your face, it should reach just the top of your eyes). Might want to ask for a lil bit of texture on top as well.",
            "author": "BubbaGoom",
            "id": "gyk7noc",
            "parent_id": "t1_gyk57tf",
            "score": 3,
            "created_utc": 1621341012.0,
            "replies": []
        },
        {
            "body": "Genius! why didn't I think of that?              \n\n^(that's me on both 😂)",
            "author": "BubbaGoom",
            "id": "gyl9fro",
            "parent_id": "t1_gyl5jnq",
            "score": 9,
            "created_utc": 1621357585.0,
            "replies": []
        },
        {
            "body": "But it's the same person",
            "author": "wafflenuggets",
            "id": "gyl6m10",
            "parent_id": "t1_gyl5jnq",
            "score": 7,
            "created_utc": 1621356446.0,
            "replies": []
        },
        {
            "body": "Yea I got that, it's just you know sometimes you'll think \"maybe this time, I'll get lucky\" 😂 especially when it's one of the closer and more affordable haircut places and you've had successes there before. But yea, def gon find another place to go to regularly.",
            "author": "BubbaGoom",
            "id": "gyjlmat",
            "parent_id": "t1_gyjkrg4",
            "score": 71,
            "created_utc": 1621323413.0,
            "replies": [
                {
                    "body": "Yeah, finding the right balance in price and a good haircut is for sure hard. But the lower the price, the less time they want to spend per person, so they might end up rushing the cut.",
                    "author": "ClassroomExtension",
                    "id": "gyjm9e0",
                    "parent_id": "t1_gyjlmat",
                    "score": 32,
                    "created_utc": 1621323988.0,
                    "replies": []
                },
                {
                    "body": "If you figure out who your people are that you trust you only see them. If you notice you're going to need a trim soon you call/email and make an appointment with them.",
                    "author": "drunky_crowette",
                    "id": "gyl4fio",
                    "parent_id": "t1_gyjlmat",
                    "score": 4,
                    "created_utc": 1621355561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao this shit is as useless as “show your barber a pic” you can’t look up a barber’s portfolio and even if they do quality cuts that doesn’t mean they’ll give you what you want. This sub should really learn barber vocabulary instead of just commenting “show your barber” on every advice post.",
            "author": "medina_ds3",
            "id": "gylu657",
            "parent_id": "t1_gyjkrg4",
            "score": 10,
            "created_utc": 1621365971.0,
            "replies": [
                {
                    "body": "When I went to my barber I showed him like 10 photos of what I wanted (mid curtain) and the dude has never done a curtain before, I helped him with the process and was talking to him about the cut constantly, he was careful as to not fuck up. In the end the cut looked fucking fresh.\n\nYou don’t just show pictures, it’s a joint effort with you AND the barber to get you what you want. You help them help you.",
                    "author": "ButterStick212",
                    "id": "gym34tm",
                    "parent_id": "t1_gylu657",
                    "score": 13,
                    "created_utc": 1621369593.0,
                    "replies": [
                        {
                            "body": "Unless you’re a barber too i don’t see how you managed to walk him through a haircut neither of you have done and have it look good on the first try.",
                            "author": "medina_ds3",
                            "id": "gymdtjk",
                            "parent_id": "t1_gym34tm",
                            "score": 8,
                            "created_utc": 1621374039.0,
                            "replies": [
                                {
                                    "body": "It’s just I cut my hair all the time, but I was running late for a driving test and didn’t have time to cut it myself. So I said fuck it and went to the barber",
                                    "author": "ButterStick212",
                                    "id": "gymmka0",
                                    "parent_id": "t1_gymdtjk",
                                    "score": 4,
                                    "created_utc": 1621378154.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's just a walk-in place and the guy who did the left photo wasn't there. 🤷‍♂️ But even the guy who did the haircut on the left is pretty inconsistent sometimes imo, although he's the one who did some haircuts that I was pretty happy with, there were times when he would give me cuts that I felt were inadequate 😢",
            "author": "BubbaGoom",
            "id": "gyjhqgl",
            "parent_id": "t1_gyjh6as",
            "score": 25,
            "created_utc": 1621320106.0,
            "replies": [
                {
                    "body": "Best is to find a place where you know the guy is gay and thinks you are hot. He will always make sure that you look great when leaving the place. 😁",
                    "author": "forseti_",
                    "id": "gyk1q94",
                    "parent_id": "t1_gyjhqgl",
                    "score": 30,
                    "created_utc": 1621337328.0,
                    "replies": [
                        {
                            "body": "😂I honestly believed the same thing when I was still in the Philippines lmao. If a gay person were to cut my hair, it was guaranteed to be fuego🔥",
                            "author": "BubbaGoom",
                            "id": "gyk2m1h",
                            "parent_id": "t1_gyk1q94",
                            "score": 12,
                            "created_utc": 1621337922.0,
                            "replies": [
                                {
                                    "body": "Always get your barber's number and Instagram.  Then just dm them whens the next time you can get a cut. If they don't have a social media page they aren't serious about their craft. Move on to the next.",
                                    "author": "nodiso",
                                    "id": "gylirx4",
                                    "parent_id": "t1_gyk2m1h",
                                    "score": 6,
                                    "created_utc": 1621361364.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "So true.  Had a guy that crossedressed on the weekends cut my hair once.  He had long nails with bad polish job, but similar thin, straight, yet dense hair just like me.  Best haircut ever, but the next time i tried to get my haircut he had fallen off face of earth according to the shop owner.",
                            "author": "HeKnee",
                            "id": "gyle1sx",
                            "parent_id": "t1_gyk1q94",
                            "score": 6,
                            "created_utc": 1621359449.0,
                            "replies": []
                        },
                        {
                            "body": "All of my best barbers have been older (more years of experience) gay men. Same for many of my friends that stay stylish and sexy.",
                            "author": "AlfredKinsey",
                            "id": "gynacze",
                            "parent_id": "t1_gyk1q94",
                            "score": 2,
                            "created_utc": 1621389906.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Just call ahead and check what the barber's schedule is. Almost every shop will let you prebook w someone. No need to find a new place, first cut looks great",
                    "author": "scottyLogJobs",
                    "id": "gykipnj",
                    "parent_id": "t1_gyjhqgl",
                    "score": 2,
                    "created_utc": 1621346504.0,
                    "replies": [
                        {
                            "body": "very good point, but idk, might try to find one of those higher priced venues, kinda wanna experience the vibe etc of those kinda places",
                            "author": "BubbaGoom",
                            "id": "gykjr6h",
                            "parent_id": "t1_gykipnj",
                            "score": 1,
                            "created_utc": 1621346962.0,
                            "replies": [
                                {
                                    "body": "Still pick a person if you can at the place. Usually walkins go to whoever isnt booked. And the people that arent booked but are there are usually newer or just not as good. It applies to any shop",
                                    "author": "benigntugboat",
                                    "id": "gyl2sjr",
                                    "parent_id": "t1_gykjr6h",
                                    "score": 3,
                                    "created_utc": 1621354888.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Learn the name of the barber you like and request them in advance. If they’re inconsistent, first try saying something, noting what you didn’t like in a bad cut. If they still can’t get it right consistently, ask around, shop around, and get a new one.",
                    "author": "AlfredKinsey",
                    "id": "gynaf8d",
                    "parent_id": "t1_gyjhqgl",
                    "score": 1,
                    "created_utc": 1621389935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "awesome tips my dude, cheers G!",
            "author": "BubbaGoom",
            "id": "gyl9rad",
            "parent_id": "t1_gyl2eie",
            "score": 2,
            "created_utc": 1621357718.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gymu9a1",
            "parent_id": "t1_gyml98j",
            "score": 3,
            "created_utc": 1621381908.0,
            "replies": [
                {
                    "body": "Asian hair isn't thinner, in fact I can have a full mop of hair if I let it grow. It's the way our hair grows due to how thick the strands are, our's grow perpendicular to our scalp (it grows out) while caucasian hair grows down parallel to theirs. That's why when we get a 0.5 or 1 fade, our scalps shows much more.",
                    "author": "BubbaGoom",
                    "id": "gynz1r7",
                    "parent_id": "t1_gymu9a1",
                    "score": 4,
                    "created_utc": 1621404178.0,
                    "replies": [
                        {
                            "body": "I think im a rare type, im Caucasian but have extremely thick asian hair, so I either grow it long or keep it very short lol",
                            "author": null,
                            "id": "gyobre1",
                            "parent_id": "t1_gynz1r7",
                            "score": 2,
                            "created_utc": 1621415102.0,
                            "replies": [
                                {
                                    "body": "I know the feels 😢",
                                    "author": "BubbaGoom",
                                    "id": "gypfp4h",
                                    "parent_id": "t1_gyobre1",
                                    "score": 2,
                                    "created_utc": 1621437575.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Generalizing though. I'm white as fuck and my hair grows straight out",
                            "author": "nahfoo",
                            "id": "h1k5j3w",
                            "parent_id": "t1_gynz1r7",
                            "score": 1,
                            "created_utc": 1623535454.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As someone with eyes I disagree",
            "author": "bigplateofpasta",
            "id": "gyqd7mj",
            "parent_id": "t1_gynvspi",
            "score": 4,
            "created_utc": 1621451506.0,
            "replies": [
                {
                    "body": "Good for you,  I make a living doing this, I've been cutting hair for 5 years now with 1 year apprenticeship. I've participated and placed in fade competition.\n\nTo be fair, both these cuts are trash, the technique on the second is better though",
                    "author": "icantbelieveiclicked",
                    "id": "gyqn622",
                    "parent_id": "t1_gyqd7mj",
                    "score": 2,
                    "created_utc": 1621455785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "2nd",
            "author": null,
            "id": "gypgp65",
            "parent_id": "t1_gynvspi",
            "score": 1,
            "created_utc": 1621437983.0,
            "replies": []
        },
        {
            "body": "Yeah, US company. Notorious for ruining hair, but somehow the entire chain is still thriving",
            "author": "dyljeridu",
            "id": "gyjj0rv",
            "parent_id": "t1_gyjiygf",
            "score": 21,
            "created_utc": 1621321158.0,
            "replies": [
                {
                    "body": "Its cuz they all get their buisness from old people and kids who were forced by their moms cuz it was cheap.",
                    "author": "SSjGRaj",
                    "id": "gyjk5o6",
                    "parent_id": "t1_gyjj0rv",
                    "score": 26,
                    "created_utc": 1621322131.0,
                    "replies": [
                        {
                            "body": "whats crazy, is that great clips will always mess up my hair. its always blended with the grace of a jackhammer(you can see literally what lines they drew to blend it the whole way up)\n\nYet back up north(im in the south now) there was a place called cost cutters that had the same business model, but always did me right no matter what. Was a great place if I couldnt afford the barber at the time or if it was an odd hours barber like i had at one point.",
                            "author": "Pewkie",
                            "id": "gykckoj",
                            "parent_id": "t1_gyjk5o6",
                            "score": 3,
                            "created_utc": 1621343588.0,
                            "replies": []
                        },
                        {
                            "body": "Where I live Great clips charging almost the same as all the good local barber shops… blows my mind that they can even charge half of what a good barbershop charges.",
                            "author": null,
                            "id": "gylq5rj",
                            "parent_id": "t1_gyjk5o6",
                            "score": 1,
                            "created_utc": 1621364335.0,
                            "replies": [
                                {
                                    "body": "Dam really? Great clips is like 12 dollars including tip in my area (10$+2$ tip),  while the barber I go to is 30 including tip.(25+5$ tip) which includes eyebrows.",
                                    "author": "SSjGRaj",
                                    "id": "gyluszk",
                                    "parent_id": "t1_gylq5rj",
                                    "score": 1,
                                    "created_utc": 1621366232.0,
                                    "replies": [
                                        {
                                            "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
                                            "author": null,
                                            "id": "gylw9n3",
                                            "parent_id": "t1_gyluszk",
                                            "score": 2,
                                            "created_utc": 1621366826.0,
                                            "replies": [
                                                {
                                                    "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                                                    "author": "SSjGRaj",
                                                    "id": "gymkq3d",
                                                    "parent_id": "t1_gylw9n3",
                                                    "score": 1,
                                                    "created_utc": 1621377264.0,
                                                    "replies": [
                                                        {
                                                            "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                                                            "author": null,
                                                            "id": "gymx616",
                                                            "parent_id": "t1_gymkq3d",
                                                            "score": 1,
                                                            "created_utc": 1621383349.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a gamble trying to find one. A lot of the “best barbers” and ones that left a shop to start their own because they were better than the last, are the ones that are the worst. There also seems to be a trend of haircuts in men. Hard cut in parts, Brad Pitt Fury, Peaky blinders, etc. and telling/showing a barber that you want (insert photo here) they seem to still go back to the same generic haircut they’ve pumped out 100 times that week.",
            "author": null,
            "id": "gyl5r4b",
            "parent_id": "t1_gyl34y2",
            "score": 5,
            "created_utc": 1621356096.0,
            "replies": [
                {
                    "body": "I would ask people with good haircuts who they use. Luckily i found my current barber by chance but ive since realized a lot of the better styled acquaintances i know go to him too. Social media will give you a kot of poor recommendations but usually the people with the most are legit.",
                    "author": "benigntugboat",
                    "id": "gyl6f55",
                    "parent_id": "t1_gyl5r4b",
                    "score": 3,
                    "created_utc": 1621356367.0,
                    "replies": []
                },
                {
                    "body": "This is exactly what happens, honestly I think they zone out and just go to the default haircut sometimes",
                    "author": "dudewithlettuce",
                    "id": "gym5mmb",
                    "parent_id": "t1_gyl5r4b",
                    "score": 2,
                    "created_utc": 1621370610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. I take you’re statement of “finding a good barber first” is a barber that has a great consultation. I ask when your last cut was, how often you get it cut(realistically) how/if you style it, what products if you do, what shampoo/conditioner you use, which side you push it to (if at all) etc. I’ll also analyze the scalp a bit for bumps and flat spots if it’s a fade that’s way over do- we talk cowlicks. Then show me a pic and we will discuss what’s realistic and the best way to achieve what you want and what works for you and your life style. This is not a long conversation. \n\nIf you show a new barber a pic and they go “Mk” and start cutting without further questions.. I would be a bit nervous.",
            "author": null,
            "id": "gyphja9",
            "parent_id": "t1_gyl34y2",
            "score": 2,
            "created_utc": 1621438324.0,
            "replies": []
        },
        {
            "body": "How the hell do you know if a barber is good for you before they cut your hair 😐 even good barbers can fuck up and give you something different than what you show them or ask for. How about try actually learning the proper terms for haircuts instead of giving useless advice.",
            "author": "medina_ds3",
            "id": "gyluyso",
            "parent_id": "t1_gyl34y2",
            "score": 2,
            "created_utc": 1621366299.0,
            "replies": [
                {
                    "body": "I gave some suggestions to finding one in another comment. But honestly trial and errorsnalways a part of it. I used to have a giant mohawk and had a great stylist for that. But now that i lean towards cleaner cuts like fades and undercuts I have a different barber because the stylist really wasnt great at mens hair, just dye jobs and the specific style i had. My current barbers a great guy who gets paid to teach and cut at events/conventions (not sure on the details tbh) and has done a fantastic job on any style ive tried since. His instagram shows a lot of interesting cuts hes done, i know a few peoplr who go tonhim and always had great hair and he was at a shop id already liked while i was trying people out.     \n     \nNot sure why you seem annoyed about something that had literally 0 mention in my comments. Using the proper terms wont help if your barber doesnt know them, or cant execute them well or consistently. Me knowing the difference between a crew cut or a buzz cut doesnt matter because I dont want either and Im not cutting anyone elses hair.",
                    "author": "benigntugboat",
                    "id": "gylybmm",
                    "parent_id": "t1_gyluyso",
                    "score": 1,
                    "created_utc": 1621367653.0,
                    "replies": []
                },
                {
                    "body": "A lot of tears...a lot of tears",
                    "author": "dudewithlettuce",
                    "id": "gym5py5",
                    "parent_id": "t1_gyluyso",
                    "score": -1,
                    "created_utc": 1621370647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yah I’ll never return and I want to slam them on Yelp but it isn’t even worth it. But I spent the better part of a full year growing my hair out long, to have it hacked to shit.",
            "author": null,
            "id": "gyl5xo0",
            "parent_id": "t1_gyl1g63",
            "score": 1,
            "created_utc": 1621356172.0,
            "replies": []
        },
        {
            "body": "£20 note keep the change mate",
            "author": "Komaric_",
            "id": "gykd9ez",
            "parent_id": "t1_gyjq4q4",
            "score": 10,
            "created_utc": 1621343934.0,
            "replies": []
        },
        {
            "body": "i tip in turkey",
            "author": "eercelik21",
            "id": "gyjsoou",
            "parent_id": "t1_gyjq4q4",
            "score": 4,
            "created_utc": 1621329954.0,
            "replies": [
                {
                    "body": "i tip my car",
                    "author": "huitlacoche",
                    "id": "gyky7ft",
                    "parent_id": "t1_gyjsoou",
                    "score": 1,
                    "created_utc": 1621353000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure they do. I tip my barber in Germany.",
            "author": "forseti_",
            "id": "gyk26ev",
            "parent_id": "t1_gyjq4q4",
            "score": 1,
            "created_utc": 1621337633.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gyjqn87",
            "parent_id": "t1_gyjq4q4",
            "score": -15,
            "created_utc": 1621328040.0,
            "replies": [
                {
                    "body": "Try to tip here and the people you're giving tips to will just look at you weird lmao",
                    "author": "BubbaGoom",
                    "id": "gyjvjgs",
                    "parent_id": "t1_gyjqn87",
                    "score": 11,
                    "created_utc": 1621332521.0,
                    "replies": [
                        {
                            "body": "Bruh that’s the same here in Australia too",
                            "author": "BigFooz",
                            "id": "gyjy8xj",
                            "parent_id": "t1_gyjvjgs",
                            "score": 6,
                            "created_utc": 1621334758.0,
                            "replies": [
                                {
                                    "body": "He's talking about Australia as well haha",
                                    "author": "VirtuosoX",
                                    "id": "gyk5ya7",
                                    "parent_id": "t1_gyjy8xj",
                                    "score": 5,
                                    "created_utc": 1621340034.0,
                                    "replies": [
                                        {
                                            "body": "Oh shit LMAAO",
                                            "author": "BigFooz",
                                            "id": "gyk8n2h",
                                            "parent_id": "t1_gyk5ya7",
                                            "score": 3,
                                            "created_utc": 1621341554.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lol no we just have a proper wages system",
                    "author": "Icyfire11",
                    "id": "gyjqrcq",
                    "parent_id": "t1_gyjqn87",
                    "score": 21,
                    "created_utc": 1621328151.0,
                    "replies": [
                        {
                            "body": "Tipping is used to boost their wages. If their tipping makes them earn less than minimum wage. They get paid the difference until they make minimum wage.",
                            "author": "bob3908",
                            "id": "gyjswas",
                            "parent_id": "t1_gyjqrcq",
                            "score": 5,
                            "created_utc": 1621330147.0,
                            "replies": []
                        },
                        {
                            "body": "Not really 😅",
                            "author": "forseti_",
                            "id": "gyk29at",
                            "parent_id": "t1_gyjqrcq",
                            "score": -3,
                            "created_utc": 1621337688.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd say low fade textured top.",
            "author": "bigred91224",
            "id": "gykz5xm",
            "parent_id": "t1_gykde9i",
            "score": 2,
            "created_utc": 1621353389.0,
            "replies": []
        },
        {
            "body": "Yeah, finding the right balance in price and a good haircut is for sure hard. But the lower the price, the less time they want to spend per person, so they might end up rushing the cut.",
            "author": "ClassroomExtension",
            "id": "gyjm9e0",
            "parent_id": "t1_gyjlmat",
            "score": 32,
            "created_utc": 1621323988.0,
            "replies": []
        },
        {
            "body": "If you figure out who your people are that you trust you only see them. If you notice you're going to need a trim soon you call/email and make an appointment with them.",
            "author": "drunky_crowette",
            "id": "gyl4fio",
            "parent_id": "t1_gyjlmat",
            "score": 4,
            "created_utc": 1621355561.0,
            "replies": []
        },
        {
            "body": "When I went to my barber I showed him like 10 photos of what I wanted (mid curtain) and the dude has never done a curtain before, I helped him with the process and was talking to him about the cut constantly, he was careful as to not fuck up. In the end the cut looked fucking fresh.\n\nYou don’t just show pictures, it’s a joint effort with you AND the barber to get you what you want. You help them help you.",
            "author": "ButterStick212",
            "id": "gym34tm",
            "parent_id": "t1_gylu657",
            "score": 13,
            "created_utc": 1621369593.0,
            "replies": [
                {
                    "body": "Unless you’re a barber too i don’t see how you managed to walk him through a haircut neither of you have done and have it look good on the first try.",
                    "author": "medina_ds3",
                    "id": "gymdtjk",
                    "parent_id": "t1_gym34tm",
                    "score": 8,
                    "created_utc": 1621374039.0,
                    "replies": [
                        {
                            "body": "It’s just I cut my hair all the time, but I was running late for a driving test and didn’t have time to cut it myself. So I said fuck it and went to the barber",
                            "author": "ButterStick212",
                            "id": "gymmka0",
                            "parent_id": "t1_gymdtjk",
                            "score": 4,
                            "created_utc": 1621378154.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best is to find a place where you know the guy is gay and thinks you are hot. He will always make sure that you look great when leaving the place. 😁",
            "author": "forseti_",
            "id": "gyk1q94",
            "parent_id": "t1_gyjhqgl",
            "score": 30,
            "created_utc": 1621337328.0,
            "replies": [
                {
                    "body": "😂I honestly believed the same thing when I was still in the Philippines lmao. If a gay person were to cut my hair, it was guaranteed to be fuego🔥",
                    "author": "BubbaGoom",
                    "id": "gyk2m1h",
                    "parent_id": "t1_gyk1q94",
                    "score": 12,
                    "created_utc": 1621337922.0,
                    "replies": [
                        {
                            "body": "Always get your barber's number and Instagram.  Then just dm them whens the next time you can get a cut. If they don't have a social media page they aren't serious about their craft. Move on to the next.",
                            "author": "nodiso",
                            "id": "gylirx4",
                            "parent_id": "t1_gyk2m1h",
                            "score": 6,
                            "created_utc": 1621361364.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So true.  Had a guy that crossedressed on the weekends cut my hair once.  He had long nails with bad polish job, but similar thin, straight, yet dense hair just like me.  Best haircut ever, but the next time i tried to get my haircut he had fallen off face of earth according to the shop owner.",
                    "author": "HeKnee",
                    "id": "gyle1sx",
                    "parent_id": "t1_gyk1q94",
                    "score": 6,
                    "created_utc": 1621359449.0,
                    "replies": []
                },
                {
                    "body": "All of my best barbers have been older (more years of experience) gay men. Same for many of my friends that stay stylish and sexy.",
                    "author": "AlfredKinsey",
                    "id": "gynacze",
                    "parent_id": "t1_gyk1q94",
                    "score": 2,
                    "created_utc": 1621389906.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just call ahead and check what the barber's schedule is. Almost every shop will let you prebook w someone. No need to find a new place, first cut looks great",
            "author": "scottyLogJobs",
            "id": "gykipnj",
            "parent_id": "t1_gyjhqgl",
            "score": 2,
            "created_utc": 1621346504.0,
            "replies": [
                {
                    "body": "very good point, but idk, might try to find one of those higher priced venues, kinda wanna experience the vibe etc of those kinda places",
                    "author": "BubbaGoom",
                    "id": "gykjr6h",
                    "parent_id": "t1_gykipnj",
                    "score": 1,
                    "created_utc": 1621346962.0,
                    "replies": [
                        {
                            "body": "Still pick a person if you can at the place. Usually walkins go to whoever isnt booked. And the people that arent booked but are there are usually newer or just not as good. It applies to any shop",
                            "author": "benigntugboat",
                            "id": "gyl2sjr",
                            "parent_id": "t1_gykjr6h",
                            "score": 3,
                            "created_utc": 1621354888.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Learn the name of the barber you like and request them in advance. If they’re inconsistent, first try saying something, noting what you didn’t like in a bad cut. If they still can’t get it right consistently, ask around, shop around, and get a new one.",
            "author": "AlfredKinsey",
            "id": "gynaf8d",
            "parent_id": "t1_gyjhqgl",
            "score": 1,
            "created_utc": 1621389935.0,
            "replies": []
        },
        {
            "body": "Asian hair isn't thinner, in fact I can have a full mop of hair if I let it grow. It's the way our hair grows due to how thick the strands are, our's grow perpendicular to our scalp (it grows out) while caucasian hair grows down parallel to theirs. That's why when we get a 0.5 or 1 fade, our scalps shows much more.",
            "author": "BubbaGoom",
            "id": "gynz1r7",
            "parent_id": "t1_gymu9a1",
            "score": 4,
            "created_utc": 1621404178.0,
            "replies": [
                {
                    "body": "I think im a rare type, im Caucasian but have extremely thick asian hair, so I either grow it long or keep it very short lol",
                    "author": null,
                    "id": "gyobre1",
                    "parent_id": "t1_gynz1r7",
                    "score": 2,
                    "created_utc": 1621415102.0,
                    "replies": [
                        {
                            "body": "I know the feels 😢",
                            "author": "BubbaGoom",
                            "id": "gypfp4h",
                            "parent_id": "t1_gyobre1",
                            "score": 2,
                            "created_utc": 1621437575.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Generalizing though. I'm white as fuck and my hair grows straight out",
                    "author": "nahfoo",
                    "id": "h1k5j3w",
                    "parent_id": "t1_gynz1r7",
                    "score": 1,
                    "created_utc": 1623535454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good for you,  I make a living doing this, I've been cutting hair for 5 years now with 1 year apprenticeship. I've participated and placed in fade competition.\n\nTo be fair, both these cuts are trash, the technique on the second is better though",
            "author": "icantbelieveiclicked",
            "id": "gyqn622",
            "parent_id": "t1_gyqd7mj",
            "score": 2,
            "created_utc": 1621455785.0,
            "replies": []
        },
        {
            "body": "Its cuz they all get their buisness from old people and kids who were forced by their moms cuz it was cheap.",
            "author": "SSjGRaj",
            "id": "gyjk5o6",
            "parent_id": "t1_gyjj0rv",
            "score": 26,
            "created_utc": 1621322131.0,
            "replies": [
                {
                    "body": "whats crazy, is that great clips will always mess up my hair. its always blended with the grace of a jackhammer(you can see literally what lines they drew to blend it the whole way up)\n\nYet back up north(im in the south now) there was a place called cost cutters that had the same business model, but always did me right no matter what. Was a great place if I couldnt afford the barber at the time or if it was an odd hours barber like i had at one point.",
                    "author": "Pewkie",
                    "id": "gykckoj",
                    "parent_id": "t1_gyjk5o6",
                    "score": 3,
                    "created_utc": 1621343588.0,
                    "replies": []
                },
                {
                    "body": "Where I live Great clips charging almost the same as all the good local barber shops… blows my mind that they can even charge half of what a good barbershop charges.",
                    "author": null,
                    "id": "gylq5rj",
                    "parent_id": "t1_gyjk5o6",
                    "score": 1,
                    "created_utc": 1621364335.0,
                    "replies": [
                        {
                            "body": "Dam really? Great clips is like 12 dollars including tip in my area (10$+2$ tip),  while the barber I go to is 30 including tip.(25+5$ tip) which includes eyebrows.",
                            "author": "SSjGRaj",
                            "id": "gyluszk",
                            "parent_id": "t1_gylq5rj",
                            "score": 1,
                            "created_utc": 1621366232.0,
                            "replies": [
                                {
                                    "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
                                    "author": null,
                                    "id": "gylw9n3",
                                    "parent_id": "t1_gyluszk",
                                    "score": 2,
                                    "created_utc": 1621366826.0,
                                    "replies": [
                                        {
                                            "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                                            "author": "SSjGRaj",
                                            "id": "gymkq3d",
                                            "parent_id": "t1_gylw9n3",
                                            "score": 1,
                                            "created_utc": 1621377264.0,
                                            "replies": [
                                                {
                                                    "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                                                    "author": null,
                                                    "id": "gymx616",
                                                    "parent_id": "t1_gymkq3d",
                                                    "score": 1,
                                                    "created_utc": 1621383349.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would ask people with good haircuts who they use. Luckily i found my current barber by chance but ive since realized a lot of the better styled acquaintances i know go to him too. Social media will give you a kot of poor recommendations but usually the people with the most are legit.",
            "author": "benigntugboat",
            "id": "gyl6f55",
            "parent_id": "t1_gyl5r4b",
            "score": 3,
            "created_utc": 1621356367.0,
            "replies": []
        },
        {
            "body": "This is exactly what happens, honestly I think they zone out and just go to the default haircut sometimes",
            "author": "dudewithlettuce",
            "id": "gym5mmb",
            "parent_id": "t1_gyl5r4b",
            "score": 2,
            "created_utc": 1621370610.0,
            "replies": []
        },
        {
            "body": "I gave some suggestions to finding one in another comment. But honestly trial and errorsnalways a part of it. I used to have a giant mohawk and had a great stylist for that. But now that i lean towards cleaner cuts like fades and undercuts I have a different barber because the stylist really wasnt great at mens hair, just dye jobs and the specific style i had. My current barbers a great guy who gets paid to teach and cut at events/conventions (not sure on the details tbh) and has done a fantastic job on any style ive tried since. His instagram shows a lot of interesting cuts hes done, i know a few peoplr who go tonhim and always had great hair and he was at a shop id already liked while i was trying people out.     \n     \nNot sure why you seem annoyed about something that had literally 0 mention in my comments. Using the proper terms wont help if your barber doesnt know them, or cant execute them well or consistently. Me knowing the difference between a crew cut or a buzz cut doesnt matter because I dont want either and Im not cutting anyone elses hair.",
            "author": "benigntugboat",
            "id": "gylybmm",
            "parent_id": "t1_gyluyso",
            "score": 1,
            "created_utc": 1621367653.0,
            "replies": []
        },
        {
            "body": "A lot of tears...a lot of tears",
            "author": "dudewithlettuce",
            "id": "gym5py5",
            "parent_id": "t1_gyluyso",
            "score": -1,
            "created_utc": 1621370647.0,
            "replies": []
        },
        {
            "body": "i tip my car",
            "author": "huitlacoche",
            "id": "gyky7ft",
            "parent_id": "t1_gyjsoou",
            "score": 1,
            "created_utc": 1621353000.0,
            "replies": []
        },
        {
            "body": "Try to tip here and the people you're giving tips to will just look at you weird lmao",
            "author": "BubbaGoom",
            "id": "gyjvjgs",
            "parent_id": "t1_gyjqn87",
            "score": 11,
            "created_utc": 1621332521.0,
            "replies": [
                {
                    "body": "Bruh that’s the same here in Australia too",
                    "author": "BigFooz",
                    "id": "gyjy8xj",
                    "parent_id": "t1_gyjvjgs",
                    "score": 6,
                    "created_utc": 1621334758.0,
                    "replies": [
                        {
                            "body": "He's talking about Australia as well haha",
                            "author": "VirtuosoX",
                            "id": "gyk5ya7",
                            "parent_id": "t1_gyjy8xj",
                            "score": 5,
                            "created_utc": 1621340034.0,
                            "replies": [
                                {
                                    "body": "Oh shit LMAAO",
                                    "author": "BigFooz",
                                    "id": "gyk8n2h",
                                    "parent_id": "t1_gyk5ya7",
                                    "score": 3,
                                    "created_utc": 1621341554.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol no we just have a proper wages system",
            "author": "Icyfire11",
            "id": "gyjqrcq",
            "parent_id": "t1_gyjqn87",
            "score": 21,
            "created_utc": 1621328151.0,
            "replies": [
                {
                    "body": "Tipping is used to boost their wages. If their tipping makes them earn less than minimum wage. They get paid the difference until they make minimum wage.",
                    "author": "bob3908",
                    "id": "gyjswas",
                    "parent_id": "t1_gyjqrcq",
                    "score": 5,
                    "created_utc": 1621330147.0,
                    "replies": []
                },
                {
                    "body": "Not really 😅",
                    "author": "forseti_",
                    "id": "gyk29at",
                    "parent_id": "t1_gyjqrcq",
                    "score": -3,
                    "created_utc": 1621337688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless you’re a barber too i don’t see how you managed to walk him through a haircut neither of you have done and have it look good on the first try.",
            "author": "medina_ds3",
            "id": "gymdtjk",
            "parent_id": "t1_gym34tm",
            "score": 8,
            "created_utc": 1621374039.0,
            "replies": [
                {
                    "body": "It’s just I cut my hair all the time, but I was running late for a driving test and didn’t have time to cut it myself. So I said fuck it and went to the barber",
                    "author": "ButterStick212",
                    "id": "gymmka0",
                    "parent_id": "t1_gymdtjk",
                    "score": 4,
                    "created_utc": 1621378154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂I honestly believed the same thing when I was still in the Philippines lmao. If a gay person were to cut my hair, it was guaranteed to be fuego🔥",
            "author": "BubbaGoom",
            "id": "gyk2m1h",
            "parent_id": "t1_gyk1q94",
            "score": 12,
            "created_utc": 1621337922.0,
            "replies": [
                {
                    "body": "Always get your barber's number and Instagram.  Then just dm them whens the next time you can get a cut. If they don't have a social media page they aren't serious about their craft. Move on to the next.",
                    "author": "nodiso",
                    "id": "gylirx4",
                    "parent_id": "t1_gyk2m1h",
                    "score": 6,
                    "created_utc": 1621361364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true.  Had a guy that crossedressed on the weekends cut my hair once.  He had long nails with bad polish job, but similar thin, straight, yet dense hair just like me.  Best haircut ever, but the next time i tried to get my haircut he had fallen off face of earth according to the shop owner.",
            "author": "HeKnee",
            "id": "gyle1sx",
            "parent_id": "t1_gyk1q94",
            "score": 6,
            "created_utc": 1621359449.0,
            "replies": []
        },
        {
            "body": "All of my best barbers have been older (more years of experience) gay men. Same for many of my friends that stay stylish and sexy.",
            "author": "AlfredKinsey",
            "id": "gynacze",
            "parent_id": "t1_gyk1q94",
            "score": 2,
            "created_utc": 1621389906.0,
            "replies": []
        },
        {
            "body": "very good point, but idk, might try to find one of those higher priced venues, kinda wanna experience the vibe etc of those kinda places",
            "author": "BubbaGoom",
            "id": "gykjr6h",
            "parent_id": "t1_gykipnj",
            "score": 1,
            "created_utc": 1621346962.0,
            "replies": [
                {
                    "body": "Still pick a person if you can at the place. Usually walkins go to whoever isnt booked. And the people that arent booked but are there are usually newer or just not as good. It applies to any shop",
                    "author": "benigntugboat",
                    "id": "gyl2sjr",
                    "parent_id": "t1_gykjr6h",
                    "score": 3,
                    "created_utc": 1621354888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think im a rare type, im Caucasian but have extremely thick asian hair, so I either grow it long or keep it very short lol",
            "author": null,
            "id": "gyobre1",
            "parent_id": "t1_gynz1r7",
            "score": 2,
            "created_utc": 1621415102.0,
            "replies": [
                {
                    "body": "I know the feels 😢",
                    "author": "BubbaGoom",
                    "id": "gypfp4h",
                    "parent_id": "t1_gyobre1",
                    "score": 2,
                    "created_utc": 1621437575.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Generalizing though. I'm white as fuck and my hair grows straight out",
            "author": "nahfoo",
            "id": "h1k5j3w",
            "parent_id": "t1_gynz1r7",
            "score": 1,
            "created_utc": 1623535454.0,
            "replies": []
        },
        {
            "body": "whats crazy, is that great clips will always mess up my hair. its always blended with the grace of a jackhammer(you can see literally what lines they drew to blend it the whole way up)\n\nYet back up north(im in the south now) there was a place called cost cutters that had the same business model, but always did me right no matter what. Was a great place if I couldnt afford the barber at the time or if it was an odd hours barber like i had at one point.",
            "author": "Pewkie",
            "id": "gykckoj",
            "parent_id": "t1_gyjk5o6",
            "score": 3,
            "created_utc": 1621343588.0,
            "replies": []
        },
        {
            "body": "Where I live Great clips charging almost the same as all the good local barber shops… blows my mind that they can even charge half of what a good barbershop charges.",
            "author": null,
            "id": "gylq5rj",
            "parent_id": "t1_gyjk5o6",
            "score": 1,
            "created_utc": 1621364335.0,
            "replies": [
                {
                    "body": "Dam really? Great clips is like 12 dollars including tip in my area (10$+2$ tip),  while the barber I go to is 30 including tip.(25+5$ tip) which includes eyebrows.",
                    "author": "SSjGRaj",
                    "id": "gyluszk",
                    "parent_id": "t1_gylq5rj",
                    "score": 1,
                    "created_utc": 1621366232.0,
                    "replies": [
                        {
                            "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
                            "author": null,
                            "id": "gylw9n3",
                            "parent_id": "t1_gyluszk",
                            "score": 2,
                            "created_utc": 1621366826.0,
                            "replies": [
                                {
                                    "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                                    "author": "SSjGRaj",
                                    "id": "gymkq3d",
                                    "parent_id": "t1_gylw9n3",
                                    "score": 1,
                                    "created_utc": 1621377264.0,
                                    "replies": [
                                        {
                                            "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                                            "author": null,
                                            "id": "gymx616",
                                            "parent_id": "t1_gymkq3d",
                                            "score": 1,
                                            "created_utc": 1621383349.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh that’s the same here in Australia too",
            "author": "BigFooz",
            "id": "gyjy8xj",
            "parent_id": "t1_gyjvjgs",
            "score": 6,
            "created_utc": 1621334758.0,
            "replies": [
                {
                    "body": "He's talking about Australia as well haha",
                    "author": "VirtuosoX",
                    "id": "gyk5ya7",
                    "parent_id": "t1_gyjy8xj",
                    "score": 5,
                    "created_utc": 1621340034.0,
                    "replies": [
                        {
                            "body": "Oh shit LMAAO",
                            "author": "BigFooz",
                            "id": "gyk8n2h",
                            "parent_id": "t1_gyk5ya7",
                            "score": 3,
                            "created_utc": 1621341554.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tipping is used to boost their wages. If their tipping makes them earn less than minimum wage. They get paid the difference until they make minimum wage.",
            "author": "bob3908",
            "id": "gyjswas",
            "parent_id": "t1_gyjqrcq",
            "score": 5,
            "created_utc": 1621330147.0,
            "replies": []
        },
        {
            "body": "Not really 😅",
            "author": "forseti_",
            "id": "gyk29at",
            "parent_id": "t1_gyjqrcq",
            "score": -3,
            "created_utc": 1621337688.0,
            "replies": []
        },
        {
            "body": "It’s just I cut my hair all the time, but I was running late for a driving test and didn’t have time to cut it myself. So I said fuck it and went to the barber",
            "author": "ButterStick212",
            "id": "gymmka0",
            "parent_id": "t1_gymdtjk",
            "score": 4,
            "created_utc": 1621378154.0,
            "replies": []
        },
        {
            "body": "Always get your barber's number and Instagram.  Then just dm them whens the next time you can get a cut. If they don't have a social media page they aren't serious about their craft. Move on to the next.",
            "author": "nodiso",
            "id": "gylirx4",
            "parent_id": "t1_gyk2m1h",
            "score": 6,
            "created_utc": 1621361364.0,
            "replies": []
        },
        {
            "body": "Still pick a person if you can at the place. Usually walkins go to whoever isnt booked. And the people that arent booked but are there are usually newer or just not as good. It applies to any shop",
            "author": "benigntugboat",
            "id": "gyl2sjr",
            "parent_id": "t1_gykjr6h",
            "score": 3,
            "created_utc": 1621354888.0,
            "replies": []
        },
        {
            "body": "I know the feels 😢",
            "author": "BubbaGoom",
            "id": "gypfp4h",
            "parent_id": "t1_gyobre1",
            "score": 2,
            "created_utc": 1621437575.0,
            "replies": []
        },
        {
            "body": "Dam really? Great clips is like 12 dollars including tip in my area (10$+2$ tip),  while the barber I go to is 30 including tip.(25+5$ tip) which includes eyebrows.",
            "author": "SSjGRaj",
            "id": "gyluszk",
            "parent_id": "t1_gylq5rj",
            "score": 1,
            "created_utc": 1621366232.0,
            "replies": [
                {
                    "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
                    "author": null,
                    "id": "gylw9n3",
                    "parent_id": "t1_gyluszk",
                    "score": 2,
                    "created_utc": 1621366826.0,
                    "replies": [
                        {
                            "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                            "author": "SSjGRaj",
                            "id": "gymkq3d",
                            "parent_id": "t1_gylw9n3",
                            "score": 1,
                            "created_utc": 1621377264.0,
                            "replies": [
                                {
                                    "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                                    "author": null,
                                    "id": "gymx616",
                                    "parent_id": "t1_gymkq3d",
                                    "score": 1,
                                    "created_utc": 1621383349.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He's talking about Australia as well haha",
            "author": "VirtuosoX",
            "id": "gyk5ya7",
            "parent_id": "t1_gyjy8xj",
            "score": 5,
            "created_utc": 1621340034.0,
            "replies": [
                {
                    "body": "Oh shit LMAAO",
                    "author": "BigFooz",
                    "id": "gyk8n2h",
                    "parent_id": "t1_gyk5ya7",
                    "score": 3,
                    "created_utc": 1621341554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn hahah, great clips is $20ish near me without tip and decent barbers are about that with the good ones being $30ish",
            "author": null,
            "id": "gylw9n3",
            "parent_id": "t1_gyluszk",
            "score": 2,
            "created_utc": 1621366826.0,
            "replies": [
                {
                    "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
                    "author": "SSjGRaj",
                    "id": "gymkq3d",
                    "parent_id": "t1_gylw9n3",
                    "score": 1,
                    "created_utc": 1621377264.0,
                    "replies": [
                        {
                            "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                            "author": null,
                            "id": "gymx616",
                            "parent_id": "t1_gymkq3d",
                            "score": 1,
                            "created_utc": 1621383349.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh shit LMAAO",
            "author": "BigFooz",
            "id": "gyk8n2h",
            "parent_id": "t1_gyk5ya7",
            "score": 3,
            "created_utc": 1621341554.0,
            "replies": []
        },
        {
            "body": "Dam thats rough bro, my barber is so good for only 30 dollars its like those haircut transformation videos on YT.",
            "author": "SSjGRaj",
            "id": "gymkq3d",
            "parent_id": "t1_gylw9n3",
            "score": 1,
            "created_utc": 1621377264.0,
            "replies": [
                {
                    "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
                    "author": null,
                    "id": "gymx616",
                    "parent_id": "t1_gymkq3d",
                    "score": 1,
                    "created_utc": 1621383349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idc though because I have an awesome barber I’ve been going to for years hahaha but seeing places like great clips charge that and people actually going there blows my mind.",
            "author": null,
            "id": "gymx616",
            "parent_id": "t1_gymkq3d",
            "score": 1,
            "created_utc": 1621383349.0,
            "replies": []
        }
    ]
}