{
    "title": "SR Falling Apart for Strange Reason",
    "post_id": "x5u8ys",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/x5u8ys/sr_falling_apart_for_strange_reason/",
    "author": "WaterJourney67",
    "body": "TL;DR My SB gathered info about me that convinced her I should be paying more and insisted we renegotiate our arrangement. \n\nFirst post about my first SR. I work for a public company in the southeast, and I have been seeing my SB for a little over three months now. This has seemed like an ideal relationship all around. It took a long time to find the right one. I met her in the wild, and that made it feel even more perfect. \n\nAs a note, my part of our arrangement (allowance) has been on the generous side of standard for the Atlanta area, and my contributions have been like clockwork. \n\nWhen we met for dinner this weekend, however, something felt off. She was unusually quiet and kept giving me strange looks, sort of squinting at me, throughout the meal (think Gilbert Gottfried, only much prettier). I’ve long since stopped trying to decode the female mind, but as we were finishing our main course, she suggested we order a cocktail and transition to a serious topic. We’ve done so well together, and we seemed to have a great understanding, so I had no clue as to what was coming. I assumed she was about to break up, but that didn’t really line up. Then she informed me she had been doing some research, and she produced some folded papers from her purse (which I bought her… the irony!). The gist is that she dug up public info on two stock sales I had made before we ever met. One was this year, and one was some time prior at a different company. \n\nNext thing I know, I am nursing my Old Fashioned while she is showing me the SEC Form 4s with the mien of someone who has uncovered evidence of a felony! I explained that anyone who knew my name could access this information. It’s all public record, but the whole thing felt weird and damned unnerving. \n\nThen she began to cry and accused me of “holding out” on her. In reality, she has no clue what my financial situation is. I’ve never discussed it with her, but I never poor-mouthed either. She just saw two stock sales and extrapolated recklessly from there. She announced that it is time for us to renegotiate our arrangement. Mind you, for the past several weeks, she has been saying that our arrangement was “generous”, “perfect” and had been “life changing.” Now she wants multiple times the amount we had agreed upon early in the summer. She “justified” this by pointing out that it would only amount a fraction of a percentage of the stock sales. She called me a whale (Whatever. I’m not). I asked her if she thought the restaurant should charge me more for our dinner as well. This served only to piss her off. I tried to reason with her, but she was obdurate. She quoted scripture at me. She alternated between laughing and crying. She asked me if I had any appreciation for how difficult this was for her. She obtusely hinted that she might show up at my work (I’m not seriously worried about that). I had never seen this side of her before, and I mostly sat in stunned silence. At the end of the evening, my Little Man was no longer in the mood for recreation, so I suggested that she had given me a lot to think about, and I needed some time to do that. \n\nHonestly, I don’t think I can continue this arrangement now even if she reverses course. The hardest part was that I had developed real feelings for her, and I feel incredibly foolish right now. As they say, “there’s no fool like an old fool.” I don’t know that this is the right lifestyle for me. I don’t want to start over, sifting through a sea of rinsers and scammers, but I can’t go forward with this one.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/x5u8ys/sr_falling_apart_for_strange_reason/",
    "score": 129,
    "upvote_ratio": 0.96,
    "created_utc": 1662316765.0,
    "num_comments": 208,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">Honestly, I don’t think I can continue this arrangement now even if she reverses course. The hardest part was that I had developed real feelings for her,\n\nThese are two of the most important statements you've made.  First, it's obvious you had developed real feelings for her -- if you hadn't, this wouldn't be so difficult.  All of us without feelings for her, we can see how ludicrous and manipulative her behavior is, how it's so solidly in red flag zone.  Only someone with feelings could struggle with it.  Which is totally natural and understandable!  It's when I catch feelings that the right decisions become so hard.\n\nWhat really resonates with me is \"I don't think I can continue this arrangement now even if she reverses course\".  That's a feeling I've learned to listen to, it's the always-accurate indicator something's gone really wrong.   When in doubt, listen to that feeling. I'm the same way that once someone goes way over the line, even if I'm struggling with how to react, if I get that \"how can I possibly pick this back up?\" feeling, I know going back will be disastrous, and not fair to me or her.",
            "author": "WynnDuppy",
            "id": "in3pe6f",
            "parent_id": "t3_x5u8ys",
            "score": 49,
            "created_utc": 1662325225.0,
            "replies": [
                {
                    "body": "I’d add the lady was well aware of “real feelings” part and decided to opportunistically make her pitch.  She figured she had the SD by his balls. She also thought after likely watching a TikTok video or two that she will look really smart and well informed by bringing all this supporting documentation to make her case. Well it was super dumb on her part. \n\nThe question for OP is what’s the best way to fire her ass.",
                    "author": null,
                    "id": "in6ii8x",
                    "parent_id": "t1_in3pe6f",
                    "score": 5,
                    "created_utc": 1662383947.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "in82bqh",
                    "parent_id": "t1_in3pe6f",
                    "score": 2,
                    "created_utc": 1662407291.0,
                    "replies": [
                        {
                            "body": "Righteous quote!",
                            "author": "WynnDuppy",
                            "id": "in88tix",
                            "parent_id": "t1_in82bqh",
                            "score": 1,
                            "created_utc": 1662410045.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "End it and move on , we are not here to be milked , we share",
            "author": "shamloo77",
            "id": "in398il",
            "parent_id": "t3_x5u8ys",
            "score": 123,
            "created_utc": 1662318347.0,
            "replies": [
                {
                    "body": "100%",
                    "author": "ShaArt5",
                    "id": "in3ctbh",
                    "parent_id": "t1_in398il",
                    "score": 20,
                    "created_utc": 1662319860.0,
                    "replies": []
                },
                {
                    "body": "Perfectly said! When You guys put yourself out there and are completely blind sided in this manner it is first off a lack of respect on her part.  You deserve more. As a SB I hold my guy to the upmost standards , just as he does for me! There is no guarantee and honesty and loyalty are very rare but it's out there. Head up, better things await you!",
                    "author": "redheadedstepchild_1",
                    "id": "in5p1v9",
                    "parent_id": "t1_in398il",
                    "score": 6,
                    "created_utc": 1662362416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\> but she was obdurate. She quoted scripture at me. \n\nUpvoted for using a fun word and making me laugh hard!\n\nMay I ask what scripture she deemed appropriate for this conversation?!",
            "author": "ExperiencedMaleDom",
            "id": "in3b1md",
            "parent_id": "t3_x5u8ys",
            "score": 66,
            "created_utc": 1662319111.0,
            "replies": [
                {
                    "body": "“To him that knoweth to do good, and doeth it not, to him it is sin.”",
                    "author": "WaterJourney67",
                    "id": "in3hel8",
                    "parent_id": "t1_in3b1md",
                    "score": 58,
                    "created_utc": 1662321815.0,
                    "replies": [
                        {
                            "body": "Lol awesome.",
                            "author": null,
                            "id": "in3nqip",
                            "parent_id": "t1_in3hel8",
                            "score": 12,
                            "created_utc": 1662324511.0,
                            "replies": []
                        },
                        {
                            "body": "greed is also a sin...",
                            "author": "gaytoradee",
                            "id": "in5ja34",
                            "parent_id": "t1_in3hel8",
                            "score": 5,
                            "created_utc": 1662358182.0,
                            "replies": [
                                {
                                    "body": "One of the seven deadly sins, at that.",
                                    "author": "WaterJourney67",
                                    "id": "in66469",
                                    "parent_id": "t1_in5ja34",
                                    "score": 6,
                                    "created_utc": 1662376528.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "No freakin way. King James Version too. Ohmygosh— RUN! To nyc. 😉",
                            "author": "iamrosieriley",
                            "id": "in69gn8",
                            "parent_id": "t1_in3hel8",
                            "score": 0,
                            "created_utc": 1662378817.0,
                            "replies": []
                        },
                        {
                            "body": " 😂😂.   So she’s ( from a biblical standpoint) “sinning” with you ( I don’t really think SD/SB relationships are “sinning” unless abuse is involved), and she decides to quote biblical passages to persuade you to come across with more $$ that could potentially be quadrupled per assessment?   Just wow.   She was most likely raised fundamentalist, but she’s not a “good girl” now.",
                            "author": "stocks-mostly-lower",
                            "id": "iqw3rmw",
                            "parent_id": "t1_in3hel8",
                            "score": 1,
                            "created_utc": 1664809728.0,
                            "replies": [
                                {
                                    "body": "I’m not sure the exchange between us particularly rewards logical analysis. We were both raised in fundamentalist traditions, albeit different ones.",
                                    "author": "WaterJourney67",
                                    "id": "ir1g5e5",
                                    "parent_id": "t1_iqw3rmw",
                                    "score": 1,
                                    "created_utc": 1664903743.0,
                                    "replies": [
                                        {
                                            "body": "   Well, you put it on Reddit, so different readers will have different reactions, and look at your experiences with a variety of viewpoints based in their own backgrounds 🤷‍♀️❤️‍🔥.",
                                            "author": "stocks-mostly-lower",
                                            "id": "ir1j0n6",
                                            "parent_id": "t1_ir1g5e5",
                                            "score": 1,
                                            "created_utc": 1664904824.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did you know? Obstinate is being obstructive/difficult for no reason, obdurate has a reason (character, a hard skin, toughness, standing fast for what you believe).\n\nHad to go researching this word.",
                    "author": "clair-cummings",
                    "id": "in3f16e",
                    "parent_id": "t1_in3b1md",
                    "score": 29,
                    "created_utc": 1662320811.0,
                    "replies": [
                        {
                            "body": "Ooh, you sound like a teacher, and I like teachers!...\n\nI could quote a Rodney Dangerfield joke about teachers here, but I won't.",
                            "author": "ExperiencedMaleDom",
                            "id": "in3gnp3",
                            "parent_id": "t1_in3f16e",
                            "score": 5,
                            "created_utc": 1662321501.0,
                            "replies": [
                                {
                                    "body": "Definitely felt like obdurate was a $10 word… lol",
                                    "author": "Glock9prfction",
                                    "id": "in5iswn",
                                    "parent_id": "t1_in3gnp3",
                                    "score": 2,
                                    "created_utc": 1662357849.0,
                                    "replies": []
                                },
                                {
                                    "body": "What's the quote?",
                                    "author": "clair-cummings",
                                    "id": "ina2luu",
                                    "parent_id": "t1_in3gnp3",
                                    "score": 1,
                                    "created_utc": 1662442139.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I also laughed so hard at this",
                    "author": null,
                    "id": "in3hliw",
                    "parent_id": "t1_in3b1md",
                    "score": 9,
                    "created_utc": 1662321898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She feels she’s entitled to your resources and wealth as if a spouse - this is not a red flag, it is a three alarm fire \n\nTry and gently extract yourself from this situation over time. The feeling of envy will never go away once it takes root, no matter what they say \n\nI say “over time” as there is a crazy element showing up here and you probably don’t know the full extent of what trouble she can create for you",
            "author": "OCbird22",
            "id": "in39uw2",
            "parent_id": "t3_x5u8ys",
            "score": 79,
            "created_utc": 1662318611.0,
            "replies": [
                {
                    "body": "Exactly this",
                    "author": "jacksmith0xff",
                    "id": "in68y37",
                    "parent_id": "t1_in39uw2",
                    "score": 1,
                    "created_utc": 1662378486.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Counteroffer with a thick folder of evidence that her standard rate is free",
            "author": "huizeng",
            "id": "in3b33y",
            "parent_id": "t3_x5u8ys",
            "score": 56,
            "created_utc": 1662319128.0,
            "replies": [
                {
                    "body": "Babe, I sugar date Yesto avoid this kind of drama, best of luck to you.  Maybe you can negotiate some sort of profit sharing deal with your new sugar daddy.",
                    "author": "LotBuilder",
                    "id": "in44sse",
                    "parent_id": "t1_in3b33y",
                    "score": 4,
                    "created_utc": 1662332086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Immediate NEXT. OMG 😱 and she wants to blackmail you too OMG.",
            "author": "Resolve-Brilliant",
            "id": "in3k98x",
            "parent_id": "t3_x5u8ys",
            "score": 26,
            "created_utc": 1662323037.0,
            "replies": [
                {
                    "body": "This 100% is a risk so start preparing yourself to defend any angle of act.",
                    "author": "SW1981",
                    "id": "in3tbwh",
                    "parent_id": "t1_in3k98x",
                    "score": 13,
                    "created_utc": 1662326903.0,
                    "replies": []
                },
                {
                    "body": "Then Exactly this.",
                    "author": "jacksmith0xff",
                    "id": "in68z1w",
                    "parent_id": "t1_in3k98x",
                    "score": 2,
                    "created_utc": 1662378503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh damn, that's a hard blow! I'm so sorry this happened to you.\n\nI'm sure a lot of people here will give you great advice, and other lot will tell you what they think on the girl, so I won't.\n\nI just want to say, you are brave for developing feelings, for not living your life as a guarded person with a heart of stone. Yes, sometimes affection goes to people who are incompatible, but sometimes it opens doors to truly wonderful honest bonds. I'm certain there is one waiting for you around the corner.\n\nThe universe has only 3 answers:\n- yes\n- not yet\n- I have something better in store for you\n\nTake your time to mourn the end of your bond, knowing that there is something better waiting for you.",
            "author": "FructoseLady",
            "id": "in3a294",
            "parent_id": "t3_x5u8ys",
            "score": 25,
            "created_utc": 1662318698.0,
            "replies": [
                {
                    "body": "You forgot a 4th answer: run fast lol!",
                    "author": null,
                    "id": "in3gpzt",
                    "parent_id": "t1_in3a294",
                    "score": 8,
                    "created_utc": 1662321528.0,
                    "replies": []
                },
                {
                    "body": "Lol nah there is the 4th answer too \"I've got something worse for you\". It could also get worse should he choose that in the meantime. Which some do since they don't like being single or have other reasons.",
                    "author": "clair-cummings",
                    "id": "in3fdwy",
                    "parent_id": "t1_in3a294",
                    "score": 10,
                    "created_utc": 1662320960.0,
                    "replies": []
                },
                {
                    "body": "Thank you.",
                    "author": "WaterJourney67",
                    "id": "in3hy4p",
                    "parent_id": "t1_in3a294",
                    "score": 3,
                    "created_utc": 1662322047.0,
                    "replies": []
                },
                {
                    "body": "I love this! You practice LOA, huh?",
                    "author": "Grand_Photograph4081",
                    "id": "in4uz8n",
                    "parent_id": "t1_in3a294",
                    "score": 0,
                    "created_utc": 1662344483.0,
                    "replies": [
                        {
                            "body": "Indeed. It has many names and I've studied it as far as antiquity. \n\nHermes Trismegistus is my man! I'm starting Latin course this week so I could read the manuscripts of alchemists and delve deeper.",
                            "author": "FructoseLady",
                            "id": "in5fktk",
                            "parent_id": "t1_in4uz8n",
                            "score": 1,
                            "created_utc": 1662355684.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sad reality is she got greedy and blew it. How much you make, earn, buy or sell is none of her business. It's one thing to renegotiate after an extensive relationship but to be so calculated about it after three months is another.\n\nYou obviously entered the bowl for a reason, don't let one greedy girl ruin that experience. The bowl is rough out there at the moment but there are SB's who will appreciate you.",
            "author": "AbsolutPeony",
            "id": "in3lyka",
            "parent_id": "t3_x5u8ys",
            "score": 26,
            "created_utc": 1662323763.0,
            "replies": [
                {
                    "body": "Yes, I agree. The fact that she stalked you is weird haha",
                    "author": "Sugarcookie54321_",
                    "id": "in40pp5",
                    "parent_id": "t1_in3lyka",
                    "score": 5,
                    "created_utc": 1662330172.0,
                    "replies": []
                },
                {
                    "body": "Renegotiating has always been, and will always be, a deal breaker",
                    "author": "Blueexpression",
                    "id": "in5ychc",
                    "parent_id": "t1_in3lyka",
                    "score": 1,
                    "created_utc": 1662370167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a slightly different take on this situation, but the same common recommendation.  This is more from a boundaries perspective for me.  While she always has a the right request a different allowance. You have the right to pass, and I would recommend that in this situation.",
            "author": null,
            "id": "in3uwro",
            "parent_id": "t3_x5u8ys",
            "score": 6,
            "created_utc": 1662327589.0,
            "replies": []
        },
        {
            "body": "Can you counter back with some loss that you took years ago and ask her to pay her portion of the loss?  \n\n“ hey babe, I lost $210,000 in 2009,  by your math you should owe me about $1900.  Can you just Zelle it over?”  Then start crying randomly",
            "author": "LotBuilder",
            "id": "in45106",
            "parent_id": "t3_x5u8ys",
            "score": 17,
            "created_utc": 1662332195.0,
            "replies": [
                {
                    "body": "And quote scripture...can't forget the scripture",
                    "author": "DoughnutNo8452",
                    "id": "in4etvc",
                    "parent_id": "t1_in45106",
                    "score": 11,
                    "created_utc": 1662336873.0,
                    "replies": [
                        {
                            "body": "If anyone ever tells me to “have a blessed day” or has a Jesus fish on their business card I immediately check for my wallet.",
                            "author": "LotBuilder",
                            "id": "in4fq4w",
                            "parent_id": "t1_in4etvc",
                            "score": 6,
                            "created_utc": 1662337286.0,
                            "replies": []
                        },
                        {
                            "body": "😂",
                            "author": "Grand_Photograph4081",
                            "id": "in4utbc",
                            "parent_id": "t1_in4etvc",
                            "score": 1,
                            "created_utc": 1662344405.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We are all sorry you are going through this.  This must really suck!\n\nShe quoted Scripture - you should quote Shakespeare\n\n*How sharper than a serpent’s tooth it is to have a thankless child (King Lear)*\n\nThen simply state that she has broken your trust, and your heart.  \nYou are done.  If you have prepaid anything - she is free to keep that - but you will not see her again.  \n\nIf she mentions Extortion tell her that your attorney suggested she should write a letter stating her amount for her silence - and that she makes a legally binding promise not to come back for more money again.  Otherwise why would you trust her to not come back for more? If she is not paid she would reveal \"XYZ\" about you. \n\nThis is of course total BULLSHIT - but she does not sound extremely bright :D \n\nThis would her be putting her extortion demands into writing.   \nIf she were to even look sideways at you again - you would give that letter to the DA and she WOULD be prosecuted for Felony Extortion and face 1-10 in the State Pen   \n[https://www.georgiacriminallawyer.com/theft-by-extortion](https://www.georgiacriminallawyer.com/theft-by-extortion)\n\nWhat a pity she had to be a nasty little scammer - and not very bright about it.",
            "author": "sd424242",
            "id": "in3q8s8",
            "parent_id": "t3_x5u8ys",
            "score": 14,
            "created_utc": 1662325585.0,
            "replies": [
                {
                    "body": "Love The Bard quote! And that you're helping OP fight fire with fire- impressive!",
                    "author": "Grand_Photograph4081",
                    "id": "in4vr03",
                    "parent_id": "t1_in3q8s8",
                    "score": 2,
                    "created_utc": 1662344853.0,
                    "replies": []
                },
                {
                    "body": "Don't trust your soul to no backwoods southern lawyer...\n\nSounds like she'll be one of the next 87,000 IRS agents when this sb thing doesn't work out. Thankfully she wasn't devious enough to play the long game. \n\nHope the next one is better!",
                    "author": "akbbgtc",
                    "id": "in52uhi",
                    "parent_id": "t1_in3q8s8",
                    "score": 1,
                    "created_utc": 1662348294.0,
                    "replies": []
                },
                {
                    "body": "🏆🏆🏆🏆",
                    "author": "Turpitudia79",
                    "id": "in54vzv",
                    "parent_id": "t1_in3q8s8",
                    "score": 0,
                    "created_utc": 1662349366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Honestly, I don’t think I can continue this arrangement now\n\nHow is that even still an option in your mind?  Like wtf are you doing dude?",
            "author": null,
            "id": "in3snfc",
            "parent_id": "t3_x5u8ys",
            "score": 12,
            "created_utc": 1662326609.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "in3mysu",
            "parent_id": "t3_x5u8ys",
            "score": 16,
            "created_utc": 1662324184.0,
            "replies": [
                {
                    "body": "This. Most likely a friend put her up to it.",
                    "author": null,
                    "id": "in3o7d1",
                    "parent_id": "t1_in3mysu",
                    "score": 7,
                    "created_utc": 1662324712.0,
                    "replies": [
                        {
                            "body": "\\+1, it just feels like outside influence",
                            "author": "WynnDuppy",
                            "id": "in44jyp",
                            "parent_id": "t1_in3o7d1",
                            "score": 2,
                            "created_utc": 1662331971.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Maybe even a competing vanilla or SD\n\nwould be a hoot if it was the same \"SD mentor\" that gave fairy-wink the bad advice that she should double her PPM on the way to her first date with a new pot SD. (for anyone who remembers those stories)",
                    "author": "joc13",
                    "id": "in4w56u",
                    "parent_id": "t1_in3mysu",
                    "score": 0,
                    "created_utc": 1662345038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She sounds a little mentally unstable.",
            "author": "pinkninja-",
            "id": "in3a7an",
            "parent_id": "t3_x5u8ys",
            "score": 18,
            "created_utc": 1662318758.0,
            "replies": [
                {
                    "body": "Very mentally unstable.",
                    "author": null,
                    "id": "in3bob7",
                    "parent_id": "t1_in3a7an",
                    "score": 9,
                    "created_utc": 1662319372.0,
                    "replies": [
                        {
                            "body": "Yall are basing this on only HIS story and details. Do you normally decide on other things in life only hearing 1 side? The person likes to hear themselves talk so I reckon details may be a bit embellished for the sake of making the story more interesting.\n\nI'd personally wait before making decisions that someone is \"mentally unstable\" until I meet both parties.",
                            "author": "clair-cummings",
                            "id": "in3fwhg",
                            "parent_id": "t1_in3bob7",
                            "score": -4,
                            "created_utc": 1662321179.0,
                            "replies": [
                                {
                                    "body": "The OP’s SB isn’t here to defend herself. We can only go by what the OP is telling us. Based on what he’s telling us, his sb sounds bat shit crazy. The standard advice here would be for him to end things and move on. \n\nIf a woman posted a similar story about her SD on here we would all be telling her to run fast!",
                                    "author": null,
                                    "id": "in3gbat",
                                    "parent_id": "t1_in3fwhg",
                                    "score": 18,
                                    "created_utc": 1662321355.0,
                                    "replies": [
                                        {
                                            "body": "Mentally unstable is still a bit harsh. Perhaps there’s a meet in the middle word to describe her disgruntled behavior that doesn’t also cast a bad light on mental illness.",
                                            "author": "KingKimoi",
                                            "id": "in3hvmk",
                                            "parent_id": "t1_in3gbat",
                                            "score": -3,
                                            "created_utc": 1662322017.0,
                                            "replies": [
                                                {
                                                    "body": "Let’s see. Per the OP, his sb did the following: \nQuoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. \n\nNot sure how else to describe this woman’s behavior other than unstable? Either way, her behavior was a GIANT red flag.",
                                                    "author": null,
                                                    "id": "in3imit",
                                                    "parent_id": "t1_in3hvmk",
                                                    "score": 18,
                                                    "created_utc": 1662322337.0,
                                                    "replies": [
                                                        {
                                                            "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
                                                            "author": "GlitterAndSugar",
                                                            "id": "in3ssbq",
                                                            "parent_id": "t1_in3imit",
                                                            "score": 2,
                                                            "created_utc": 1662326666.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                                                                    "author": null,
                                                                    "id": "in3sw8v",
                                                                    "parent_id": "t1_in3ssbq",
                                                                    "score": 6,
                                                                    "created_utc": 1662326712.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
                                                            "author": null,
                                                            "id": "in3rosu",
                                                            "parent_id": "t1_in3imit",
                                                            "score": 1,
                                                            "created_utc": 1662326206.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
                                                            "author": "KingKimoi",
                                                            "id": "in3jktt",
                                                            "parent_id": "t1_in3imit",
                                                            "score": 1,
                                                            "created_utc": 1662322753.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                                                                    "author": "Fabulous_Storm2437",
                                                                    "id": "in4g5gc",
                                                                    "parent_id": "t1_in3jktt",
                                                                    "score": -1,
                                                                    "created_utc": 1662337474.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                                                                            "author": "KingKimoi",
                                                                            "id": "in4h0ft",
                                                                            "parent_id": "t1_in4g5gc",
                                                                            "score": 1,
                                                                            "created_utc": 1662337872.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You are grasping at anything to make the girl look less bad. And somehow in SB posts no one requests both sides since this is an anonymous forum.",
                                    "author": null,
                                    "id": "in4hfu6",
                                    "parent_id": "t1_in3fwhg",
                                    "score": 5,
                                    "created_utc": 1662338071.0,
                                    "replies": []
                                },
                                {
                                    "body": "I don't see any possible way to make this not come off as greedy and a bit unhinged. She literally researched him, cyber stalked him, and then demanded more money.\n\nEven if we had her side it would be pretty hard to back track from this.",
                                    "author": "HeilerinVonDoom",
                                    "id": "in4kdiw",
                                    "parent_id": "t1_in3fwhg",
                                    "score": 6,
                                    "created_utc": 1662339423.0,
                                    "replies": [
                                        {
                                            "body": "The guy is clearly telling the story and doing some embellishments for the sake of entertainment and telling an entertaining tale.\n\nI don't think its \"cyber stalking\" to look someone you are dating up. Who doesn't do this? Unhinged for doing that? Really? That is pretty common practice and like he said, whats out there isn't some giant secret that only a secret agent could uncover.\n\nShe may be greedy, possibly not. He hasn't said how much he gives her or what he expects from that. Furthermore, we don't have any further details on how hot she is or if she is quite capable of easily getting more from other men. Perhaps she went about it the wrong way....again, we only have his side to hear.",
                                            "author": "clair-cummings",
                                            "id": "in53n0q",
                                            "parent_id": "t1_in4kdiw",
                                            "score": 1,
                                            "created_utc": 1662348701.0,
                                            "replies": [
                                                {
                                                    "body": "Um... Looking dudes stocks up, where he works, finding his place of employment... All red flags.\nIf you don't find this weird then you have similar red flags.",
                                                    "author": "HeilerinVonDoom",
                                                    "id": "in53wgk",
                                                    "parent_id": "t1_in53n0q",
                                                    "score": 4,
                                                    "created_utc": 1662348841.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
                                                            "author": "clair-cummings",
                                                            "id": "in6cfm1",
                                                            "parent_id": "t1_in53wgk",
                                                            "score": 2,
                                                            "created_utc": 1662380644.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                                                                    "author": "Positive-Daddy-594",
                                                                    "id": "in7kdka",
                                                                    "parent_id": "t1_in6cfm1",
                                                                    "score": 2,
                                                                    "created_utc": 1662399848.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                                                                            "author": "clair-cummings",
                                                                            "id": "in7rp2d",
                                                                            "parent_id": "t1_in7kdka",
                                                                            "score": 2,
                                                                            "created_utc": 1662402826.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Narrator: she does.",
                                                            "author": "YlangScent",
                                                            "id": "in5rf92",
                                                            "parent_id": "t1_in53wgk",
                                                            "score": 1,
                                                            "created_utc": 1662364322.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes we do. All the time--especially on reddit.",
                                    "author": "zapzangboombang",
                                    "id": "ina21p0",
                                    "parent_id": "t1_in3fwhg",
                                    "score": -1,
                                    "created_utc": 1662441769.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What someone earns and what their Sugar Budget is are two completely different things. They don't necessarily correlate.\n\nShe got greedy and it's her loss.",
            "author": "ShaArt5",
            "id": "in3cxsz",
            "parent_id": "t3_x5u8ys",
            "score": 16,
            "created_utc": 1662319915.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "in3arrl",
            "parent_id": "t3_x5u8ys",
            "score": 12,
            "created_utc": 1662318995.0,
            "replies": [
                {
                    "body": "Had a skim. Jfc what even is that cesspool echo chamber. It Reads exactly like female dating strategy.",
                    "author": "xa3D",
                    "id": "in3bxxz",
                    "parent_id": "t1_in3arrl",
                    "score": 2,
                    "created_utc": 1662319485.0,
                    "replies": [
                        {
                            "body": "Brilliant comparison.  That is exactly what it is, female dating strategy applied to sugar, with a hyper focus on optimizing payments, and I suppose there's enough of the occasional scam or other discussion that the weak-minded can't see it for what it very obviously is.",
                            "author": "WynnDuppy",
                            "id": "in45p02",
                            "parent_id": "t1_in3bxxz",
                            "score": 1,
                            "created_utc": 1662332512.0,
                            "replies": []
                        },
                        {
                            "body": "From my cursory glance, it’s mainly a bunch of bitter SW that hate men, view you as a trick, and pat each other on the back about knowing their “worth.”",
                            "author": "ThinAvocadoToast",
                            "id": "in3cfl3",
                            "parent_id": "t1_in3bxxz",
                            "score": 0,
                            "created_utc": 1662319695.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I thought this same thing whenever she used the word whale lol.",
                    "author": null,
                    "id": "in3fmho",
                    "parent_id": "t1_in3arrl",
                    "score": 1,
                    "created_utc": 1662321061.0,
                    "replies": []
                },
                {
                    "body": "There are some ruthless women on there!!!",
                    "author": null,
                    "id": "in3hs1h",
                    "parent_id": "t1_in3arrl",
                    "score": 2,
                    "created_utc": 1662321974.0,
                    "replies": []
                },
                {
                    "body": "That and some of those sugar baby books in circulation.",
                    "author": "southernslick",
                    "id": "in3dq3c",
                    "parent_id": "t1_in3arrl",
                    "score": 1,
                    "created_utc": 1662320251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is over, even if she realizes how ridiculous she was being and tries to reverse course it will never be the same for either of you.\n\nIf you are paying more than the average allowance for your area you will be easily able to find someone better than her in every aspect, don't let the bit of effort it will take to do so lead you into holding onto this toxic arrangement.",
            "author": "storm170",
            "id": "in3airc",
            "parent_id": "t3_x5u8ys",
            "score": 14,
            "created_utc": 1662318892.0,
            "replies": [
                {
                    "body": "More than the average allowance based on how much research and what data though? I'd have to know the actual number to say for sure. Also, how attractive is this person and how easy will it be for her to pull others? That makes a difference too.",
                    "author": "clair-cummings",
                    "id": "in3g6dd",
                    "parent_id": "t1_in3airc",
                    "score": 6,
                    "created_utc": 1662321296.0,
                    "replies": [
                        {
                            "body": "I was going to say this as well. SDs love to say that their allowance/ ppm/whatever is more than average or substantial but I’m always curious to know where they got those numbers from. \n\nI think since this is only the SDs point of view we won’t really ever know if she’s maybe struggling or there’s some reason for her to be so reactive",
                            "author": "KingKimoi",
                            "id": "in3i9tj",
                            "parent_id": "t1_in3g6dd",
                            "score": 13,
                            "created_utc": 1662322186.0,
                            "replies": []
                        },
                        {
                            "body": "None of what the OP said about his SB screams giant red flag to you?",
                            "author": null,
                            "id": "in3gl8v",
                            "parent_id": "t1_in3g6dd",
                            "score": 7,
                            "created_utc": 1662321473.0,
                            "replies": [
                                {
                                    "body": "There’s at the very least a few orange ones , maybe there’s cause for her triggered outburst ? I’d like to believe there’s a reason for a seemingly great arrangement to feel like she had to go researching on her SD to begin with , that doesn’t scream trust and open communication from either sides.",
                                    "author": "KingKimoi",
                                    "id": "in3il77",
                                    "parent_id": "t1_in3gl8v",
                                    "score": 5,
                                    "created_utc": 1662322321.0,
                                    "replies": [
                                        {
                                            "body": "Sorry, but per the OP, his sb did the following: Quoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. All of those are giant red flags, not orange. \n\nIf a SB on here told the story about her SD behaving like this at dinner, we would all be telling her to run fast. \n\nEither way, sounds like their SR is over and both should end things.",
                                            "author": null,
                                            "id": "in3iqvf",
                                            "parent_id": "t1_in3il77",
                                            "score": 9,
                                            "created_utc": 1662322391.0,
                                            "replies": [
                                                {
                                                    "body": "I am very curious if either of them are religious and also what scripture would be appropriate for such an incident 😂",
                                                    "author": "KingKimoi",
                                                    "id": "in3k86z",
                                                    "parent_id": "t1_in3iqvf",
                                                    "score": 3,
                                                    "created_utc": 1662323025.0,
                                                    "replies": [
                                                        {
                                                            "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
                                                            "author": "WaterJourney67",
                                                            "id": "in3so0v",
                                                            "parent_id": "t1_in3k86z",
                                                            "score": 4,
                                                            "created_utc": 1662326616.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                                                                    "author": "KingKimoi",
                                                                    "id": "in4344o",
                                                                    "parent_id": "t1_in3so0v",
                                                                    "score": 3,
                                                                    "created_utc": 1662331295.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                                                                    "author": null,
                                                                    "id": "inahztc",
                                                                    "parent_id": "t1_in3so0v",
                                                                    "score": 2,
                                                                    "created_utc": 1662454233.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "No I completely agree both seem to not be on the same page anymore and should revisit their arrangement. I want to just be hopeful and give her the benefit of the doubt since it seemed like before they were an ideal match.",
                                                    "author": "KingKimoi",
                                                    "id": "in3k11b",
                                                    "parent_id": "t1_in3iqvf",
                                                    "score": 1,
                                                    "created_utc": 1662322942.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It’s too obvious! The same crowd will throw a huge fit if the ppm was off by twenty dollars.",
                                    "author": null,
                                    "id": "in3q7dq",
                                    "parent_id": "t1_in3gl8v",
                                    "score": 2,
                                    "created_utc": 1662325569.0,
                                    "replies": [
                                        {
                                            "body": "Lol 100%.",
                                            "author": null,
                                            "id": "in3qbob",
                                            "parent_id": "t1_in3q7dq",
                                            "score": 1,
                                            "created_utc": 1662325620.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Based on the same data SBs use to gauge their numbers. It is a two sided game. 😀",
                            "author": "gapaf",
                            "id": "in3idrr",
                            "parent_id": "t1_in3g6dd",
                            "score": 6,
                            "created_utc": 1662322232.0,
                            "replies": []
                        },
                        {
                            "body": "If you ask 100 women what they would like to receive for an arrangement you describe to then you have all the research and data you need to know what the average allowance is.\n\nYou wanting to decide whether that number is correct or not based on your own standards has no actual place in determining what is or is not average.",
                            "author": "storm170",
                            "id": "in3kr9l",
                            "parent_id": "t1_in3g6dd",
                            "score": 1,
                            "created_utc": 1662323252.0,
                            "replies": [
                                {
                                    "body": "100%",
                                    "author": null,
                                    "id": "in3nu63",
                                    "parent_id": "t1_in3kr9l",
                                    "score": 2,
                                    "created_utc": 1662324554.0,
                                    "replies": []
                                },
                                {
                                    "body": "No, you would have to survey 100 people that are actually in arrangements, not just asking them what they would like to receive. They might like to receive a whole hell of a lot but they may never get it. It takes both sides to come to an agreement and an allowance to actually change hands.",
                                    "author": "Ryan111778",
                                    "id": "in40ab7",
                                    "parent_id": "t1_in3kr9l",
                                    "score": -3,
                                    "created_utc": 1662329979.0,
                                    "replies": [
                                        {
                                            "body": "You exclude outliers on both ends, both the women with unrealistic expectations and those desperate enough to accept nearly anything. It still produces a distribution you can feel comfortable with.",
                                            "author": "storm170",
                                            "id": "in40r46",
                                            "parent_id": "t1_in40ab7",
                                            "score": -2,
                                            "created_utc": 1662330190.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "For savvy SDs this is an open and shut case, lady has to be fired period.",
                            "author": null,
                            "id": "in3q16f",
                            "parent_id": "t1_in3g6dd",
                            "score": 2,
                            "created_utc": 1662325495.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's the 3 month rule. Never fails.",
            "author": "Full_Bid8706",
            "id": "in454zk",
            "parent_id": "t3_x5u8ys",
            "score": 7,
            "created_utc": 1662332248.0,
            "replies": [
                {
                    "body": "Yeah what is it about 3 months?!",
                    "author": null,
                    "id": "in640rw",
                    "parent_id": "t1_in454zk",
                    "score": 3,
                    "created_utc": 1662374909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Au revoir greedy SB!\n\nI'd give her the boot for just the craziness alone, but the trying to renegotiate things purely based off of greed vs. need would 100% cause me to give the axe.",
            "author": "BigBearSD",
            "id": "in3mklc",
            "parent_id": "t3_x5u8ys",
            "score": 8,
            "created_utc": 1662324021.0,
            "replies": []
        },
        {
            "body": "She been reading books, watching youtube videos, and running around in those other subs on reddit. That's a SB play to extract more money from you. And use manipulation to get you see it her way. Don't fall for that shit.  \n\n\nShe's bluffing. End the relationship and don't put up with those sugarbaby playbook games. She is hoping you fold and up what you getting her. Don't. End the shit. If you want to give her a severance package do it.  But pulling this type of stunt is instant next.",
            "author": "southernslick",
            "id": "in3dli7",
            "parent_id": "t3_x5u8ys",
            "score": 10,
            "created_utc": 1662320197.0,
            "replies": []
        },
        {
            "body": "I'm trying to be the devil's advocate here, but I have no words to defend the SB. Damn what went on in her mind? Disposable income for sugar is something else, these girls can't count!",
            "author": "sugardad123",
            "id": "in3ms4o",
            "parent_id": "t3_x5u8ys",
            "score": 7,
            "created_utc": 1662324107.0,
            "replies": [
                {
                    "body": "This!! I have second hand embarrassment for her. Luckily he flushed out her crazy potential early on. Run for the hills my guy. She’s trouble!",
                    "author": "TX_SB",
                    "id": "in3z81v",
                    "parent_id": "t1_in3ms4o",
                    "score": 4,
                    "created_utc": 1662329495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In summary, your SB found out you probably have more money than you let on and was upset because she thinks you can afford to be more generous. \n\nIn some ways I completely get where she is coming from, she’s hurt because she feels like she’s putting her all into the SR and it feels like you’ve been holding back. Honestly she was probably in such a state that she didn’t know wether to laugh about how much of a fool she feels she was thinking that you were giving the relationship your all as well or just sad that you looked her in the eyes and had the ability to help her more, but chose not to.\n\n**With that said, I still don’t think the way she went about asking for an increased allowance was right. **\n\nThe papers she printed were more for her own assurance than anything else and it shows she was likely feeling a lot of anxiety and felt she needed the papers in case you tried to deny it, but those papers and her knowledge of your money shouldn’t have been used as her justification for a raise in her allowance, but more so an assurance that you could afford an increased allowance. She completely came at this conversation the wrong way.\n\nBut what’s done is done. Words were exchanged and this SR is toast. She would never be okay taking what now seems like a measly allowance from you in exchange for all her effort and you’re never going to see her the same after feeling like you just got a shake-down and threatened to provide more money.\n\nSevere the ties and let this one go.",
            "author": "GlitterAndSugar",
            "id": "in3s8wx",
            "parent_id": "t3_x5u8ys",
            "score": 13,
            "created_utc": 1662326441.0,
            "replies": [
                {
                    "body": "And that's why it's important to realize that wealth encompasses more than just dollar amounts. Even the richest have budgets and amounts they don't want to go over, even if those budgets are unfathomable to many of us. \n\nShe could have handled this in so many different ways, for sure.",
                    "author": "ShaArt5",
                    "id": "in57skm",
                    "parent_id": "t1_in3s8wx",
                    "score": 2,
                    "created_utc": 1662350953.0,
                    "replies": []
                },
                {
                    "body": "In concept, I agree with you, however I don’t understand where anyone can realistically think that a SR should be some kind of percentage of a SD’s income. It’s ultimately a business deal to start with, and what is agreed upon is acceptable to both parties.\n   Also looking at a stock sale says nothing without knowing the cost basis. I could sell 2 million dollars of stock that shows up in a public record that I paid 3.5 million dollars for.",
                    "author": "Positive-Daddy-594",
                    "id": "in7nvse",
                    "parent_id": "t1_in3s8wx",
                    "score": 0,
                    "created_utc": 1662401264.0,
                    "replies": [
                        {
                            "body": "I never said anything about a SR being a certain percentage of someone’s income.\n\nFor all we know he could have turned around and donated every last cent of his money to charity or tied it up in a new investment, but that’s clearly not her thinking, her inexperience and ignorance is showing in how she chose to deal with the knowledge of the money he *might* have.",
                            "author": "GlitterAndSugar",
                            "id": "in7oidi",
                            "parent_id": "t1_in7nvse",
                            "score": 6,
                            "created_utc": 1662401522.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ll take the counter position. \n\nArrangements are a mind fuck for both parties for a lot of reasons and it takes experience and patience to create a smooth arrangement. I blew a lot of great opportunities early on due to freaking out over things that I wouldn’t even notice these days. I’m not saying what she did was right, but since you met her in the wild, she even has less mental guardrails and frame of references to navigate an arrangement than you do. Also she has no idea what a fair allowance is and all of the sudden feels paranoid that you’ve been taking advantage of her. Since she’s new, she doesn’t realize you’ve actually been generous. \n\nI’d consider taking a short break from sugaring to reset and revisit after her 3rd apology.\n\nFor context, what’s her age and what’s yours?",
            "author": "mike_o212",
            "id": "in6ab1f",
            "parent_id": "t3_x5u8ys",
            "score": 3,
            "created_utc": 1662379358.0,
            "replies": [
                {
                    "body": "Lol I like your interpretation of the situation",
                    "author": "clair-cummings",
                    "id": "ina4eto",
                    "parent_id": "t1_in6ab1f",
                    "score": 2,
                    "created_utc": 1662443366.0,
                    "replies": []
                },
                {
                    "body": "I'm 55. She's 33.",
                    "author": "WaterJourney67",
                    "id": "inh5mog",
                    "parent_id": "t1_in6ab1f",
                    "score": 1,
                    "created_utc": 1662571751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This poor girl must have some envy friends, possible a jealous BFF, that has to be some Satan whispers. \nAnyway, she is an ocean of red flags. But two things got my extra attention.Her mention of SEC  forms, it sounded like extortion and second when she said she would go to your workplace, i would classify it as a direct threat. \nCut her off immediately. No more meetings or talking. Block her and explicitly tell security about her and forbidden her entrance. At the first attempt, if she ever comes to it, call the police.",
            "author": "gapaf",
            "id": "in3jhzd",
            "parent_id": "t3_x5u8ys",
            "score": 12,
            "created_utc": 1662322719.0,
            "replies": [
                {
                    "body": "Tell security what, exactly? That his twentysomething ex-girlfriend might show up? Telling them that is as bad as if she did show up. \n\nCall the police by all means, but police reports and criminal complaints are public records in GA. \n\nA simple FOIA request is all that’s needed to obtain a copy.",
                    "author": "nonsumqualiseramSBF",
                    "id": "in3zsbm",
                    "parent_id": "t1_in3jhzd",
                    "score": 2,
                    "created_utc": 1662329749.0,
                    "replies": [
                        {
                            "body": "Tell security to not allow her in. Not saying it will get to this, but If it gets to the point he needs to call the police, why would you be worried with the tracking?",
                            "author": "gapaf",
                            "id": "in46ax9",
                            "parent_id": "t1_in3zsbm",
                            "score": 1,
                            "created_utc": 1662332799.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"\"\"\"The hardest part was that I had developed real feelings for her, and I feel incredibly foolish right now. As they say, “there’s no fool like an old fool.”\"\"\"\n\nGoes back to the old saying \"others compare your gross with their net income\".  \n\nquestion - is the amount a matter of her ego or some critical need or a true unreasonably low allowance. \n\nAlternative -  Imagine a valued employee came in and gave a similar demand......  would you sit them down and explain the facts of life.  \n\nPerhaps something to the effect that   1)  she is wonderful and appreciated  2)  her allowance is above normal for the area  3) perhaps a token adjustment.\n\nObviously your time is valuable ,  think of the thousands in lost time to replace her.",
            "author": "pinotandsugar",
            "id": "in39wqn",
            "parent_id": "t3_x5u8ys",
            "score": 8,
            "created_utc": 1662318633.0,
            "replies": [
                {
                    "body": ">Alternative - Imagine a valued employee came in and gave a similar demand...... would you sit them down and explain the facts of life.\n\nValued or not, threatening extortion and blackmail is immediate firing",
                    "author": null,
                    "id": "in3s0qb",
                    "parent_id": "t1_in39wqn",
                    "score": 4,
                    "created_utc": 1662326347.0,
                    "replies": []
                },
                {
                    "body": "This has been the grand calculus going through my mind the past 48 hours. She certainly never presented any acute need, although that would at least inform the situation. It was all based on my perceived ability. \n\nHonestly, it would be much easier if this were an employee, but I never viewed her as that. It was all supposed to be mutually beneficial. Then it blew up.",
                    "author": "WaterJourney67",
                    "id": "in3tuch",
                    "parent_id": "t1_in39wqn",
                    "score": 4,
                    "created_utc": 1662327127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a feeling if you break up with her, she will go PSYCHO on you. Like make threats, blackmail etc. \n\nProceed with caution and keep us posted.",
            "author": null,
            "id": "in3bujp",
            "parent_id": "t3_x5u8ys",
            "score": 8,
            "created_utc": 1662319444.0,
            "replies": []
        },
        {
            "body": "Honestly move on. I always tell a girl\" tell me what your comfortable with\" because it's not what I can offer it's what she needs on some rare occasions  I have increased  what she asked for because she had  undervalued herself. So to come right out and request it is horrible. What a true SB would have done is turned on the charm the sexynes and intmacy and made sure you knew what she had then asked for an allowance raise.",
            "author": "Delicious-Ad6771",
            "id": "in3l0eb",
            "parent_id": "t3_x5u8ys",
            "score": 6,
            "created_utc": 1662323362.0,
            "replies": []
        },
        {
            "body": "This reads like a story, not a legit experience.\n\nIf it's legit, just move on. There is no fixing this situation. If you start providing more, you will be bitter as you are paying more than you feel is fair; you will become a prick, feel dissatisfied, be more demanding, or likely a combination of the three. If you don't provide her the higher allowance she is asking for, she will feel like you are taking advantage of her and that you are stingy; she will be feeling justified to skip meets, find another SD, etc. If you both compromise, neither of you will end up happy with the situation. Basically, she killed the relationship and it's time for you to move on.",
            "author": "AShatteredKing",
            "id": "in3czjh",
            "parent_id": "t3_x5u8ys",
            "score": 7,
            "created_utc": 1662319936.0,
            "replies": []
        },
        {
            "body": "Before you toss her over the cliff consider the possibility that she is getting bad information from a girlfriend.  It is easy for young people (and all of us) to get on the wrong track.  \n\nPeople are prone to compare their net with your gross.  \n\nShe sounds like a desirable SB (other than this issue) .  \n\nRecommendation is a casual lunch to discuss.  Explain to her the reality that she is receiving an unusually generous allowance because you think she is special and you like her as a person. \n\nYou want to be fair with her and feel you are doing that.  You care about her and hope you can continue but the probing and demands are out of line. But also if she feels victimized by the relationship you should not continue.",
            "author": "pinotandsugar",
            "id": "in54gca",
            "parent_id": "t3_x5u8ys",
            "score": 4,
            "created_utc": 1662349136.0,
            "replies": [
                {
                    "body": "Any of that went out the door when she threatened to show up at his work if he didn’t comply.\n\n9/10 times that I have continued to associate with someone who has broadcasted that they have vindictively crazy thoughts like that, I’ve come to regret it.",
                    "author": "New_SDthrowaway",
                    "id": "in9kruh",
                    "parent_id": "t1_in54gca",
                    "score": 1,
                    "created_utc": 1662432035.0,
                    "replies": [
                        {
                            "body": "I had overlooked the threat",
                            "author": "pinotandsugar",
                            "id": "in9sbn0",
                            "parent_id": "t1_in9kruh",
                            "score": 1,
                            "created_utc": 1662435907.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> She quoted scripture at me. \n\nwhoah!  stop the presses... must know more about this!\n\nThis is the point in the conversation where I would turn from serious to comically amused 😂",
            "author": "robhudsondfw",
            "id": "in3dxoc",
            "parent_id": "t3_x5u8ys",
            "score": 5,
            "created_utc": 1662320342.0,
            "replies": []
        },
        {
            "body": "Cookoo has been unlocked.   You cant put that shit back either!",
            "author": "gearhead860",
            "id": "in3oul6",
            "parent_id": "t3_x5u8ys",
            "score": 4,
            "created_utc": 1662324990.0,
            "replies": []
        },
        {
            "body": "This is why I never tell my SB any real information about me. Not my real name, not the company I work for, not the town I live in, nothing. All they need to know is that I am nice and that I pay them on time.",
            "author": "SD23980938",
            "id": "in4gvhv",
            "parent_id": "t3_x5u8ys",
            "score": 5,
            "created_utc": 1662337809.0,
            "replies": [
                {
                    "body": "Yes this is an under discussed aspect of the lifestyle \n\nPeople virtue shame on “secrecy “ and “hiding “ - but you just can’t know anyone that well meeting them for a few months.\n\nUltimate virtue in this lifestyle imo is being a gentleman and honoring your commitments and helping someone in need …\n\n…and not being a completely open book for opportunistic manipulation and blackmail - people get tempted no matter how good their initial intentions",
                    "author": "OCbird22",
                    "id": "in4p8ca",
                    "parent_id": "t1_in4gvhv",
                    "score": 6,
                    "created_utc": 1662341730.0,
                    "replies": []
                },
                {
                    "body": "the SB from the OP must have been reading the same sub as a girl in the \"Ask a Stupid Question\" thread who said she had read that a SB is supposed to get a guy's name and do a background check on him to make sure he has enough money.\n\nbut she said she would be unwilling to let him do a background check on her.",
                    "author": "joc13",
                    "id": "in4xvhp",
                    "parent_id": "t1_in4gvhv",
                    "score": 2,
                    "created_utc": 1662345858.0,
                    "replies": []
                },
                {
                    "body": "Wisest thing to do although that approach is frowned upon on this forum. Better to be safe than sorry. Also yea I love to pay them to stay at arms length.",
                    "author": null,
                    "id": "in6j9k1",
                    "parent_id": "t1_in4gvhv",
                    "score": 0,
                    "created_utc": 1662384325.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Firstly; bless you for the eloquence and top tier diction. I went back and read this a second time, once with my pinky out as I sipped a late night cortatido.\nSecondly; as they say in the south, “bless your heart!” For so many reasons: you had the grace to sit there and listen to hear (from what I can gather), poke at some of the holes in the logic behind it (a smile lingers at the [restaurant] quip), and then ultimately advise that you needed time to reflect, only to realize that your heart is •indeed• involved. That is never easy to weave in and out of.\n\nI, of course, have my own (unsolicited) two cents to toss in here, but the main question is: do you feel that you could take an opportunity to ask her questions that are guided towards her unveiling her reasons behind the shake up of what was —for all intents and purposes— a great thing?\n\nTotally hear you on the sea of SA minefields being the least desirable alternative; so perhaps just a wee bit of effort here in what outcome you would ideally like from this outburst?",
            "author": "Sugar_Madomme",
            "id": "in4xmg4",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662345737.0,
            "replies": [
                {
                    "body": "I think I would like to unpack this with her, but I need a few days before I do.",
                    "author": "WaterJourney67",
                    "id": "in5j55l",
                    "parent_id": "t1_in4xmg4",
                    "score": 2,
                    "created_utc": 1662358086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Difficult for her??? 😵‍💫😵‍💫😵‍💫😵‍💫",
            "author": "nuitbelle",
            "id": "in5bw8u",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662353357.0,
            "replies": []
        },
        {
            "body": "Offer to pay for her to see a therapist weekly, she needs it.",
            "author": "Critical_You_9299",
            "id": "inl1jzg",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662642535.0,
            "replies": []
        },
        {
            "body": "Babe, I sugar dade to avoid this kind of drama, best of luck to you.  Maybe you can negotiate some sort of profit sharing deal with your new sugar daddy.",
            "author": "LotBuilder",
            "id": "in448i0",
            "parent_id": "t3_x5u8ys",
            "score": 5,
            "created_utc": 1662331819.0,
            "replies": []
        },
        {
            "body": ">hinted that she might show up at my work\n\nShe negotiates through threats. This is something I do to make fictional characters more sinister. In real life? Walk away. Bad faith = relationship over. Otherwise, you'll perpetuate this cycle. Use the time to reflect on how to find someone better, as well as how to better one's own relationship skills.",
            "author": null,
            "id": "in3nnyl",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662324481.0,
            "replies": []
        },
        {
            "body": "As a SB, it sounds to me like she got super greedy and went about this in a completely horrible way. I’m sorry this happened to you.",
            "author": null,
            "id": "in3vwzd",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662328028.0,
            "replies": []
        },
        {
            "body": "So the amount she agreed to initially now isnt enough now that she thinks you have more money. So it was all about what you could pay and not what her value was.",
            "author": "Fabulous_Storm2437",
            "id": "in4hb5g",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662338010.0,
            "replies": []
        },
        {
            "body": "My goodness! Atlanta is wild. Sorry that happened to you.",
            "author": "chaoticfindswitch",
            "id": "in3c8vo",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662319616.0,
            "replies": []
        },
        {
            "body": "Unfortunately, even if she back tracks, she will never feel the same because she will always feel like you are holding out on her and giving her less than what you are worth. Time to move on to someone hotter.",
            "author": "malcolm_reyn0lds",
            "id": "in3ndfx",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662324358.0,
            "replies": []
        },
        {
            "body": "This seems kinda scary. I suspect she's never negotiated a raise. For some, it can be difficult to not compare yourself to others or take compensation personally. She's probably not terribly experienced professionally, has some affection for you, and freaked out thinking she was mislead. \n\nOr maybe she's greedy and entitled. Either way, I can't see how this goes back to how it was.",
            "author": "honestlywandering",
            "id": "in405o4",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662329919.0,
            "replies": []
        },
        {
            "body": "“I asked her if she thought the restaurant to charge me more for our dinner as well.”\n\nLove it!",
            "author": "nwa747",
            "id": "in408nz",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662329958.0,
            "replies": []
        },
        {
            "body": "End it.\n\nYou know its the right choice.\n\nThis could easily end up being a bunny boiler situation.",
            "author": "HelloFlexJ",
            "id": "in47bis",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662333283.0,
            "replies": []
        },
        {
            "body": "She trying to harpoon you ..well then just dive deep until she can't reach.  No harm with trying to renegotiate but the way she did it irks me.  This just comes off money hungry.  Of course this is only one side of the story but I can't imagine if you were to get her pregnant or married or both.. the fangs would come out then. She is going to realize that she handled things badly but move on.",
            "author": "Federal_Garage_4307",
            "id": "in4eoel",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662336801.0,
            "replies": []
        },
        {
            "body": "just wanted to stop by and say thanks for having her off the market during the last round of searching that I did in Atlanta.\n\nshe is among the various types of crazy women that seem to find me all too easily!",
            "author": "joc13",
            "id": "in4yeqh",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662346118.0,
            "replies": [
                {
                    "body": "Just saw this comment and laughed out loud. Apparently they find both of us easily enough.",
                    "author": "WaterJourney67",
                    "id": "inh71m5",
                    "parent_id": "t1_in4yeqh",
                    "score": 1,
                    "created_utc": 1662572270.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, she sounds like a right Amber Heard. Run before she takes a real shit in your bed!",
            "author": "SugarDaddioo",
            "id": "in8xzd0",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662421427.0,
            "replies": []
        },
        {
            "body": "Hope Little Man finds a new SB soon. Dump her ASAP",
            "author": "PacoNtacos",
            "id": "in3a6mb",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662318750.0,
            "replies": []
        },
        {
            "body": "Enormous red flags... wow. Break it off now, block/ghost/whatever. Run.\n\nAnd, FWIW, many SDs, myself certainly included, could pay multiples of what we've paid SBs. That's entirely NOT the point. The point is not for SBs to be squeezing out every drop, and the point is not for SDs to feel like they're being used like some sociosexusal ATM.\n\nThe SBs who don't ever figure out this big picture are the ones who struggle to hold on to meaningful SRs... and any SB with that attitude? Jeez.\n\nLady, I may have twenty million in the bank, but it's my hard-earned money, and you're actually entitled to ZERO of it. Beyond that, let's discuss what we both feel is fair, and not a penny more or less either way. End of discussion.\n\nA re-negotiation because you're smart and know how to make money?\n\nLike I said, vanish her from your life.",
            "author": "SD_throwaway222",
            "id": "in4bsq7",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662335424.0,
            "replies": []
        },
        {
            "body": "You are not a fool. Love of any kind is never foolish. \n\nUnfortunately, she went from someone deserving of your affections to someone who isn't. I'm very sorry this happened to you.\n\nJust remember that there are many women in the Bowl and that there are others worthy of your affection. She was far from the only one. \n\nGood luck to you, no matter which direction you take.",
            "author": "ShaArt5",
            "id": "in3dnwe",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662320225.0,
            "replies": []
        },
        {
            "body": "I think if you are making stock sales that get mentioned in a public ally accessible financial report or article and you get mentioned by name: that probably means you are a whale. \n\nStill, she should have been well aware of that going in and if she agreed to the initial figure she should be happy with that.",
            "author": "Neither-Ad-2833",
            "id": "in4muzi",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662340593.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "in3a8ke",
            "parent_id": "t3_x5u8ys",
            "score": 2,
            "created_utc": 1662318773.0,
            "replies": [
                {
                    "body": "You can gtfo with that mentality.\n\nSome of us have no interest in being paid lays. We want an actual relationship. \n\nShe does not represent all of us, just like Johns don't represent all SDs.",
                    "author": "ShaArt5",
                    "id": "in3db5x",
                    "parent_id": "t1_in3a8ke",
                    "score": 5,
                    "created_utc": 1662320074.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "in3e98a",
                            "parent_id": "t1_in3db5x",
                            "score": 1,
                            "created_utc": 1662320478.0,
                            "replies": [
                                {
                                    "body": "Even then. Regardless, they are not deserving of this sneering attitude.\n\nOne of the rules of this sub is to 'Remember the human'. Do try to do that please.",
                                    "author": "ShaArt5",
                                    "id": "in3fl34",
                                    "parent_id": "t1_in3e98a",
                                    "score": 1,
                                    "created_utc": 1662321045.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "in3fusf",
                                            "parent_id": "t1_in3fl34",
                                            "score": 1,
                                            "created_utc": 1662321159.0,
                                            "replies": [
                                                {
                                                    "body": "You may not think you are, but you are implying that they are of less value. Especially with your last sentence in that post.",
                                                    "author": "ShaArt5",
                                                    "id": "in3gn87",
                                                    "parent_id": "t1_in3fusf",
                                                    "score": 1,
                                                    "created_utc": 1662321496.0,
                                                    "replies": [
                                                        {
                                                            "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
                                                            "author": "xa3D",
                                                            "id": "in3h7w6",
                                                            "parent_id": "t1_in3gn87",
                                                            "score": 1,
                                                            "created_utc": 1662321737.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "This sub believes that sugar is a relationship, not a sexual service.  We respect other opinions, but \"sugar as sexwork\" \"SB as employee / service provider\" \"SD as employer /  client\" is not appropriate for this sub.\n\nRule #12: No Escorts/Johns",
                                                    "author": "sugarlifestyleforum-ModTeam",
                                                    "id": "in3okwf",
                                                    "parent_id": "t1_in3fusf",
                                                    "score": 1,
                                                    "created_utc": 1662324875.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a shame about the feelings but perhaps a testament to you that you view her as something more than an employee. However there is zero chance that she will reciprocate based on the events you just described. She has basically told you she doesn’t care about you except for your $$ which she wants more of. Time to cut bait and find the next one.",
            "author": "sanfran4fun",
            "id": "in3jw9k",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662322885.0,
            "replies": [
                {
                    "body": "And she knew the OP had feelings and took full advantage too",
                    "author": "Fabulous_Storm2437",
                    "id": "in4gxjz",
                    "parent_id": "t1_in3jw9k",
                    "score": 2,
                    "created_utc": 1662337836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She is overstepping. I would say \"goodbye\" and block. She is not entitled to anything.",
            "author": "Undari",
            "id": "in3migq",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662323997.0,
            "replies": []
        },
        {
            "body": "Yeah, this SR is over.\n\nWhatever happens next, if you continue this SR resentment will start growing on either your, her, or both, sides. One of you will feel like they've got the short end of the stick. And that ain't gonna be pretty.\n\nHopefully she will learn a lesson from this.",
            "author": "A-touchofreality",
            "id": "in3qzbx",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662325902.0,
            "replies": []
        },
        {
            "body": "Isn’t this lifestyle meant to avoid this kind of crazy entirely?",
            "author": "MattiasMars",
            "id": "in3shok",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662326542.0,
            "replies": []
        },
        {
            "body": "End it now. You’re already giving above market price for your area. Dump her back in the market for a touch a reality. \nAlso start recording all correspondence with her. Just in case she tries to blackmail you. I get a feeling and it’s best to make sure you have receipts.",
            "author": "SW1981",
            "id": "in3szal",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662326749.0,
            "replies": []
        },
        {
            "body": "I see some people trying to “both sides” this - you know better - as u/towaylon said it is an open and shut case \n\nAs to “average “ ppm or allowance -where do i even start \n\nJust browse w the widest filters in any metro area - what do you see ? More than 2/3 of the profiles probably aren’t getting anywhere close to the averages quoted in these surveys\n\nThis is not like some minimum wage for a given position in a company - it will vary a lot depending on looks, personality etc \n\nOnly the OP knows his options given he has been doing this in his metro area and has probably other arrangement offers - he can decide what’s a good allowance- because that’s what works for the level of SB he wants",
            "author": "OCbird22",
            "id": "in3vxym",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662328041.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "in41g8n",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662330513.0,
            "replies": [
                {
                    "body": "Wow, really? Must be more going on that that! Of course, being too keen is a big mistake. Well too often at least. You lose respect and they feel you're being a bit needy?",
                    "author": null,
                    "id": "in647xa",
                    "parent_id": "t1_in41g8n",
                    "score": 0,
                    "created_utc": 1662375064.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "in9856w",
                            "parent_id": "t1_in647xa",
                            "score": 1,
                            "created_utc": 1662426127.0,
                            "replies": [
                                {
                                    "body": "Yeah we may never know what's going through their minds. Last year I had an incredible encounter - best looking girl I've ever met off Seeking. 27, slim, petite, pretty as can be, wonderful French accent, a little bit shy...until we got to the bedroom and then fireworks. Screaming orgasms and the like. She didn't even ask for any gifts/finances. We met the next week and same again. Unbelievable. I did give her a generous gift (avearge for the area).  Following week she simply ghosted me. Ignored my whatsapp messages (yet never blocked me). So infuriating. She was the best. Never will know...BF came back on the scene? Another SD came along? Or she's just into brief encounters??",
                                    "author": null,
                                    "id": "inaiivu",
                                    "parent_id": "t1_in9856w",
                                    "score": 1,
                                    "created_utc": 1662454698.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "wait what",
                    "author": "sugarintherawr",
                    "id": "in5adsv",
                    "parent_id": "t1_in41g8n",
                    "score": 1,
                    "created_utc": 1662352456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would’ve laughed in her face and asked for the check and deaded the relationship there. I dont like being ambushed or shaken down. I immediately take a defensive posture because logically the next step I expect is extortion. (I’m a little paranoid). But yea, no thanks. What she did violates trust and comes off as greedy. I wouldn’t be surprised if someone put a battery in her back and sent her in to demand more, especially if she was more than content with your previous arrangement. Run don’t walk bud",
            "author": "Mission_Transition43",
            "id": "in4uo2h",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662344337.0,
            "replies": []
        },
        {
            "body": "Lol the sad thing about this is I’m sure if she would have been all cute and kindly asked for more allowance without being a little psycho bunny I’m sure you would have been happy to find a middle ground that felt good for both of you. Communication is everything. I recently got my SD to almost double my allowance and can kind of connect with her but it’s always hilarious to me when women think they can get their way by being psycho. Kindness goes a long way.",
            "author": "Anastasiaxoxox",
            "id": "in595bv",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662351731.0,
            "replies": []
        },
        {
            "body": "Yeah I’m an SB and I could never imagine doing this to my daddy. Obviously no woman likes to feel that you’re being stingy, but if you have a relationship that’s going well you’d trust the other person and just ask. There have been things with my SD that haven’t lined up, but if I ask open questions that aren’t accusatory he explains what I need to know and more every time. \n\nI just don’t get how people think going into a conversation in a hostile manner will lead to a peaceful outcome",
            "author": "moorehoney",
            "id": "in731zt",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662392950.0,
            "replies": []
        },
        {
            "body": "Clearly she needs a lesson in negotiation. By approaching it in the \"you have more so I deserve more\" approach, she made a mistake. She needed to have more of a connection than three months, probably years in my experience. In my experience, people that think this way can never see it any different. Everything thats been said is correct, you need to dump her. The question is the speed at which you do so and damage you can incur.\n\nTo me many if the things she said and her approach seems to indicate veiled threats, which I take to mean that you are suspectable to such things (a significant other maybe). If it is just generally being a top five in a public company but you are single, that is touch and go enough to be effective blackmail material. Let me interject with one thing. This is why I have never freestyled at all (although have considered it) as it is much more difficult to keep your identity hidden. But, that horse is out of the barn now. She seems to have gotten a little psycho and anyone that quotes scripture in my neck of the woods would absolutely be classified in that manner. But, be careful here if you have anything to lose. You should be trying to land this F-14 in the deck of the aircraft carrier in the middle of the Indian ocean, the waves are tough. You block and move on and she may try to do damage, and you slam into the front of the carrier. You meet her halfway for a month or two and then dump her for another reason and she feels emboldened by blackmailing you and you overshoot and put in the ocean on the high side. With crazy people, I tend to view always better to error on the short side and reduce exposure to them, ie cut and go. Long exposure to crazy people increases the chances of new crazy shit. But, only you can make that call. Good luck.",
            "author": "patienceisavirtue5",
            "id": "in79nys",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662395597.0,
            "replies": []
        },
        {
            "body": "She was in tears even though you’d met your side of the agreement like clockwork?\n\nShe obliquely hinted that she might try to blackmail you?\n\nDoesn’t sound very emotionally stable.",
            "author": "New_SDthrowaway",
            "id": "in7t6kn",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662403444.0,
            "replies": []
        },
        {
            "body": "I can sense some humble bragging :) \n\nBut what she has done is called a “super dick move”, which basically is made by SBs who start to think they have the SD by his balls / market cornered and their time has come to ask for a “bigger prize”.  Often this is all pre-planned. \n\nWell I have been there and I quickly replaced her with a younger upgrade. So I guess tell her to take a nice hike and goodbye. Let her go out there and find a new SD and start from scratch. See her generous allowance go to zero and hopefully least a few lessons along the way.",
            "author": null,
            "id": "in3ppda",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662325357.0,
            "replies": []
        },
        {
            "body": "I feel for you. But end it. NOW! She's got a lil bit greedy. I too experienced an SB recently, after some months of fantiastic dates with LOTS of mutual adoration, suddendly announce that what we had agreed was now offensive to her. I mean she was really quite into me and she was getting very nice dates at lovely restaurants and 5 star hotels with a guy she loved having sex with (I won't explain why I know this) AND getting a good PPM (average/slightly above average from what I can tell from the allownace thread). I don't know what made her change her mind? I cannot fathom other people's minds. But she just wanted more.",
            "author": null,
            "id": "in63l0r",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662374561.0,
            "replies": []
        },
        {
            "body": "I’d drop like a hot coal tbh.    The shakedown is bad enough but the border line stalking and hinted threats are totally unacceptable.    I’m not being off but I wouldn’t spend two mins with anyone I thought was finding a relationship with me ‘hard’\n\nMove on.   She’ll have more trouble finding something as good than you will.",
            "author": "OneMore97",
            "id": "in65815",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662375844.0,
            "replies": []
        },
        {
            "body": "Greedy SB's deserve to get dumped. This chick isn't only greedy, she is crazy too. Her behavior in the restaurant is a clue. Imagine if you'd had this conversation in private? There probably would have been screaming and item throwing. Tell her over text that you'd like to break things off, and you wish her well. Then block. Keep all messages between you two, because this is the kind of chick who will definitely go the blackmail route (or scream rape). Good luck.",
            "author": "HailToTheQuinn",
            "id": "in6ruty",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662388288.0,
            "replies": []
        },
        {
            "body": "In almost 20yrs Ive never had a SB try to increase her allowance. They’ve wanted to spend more time traveling etc… but wow, she is definitely manipulating you. Time to cut her loose, she will call back when whatever guy she is talking to turns out to be less consistent and flaky. Keep you chin up.",
            "author": "Silly-Investment-598",
            "id": "in7ap6g",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662396007.0,
            "replies": []
        },
        {
            "body": "Greed is an ugly animal to face and harder to tame. Say farewell to your SB, find a new one.",
            "author": "FerrumSagum",
            "id": "in7f8wx",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662397813.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "in3kkqq",
            "parent_id": "t3_x5u8ys",
            "score": -1,
            "created_utc": 1662323175.0,
            "replies": [
                {
                    "body": "I don't think him acting like a child is going to make things better.  Just move on, this SR has reached it's expiration date",
                    "author": "WynnDuppy",
                    "id": "in44wub",
                    "parent_id": "t1_in3kkqq",
                    "score": 1,
                    "created_utc": 1662332140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my GOD. \n\nHellllll to the no. What an entitled brat! No pussy is worth that attitude. I hope you move on and find someone so much better, hotter, and intelligent than this greedy little thing. This story is heartbreaking. Your finances are NONE of her business. Please keep us updated on how you dump her.",
            "author": null,
            "id": "in3hj9h",
            "parent_id": "t3_x5u8ys",
            "score": -2,
            "created_utc": 1662321871.0,
            "replies": []
        },
        {
            "body": "Absolutely awful \nNo way do you acquiesce to her demands. \nThat kind of research is a violation of your privacy.",
            "author": null,
            "id": "in4j8mc",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662338900.0,
            "replies": []
        },
        {
            "body": "I know it hurts, but you have to end it. She feels entitled which isn’t right. This is nuts- (coming from an SB).",
            "author": "Here4Fun4Me",
            "id": "in4kvhu",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662339647.0,
            "replies": []
        },
        {
            "body": "Wow do I empathize with this one.  You just have to harden your heart and move on.  UGH!!!",
            "author": "Learnthegamewell",
            "id": "in4lkz2",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662339974.0,
            "replies": []
        },
        {
            "body": "Greedy, entitled, and willing to make a scene in public??? She should be grateful she gets something instead of nothing. Even if you somehow get over this she will always throw it back in your face and manipulate more out of you. Move on.",
            "author": "Papichampu217",
            "id": "in4lmm3",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662339996.0,
            "replies": []
        },
        {
            "body": "Hearing your story has me a nervous wreck for you and applaud you for even finishing the meal and dealing with her shit show like a gentleman. But that shouldn’t stop you from seeking a more appreciative SB after you send this one on her way if you haven’t already.",
            "author": "39sherry",
            "id": "in4qbp5",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662342255.0,
            "replies": []
        },
        {
            "body": "I personally think she’s crazy cus wtf😂",
            "author": "official_bren",
            "id": "in4qvai",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662342519.0,
            "replies": []
        },
        {
            "body": "Best to drop her.",
            "author": "n0v0cane",
            "id": "in4x198",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662345459.0,
            "replies": []
        },
        {
            "body": "how ungrateful of her to take the arrangement for granted over an assumption about some shit she saw online\n\nshe's not the one, OP. it's time to resume the hunt",
            "author": "MissMilkerss",
            "id": "in56p66",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662350346.0,
            "replies": []
        },
        {
            "body": "She sounds like a scammer and honestly a real jerk all together... I'm sorry you had to go through that sir. If you continue this lifestyle I hope you find a more loving SB who can treat you how you really deserve.",
            "author": "TheGhostlyGirl13",
            "id": "in5gili",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662356296.0,
            "replies": []
        },
        {
            "body": "I'd say the true colors have been flown, time for a respectful retreat.. it's only going to get worse from here",
            "author": null,
            "id": "in6a0kb",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662379180.0,
            "replies": []
        },
        {
            "body": "Well fuck. She might know you before even (talking). This is how she lives her life. After your first interaction w her, she immediately started digging. This is a well thought out plan for amateurs.",
            "author": "LurkSkywalkerr",
            "id": "in6f4bs",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662382163.0,
            "replies": []
        },
        {
            "body": "Women like this get sd? Meanwhile if someone was changing my life for the better by giving me an allowance so I could put it towards necessities, I'd be appreciative and showing gratitude towards my SD \n\nLike if she wanted a raise she could've just asked nicely and if you didn't want to, just drop the subject or ask what it would take on her end to get one. \n\nJust drop her, you don't want someone entitled like this dragging your spirits down",
            "author": "slowfadinglight",
            "id": "in6ll46",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662385464.0,
            "replies": []
        },
        {
            "body": "1.  I agree that trying to continue in a relationship with her would be problematic at best.\n2. I feel quite confident that 100% of the experienced SDs here and a very high percentage of the experienced SBs here will say that her strategy was ill-conceived.\n3. The problem is that it's HER strategy and SHE has convinced herself that she \"deserves\" more. It's HER reality. \n\nMoving on, how do you extricate yourself from this SR? Are you married? If so I'd worry that this fact pattern is more likely to lead to a blackmail attempt than some others. Not to scare you -- it's just that she feels entitled and scorned and 'held-out-on.'  If not, just do a polite break-up. \n\nI know you feel \"foolish\" but I totally suspect that there was nothing you could have done to see this coming. The lifestyle COULD be just fine for you, as here the facts as you recite them put her 100% in the wrong.",
            "author": null,
            "id": "in6n2b7",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662386157.0,
            "replies": []
        },
        {
            "body": "Buddy, you're finances is none of her business. So what if you're a multimillionaire. So what if you sold stocks and made a killing. She's a SB. Not your wife. You 2 made an agreement and she should be happy with that. You said that you feel that you can't go on with this relationship. I say nor should you. Believe me. She isn't worth it.",
            "author": "Automatic_Joke_4414",
            "id": "in6yta0",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662391220.0,
            "replies": []
        },
        {
            "body": "I’m sorry that this happened to you with someone that you started to care for, but ultimately it’s a good thing that it happened this early. She thinks that she should be getting money like a spouse. She is entitled and messed up a great thing that she had. IMO, your feeling that you can’t continue is the correct answer. She’s crossed lines that can’t be uncrossed. She hasn’t given you the respect that you deserve. \n\nIn the future, I would suggest that you do not disclose your real name or information for at least 3-4 months. You need to get to know them well before disclosing personal information. I always let them know that they don’t have my real name, so I never lie to them. It’s just open communication. I expect the same from them.",
            "author": "Positive-Daddy-594",
            "id": "in7mear",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662400664.0,
            "replies": []
        },
        {
            "body": "I would tell her \"look at how much of a beating the markets have taken\" .. I was actually going to tell you that I might need to cut back because of how much financial trouble I'm in, etc, etc .. let HER break up with you vs. you breaking it off and her trying to blackmail you.",
            "author": "vince539839",
            "id": "in9zrou",
            "parent_id": "t3_x5u8ys",
            "score": 0,
            "created_utc": 1662440308.0,
            "replies": []
        },
        {
            "body": "Drop her like a hot potato! Don’t look a gift horse in the mouth lol",
            "author": "tom26461",
            "id": "in460xz",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662332667.0,
            "replies": []
        },
        {
            "body": "Definitely end it and move on.....if you are married....Definitely be ready because it sounds like she thinks you owe her something. Be ready for things to escalate.\n\n\nSuggest blocking and deleting social media pronto.",
            "author": "workaholic007",
            "id": "in59nre",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662352029.0,
            "replies": []
        },
        {
            "body": "sorry to hear about this and i’m tending to agree with the comments above - end and next SB i think",
            "author": "Jonconnerysd",
            "id": "in5j5vg",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662358099.0,
            "replies": []
        },
        {
            "body": "I would definitely consider ending this relationship. She actually sounds very controlling and this is a major red flag in any form of relationship.\n\nShe has managed to do something untrusting and at the same time is painting you to be the one who is unhonest.\n\nI believe if you continue with her she will more than likely continue increasing her demands and you will more than likely have problem after problem.\n\nI hope you don't give up your search and find someone who doesn't give you all this unnecessary stress!",
            "author": "Ill-Swimmer-7175",
            "id": "in5mko2",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662360552.0,
            "replies": []
        },
        {
            "body": "Bye-bye, right away.  Don't look back.",
            "author": "nerojt",
            "id": "in5yw5u",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662370640.0,
            "replies": []
        },
        {
            "body": "Ditch her. She ruined it.",
            "author": "YourSugarFather",
            "id": "in6g0vn",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662382656.0,
            "replies": []
        },
        {
            "body": "imo, it's bad business to ask for more money after the 'contract' is signed just because you think the the other guy can pay more. if the amount was ok one week, why is it not the next week? to me, this is a very low tactic and i would be very tempted to end the relationship entirely. she's asking for more ... how about 0? this is a business lesson that is hard earned but might serve her well in the future\n\nwhile it is a pain starting over, the trust here is gone",
            "author": "davitech73",
            "id": "ine79wx",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662514740.0,
            "replies": []
        },
        {
            "body": "Update?",
            "author": "iluvreddit",
            "id": "io2wbzy",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1662953164.0,
            "replies": []
        },
        {
            "body": "Any updates?",
            "author": "New_SDthrowaway",
            "id": "iotly2t",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1663436724.0,
            "replies": []
        },
        {
            "body": "As an experienced SB. This made me ashamed. I could never ever do that to a friend. I dont see SD as banks. They are humans and communication and negotiation is her responsibility from the start. Its not your job to tell her well in 2016 Q3 SB PPM was this much. I had to decide my own ppm price. I would sometimes ask for more to see what I can get away with. But after we agreed, then its my risk to re-negotiatie. I honestly wouldn't. Thats a very short relationship.\n\nHowever, I do suffer from BP1, I know when the mentals are not lined up you will witness multiple emotions on extremes. She's def going thru something and is in fight mode. Been there. I highly recommend you disconnect from her because a friend wouldnt talk to you like that or dig up crazy ass financial shit about u. \n\nIf I was interested in asking for a raise, I would probably do it mid-bj. I mean youre already screaming yes...",
            "author": null,
            "id": "ip9gx01",
            "parent_id": "t3_x5u8ys",
            "score": 1,
            "created_utc": 1663717170.0,
            "replies": []
        },
        {
            "body": "I’d add the lady was well aware of “real feelings” part and decided to opportunistically make her pitch.  She figured she had the SD by his balls. She also thought after likely watching a TikTok video or two that she will look really smart and well informed by bringing all this supporting documentation to make her case. Well it was super dumb on her part. \n\nThe question for OP is what’s the best way to fire her ass.",
            "author": null,
            "id": "in6ii8x",
            "parent_id": "t1_in3pe6f",
            "score": 5,
            "created_utc": 1662383947.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "in82bqh",
            "parent_id": "t1_in3pe6f",
            "score": 2,
            "created_utc": 1662407291.0,
            "replies": [
                {
                    "body": "Righteous quote!",
                    "author": "WynnDuppy",
                    "id": "in88tix",
                    "parent_id": "t1_in82bqh",
                    "score": 1,
                    "created_utc": 1662410045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100%",
            "author": "ShaArt5",
            "id": "in3ctbh",
            "parent_id": "t1_in398il",
            "score": 20,
            "created_utc": 1662319860.0,
            "replies": []
        },
        {
            "body": "Perfectly said! When You guys put yourself out there and are completely blind sided in this manner it is first off a lack of respect on her part.  You deserve more. As a SB I hold my guy to the upmost standards , just as he does for me! There is no guarantee and honesty and loyalty are very rare but it's out there. Head up, better things await you!",
            "author": "redheadedstepchild_1",
            "id": "in5p1v9",
            "parent_id": "t1_in398il",
            "score": 6,
            "created_utc": 1662362416.0,
            "replies": []
        },
        {
            "body": "“To him that knoweth to do good, and doeth it not, to him it is sin.”",
            "author": "WaterJourney67",
            "id": "in3hel8",
            "parent_id": "t1_in3b1md",
            "score": 58,
            "created_utc": 1662321815.0,
            "replies": [
                {
                    "body": "Lol awesome.",
                    "author": null,
                    "id": "in3nqip",
                    "parent_id": "t1_in3hel8",
                    "score": 12,
                    "created_utc": 1662324511.0,
                    "replies": []
                },
                {
                    "body": "greed is also a sin...",
                    "author": "gaytoradee",
                    "id": "in5ja34",
                    "parent_id": "t1_in3hel8",
                    "score": 5,
                    "created_utc": 1662358182.0,
                    "replies": [
                        {
                            "body": "One of the seven deadly sins, at that.",
                            "author": "WaterJourney67",
                            "id": "in66469",
                            "parent_id": "t1_in5ja34",
                            "score": 6,
                            "created_utc": 1662376528.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No freakin way. King James Version too. Ohmygosh— RUN! To nyc. 😉",
                    "author": "iamrosieriley",
                    "id": "in69gn8",
                    "parent_id": "t1_in3hel8",
                    "score": 0,
                    "created_utc": 1662378817.0,
                    "replies": []
                },
                {
                    "body": " 😂😂.   So she’s ( from a biblical standpoint) “sinning” with you ( I don’t really think SD/SB relationships are “sinning” unless abuse is involved), and she decides to quote biblical passages to persuade you to come across with more $$ that could potentially be quadrupled per assessment?   Just wow.   She was most likely raised fundamentalist, but she’s not a “good girl” now.",
                    "author": "stocks-mostly-lower",
                    "id": "iqw3rmw",
                    "parent_id": "t1_in3hel8",
                    "score": 1,
                    "created_utc": 1664809728.0,
                    "replies": [
                        {
                            "body": "I’m not sure the exchange between us particularly rewards logical analysis. We were both raised in fundamentalist traditions, albeit different ones.",
                            "author": "WaterJourney67",
                            "id": "ir1g5e5",
                            "parent_id": "t1_iqw3rmw",
                            "score": 1,
                            "created_utc": 1664903743.0,
                            "replies": [
                                {
                                    "body": "   Well, you put it on Reddit, so different readers will have different reactions, and look at your experiences with a variety of viewpoints based in their own backgrounds 🤷‍♀️❤️‍🔥.",
                                    "author": "stocks-mostly-lower",
                                    "id": "ir1j0n6",
                                    "parent_id": "t1_ir1g5e5",
                                    "score": 1,
                                    "created_utc": 1664904824.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you know? Obstinate is being obstructive/difficult for no reason, obdurate has a reason (character, a hard skin, toughness, standing fast for what you believe).\n\nHad to go researching this word.",
            "author": "clair-cummings",
            "id": "in3f16e",
            "parent_id": "t1_in3b1md",
            "score": 29,
            "created_utc": 1662320811.0,
            "replies": [
                {
                    "body": "Ooh, you sound like a teacher, and I like teachers!...\n\nI could quote a Rodney Dangerfield joke about teachers here, but I won't.",
                    "author": "ExperiencedMaleDom",
                    "id": "in3gnp3",
                    "parent_id": "t1_in3f16e",
                    "score": 5,
                    "created_utc": 1662321501.0,
                    "replies": [
                        {
                            "body": "Definitely felt like obdurate was a $10 word… lol",
                            "author": "Glock9prfction",
                            "id": "in5iswn",
                            "parent_id": "t1_in3gnp3",
                            "score": 2,
                            "created_utc": 1662357849.0,
                            "replies": []
                        },
                        {
                            "body": "What's the quote?",
                            "author": "clair-cummings",
                            "id": "ina2luu",
                            "parent_id": "t1_in3gnp3",
                            "score": 1,
                            "created_utc": 1662442139.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I also laughed so hard at this",
            "author": null,
            "id": "in3hliw",
            "parent_id": "t1_in3b1md",
            "score": 9,
            "created_utc": 1662321898.0,
            "replies": []
        },
        {
            "body": "Exactly this",
            "author": "jacksmith0xff",
            "id": "in68y37",
            "parent_id": "t1_in39uw2",
            "score": 1,
            "created_utc": 1662378486.0,
            "replies": []
        },
        {
            "body": "Babe, I sugar date Yesto avoid this kind of drama, best of luck to you.  Maybe you can negotiate some sort of profit sharing deal with your new sugar daddy.",
            "author": "LotBuilder",
            "id": "in44sse",
            "parent_id": "t1_in3b33y",
            "score": 4,
            "created_utc": 1662332086.0,
            "replies": []
        },
        {
            "body": "This 100% is a risk so start preparing yourself to defend any angle of act.",
            "author": "SW1981",
            "id": "in3tbwh",
            "parent_id": "t1_in3k98x",
            "score": 13,
            "created_utc": 1662326903.0,
            "replies": []
        },
        {
            "body": "Then Exactly this.",
            "author": "jacksmith0xff",
            "id": "in68z1w",
            "parent_id": "t1_in3k98x",
            "score": 2,
            "created_utc": 1662378503.0,
            "replies": []
        },
        {
            "body": "You forgot a 4th answer: run fast lol!",
            "author": null,
            "id": "in3gpzt",
            "parent_id": "t1_in3a294",
            "score": 8,
            "created_utc": 1662321528.0,
            "replies": []
        },
        {
            "body": "Lol nah there is the 4th answer too \"I've got something worse for you\". It could also get worse should he choose that in the meantime. Which some do since they don't like being single or have other reasons.",
            "author": "clair-cummings",
            "id": "in3fdwy",
            "parent_id": "t1_in3a294",
            "score": 10,
            "created_utc": 1662320960.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "WaterJourney67",
            "id": "in3hy4p",
            "parent_id": "t1_in3a294",
            "score": 3,
            "created_utc": 1662322047.0,
            "replies": []
        },
        {
            "body": "I love this! You practice LOA, huh?",
            "author": "Grand_Photograph4081",
            "id": "in4uz8n",
            "parent_id": "t1_in3a294",
            "score": 0,
            "created_utc": 1662344483.0,
            "replies": [
                {
                    "body": "Indeed. It has many names and I've studied it as far as antiquity. \n\nHermes Trismegistus is my man! I'm starting Latin course this week so I could read the manuscripts of alchemists and delve deeper.",
                    "author": "FructoseLady",
                    "id": "in5fktk",
                    "parent_id": "t1_in4uz8n",
                    "score": 1,
                    "created_utc": 1662355684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, I agree. The fact that she stalked you is weird haha",
            "author": "Sugarcookie54321_",
            "id": "in40pp5",
            "parent_id": "t1_in3lyka",
            "score": 5,
            "created_utc": 1662330172.0,
            "replies": []
        },
        {
            "body": "Renegotiating has always been, and will always be, a deal breaker",
            "author": "Blueexpression",
            "id": "in5ychc",
            "parent_id": "t1_in3lyka",
            "score": 1,
            "created_utc": 1662370167.0,
            "replies": []
        },
        {
            "body": "And quote scripture...can't forget the scripture",
            "author": "DoughnutNo8452",
            "id": "in4etvc",
            "parent_id": "t1_in45106",
            "score": 11,
            "created_utc": 1662336873.0,
            "replies": [
                {
                    "body": "If anyone ever tells me to “have a blessed day” or has a Jesus fish on their business card I immediately check for my wallet.",
                    "author": "LotBuilder",
                    "id": "in4fq4w",
                    "parent_id": "t1_in4etvc",
                    "score": 6,
                    "created_utc": 1662337286.0,
                    "replies": []
                },
                {
                    "body": "😂",
                    "author": "Grand_Photograph4081",
                    "id": "in4utbc",
                    "parent_id": "t1_in4etvc",
                    "score": 1,
                    "created_utc": 1662344405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love The Bard quote! And that you're helping OP fight fire with fire- impressive!",
            "author": "Grand_Photograph4081",
            "id": "in4vr03",
            "parent_id": "t1_in3q8s8",
            "score": 2,
            "created_utc": 1662344853.0,
            "replies": []
        },
        {
            "body": "Don't trust your soul to no backwoods southern lawyer...\n\nSounds like she'll be one of the next 87,000 IRS agents when this sb thing doesn't work out. Thankfully she wasn't devious enough to play the long game. \n\nHope the next one is better!",
            "author": "akbbgtc",
            "id": "in52uhi",
            "parent_id": "t1_in3q8s8",
            "score": 1,
            "created_utc": 1662348294.0,
            "replies": []
        },
        {
            "body": "🏆🏆🏆🏆",
            "author": "Turpitudia79",
            "id": "in54vzv",
            "parent_id": "t1_in3q8s8",
            "score": 0,
            "created_utc": 1662349366.0,
            "replies": []
        },
        {
            "body": "This. Most likely a friend put her up to it.",
            "author": null,
            "id": "in3o7d1",
            "parent_id": "t1_in3mysu",
            "score": 7,
            "created_utc": 1662324712.0,
            "replies": [
                {
                    "body": "\\+1, it just feels like outside influence",
                    "author": "WynnDuppy",
                    "id": "in44jyp",
                    "parent_id": "t1_in3o7d1",
                    "score": 2,
                    "created_utc": 1662331971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Maybe even a competing vanilla or SD\n\nwould be a hoot if it was the same \"SD mentor\" that gave fairy-wink the bad advice that she should double her PPM on the way to her first date with a new pot SD. (for anyone who remembers those stories)",
            "author": "joc13",
            "id": "in4w56u",
            "parent_id": "t1_in3mysu",
            "score": 0,
            "created_utc": 1662345038.0,
            "replies": []
        },
        {
            "body": "Very mentally unstable.",
            "author": null,
            "id": "in3bob7",
            "parent_id": "t1_in3a7an",
            "score": 9,
            "created_utc": 1662319372.0,
            "replies": [
                {
                    "body": "Yall are basing this on only HIS story and details. Do you normally decide on other things in life only hearing 1 side? The person likes to hear themselves talk so I reckon details may be a bit embellished for the sake of making the story more interesting.\n\nI'd personally wait before making decisions that someone is \"mentally unstable\" until I meet both parties.",
                    "author": "clair-cummings",
                    "id": "in3fwhg",
                    "parent_id": "t1_in3bob7",
                    "score": -4,
                    "created_utc": 1662321179.0,
                    "replies": [
                        {
                            "body": "The OP’s SB isn’t here to defend herself. We can only go by what the OP is telling us. Based on what he’s telling us, his sb sounds bat shit crazy. The standard advice here would be for him to end things and move on. \n\nIf a woman posted a similar story about her SD on here we would all be telling her to run fast!",
                            "author": null,
                            "id": "in3gbat",
                            "parent_id": "t1_in3fwhg",
                            "score": 18,
                            "created_utc": 1662321355.0,
                            "replies": [
                                {
                                    "body": "Mentally unstable is still a bit harsh. Perhaps there’s a meet in the middle word to describe her disgruntled behavior that doesn’t also cast a bad light on mental illness.",
                                    "author": "KingKimoi",
                                    "id": "in3hvmk",
                                    "parent_id": "t1_in3gbat",
                                    "score": -3,
                                    "created_utc": 1662322017.0,
                                    "replies": [
                                        {
                                            "body": "Let’s see. Per the OP, his sb did the following: \nQuoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. \n\nNot sure how else to describe this woman’s behavior other than unstable? Either way, her behavior was a GIANT red flag.",
                                            "author": null,
                                            "id": "in3imit",
                                            "parent_id": "t1_in3hvmk",
                                            "score": 18,
                                            "created_utc": 1662322337.0,
                                            "replies": [
                                                {
                                                    "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
                                                    "author": "GlitterAndSugar",
                                                    "id": "in3ssbq",
                                                    "parent_id": "t1_in3imit",
                                                    "score": 2,
                                                    "created_utc": 1662326666.0,
                                                    "replies": [
                                                        {
                                                            "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                                                            "author": null,
                                                            "id": "in3sw8v",
                                                            "parent_id": "t1_in3ssbq",
                                                            "score": 6,
                                                            "created_utc": 1662326712.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
                                                    "author": null,
                                                    "id": "in3rosu",
                                                    "parent_id": "t1_in3imit",
                                                    "score": 1,
                                                    "created_utc": 1662326206.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
                                                    "author": "KingKimoi",
                                                    "id": "in3jktt",
                                                    "parent_id": "t1_in3imit",
                                                    "score": 1,
                                                    "created_utc": 1662322753.0,
                                                    "replies": [
                                                        {
                                                            "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                                                            "author": "Fabulous_Storm2437",
                                                            "id": "in4g5gc",
                                                            "parent_id": "t1_in3jktt",
                                                            "score": -1,
                                                            "created_utc": 1662337474.0,
                                                            "replies": [
                                                                {
                                                                    "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                                                                    "author": "KingKimoi",
                                                                    "id": "in4h0ft",
                                                                    "parent_id": "t1_in4g5gc",
                                                                    "score": 1,
                                                                    "created_utc": 1662337872.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You are grasping at anything to make the girl look less bad. And somehow in SB posts no one requests both sides since this is an anonymous forum.",
                            "author": null,
                            "id": "in4hfu6",
                            "parent_id": "t1_in3fwhg",
                            "score": 5,
                            "created_utc": 1662338071.0,
                            "replies": []
                        },
                        {
                            "body": "I don't see any possible way to make this not come off as greedy and a bit unhinged. She literally researched him, cyber stalked him, and then demanded more money.\n\nEven if we had her side it would be pretty hard to back track from this.",
                            "author": "HeilerinVonDoom",
                            "id": "in4kdiw",
                            "parent_id": "t1_in3fwhg",
                            "score": 6,
                            "created_utc": 1662339423.0,
                            "replies": [
                                {
                                    "body": "The guy is clearly telling the story and doing some embellishments for the sake of entertainment and telling an entertaining tale.\n\nI don't think its \"cyber stalking\" to look someone you are dating up. Who doesn't do this? Unhinged for doing that? Really? That is pretty common practice and like he said, whats out there isn't some giant secret that only a secret agent could uncover.\n\nShe may be greedy, possibly not. He hasn't said how much he gives her or what he expects from that. Furthermore, we don't have any further details on how hot she is or if she is quite capable of easily getting more from other men. Perhaps she went about it the wrong way....again, we only have his side to hear.",
                                    "author": "clair-cummings",
                                    "id": "in53n0q",
                                    "parent_id": "t1_in4kdiw",
                                    "score": 1,
                                    "created_utc": 1662348701.0,
                                    "replies": [
                                        {
                                            "body": "Um... Looking dudes stocks up, where he works, finding his place of employment... All red flags.\nIf you don't find this weird then you have similar red flags.",
                                            "author": "HeilerinVonDoom",
                                            "id": "in53wgk",
                                            "parent_id": "t1_in53n0q",
                                            "score": 4,
                                            "created_utc": 1662348841.0,
                                            "replies": [
                                                {
                                                    "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
                                                    "author": "clair-cummings",
                                                    "id": "in6cfm1",
                                                    "parent_id": "t1_in53wgk",
                                                    "score": 2,
                                                    "created_utc": 1662380644.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                                                            "author": "Positive-Daddy-594",
                                                            "id": "in7kdka",
                                                            "parent_id": "t1_in6cfm1",
                                                            "score": 2,
                                                            "created_utc": 1662399848.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                                                                    "author": "clair-cummings",
                                                                    "id": "in7rp2d",
                                                                    "parent_id": "t1_in7kdka",
                                                                    "score": 2,
                                                                    "created_utc": 1662402826.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Narrator: she does.",
                                                    "author": "YlangScent",
                                                    "id": "in5rf92",
                                                    "parent_id": "t1_in53wgk",
                                                    "score": 1,
                                                    "created_utc": 1662364322.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes we do. All the time--especially on reddit.",
                            "author": "zapzangboombang",
                            "id": "ina21p0",
                            "parent_id": "t1_in3fwhg",
                            "score": -1,
                            "created_utc": 1662441769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Had a skim. Jfc what even is that cesspool echo chamber. It Reads exactly like female dating strategy.",
            "author": "xa3D",
            "id": "in3bxxz",
            "parent_id": "t1_in3arrl",
            "score": 2,
            "created_utc": 1662319485.0,
            "replies": [
                {
                    "body": "Brilliant comparison.  That is exactly what it is, female dating strategy applied to sugar, with a hyper focus on optimizing payments, and I suppose there's enough of the occasional scam or other discussion that the weak-minded can't see it for what it very obviously is.",
                    "author": "WynnDuppy",
                    "id": "in45p02",
                    "parent_id": "t1_in3bxxz",
                    "score": 1,
                    "created_utc": 1662332512.0,
                    "replies": []
                },
                {
                    "body": "From my cursory glance, it’s mainly a bunch of bitter SW that hate men, view you as a trick, and pat each other on the back about knowing their “worth.”",
                    "author": "ThinAvocadoToast",
                    "id": "in3cfl3",
                    "parent_id": "t1_in3bxxz",
                    "score": 0,
                    "created_utc": 1662319695.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought this same thing whenever she used the word whale lol.",
            "author": null,
            "id": "in3fmho",
            "parent_id": "t1_in3arrl",
            "score": 1,
            "created_utc": 1662321061.0,
            "replies": []
        },
        {
            "body": "There are some ruthless women on there!!!",
            "author": null,
            "id": "in3hs1h",
            "parent_id": "t1_in3arrl",
            "score": 2,
            "created_utc": 1662321974.0,
            "replies": []
        },
        {
            "body": "That and some of those sugar baby books in circulation.",
            "author": "southernslick",
            "id": "in3dq3c",
            "parent_id": "t1_in3arrl",
            "score": 1,
            "created_utc": 1662320251.0,
            "replies": []
        },
        {
            "body": "More than the average allowance based on how much research and what data though? I'd have to know the actual number to say for sure. Also, how attractive is this person and how easy will it be for her to pull others? That makes a difference too.",
            "author": "clair-cummings",
            "id": "in3g6dd",
            "parent_id": "t1_in3airc",
            "score": 6,
            "created_utc": 1662321296.0,
            "replies": [
                {
                    "body": "I was going to say this as well. SDs love to say that their allowance/ ppm/whatever is more than average or substantial but I’m always curious to know where they got those numbers from. \n\nI think since this is only the SDs point of view we won’t really ever know if she’s maybe struggling or there’s some reason for her to be so reactive",
                    "author": "KingKimoi",
                    "id": "in3i9tj",
                    "parent_id": "t1_in3g6dd",
                    "score": 13,
                    "created_utc": 1662322186.0,
                    "replies": []
                },
                {
                    "body": "None of what the OP said about his SB screams giant red flag to you?",
                    "author": null,
                    "id": "in3gl8v",
                    "parent_id": "t1_in3g6dd",
                    "score": 7,
                    "created_utc": 1662321473.0,
                    "replies": [
                        {
                            "body": "There’s at the very least a few orange ones , maybe there’s cause for her triggered outburst ? I’d like to believe there’s a reason for a seemingly great arrangement to feel like she had to go researching on her SD to begin with , that doesn’t scream trust and open communication from either sides.",
                            "author": "KingKimoi",
                            "id": "in3il77",
                            "parent_id": "t1_in3gl8v",
                            "score": 5,
                            "created_utc": 1662322321.0,
                            "replies": [
                                {
                                    "body": "Sorry, but per the OP, his sb did the following: Quoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. All of those are giant red flags, not orange. \n\nIf a SB on here told the story about her SD behaving like this at dinner, we would all be telling her to run fast. \n\nEither way, sounds like their SR is over and both should end things.",
                                    "author": null,
                                    "id": "in3iqvf",
                                    "parent_id": "t1_in3il77",
                                    "score": 9,
                                    "created_utc": 1662322391.0,
                                    "replies": [
                                        {
                                            "body": "I am very curious if either of them are religious and also what scripture would be appropriate for such an incident 😂",
                                            "author": "KingKimoi",
                                            "id": "in3k86z",
                                            "parent_id": "t1_in3iqvf",
                                            "score": 3,
                                            "created_utc": 1662323025.0,
                                            "replies": [
                                                {
                                                    "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
                                                    "author": "WaterJourney67",
                                                    "id": "in3so0v",
                                                    "parent_id": "t1_in3k86z",
                                                    "score": 4,
                                                    "created_utc": 1662326616.0,
                                                    "replies": [
                                                        {
                                                            "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                                                            "author": "KingKimoi",
                                                            "id": "in4344o",
                                                            "parent_id": "t1_in3so0v",
                                                            "score": 3,
                                                            "created_utc": 1662331295.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                                                            "author": null,
                                                            "id": "inahztc",
                                                            "parent_id": "t1_in3so0v",
                                                            "score": 2,
                                                            "created_utc": 1662454233.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No I completely agree both seem to not be on the same page anymore and should revisit their arrangement. I want to just be hopeful and give her the benefit of the doubt since it seemed like before they were an ideal match.",
                                            "author": "KingKimoi",
                                            "id": "in3k11b",
                                            "parent_id": "t1_in3iqvf",
                                            "score": 1,
                                            "created_utc": 1662322942.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It’s too obvious! The same crowd will throw a huge fit if the ppm was off by twenty dollars.",
                            "author": null,
                            "id": "in3q7dq",
                            "parent_id": "t1_in3gl8v",
                            "score": 2,
                            "created_utc": 1662325569.0,
                            "replies": [
                                {
                                    "body": "Lol 100%.",
                                    "author": null,
                                    "id": "in3qbob",
                                    "parent_id": "t1_in3q7dq",
                                    "score": 1,
                                    "created_utc": 1662325620.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Based on the same data SBs use to gauge their numbers. It is a two sided game. 😀",
                    "author": "gapaf",
                    "id": "in3idrr",
                    "parent_id": "t1_in3g6dd",
                    "score": 6,
                    "created_utc": 1662322232.0,
                    "replies": []
                },
                {
                    "body": "If you ask 100 women what they would like to receive for an arrangement you describe to then you have all the research and data you need to know what the average allowance is.\n\nYou wanting to decide whether that number is correct or not based on your own standards has no actual place in determining what is or is not average.",
                    "author": "storm170",
                    "id": "in3kr9l",
                    "parent_id": "t1_in3g6dd",
                    "score": 1,
                    "created_utc": 1662323252.0,
                    "replies": [
                        {
                            "body": "100%",
                            "author": null,
                            "id": "in3nu63",
                            "parent_id": "t1_in3kr9l",
                            "score": 2,
                            "created_utc": 1662324554.0,
                            "replies": []
                        },
                        {
                            "body": "No, you would have to survey 100 people that are actually in arrangements, not just asking them what they would like to receive. They might like to receive a whole hell of a lot but they may never get it. It takes both sides to come to an agreement and an allowance to actually change hands.",
                            "author": "Ryan111778",
                            "id": "in40ab7",
                            "parent_id": "t1_in3kr9l",
                            "score": -3,
                            "created_utc": 1662329979.0,
                            "replies": [
                                {
                                    "body": "You exclude outliers on both ends, both the women with unrealistic expectations and those desperate enough to accept nearly anything. It still produces a distribution you can feel comfortable with.",
                                    "author": "storm170",
                                    "id": "in40r46",
                                    "parent_id": "t1_in40ab7",
                                    "score": -2,
                                    "created_utc": 1662330190.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For savvy SDs this is an open and shut case, lady has to be fired period.",
                    "author": null,
                    "id": "in3q16f",
                    "parent_id": "t1_in3g6dd",
                    "score": 2,
                    "created_utc": 1662325495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah what is it about 3 months?!",
            "author": null,
            "id": "in640rw",
            "parent_id": "t1_in454zk",
            "score": 3,
            "created_utc": 1662374909.0,
            "replies": []
        },
        {
            "body": "This!! I have second hand embarrassment for her. Luckily he flushed out her crazy potential early on. Run for the hills my guy. She’s trouble!",
            "author": "TX_SB",
            "id": "in3z81v",
            "parent_id": "t1_in3ms4o",
            "score": 4,
            "created_utc": 1662329495.0,
            "replies": []
        },
        {
            "body": "And that's why it's important to realize that wealth encompasses more than just dollar amounts. Even the richest have budgets and amounts they don't want to go over, even if those budgets are unfathomable to many of us. \n\nShe could have handled this in so many different ways, for sure.",
            "author": "ShaArt5",
            "id": "in57skm",
            "parent_id": "t1_in3s8wx",
            "score": 2,
            "created_utc": 1662350953.0,
            "replies": []
        },
        {
            "body": "In concept, I agree with you, however I don’t understand where anyone can realistically think that a SR should be some kind of percentage of a SD’s income. It’s ultimately a business deal to start with, and what is agreed upon is acceptable to both parties.\n   Also looking at a stock sale says nothing without knowing the cost basis. I could sell 2 million dollars of stock that shows up in a public record that I paid 3.5 million dollars for.",
            "author": "Positive-Daddy-594",
            "id": "in7nvse",
            "parent_id": "t1_in3s8wx",
            "score": 0,
            "created_utc": 1662401264.0,
            "replies": [
                {
                    "body": "I never said anything about a SR being a certain percentage of someone’s income.\n\nFor all we know he could have turned around and donated every last cent of his money to charity or tied it up in a new investment, but that’s clearly not her thinking, her inexperience and ignorance is showing in how she chose to deal with the knowledge of the money he *might* have.",
                    "author": "GlitterAndSugar",
                    "id": "in7oidi",
                    "parent_id": "t1_in7nvse",
                    "score": 6,
                    "created_utc": 1662401522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol I like your interpretation of the situation",
            "author": "clair-cummings",
            "id": "ina4eto",
            "parent_id": "t1_in6ab1f",
            "score": 2,
            "created_utc": 1662443366.0,
            "replies": []
        },
        {
            "body": "I'm 55. She's 33.",
            "author": "WaterJourney67",
            "id": "inh5mog",
            "parent_id": "t1_in6ab1f",
            "score": 1,
            "created_utc": 1662571751.0,
            "replies": []
        },
        {
            "body": "Tell security what, exactly? That his twentysomething ex-girlfriend might show up? Telling them that is as bad as if she did show up. \n\nCall the police by all means, but police reports and criminal complaints are public records in GA. \n\nA simple FOIA request is all that’s needed to obtain a copy.",
            "author": "nonsumqualiseramSBF",
            "id": "in3zsbm",
            "parent_id": "t1_in3jhzd",
            "score": 2,
            "created_utc": 1662329749.0,
            "replies": [
                {
                    "body": "Tell security to not allow her in. Not saying it will get to this, but If it gets to the point he needs to call the police, why would you be worried with the tracking?",
                    "author": "gapaf",
                    "id": "in46ax9",
                    "parent_id": "t1_in3zsbm",
                    "score": 1,
                    "created_utc": 1662332799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Alternative - Imagine a valued employee came in and gave a similar demand...... would you sit them down and explain the facts of life.\n\nValued or not, threatening extortion and blackmail is immediate firing",
            "author": null,
            "id": "in3s0qb",
            "parent_id": "t1_in39wqn",
            "score": 4,
            "created_utc": 1662326347.0,
            "replies": []
        },
        {
            "body": "This has been the grand calculus going through my mind the past 48 hours. She certainly never presented any acute need, although that would at least inform the situation. It was all based on my perceived ability. \n\nHonestly, it would be much easier if this were an employee, but I never viewed her as that. It was all supposed to be mutually beneficial. Then it blew up.",
            "author": "WaterJourney67",
            "id": "in3tuch",
            "parent_id": "t1_in39wqn",
            "score": 4,
            "created_utc": 1662327127.0,
            "replies": []
        },
        {
            "body": "Any of that went out the door when she threatened to show up at his work if he didn’t comply.\n\n9/10 times that I have continued to associate with someone who has broadcasted that they have vindictively crazy thoughts like that, I’ve come to regret it.",
            "author": "New_SDthrowaway",
            "id": "in9kruh",
            "parent_id": "t1_in54gca",
            "score": 1,
            "created_utc": 1662432035.0,
            "replies": [
                {
                    "body": "I had overlooked the threat",
                    "author": "pinotandsugar",
                    "id": "in9sbn0",
                    "parent_id": "t1_in9kruh",
                    "score": 1,
                    "created_utc": 1662435907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes this is an under discussed aspect of the lifestyle \n\nPeople virtue shame on “secrecy “ and “hiding “ - but you just can’t know anyone that well meeting them for a few months.\n\nUltimate virtue in this lifestyle imo is being a gentleman and honoring your commitments and helping someone in need …\n\n…and not being a completely open book for opportunistic manipulation and blackmail - people get tempted no matter how good their initial intentions",
            "author": "OCbird22",
            "id": "in4p8ca",
            "parent_id": "t1_in4gvhv",
            "score": 6,
            "created_utc": 1662341730.0,
            "replies": []
        },
        {
            "body": "the SB from the OP must have been reading the same sub as a girl in the \"Ask a Stupid Question\" thread who said she had read that a SB is supposed to get a guy's name and do a background check on him to make sure he has enough money.\n\nbut she said she would be unwilling to let him do a background check on her.",
            "author": "joc13",
            "id": "in4xvhp",
            "parent_id": "t1_in4gvhv",
            "score": 2,
            "created_utc": 1662345858.0,
            "replies": []
        },
        {
            "body": "Wisest thing to do although that approach is frowned upon on this forum. Better to be safe than sorry. Also yea I love to pay them to stay at arms length.",
            "author": null,
            "id": "in6j9k1",
            "parent_id": "t1_in4gvhv",
            "score": 0,
            "created_utc": 1662384325.0,
            "replies": []
        },
        {
            "body": "I think I would like to unpack this with her, but I need a few days before I do.",
            "author": "WaterJourney67",
            "id": "in5j55l",
            "parent_id": "t1_in4xmg4",
            "score": 2,
            "created_utc": 1662358086.0,
            "replies": []
        },
        {
            "body": "Just saw this comment and laughed out loud. Apparently they find both of us easily enough.",
            "author": "WaterJourney67",
            "id": "inh71m5",
            "parent_id": "t1_in4yeqh",
            "score": 1,
            "created_utc": 1662572270.0,
            "replies": []
        },
        {
            "body": "You can gtfo with that mentality.\n\nSome of us have no interest in being paid lays. We want an actual relationship. \n\nShe does not represent all of us, just like Johns don't represent all SDs.",
            "author": "ShaArt5",
            "id": "in3db5x",
            "parent_id": "t1_in3a8ke",
            "score": 5,
            "created_utc": 1662320074.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "in3e98a",
                    "parent_id": "t1_in3db5x",
                    "score": 1,
                    "created_utc": 1662320478.0,
                    "replies": [
                        {
                            "body": "Even then. Regardless, they are not deserving of this sneering attitude.\n\nOne of the rules of this sub is to 'Remember the human'. Do try to do that please.",
                            "author": "ShaArt5",
                            "id": "in3fl34",
                            "parent_id": "t1_in3e98a",
                            "score": 1,
                            "created_utc": 1662321045.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "in3fusf",
                                    "parent_id": "t1_in3fl34",
                                    "score": 1,
                                    "created_utc": 1662321159.0,
                                    "replies": [
                                        {
                                            "body": "You may not think you are, but you are implying that they are of less value. Especially with your last sentence in that post.",
                                            "author": "ShaArt5",
                                            "id": "in3gn87",
                                            "parent_id": "t1_in3fusf",
                                            "score": 1,
                                            "created_utc": 1662321496.0,
                                            "replies": [
                                                {
                                                    "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
                                                    "author": "xa3D",
                                                    "id": "in3h7w6",
                                                    "parent_id": "t1_in3gn87",
                                                    "score": 1,
                                                    "created_utc": 1662321737.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "This sub believes that sugar is a relationship, not a sexual service.  We respect other opinions, but \"sugar as sexwork\" \"SB as employee / service provider\" \"SD as employer /  client\" is not appropriate for this sub.\n\nRule #12: No Escorts/Johns",
                                            "author": "sugarlifestyleforum-ModTeam",
                                            "id": "in3okwf",
                                            "parent_id": "t1_in3fusf",
                                            "score": 1,
                                            "created_utc": 1662324875.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And she knew the OP had feelings and took full advantage too",
            "author": "Fabulous_Storm2437",
            "id": "in4gxjz",
            "parent_id": "t1_in3jw9k",
            "score": 2,
            "created_utc": 1662337836.0,
            "replies": []
        },
        {
            "body": "Wow, really? Must be more going on that that! Of course, being too keen is a big mistake. Well too often at least. You lose respect and they feel you're being a bit needy?",
            "author": null,
            "id": "in647xa",
            "parent_id": "t1_in41g8n",
            "score": 0,
            "created_utc": 1662375064.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "in9856w",
                    "parent_id": "t1_in647xa",
                    "score": 1,
                    "created_utc": 1662426127.0,
                    "replies": [
                        {
                            "body": "Yeah we may never know what's going through their minds. Last year I had an incredible encounter - best looking girl I've ever met off Seeking. 27, slim, petite, pretty as can be, wonderful French accent, a little bit shy...until we got to the bedroom and then fireworks. Screaming orgasms and the like. She didn't even ask for any gifts/finances. We met the next week and same again. Unbelievable. I did give her a generous gift (avearge for the area).  Following week she simply ghosted me. Ignored my whatsapp messages (yet never blocked me). So infuriating. She was the best. Never will know...BF came back on the scene? Another SD came along? Or she's just into brief encounters??",
                            "author": null,
                            "id": "inaiivu",
                            "parent_id": "t1_in9856w",
                            "score": 1,
                            "created_utc": 1662454698.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "wait what",
            "author": "sugarintherawr",
            "id": "in5adsv",
            "parent_id": "t1_in41g8n",
            "score": 1,
            "created_utc": 1662352456.0,
            "replies": []
        },
        {
            "body": "I don't think him acting like a child is going to make things better.  Just move on, this SR has reached it's expiration date",
            "author": "WynnDuppy",
            "id": "in44wub",
            "parent_id": "t1_in3kkqq",
            "score": 1,
            "created_utc": 1662332140.0,
            "replies": []
        },
        {
            "body": "Righteous quote!",
            "author": "WynnDuppy",
            "id": "in88tix",
            "parent_id": "t1_in82bqh",
            "score": 1,
            "created_utc": 1662410045.0,
            "replies": []
        },
        {
            "body": "Lol awesome.",
            "author": null,
            "id": "in3nqip",
            "parent_id": "t1_in3hel8",
            "score": 12,
            "created_utc": 1662324511.0,
            "replies": []
        },
        {
            "body": "greed is also a sin...",
            "author": "gaytoradee",
            "id": "in5ja34",
            "parent_id": "t1_in3hel8",
            "score": 5,
            "created_utc": 1662358182.0,
            "replies": [
                {
                    "body": "One of the seven deadly sins, at that.",
                    "author": "WaterJourney67",
                    "id": "in66469",
                    "parent_id": "t1_in5ja34",
                    "score": 6,
                    "created_utc": 1662376528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No freakin way. King James Version too. Ohmygosh— RUN! To nyc. 😉",
            "author": "iamrosieriley",
            "id": "in69gn8",
            "parent_id": "t1_in3hel8",
            "score": 0,
            "created_utc": 1662378817.0,
            "replies": []
        },
        {
            "body": " 😂😂.   So she’s ( from a biblical standpoint) “sinning” with you ( I don’t really think SD/SB relationships are “sinning” unless abuse is involved), and she decides to quote biblical passages to persuade you to come across with more $$ that could potentially be quadrupled per assessment?   Just wow.   She was most likely raised fundamentalist, but she’s not a “good girl” now.",
            "author": "stocks-mostly-lower",
            "id": "iqw3rmw",
            "parent_id": "t1_in3hel8",
            "score": 1,
            "created_utc": 1664809728.0,
            "replies": [
                {
                    "body": "I’m not sure the exchange between us particularly rewards logical analysis. We were both raised in fundamentalist traditions, albeit different ones.",
                    "author": "WaterJourney67",
                    "id": "ir1g5e5",
                    "parent_id": "t1_iqw3rmw",
                    "score": 1,
                    "created_utc": 1664903743.0,
                    "replies": [
                        {
                            "body": "   Well, you put it on Reddit, so different readers will have different reactions, and look at your experiences with a variety of viewpoints based in their own backgrounds 🤷‍♀️❤️‍🔥.",
                            "author": "stocks-mostly-lower",
                            "id": "ir1j0n6",
                            "parent_id": "t1_ir1g5e5",
                            "score": 1,
                            "created_utc": 1664904824.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ooh, you sound like a teacher, and I like teachers!...\n\nI could quote a Rodney Dangerfield joke about teachers here, but I won't.",
            "author": "ExperiencedMaleDom",
            "id": "in3gnp3",
            "parent_id": "t1_in3f16e",
            "score": 5,
            "created_utc": 1662321501.0,
            "replies": [
                {
                    "body": "Definitely felt like obdurate was a $10 word… lol",
                    "author": "Glock9prfction",
                    "id": "in5iswn",
                    "parent_id": "t1_in3gnp3",
                    "score": 2,
                    "created_utc": 1662357849.0,
                    "replies": []
                },
                {
                    "body": "What's the quote?",
                    "author": "clair-cummings",
                    "id": "ina2luu",
                    "parent_id": "t1_in3gnp3",
                    "score": 1,
                    "created_utc": 1662442139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Indeed. It has many names and I've studied it as far as antiquity. \n\nHermes Trismegistus is my man! I'm starting Latin course this week so I could read the manuscripts of alchemists and delve deeper.",
            "author": "FructoseLady",
            "id": "in5fktk",
            "parent_id": "t1_in4uz8n",
            "score": 1,
            "created_utc": 1662355684.0,
            "replies": []
        },
        {
            "body": "If anyone ever tells me to “have a blessed day” or has a Jesus fish on their business card I immediately check for my wallet.",
            "author": "LotBuilder",
            "id": "in4fq4w",
            "parent_id": "t1_in4etvc",
            "score": 6,
            "created_utc": 1662337286.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "Grand_Photograph4081",
            "id": "in4utbc",
            "parent_id": "t1_in4etvc",
            "score": 1,
            "created_utc": 1662344405.0,
            "replies": []
        },
        {
            "body": "\\+1, it just feels like outside influence",
            "author": "WynnDuppy",
            "id": "in44jyp",
            "parent_id": "t1_in3o7d1",
            "score": 2,
            "created_utc": 1662331971.0,
            "replies": []
        },
        {
            "body": "Yall are basing this on only HIS story and details. Do you normally decide on other things in life only hearing 1 side? The person likes to hear themselves talk so I reckon details may be a bit embellished for the sake of making the story more interesting.\n\nI'd personally wait before making decisions that someone is \"mentally unstable\" until I meet both parties.",
            "author": "clair-cummings",
            "id": "in3fwhg",
            "parent_id": "t1_in3bob7",
            "score": -4,
            "created_utc": 1662321179.0,
            "replies": [
                {
                    "body": "The OP’s SB isn’t here to defend herself. We can only go by what the OP is telling us. Based on what he’s telling us, his sb sounds bat shit crazy. The standard advice here would be for him to end things and move on. \n\nIf a woman posted a similar story about her SD on here we would all be telling her to run fast!",
                    "author": null,
                    "id": "in3gbat",
                    "parent_id": "t1_in3fwhg",
                    "score": 18,
                    "created_utc": 1662321355.0,
                    "replies": [
                        {
                            "body": "Mentally unstable is still a bit harsh. Perhaps there’s a meet in the middle word to describe her disgruntled behavior that doesn’t also cast a bad light on mental illness.",
                            "author": "KingKimoi",
                            "id": "in3hvmk",
                            "parent_id": "t1_in3gbat",
                            "score": -3,
                            "created_utc": 1662322017.0,
                            "replies": [
                                {
                                    "body": "Let’s see. Per the OP, his sb did the following: \nQuoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. \n\nNot sure how else to describe this woman’s behavior other than unstable? Either way, her behavior was a GIANT red flag.",
                                    "author": null,
                                    "id": "in3imit",
                                    "parent_id": "t1_in3hvmk",
                                    "score": 18,
                                    "created_utc": 1662322337.0,
                                    "replies": [
                                        {
                                            "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
                                            "author": "GlitterAndSugar",
                                            "id": "in3ssbq",
                                            "parent_id": "t1_in3imit",
                                            "score": 2,
                                            "created_utc": 1662326666.0,
                                            "replies": [
                                                {
                                                    "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                                                    "author": null,
                                                    "id": "in3sw8v",
                                                    "parent_id": "t1_in3ssbq",
                                                    "score": 6,
                                                    "created_utc": 1662326712.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
                                            "author": null,
                                            "id": "in3rosu",
                                            "parent_id": "t1_in3imit",
                                            "score": 1,
                                            "created_utc": 1662326206.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
                                            "author": "KingKimoi",
                                            "id": "in3jktt",
                                            "parent_id": "t1_in3imit",
                                            "score": 1,
                                            "created_utc": 1662322753.0,
                                            "replies": [
                                                {
                                                    "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                                                    "author": "Fabulous_Storm2437",
                                                    "id": "in4g5gc",
                                                    "parent_id": "t1_in3jktt",
                                                    "score": -1,
                                                    "created_utc": 1662337474.0,
                                                    "replies": [
                                                        {
                                                            "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                                                            "author": "KingKimoi",
                                                            "id": "in4h0ft",
                                                            "parent_id": "t1_in4g5gc",
                                                            "score": 1,
                                                            "created_utc": 1662337872.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are grasping at anything to make the girl look less bad. And somehow in SB posts no one requests both sides since this is an anonymous forum.",
                    "author": null,
                    "id": "in4hfu6",
                    "parent_id": "t1_in3fwhg",
                    "score": 5,
                    "created_utc": 1662338071.0,
                    "replies": []
                },
                {
                    "body": "I don't see any possible way to make this not come off as greedy and a bit unhinged. She literally researched him, cyber stalked him, and then demanded more money.\n\nEven if we had her side it would be pretty hard to back track from this.",
                    "author": "HeilerinVonDoom",
                    "id": "in4kdiw",
                    "parent_id": "t1_in3fwhg",
                    "score": 6,
                    "created_utc": 1662339423.0,
                    "replies": [
                        {
                            "body": "The guy is clearly telling the story and doing some embellishments for the sake of entertainment and telling an entertaining tale.\n\nI don't think its \"cyber stalking\" to look someone you are dating up. Who doesn't do this? Unhinged for doing that? Really? That is pretty common practice and like he said, whats out there isn't some giant secret that only a secret agent could uncover.\n\nShe may be greedy, possibly not. He hasn't said how much he gives her or what he expects from that. Furthermore, we don't have any further details on how hot she is or if she is quite capable of easily getting more from other men. Perhaps she went about it the wrong way....again, we only have his side to hear.",
                            "author": "clair-cummings",
                            "id": "in53n0q",
                            "parent_id": "t1_in4kdiw",
                            "score": 1,
                            "created_utc": 1662348701.0,
                            "replies": [
                                {
                                    "body": "Um... Looking dudes stocks up, where he works, finding his place of employment... All red flags.\nIf you don't find this weird then you have similar red flags.",
                                    "author": "HeilerinVonDoom",
                                    "id": "in53wgk",
                                    "parent_id": "t1_in53n0q",
                                    "score": 4,
                                    "created_utc": 1662348841.0,
                                    "replies": [
                                        {
                                            "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
                                            "author": "clair-cummings",
                                            "id": "in6cfm1",
                                            "parent_id": "t1_in53wgk",
                                            "score": 2,
                                            "created_utc": 1662380644.0,
                                            "replies": [
                                                {
                                                    "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                                                    "author": "Positive-Daddy-594",
                                                    "id": "in7kdka",
                                                    "parent_id": "t1_in6cfm1",
                                                    "score": 2,
                                                    "created_utc": 1662399848.0,
                                                    "replies": [
                                                        {
                                                            "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                                                            "author": "clair-cummings",
                                                            "id": "in7rp2d",
                                                            "parent_id": "t1_in7kdka",
                                                            "score": 2,
                                                            "created_utc": 1662402826.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Narrator: she does.",
                                            "author": "YlangScent",
                                            "id": "in5rf92",
                                            "parent_id": "t1_in53wgk",
                                            "score": 1,
                                            "created_utc": 1662364322.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes we do. All the time--especially on reddit.",
                    "author": "zapzangboombang",
                    "id": "ina21p0",
                    "parent_id": "t1_in3fwhg",
                    "score": -1,
                    "created_utc": 1662441769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Brilliant comparison.  That is exactly what it is, female dating strategy applied to sugar, with a hyper focus on optimizing payments, and I suppose there's enough of the occasional scam or other discussion that the weak-minded can't see it for what it very obviously is.",
            "author": "WynnDuppy",
            "id": "in45p02",
            "parent_id": "t1_in3bxxz",
            "score": 1,
            "created_utc": 1662332512.0,
            "replies": []
        },
        {
            "body": "From my cursory glance, it’s mainly a bunch of bitter SW that hate men, view you as a trick, and pat each other on the back about knowing their “worth.”",
            "author": "ThinAvocadoToast",
            "id": "in3cfl3",
            "parent_id": "t1_in3bxxz",
            "score": 0,
            "created_utc": 1662319695.0,
            "replies": []
        },
        {
            "body": "I was going to say this as well. SDs love to say that their allowance/ ppm/whatever is more than average or substantial but I’m always curious to know where they got those numbers from. \n\nI think since this is only the SDs point of view we won’t really ever know if she’s maybe struggling or there’s some reason for her to be so reactive",
            "author": "KingKimoi",
            "id": "in3i9tj",
            "parent_id": "t1_in3g6dd",
            "score": 13,
            "created_utc": 1662322186.0,
            "replies": []
        },
        {
            "body": "None of what the OP said about his SB screams giant red flag to you?",
            "author": null,
            "id": "in3gl8v",
            "parent_id": "t1_in3g6dd",
            "score": 7,
            "created_utc": 1662321473.0,
            "replies": [
                {
                    "body": "There’s at the very least a few orange ones , maybe there’s cause for her triggered outburst ? I’d like to believe there’s a reason for a seemingly great arrangement to feel like she had to go researching on her SD to begin with , that doesn’t scream trust and open communication from either sides.",
                    "author": "KingKimoi",
                    "id": "in3il77",
                    "parent_id": "t1_in3gl8v",
                    "score": 5,
                    "created_utc": 1662322321.0,
                    "replies": [
                        {
                            "body": "Sorry, but per the OP, his sb did the following: Quoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. All of those are giant red flags, not orange. \n\nIf a SB on here told the story about her SD behaving like this at dinner, we would all be telling her to run fast. \n\nEither way, sounds like their SR is over and both should end things.",
                            "author": null,
                            "id": "in3iqvf",
                            "parent_id": "t1_in3il77",
                            "score": 9,
                            "created_utc": 1662322391.0,
                            "replies": [
                                {
                                    "body": "I am very curious if either of them are religious and also what scripture would be appropriate for such an incident 😂",
                                    "author": "KingKimoi",
                                    "id": "in3k86z",
                                    "parent_id": "t1_in3iqvf",
                                    "score": 3,
                                    "created_utc": 1662323025.0,
                                    "replies": [
                                        {
                                            "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
                                            "author": "WaterJourney67",
                                            "id": "in3so0v",
                                            "parent_id": "t1_in3k86z",
                                            "score": 4,
                                            "created_utc": 1662326616.0,
                                            "replies": [
                                                {
                                                    "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                                                    "author": "KingKimoi",
                                                    "id": "in4344o",
                                                    "parent_id": "t1_in3so0v",
                                                    "score": 3,
                                                    "created_utc": 1662331295.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                                                    "author": null,
                                                    "id": "inahztc",
                                                    "parent_id": "t1_in3so0v",
                                                    "score": 2,
                                                    "created_utc": 1662454233.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No I completely agree both seem to not be on the same page anymore and should revisit their arrangement. I want to just be hopeful and give her the benefit of the doubt since it seemed like before they were an ideal match.",
                                    "author": "KingKimoi",
                                    "id": "in3k11b",
                                    "parent_id": "t1_in3iqvf",
                                    "score": 1,
                                    "created_utc": 1662322942.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s too obvious! The same crowd will throw a huge fit if the ppm was off by twenty dollars.",
                    "author": null,
                    "id": "in3q7dq",
                    "parent_id": "t1_in3gl8v",
                    "score": 2,
                    "created_utc": 1662325569.0,
                    "replies": [
                        {
                            "body": "Lol 100%.",
                            "author": null,
                            "id": "in3qbob",
                            "parent_id": "t1_in3q7dq",
                            "score": 1,
                            "created_utc": 1662325620.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Based on the same data SBs use to gauge their numbers. It is a two sided game. 😀",
            "author": "gapaf",
            "id": "in3idrr",
            "parent_id": "t1_in3g6dd",
            "score": 6,
            "created_utc": 1662322232.0,
            "replies": []
        },
        {
            "body": "If you ask 100 women what they would like to receive for an arrangement you describe to then you have all the research and data you need to know what the average allowance is.\n\nYou wanting to decide whether that number is correct or not based on your own standards has no actual place in determining what is or is not average.",
            "author": "storm170",
            "id": "in3kr9l",
            "parent_id": "t1_in3g6dd",
            "score": 1,
            "created_utc": 1662323252.0,
            "replies": [
                {
                    "body": "100%",
                    "author": null,
                    "id": "in3nu63",
                    "parent_id": "t1_in3kr9l",
                    "score": 2,
                    "created_utc": 1662324554.0,
                    "replies": []
                },
                {
                    "body": "No, you would have to survey 100 people that are actually in arrangements, not just asking them what they would like to receive. They might like to receive a whole hell of a lot but they may never get it. It takes both sides to come to an agreement and an allowance to actually change hands.",
                    "author": "Ryan111778",
                    "id": "in40ab7",
                    "parent_id": "t1_in3kr9l",
                    "score": -3,
                    "created_utc": 1662329979.0,
                    "replies": [
                        {
                            "body": "You exclude outliers on both ends, both the women with unrealistic expectations and those desperate enough to accept nearly anything. It still produces a distribution you can feel comfortable with.",
                            "author": "storm170",
                            "id": "in40r46",
                            "parent_id": "t1_in40ab7",
                            "score": -2,
                            "created_utc": 1662330190.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For savvy SDs this is an open and shut case, lady has to be fired period.",
            "author": null,
            "id": "in3q16f",
            "parent_id": "t1_in3g6dd",
            "score": 2,
            "created_utc": 1662325495.0,
            "replies": []
        },
        {
            "body": "I never said anything about a SR being a certain percentage of someone’s income.\n\nFor all we know he could have turned around and donated every last cent of his money to charity or tied it up in a new investment, but that’s clearly not her thinking, her inexperience and ignorance is showing in how she chose to deal with the knowledge of the money he *might* have.",
            "author": "GlitterAndSugar",
            "id": "in7oidi",
            "parent_id": "t1_in7nvse",
            "score": 6,
            "created_utc": 1662401522.0,
            "replies": []
        },
        {
            "body": "Tell security to not allow her in. Not saying it will get to this, but If it gets to the point he needs to call the police, why would you be worried with the tracking?",
            "author": "gapaf",
            "id": "in46ax9",
            "parent_id": "t1_in3zsbm",
            "score": 1,
            "created_utc": 1662332799.0,
            "replies": []
        },
        {
            "body": "I had overlooked the threat",
            "author": "pinotandsugar",
            "id": "in9sbn0",
            "parent_id": "t1_in9kruh",
            "score": 1,
            "created_utc": 1662435907.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "in3e98a",
            "parent_id": "t1_in3db5x",
            "score": 1,
            "created_utc": 1662320478.0,
            "replies": [
                {
                    "body": "Even then. Regardless, they are not deserving of this sneering attitude.\n\nOne of the rules of this sub is to 'Remember the human'. Do try to do that please.",
                    "author": "ShaArt5",
                    "id": "in3fl34",
                    "parent_id": "t1_in3e98a",
                    "score": 1,
                    "created_utc": 1662321045.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "in3fusf",
                            "parent_id": "t1_in3fl34",
                            "score": 1,
                            "created_utc": 1662321159.0,
                            "replies": [
                                {
                                    "body": "You may not think you are, but you are implying that they are of less value. Especially with your last sentence in that post.",
                                    "author": "ShaArt5",
                                    "id": "in3gn87",
                                    "parent_id": "t1_in3fusf",
                                    "score": 1,
                                    "created_utc": 1662321496.0,
                                    "replies": [
                                        {
                                            "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
                                            "author": "xa3D",
                                            "id": "in3h7w6",
                                            "parent_id": "t1_in3gn87",
                                            "score": 1,
                                            "created_utc": 1662321737.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "This sub believes that sugar is a relationship, not a sexual service.  We respect other opinions, but \"sugar as sexwork\" \"SB as employee / service provider\" \"SD as employer /  client\" is not appropriate for this sub.\n\nRule #12: No Escorts/Johns",
                                    "author": "sugarlifestyleforum-ModTeam",
                                    "id": "in3okwf",
                                    "parent_id": "t1_in3fusf",
                                    "score": 1,
                                    "created_utc": 1662324875.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "in9856w",
            "parent_id": "t1_in647xa",
            "score": 1,
            "created_utc": 1662426127.0,
            "replies": [
                {
                    "body": "Yeah we may never know what's going through their minds. Last year I had an incredible encounter - best looking girl I've ever met off Seeking. 27, slim, petite, pretty as can be, wonderful French accent, a little bit shy...until we got to the bedroom and then fireworks. Screaming orgasms and the like. She didn't even ask for any gifts/finances. We met the next week and same again. Unbelievable. I did give her a generous gift (avearge for the area).  Following week she simply ghosted me. Ignored my whatsapp messages (yet never blocked me). So infuriating. She was the best. Never will know...BF came back on the scene? Another SD came along? Or she's just into brief encounters??",
                    "author": null,
                    "id": "inaiivu",
                    "parent_id": "t1_in9856w",
                    "score": 1,
                    "created_utc": 1662454698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One of the seven deadly sins, at that.",
            "author": "WaterJourney67",
            "id": "in66469",
            "parent_id": "t1_in5ja34",
            "score": 6,
            "created_utc": 1662376528.0,
            "replies": []
        },
        {
            "body": "I’m not sure the exchange between us particularly rewards logical analysis. We were both raised in fundamentalist traditions, albeit different ones.",
            "author": "WaterJourney67",
            "id": "ir1g5e5",
            "parent_id": "t1_iqw3rmw",
            "score": 1,
            "created_utc": 1664903743.0,
            "replies": [
                {
                    "body": "   Well, you put it on Reddit, so different readers will have different reactions, and look at your experiences with a variety of viewpoints based in their own backgrounds 🤷‍♀️❤️‍🔥.",
                    "author": "stocks-mostly-lower",
                    "id": "ir1j0n6",
                    "parent_id": "t1_ir1g5e5",
                    "score": 1,
                    "created_utc": 1664904824.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely felt like obdurate was a $10 word… lol",
            "author": "Glock9prfction",
            "id": "in5iswn",
            "parent_id": "t1_in3gnp3",
            "score": 2,
            "created_utc": 1662357849.0,
            "replies": []
        },
        {
            "body": "What's the quote?",
            "author": "clair-cummings",
            "id": "ina2luu",
            "parent_id": "t1_in3gnp3",
            "score": 1,
            "created_utc": 1662442139.0,
            "replies": []
        },
        {
            "body": "The OP’s SB isn’t here to defend herself. We can only go by what the OP is telling us. Based on what he’s telling us, his sb sounds bat shit crazy. The standard advice here would be for him to end things and move on. \n\nIf a woman posted a similar story about her SD on here we would all be telling her to run fast!",
            "author": null,
            "id": "in3gbat",
            "parent_id": "t1_in3fwhg",
            "score": 18,
            "created_utc": 1662321355.0,
            "replies": [
                {
                    "body": "Mentally unstable is still a bit harsh. Perhaps there’s a meet in the middle word to describe her disgruntled behavior that doesn’t also cast a bad light on mental illness.",
                    "author": "KingKimoi",
                    "id": "in3hvmk",
                    "parent_id": "t1_in3gbat",
                    "score": -3,
                    "created_utc": 1662322017.0,
                    "replies": [
                        {
                            "body": "Let’s see. Per the OP, his sb did the following: \nQuoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. \n\nNot sure how else to describe this woman’s behavior other than unstable? Either way, her behavior was a GIANT red flag.",
                            "author": null,
                            "id": "in3imit",
                            "parent_id": "t1_in3hvmk",
                            "score": 18,
                            "created_utc": 1662322337.0,
                            "replies": [
                                {
                                    "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
                                    "author": "GlitterAndSugar",
                                    "id": "in3ssbq",
                                    "parent_id": "t1_in3imit",
                                    "score": 2,
                                    "created_utc": 1662326666.0,
                                    "replies": [
                                        {
                                            "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                                            "author": null,
                                            "id": "in3sw8v",
                                            "parent_id": "t1_in3ssbq",
                                            "score": 6,
                                            "created_utc": 1662326712.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
                                    "author": null,
                                    "id": "in3rosu",
                                    "parent_id": "t1_in3imit",
                                    "score": 1,
                                    "created_utc": 1662326206.0,
                                    "replies": []
                                },
                                {
                                    "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
                                    "author": "KingKimoi",
                                    "id": "in3jktt",
                                    "parent_id": "t1_in3imit",
                                    "score": 1,
                                    "created_utc": 1662322753.0,
                                    "replies": [
                                        {
                                            "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                                            "author": "Fabulous_Storm2437",
                                            "id": "in4g5gc",
                                            "parent_id": "t1_in3jktt",
                                            "score": -1,
                                            "created_utc": 1662337474.0,
                                            "replies": [
                                                {
                                                    "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                                                    "author": "KingKimoi",
                                                    "id": "in4h0ft",
                                                    "parent_id": "t1_in4g5gc",
                                                    "score": 1,
                                                    "created_utc": 1662337872.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are grasping at anything to make the girl look less bad. And somehow in SB posts no one requests both sides since this is an anonymous forum.",
            "author": null,
            "id": "in4hfu6",
            "parent_id": "t1_in3fwhg",
            "score": 5,
            "created_utc": 1662338071.0,
            "replies": []
        },
        {
            "body": "I don't see any possible way to make this not come off as greedy and a bit unhinged. She literally researched him, cyber stalked him, and then demanded more money.\n\nEven if we had her side it would be pretty hard to back track from this.",
            "author": "HeilerinVonDoom",
            "id": "in4kdiw",
            "parent_id": "t1_in3fwhg",
            "score": 6,
            "created_utc": 1662339423.0,
            "replies": [
                {
                    "body": "The guy is clearly telling the story and doing some embellishments for the sake of entertainment and telling an entertaining tale.\n\nI don't think its \"cyber stalking\" to look someone you are dating up. Who doesn't do this? Unhinged for doing that? Really? That is pretty common practice and like he said, whats out there isn't some giant secret that only a secret agent could uncover.\n\nShe may be greedy, possibly not. He hasn't said how much he gives her or what he expects from that. Furthermore, we don't have any further details on how hot she is or if she is quite capable of easily getting more from other men. Perhaps she went about it the wrong way....again, we only have his side to hear.",
                    "author": "clair-cummings",
                    "id": "in53n0q",
                    "parent_id": "t1_in4kdiw",
                    "score": 1,
                    "created_utc": 1662348701.0,
                    "replies": [
                        {
                            "body": "Um... Looking dudes stocks up, where he works, finding his place of employment... All red flags.\nIf you don't find this weird then you have similar red flags.",
                            "author": "HeilerinVonDoom",
                            "id": "in53wgk",
                            "parent_id": "t1_in53n0q",
                            "score": 4,
                            "created_utc": 1662348841.0,
                            "replies": [
                                {
                                    "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
                                    "author": "clair-cummings",
                                    "id": "in6cfm1",
                                    "parent_id": "t1_in53wgk",
                                    "score": 2,
                                    "created_utc": 1662380644.0,
                                    "replies": [
                                        {
                                            "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                                            "author": "Positive-Daddy-594",
                                            "id": "in7kdka",
                                            "parent_id": "t1_in6cfm1",
                                            "score": 2,
                                            "created_utc": 1662399848.0,
                                            "replies": [
                                                {
                                                    "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                                                    "author": "clair-cummings",
                                                    "id": "in7rp2d",
                                                    "parent_id": "t1_in7kdka",
                                                    "score": 2,
                                                    "created_utc": 1662402826.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Narrator: she does.",
                                    "author": "YlangScent",
                                    "id": "in5rf92",
                                    "parent_id": "t1_in53wgk",
                                    "score": 1,
                                    "created_utc": 1662364322.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes we do. All the time--especially on reddit.",
            "author": "zapzangboombang",
            "id": "ina21p0",
            "parent_id": "t1_in3fwhg",
            "score": -1,
            "created_utc": 1662441769.0,
            "replies": []
        },
        {
            "body": "There’s at the very least a few orange ones , maybe there’s cause for her triggered outburst ? I’d like to believe there’s a reason for a seemingly great arrangement to feel like she had to go researching on her SD to begin with , that doesn’t scream trust and open communication from either sides.",
            "author": "KingKimoi",
            "id": "in3il77",
            "parent_id": "t1_in3gl8v",
            "score": 5,
            "created_utc": 1662322321.0,
            "replies": [
                {
                    "body": "Sorry, but per the OP, his sb did the following: Quoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. All of those are giant red flags, not orange. \n\nIf a SB on here told the story about her SD behaving like this at dinner, we would all be telling her to run fast. \n\nEither way, sounds like their SR is over and both should end things.",
                    "author": null,
                    "id": "in3iqvf",
                    "parent_id": "t1_in3il77",
                    "score": 9,
                    "created_utc": 1662322391.0,
                    "replies": [
                        {
                            "body": "I am very curious if either of them are religious and also what scripture would be appropriate for such an incident 😂",
                            "author": "KingKimoi",
                            "id": "in3k86z",
                            "parent_id": "t1_in3iqvf",
                            "score": 3,
                            "created_utc": 1662323025.0,
                            "replies": [
                                {
                                    "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
                                    "author": "WaterJourney67",
                                    "id": "in3so0v",
                                    "parent_id": "t1_in3k86z",
                                    "score": 4,
                                    "created_utc": 1662326616.0,
                                    "replies": [
                                        {
                                            "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                                            "author": "KingKimoi",
                                            "id": "in4344o",
                                            "parent_id": "t1_in3so0v",
                                            "score": 3,
                                            "created_utc": 1662331295.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                                            "author": null,
                                            "id": "inahztc",
                                            "parent_id": "t1_in3so0v",
                                            "score": 2,
                                            "created_utc": 1662454233.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No I completely agree both seem to not be on the same page anymore and should revisit their arrangement. I want to just be hopeful and give her the benefit of the doubt since it seemed like before they were an ideal match.",
                            "author": "KingKimoi",
                            "id": "in3k11b",
                            "parent_id": "t1_in3iqvf",
                            "score": 1,
                            "created_utc": 1662322942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s too obvious! The same crowd will throw a huge fit if the ppm was off by twenty dollars.",
            "author": null,
            "id": "in3q7dq",
            "parent_id": "t1_in3gl8v",
            "score": 2,
            "created_utc": 1662325569.0,
            "replies": [
                {
                    "body": "Lol 100%.",
                    "author": null,
                    "id": "in3qbob",
                    "parent_id": "t1_in3q7dq",
                    "score": 1,
                    "created_utc": 1662325620.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100%",
            "author": null,
            "id": "in3nu63",
            "parent_id": "t1_in3kr9l",
            "score": 2,
            "created_utc": 1662324554.0,
            "replies": []
        },
        {
            "body": "No, you would have to survey 100 people that are actually in arrangements, not just asking them what they would like to receive. They might like to receive a whole hell of a lot but they may never get it. It takes both sides to come to an agreement and an allowance to actually change hands.",
            "author": "Ryan111778",
            "id": "in40ab7",
            "parent_id": "t1_in3kr9l",
            "score": -3,
            "created_utc": 1662329979.0,
            "replies": [
                {
                    "body": "You exclude outliers on both ends, both the women with unrealistic expectations and those desperate enough to accept nearly anything. It still produces a distribution you can feel comfortable with.",
                    "author": "storm170",
                    "id": "in40r46",
                    "parent_id": "t1_in40ab7",
                    "score": -2,
                    "created_utc": 1662330190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even then. Regardless, they are not deserving of this sneering attitude.\n\nOne of the rules of this sub is to 'Remember the human'. Do try to do that please.",
            "author": "ShaArt5",
            "id": "in3fl34",
            "parent_id": "t1_in3e98a",
            "score": 1,
            "created_utc": 1662321045.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "in3fusf",
                    "parent_id": "t1_in3fl34",
                    "score": 1,
                    "created_utc": 1662321159.0,
                    "replies": [
                        {
                            "body": "You may not think you are, but you are implying that they are of less value. Especially with your last sentence in that post.",
                            "author": "ShaArt5",
                            "id": "in3gn87",
                            "parent_id": "t1_in3fusf",
                            "score": 1,
                            "created_utc": 1662321496.0,
                            "replies": [
                                {
                                    "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
                                    "author": "xa3D",
                                    "id": "in3h7w6",
                                    "parent_id": "t1_in3gn87",
                                    "score": 1,
                                    "created_utc": 1662321737.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This sub believes that sugar is a relationship, not a sexual service.  We respect other opinions, but \"sugar as sexwork\" \"SB as employee / service provider\" \"SD as employer /  client\" is not appropriate for this sub.\n\nRule #12: No Escorts/Johns",
                            "author": "sugarlifestyleforum-ModTeam",
                            "id": "in3okwf",
                            "parent_id": "t1_in3fusf",
                            "score": 1,
                            "created_utc": 1662324875.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah we may never know what's going through their minds. Last year I had an incredible encounter - best looking girl I've ever met off Seeking. 27, slim, petite, pretty as can be, wonderful French accent, a little bit shy...until we got to the bedroom and then fireworks. Screaming orgasms and the like. She didn't even ask for any gifts/finances. We met the next week and same again. Unbelievable. I did give her a generous gift (avearge for the area).  Following week she simply ghosted me. Ignored my whatsapp messages (yet never blocked me). So infuriating. She was the best. Never will know...BF came back on the scene? Another SD came along? Or she's just into brief encounters??",
            "author": null,
            "id": "inaiivu",
            "parent_id": "t1_in9856w",
            "score": 1,
            "created_utc": 1662454698.0,
            "replies": []
        },
        {
            "body": "   Well, you put it on Reddit, so different readers will have different reactions, and look at your experiences with a variety of viewpoints based in their own backgrounds 🤷‍♀️❤️‍🔥.",
            "author": "stocks-mostly-lower",
            "id": "ir1j0n6",
            "parent_id": "t1_ir1g5e5",
            "score": 1,
            "created_utc": 1664904824.0,
            "replies": []
        },
        {
            "body": "Mentally unstable is still a bit harsh. Perhaps there’s a meet in the middle word to describe her disgruntled behavior that doesn’t also cast a bad light on mental illness.",
            "author": "KingKimoi",
            "id": "in3hvmk",
            "parent_id": "t1_in3gbat",
            "score": -3,
            "created_utc": 1662322017.0,
            "replies": [
                {
                    "body": "Let’s see. Per the OP, his sb did the following: \nQuoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. \n\nNot sure how else to describe this woman’s behavior other than unstable? Either way, her behavior was a GIANT red flag.",
                    "author": null,
                    "id": "in3imit",
                    "parent_id": "t1_in3hvmk",
                    "score": 18,
                    "created_utc": 1662322337.0,
                    "replies": [
                        {
                            "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
                            "author": "GlitterAndSugar",
                            "id": "in3ssbq",
                            "parent_id": "t1_in3imit",
                            "score": 2,
                            "created_utc": 1662326666.0,
                            "replies": [
                                {
                                    "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                                    "author": null,
                                    "id": "in3sw8v",
                                    "parent_id": "t1_in3ssbq",
                                    "score": 6,
                                    "created_utc": 1662326712.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
                            "author": null,
                            "id": "in3rosu",
                            "parent_id": "t1_in3imit",
                            "score": 1,
                            "created_utc": 1662326206.0,
                            "replies": []
                        },
                        {
                            "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
                            "author": "KingKimoi",
                            "id": "in3jktt",
                            "parent_id": "t1_in3imit",
                            "score": 1,
                            "created_utc": 1662322753.0,
                            "replies": [
                                {
                                    "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                                    "author": "Fabulous_Storm2437",
                                    "id": "in4g5gc",
                                    "parent_id": "t1_in3jktt",
                                    "score": -1,
                                    "created_utc": 1662337474.0,
                                    "replies": [
                                        {
                                            "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                                            "author": "KingKimoi",
                                            "id": "in4h0ft",
                                            "parent_id": "t1_in4g5gc",
                                            "score": 1,
                                            "created_utc": 1662337872.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The guy is clearly telling the story and doing some embellishments for the sake of entertainment and telling an entertaining tale.\n\nI don't think its \"cyber stalking\" to look someone you are dating up. Who doesn't do this? Unhinged for doing that? Really? That is pretty common practice and like he said, whats out there isn't some giant secret that only a secret agent could uncover.\n\nShe may be greedy, possibly not. He hasn't said how much he gives her or what he expects from that. Furthermore, we don't have any further details on how hot she is or if she is quite capable of easily getting more from other men. Perhaps she went about it the wrong way....again, we only have his side to hear.",
            "author": "clair-cummings",
            "id": "in53n0q",
            "parent_id": "t1_in4kdiw",
            "score": 1,
            "created_utc": 1662348701.0,
            "replies": [
                {
                    "body": "Um... Looking dudes stocks up, where he works, finding his place of employment... All red flags.\nIf you don't find this weird then you have similar red flags.",
                    "author": "HeilerinVonDoom",
                    "id": "in53wgk",
                    "parent_id": "t1_in53n0q",
                    "score": 4,
                    "created_utc": 1662348841.0,
                    "replies": [
                        {
                            "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
                            "author": "clair-cummings",
                            "id": "in6cfm1",
                            "parent_id": "t1_in53wgk",
                            "score": 2,
                            "created_utc": 1662380644.0,
                            "replies": [
                                {
                                    "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                                    "author": "Positive-Daddy-594",
                                    "id": "in7kdka",
                                    "parent_id": "t1_in6cfm1",
                                    "score": 2,
                                    "created_utc": 1662399848.0,
                                    "replies": [
                                        {
                                            "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                                            "author": "clair-cummings",
                                            "id": "in7rp2d",
                                            "parent_id": "t1_in7kdka",
                                            "score": 2,
                                            "created_utc": 1662402826.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Narrator: she does.",
                            "author": "YlangScent",
                            "id": "in5rf92",
                            "parent_id": "t1_in53wgk",
                            "score": 1,
                            "created_utc": 1662364322.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry, but per the OP, his sb did the following: Quoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. All of those are giant red flags, not orange. \n\nIf a SB on here told the story about her SD behaving like this at dinner, we would all be telling her to run fast. \n\nEither way, sounds like their SR is over and both should end things.",
            "author": null,
            "id": "in3iqvf",
            "parent_id": "t1_in3il77",
            "score": 9,
            "created_utc": 1662322391.0,
            "replies": [
                {
                    "body": "I am very curious if either of them are religious and also what scripture would be appropriate for such an incident 😂",
                    "author": "KingKimoi",
                    "id": "in3k86z",
                    "parent_id": "t1_in3iqvf",
                    "score": 3,
                    "created_utc": 1662323025.0,
                    "replies": [
                        {
                            "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
                            "author": "WaterJourney67",
                            "id": "in3so0v",
                            "parent_id": "t1_in3k86z",
                            "score": 4,
                            "created_utc": 1662326616.0,
                            "replies": [
                                {
                                    "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                                    "author": "KingKimoi",
                                    "id": "in4344o",
                                    "parent_id": "t1_in3so0v",
                                    "score": 3,
                                    "created_utc": 1662331295.0,
                                    "replies": []
                                },
                                {
                                    "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                                    "author": null,
                                    "id": "inahztc",
                                    "parent_id": "t1_in3so0v",
                                    "score": 2,
                                    "created_utc": 1662454233.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No I completely agree both seem to not be on the same page anymore and should revisit their arrangement. I want to just be hopeful and give her the benefit of the doubt since it seemed like before they were an ideal match.",
                    "author": "KingKimoi",
                    "id": "in3k11b",
                    "parent_id": "t1_in3iqvf",
                    "score": 1,
                    "created_utc": 1662322942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol 100%.",
            "author": null,
            "id": "in3qbob",
            "parent_id": "t1_in3q7dq",
            "score": 1,
            "created_utc": 1662325620.0,
            "replies": []
        },
        {
            "body": "You exclude outliers on both ends, both the women with unrealistic expectations and those desperate enough to accept nearly anything. It still produces a distribution you can feel comfortable with.",
            "author": "storm170",
            "id": "in40r46",
            "parent_id": "t1_in40ab7",
            "score": -2,
            "created_utc": 1662330190.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "in3fusf",
            "parent_id": "t1_in3fl34",
            "score": 1,
            "created_utc": 1662321159.0,
            "replies": [
                {
                    "body": "You may not think you are, but you are implying that they are of less value. Especially with your last sentence in that post.",
                    "author": "ShaArt5",
                    "id": "in3gn87",
                    "parent_id": "t1_in3fusf",
                    "score": 1,
                    "created_utc": 1662321496.0,
                    "replies": [
                        {
                            "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
                            "author": "xa3D",
                            "id": "in3h7w6",
                            "parent_id": "t1_in3gn87",
                            "score": 1,
                            "created_utc": 1662321737.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This sub believes that sugar is a relationship, not a sexual service.  We respect other opinions, but \"sugar as sexwork\" \"SB as employee / service provider\" \"SD as employer /  client\" is not appropriate for this sub.\n\nRule #12: No Escorts/Johns",
                    "author": "sugarlifestyleforum-ModTeam",
                    "id": "in3okwf",
                    "parent_id": "t1_in3fusf",
                    "score": 1,
                    "created_utc": 1662324875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let’s see. Per the OP, his sb did the following: \nQuoted scripture, made threats to show up to his work, alternated between laughing and crying, brought papers of his public stock sale. Mind you, this all happened out in public at dinner. \n\nNot sure how else to describe this woman’s behavior other than unstable? Either way, her behavior was a GIANT red flag.",
            "author": null,
            "id": "in3imit",
            "parent_id": "t1_in3hvmk",
            "score": 18,
            "created_utc": 1662322337.0,
            "replies": [
                {
                    "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
                    "author": "GlitterAndSugar",
                    "id": "in3ssbq",
                    "parent_id": "t1_in3imit",
                    "score": 2,
                    "created_utc": 1662326666.0,
                    "replies": [
                        {
                            "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                            "author": null,
                            "id": "in3sw8v",
                            "parent_id": "t1_in3ssbq",
                            "score": 6,
                            "created_utc": 1662326712.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
                    "author": null,
                    "id": "in3rosu",
                    "parent_id": "t1_in3imit",
                    "score": 1,
                    "created_utc": 1662326206.0,
                    "replies": []
                },
                {
                    "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
                    "author": "KingKimoi",
                    "id": "in3jktt",
                    "parent_id": "t1_in3imit",
                    "score": 1,
                    "created_utc": 1662322753.0,
                    "replies": [
                        {
                            "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                            "author": "Fabulous_Storm2437",
                            "id": "in4g5gc",
                            "parent_id": "t1_in3jktt",
                            "score": -1,
                            "created_utc": 1662337474.0,
                            "replies": [
                                {
                                    "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                                    "author": "KingKimoi",
                                    "id": "in4h0ft",
                                    "parent_id": "t1_in4g5gc",
                                    "score": 1,
                                    "created_utc": 1662337872.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Um... Looking dudes stocks up, where he works, finding his place of employment... All red flags.\nIf you don't find this weird then you have similar red flags.",
            "author": "HeilerinVonDoom",
            "id": "in53wgk",
            "parent_id": "t1_in53n0q",
            "score": 4,
            "created_utc": 1662348841.0,
            "replies": [
                {
                    "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
                    "author": "clair-cummings",
                    "id": "in6cfm1",
                    "parent_id": "t1_in53wgk",
                    "score": 2,
                    "created_utc": 1662380644.0,
                    "replies": [
                        {
                            "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                            "author": "Positive-Daddy-594",
                            "id": "in7kdka",
                            "parent_id": "t1_in6cfm1",
                            "score": 2,
                            "created_utc": 1662399848.0,
                            "replies": [
                                {
                                    "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                                    "author": "clair-cummings",
                                    "id": "in7rp2d",
                                    "parent_id": "t1_in7kdka",
                                    "score": 2,
                                    "created_utc": 1662402826.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Narrator: she does.",
                    "author": "YlangScent",
                    "id": "in5rf92",
                    "parent_id": "t1_in53wgk",
                    "score": 1,
                    "created_utc": 1662364322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am very curious if either of them are religious and also what scripture would be appropriate for such an incident 😂",
            "author": "KingKimoi",
            "id": "in3k86z",
            "parent_id": "t1_in3iqvf",
            "score": 3,
            "created_utc": 1662323025.0,
            "replies": [
                {
                    "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
                    "author": "WaterJourney67",
                    "id": "in3so0v",
                    "parent_id": "t1_in3k86z",
                    "score": 4,
                    "created_utc": 1662326616.0,
                    "replies": [
                        {
                            "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                            "author": "KingKimoi",
                            "id": "in4344o",
                            "parent_id": "t1_in3so0v",
                            "score": 3,
                            "created_utc": 1662331295.0,
                            "replies": []
                        },
                        {
                            "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                            "author": null,
                            "id": "inahztc",
                            "parent_id": "t1_in3so0v",
                            "score": 2,
                            "created_utc": 1662454233.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No I completely agree both seem to not be on the same page anymore and should revisit their arrangement. I want to just be hopeful and give her the benefit of the doubt since it seemed like before they were an ideal match.",
            "author": "KingKimoi",
            "id": "in3k11b",
            "parent_id": "t1_in3iqvf",
            "score": 1,
            "created_utc": 1662322942.0,
            "replies": []
        },
        {
            "body": "You may not think you are, but you are implying that they are of less value. Especially with your last sentence in that post.",
            "author": "ShaArt5",
            "id": "in3gn87",
            "parent_id": "t1_in3fusf",
            "score": 1,
            "created_utc": 1662321496.0,
            "replies": [
                {
                    "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
                    "author": "xa3D",
                    "id": "in3h7w6",
                    "parent_id": "t1_in3gn87",
                    "score": 1,
                    "created_utc": 1662321737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This sub believes that sugar is a relationship, not a sexual service.  We respect other opinions, but \"sugar as sexwork\" \"SB as employee / service provider\" \"SD as employer /  client\" is not appropriate for this sub.\n\nRule #12: No Escorts/Johns",
            "author": "sugarlifestyleforum-ModTeam",
            "id": "in3okwf",
            "parent_id": "t1_in3fusf",
            "score": 1,
            "created_utc": 1662324875.0,
            "replies": []
        },
        {
            "body": "She’s not unstable, she’s upset. People do weird shit when they are upset.",
            "author": "GlitterAndSugar",
            "id": "in3ssbq",
            "parent_id": "t1_in3imit",
            "score": 2,
            "created_utc": 1662326666.0,
            "replies": [
                {
                    "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
                    "author": null,
                    "id": "in3sw8v",
                    "parent_id": "t1_in3ssbq",
                    "score": 6,
                    "created_utc": 1662326712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She could also be doing a calculated act designed to manipulate OP into giving her more money.  Doesn't need to be unstable to act like this",
            "author": null,
            "id": "in3rosu",
            "parent_id": "t1_in3imit",
            "score": 1,
            "created_utc": 1662326206.0,
            "replies": []
        },
        {
            "body": "We aren’t disagreeing It is very concerning behavior and if my partner or friend started acting this way I’d be alarmed and try to care for them as best as I could. Mentally unstable isn’t fair to bestow upon someone unless you know. it’s unfair how often mental illness gets thrown around to justify behavior or reactions from either POVs and that’s an incredibly unjust stigma. Even if she is mentally unstable we don’t know and we’re not able to diagnose her from OPs pov nor should we try to unless it’s to offer care.\n\nHowever, it’s at the very least a red flag behavior and should be dissected a bit more. Something could’ve triggered her idk we only know one side and we could spend eternity stringing excuses or justifications for the actions and reasons that caused this ultimately we don’t know. Her doing this in public isn’t shocking since meeting in public places is a standard safety precaution, her having a print out also isn’t that big of a deal She did her research so she’s showing her work🤷🏻‍♀️",
            "author": "KingKimoi",
            "id": "in3jktt",
            "parent_id": "t1_in3imit",
            "score": 1,
            "created_utc": 1662322753.0,
            "replies": [
                {
                    "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
                    "author": "Fabulous_Storm2437",
                    "id": "in4g5gc",
                    "parent_id": "t1_in3jktt",
                    "score": -1,
                    "created_utc": 1662337474.0,
                    "replies": [
                        {
                            "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                            "author": "KingKimoi",
                            "id": "in4h0ft",
                            "parent_id": "t1_in4g5gc",
                            "score": 1,
                            "created_utc": 1662337872.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol. If you think \"normal\" people don't do this all the time.....you'd be wrong.\n\nDid you miss the part where the person writing this wrote it is easy to find/public info?\n\nIts not red flags, its whats people do in this day and age. Which is why you don't go giving out your real name or phone number up front.",
            "author": "clair-cummings",
            "id": "in6cfm1",
            "parent_id": "t1_in53wgk",
            "score": 2,
            "created_utc": 1662380644.0,
            "replies": [
                {
                    "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
                    "author": "Positive-Daddy-594",
                    "id": "in7kdka",
                    "parent_id": "t1_in6cfm1",
                    "score": 2,
                    "created_utc": 1662399848.0,
                    "replies": [
                        {
                            "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                            "author": "clair-cummings",
                            "id": "in7rp2d",
                            "parent_id": "t1_in7kdka",
                            "score": 2,
                            "created_utc": 1662402826.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Narrator: she does.",
            "author": "YlangScent",
            "id": "in5rf92",
            "parent_id": "t1_in53wgk",
            "score": 1,
            "created_utc": 1662364322.0,
            "replies": []
        },
        {
            "body": "Interesting question. We were both brought up in (different) strict Christian traditions, and that formed a basis of connection. That said, we never previously quoted scripture to each other!",
            "author": "WaterJourney67",
            "id": "in3so0v",
            "parent_id": "t1_in3k86z",
            "score": 4,
            "created_utc": 1662326616.0,
            "replies": [
                {
                    "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
                    "author": "KingKimoi",
                    "id": "in4344o",
                    "parent_id": "t1_in3so0v",
                    "score": 3,
                    "created_utc": 1662331295.0,
                    "replies": []
                },
                {
                    "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
                    "author": null,
                    "id": "inahztc",
                    "parent_id": "t1_in3so0v",
                    "score": 2,
                    "created_utc": 1662454233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I speak nothing about value. I state the terms on which they would stay/leave: payment.\n\nMy last sentence is a comparison between the vanilla environment and SLF. Nowhere does that imply one has less value than the other.",
            "author": "xa3D",
            "id": "in3h7w6",
            "parent_id": "t1_in3gn87",
            "score": 1,
            "created_utc": 1662321737.0,
            "replies": []
        },
        {
            "body": "Whatever she is, she sounds batshit crazy and the OP should end things and run fast.",
            "author": null,
            "id": "in3sw8v",
            "parent_id": "t1_in3ssbq",
            "score": 6,
            "created_utc": 1662326712.0,
            "replies": []
        },
        {
            "body": "Mentally unstable isnt a diagnosis, more of an indicator of Risk that there might be an issue. It isnt the same as saying there is definitely a mental diagnosis",
            "author": "Fabulous_Storm2437",
            "id": "in4g5gc",
            "parent_id": "t1_in3jktt",
            "score": -1,
            "created_utc": 1662337474.0,
            "replies": [
                {
                    "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
                    "author": "KingKimoi",
                    "id": "in4h0ft",
                    "parent_id": "t1_in4g5gc",
                    "score": 1,
                    "created_utc": 1662337872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is where he messed up. At this early in the relationship, I would just be considering letting her know my real name and any employment information. Unfortunately, it sounds like she was good at developing trust.",
            "author": "Positive-Daddy-594",
            "id": "in7kdka",
            "parent_id": "t1_in6cfm1",
            "score": 2,
            "created_utc": 1662399848.0,
            "replies": [
                {
                    "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
                    "author": "clair-cummings",
                    "id": "in7rp2d",
                    "parent_id": "t1_in7kdka",
                    "score": 2,
                    "created_utc": 1662402826.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can’t even imagine how that would’ve sounded😂like but I’m sorry this happened !! I hope it works out for y’all ! In my head when I read that it just sounded like when my parents would fight and they’d throw scripture back and forth at each other and I was trying to imagine how it happened for you",
            "author": "KingKimoi",
            "id": "in4344o",
            "parent_id": "t1_in3so0v",
            "score": 3,
            "created_utc": 1662331295.0,
            "replies": []
        },
        {
            "body": "I was too. No sex outside marriage being a pretty huge part of the tradition! So this lifestyle is entirely sinful! And maybe she's very conflicted?",
            "author": null,
            "id": "inahztc",
            "parent_id": "t1_in3so0v",
            "score": 2,
            "created_utc": 1662454233.0,
            "replies": []
        },
        {
            "body": "So it’s not a diagnosis fair but we’re still not qualified to comment on her mental state. It should still not be used as an insult is my over all point. *and* if it really is a sign of instability it should maybe addressed. SDs/SBs are in no way each other’s therapists nor should they try to be but if you really care about someone and they suddenly act out of character to such an extent it’s cause for at least a conversation. \n\nIt’s also just not fun to see a cornucopia of remix’s to “oh she’s crazy/psycho/mentally unstable run” sometimes it’s just not that ? Sure there are in fact weirdos who are gross and toxic and manipulate people and act 50 shades of fresh off the funny farm, it’s just not every single SB who has a reaction/tantrum/POV/an opinion",
            "author": "KingKimoi",
            "id": "in4h0ft",
            "parent_id": "t1_in4g5gc",
            "score": 1,
            "created_utc": 1662337872.0,
            "replies": []
        },
        {
            "body": "Or maybe she's just semi-intelligent and he's just kinda....well....not? Why are we all assuming she's the bad guy here? They both play a role. I'm not willing to go so far as to say he's so great like he claims to be.",
            "author": "clair-cummings",
            "id": "in7rp2d",
            "parent_id": "t1_in7kdka",
            "score": 2,
            "created_utc": 1662402826.0,
            "replies": []
        }
    ]
}