{
    "title": "I just married my SD — AMA!",
    "post_id": "10pfa4i",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10pfa4i/i_just_married_my_sd_ama/",
    "author": "throwawaysugarbabe80",
    "body": "This is something that will die with me and I can never share with anyone else in my real life (me and my husband don’t even talk about this part of our past anymore and haven’t in years).\n\nAMA — because I want to share our story but only the bits that might interest people lol. \n\nI’m mid 20s, he’s early 40s.\nHe was married when we met.\nBoth childfree** but plan to try to conceive soonly.\nHe has a bit more than a 10M NW (10M in investments + two small properties).\nWe met on SA.\n\n**childless not childfree as kindly pointed out by another Redditor!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10pfa4i/i_just_married_my_sd_ama/",
    "score": 112,
    "upvote_ratio": 0.91,
    "created_utc": 1675115664.0,
    "num_comments": 141,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Did he leave for you or for him?\n\nETA: fwiw at this point having been exposed to how many people cheat, I'd rather end up marrying my SBF than someone else because at least we already have \"honor amongst thieves\" transparency. So I get your acceptance of the situation/risks there.",
            "author": null,
            "id": "j6k9k6a",
            "parent_id": "t3_10pfa4i",
            "score": 29,
            "created_utc": 1675118476.0,
            "replies": [
                {
                    "body": "I think he left for him but that I was the push needed for him to make that decision. The issues he told me he had in his marriage were:\n\n1. He has wanted children for nearly a decade now and his ex-wife didn’t, then agreed to try but apparently wasn’t being truthful about being off birth-control and ultimately told him she never would want kids. \n2. Lack of sex. He recognises this is his fault because his ex-wife never had a high libido to start with but (according to him) he dwindled to almost nothing a few years into their marriage. \n3. They became affectionate roommates more than anything and he wanted more and I made him realise there can be more to a relationship yadiyadiyada. \n\nBut he says number 1 was the biggest issue and that he started resenting her over it but is glad in a way it didn’t happen.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6katf1",
                    "parent_id": "t1_j6k9k6a",
                    "score": 30,
                    "created_utc": 1675118968.0,
                    "replies": [
                        {
                            "body": ">He has wanted children for nearly a decade now and his ex-wife didn’t, then agreed to try but apparently wasn’t being truthful about being off birth-control and ultimately told him she never would want kids\n\nThis is why I never believe in changing someone's mind if you already know you have incompatible life goals. There was a woman I was seeing regularly who was trying to convince me (perhaps for her sake) that \"she could change her mind!\" when I told her the kind of women I would automatically write off. She insisted that I have too many requirements and \"no one\" thinks that far ahead. I'm like, I don't have time to wait and guess like that. We were both in our late 30's and she has a surprisingly naive view on love and what's romantic.",
                            "author": "karmaextract",
                            "id": "j6kjxbe",
                            "parent_id": "t1_j6katf1",
                            "score": 15,
                            "created_utc": 1675122702.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah those are some big incompatibilities, interesting thanks!",
                            "author": null,
                            "id": "j6kb1ve",
                            "parent_id": "t1_j6katf1",
                            "score": 7,
                            "created_utc": 1675119060.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "how can you trust that he wont cheat on you or leave you once you’re older — like he did with his wife? (not judging just curious as i deal w trust issues myself)",
            "author": "only17queen",
            "id": "j6k6d4g",
            "parent_id": "t3_10pfa4i",
            "score": 43,
            "created_utc": 1675117220.0,
            "replies": [
                {
                    "body": "I absolutely can’t. We’ve had these discussions together. He’s more worried about me leaving him and cheating on him according to him. I’m 100% aware that what he did to her he could always do to me. But to be honest… this is a risk I’m willing to take. Worst case scenario I’m a divorcee and got some karma. Life will go on.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6k73wn",
                    "parent_id": "t1_j6k6d4g",
                    "score": 63,
                    "created_utc": 1675117507.0,
                    "replies": [
                        {
                            "body": "All power to you! Congrats to you & your previous SD/future husband! I will say that many of us get cheated on with vanilla relationships as well so I just see it as a potential risk regardless 😅😅 \n\nI hope I'll get a husband who's well off, kind, respectful, and adores me so I hopefully don't have to worry about that but we'll see what the future holds lol. I hope you have a successful marriage!",
                            "author": "di_caro2811",
                            "id": "j6kb08d",
                            "parent_id": "t1_j6k73wn",
                            "score": 9,
                            "created_utc": 1675119042.0,
                            "replies": []
                        },
                        {
                            "body": "I've been married twice. Met my 1st wife at 19, we were dead bedroom by the age of 25. I cheated on her with my second wife. Was with my 2nd wife for 26yrs and never cheated once.\n\nMy 2nd wife had cheated with me on her previous husband. We both went into the marriage with eyes wide open. There's something about mutual trust when both already know the score. It is it's own contract if that makes any sense?",
                            "author": "Sunhillian",
                            "id": "j6kb3cb",
                            "parent_id": "t1_j6k73wn",
                            "score": 38,
                            "created_utc": 1675119076.0,
                            "replies": [
                                {
                                    "body": "ahh so you both are shitty cheaters. perfect for each other",
                                    "author": "epyon-",
                                    "id": "j6m707g",
                                    "parent_id": "t1_j6kb3cb",
                                    "score": 4,
                                    "created_utc": 1675155123.0,
                                    "replies": [
                                        {
                                            "body": "Welcome to SLF, an interesting contribution for your first post 🤔. \n\nDo you have any interest or experience in this community or is your post a one and done?",
                                            "author": "Sunhillian",
                                            "id": "j6mfj6z",
                                            "parent_id": "t1_j6m707g",
                                            "score": 6,
                                            "created_utc": 1675162437.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Really Epyon?  SA and sites like it are almost built on cheaters.  If you've been in the Bowl for more than a few months you'd know that most SB's (at least one's I've encountered over the years) don't care about the SD's relationship status, and in fact many prefer taken men.  It limits the time the SB has to spend with him, and in the case of SB's who are scammers / bad actors to blackmail those men.  I'm single but I've had a few SB's dumb enough to brag to me about blackmail / extortion of married SD's.  This is not a dating world where monogamy and true love are the goal, but good for the OP if she found it.  Being a \"shitty cheater\" means nothing in the sugar world in my opinion.\n\nI just hope the OP has a pre-nup......and while it's great that she trusts him and is fully aware of the potential issues, the trade in after he wants something younger comments I read sound like they fit this guys personality.  So trust all you want, but document and protect yourself would be my advise to her.",
                                            "author": "Snoo71180",
                                            "id": "j6ma31a",
                                            "parent_id": "t1_j6m707g",
                                            "score": 3,
                                            "created_utc": 1675157809.0,
                                            "replies": [
                                                {
                                                    "body": "He's responding to me Snoo, my marriage wasn't an SR, he's just trying to be obnoxious and succeeding 😴\n\nNor is he an SD, he's a med student with nothing more important to do than stick his nose in where it's of no value 😏",
                                                    "author": "Sunhillian",
                                                    "id": "j6mf0ve",
                                                    "parent_id": "t1_j6ma31a",
                                                    "score": 3,
                                                    "created_utc": 1675162023.0,
                                                    "replies": [
                                                        {
                                                            "body": "just pointing out that there are better ways to end a relationship before cheating",
                                                            "author": "epyon-",
                                                            "id": "j6nf34t",
                                                            "parent_id": "t1_j6mf0ve",
                                                            "score": -3,
                                                            "created_utc": 1675180643.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "ive read a lot of the opposite. many who dont want to deal with a potential pissed off wife. i guess to each their own …",
                                                    "author": "epyon-",
                                                    "id": "j6nf6k7",
                                                    "parent_id": "t1_j6ma31a",
                                                    "score": -2,
                                                    "created_utc": 1675180679.0,
                                                    "replies": [
                                                        {
                                                            "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
                                                            "author": "Snoo71180",
                                                            "id": "j6o6lqs",
                                                            "parent_id": "t1_j6nf6k7",
                                                            "score": 1,
                                                            "created_utc": 1675190752.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "One of my consulting clients pretty much fit that description absent the desire to have kids (he had several with prior wife).  Great wife , loved airplanes also (they had 4 or 5 and an airport on the ranch) .  She got along well with the kids from prior marriage.",
                            "author": "pinotandsugar",
                            "id": "j6kcgc3",
                            "parent_id": "t1_j6k73wn",
                            "score": 2,
                            "created_utc": 1675119615.0,
                            "replies": []
                        },
                        {
                            "body": "AND - one HUGE AND IMPORTANT factor in your favor\n\nI SERIOUSLY doubt you will ever let there be a DEAD BEDROOM in your marriage!! :-)",
                            "author": "sd424242",
                            "id": "j6l4juc",
                            "parent_id": "t1_j6k73wn",
                            "score": 0,
                            "created_utc": 1675131763.0,
                            "replies": []
                        },
                        {
                            "body": "1,000% CORRECT!",
                            "author": "xex4u",
                            "id": "j6nkcr2",
                            "parent_id": "t1_j6k73wn",
                            "score": 1,
                            "created_utc": 1675182633.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you sign a prenup?\n\nDuring the divorce, was his wife aware of your existence? Is she currently aware he was seeing you while they were married?\n\nWhen friends or family ask how you met (or even when you met), how do you respond?\n\nThe fact he has no kids from that marriage will make your and his life much easier.",
            "author": "geeky-sd",
            "id": "j6kaaq4",
            "parent_id": "t3_10pfa4i",
            "score": 12,
            "created_utc": 1675118765.0,
            "replies": [
                {
                    "body": "We have a prenup but it’s kinda useless since we married under the separate property system (Europeans). It’s essentially just a list of all the assets we both have. We are building a house though and 70% of the equity will be mine (put under contract).\n\nHis wife was aware of me during the last year of their marriage. He just stopped caring about keeping me a secret. She wanted to stay married despite knowing about me.\n\nI’m counting my lucky stars they didn’t really have property or kids together. They had a vacation home in her home country he left her during the divorce.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kbm2h",
                    "parent_id": "t1_j6kaaq4",
                    "score": 23,
                    "created_utc": 1675119280.0,
                    "replies": [
                        {
                            "body": "I edited my question while you were answering so you probably didn't see this:\n\nWhen friends or family ask how you met (or even when you met), how do you respond?",
                            "author": "geeky-sd",
                            "id": "j6kc0q8",
                            "parent_id": "t1_j6kbm2h",
                            "score": 5,
                            "created_utc": 1675119442.0,
                            "replies": [
                                {
                                    "body": "We made up a whole fake story and I think we are slowly starting to believe this is actually how we met lmfao. We never ever mention SA, not even to each other and haven’t in years.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kcqr1",
                                    "parent_id": "t1_j6kc0q8",
                                    "score": 8,
                                    "created_utc": 1675119730.0,
                                    "replies": [
                                        {
                                            "body": "How long ago did you first meet, and how long have you been married?\n\nIt's fascinating, hopefully you don't mind the questions (I realize you said \"AMA\"). Thank you for indulging us! I presume no chance he's reading any of this.",
                                            "author": "geeky-sd",
                                            "id": "j6kd991",
                                            "parent_id": "t1_j6kcqr1",
                                            "score": 5,
                                            "created_utc": 1675119943.0,
                                            "replies": [
                                                {
                                                    "body": "We met 4years ago. He filed for divorce 2 years ago, immediately proposed to me and we got married two months ago (officially but had our ceremony literally yesterday.)\n\nI don’t mind the questions at all, I haven’t been able to tell this stuff to anyone ever so it’s liberating in a way. \n\n> I presume no chance he’s reading this.\n\nI wouldn’t care if he was but he finds Reddit weird and thinks I spend too much time on it so I doubt he is lol.",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6kdx2j",
                                                    "parent_id": "t1_j6kd991",
                                                    "score": 13,
                                                    "created_utc": 1675120209.0,
                                                    "replies": [
                                                        {
                                                            "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
                                                            "author": "geeky-sd",
                                                            "id": "j6ke4lb",
                                                            "parent_id": "t1_j6kdx2j",
                                                            "score": 3,
                                                            "created_utc": 1675120292.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                                                                    "author": "throwawaysugarbabe80",
                                                                    "id": "j6keu5e",
                                                                    "parent_id": "t1_j6ke4lb",
                                                                    "score": 16,
                                                                    "created_utc": 1675120583.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congrats! I like reading these instead of “I got scammed” or “so many abusive johns on seeking” posts.",
            "author": "icequeen1999",
            "id": "j6khbub",
            "parent_id": "t3_10pfa4i",
            "score": 27,
            "created_utc": 1675121613.0,
            "replies": [
                {
                    "body": "I used to be an active participant on here years ago but I stopped after a few months because a lot of posts and advice just didn’t apply to my SR. \n\nI’m glad to see not much has changed (except the average PPM cited by SBs in the allowance thread seems to have doubled, inflation is crazy!)",
                    "author": "throwawaysugarbabe80",
                    "id": "j6khxa9",
                    "parent_id": "t1_j6khbub",
                    "score": 10,
                    "created_utc": 1675121862.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "j6kj1qf",
                            "parent_id": "t1_j6khxa9",
                            "score": 5,
                            "created_utc": 1675122334.0,
                            "replies": [
                                {
                                    "body": "Oh I was joking! I love the fact the SBs here vehemently advocate for newlings in the bowl. I don’t believe women here are making up these numbers. I’ve been out of the bowl for 4years, so I’m out the loop.\n\nThank you so much sweetheart, I’m very happy you have a fulfilling SR. May it last many more years and may you continue to be spoiled.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kjkvr",
                                    "parent_id": "t1_j6kj1qf",
                                    "score": 1,
                                    "created_utc": 1675122558.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes this is such good news!",
                    "author": "Friendly_Boat_4088",
                    "id": "j6mz2cy",
                    "parent_id": "t1_j6khbub",
                    "score": 1,
                    "created_utc": 1675174094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations!!! Hope you both live happily ever after.",
            "author": null,
            "id": "j6kbak2",
            "parent_id": "t3_10pfa4i",
            "score": 17,
            "created_utc": 1675119155.0,
            "replies": [
                {
                    "body": "Thank you so much!!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kcdo2",
                    "parent_id": "t1_j6kbak2",
                    "score": 7,
                    "created_utc": 1675119586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I also would like to know how you trust him if he was married when you met. No judgment but I myself would be worried especially as I aged",
            "author": "Equivalent_Newt_6969",
            "id": "j6k6yk4",
            "parent_id": "t3_10pfa4i",
            "score": 7,
            "created_utc": 1675117449.0,
            "replies": [
                {
                    "body": "This is a super relevant question and something I thought about a lot when he brought up the idea of divorcing and starting a life together. I ultimately decided that it’s 100% possible he’ll do this to me in the future but I’m going to go into the relationship trusting he won’t. I can’t control his actions, only mine and I’ll act accordingly if he ever breaks that trust but I wouldn’t be giving our marriage a fair shot if I didn’t extend him that initial trust. \n\nIf he ever leaves me over this; oh well. Karma is a bitch and I got it coming.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6k7sng",
                    "parent_id": "t1_j6k6yk4",
                    "score": 14,
                    "created_utc": 1675117775.0,
                    "replies": [
                        {
                            "body": "Are you exclusive, or are you comfortable with him having SBs outside your marriage?\n\nIf not: Are you trolling SA to verify that?",
                            "author": "geeky-sd",
                            "id": "j6kaxoz",
                            "parent_id": "t1_j6k7sng",
                            "score": 5,
                            "created_utc": 1675119015.0,
                            "replies": [
                                {
                                    "body": "We’re exclusive. Nope. I will leave if he cheats on me (hypocrite central) and I’ve made that very very clear. \n\nI don’t watch what he does, no.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kccam",
                                    "parent_id": "t1_j6kaxoz",
                                    "score": 9,
                                    "created_utc": 1675119571.0,
                                    "replies": [
                                        {
                                            "body": "I think it makes sense. It sounds like he turned to sugaring out of loneliness and not an addiction to promiscuity or young pussy or cheating. So knock on wood with their compatibility be wouldnt cheat on OP.",
                                            "author": "Equivalent_Newt_6969",
                                            "id": "j6kd6z9",
                                            "parent_id": "t1_j6kccam",
                                            "score": 4,
                                            "created_utc": 1675119917.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">We’re exclusive. Nope. I will leave if he cheats on me (**hypocrite central**) and I’ve made that very very clear.\n\nI don't think I would characterize that as hypocritical. He broke a promise he made to someone else. You're telling him that if he breaks a promise he made to you, then you're out the door. \"Hypocritical\" would be if you told him you wouldn't tolerate something that you have done before. Not the case here.",
                                            "author": "geeky-sd",
                                            "id": "j6kcztu",
                                            "parent_id": "t1_j6kccam",
                                            "score": 5,
                                            "created_utc": 1675119834.0,
                                            "replies": [
                                                {
                                                    "body": "I fully support people willing to consider themselves hypocritical. It promotes humility and self awareness and also helps her be aware and take caution when needed if her husband tries to do the same thing again.\n\nTrying to make mental gymnastics to justify one self when one is involved the very thing they would not allow happen to themself promotes complacency and is how you end up with that other girl the other day ratting out her ex's scheme to defraud SB's by selling their pics here on SLF.\n\nI mean, I'm not going to go out of my way and insult her for it, but if she's willing to acknowledge it herself there's no need for coddling either.",
                                                    "author": "karmaextract",
                                                    "id": "j6kmx1q",
                                                    "parent_id": "t1_j6kcztu",
                                                    "score": 4,
                                                    "created_utc": 1675123967.0,
                                                    "replies": [
                                                        {
                                                            "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
                                                            "author": "throwawaysugarbabe80",
                                                            "id": "j6kpzzq",
                                                            "parent_id": "t1_j6kmx1q",
                                                            "score": 4,
                                                            "created_utc": 1675125308.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                                                                    "author": "karmaextract",
                                                                    "id": "j6ks569",
                                                                    "parent_id": "t1_j6kpzzq",
                                                                    "score": 2,
                                                                    "created_utc": 1675126249.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                                                                    "author": "geeky-sd",
                                                                    "id": "j6l6cou",
                                                                    "parent_id": "t1_j6kpzzq",
                                                                    "score": 2,
                                                                    "created_utc": 1675132569.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thank you for going through the trouble to find these back!",
                                                                            "author": "throwawaysugarbabe80",
                                                                            "id": "j6lz2gq",
                                                                            "parent_id": "t1_j6l6cou",
                                                                            "score": 1,
                                                                            "created_utc": 1675148679.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                                                                    "author": "geeky-sd",
                                                                                    "id": "j6mgtqn",
                                                                                    "parent_id": "t1_j6lz2gq",
                                                                                    "score": 1,
                                                                                    "created_utc": 1675163450.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I was wondering this too - OP, are you going to have access to his socials and/or will you be looking through his socials? NGL, if I would have a relationship with SD that previously cheated with me ,  I'd want all access 😅",
                                    "author": "di_caro2811",
                                    "id": "j6kbzyo",
                                    "parent_id": "t1_j6kaxoz",
                                    "score": 2,
                                    "created_utc": 1675119433.0,
                                    "replies": [
                                        {
                                            "body": "He doesn’t have any socials outside from LinkedIn and Facebook and he doesn’t use even use the latter. But if he did I wouldn’t look through them. I can go on his phone whenever I want but I never do, I genuinely am not worried about this even though I know he could do it. But I do understand why you’d want to watch everything",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6kicb7",
                                            "parent_id": "t1_j6kbzyo",
                                            "score": 5,
                                            "created_utc": 1675122036.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly if you need to go through phones and such, you shouldn't be in the relationship at all. Obviously doing things like that may save a bit of grief, but the craziness you'll whip yourself into is NOT worth it. Trust, or don't trust, and let the chips fall where they may. Otherwise it's doomed from the start. (I'm saying this as a dude who got cheated on last year and thank my lucky stars I trusted her until I found out, since it saved me a lot of psychosis).",
                                                    "author": "billbar",
                                                    "id": "j6lcnty",
                                                    "parent_id": "t1_j6kicb7",
                                                    "score": 4,
                                                    "created_utc": 1675135468.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "That does help that he doesn't have many socials, and I think it's nice that you can go through his cell, even if you don't. And that's understandable, it's good that you're not feeling like you need to be on high alert. Honestly, I'm usually pretty trusting as well, but in this type of scenario, I seem not to be 😅 I'm glad things are working out well for you both!",
                                                    "author": "di_caro2811",
                                                    "id": "j6kn28q",
                                                    "parent_id": "t1_j6kicb7",
                                                    "score": 1,
                                                    "created_utc": 1675124029.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I can only aspire to have this mentality! I have major trust issues that I’m trying to work through.",
                            "author": "Nana_ccs",
                            "id": "j6od2mp",
                            "parent_id": "t1_j6k7sng",
                            "score": 1,
                            "created_utc": 1675193153.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congratulations!!\n\nMay your problems be small - and your joys/happinesses be many!",
            "author": "sd424242",
            "id": "j6l4cip",
            "parent_id": "t3_10pfa4i",
            "score": 5,
            "created_utc": 1675131673.0,
            "replies": []
        },
        {
            "body": "As someone who has also found deep and meaningful true love in the bowl, I wish you and your man much happiness! My question is, have you guys constructed an \"origin story\" for friends/family etc?",
            "author": "roscoe7585",
            "id": "j6khvev",
            "parent_id": "t3_10pfa4i",
            "score": 4,
            "created_utc": 1675121840.0,
            "replies": [
                {
                    "body": "Yes. We’ll stick to it until we die 😂😂 \n\nThank you, I wish you all the same! I’m very excited to see what the future looks like for us",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kih1t",
                    "parent_id": "t1_j6khvev",
                    "score": 5,
                    "created_utc": 1675122091.0,
                    "replies": [
                        {
                            "body": "What is it (without being too specific obviously)?    The age and wealth gaps are certainly well-known to your families.  Idk if there’s an attractiveness gap as well.   What’s your cover story and are you sure no one suspects the truth?",
                            "author": "DarthDaddius",
                            "id": "j6l153s",
                            "parent_id": "t1_j6kih1t",
                            "score": 1,
                            "created_utc": 1675130248.0,
                            "replies": [
                                {
                                    "body": "He often gets invited at events as a potential investor. I used to be a waitress but for a company, not a restaurant. I would get hired for such events. Our story is that we met at one of those events but that said event is tech-related and that I* started a discussion with him towards the end of my shift. \n\nI have no idea if people buy it, and I don’t care, it’s how we met and that’s it 😂\n\nThere’s an attractiveness gap and I’m black, while he’s white so on paper we’re mismatched. My husband is fit and tall though so it’s not extreme but I know what people think when they see us each other. Don’t care, am happy.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6l2s9e",
                                    "parent_id": "t1_j6l153s",
                                    "score": 9,
                                    "created_utc": 1675130974.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for answering.",
                                            "author": "DarthDaddius",
                                            "id": "j6l3gr9",
                                            "parent_id": "t1_j6l2s9e",
                                            "score": 2,
                                            "created_utc": 1675131277.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Nice. In ours we met on a train to a music festival and she approached me in the dining car 😂",
                                            "author": "roscoe7585",
                                            "id": "j6mvv6c",
                                            "parent_id": "t1_j6l2s9e",
                                            "score": 2,
                                            "created_utc": 1675172589.0,
                                            "replies": [
                                                {
                                                    "body": "That’s way more creative haha. Nice to see others who went legit!",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6mwpdi",
                                                    "parent_id": "t1_j6mvv6c",
                                                    "score": 2,
                                                    "created_utc": 1675172994.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Thank you for sharing!  Wondering if you've had any struggles due to race differences?  Are you the first black girl he's shared such an intimate and close relationship with?",
                                            "author": "Beneficial-Photo-431",
                                            "id": "j6pa1v5",
                                            "parent_id": "t1_j6l2s9e",
                                            "score": 2,
                                            "created_utc": 1675205521.0,
                                            "replies": [
                                                {
                                                    "body": "My husband exclusively prefers and only dates black women. His ex-wife is black. I didn’t need to teach him anything, thankfully!",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6rj213",
                                                    "parent_id": "t1_j6pa1v5",
                                                    "score": 2,
                                                    "created_utc": 1675251410.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Does “attractiveness gap” mean one of you is hotter than the other lol?  Which one?!\n\nCongrats!",
                                            "author": "ronitabonita",
                                            "id": "j6lhwx3",
                                            "parent_id": "t1_j6l2s9e",
                                            "score": 0,
                                            "created_utc": 1675138034.0,
                                            "replies": [
                                                {
                                                    "body": "Yes! I’m the hot one. Respectfully lol",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6lxuvm",
                                                    "parent_id": "t1_j6lhwx3",
                                                    "score": 9,
                                                    "created_utc": 1675147782.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Oh my gosh!! This is my husband and I. It’s insane how much our stories are similar. We also have constructed a story.",
                                            "author": "Snoo_72748",
                                            "id": "j6ndzmt",
                                            "parent_id": "t1_j6l2s9e",
                                            "score": 1,
                                            "created_utc": 1675180230.0,
                                            "replies": [
                                                {
                                                    "body": "I just read your post and I wish you lived near me! So many similarities down to building the multimillion dollars home! My life is so different now, as such a young age, it’s crazy. I sometimes can’t believe I got so lucky and I get to be so happy. My mom raised us all alone growing up and she had it tough and she often says she thinks God sent me my husband because she suffered enough.\n\nI wish you guys many many more years of happiness!",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6ngfa8",
                                                    "parent_id": "t1_j6ndzmt",
                                                    "score": 1,
                                                    "created_utc": 1675181153.0,
                                                    "replies": [
                                                        {
                                                            "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
                                                            "author": "Snoo_72748",
                                                            "id": "j6niu51",
                                                            "parent_id": "t1_j6ngfa8",
                                                            "score": 1,
                                                            "created_utc": 1675182059.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                                                                    "author": "throwawaysugarbabe80",
                                                                    "id": "j6nl95w",
                                                                    "parent_id": "t1_j6niu51",
                                                                    "score": 1,
                                                                    "created_utc": 1675182973.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                                                                            "author": "Snoo_72748",
                                                                            "id": "j6no8md",
                                                                            "parent_id": "t1_j6nl95w",
                                                                            "score": 1,
                                                                            "created_utc": 1675184067.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                                                                    "author": "throwawaysugarbabe80",
                                                                                    "id": "j6npeu7",
                                                                                    "parent_id": "t1_j6no8md",
                                                                                    "score": 1,
                                                                                    "created_utc": 1675184490.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you still receive an allowance?",
            "author": "eddie_pesos_dvg",
            "id": "j6k8u15",
            "parent_id": "t3_10pfa4i",
            "score": 3,
            "created_utc": 1675118185.0,
            "replies": [
                {
                    "body": "Yes, I receive the same amount I used to each month but I don’t have any expenses anymore because he pays for basically everything. It’ll most likely stop once I start working (I’m still studying for my Masters) but then I’ll just spend my salary however I want.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6k9ka4",
                    "parent_id": "t1_j6k8u15",
                    "score": 13,
                    "created_utc": 1675118477.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just a quick note - if you want to have children that makes you childless, not childfree. Childfree refers to people who do not ever want children for any reason. \n\nGlad you feel that you’ve found happiness! Hopefully there’s a pre-nup involved ❤️",
            "author": "2110daisy",
            "id": "j6l0seb",
            "parent_id": "t3_10pfa4i",
            "score": 3,
            "created_utc": 1675130089.0,
            "replies": [
                {
                    "body": "Thanks for the correction, will edit!  And thank you so much❤️",
                    "author": "throwawaysugarbabe80",
                    "id": "j6l1hha",
                    "parent_id": "t1_j6l0seb",
                    "score": 1,
                    "created_utc": 1675130402.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First off, congratulations! Did you ever think this was gonna happen when you met on SA? Have you always been open to marriage when you signed up? Were you his first SB?",
            "author": "iknowwhatiwantbroski",
            "id": "j6klnu7",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675123430.0,
            "replies": [
                {
                    "body": "Thank you! Absolutely not, I 100% went in thinking this was going to be a temporary experience and kept that mindset for the first year of our relationship. \n\nI was not open to marriage when I signed up, I just wanted an experience and after I would meet my actual life partner. \n\nI was… sort of? He had another one shortly before me, they went on two dates. He then had a date with me and he stopped seeing her. She goes to the same university as me so I’ve seen her while with him before.\n\nHe had an affair with another woman before but she wasn’t getting an allowance or anything like that, he would just pay for everything. They have the same age  too.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kmqoi",
                    "parent_id": "t1_j6klnu7",
                    "score": 4,
                    "created_utc": 1675123890.0,
                    "replies": [
                        {
                            "body": "What was the moment when you realized that this was going to be a serious, long term relationship? \n\nSorry about all the questions. I've been happily together with mine for 3 years and I just wanted to know what it's like for other long term couples 😅",
                            "author": "iknowwhatiwantbroski",
                            "id": "j6kn8fr",
                            "parent_id": "t1_j6kmqoi",
                            "score": 2,
                            "created_utc": 1675124102.0,
                            "replies": [
                                {
                                    "body": "Congrats on the 3 years!! Are you hoping you guys will make it down the aisle?\n\nI don’t have one particular big moment. There are a few instances where I remember realising he was in for the long-haul:\n• He insisted on calling me his girlfriend like a month in. I would joke that a married man doesn’t have a girlfriend but a mistress but he hated anything but the word “girlfriend”.\n\n• He stopped caring about all kinds of OPSEC super early on. He had a different phone at first to message me he kept in his office and then he got worried I wouldn’t be able to contact him in case of emergency so I got his real number and ultimately he just started messaging me on there. He would also just bring me wherever; we regularly had dates literally a few meters from his workplace. \n\n• When his wife found out about me I told him he really should be more careful going forward because I didn’t want him to have to stop our relationship over this and he said at that point he didn’t think anything would stop him from being with me. \n\nI believe we were on vacation in Barcelona, like a year in when I thought “I wouldn’t mind this lasting for many many more years” but I didn’t have a revelation or anything.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kp6k6",
                                    "parent_id": "t1_j6kn8fr",
                                    "score": 3,
                                    "created_utc": 1675124946.0,
                                    "replies": [
                                        {
                                            "body": "Sounds like you're the right person who came along at just the right time. May you have the happy marriage  that you're both looking for!\n\nIm fully accepting of the fact that mine wont leave his wife for me but we've been talking about how things would be for us long term and how I'll still be taken care of even after he's gone. We have an age gap of 30 years so I really dont think there's enough years in his lifetime for another marriage but we're happy just the way we are",
                                            "author": "iknowwhatiwantbroski",
                                            "id": "j6kqy4b",
                                            "parent_id": "t1_j6kp6k6",
                                            "score": 5,
                                            "created_utc": 1675125724.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I want this to happen for me too. Congratulations!",
            "author": "Mysterious_Fox_8616",
            "id": "j6krell",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675125922.0,
            "replies": []
        },
        {
            "body": "Did either of you enter the arrangement entertaining the idea of marriage or did it just happen eventually",
            "author": "SW1981",
            "id": "j6kzx8w",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675129705.0,
            "replies": [
                {
                    "body": "It happened eventually, he had no plan to leave his wife when we met and I had no plan to stay with him beyond my college years.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6l1ct6",
                    "parent_id": "t1_j6kzx8w",
                    "score": 3,
                    "created_utc": 1675130344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "chiming in to say Congrats!!!",
            "author": "Gemini-Fox",
            "id": "j6l9i0o",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675133992.0,
            "replies": []
        },
        {
            "body": "Did you ever get dragged into the divorce? If you did, how'd you handle that?\n\nCongrats though, wishing you a lifetime of happiness <3",
            "author": "happylilegg",
            "id": "j6lavo6",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675134635.0,
            "replies": [
                {
                    "body": "I wasn’t. Unless I asked for updates, he wouldn’t even talk about it. He just told me when he filed and when it got finalised.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6lxsg7",
                    "parent_id": "t1_j6lavo6",
                    "score": 1,
                    "created_utc": 1675147731.0,
                    "replies": [
                        {
                            "body": "that's how you know he was for real\n\nas opposed to the usual \"I'm juuuuuuust about to leave her\"",
                            "author": "Gemini-Fox",
                            "id": "j6svqpy",
                            "parent_id": "t1_j6lxsg7",
                            "score": 1,
                            "created_utc": 1675273050.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That so sweet 🥰\n\nI could imagine marrying my second SB but sadly we separated\n\nHe seems to be a good guy just lacking children and sex with his previous wife",
            "author": "GuyFromParis",
            "id": "j6lthvh",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675144732.0,
            "replies": [
                {
                    "body": "Why did it end?",
                    "author": "throwawaysugarbabe80",
                    "id": "j6lzgcc",
                    "parent_id": "t1_j6lthvh",
                    "score": 2,
                    "created_utc": 1675148961.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have you ever met her? Sat down with her and listened to her side of the story?",
            "author": "VomitOnSweater",
            "id": "j6mcywy",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675160296.0,
            "replies": [
                {
                    "body": "I haven’t.  She called me once when she found out about me during their marriage in the middle of the night on his phone and for a while I kept getting called by an anonymous number and each time I would pick up they would hang up. If she ever wanted to speak to me, I’d be open to a conversation but I don’t personally feel a need to speak to her.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6mtser",
                    "parent_id": "t1_j6mcywy",
                    "score": 3,
                    "created_utc": 1675171559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When you first met him how attracted to him were you be honest.\n\nIf he lost all his money would you still stay with him?",
            "author": "46yearoldpimp",
            "id": "j6nnste",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675183908.0,
            "replies": [
                {
                    "body": "> When you first met him how attracted to him were you be honest.\n\nSo attraction doesn’t exist in a vacuum for me. I have never met a man and thought purely based off his physical appearance I would have sex with him. My husband wasn’t the ideal physical type of 21year old me in the same way I was his ideal type but I did find him physically attractive by the time we had sex with one another. His success definitely plays into that attraction but I only find successful men attractive. \n\n> If he lost all his money would you still stay with him?\n\nDepends. If he lost it because he suddenly decided to spend it all in casinos? No. If he lost it because for whatever reason all his investments failed? Yes.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6np87s",
                    "parent_id": "t1_j6nnste",
                    "score": 1,
                    "created_utc": 1675184423.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j6oqykz",
                            "parent_id": "t1_j6np87s",
                            "score": 1,
                            "created_utc": 1675198304.0,
                            "replies": [
                                {
                                    "body": "I don’t think it’s a « most women »-thing. My closest girlfriends are all with men their age who aren’t what I would consider successful but they are also seemingly happy. What I want in a man =/= what most women want in a man. I can only speak for myself. \n\nAlso… this is a self-selecting club isn’t it? Women who like attractive men will become SBs while most women won’t because they don’t care as much. So naturally all your SBs valued success way more than the average woman.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6ost9k",
                                    "parent_id": "t1_j6oqykz",
                                    "score": 3,
                                    "created_utc": 1675198982.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j6nxu8v",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675187548.0,
            "replies": [
                {
                    "body": "Eh… not really no. For starters, he accumulated the 10M prior to marrying me, so it’s not a marriage asset. Secondly, we’re in Europe. The « divorce and take half »-thing only truly holds true in the Noth-America and possibly the UK.\n\nThe prenup-bit is also terrible advice: a good prenup protects both parties.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6o2v3g",
                    "parent_id": "t1_j6nxu8v",
                    "score": 3,
                    "created_utc": 1675189389.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j6oct37",
                            "parent_id": "t1_j6o2v3g",
                            "score": 1,
                            "created_utc": 1675193056.0,
                            "replies": [
                                {
                                    "body": "They are already divorced lol, so I know exactly how much he got. And yep, he got to keep all the 10M. Let me introduce you to the concept of marital property systems and how they differ in each country!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6odfjf",
                                    "parent_id": "t1_j6oct37",
                                    "score": 1,
                                    "created_utc": 1675193288.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j6offk4",
                                            "parent_id": "t1_j6odfjf",
                                            "score": 1,
                                            "created_utc": 1675194035.0,
                                            "replies": [
                                                {
                                                    "body": "Girl…. Did you like completely skip the title? I’m already married. The prenup was drafted and signed months ago.",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6ogvkp",
                                                    "parent_id": "t1_j6offk4",
                                                    "score": 1,
                                                    "created_utc": 1675194572.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What’s the pre-nup look like?",
            "author": "j19104",
            "id": "j6ka3k1",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675118687.0,
            "replies": []
        },
        {
            "body": "Tell us about the prenup",
            "author": "sugardad123",
            "id": "j6kap7q",
            "parent_id": "t3_10pfa4i",
            "score": 2,
            "created_utc": 1675118922.0,
            "replies": []
        },
        {
            "body": "That might be me soon. Got a sister?",
            "author": "spoiler2023",
            "id": "j6kasxn",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675118963.0,
            "replies": [
                {
                    "body": "Nope, but I have a 6’3 athletic brother if you swing that way?",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kbq5y",
                    "parent_id": "t1_j6kasxn",
                    "score": 3,
                    "created_utc": 1675119324.0,
                    "replies": [
                        {
                            "body": "A female bff?  Im sure your brothers a nice guy, but pass.\n\nI do wish you all the love and happiness and success in your marriage though :)",
                            "author": "spoiler2023",
                            "id": "j6kcpgo",
                            "parent_id": "t1_j6kbq5y",
                            "score": 1,
                            "created_utc": 1675119716.0,
                            "replies": [
                                {
                                    "body": "That’s very sweet thank you very much ❤️",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kd5lx",
                                    "parent_id": "t1_j6kcpgo",
                                    "score": 3,
                                    "created_utc": 1675119902.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What's the prenup look like?",
            "author": "IndividualSeaweed969",
            "id": "j6kbgtr",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675119222.0,
            "replies": []
        },
        {
            "body": "Anyone else looking for a gay sugar daddy?",
            "author": "Gay-Old-Soul",
            "id": "j6l0mo9",
            "parent_id": "t3_10pfa4i",
            "score": 0,
            "created_utc": 1675130018.0,
            "replies": []
        },
        {
            "body": "Well done… and you should be.",
            "author": "Impossible-Heat9700",
            "id": "j6m0ngj",
            "parent_id": "t3_10pfa4i",
            "score": 0,
            "created_utc": 1675149883.0,
            "replies": []
        },
        {
            "body": "Congratulations , the age gap is really reasonable in your case \n\nThat $10M NW also sounds fantastic and he is still young and can achieve more",
            "author": "shamloo77",
            "id": "j6kjfma",
            "parent_id": "t3_10pfa4i",
            "score": -1,
            "created_utc": 1675122498.0,
            "replies": []
        },
        {
            "body": "Congratulations 🎉 wish you the best 🫶🏻",
            "author": "ccii22",
            "id": "j6khzfh",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675121886.0,
            "replies": []
        },
        {
            "body": "Sweet dreams can happen! Congratulations and all the best to you both. 🎉",
            "author": "Muted-Top7808",
            "id": "j6kj8f5",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675122413.0,
            "replies": []
        },
        {
            "body": "CongrAtulations",
            "author": "joedel123",
            "id": "j6kzpbs",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675129606.0,
            "replies": []
        },
        {
            "body": "Love happens when and where you least suspect it. Glad it worked out for you guys. I believe age gap and dating up is starting to become a thing again. It was just the way for the longest time. Society started frowning upon it for whatever reason but now it’s back. In my experience the few times I’ve dabbled in the bowl since my divorce at 34… things seem to transition to vanilla even when it’s not what I want or had in mind at that time. It’s definitely more desired than this sub would let on.",
            "author": "JamesGarrison",
            "id": "j6l2dgq",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675130794.0,
            "replies": [
                {
                    "body": "Even though we have a big age gap and I couldn’t be happier, I don’t think I would recommend this to any woman my age or younger tbh. He’s extremely assertive, knows what he wants and isn’t afraid to ask for it. These traits are what made him successful but in a relationship with a young adult woman could be disastrous if she’s afraid to voice her opinions, is unsure of her boundaries or doesn’t know how to vocalise her needs… which is probably most really young women.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6l3pie",
                    "parent_id": "t1_j6l2dgq",
                    "score": 2,
                    "created_utc": 1675131386.0,
                    "replies": [
                        {
                            "body": "I wouldn’t know ALL of anything. I try not to gate keep on anything involving matters of the heart. Our experiences are anecdotal and biased.",
                            "author": "JamesGarrison",
                            "id": "j6ldr8w",
                            "parent_id": "t1_j6l3pie",
                            "score": 1,
                            "created_utc": 1675135987.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Another question for you:\n\nHas he changed? I'll explain what I mean by that. Many divorced people attribute the issues in their marriage to external factor. It was her/it was the situation/it was whatever. Divorce is the solution, and then some of them take the same issues with them to the next relationship.\n\nWhen I got divorced I went to therapy for a few years for that exact reason, to work on myself and my issues.\n\nDo you think anything changed in him, or that in 10 or 15 years you'll find yourself in the same place his ex-wife was, not necessarily that he'll cheat on you, but that the same dynamics will be created in your marriage as well?",
            "author": "geeky-sd",
            "id": "j6l6t32",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675132772.0,
            "replies": [
                {
                    "body": "This is a good question! I almost want to find a sub for “second husbands/wives” to see what people say. \n\nMy SBF says his marriage made him introspective, which eventually led to him knowing in his heart they simply aren’t compatible humans/worldviews/etc. A lot of their issues do seem to come from that, from what I can tell. But he also has some, I dunno, habits or idiosyncrasies that I could see contributing to a “relationship becoming a self feeding cycle into resentment” with a person who is “perfectly opposed” to that. But he can also talk about what those things are in an emotionally intelligent way (perhaps enabling him to just choose better the second time). He certainly thinks something along the lines of “the first was a learning experience and now I’ve learned”. I believe he truly believes that, but only time will really tell.",
                    "author": null,
                    "id": "j6lk62j",
                    "parent_id": "t1_j6l6t32",
                    "score": 2,
                    "created_utc": 1675139223.0,
                    "replies": []
                },
                {
                    "body": "This is a really good question. I don’t think he did. I don’t even believe he thinks either of them (his ex-wife and him) should change. He described her as a fantastic woman** and says she was a great partner (lying about birth control and libido issues aside) and recognises he married her knowing full and well they had misplaced libidos. So to him, it was a compatibility issue. \n\nI don’t know. Me and his ex-wife are very different people. Who knows. I insisted on pre-marriage counselling before we got married because we had a few communication problems I felt were a big deal and we needed to straighten out first. He obliged. I’ll know in 10/15 years if he was actually the problem I guess!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6lyxqu",
                    "parent_id": "t1_j6l6t32",
                    "score": 1,
                    "created_utc": 1675148580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you love him?\n\nI’m editing because I realized I was a bit blunt. Do you love him? And congratulations on your marriage.",
            "author": "Dry_Dimension_4707",
            "id": "j6lnzhp",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675141335.0,
            "replies": [
                {
                    "body": "Yes, I do. It’s not the same naive type of love I felt for boyfriends when I was younger, it’s different but I love him with my all my heart.\n\nA while ago (in our first year together) I used to be in this SB-group and one woman asked me if I would still see him if he stopped giving me my allowance if he temporarily couldn’t for whatever financial reason and I said yes.** I got roasted pretty bad but I stand by that statement today. \n\n** I DO NOT RECOMMEND OTHER SBS TO DO THIS. DO NOT. MY HUSBAND HAS SHOWN OVER AND OVER HE WILL MAKE SURE I’M AS FINANCIALLY COMFORTABLE AS HE CAN ALLOW ME TO BE AND IS NOT THE NORM",
                    "author": "throwawaysugarbabe80",
                    "id": "j6ly3l6",
                    "parent_id": "t1_j6lnzhp",
                    "score": 4,
                    "created_utc": 1675147958.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, that’s amazing. It’s refreshing to see that it is possible in this realm of dating. \n\nDo you feel like your feelings and relationship has grown stronger since the divorce and the marriage? Was it everything you expected and more or did the dynamic change?\n\nI’m in a similar situation with my SD except there’s a child in the picture. Trying to navigate the waters here but really there seems to be no way to know for certain. \n\nDid you just take a leap of faith and hoped for the best?",
            "author": "send_helpful_nudes",
            "id": "j6m18aq",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675150339.0,
            "replies": [
                {
                    "body": "Our relationship has definitely grown stronger. His marriage wasn’t looming over my head anymore. I met his friends and family a bit before he filed, so our circles felt more intertwined from then. \n\nThe dynamic changed slightly but that was to be expected and he wanted it to change. When you go from dates once-thrice a week to seeing each other everyday, your relationship deepens. I got really sick last year and for 4 months he had to take care of me. We went from having sex 5 times a week then to almost nothing in those 4 months because I physically just wasn’t able to. I was throwing up multiple times a day daily. He emptied my vomit bucket daily and helped me shower. I used to get scared to get to a place where we’d get « too comfortable » and I still want us to keep some of the excitement of our first year of dating but he has seen me at my lowest now and I’m glad I know I can count on him if I need to.\n\nI just chose to trust him. I made some risky decisions and he could have had me looking like a fool but it worked out. I cannot stress enough how much I do not recommend others doing this because he could have gotten cold feet and not have filed for divorce, or just up and left one day because the situation was messy or just strung me along for years. I’m super lucky he didn’t. \n\nHow old is your SD’s child?",
                    "author": "throwawaysugarbabe80",
                    "id": "j6m2ojf",
                    "parent_id": "t1_j6m18aq",
                    "score": 3,
                    "created_utc": 1675151498.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations! Always so nice to read successful stories 🥰",
            "author": "Graude",
            "id": "j6m4k58",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675153041.0,
            "replies": []
        },
        {
            "body": "Congratulations!\n\nIf I ever get married this is probably how it will happen. I haven't had any desire to date someone within 10-20 years of my age my entire life and I don't see that changing.",
            "author": "gamergainzgal",
            "id": "j6melev",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675161664.0,
            "replies": []
        },
        {
            "body": "Did he get you to sign a prenup?",
            "author": "superbex98",
            "id": "j6ms86a",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675170749.0,
            "replies": [
                {
                    "body": "Yes but as I said in another comment, it’s pretty useless. We’re in Western-Europe and married under the separate property system, which means all I would normally get if we divorce is alimony (and child support if children are involved). But even alimony wouldn’t be guaranteed because a huge chunk of what he spends monthly comes from capital gains from his investments and on paper he technically doesn’t make much. So let’s say he spends 400k a year, 350k is from the dividends from his portfolio. And it’s not considered « income » so it wouldn’t fall under the calculation for alimony. Only the 50k and it’s very likely that I exceed that once I start working. \n\nThe work-around we found for this is the house we’ll building. I’ll have 70% of the equity even though he’ll be the only one paying for it. It gives me something to fall back on in the event of a divorce. That 70% will be renegotiated after we have kids to a 100%.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6muj4v",
                    "parent_id": "t1_j6ms86a",
                    "score": 2,
                    "created_utc": 1675171933.0,
                    "replies": [
                        {
                            "body": "I can't imagine his investments are doing well at the moment, especially in the markets.\n\nYou see to have it all figured out and good luck to you!",
                            "author": "superbex98",
                            "id": "j6mxhlx",
                            "parent_id": "t1_j6muj4v",
                            "score": 1,
                            "created_utc": 1675173363.0,
                            "replies": [
                                {
                                    "body": "He’s doing surprisingly well actually but he’s an extremely risk-averse investor. Last time he showed me he only lost 200k on the 7M account or something like that. He’s a hedge fund partner and managing director so finance is his shtick. I’m personally deep in the red though. \n\nThank you so much! Best of luck to you aswell!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6my4t0",
                                    "parent_id": "t1_j6mxhlx",
                                    "score": 2,
                                    "created_utc": 1675173665.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congratulations, @Throwawaysugarbabe80! I’m happy for you.",
            "author": "Friendly_Boat_4088",
            "id": "j6mzy8k",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675174492.0,
            "replies": []
        },
        {
            "body": "No need to out yourself that's true, nobody's business really, but I hope if you hear people cracking jokes about SBs or SDs or belittling sex workers you'll say something in defense of them. We all need to help reduce the stigma and shame associated with this stuff or nothing will ever change. \n\nI'm very glad it worked out for you though. Congratulations :)",
            "author": "MorganDax",
            "id": "j6n5daa",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675176826.0,
            "replies": []
        },
        {
            "body": "Sounds like vanilla dating. It could result in divorce #2 and alimony. That will be interesting, a man paying two women alimony.",
            "author": "JohnnyKemmer009",
            "id": "j6njipv",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675182316.0,
            "replies": []
        },
        {
            "body": "What kind of arrangement ($) did you have at the beginning? How did it evolve?",
            "author": "M_Pursewarden",
            "id": "j6nksxn",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675182804.0,
            "replies": [
                {
                    "body": "Started off with PPM for like the first 2 months, but he never gave me cash. Our M&G ended with him sending me the equivalent of a PPM so I trusted him to wire the money after each date (I do not recommend other SBs doing this, please be careful out there). Then he got sick and broke a leg and would have to cancel and I let him know it was making it difficult for me financially and we switched to allowance. The allowance has increased overtime. Hope that answered your question well?",
                    "author": "throwawaysugarbabe80",
                    "id": "j6nnsrm",
                    "parent_id": "t1_j6nksxn",
                    "score": 3,
                    "created_utc": 1675183907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP I think you’re my spirit animal! I feel exactly the same way as you do in this situation!! GOOD FOR YOU for finding love in the chaos! Best of luck!",
            "author": "xex4u",
            "id": "j6nnc60",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675183738.0,
            "replies": [
                {
                    "body": "Thank you so much!! Best of luck to you aswell❤️❤️",
                    "author": "throwawaysugarbabe80",
                    "id": "j6nnym6",
                    "parent_id": "t1_j6nnc60",
                    "score": 1,
                    "created_utc": 1675183966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "how much would he pay you per meet starting off? when did you decide to stop accepting money and be in a relationship?",
            "author": "25robustos",
            "id": "j6nwlxi",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675187103.0,
            "replies": [
                {
                    "body": "I still get an allowance, that has never stopped. I don’t remember how much he gave me PPM but x4 it came out to about double the average rent of an apartment in the capital. So I guess 500?\n\nETA: yup, it was 500.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6o37k2",
                    "parent_id": "t1_j6nwlxi",
                    "score": 1,
                    "created_utc": 1675189512.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This makes me so happy for you! Congrats on your recent ceremony 🖤",
            "author": "Cdnsugarr",
            "id": "j6oegnd",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675193672.0,
            "replies": []
        },
        {
            "body": "Congratulations! Have you had much stigma from family members about the relationship?",
            "author": "Totalorigionalname",
            "id": "j6otas3",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675199161.0,
            "replies": [
                {
                    "body": "Most wouldn’t dare voice a negative opinion. My mother rolled on the floor when I told her his age and my dad still hasn’t fully come around but he’s respectful and nice to him. His mother asked me straight-up if I only wanted his son for money. I know many of my friends think the age gap is odd as well and from their opinions about certain topics in the past… most likely have negative opinions of my husband but they have never said anything and are pleasant. \nThank you!!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6ou9k3",
                    "parent_id": "t1_j6otas3",
                    "score": 2,
                    "created_utc": 1675199524.0,
                    "replies": [
                        {
                            "body": "Mind if I DM? I’m in a situation where it looks like it’s leading to marriage. Would love a chance to pick your brain.",
                            "author": "Totalorigionalname",
                            "id": "j6oultu",
                            "parent_id": "t1_j6ou9k3",
                            "score": 1,
                            "created_utc": 1675199650.0,
                            "replies": [
                                {
                                    "body": "Of course you can!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6ouou1",
                                    "parent_id": "t1_j6oultu",
                                    "score": 1,
                                    "created_utc": 1675199682.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congrats xx",
            "author": "Dangerous-Reward2492",
            "id": "j6radcl",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675244439.0,
            "replies": []
        },
        {
            "body": "Congrats and thanks for doing AMA!!\n\nDid not see people ask about sexual chemistry/compatibility questions.  Would you say you two are sexually compatible? Is the sex still great now, compared to first year of the SR, frequency and quality wise?\n\nThanks!",
            "author": "Bubbly-JC9615",
            "id": "j6tc6y4",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675279050.0,
            "replies": []
        },
        {
            "body": "Wow that’s a bit nuts… crazy how I could be in a similar situation. I’m completely in love with my SD and we have a long distance SR for now. We’ve talked about marriage, kids, where we would live and visit his parents on the holidays. We complement each other so well I couldn’t imagine life without him. I’m so happy things worked out for you! It makes me feel less crazy for considering marrying my SD.",
            "author": "Lonely_Hat9877",
            "id": "j6tk8rk",
            "parent_id": "t3_10pfa4i",
            "score": 1,
            "created_utc": 1675282016.0,
            "replies": []
        },
        {
            "body": "I think he left for him but that I was the push needed for him to make that decision. The issues he told me he had in his marriage were:\n\n1. He has wanted children for nearly a decade now and his ex-wife didn’t, then agreed to try but apparently wasn’t being truthful about being off birth-control and ultimately told him she never would want kids. \n2. Lack of sex. He recognises this is his fault because his ex-wife never had a high libido to start with but (according to him) he dwindled to almost nothing a few years into their marriage. \n3. They became affectionate roommates more than anything and he wanted more and I made him realise there can be more to a relationship yadiyadiyada. \n\nBut he says number 1 was the biggest issue and that he started resenting her over it but is glad in a way it didn’t happen.",
            "author": "throwawaysugarbabe80",
            "id": "j6katf1",
            "parent_id": "t1_j6k9k6a",
            "score": 30,
            "created_utc": 1675118968.0,
            "replies": [
                {
                    "body": ">He has wanted children for nearly a decade now and his ex-wife didn’t, then agreed to try but apparently wasn’t being truthful about being off birth-control and ultimately told him she never would want kids\n\nThis is why I never believe in changing someone's mind if you already know you have incompatible life goals. There was a woman I was seeing regularly who was trying to convince me (perhaps for her sake) that \"she could change her mind!\" when I told her the kind of women I would automatically write off. She insisted that I have too many requirements and \"no one\" thinks that far ahead. I'm like, I don't have time to wait and guess like that. We were both in our late 30's and she has a surprisingly naive view on love and what's romantic.",
                    "author": "karmaextract",
                    "id": "j6kjxbe",
                    "parent_id": "t1_j6katf1",
                    "score": 15,
                    "created_utc": 1675122702.0,
                    "replies": []
                },
                {
                    "body": "Yeah those are some big incompatibilities, interesting thanks!",
                    "author": null,
                    "id": "j6kb1ve",
                    "parent_id": "t1_j6katf1",
                    "score": 7,
                    "created_utc": 1675119060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I absolutely can’t. We’ve had these discussions together. He’s more worried about me leaving him and cheating on him according to him. I’m 100% aware that what he did to her he could always do to me. But to be honest… this is a risk I’m willing to take. Worst case scenario I’m a divorcee and got some karma. Life will go on.",
            "author": "throwawaysugarbabe80",
            "id": "j6k73wn",
            "parent_id": "t1_j6k6d4g",
            "score": 63,
            "created_utc": 1675117507.0,
            "replies": [
                {
                    "body": "All power to you! Congrats to you & your previous SD/future husband! I will say that many of us get cheated on with vanilla relationships as well so I just see it as a potential risk regardless 😅😅 \n\nI hope I'll get a husband who's well off, kind, respectful, and adores me so I hopefully don't have to worry about that but we'll see what the future holds lol. I hope you have a successful marriage!",
                    "author": "di_caro2811",
                    "id": "j6kb08d",
                    "parent_id": "t1_j6k73wn",
                    "score": 9,
                    "created_utc": 1675119042.0,
                    "replies": []
                },
                {
                    "body": "I've been married twice. Met my 1st wife at 19, we were dead bedroom by the age of 25. I cheated on her with my second wife. Was with my 2nd wife for 26yrs and never cheated once.\n\nMy 2nd wife had cheated with me on her previous husband. We both went into the marriage with eyes wide open. There's something about mutual trust when both already know the score. It is it's own contract if that makes any sense?",
                    "author": "Sunhillian",
                    "id": "j6kb3cb",
                    "parent_id": "t1_j6k73wn",
                    "score": 38,
                    "created_utc": 1675119076.0,
                    "replies": [
                        {
                            "body": "ahh so you both are shitty cheaters. perfect for each other",
                            "author": "epyon-",
                            "id": "j6m707g",
                            "parent_id": "t1_j6kb3cb",
                            "score": 4,
                            "created_utc": 1675155123.0,
                            "replies": [
                                {
                                    "body": "Welcome to SLF, an interesting contribution for your first post 🤔. \n\nDo you have any interest or experience in this community or is your post a one and done?",
                                    "author": "Sunhillian",
                                    "id": "j6mfj6z",
                                    "parent_id": "t1_j6m707g",
                                    "score": 6,
                                    "created_utc": 1675162437.0,
                                    "replies": []
                                },
                                {
                                    "body": "Really Epyon?  SA and sites like it are almost built on cheaters.  If you've been in the Bowl for more than a few months you'd know that most SB's (at least one's I've encountered over the years) don't care about the SD's relationship status, and in fact many prefer taken men.  It limits the time the SB has to spend with him, and in the case of SB's who are scammers / bad actors to blackmail those men.  I'm single but I've had a few SB's dumb enough to brag to me about blackmail / extortion of married SD's.  This is not a dating world where monogamy and true love are the goal, but good for the OP if she found it.  Being a \"shitty cheater\" means nothing in the sugar world in my opinion.\n\nI just hope the OP has a pre-nup......and while it's great that she trusts him and is fully aware of the potential issues, the trade in after he wants something younger comments I read sound like they fit this guys personality.  So trust all you want, but document and protect yourself would be my advise to her.",
                                    "author": "Snoo71180",
                                    "id": "j6ma31a",
                                    "parent_id": "t1_j6m707g",
                                    "score": 3,
                                    "created_utc": 1675157809.0,
                                    "replies": [
                                        {
                                            "body": "He's responding to me Snoo, my marriage wasn't an SR, he's just trying to be obnoxious and succeeding 😴\n\nNor is he an SD, he's a med student with nothing more important to do than stick his nose in where it's of no value 😏",
                                            "author": "Sunhillian",
                                            "id": "j6mf0ve",
                                            "parent_id": "t1_j6ma31a",
                                            "score": 3,
                                            "created_utc": 1675162023.0,
                                            "replies": [
                                                {
                                                    "body": "just pointing out that there are better ways to end a relationship before cheating",
                                                    "author": "epyon-",
                                                    "id": "j6nf34t",
                                                    "parent_id": "t1_j6mf0ve",
                                                    "score": -3,
                                                    "created_utc": 1675180643.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "ive read a lot of the opposite. many who dont want to deal with a potential pissed off wife. i guess to each their own …",
                                            "author": "epyon-",
                                            "id": "j6nf6k7",
                                            "parent_id": "t1_j6ma31a",
                                            "score": -2,
                                            "created_utc": 1675180679.0,
                                            "replies": [
                                                {
                                                    "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
                                                    "author": "Snoo71180",
                                                    "id": "j6o6lqs",
                                                    "parent_id": "t1_j6nf6k7",
                                                    "score": 1,
                                                    "created_utc": 1675190752.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "One of my consulting clients pretty much fit that description absent the desire to have kids (he had several with prior wife).  Great wife , loved airplanes also (they had 4 or 5 and an airport on the ranch) .  She got along well with the kids from prior marriage.",
                    "author": "pinotandsugar",
                    "id": "j6kcgc3",
                    "parent_id": "t1_j6k73wn",
                    "score": 2,
                    "created_utc": 1675119615.0,
                    "replies": []
                },
                {
                    "body": "AND - one HUGE AND IMPORTANT factor in your favor\n\nI SERIOUSLY doubt you will ever let there be a DEAD BEDROOM in your marriage!! :-)",
                    "author": "sd424242",
                    "id": "j6l4juc",
                    "parent_id": "t1_j6k73wn",
                    "score": 0,
                    "created_utc": 1675131763.0,
                    "replies": []
                },
                {
                    "body": "1,000% CORRECT!",
                    "author": "xex4u",
                    "id": "j6nkcr2",
                    "parent_id": "t1_j6k73wn",
                    "score": 1,
                    "created_utc": 1675182633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We have a prenup but it’s kinda useless since we married under the separate property system (Europeans). It’s essentially just a list of all the assets we both have. We are building a house though and 70% of the equity will be mine (put under contract).\n\nHis wife was aware of me during the last year of their marriage. He just stopped caring about keeping me a secret. She wanted to stay married despite knowing about me.\n\nI’m counting my lucky stars they didn’t really have property or kids together. They had a vacation home in her home country he left her during the divorce.",
            "author": "throwawaysugarbabe80",
            "id": "j6kbm2h",
            "parent_id": "t1_j6kaaq4",
            "score": 23,
            "created_utc": 1675119280.0,
            "replies": [
                {
                    "body": "I edited my question while you were answering so you probably didn't see this:\n\nWhen friends or family ask how you met (or even when you met), how do you respond?",
                    "author": "geeky-sd",
                    "id": "j6kc0q8",
                    "parent_id": "t1_j6kbm2h",
                    "score": 5,
                    "created_utc": 1675119442.0,
                    "replies": [
                        {
                            "body": "We made up a whole fake story and I think we are slowly starting to believe this is actually how we met lmfao. We never ever mention SA, not even to each other and haven’t in years.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kcqr1",
                            "parent_id": "t1_j6kc0q8",
                            "score": 8,
                            "created_utc": 1675119730.0,
                            "replies": [
                                {
                                    "body": "How long ago did you first meet, and how long have you been married?\n\nIt's fascinating, hopefully you don't mind the questions (I realize you said \"AMA\"). Thank you for indulging us! I presume no chance he's reading any of this.",
                                    "author": "geeky-sd",
                                    "id": "j6kd991",
                                    "parent_id": "t1_j6kcqr1",
                                    "score": 5,
                                    "created_utc": 1675119943.0,
                                    "replies": [
                                        {
                                            "body": "We met 4years ago. He filed for divorce 2 years ago, immediately proposed to me and we got married two months ago (officially but had our ceremony literally yesterday.)\n\nI don’t mind the questions at all, I haven’t been able to tell this stuff to anyone ever so it’s liberating in a way. \n\n> I presume no chance he’s reading this.\n\nI wouldn’t care if he was but he finds Reddit weird and thinks I spend too much time on it so I doubt he is lol.",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6kdx2j",
                                            "parent_id": "t1_j6kd991",
                                            "score": 13,
                                            "created_utc": 1675120209.0,
                                            "replies": [
                                                {
                                                    "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
                                                    "author": "geeky-sd",
                                                    "id": "j6ke4lb",
                                                    "parent_id": "t1_j6kdx2j",
                                                    "score": 3,
                                                    "created_utc": 1675120292.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                                                            "author": "throwawaysugarbabe80",
                                                            "id": "j6keu5e",
                                                            "parent_id": "t1_j6ke4lb",
                                                            "score": 16,
                                                            "created_utc": 1675120583.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used to be an active participant on here years ago but I stopped after a few months because a lot of posts and advice just didn’t apply to my SR. \n\nI’m glad to see not much has changed (except the average PPM cited by SBs in the allowance thread seems to have doubled, inflation is crazy!)",
            "author": "throwawaysugarbabe80",
            "id": "j6khxa9",
            "parent_id": "t1_j6khbub",
            "score": 10,
            "created_utc": 1675121862.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "j6kj1qf",
                    "parent_id": "t1_j6khxa9",
                    "score": 5,
                    "created_utc": 1675122334.0,
                    "replies": [
                        {
                            "body": "Oh I was joking! I love the fact the SBs here vehemently advocate for newlings in the bowl. I don’t believe women here are making up these numbers. I’ve been out of the bowl for 4years, so I’m out the loop.\n\nThank you so much sweetheart, I’m very happy you have a fulfilling SR. May it last many more years and may you continue to be spoiled.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kjkvr",
                            "parent_id": "t1_j6kj1qf",
                            "score": 1,
                            "created_utc": 1675122558.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes this is such good news!",
            "author": "Friendly_Boat_4088",
            "id": "j6mz2cy",
            "parent_id": "t1_j6khbub",
            "score": 1,
            "created_utc": 1675174094.0,
            "replies": []
        },
        {
            "body": "Thank you so much!!",
            "author": "throwawaysugarbabe80",
            "id": "j6kcdo2",
            "parent_id": "t1_j6kbak2",
            "score": 7,
            "created_utc": 1675119586.0,
            "replies": []
        },
        {
            "body": "This is a super relevant question and something I thought about a lot when he brought up the idea of divorcing and starting a life together. I ultimately decided that it’s 100% possible he’ll do this to me in the future but I’m going to go into the relationship trusting he won’t. I can’t control his actions, only mine and I’ll act accordingly if he ever breaks that trust but I wouldn’t be giving our marriage a fair shot if I didn’t extend him that initial trust. \n\nIf he ever leaves me over this; oh well. Karma is a bitch and I got it coming.",
            "author": "throwawaysugarbabe80",
            "id": "j6k7sng",
            "parent_id": "t1_j6k6yk4",
            "score": 14,
            "created_utc": 1675117775.0,
            "replies": [
                {
                    "body": "Are you exclusive, or are you comfortable with him having SBs outside your marriage?\n\nIf not: Are you trolling SA to verify that?",
                    "author": "geeky-sd",
                    "id": "j6kaxoz",
                    "parent_id": "t1_j6k7sng",
                    "score": 5,
                    "created_utc": 1675119015.0,
                    "replies": [
                        {
                            "body": "We’re exclusive. Nope. I will leave if he cheats on me (hypocrite central) and I’ve made that very very clear. \n\nI don’t watch what he does, no.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kccam",
                            "parent_id": "t1_j6kaxoz",
                            "score": 9,
                            "created_utc": 1675119571.0,
                            "replies": [
                                {
                                    "body": "I think it makes sense. It sounds like he turned to sugaring out of loneliness and not an addiction to promiscuity or young pussy or cheating. So knock on wood with their compatibility be wouldnt cheat on OP.",
                                    "author": "Equivalent_Newt_6969",
                                    "id": "j6kd6z9",
                                    "parent_id": "t1_j6kccam",
                                    "score": 4,
                                    "created_utc": 1675119917.0,
                                    "replies": []
                                },
                                {
                                    "body": ">We’re exclusive. Nope. I will leave if he cheats on me (**hypocrite central**) and I’ve made that very very clear.\n\nI don't think I would characterize that as hypocritical. He broke a promise he made to someone else. You're telling him that if he breaks a promise he made to you, then you're out the door. \"Hypocritical\" would be if you told him you wouldn't tolerate something that you have done before. Not the case here.",
                                    "author": "geeky-sd",
                                    "id": "j6kcztu",
                                    "parent_id": "t1_j6kccam",
                                    "score": 5,
                                    "created_utc": 1675119834.0,
                                    "replies": [
                                        {
                                            "body": "I fully support people willing to consider themselves hypocritical. It promotes humility and self awareness and also helps her be aware and take caution when needed if her husband tries to do the same thing again.\n\nTrying to make mental gymnastics to justify one self when one is involved the very thing they would not allow happen to themself promotes complacency and is how you end up with that other girl the other day ratting out her ex's scheme to defraud SB's by selling their pics here on SLF.\n\nI mean, I'm not going to go out of my way and insult her for it, but if she's willing to acknowledge it herself there's no need for coddling either.",
                                            "author": "karmaextract",
                                            "id": "j6kmx1q",
                                            "parent_id": "t1_j6kcztu",
                                            "score": 4,
                                            "created_utc": 1675123967.0,
                                            "replies": [
                                                {
                                                    "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6kpzzq",
                                                    "parent_id": "t1_j6kmx1q",
                                                    "score": 4,
                                                    "created_utc": 1675125308.0,
                                                    "replies": [
                                                        {
                                                            "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                                                            "author": "karmaextract",
                                                            "id": "j6ks569",
                                                            "parent_id": "t1_j6kpzzq",
                                                            "score": 2,
                                                            "created_utc": 1675126249.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                                                            "author": "geeky-sd",
                                                            "id": "j6l6cou",
                                                            "parent_id": "t1_j6kpzzq",
                                                            "score": 2,
                                                            "created_utc": 1675132569.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you for going through the trouble to find these back!",
                                                                    "author": "throwawaysugarbabe80",
                                                                    "id": "j6lz2gq",
                                                                    "parent_id": "t1_j6l6cou",
                                                                    "score": 1,
                                                                    "created_utc": 1675148679.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                                                            "author": "geeky-sd",
                                                                            "id": "j6mgtqn",
                                                                            "parent_id": "t1_j6lz2gq",
                                                                            "score": 1,
                                                                            "created_utc": 1675163450.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I was wondering this too - OP, are you going to have access to his socials and/or will you be looking through his socials? NGL, if I would have a relationship with SD that previously cheated with me ,  I'd want all access 😅",
                            "author": "di_caro2811",
                            "id": "j6kbzyo",
                            "parent_id": "t1_j6kaxoz",
                            "score": 2,
                            "created_utc": 1675119433.0,
                            "replies": [
                                {
                                    "body": "He doesn’t have any socials outside from LinkedIn and Facebook and he doesn’t use even use the latter. But if he did I wouldn’t look through them. I can go on his phone whenever I want but I never do, I genuinely am not worried about this even though I know he could do it. But I do understand why you’d want to watch everything",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kicb7",
                                    "parent_id": "t1_j6kbzyo",
                                    "score": 5,
                                    "created_utc": 1675122036.0,
                                    "replies": [
                                        {
                                            "body": "Honestly if you need to go through phones and such, you shouldn't be in the relationship at all. Obviously doing things like that may save a bit of grief, but the craziness you'll whip yourself into is NOT worth it. Trust, or don't trust, and let the chips fall where they may. Otherwise it's doomed from the start. (I'm saying this as a dude who got cheated on last year and thank my lucky stars I trusted her until I found out, since it saved me a lot of psychosis).",
                                            "author": "billbar",
                                            "id": "j6lcnty",
                                            "parent_id": "t1_j6kicb7",
                                            "score": 4,
                                            "created_utc": 1675135468.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "That does help that he doesn't have many socials, and I think it's nice that you can go through his cell, even if you don't. And that's understandable, it's good that you're not feeling like you need to be on high alert. Honestly, I'm usually pretty trusting as well, but in this type of scenario, I seem not to be 😅 I'm glad things are working out well for you both!",
                                            "author": "di_caro2811",
                                            "id": "j6kn28q",
                                            "parent_id": "t1_j6kicb7",
                                            "score": 1,
                                            "created_utc": 1675124029.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I can only aspire to have this mentality! I have major trust issues that I’m trying to work through.",
                    "author": "Nana_ccs",
                    "id": "j6od2mp",
                    "parent_id": "t1_j6k7sng",
                    "score": 1,
                    "created_utc": 1675193153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes. We’ll stick to it until we die 😂😂 \n\nThank you, I wish you all the same! I’m very excited to see what the future looks like for us",
            "author": "throwawaysugarbabe80",
            "id": "j6kih1t",
            "parent_id": "t1_j6khvev",
            "score": 5,
            "created_utc": 1675122091.0,
            "replies": [
                {
                    "body": "What is it (without being too specific obviously)?    The age and wealth gaps are certainly well-known to your families.  Idk if there’s an attractiveness gap as well.   What’s your cover story and are you sure no one suspects the truth?",
                    "author": "DarthDaddius",
                    "id": "j6l153s",
                    "parent_id": "t1_j6kih1t",
                    "score": 1,
                    "created_utc": 1675130248.0,
                    "replies": [
                        {
                            "body": "He often gets invited at events as a potential investor. I used to be a waitress but for a company, not a restaurant. I would get hired for such events. Our story is that we met at one of those events but that said event is tech-related and that I* started a discussion with him towards the end of my shift. \n\nI have no idea if people buy it, and I don’t care, it’s how we met and that’s it 😂\n\nThere’s an attractiveness gap and I’m black, while he’s white so on paper we’re mismatched. My husband is fit and tall though so it’s not extreme but I know what people think when they see us each other. Don’t care, am happy.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6l2s9e",
                            "parent_id": "t1_j6l153s",
                            "score": 9,
                            "created_utc": 1675130974.0,
                            "replies": [
                                {
                                    "body": "Thanks for answering.",
                                    "author": "DarthDaddius",
                                    "id": "j6l3gr9",
                                    "parent_id": "t1_j6l2s9e",
                                    "score": 2,
                                    "created_utc": 1675131277.0,
                                    "replies": []
                                },
                                {
                                    "body": "Nice. In ours we met on a train to a music festival and she approached me in the dining car 😂",
                                    "author": "roscoe7585",
                                    "id": "j6mvv6c",
                                    "parent_id": "t1_j6l2s9e",
                                    "score": 2,
                                    "created_utc": 1675172589.0,
                                    "replies": [
                                        {
                                            "body": "That’s way more creative haha. Nice to see others who went legit!",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6mwpdi",
                                            "parent_id": "t1_j6mvv6c",
                                            "score": 2,
                                            "created_utc": 1675172994.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Thank you for sharing!  Wondering if you've had any struggles due to race differences?  Are you the first black girl he's shared such an intimate and close relationship with?",
                                    "author": "Beneficial-Photo-431",
                                    "id": "j6pa1v5",
                                    "parent_id": "t1_j6l2s9e",
                                    "score": 2,
                                    "created_utc": 1675205521.0,
                                    "replies": [
                                        {
                                            "body": "My husband exclusively prefers and only dates black women. His ex-wife is black. I didn’t need to teach him anything, thankfully!",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6rj213",
                                            "parent_id": "t1_j6pa1v5",
                                            "score": 2,
                                            "created_utc": 1675251410.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Does “attractiveness gap” mean one of you is hotter than the other lol?  Which one?!\n\nCongrats!",
                                    "author": "ronitabonita",
                                    "id": "j6lhwx3",
                                    "parent_id": "t1_j6l2s9e",
                                    "score": 0,
                                    "created_utc": 1675138034.0,
                                    "replies": [
                                        {
                                            "body": "Yes! I’m the hot one. Respectfully lol",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6lxuvm",
                                            "parent_id": "t1_j6lhwx3",
                                            "score": 9,
                                            "created_utc": 1675147782.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Oh my gosh!! This is my husband and I. It’s insane how much our stories are similar. We also have constructed a story.",
                                    "author": "Snoo_72748",
                                    "id": "j6ndzmt",
                                    "parent_id": "t1_j6l2s9e",
                                    "score": 1,
                                    "created_utc": 1675180230.0,
                                    "replies": [
                                        {
                                            "body": "I just read your post and I wish you lived near me! So many similarities down to building the multimillion dollars home! My life is so different now, as such a young age, it’s crazy. I sometimes can’t believe I got so lucky and I get to be so happy. My mom raised us all alone growing up and she had it tough and she often says she thinks God sent me my husband because she suffered enough.\n\nI wish you guys many many more years of happiness!",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6ngfa8",
                                            "parent_id": "t1_j6ndzmt",
                                            "score": 1,
                                            "created_utc": 1675181153.0,
                                            "replies": [
                                                {
                                                    "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
                                                    "author": "Snoo_72748",
                                                    "id": "j6niu51",
                                                    "parent_id": "t1_j6ngfa8",
                                                    "score": 1,
                                                    "created_utc": 1675182059.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                                                            "author": "throwawaysugarbabe80",
                                                            "id": "j6nl95w",
                                                            "parent_id": "t1_j6niu51",
                                                            "score": 1,
                                                            "created_utc": 1675182973.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                                                                    "author": "Snoo_72748",
                                                                    "id": "j6no8md",
                                                                    "parent_id": "t1_j6nl95w",
                                                                    "score": 1,
                                                                    "created_utc": 1675184067.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                                                            "author": "throwawaysugarbabe80",
                                                                            "id": "j6npeu7",
                                                                            "parent_id": "t1_j6no8md",
                                                                            "score": 1,
                                                                            "created_utc": 1675184490.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, I receive the same amount I used to each month but I don’t have any expenses anymore because he pays for basically everything. It’ll most likely stop once I start working (I’m still studying for my Masters) but then I’ll just spend my salary however I want.",
            "author": "throwawaysugarbabe80",
            "id": "j6k9ka4",
            "parent_id": "t1_j6k8u15",
            "score": 13,
            "created_utc": 1675118477.0,
            "replies": []
        },
        {
            "body": "Thanks for the correction, will edit!  And thank you so much❤️",
            "author": "throwawaysugarbabe80",
            "id": "j6l1hha",
            "parent_id": "t1_j6l0seb",
            "score": 1,
            "created_utc": 1675130402.0,
            "replies": []
        },
        {
            "body": "Thank you! Absolutely not, I 100% went in thinking this was going to be a temporary experience and kept that mindset for the first year of our relationship. \n\nI was not open to marriage when I signed up, I just wanted an experience and after I would meet my actual life partner. \n\nI was… sort of? He had another one shortly before me, they went on two dates. He then had a date with me and he stopped seeing her. She goes to the same university as me so I’ve seen her while with him before.\n\nHe had an affair with another woman before but she wasn’t getting an allowance or anything like that, he would just pay for everything. They have the same age  too.",
            "author": "throwawaysugarbabe80",
            "id": "j6kmqoi",
            "parent_id": "t1_j6klnu7",
            "score": 4,
            "created_utc": 1675123890.0,
            "replies": [
                {
                    "body": "What was the moment when you realized that this was going to be a serious, long term relationship? \n\nSorry about all the questions. I've been happily together with mine for 3 years and I just wanted to know what it's like for other long term couples 😅",
                    "author": "iknowwhatiwantbroski",
                    "id": "j6kn8fr",
                    "parent_id": "t1_j6kmqoi",
                    "score": 2,
                    "created_utc": 1675124102.0,
                    "replies": [
                        {
                            "body": "Congrats on the 3 years!! Are you hoping you guys will make it down the aisle?\n\nI don’t have one particular big moment. There are a few instances where I remember realising he was in for the long-haul:\n• He insisted on calling me his girlfriend like a month in. I would joke that a married man doesn’t have a girlfriend but a mistress but he hated anything but the word “girlfriend”.\n\n• He stopped caring about all kinds of OPSEC super early on. He had a different phone at first to message me he kept in his office and then he got worried I wouldn’t be able to contact him in case of emergency so I got his real number and ultimately he just started messaging me on there. He would also just bring me wherever; we regularly had dates literally a few meters from his workplace. \n\n• When his wife found out about me I told him he really should be more careful going forward because I didn’t want him to have to stop our relationship over this and he said at that point he didn’t think anything would stop him from being with me. \n\nI believe we were on vacation in Barcelona, like a year in when I thought “I wouldn’t mind this lasting for many many more years” but I didn’t have a revelation or anything.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kp6k6",
                            "parent_id": "t1_j6kn8fr",
                            "score": 3,
                            "created_utc": 1675124946.0,
                            "replies": [
                                {
                                    "body": "Sounds like you're the right person who came along at just the right time. May you have the happy marriage  that you're both looking for!\n\nIm fully accepting of the fact that mine wont leave his wife for me but we've been talking about how things would be for us long term and how I'll still be taken care of even after he's gone. We have an age gap of 30 years so I really dont think there's enough years in his lifetime for another marriage but we're happy just the way we are",
                                    "author": "iknowwhatiwantbroski",
                                    "id": "j6kqy4b",
                                    "parent_id": "t1_j6kp6k6",
                                    "score": 5,
                                    "created_utc": 1675125724.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It happened eventually, he had no plan to leave his wife when we met and I had no plan to stay with him beyond my college years.",
            "author": "throwawaysugarbabe80",
            "id": "j6l1ct6",
            "parent_id": "t1_j6kzx8w",
            "score": 3,
            "created_utc": 1675130344.0,
            "replies": []
        },
        {
            "body": "I wasn’t. Unless I asked for updates, he wouldn’t even talk about it. He just told me when he filed and when it got finalised.",
            "author": "throwawaysugarbabe80",
            "id": "j6lxsg7",
            "parent_id": "t1_j6lavo6",
            "score": 1,
            "created_utc": 1675147731.0,
            "replies": [
                {
                    "body": "that's how you know he was for real\n\nas opposed to the usual \"I'm juuuuuuust about to leave her\"",
                    "author": "Gemini-Fox",
                    "id": "j6svqpy",
                    "parent_id": "t1_j6lxsg7",
                    "score": 1,
                    "created_utc": 1675273050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why did it end?",
            "author": "throwawaysugarbabe80",
            "id": "j6lzgcc",
            "parent_id": "t1_j6lthvh",
            "score": 2,
            "created_utc": 1675148961.0,
            "replies": []
        },
        {
            "body": "I haven’t.  She called me once when she found out about me during their marriage in the middle of the night on his phone and for a while I kept getting called by an anonymous number and each time I would pick up they would hang up. If she ever wanted to speak to me, I’d be open to a conversation but I don’t personally feel a need to speak to her.",
            "author": "throwawaysugarbabe80",
            "id": "j6mtser",
            "parent_id": "t1_j6mcywy",
            "score": 3,
            "created_utc": 1675171559.0,
            "replies": []
        },
        {
            "body": "> When you first met him how attracted to him were you be honest.\n\nSo attraction doesn’t exist in a vacuum for me. I have never met a man and thought purely based off his physical appearance I would have sex with him. My husband wasn’t the ideal physical type of 21year old me in the same way I was his ideal type but I did find him physically attractive by the time we had sex with one another. His success definitely plays into that attraction but I only find successful men attractive. \n\n> If he lost all his money would you still stay with him?\n\nDepends. If he lost it because he suddenly decided to spend it all in casinos? No. If he lost it because for whatever reason all his investments failed? Yes.",
            "author": "throwawaysugarbabe80",
            "id": "j6np87s",
            "parent_id": "t1_j6nnste",
            "score": 1,
            "created_utc": 1675184423.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j6oqykz",
                    "parent_id": "t1_j6np87s",
                    "score": 1,
                    "created_utc": 1675198304.0,
                    "replies": [
                        {
                            "body": "I don’t think it’s a « most women »-thing. My closest girlfriends are all with men their age who aren’t what I would consider successful but they are also seemingly happy. What I want in a man =/= what most women want in a man. I can only speak for myself. \n\nAlso… this is a self-selecting club isn’t it? Women who like attractive men will become SBs while most women won’t because they don’t care as much. So naturally all your SBs valued success way more than the average woman.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6ost9k",
                            "parent_id": "t1_j6oqykz",
                            "score": 3,
                            "created_utc": 1675198982.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eh… not really no. For starters, he accumulated the 10M prior to marrying me, so it’s not a marriage asset. Secondly, we’re in Europe. The « divorce and take half »-thing only truly holds true in the Noth-America and possibly the UK.\n\nThe prenup-bit is also terrible advice: a good prenup protects both parties.",
            "author": "throwawaysugarbabe80",
            "id": "j6o2v3g",
            "parent_id": "t1_j6nxu8v",
            "score": 3,
            "created_utc": 1675189389.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j6oct37",
                    "parent_id": "t1_j6o2v3g",
                    "score": 1,
                    "created_utc": 1675193056.0,
                    "replies": [
                        {
                            "body": "They are already divorced lol, so I know exactly how much he got. And yep, he got to keep all the 10M. Let me introduce you to the concept of marital property systems and how they differ in each country!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6odfjf",
                            "parent_id": "t1_j6oct37",
                            "score": 1,
                            "created_utc": 1675193288.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j6offk4",
                                    "parent_id": "t1_j6odfjf",
                                    "score": 1,
                                    "created_utc": 1675194035.0,
                                    "replies": [
                                        {
                                            "body": "Girl…. Did you like completely skip the title? I’m already married. The prenup was drafted and signed months ago.",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6ogvkp",
                                            "parent_id": "t1_j6offk4",
                                            "score": 1,
                                            "created_utc": 1675194572.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope, but I have a 6’3 athletic brother if you swing that way?",
            "author": "throwawaysugarbabe80",
            "id": "j6kbq5y",
            "parent_id": "t1_j6kasxn",
            "score": 3,
            "created_utc": 1675119324.0,
            "replies": [
                {
                    "body": "A female bff?  Im sure your brothers a nice guy, but pass.\n\nI do wish you all the love and happiness and success in your marriage though :)",
                    "author": "spoiler2023",
                    "id": "j6kcpgo",
                    "parent_id": "t1_j6kbq5y",
                    "score": 1,
                    "created_utc": 1675119716.0,
                    "replies": [
                        {
                            "body": "That’s very sweet thank you very much ❤️",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kd5lx",
                            "parent_id": "t1_j6kcpgo",
                            "score": 3,
                            "created_utc": 1675119902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even though we have a big age gap and I couldn’t be happier, I don’t think I would recommend this to any woman my age or younger tbh. He’s extremely assertive, knows what he wants and isn’t afraid to ask for it. These traits are what made him successful but in a relationship with a young adult woman could be disastrous if she’s afraid to voice her opinions, is unsure of her boundaries or doesn’t know how to vocalise her needs… which is probably most really young women.",
            "author": "throwawaysugarbabe80",
            "id": "j6l3pie",
            "parent_id": "t1_j6l2dgq",
            "score": 2,
            "created_utc": 1675131386.0,
            "replies": [
                {
                    "body": "I wouldn’t know ALL of anything. I try not to gate keep on anything involving matters of the heart. Our experiences are anecdotal and biased.",
                    "author": "JamesGarrison",
                    "id": "j6ldr8w",
                    "parent_id": "t1_j6l3pie",
                    "score": 1,
                    "created_utc": 1675135987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a good question! I almost want to find a sub for “second husbands/wives” to see what people say. \n\nMy SBF says his marriage made him introspective, which eventually led to him knowing in his heart they simply aren’t compatible humans/worldviews/etc. A lot of their issues do seem to come from that, from what I can tell. But he also has some, I dunno, habits or idiosyncrasies that I could see contributing to a “relationship becoming a self feeding cycle into resentment” with a person who is “perfectly opposed” to that. But he can also talk about what those things are in an emotionally intelligent way (perhaps enabling him to just choose better the second time). He certainly thinks something along the lines of “the first was a learning experience and now I’ve learned”. I believe he truly believes that, but only time will really tell.",
            "author": null,
            "id": "j6lk62j",
            "parent_id": "t1_j6l6t32",
            "score": 2,
            "created_utc": 1675139223.0,
            "replies": []
        },
        {
            "body": "This is a really good question. I don’t think he did. I don’t even believe he thinks either of them (his ex-wife and him) should change. He described her as a fantastic woman** and says she was a great partner (lying about birth control and libido issues aside) and recognises he married her knowing full and well they had misplaced libidos. So to him, it was a compatibility issue. \n\nI don’t know. Me and his ex-wife are very different people. Who knows. I insisted on pre-marriage counselling before we got married because we had a few communication problems I felt were a big deal and we needed to straighten out first. He obliged. I’ll know in 10/15 years if he was actually the problem I guess!",
            "author": "throwawaysugarbabe80",
            "id": "j6lyxqu",
            "parent_id": "t1_j6l6t32",
            "score": 1,
            "created_utc": 1675148580.0,
            "replies": []
        },
        {
            "body": "Yes, I do. It’s not the same naive type of love I felt for boyfriends when I was younger, it’s different but I love him with my all my heart.\n\nA while ago (in our first year together) I used to be in this SB-group and one woman asked me if I would still see him if he stopped giving me my allowance if he temporarily couldn’t for whatever financial reason and I said yes.** I got roasted pretty bad but I stand by that statement today. \n\n** I DO NOT RECOMMEND OTHER SBS TO DO THIS. DO NOT. MY HUSBAND HAS SHOWN OVER AND OVER HE WILL MAKE SURE I’M AS FINANCIALLY COMFORTABLE AS HE CAN ALLOW ME TO BE AND IS NOT THE NORM",
            "author": "throwawaysugarbabe80",
            "id": "j6ly3l6",
            "parent_id": "t1_j6lnzhp",
            "score": 4,
            "created_utc": 1675147958.0,
            "replies": []
        },
        {
            "body": "Our relationship has definitely grown stronger. His marriage wasn’t looming over my head anymore. I met his friends and family a bit before he filed, so our circles felt more intertwined from then. \n\nThe dynamic changed slightly but that was to be expected and he wanted it to change. When you go from dates once-thrice a week to seeing each other everyday, your relationship deepens. I got really sick last year and for 4 months he had to take care of me. We went from having sex 5 times a week then to almost nothing in those 4 months because I physically just wasn’t able to. I was throwing up multiple times a day daily. He emptied my vomit bucket daily and helped me shower. I used to get scared to get to a place where we’d get « too comfortable » and I still want us to keep some of the excitement of our first year of dating but he has seen me at my lowest now and I’m glad I know I can count on him if I need to.\n\nI just chose to trust him. I made some risky decisions and he could have had me looking like a fool but it worked out. I cannot stress enough how much I do not recommend others doing this because he could have gotten cold feet and not have filed for divorce, or just up and left one day because the situation was messy or just strung me along for years. I’m super lucky he didn’t. \n\nHow old is your SD’s child?",
            "author": "throwawaysugarbabe80",
            "id": "j6m2ojf",
            "parent_id": "t1_j6m18aq",
            "score": 3,
            "created_utc": 1675151498.0,
            "replies": []
        },
        {
            "body": "Yes but as I said in another comment, it’s pretty useless. We’re in Western-Europe and married under the separate property system, which means all I would normally get if we divorce is alimony (and child support if children are involved). But even alimony wouldn’t be guaranteed because a huge chunk of what he spends monthly comes from capital gains from his investments and on paper he technically doesn’t make much. So let’s say he spends 400k a year, 350k is from the dividends from his portfolio. And it’s not considered « income » so it wouldn’t fall under the calculation for alimony. Only the 50k and it’s very likely that I exceed that once I start working. \n\nThe work-around we found for this is the house we’ll building. I’ll have 70% of the equity even though he’ll be the only one paying for it. It gives me something to fall back on in the event of a divorce. That 70% will be renegotiated after we have kids to a 100%.",
            "author": "throwawaysugarbabe80",
            "id": "j6muj4v",
            "parent_id": "t1_j6ms86a",
            "score": 2,
            "created_utc": 1675171933.0,
            "replies": [
                {
                    "body": "I can't imagine his investments are doing well at the moment, especially in the markets.\n\nYou see to have it all figured out and good luck to you!",
                    "author": "superbex98",
                    "id": "j6mxhlx",
                    "parent_id": "t1_j6muj4v",
                    "score": 1,
                    "created_utc": 1675173363.0,
                    "replies": [
                        {
                            "body": "He’s doing surprisingly well actually but he’s an extremely risk-averse investor. Last time he showed me he only lost 200k on the 7M account or something like that. He’s a hedge fund partner and managing director so finance is his shtick. I’m personally deep in the red though. \n\nThank you so much! Best of luck to you aswell!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6my4t0",
                            "parent_id": "t1_j6mxhlx",
                            "score": 2,
                            "created_utc": 1675173665.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Started off with PPM for like the first 2 months, but he never gave me cash. Our M&G ended with him sending me the equivalent of a PPM so I trusted him to wire the money after each date (I do not recommend other SBs doing this, please be careful out there). Then he got sick and broke a leg and would have to cancel and I let him know it was making it difficult for me financially and we switched to allowance. The allowance has increased overtime. Hope that answered your question well?",
            "author": "throwawaysugarbabe80",
            "id": "j6nnsrm",
            "parent_id": "t1_j6nksxn",
            "score": 3,
            "created_utc": 1675183907.0,
            "replies": []
        },
        {
            "body": "Thank you so much!! Best of luck to you aswell❤️❤️",
            "author": "throwawaysugarbabe80",
            "id": "j6nnym6",
            "parent_id": "t1_j6nnc60",
            "score": 1,
            "created_utc": 1675183966.0,
            "replies": []
        },
        {
            "body": "I still get an allowance, that has never stopped. I don’t remember how much he gave me PPM but x4 it came out to about double the average rent of an apartment in the capital. So I guess 500?\n\nETA: yup, it was 500.",
            "author": "throwawaysugarbabe80",
            "id": "j6o37k2",
            "parent_id": "t1_j6nwlxi",
            "score": 1,
            "created_utc": 1675189512.0,
            "replies": []
        },
        {
            "body": "Most wouldn’t dare voice a negative opinion. My mother rolled on the floor when I told her his age and my dad still hasn’t fully come around but he’s respectful and nice to him. His mother asked me straight-up if I only wanted his son for money. I know many of my friends think the age gap is odd as well and from their opinions about certain topics in the past… most likely have negative opinions of my husband but they have never said anything and are pleasant. \nThank you!!",
            "author": "throwawaysugarbabe80",
            "id": "j6ou9k3",
            "parent_id": "t1_j6otas3",
            "score": 2,
            "created_utc": 1675199524.0,
            "replies": [
                {
                    "body": "Mind if I DM? I’m in a situation where it looks like it’s leading to marriage. Would love a chance to pick your brain.",
                    "author": "Totalorigionalname",
                    "id": "j6oultu",
                    "parent_id": "t1_j6ou9k3",
                    "score": 1,
                    "created_utc": 1675199650.0,
                    "replies": [
                        {
                            "body": "Of course you can!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6ouou1",
                            "parent_id": "t1_j6oultu",
                            "score": 1,
                            "created_utc": 1675199682.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">He has wanted children for nearly a decade now and his ex-wife didn’t, then agreed to try but apparently wasn’t being truthful about being off birth-control and ultimately told him she never would want kids\n\nThis is why I never believe in changing someone's mind if you already know you have incompatible life goals. There was a woman I was seeing regularly who was trying to convince me (perhaps for her sake) that \"she could change her mind!\" when I told her the kind of women I would automatically write off. She insisted that I have too many requirements and \"no one\" thinks that far ahead. I'm like, I don't have time to wait and guess like that. We were both in our late 30's and she has a surprisingly naive view on love and what's romantic.",
            "author": "karmaextract",
            "id": "j6kjxbe",
            "parent_id": "t1_j6katf1",
            "score": 15,
            "created_utc": 1675122702.0,
            "replies": []
        },
        {
            "body": "Yeah those are some big incompatibilities, interesting thanks!",
            "author": null,
            "id": "j6kb1ve",
            "parent_id": "t1_j6katf1",
            "score": 7,
            "created_utc": 1675119060.0,
            "replies": []
        },
        {
            "body": "All power to you! Congrats to you & your previous SD/future husband! I will say that many of us get cheated on with vanilla relationships as well so I just see it as a potential risk regardless 😅😅 \n\nI hope I'll get a husband who's well off, kind, respectful, and adores me so I hopefully don't have to worry about that but we'll see what the future holds lol. I hope you have a successful marriage!",
            "author": "di_caro2811",
            "id": "j6kb08d",
            "parent_id": "t1_j6k73wn",
            "score": 9,
            "created_utc": 1675119042.0,
            "replies": []
        },
        {
            "body": "I've been married twice. Met my 1st wife at 19, we were dead bedroom by the age of 25. I cheated on her with my second wife. Was with my 2nd wife for 26yrs and never cheated once.\n\nMy 2nd wife had cheated with me on her previous husband. We both went into the marriage with eyes wide open. There's something about mutual trust when both already know the score. It is it's own contract if that makes any sense?",
            "author": "Sunhillian",
            "id": "j6kb3cb",
            "parent_id": "t1_j6k73wn",
            "score": 38,
            "created_utc": 1675119076.0,
            "replies": [
                {
                    "body": "ahh so you both are shitty cheaters. perfect for each other",
                    "author": "epyon-",
                    "id": "j6m707g",
                    "parent_id": "t1_j6kb3cb",
                    "score": 4,
                    "created_utc": 1675155123.0,
                    "replies": [
                        {
                            "body": "Welcome to SLF, an interesting contribution for your first post 🤔. \n\nDo you have any interest or experience in this community or is your post a one and done?",
                            "author": "Sunhillian",
                            "id": "j6mfj6z",
                            "parent_id": "t1_j6m707g",
                            "score": 6,
                            "created_utc": 1675162437.0,
                            "replies": []
                        },
                        {
                            "body": "Really Epyon?  SA and sites like it are almost built on cheaters.  If you've been in the Bowl for more than a few months you'd know that most SB's (at least one's I've encountered over the years) don't care about the SD's relationship status, and in fact many prefer taken men.  It limits the time the SB has to spend with him, and in the case of SB's who are scammers / bad actors to blackmail those men.  I'm single but I've had a few SB's dumb enough to brag to me about blackmail / extortion of married SD's.  This is not a dating world where monogamy and true love are the goal, but good for the OP if she found it.  Being a \"shitty cheater\" means nothing in the sugar world in my opinion.\n\nI just hope the OP has a pre-nup......and while it's great that she trusts him and is fully aware of the potential issues, the trade in after he wants something younger comments I read sound like they fit this guys personality.  So trust all you want, but document and protect yourself would be my advise to her.",
                            "author": "Snoo71180",
                            "id": "j6ma31a",
                            "parent_id": "t1_j6m707g",
                            "score": 3,
                            "created_utc": 1675157809.0,
                            "replies": [
                                {
                                    "body": "He's responding to me Snoo, my marriage wasn't an SR, he's just trying to be obnoxious and succeeding 😴\n\nNor is he an SD, he's a med student with nothing more important to do than stick his nose in where it's of no value 😏",
                                    "author": "Sunhillian",
                                    "id": "j6mf0ve",
                                    "parent_id": "t1_j6ma31a",
                                    "score": 3,
                                    "created_utc": 1675162023.0,
                                    "replies": [
                                        {
                                            "body": "just pointing out that there are better ways to end a relationship before cheating",
                                            "author": "epyon-",
                                            "id": "j6nf34t",
                                            "parent_id": "t1_j6mf0ve",
                                            "score": -3,
                                            "created_utc": 1675180643.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "ive read a lot of the opposite. many who dont want to deal with a potential pissed off wife. i guess to each their own …",
                                    "author": "epyon-",
                                    "id": "j6nf6k7",
                                    "parent_id": "t1_j6ma31a",
                                    "score": -2,
                                    "created_utc": 1675180679.0,
                                    "replies": [
                                        {
                                            "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
                                            "author": "Snoo71180",
                                            "id": "j6o6lqs",
                                            "parent_id": "t1_j6nf6k7",
                                            "score": 1,
                                            "created_utc": 1675190752.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "One of my consulting clients pretty much fit that description absent the desire to have kids (he had several with prior wife).  Great wife , loved airplanes also (they had 4 or 5 and an airport on the ranch) .  She got along well with the kids from prior marriage.",
            "author": "pinotandsugar",
            "id": "j6kcgc3",
            "parent_id": "t1_j6k73wn",
            "score": 2,
            "created_utc": 1675119615.0,
            "replies": []
        },
        {
            "body": "AND - one HUGE AND IMPORTANT factor in your favor\n\nI SERIOUSLY doubt you will ever let there be a DEAD BEDROOM in your marriage!! :-)",
            "author": "sd424242",
            "id": "j6l4juc",
            "parent_id": "t1_j6k73wn",
            "score": 0,
            "created_utc": 1675131763.0,
            "replies": []
        },
        {
            "body": "1,000% CORRECT!",
            "author": "xex4u",
            "id": "j6nkcr2",
            "parent_id": "t1_j6k73wn",
            "score": 1,
            "created_utc": 1675182633.0,
            "replies": []
        },
        {
            "body": "I edited my question while you were answering so you probably didn't see this:\n\nWhen friends or family ask how you met (or even when you met), how do you respond?",
            "author": "geeky-sd",
            "id": "j6kc0q8",
            "parent_id": "t1_j6kbm2h",
            "score": 5,
            "created_utc": 1675119442.0,
            "replies": [
                {
                    "body": "We made up a whole fake story and I think we are slowly starting to believe this is actually how we met lmfao. We never ever mention SA, not even to each other and haven’t in years.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kcqr1",
                    "parent_id": "t1_j6kc0q8",
                    "score": 8,
                    "created_utc": 1675119730.0,
                    "replies": [
                        {
                            "body": "How long ago did you first meet, and how long have you been married?\n\nIt's fascinating, hopefully you don't mind the questions (I realize you said \"AMA\"). Thank you for indulging us! I presume no chance he's reading any of this.",
                            "author": "geeky-sd",
                            "id": "j6kd991",
                            "parent_id": "t1_j6kcqr1",
                            "score": 5,
                            "created_utc": 1675119943.0,
                            "replies": [
                                {
                                    "body": "We met 4years ago. He filed for divorce 2 years ago, immediately proposed to me and we got married two months ago (officially but had our ceremony literally yesterday.)\n\nI don’t mind the questions at all, I haven’t been able to tell this stuff to anyone ever so it’s liberating in a way. \n\n> I presume no chance he’s reading this.\n\nI wouldn’t care if he was but he finds Reddit weird and thinks I spend too much time on it so I doubt he is lol.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kdx2j",
                                    "parent_id": "t1_j6kd991",
                                    "score": 13,
                                    "created_utc": 1675120209.0,
                                    "replies": [
                                        {
                                            "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
                                            "author": "geeky-sd",
                                            "id": "j6ke4lb",
                                            "parent_id": "t1_j6kdx2j",
                                            "score": 3,
                                            "created_utc": 1675120292.0,
                                            "replies": [
                                                {
                                                    "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6keu5e",
                                                    "parent_id": "t1_j6ke4lb",
                                                    "score": 16,
                                                    "created_utc": 1675120583.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "j6kj1qf",
            "parent_id": "t1_j6khxa9",
            "score": 5,
            "created_utc": 1675122334.0,
            "replies": [
                {
                    "body": "Oh I was joking! I love the fact the SBs here vehemently advocate for newlings in the bowl. I don’t believe women here are making up these numbers. I’ve been out of the bowl for 4years, so I’m out the loop.\n\nThank you so much sweetheart, I’m very happy you have a fulfilling SR. May it last many more years and may you continue to be spoiled.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kjkvr",
                    "parent_id": "t1_j6kj1qf",
                    "score": 1,
                    "created_utc": 1675122558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you exclusive, or are you comfortable with him having SBs outside your marriage?\n\nIf not: Are you trolling SA to verify that?",
            "author": "geeky-sd",
            "id": "j6kaxoz",
            "parent_id": "t1_j6k7sng",
            "score": 5,
            "created_utc": 1675119015.0,
            "replies": [
                {
                    "body": "We’re exclusive. Nope. I will leave if he cheats on me (hypocrite central) and I’ve made that very very clear. \n\nI don’t watch what he does, no.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kccam",
                    "parent_id": "t1_j6kaxoz",
                    "score": 9,
                    "created_utc": 1675119571.0,
                    "replies": [
                        {
                            "body": "I think it makes sense. It sounds like he turned to sugaring out of loneliness and not an addiction to promiscuity or young pussy or cheating. So knock on wood with their compatibility be wouldnt cheat on OP.",
                            "author": "Equivalent_Newt_6969",
                            "id": "j6kd6z9",
                            "parent_id": "t1_j6kccam",
                            "score": 4,
                            "created_utc": 1675119917.0,
                            "replies": []
                        },
                        {
                            "body": ">We’re exclusive. Nope. I will leave if he cheats on me (**hypocrite central**) and I’ve made that very very clear.\n\nI don't think I would characterize that as hypocritical. He broke a promise he made to someone else. You're telling him that if he breaks a promise he made to you, then you're out the door. \"Hypocritical\" would be if you told him you wouldn't tolerate something that you have done before. Not the case here.",
                            "author": "geeky-sd",
                            "id": "j6kcztu",
                            "parent_id": "t1_j6kccam",
                            "score": 5,
                            "created_utc": 1675119834.0,
                            "replies": [
                                {
                                    "body": "I fully support people willing to consider themselves hypocritical. It promotes humility and self awareness and also helps her be aware and take caution when needed if her husband tries to do the same thing again.\n\nTrying to make mental gymnastics to justify one self when one is involved the very thing they would not allow happen to themself promotes complacency and is how you end up with that other girl the other day ratting out her ex's scheme to defraud SB's by selling their pics here on SLF.\n\nI mean, I'm not going to go out of my way and insult her for it, but if she's willing to acknowledge it herself there's no need for coddling either.",
                                    "author": "karmaextract",
                                    "id": "j6kmx1q",
                                    "parent_id": "t1_j6kcztu",
                                    "score": 4,
                                    "created_utc": 1675123967.0,
                                    "replies": [
                                        {
                                            "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6kpzzq",
                                            "parent_id": "t1_j6kmx1q",
                                            "score": 4,
                                            "created_utc": 1675125308.0,
                                            "replies": [
                                                {
                                                    "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                                                    "author": "karmaextract",
                                                    "id": "j6ks569",
                                                    "parent_id": "t1_j6kpzzq",
                                                    "score": 2,
                                                    "created_utc": 1675126249.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                                                    "author": "geeky-sd",
                                                    "id": "j6l6cou",
                                                    "parent_id": "t1_j6kpzzq",
                                                    "score": 2,
                                                    "created_utc": 1675132569.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you for going through the trouble to find these back!",
                                                            "author": "throwawaysugarbabe80",
                                                            "id": "j6lz2gq",
                                                            "parent_id": "t1_j6l6cou",
                                                            "score": 1,
                                                            "created_utc": 1675148679.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                                                    "author": "geeky-sd",
                                                                    "id": "j6mgtqn",
                                                                    "parent_id": "t1_j6lz2gq",
                                                                    "score": 1,
                                                                    "created_utc": 1675163450.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I was wondering this too - OP, are you going to have access to his socials and/or will you be looking through his socials? NGL, if I would have a relationship with SD that previously cheated with me ,  I'd want all access 😅",
                    "author": "di_caro2811",
                    "id": "j6kbzyo",
                    "parent_id": "t1_j6kaxoz",
                    "score": 2,
                    "created_utc": 1675119433.0,
                    "replies": [
                        {
                            "body": "He doesn’t have any socials outside from LinkedIn and Facebook and he doesn’t use even use the latter. But if he did I wouldn’t look through them. I can go on his phone whenever I want but I never do, I genuinely am not worried about this even though I know he could do it. But I do understand why you’d want to watch everything",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kicb7",
                            "parent_id": "t1_j6kbzyo",
                            "score": 5,
                            "created_utc": 1675122036.0,
                            "replies": [
                                {
                                    "body": "Honestly if you need to go through phones and such, you shouldn't be in the relationship at all. Obviously doing things like that may save a bit of grief, but the craziness you'll whip yourself into is NOT worth it. Trust, or don't trust, and let the chips fall where they may. Otherwise it's doomed from the start. (I'm saying this as a dude who got cheated on last year and thank my lucky stars I trusted her until I found out, since it saved me a lot of psychosis).",
                                    "author": "billbar",
                                    "id": "j6lcnty",
                                    "parent_id": "t1_j6kicb7",
                                    "score": 4,
                                    "created_utc": 1675135468.0,
                                    "replies": []
                                },
                                {
                                    "body": "That does help that he doesn't have many socials, and I think it's nice that you can go through his cell, even if you don't. And that's understandable, it's good that you're not feeling like you need to be on high alert. Honestly, I'm usually pretty trusting as well, but in this type of scenario, I seem not to be 😅 I'm glad things are working out well for you both!",
                                    "author": "di_caro2811",
                                    "id": "j6kn28q",
                                    "parent_id": "t1_j6kicb7",
                                    "score": 1,
                                    "created_utc": 1675124029.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can only aspire to have this mentality! I have major trust issues that I’m trying to work through.",
            "author": "Nana_ccs",
            "id": "j6od2mp",
            "parent_id": "t1_j6k7sng",
            "score": 1,
            "created_utc": 1675193153.0,
            "replies": []
        },
        {
            "body": "What is it (without being too specific obviously)?    The age and wealth gaps are certainly well-known to your families.  Idk if there’s an attractiveness gap as well.   What’s your cover story and are you sure no one suspects the truth?",
            "author": "DarthDaddius",
            "id": "j6l153s",
            "parent_id": "t1_j6kih1t",
            "score": 1,
            "created_utc": 1675130248.0,
            "replies": [
                {
                    "body": "He often gets invited at events as a potential investor. I used to be a waitress but for a company, not a restaurant. I would get hired for such events. Our story is that we met at one of those events but that said event is tech-related and that I* started a discussion with him towards the end of my shift. \n\nI have no idea if people buy it, and I don’t care, it’s how we met and that’s it 😂\n\nThere’s an attractiveness gap and I’m black, while he’s white so on paper we’re mismatched. My husband is fit and tall though so it’s not extreme but I know what people think when they see us each other. Don’t care, am happy.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6l2s9e",
                    "parent_id": "t1_j6l153s",
                    "score": 9,
                    "created_utc": 1675130974.0,
                    "replies": [
                        {
                            "body": "Thanks for answering.",
                            "author": "DarthDaddius",
                            "id": "j6l3gr9",
                            "parent_id": "t1_j6l2s9e",
                            "score": 2,
                            "created_utc": 1675131277.0,
                            "replies": []
                        },
                        {
                            "body": "Nice. In ours we met on a train to a music festival and she approached me in the dining car 😂",
                            "author": "roscoe7585",
                            "id": "j6mvv6c",
                            "parent_id": "t1_j6l2s9e",
                            "score": 2,
                            "created_utc": 1675172589.0,
                            "replies": [
                                {
                                    "body": "That’s way more creative haha. Nice to see others who went legit!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6mwpdi",
                                    "parent_id": "t1_j6mvv6c",
                                    "score": 2,
                                    "created_utc": 1675172994.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thank you for sharing!  Wondering if you've had any struggles due to race differences?  Are you the first black girl he's shared such an intimate and close relationship with?",
                            "author": "Beneficial-Photo-431",
                            "id": "j6pa1v5",
                            "parent_id": "t1_j6l2s9e",
                            "score": 2,
                            "created_utc": 1675205521.0,
                            "replies": [
                                {
                                    "body": "My husband exclusively prefers and only dates black women. His ex-wife is black. I didn’t need to teach him anything, thankfully!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6rj213",
                                    "parent_id": "t1_j6pa1v5",
                                    "score": 2,
                                    "created_utc": 1675251410.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Does “attractiveness gap” mean one of you is hotter than the other lol?  Which one?!\n\nCongrats!",
                            "author": "ronitabonita",
                            "id": "j6lhwx3",
                            "parent_id": "t1_j6l2s9e",
                            "score": 0,
                            "created_utc": 1675138034.0,
                            "replies": [
                                {
                                    "body": "Yes! I’m the hot one. Respectfully lol",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6lxuvm",
                                    "parent_id": "t1_j6lhwx3",
                                    "score": 9,
                                    "created_utc": 1675147782.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh my gosh!! This is my husband and I. It’s insane how much our stories are similar. We also have constructed a story.",
                            "author": "Snoo_72748",
                            "id": "j6ndzmt",
                            "parent_id": "t1_j6l2s9e",
                            "score": 1,
                            "created_utc": 1675180230.0,
                            "replies": [
                                {
                                    "body": "I just read your post and I wish you lived near me! So many similarities down to building the multimillion dollars home! My life is so different now, as such a young age, it’s crazy. I sometimes can’t believe I got so lucky and I get to be so happy. My mom raised us all alone growing up and she had it tough and she often says she thinks God sent me my husband because she suffered enough.\n\nI wish you guys many many more years of happiness!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6ngfa8",
                                    "parent_id": "t1_j6ndzmt",
                                    "score": 1,
                                    "created_utc": 1675181153.0,
                                    "replies": [
                                        {
                                            "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
                                            "author": "Snoo_72748",
                                            "id": "j6niu51",
                                            "parent_id": "t1_j6ngfa8",
                                            "score": 1,
                                            "created_utc": 1675182059.0,
                                            "replies": [
                                                {
                                                    "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6nl95w",
                                                    "parent_id": "t1_j6niu51",
                                                    "score": 1,
                                                    "created_utc": 1675182973.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                                                            "author": "Snoo_72748",
                                                            "id": "j6no8md",
                                                            "parent_id": "t1_j6nl95w",
                                                            "score": 1,
                                                            "created_utc": 1675184067.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                                                    "author": "throwawaysugarbabe80",
                                                                    "id": "j6npeu7",
                                                                    "parent_id": "t1_j6no8md",
                                                                    "score": 1,
                                                                    "created_utc": 1675184490.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What was the moment when you realized that this was going to be a serious, long term relationship? \n\nSorry about all the questions. I've been happily together with mine for 3 years and I just wanted to know what it's like for other long term couples 😅",
            "author": "iknowwhatiwantbroski",
            "id": "j6kn8fr",
            "parent_id": "t1_j6kmqoi",
            "score": 2,
            "created_utc": 1675124102.0,
            "replies": [
                {
                    "body": "Congrats on the 3 years!! Are you hoping you guys will make it down the aisle?\n\nI don’t have one particular big moment. There are a few instances where I remember realising he was in for the long-haul:\n• He insisted on calling me his girlfriend like a month in. I would joke that a married man doesn’t have a girlfriend but a mistress but he hated anything but the word “girlfriend”.\n\n• He stopped caring about all kinds of OPSEC super early on. He had a different phone at first to message me he kept in his office and then he got worried I wouldn’t be able to contact him in case of emergency so I got his real number and ultimately he just started messaging me on there. He would also just bring me wherever; we regularly had dates literally a few meters from his workplace. \n\n• When his wife found out about me I told him he really should be more careful going forward because I didn’t want him to have to stop our relationship over this and he said at that point he didn’t think anything would stop him from being with me. \n\nI believe we were on vacation in Barcelona, like a year in when I thought “I wouldn’t mind this lasting for many many more years” but I didn’t have a revelation or anything.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kp6k6",
                    "parent_id": "t1_j6kn8fr",
                    "score": 3,
                    "created_utc": 1675124946.0,
                    "replies": [
                        {
                            "body": "Sounds like you're the right person who came along at just the right time. May you have the happy marriage  that you're both looking for!\n\nIm fully accepting of the fact that mine wont leave his wife for me but we've been talking about how things would be for us long term and how I'll still be taken care of even after he's gone. We have an age gap of 30 years so I really dont think there's enough years in his lifetime for another marriage but we're happy just the way we are",
                            "author": "iknowwhatiwantbroski",
                            "id": "j6kqy4b",
                            "parent_id": "t1_j6kp6k6",
                            "score": 5,
                            "created_utc": 1675125724.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "that's how you know he was for real\n\nas opposed to the usual \"I'm juuuuuuust about to leave her\"",
            "author": "Gemini-Fox",
            "id": "j6svqpy",
            "parent_id": "t1_j6lxsg7",
            "score": 1,
            "created_utc": 1675273050.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j6oqykz",
            "parent_id": "t1_j6np87s",
            "score": 1,
            "created_utc": 1675198304.0,
            "replies": [
                {
                    "body": "I don’t think it’s a « most women »-thing. My closest girlfriends are all with men their age who aren’t what I would consider successful but they are also seemingly happy. What I want in a man =/= what most women want in a man. I can only speak for myself. \n\nAlso… this is a self-selecting club isn’t it? Women who like attractive men will become SBs while most women won’t because they don’t care as much. So naturally all your SBs valued success way more than the average woman.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6ost9k",
                    "parent_id": "t1_j6oqykz",
                    "score": 3,
                    "created_utc": 1675198982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j6oct37",
            "parent_id": "t1_j6o2v3g",
            "score": 1,
            "created_utc": 1675193056.0,
            "replies": [
                {
                    "body": "They are already divorced lol, so I know exactly how much he got. And yep, he got to keep all the 10M. Let me introduce you to the concept of marital property systems and how they differ in each country!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6odfjf",
                    "parent_id": "t1_j6oct37",
                    "score": 1,
                    "created_utc": 1675193288.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j6offk4",
                            "parent_id": "t1_j6odfjf",
                            "score": 1,
                            "created_utc": 1675194035.0,
                            "replies": [
                                {
                                    "body": "Girl…. Did you like completely skip the title? I’m already married. The prenup was drafted and signed months ago.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6ogvkp",
                                    "parent_id": "t1_j6offk4",
                                    "score": 1,
                                    "created_utc": 1675194572.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A female bff?  Im sure your brothers a nice guy, but pass.\n\nI do wish you all the love and happiness and success in your marriage though :)",
            "author": "spoiler2023",
            "id": "j6kcpgo",
            "parent_id": "t1_j6kbq5y",
            "score": 1,
            "created_utc": 1675119716.0,
            "replies": [
                {
                    "body": "That’s very sweet thank you very much ❤️",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kd5lx",
                    "parent_id": "t1_j6kcpgo",
                    "score": 3,
                    "created_utc": 1675119902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t know ALL of anything. I try not to gate keep on anything involving matters of the heart. Our experiences are anecdotal and biased.",
            "author": "JamesGarrison",
            "id": "j6ldr8w",
            "parent_id": "t1_j6l3pie",
            "score": 1,
            "created_utc": 1675135987.0,
            "replies": []
        },
        {
            "body": "I can't imagine his investments are doing well at the moment, especially in the markets.\n\nYou see to have it all figured out and good luck to you!",
            "author": "superbex98",
            "id": "j6mxhlx",
            "parent_id": "t1_j6muj4v",
            "score": 1,
            "created_utc": 1675173363.0,
            "replies": [
                {
                    "body": "He’s doing surprisingly well actually but he’s an extremely risk-averse investor. Last time he showed me he only lost 200k on the 7M account or something like that. He’s a hedge fund partner and managing director so finance is his shtick. I’m personally deep in the red though. \n\nThank you so much! Best of luck to you aswell!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6my4t0",
                    "parent_id": "t1_j6mxhlx",
                    "score": 2,
                    "created_utc": 1675173665.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mind if I DM? I’m in a situation where it looks like it’s leading to marriage. Would love a chance to pick your brain.",
            "author": "Totalorigionalname",
            "id": "j6oultu",
            "parent_id": "t1_j6ou9k3",
            "score": 1,
            "created_utc": 1675199650.0,
            "replies": [
                {
                    "body": "Of course you can!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6ouou1",
                    "parent_id": "t1_j6oultu",
                    "score": 1,
                    "created_utc": 1675199682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ahh so you both are shitty cheaters. perfect for each other",
            "author": "epyon-",
            "id": "j6m707g",
            "parent_id": "t1_j6kb3cb",
            "score": 4,
            "created_utc": 1675155123.0,
            "replies": [
                {
                    "body": "Welcome to SLF, an interesting contribution for your first post 🤔. \n\nDo you have any interest or experience in this community or is your post a one and done?",
                    "author": "Sunhillian",
                    "id": "j6mfj6z",
                    "parent_id": "t1_j6m707g",
                    "score": 6,
                    "created_utc": 1675162437.0,
                    "replies": []
                },
                {
                    "body": "Really Epyon?  SA and sites like it are almost built on cheaters.  If you've been in the Bowl for more than a few months you'd know that most SB's (at least one's I've encountered over the years) don't care about the SD's relationship status, and in fact many prefer taken men.  It limits the time the SB has to spend with him, and in the case of SB's who are scammers / bad actors to blackmail those men.  I'm single but I've had a few SB's dumb enough to brag to me about blackmail / extortion of married SD's.  This is not a dating world where monogamy and true love are the goal, but good for the OP if she found it.  Being a \"shitty cheater\" means nothing in the sugar world in my opinion.\n\nI just hope the OP has a pre-nup......and while it's great that she trusts him and is fully aware of the potential issues, the trade in after he wants something younger comments I read sound like they fit this guys personality.  So trust all you want, but document and protect yourself would be my advise to her.",
                    "author": "Snoo71180",
                    "id": "j6ma31a",
                    "parent_id": "t1_j6m707g",
                    "score": 3,
                    "created_utc": 1675157809.0,
                    "replies": [
                        {
                            "body": "He's responding to me Snoo, my marriage wasn't an SR, he's just trying to be obnoxious and succeeding 😴\n\nNor is he an SD, he's a med student with nothing more important to do than stick his nose in where it's of no value 😏",
                            "author": "Sunhillian",
                            "id": "j6mf0ve",
                            "parent_id": "t1_j6ma31a",
                            "score": 3,
                            "created_utc": 1675162023.0,
                            "replies": [
                                {
                                    "body": "just pointing out that there are better ways to end a relationship before cheating",
                                    "author": "epyon-",
                                    "id": "j6nf34t",
                                    "parent_id": "t1_j6mf0ve",
                                    "score": -3,
                                    "created_utc": 1675180643.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "ive read a lot of the opposite. many who dont want to deal with a potential pissed off wife. i guess to each their own …",
                            "author": "epyon-",
                            "id": "j6nf6k7",
                            "parent_id": "t1_j6ma31a",
                            "score": -2,
                            "created_utc": 1675180679.0,
                            "replies": [
                                {
                                    "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
                                    "author": "Snoo71180",
                                    "id": "j6o6lqs",
                                    "parent_id": "t1_j6nf6k7",
                                    "score": 1,
                                    "created_utc": 1675190752.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We made up a whole fake story and I think we are slowly starting to believe this is actually how we met lmfao. We never ever mention SA, not even to each other and haven’t in years.",
            "author": "throwawaysugarbabe80",
            "id": "j6kcqr1",
            "parent_id": "t1_j6kc0q8",
            "score": 8,
            "created_utc": 1675119730.0,
            "replies": [
                {
                    "body": "How long ago did you first meet, and how long have you been married?\n\nIt's fascinating, hopefully you don't mind the questions (I realize you said \"AMA\"). Thank you for indulging us! I presume no chance he's reading any of this.",
                    "author": "geeky-sd",
                    "id": "j6kd991",
                    "parent_id": "t1_j6kcqr1",
                    "score": 5,
                    "created_utc": 1675119943.0,
                    "replies": [
                        {
                            "body": "We met 4years ago. He filed for divorce 2 years ago, immediately proposed to me and we got married two months ago (officially but had our ceremony literally yesterday.)\n\nI don’t mind the questions at all, I haven’t been able to tell this stuff to anyone ever so it’s liberating in a way. \n\n> I presume no chance he’s reading this.\n\nI wouldn’t care if he was but he finds Reddit weird and thinks I spend too much time on it so I doubt he is lol.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kdx2j",
                            "parent_id": "t1_j6kd991",
                            "score": 13,
                            "created_utc": 1675120209.0,
                            "replies": [
                                {
                                    "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
                                    "author": "geeky-sd",
                                    "id": "j6ke4lb",
                                    "parent_id": "t1_j6kdx2j",
                                    "score": 3,
                                    "created_utc": 1675120292.0,
                                    "replies": [
                                        {
                                            "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6keu5e",
                                            "parent_id": "t1_j6ke4lb",
                                            "score": 16,
                                            "created_utc": 1675120583.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I was joking! I love the fact the SBs here vehemently advocate for newlings in the bowl. I don’t believe women here are making up these numbers. I’ve been out of the bowl for 4years, so I’m out the loop.\n\nThank you so much sweetheart, I’m very happy you have a fulfilling SR. May it last many more years and may you continue to be spoiled.",
            "author": "throwawaysugarbabe80",
            "id": "j6kjkvr",
            "parent_id": "t1_j6kj1qf",
            "score": 1,
            "created_utc": 1675122558.0,
            "replies": []
        },
        {
            "body": "We’re exclusive. Nope. I will leave if he cheats on me (hypocrite central) and I’ve made that very very clear. \n\nI don’t watch what he does, no.",
            "author": "throwawaysugarbabe80",
            "id": "j6kccam",
            "parent_id": "t1_j6kaxoz",
            "score": 9,
            "created_utc": 1675119571.0,
            "replies": [
                {
                    "body": "I think it makes sense. It sounds like he turned to sugaring out of loneliness and not an addiction to promiscuity or young pussy or cheating. So knock on wood with their compatibility be wouldnt cheat on OP.",
                    "author": "Equivalent_Newt_6969",
                    "id": "j6kd6z9",
                    "parent_id": "t1_j6kccam",
                    "score": 4,
                    "created_utc": 1675119917.0,
                    "replies": []
                },
                {
                    "body": ">We’re exclusive. Nope. I will leave if he cheats on me (**hypocrite central**) and I’ve made that very very clear.\n\nI don't think I would characterize that as hypocritical. He broke a promise he made to someone else. You're telling him that if he breaks a promise he made to you, then you're out the door. \"Hypocritical\" would be if you told him you wouldn't tolerate something that you have done before. Not the case here.",
                    "author": "geeky-sd",
                    "id": "j6kcztu",
                    "parent_id": "t1_j6kccam",
                    "score": 5,
                    "created_utc": 1675119834.0,
                    "replies": [
                        {
                            "body": "I fully support people willing to consider themselves hypocritical. It promotes humility and self awareness and also helps her be aware and take caution when needed if her husband tries to do the same thing again.\n\nTrying to make mental gymnastics to justify one self when one is involved the very thing they would not allow happen to themself promotes complacency and is how you end up with that other girl the other day ratting out her ex's scheme to defraud SB's by selling their pics here on SLF.\n\nI mean, I'm not going to go out of my way and insult her for it, but if she's willing to acknowledge it herself there's no need for coddling either.",
                            "author": "karmaextract",
                            "id": "j6kmx1q",
                            "parent_id": "t1_j6kcztu",
                            "score": 4,
                            "created_utc": 1675123967.0,
                            "replies": [
                                {
                                    "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6kpzzq",
                                    "parent_id": "t1_j6kmx1q",
                                    "score": 4,
                                    "created_utc": 1675125308.0,
                                    "replies": [
                                        {
                                            "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                                            "author": "karmaextract",
                                            "id": "j6ks569",
                                            "parent_id": "t1_j6kpzzq",
                                            "score": 2,
                                            "created_utc": 1675126249.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                                            "author": "geeky-sd",
                                            "id": "j6l6cou",
                                            "parent_id": "t1_j6kpzzq",
                                            "score": 2,
                                            "created_utc": 1675132569.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for going through the trouble to find these back!",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6lz2gq",
                                                    "parent_id": "t1_j6l6cou",
                                                    "score": 1,
                                                    "created_utc": 1675148679.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                                            "author": "geeky-sd",
                                                            "id": "j6mgtqn",
                                                            "parent_id": "t1_j6lz2gq",
                                                            "score": 1,
                                                            "created_utc": 1675163450.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was wondering this too - OP, are you going to have access to his socials and/or will you be looking through his socials? NGL, if I would have a relationship with SD that previously cheated with me ,  I'd want all access 😅",
            "author": "di_caro2811",
            "id": "j6kbzyo",
            "parent_id": "t1_j6kaxoz",
            "score": 2,
            "created_utc": 1675119433.0,
            "replies": [
                {
                    "body": "He doesn’t have any socials outside from LinkedIn and Facebook and he doesn’t use even use the latter. But if he did I wouldn’t look through them. I can go on his phone whenever I want but I never do, I genuinely am not worried about this even though I know he could do it. But I do understand why you’d want to watch everything",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kicb7",
                    "parent_id": "t1_j6kbzyo",
                    "score": 5,
                    "created_utc": 1675122036.0,
                    "replies": [
                        {
                            "body": "Honestly if you need to go through phones and such, you shouldn't be in the relationship at all. Obviously doing things like that may save a bit of grief, but the craziness you'll whip yourself into is NOT worth it. Trust, or don't trust, and let the chips fall where they may. Otherwise it's doomed from the start. (I'm saying this as a dude who got cheated on last year and thank my lucky stars I trusted her until I found out, since it saved me a lot of psychosis).",
                            "author": "billbar",
                            "id": "j6lcnty",
                            "parent_id": "t1_j6kicb7",
                            "score": 4,
                            "created_utc": 1675135468.0,
                            "replies": []
                        },
                        {
                            "body": "That does help that he doesn't have many socials, and I think it's nice that you can go through his cell, even if you don't. And that's understandable, it's good that you're not feeling like you need to be on high alert. Honestly, I'm usually pretty trusting as well, but in this type of scenario, I seem not to be 😅 I'm glad things are working out well for you both!",
                            "author": "di_caro2811",
                            "id": "j6kn28q",
                            "parent_id": "t1_j6kicb7",
                            "score": 1,
                            "created_utc": 1675124029.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He often gets invited at events as a potential investor. I used to be a waitress but for a company, not a restaurant. I would get hired for such events. Our story is that we met at one of those events but that said event is tech-related and that I* started a discussion with him towards the end of my shift. \n\nI have no idea if people buy it, and I don’t care, it’s how we met and that’s it 😂\n\nThere’s an attractiveness gap and I’m black, while he’s white so on paper we’re mismatched. My husband is fit and tall though so it’s not extreme but I know what people think when they see us each other. Don’t care, am happy.",
            "author": "throwawaysugarbabe80",
            "id": "j6l2s9e",
            "parent_id": "t1_j6l153s",
            "score": 9,
            "created_utc": 1675130974.0,
            "replies": [
                {
                    "body": "Thanks for answering.",
                    "author": "DarthDaddius",
                    "id": "j6l3gr9",
                    "parent_id": "t1_j6l2s9e",
                    "score": 2,
                    "created_utc": 1675131277.0,
                    "replies": []
                },
                {
                    "body": "Nice. In ours we met on a train to a music festival and she approached me in the dining car 😂",
                    "author": "roscoe7585",
                    "id": "j6mvv6c",
                    "parent_id": "t1_j6l2s9e",
                    "score": 2,
                    "created_utc": 1675172589.0,
                    "replies": [
                        {
                            "body": "That’s way more creative haha. Nice to see others who went legit!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6mwpdi",
                            "parent_id": "t1_j6mvv6c",
                            "score": 2,
                            "created_utc": 1675172994.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you for sharing!  Wondering if you've had any struggles due to race differences?  Are you the first black girl he's shared such an intimate and close relationship with?",
                    "author": "Beneficial-Photo-431",
                    "id": "j6pa1v5",
                    "parent_id": "t1_j6l2s9e",
                    "score": 2,
                    "created_utc": 1675205521.0,
                    "replies": [
                        {
                            "body": "My husband exclusively prefers and only dates black women. His ex-wife is black. I didn’t need to teach him anything, thankfully!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6rj213",
                            "parent_id": "t1_j6pa1v5",
                            "score": 2,
                            "created_utc": 1675251410.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Does “attractiveness gap” mean one of you is hotter than the other lol?  Which one?!\n\nCongrats!",
                    "author": "ronitabonita",
                    "id": "j6lhwx3",
                    "parent_id": "t1_j6l2s9e",
                    "score": 0,
                    "created_utc": 1675138034.0,
                    "replies": [
                        {
                            "body": "Yes! I’m the hot one. Respectfully lol",
                            "author": "throwawaysugarbabe80",
                            "id": "j6lxuvm",
                            "parent_id": "t1_j6lhwx3",
                            "score": 9,
                            "created_utc": 1675147782.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh my gosh!! This is my husband and I. It’s insane how much our stories are similar. We also have constructed a story.",
                    "author": "Snoo_72748",
                    "id": "j6ndzmt",
                    "parent_id": "t1_j6l2s9e",
                    "score": 1,
                    "created_utc": 1675180230.0,
                    "replies": [
                        {
                            "body": "I just read your post and I wish you lived near me! So many similarities down to building the multimillion dollars home! My life is so different now, as such a young age, it’s crazy. I sometimes can’t believe I got so lucky and I get to be so happy. My mom raised us all alone growing up and she had it tough and she often says she thinks God sent me my husband because she suffered enough.\n\nI wish you guys many many more years of happiness!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6ngfa8",
                            "parent_id": "t1_j6ndzmt",
                            "score": 1,
                            "created_utc": 1675181153.0,
                            "replies": [
                                {
                                    "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
                                    "author": "Snoo_72748",
                                    "id": "j6niu51",
                                    "parent_id": "t1_j6ngfa8",
                                    "score": 1,
                                    "created_utc": 1675182059.0,
                                    "replies": [
                                        {
                                            "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6nl95w",
                                            "parent_id": "t1_j6niu51",
                                            "score": 1,
                                            "created_utc": 1675182973.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                                                    "author": "Snoo_72748",
                                                    "id": "j6no8md",
                                                    "parent_id": "t1_j6nl95w",
                                                    "score": 1,
                                                    "created_utc": 1675184067.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                                            "author": "throwawaysugarbabe80",
                                                            "id": "j6npeu7",
                                                            "parent_id": "t1_j6no8md",
                                                            "score": 1,
                                                            "created_utc": 1675184490.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congrats on the 3 years!! Are you hoping you guys will make it down the aisle?\n\nI don’t have one particular big moment. There are a few instances where I remember realising he was in for the long-haul:\n• He insisted on calling me his girlfriend like a month in. I would joke that a married man doesn’t have a girlfriend but a mistress but he hated anything but the word “girlfriend”.\n\n• He stopped caring about all kinds of OPSEC super early on. He had a different phone at first to message me he kept in his office and then he got worried I wouldn’t be able to contact him in case of emergency so I got his real number and ultimately he just started messaging me on there. He would also just bring me wherever; we regularly had dates literally a few meters from his workplace. \n\n• When his wife found out about me I told him he really should be more careful going forward because I didn’t want him to have to stop our relationship over this and he said at that point he didn’t think anything would stop him from being with me. \n\nI believe we were on vacation in Barcelona, like a year in when I thought “I wouldn’t mind this lasting for many many more years” but I didn’t have a revelation or anything.",
            "author": "throwawaysugarbabe80",
            "id": "j6kp6k6",
            "parent_id": "t1_j6kn8fr",
            "score": 3,
            "created_utc": 1675124946.0,
            "replies": [
                {
                    "body": "Sounds like you're the right person who came along at just the right time. May you have the happy marriage  that you're both looking for!\n\nIm fully accepting of the fact that mine wont leave his wife for me but we've been talking about how things would be for us long term and how I'll still be taken care of even after he's gone. We have an age gap of 30 years so I really dont think there's enough years in his lifetime for another marriage but we're happy just the way we are",
                    "author": "iknowwhatiwantbroski",
                    "id": "j6kqy4b",
                    "parent_id": "t1_j6kp6k6",
                    "score": 5,
                    "created_utc": 1675125724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think it’s a « most women »-thing. My closest girlfriends are all with men their age who aren’t what I would consider successful but they are also seemingly happy. What I want in a man =/= what most women want in a man. I can only speak for myself. \n\nAlso… this is a self-selecting club isn’t it? Women who like attractive men will become SBs while most women won’t because they don’t care as much. So naturally all your SBs valued success way more than the average woman.",
            "author": "throwawaysugarbabe80",
            "id": "j6ost9k",
            "parent_id": "t1_j6oqykz",
            "score": 3,
            "created_utc": 1675198982.0,
            "replies": []
        },
        {
            "body": "They are already divorced lol, so I know exactly how much he got. And yep, he got to keep all the 10M. Let me introduce you to the concept of marital property systems and how they differ in each country!",
            "author": "throwawaysugarbabe80",
            "id": "j6odfjf",
            "parent_id": "t1_j6oct37",
            "score": 1,
            "created_utc": 1675193288.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j6offk4",
                    "parent_id": "t1_j6odfjf",
                    "score": 1,
                    "created_utc": 1675194035.0,
                    "replies": [
                        {
                            "body": "Girl…. Did you like completely skip the title? I’m already married. The prenup was drafted and signed months ago.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6ogvkp",
                            "parent_id": "t1_j6offk4",
                            "score": 1,
                            "created_utc": 1675194572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s very sweet thank you very much ❤️",
            "author": "throwawaysugarbabe80",
            "id": "j6kd5lx",
            "parent_id": "t1_j6kcpgo",
            "score": 3,
            "created_utc": 1675119902.0,
            "replies": []
        },
        {
            "body": "He’s doing surprisingly well actually but he’s an extremely risk-averse investor. Last time he showed me he only lost 200k on the 7M account or something like that. He’s a hedge fund partner and managing director so finance is his shtick. I’m personally deep in the red though. \n\nThank you so much! Best of luck to you aswell!",
            "author": "throwawaysugarbabe80",
            "id": "j6my4t0",
            "parent_id": "t1_j6mxhlx",
            "score": 2,
            "created_utc": 1675173665.0,
            "replies": []
        },
        {
            "body": "Of course you can!",
            "author": "throwawaysugarbabe80",
            "id": "j6ouou1",
            "parent_id": "t1_j6oultu",
            "score": 1,
            "created_utc": 1675199682.0,
            "replies": []
        },
        {
            "body": "Welcome to SLF, an interesting contribution for your first post 🤔. \n\nDo you have any interest or experience in this community or is your post a one and done?",
            "author": "Sunhillian",
            "id": "j6mfj6z",
            "parent_id": "t1_j6m707g",
            "score": 6,
            "created_utc": 1675162437.0,
            "replies": []
        },
        {
            "body": "Really Epyon?  SA and sites like it are almost built on cheaters.  If you've been in the Bowl for more than a few months you'd know that most SB's (at least one's I've encountered over the years) don't care about the SD's relationship status, and in fact many prefer taken men.  It limits the time the SB has to spend with him, and in the case of SB's who are scammers / bad actors to blackmail those men.  I'm single but I've had a few SB's dumb enough to brag to me about blackmail / extortion of married SD's.  This is not a dating world where monogamy and true love are the goal, but good for the OP if she found it.  Being a \"shitty cheater\" means nothing in the sugar world in my opinion.\n\nI just hope the OP has a pre-nup......and while it's great that she trusts him and is fully aware of the potential issues, the trade in after he wants something younger comments I read sound like they fit this guys personality.  So trust all you want, but document and protect yourself would be my advise to her.",
            "author": "Snoo71180",
            "id": "j6ma31a",
            "parent_id": "t1_j6m707g",
            "score": 3,
            "created_utc": 1675157809.0,
            "replies": [
                {
                    "body": "He's responding to me Snoo, my marriage wasn't an SR, he's just trying to be obnoxious and succeeding 😴\n\nNor is he an SD, he's a med student with nothing more important to do than stick his nose in where it's of no value 😏",
                    "author": "Sunhillian",
                    "id": "j6mf0ve",
                    "parent_id": "t1_j6ma31a",
                    "score": 3,
                    "created_utc": 1675162023.0,
                    "replies": [
                        {
                            "body": "just pointing out that there are better ways to end a relationship before cheating",
                            "author": "epyon-",
                            "id": "j6nf34t",
                            "parent_id": "t1_j6mf0ve",
                            "score": -3,
                            "created_utc": 1675180643.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "ive read a lot of the opposite. many who dont want to deal with a potential pissed off wife. i guess to each their own …",
                    "author": "epyon-",
                    "id": "j6nf6k7",
                    "parent_id": "t1_j6ma31a",
                    "score": -2,
                    "created_utc": 1675180679.0,
                    "replies": [
                        {
                            "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
                            "author": "Snoo71180",
                            "id": "j6o6lqs",
                            "parent_id": "t1_j6nf6k7",
                            "score": 1,
                            "created_utc": 1675190752.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How long ago did you first meet, and how long have you been married?\n\nIt's fascinating, hopefully you don't mind the questions (I realize you said \"AMA\"). Thank you for indulging us! I presume no chance he's reading any of this.",
            "author": "geeky-sd",
            "id": "j6kd991",
            "parent_id": "t1_j6kcqr1",
            "score": 5,
            "created_utc": 1675119943.0,
            "replies": [
                {
                    "body": "We met 4years ago. He filed for divorce 2 years ago, immediately proposed to me and we got married two months ago (officially but had our ceremony literally yesterday.)\n\nI don’t mind the questions at all, I haven’t been able to tell this stuff to anyone ever so it’s liberating in a way. \n\n> I presume no chance he’s reading this.\n\nI wouldn’t care if he was but he finds Reddit weird and thinks I spend too much time on it so I doubt he is lol.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kdx2j",
                    "parent_id": "t1_j6kd991",
                    "score": 13,
                    "created_utc": 1675120209.0,
                    "replies": [
                        {
                            "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
                            "author": "geeky-sd",
                            "id": "j6ke4lb",
                            "parent_id": "t1_j6kdx2j",
                            "score": 3,
                            "created_utc": 1675120292.0,
                            "replies": [
                                {
                                    "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6keu5e",
                                    "parent_id": "t1_j6ke4lb",
                                    "score": 16,
                                    "created_utc": 1675120583.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think it makes sense. It sounds like he turned to sugaring out of loneliness and not an addiction to promiscuity or young pussy or cheating. So knock on wood with their compatibility be wouldnt cheat on OP.",
            "author": "Equivalent_Newt_6969",
            "id": "j6kd6z9",
            "parent_id": "t1_j6kccam",
            "score": 4,
            "created_utc": 1675119917.0,
            "replies": []
        },
        {
            "body": ">We’re exclusive. Nope. I will leave if he cheats on me (**hypocrite central**) and I’ve made that very very clear.\n\nI don't think I would characterize that as hypocritical. He broke a promise he made to someone else. You're telling him that if he breaks a promise he made to you, then you're out the door. \"Hypocritical\" would be if you told him you wouldn't tolerate something that you have done before. Not the case here.",
            "author": "geeky-sd",
            "id": "j6kcztu",
            "parent_id": "t1_j6kccam",
            "score": 5,
            "created_utc": 1675119834.0,
            "replies": [
                {
                    "body": "I fully support people willing to consider themselves hypocritical. It promotes humility and self awareness and also helps her be aware and take caution when needed if her husband tries to do the same thing again.\n\nTrying to make mental gymnastics to justify one self when one is involved the very thing they would not allow happen to themself promotes complacency and is how you end up with that other girl the other day ratting out her ex's scheme to defraud SB's by selling their pics here on SLF.\n\nI mean, I'm not going to go out of my way and insult her for it, but if she's willing to acknowledge it herself there's no need for coddling either.",
                    "author": "karmaextract",
                    "id": "j6kmx1q",
                    "parent_id": "t1_j6kcztu",
                    "score": 4,
                    "created_utc": 1675123967.0,
                    "replies": [
                        {
                            "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
                            "author": "throwawaysugarbabe80",
                            "id": "j6kpzzq",
                            "parent_id": "t1_j6kmx1q",
                            "score": 4,
                            "created_utc": 1675125308.0,
                            "replies": [
                                {
                                    "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                                    "author": "karmaextract",
                                    "id": "j6ks569",
                                    "parent_id": "t1_j6kpzzq",
                                    "score": 2,
                                    "created_utc": 1675126249.0,
                                    "replies": []
                                },
                                {
                                    "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                                    "author": "geeky-sd",
                                    "id": "j6l6cou",
                                    "parent_id": "t1_j6kpzzq",
                                    "score": 2,
                                    "created_utc": 1675132569.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for going through the trouble to find these back!",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6lz2gq",
                                            "parent_id": "t1_j6l6cou",
                                            "score": 1,
                                            "created_utc": 1675148679.0,
                                            "replies": [
                                                {
                                                    "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                                    "author": "geeky-sd",
                                                    "id": "j6mgtqn",
                                                    "parent_id": "t1_j6lz2gq",
                                                    "score": 1,
                                                    "created_utc": 1675163450.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He doesn’t have any socials outside from LinkedIn and Facebook and he doesn’t use even use the latter. But if he did I wouldn’t look through them. I can go on his phone whenever I want but I never do, I genuinely am not worried about this even though I know he could do it. But I do understand why you’d want to watch everything",
            "author": "throwawaysugarbabe80",
            "id": "j6kicb7",
            "parent_id": "t1_j6kbzyo",
            "score": 5,
            "created_utc": 1675122036.0,
            "replies": [
                {
                    "body": "Honestly if you need to go through phones and such, you shouldn't be in the relationship at all. Obviously doing things like that may save a bit of grief, but the craziness you'll whip yourself into is NOT worth it. Trust, or don't trust, and let the chips fall where they may. Otherwise it's doomed from the start. (I'm saying this as a dude who got cheated on last year and thank my lucky stars I trusted her until I found out, since it saved me a lot of psychosis).",
                    "author": "billbar",
                    "id": "j6lcnty",
                    "parent_id": "t1_j6kicb7",
                    "score": 4,
                    "created_utc": 1675135468.0,
                    "replies": []
                },
                {
                    "body": "That does help that he doesn't have many socials, and I think it's nice that you can go through his cell, even if you don't. And that's understandable, it's good that you're not feeling like you need to be on high alert. Honestly, I'm usually pretty trusting as well, but in this type of scenario, I seem not to be 😅 I'm glad things are working out well for you both!",
                    "author": "di_caro2811",
                    "id": "j6kn28q",
                    "parent_id": "t1_j6kicb7",
                    "score": 1,
                    "created_utc": 1675124029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for answering.",
            "author": "DarthDaddius",
            "id": "j6l3gr9",
            "parent_id": "t1_j6l2s9e",
            "score": 2,
            "created_utc": 1675131277.0,
            "replies": []
        },
        {
            "body": "Nice. In ours we met on a train to a music festival and she approached me in the dining car 😂",
            "author": "roscoe7585",
            "id": "j6mvv6c",
            "parent_id": "t1_j6l2s9e",
            "score": 2,
            "created_utc": 1675172589.0,
            "replies": [
                {
                    "body": "That’s way more creative haha. Nice to see others who went legit!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6mwpdi",
                    "parent_id": "t1_j6mvv6c",
                    "score": 2,
                    "created_utc": 1675172994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for sharing!  Wondering if you've had any struggles due to race differences?  Are you the first black girl he's shared such an intimate and close relationship with?",
            "author": "Beneficial-Photo-431",
            "id": "j6pa1v5",
            "parent_id": "t1_j6l2s9e",
            "score": 2,
            "created_utc": 1675205521.0,
            "replies": [
                {
                    "body": "My husband exclusively prefers and only dates black women. His ex-wife is black. I didn’t need to teach him anything, thankfully!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6rj213",
                    "parent_id": "t1_j6pa1v5",
                    "score": 2,
                    "created_utc": 1675251410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Does “attractiveness gap” mean one of you is hotter than the other lol?  Which one?!\n\nCongrats!",
            "author": "ronitabonita",
            "id": "j6lhwx3",
            "parent_id": "t1_j6l2s9e",
            "score": 0,
            "created_utc": 1675138034.0,
            "replies": [
                {
                    "body": "Yes! I’m the hot one. Respectfully lol",
                    "author": "throwawaysugarbabe80",
                    "id": "j6lxuvm",
                    "parent_id": "t1_j6lhwx3",
                    "score": 9,
                    "created_utc": 1675147782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my gosh!! This is my husband and I. It’s insane how much our stories are similar. We also have constructed a story.",
            "author": "Snoo_72748",
            "id": "j6ndzmt",
            "parent_id": "t1_j6l2s9e",
            "score": 1,
            "created_utc": 1675180230.0,
            "replies": [
                {
                    "body": "I just read your post and I wish you lived near me! So many similarities down to building the multimillion dollars home! My life is so different now, as such a young age, it’s crazy. I sometimes can’t believe I got so lucky and I get to be so happy. My mom raised us all alone growing up and she had it tough and she often says she thinks God sent me my husband because she suffered enough.\n\nI wish you guys many many more years of happiness!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6ngfa8",
                    "parent_id": "t1_j6ndzmt",
                    "score": 1,
                    "created_utc": 1675181153.0,
                    "replies": [
                        {
                            "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
                            "author": "Snoo_72748",
                            "id": "j6niu51",
                            "parent_id": "t1_j6ngfa8",
                            "score": 1,
                            "created_utc": 1675182059.0,
                            "replies": [
                                {
                                    "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6nl95w",
                                    "parent_id": "t1_j6niu51",
                                    "score": 1,
                                    "created_utc": 1675182973.0,
                                    "replies": [
                                        {
                                            "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                                            "author": "Snoo_72748",
                                            "id": "j6no8md",
                                            "parent_id": "t1_j6nl95w",
                                            "score": 1,
                                            "created_utc": 1675184067.0,
                                            "replies": [
                                                {
                                                    "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                                    "author": "throwawaysugarbabe80",
                                                    "id": "j6npeu7",
                                                    "parent_id": "t1_j6no8md",
                                                    "score": 1,
                                                    "created_utc": 1675184490.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like you're the right person who came along at just the right time. May you have the happy marriage  that you're both looking for!\n\nIm fully accepting of the fact that mine wont leave his wife for me but we've been talking about how things would be for us long term and how I'll still be taken care of even after he's gone. We have an age gap of 30 years so I really dont think there's enough years in his lifetime for another marriage but we're happy just the way we are",
            "author": "iknowwhatiwantbroski",
            "id": "j6kqy4b",
            "parent_id": "t1_j6kp6k6",
            "score": 5,
            "created_utc": 1675125724.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j6offk4",
            "parent_id": "t1_j6odfjf",
            "score": 1,
            "created_utc": 1675194035.0,
            "replies": [
                {
                    "body": "Girl…. Did you like completely skip the title? I’m already married. The prenup was drafted and signed months ago.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6ogvkp",
                    "parent_id": "t1_j6offk4",
                    "score": 1,
                    "created_utc": 1675194572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's responding to me Snoo, my marriage wasn't an SR, he's just trying to be obnoxious and succeeding 😴\n\nNor is he an SD, he's a med student with nothing more important to do than stick his nose in where it's of no value 😏",
            "author": "Sunhillian",
            "id": "j6mf0ve",
            "parent_id": "t1_j6ma31a",
            "score": 3,
            "created_utc": 1675162023.0,
            "replies": [
                {
                    "body": "just pointing out that there are better ways to end a relationship before cheating",
                    "author": "epyon-",
                    "id": "j6nf34t",
                    "parent_id": "t1_j6mf0ve",
                    "score": -3,
                    "created_utc": 1675180643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ive read a lot of the opposite. many who dont want to deal with a potential pissed off wife. i guess to each their own …",
            "author": "epyon-",
            "id": "j6nf6k7",
            "parent_id": "t1_j6ma31a",
            "score": -2,
            "created_utc": 1675180679.0,
            "replies": [
                {
                    "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
                    "author": "Snoo71180",
                    "id": "j6o6lqs",
                    "parent_id": "t1_j6nf6k7",
                    "score": 1,
                    "created_utc": 1675190752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We met 4years ago. He filed for divorce 2 years ago, immediately proposed to me and we got married two months ago (officially but had our ceremony literally yesterday.)\n\nI don’t mind the questions at all, I haven’t been able to tell this stuff to anyone ever so it’s liberating in a way. \n\n> I presume no chance he’s reading this.\n\nI wouldn’t care if he was but he finds Reddit weird and thinks I spend too much time on it so I doubt he is lol.",
            "author": "throwawaysugarbabe80",
            "id": "j6kdx2j",
            "parent_id": "t1_j6kd991",
            "score": 13,
            "created_utc": 1675120209.0,
            "replies": [
                {
                    "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
                    "author": "geeky-sd",
                    "id": "j6ke4lb",
                    "parent_id": "t1_j6kdx2j",
                    "score": 3,
                    "created_utc": 1675120292.0,
                    "replies": [
                        {
                            "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6keu5e",
                            "parent_id": "t1_j6ke4lb",
                            "score": 16,
                            "created_utc": 1675120583.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I fully support people willing to consider themselves hypocritical. It promotes humility and self awareness and also helps her be aware and take caution when needed if her husband tries to do the same thing again.\n\nTrying to make mental gymnastics to justify one self when one is involved the very thing they would not allow happen to themself promotes complacency and is how you end up with that other girl the other day ratting out her ex's scheme to defraud SB's by selling their pics here on SLF.\n\nI mean, I'm not going to go out of my way and insult her for it, but if she's willing to acknowledge it herself there's no need for coddling either.",
            "author": "karmaextract",
            "id": "j6kmx1q",
            "parent_id": "t1_j6kcztu",
            "score": 4,
            "created_utc": 1675123967.0,
            "replies": [
                {
                    "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
                    "author": "throwawaysugarbabe80",
                    "id": "j6kpzzq",
                    "parent_id": "t1_j6kmx1q",
                    "score": 4,
                    "created_utc": 1675125308.0,
                    "replies": [
                        {
                            "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                            "author": "karmaextract",
                            "id": "j6ks569",
                            "parent_id": "t1_j6kpzzq",
                            "score": 2,
                            "created_utc": 1675126249.0,
                            "replies": []
                        },
                        {
                            "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                            "author": "geeky-sd",
                            "id": "j6l6cou",
                            "parent_id": "t1_j6kpzzq",
                            "score": 2,
                            "created_utc": 1675132569.0,
                            "replies": [
                                {
                                    "body": "Thank you for going through the trouble to find these back!",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6lz2gq",
                                    "parent_id": "t1_j6l6cou",
                                    "score": 1,
                                    "created_utc": 1675148679.0,
                                    "replies": [
                                        {
                                            "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                            "author": "geeky-sd",
                                            "id": "j6mgtqn",
                                            "parent_id": "t1_j6lz2gq",
                                            "score": 1,
                                            "created_utc": 1675163450.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly if you need to go through phones and such, you shouldn't be in the relationship at all. Obviously doing things like that may save a bit of grief, but the craziness you'll whip yourself into is NOT worth it. Trust, or don't trust, and let the chips fall where they may. Otherwise it's doomed from the start. (I'm saying this as a dude who got cheated on last year and thank my lucky stars I trusted her until I found out, since it saved me a lot of psychosis).",
            "author": "billbar",
            "id": "j6lcnty",
            "parent_id": "t1_j6kicb7",
            "score": 4,
            "created_utc": 1675135468.0,
            "replies": []
        },
        {
            "body": "That does help that he doesn't have many socials, and I think it's nice that you can go through his cell, even if you don't. And that's understandable, it's good that you're not feeling like you need to be on high alert. Honestly, I'm usually pretty trusting as well, but in this type of scenario, I seem not to be 😅 I'm glad things are working out well for you both!",
            "author": "di_caro2811",
            "id": "j6kn28q",
            "parent_id": "t1_j6kicb7",
            "score": 1,
            "created_utc": 1675124029.0,
            "replies": []
        },
        {
            "body": "That’s way more creative haha. Nice to see others who went legit!",
            "author": "throwawaysugarbabe80",
            "id": "j6mwpdi",
            "parent_id": "t1_j6mvv6c",
            "score": 2,
            "created_utc": 1675172994.0,
            "replies": []
        },
        {
            "body": "My husband exclusively prefers and only dates black women. His ex-wife is black. I didn’t need to teach him anything, thankfully!",
            "author": "throwawaysugarbabe80",
            "id": "j6rj213",
            "parent_id": "t1_j6pa1v5",
            "score": 2,
            "created_utc": 1675251410.0,
            "replies": []
        },
        {
            "body": "Yes! I’m the hot one. Respectfully lol",
            "author": "throwawaysugarbabe80",
            "id": "j6lxuvm",
            "parent_id": "t1_j6lhwx3",
            "score": 9,
            "created_utc": 1675147782.0,
            "replies": []
        },
        {
            "body": "I just read your post and I wish you lived near me! So many similarities down to building the multimillion dollars home! My life is so different now, as such a young age, it’s crazy. I sometimes can’t believe I got so lucky and I get to be so happy. My mom raised us all alone growing up and she had it tough and she often says she thinks God sent me my husband because she suffered enough.\n\nI wish you guys many many more years of happiness!",
            "author": "throwawaysugarbabe80",
            "id": "j6ngfa8",
            "parent_id": "t1_j6ndzmt",
            "score": 1,
            "created_utc": 1675181153.0,
            "replies": [
                {
                    "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
                    "author": "Snoo_72748",
                    "id": "j6niu51",
                    "parent_id": "t1_j6ngfa8",
                    "score": 1,
                    "created_utc": 1675182059.0,
                    "replies": [
                        {
                            "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6nl95w",
                            "parent_id": "t1_j6niu51",
                            "score": 1,
                            "created_utc": 1675182973.0,
                            "replies": [
                                {
                                    "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                                    "author": "Snoo_72748",
                                    "id": "j6no8md",
                                    "parent_id": "t1_j6nl95w",
                                    "score": 1,
                                    "created_utc": 1675184067.0,
                                    "replies": [
                                        {
                                            "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                            "author": "throwawaysugarbabe80",
                                            "id": "j6npeu7",
                                            "parent_id": "t1_j6no8md",
                                            "score": 1,
                                            "created_utc": 1675184490.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girl…. Did you like completely skip the title? I’m already married. The prenup was drafted and signed months ago.",
            "author": "throwawaysugarbabe80",
            "id": "j6ogvkp",
            "parent_id": "t1_j6offk4",
            "score": 1,
            "created_utc": 1675194572.0,
            "replies": []
        },
        {
            "body": "just pointing out that there are better ways to end a relationship before cheating",
            "author": "epyon-",
            "id": "j6nf34t",
            "parent_id": "t1_j6mf0ve",
            "score": -3,
            "created_utc": 1675180643.0,
            "replies": []
        },
        {
            "body": "Speaking from experience, and having some gals that were strictly friends who were SB's, sometimes the wives know and are doing their own thing as well, but a lot of times the SB is a side piece for a married guy intentionally as I said above.  I've also seen, multiple times, SB's blackmailing married guys using the threat of telling the wife.  Thank goodness I'm single but I'm not sure you've done this for long or really understand it.",
            "author": "Snoo71180",
            "id": "j6o6lqs",
            "parent_id": "t1_j6nf6k7",
            "score": 1,
            "created_utc": 1675190752.0,
            "replies": []
        },
        {
            "body": "What do you do with your time? Do you study? Work? Do you have a career? Once you have kids, are you planning to be a stay-at-home mom, or keep working?",
            "author": "geeky-sd",
            "id": "j6ke4lb",
            "parent_id": "t1_j6kdx2j",
            "score": 3,
            "created_utc": 1675120292.0,
            "replies": [
                {
                    "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6keu5e",
                    "parent_id": "t1_j6ke4lb",
                    "score": 16,
                    "created_utc": 1675120583.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see both of your point of views but I agree with yours. I drove the getaway so I was complicit in the robbery. It is what it is. I do not regret the choices I made but I fully recognise what I did was wrong and I wouldn’t want that to be done to me. I’m a hypocrite. \n\nGot a link to that thread?",
            "author": "throwawaysugarbabe80",
            "id": "j6kpzzq",
            "parent_id": "t1_j6kmx1q",
            "score": 4,
            "created_utc": 1675125308.0,
            "replies": [
                {
                    "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
                    "author": "karmaextract",
                    "id": "j6ks569",
                    "parent_id": "t1_j6kpzzq",
                    "score": 2,
                    "created_utc": 1675126249.0,
                    "replies": []
                },
                {
                    "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
                    "author": "geeky-sd",
                    "id": "j6l6cou",
                    "parent_id": "t1_j6kpzzq",
                    "score": 2,
                    "created_utc": 1675132569.0,
                    "replies": [
                        {
                            "body": "Thank you for going through the trouble to find these back!",
                            "author": "throwawaysugarbabe80",
                            "id": "j6lz2gq",
                            "parent_id": "t1_j6l6cou",
                            "score": 1,
                            "created_utc": 1675148679.0,
                            "replies": [
                                {
                                    "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                                    "author": "geeky-sd",
                                    "id": "j6mgtqn",
                                    "parent_id": "t1_j6lz2gq",
                                    "score": 1,
                                    "created_utc": 1675163450.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "May I ask where you guys are generally located? It would be fun to meet another couple like us! I completely understand what you mean. My husband is my rock especially right now with my father dying.\n\nEnjoy everyday you get together. I always knew life was short but now I understand just how short. Sorry I hope that’s not too depressing, I guess I’m just starting the grieving process.",
            "author": "Snoo_72748",
            "id": "j6niu51",
            "parent_id": "t1_j6ngfa8",
            "score": 1,
            "created_utc": 1675182059.0,
            "replies": [
                {
                    "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6nl95w",
                    "parent_id": "t1_j6niu51",
                    "score": 1,
                    "created_utc": 1675182973.0,
                    "replies": [
                        {
                            "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                            "author": "Snoo_72748",
                            "id": "j6no8md",
                            "parent_id": "t1_j6nl95w",
                            "score": 1,
                            "created_utc": 1675184067.0,
                            "replies": [
                                {
                                    "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                                    "author": "throwawaysugarbabe80",
                                    "id": "j6npeu7",
                                    "parent_id": "t1_j6no8md",
                                    "score": 1,
                                    "created_utc": 1675184490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m a computer science bachelors currently studying to get a civil engineering Masters. \nI hope to have a fulfilling career once I have my Masters but I’m in no rush to finish it. I kinda messed up during my last two years because I kept following him on business trips and as a result flunked a bunch of exams which delayed me finishing school so I’m keeping my ass home this time. \n\nAfter having kids the plan is for me to do whatever I want. If I want to stay-at-home; great. If I decide to go to work; great. But I do plan on working.",
            "author": "throwawaysugarbabe80",
            "id": "j6keu5e",
            "parent_id": "t1_j6ke4lb",
            "score": 16,
            "created_utc": 1675120583.0,
            "replies": []
        },
        {
            "body": "Should be within the past week. I read it and skimmed the comments and decided it wasn't even worth my time commenting so I don't have a link to it in my own history (I'd just be dogpiling with people saying how sus she knows so much about the SD she's exposing down to the 60/40% cut, sounds like someone who's only here exposing him after she got scammed out of her cut)\n\nI just spent more time than I'm willing trying to browse through SLF history and couldn't find it. If the OP didn't delete it I'm sure someone who commented on it can track it down for you.",
            "author": "karmaextract",
            "id": "j6ks569",
            "parent_id": "t1_j6kpzzq",
            "score": 2,
            "created_utc": 1675126249.0,
            "replies": []
        },
        {
            "body": "It was not very coherent. It was deleted from this subreddit but is still posted elsewhere.\n\n[Still posted here](https://www.reddit.com/r/SeekingArrangements/comments/10n6g2c/seeking_arrangements_warning/)\n\n[You can read the comments made but the post was deleted](https://www.reddit.com/r/sugarlifestyleforum/comments/10n67v1/seeking_arrangements_warning/)",
            "author": "geeky-sd",
            "id": "j6l6cou",
            "parent_id": "t1_j6kpzzq",
            "score": 2,
            "created_utc": 1675132569.0,
            "replies": [
                {
                    "body": "Thank you for going through the trouble to find these back!",
                    "author": "throwawaysugarbabe80",
                    "id": "j6lz2gq",
                    "parent_id": "t1_j6l6cou",
                    "score": 1,
                    "created_utc": 1675148679.0,
                    "replies": [
                        {
                            "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                            "author": "geeky-sd",
                            "id": "j6mgtqn",
                            "parent_id": "t1_j6lz2gq",
                            "score": 1,
                            "created_utc": 1675163450.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry about your dad, my sincerest condolences. \nWe’re in Western-Europe!",
            "author": "throwawaysugarbabe80",
            "id": "j6nl95w",
            "parent_id": "t1_j6niu51",
            "score": 1,
            "created_utc": 1675182973.0,
            "replies": [
                {
                    "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
                    "author": "Snoo_72748",
                    "id": "j6no8md",
                    "parent_id": "t1_j6nl95w",
                    "score": 1,
                    "created_utc": 1675184067.0,
                    "replies": [
                        {
                            "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                            "author": "throwawaysugarbabe80",
                            "id": "j6npeu7",
                            "parent_id": "t1_j6no8md",
                            "score": 1,
                            "created_utc": 1675184490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for going through the trouble to find these back!",
            "author": "throwawaysugarbabe80",
            "id": "j6lz2gq",
            "parent_id": "t1_j6l6cou",
            "score": 1,
            "created_utc": 1675148679.0,
            "replies": [
                {
                    "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
                    "author": "geeky-sd",
                    "id": "j6mgtqn",
                    "parent_id": "t1_j6lz2gq",
                    "score": 1,
                    "created_utc": 1675163450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you. My husband is from Norway so we are planning a trip to that side of the Europe this year. It’s so nice to hear a similar story! Would you be interested in dm?",
            "author": "Snoo_72748",
            "id": "j6no8md",
            "parent_id": "t1_j6nl95w",
            "score": 1,
            "created_utc": 1675184067.0,
            "replies": [
                {
                    "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
                    "author": "throwawaysugarbabe80",
                    "id": "j6npeu7",
                    "parent_id": "t1_j6no8md",
                    "score": 1,
                    "created_utc": 1675184490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so fascinated by your answers here that I felt it's the least I can do.",
            "author": "geeky-sd",
            "id": "j6mgtqn",
            "parent_id": "t1_j6lz2gq",
            "score": 1,
            "created_utc": 1675163450.0,
            "replies": []
        },
        {
            "body": "Yes! This is super exciting haha. I’d be more than happy to DM.",
            "author": "throwawaysugarbabe80",
            "id": "j6npeu7",
            "parent_id": "t1_j6no8md",
            "score": 1,
            "created_utc": 1675184490.0,
            "replies": []
        }
    ]
}