{
    "title": "I was bored ya know",
    "post_id": "gx171e",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gx171e/i_was_bored_ya_know/",
    "author": "Agent_3w",
    "body": "So another week of massive sorting through the online only and scammers messages and it's late at night and I decide to entertain two of the messages at the same time... Half hoping one may actually be legitimate but also knowing this is gonna be a joke and of course it was but I figured it'll be fun to see what tactics they will use. The first one claimed she's out of country with family due to covid but will be returning for school in August and was probably convinced she had me when we exchanged snapchats in which i ask for a selfie with a 😊👍 and of course she sends nudes upon nudes to distract from the truth but the non nude thumbs up photo I ask for doesn't come and after a couple hrs 😆 finally gets frustrated and claims I'm wasting their time and probably stealing the pics in which I respond snap obviously shows no screenshots or saving happened. Still can't believe I was able to string em along for that long.\nBuuuut the second one takes the cake... We move the chat to Kik in which I again ask for the quick non nude 😊👍 pic and they send several other photos whilst also saying they can't do a thumbs up 😆 eventually what's pictured below happens... \n\n (http://imgur.com/a/gTQ1NwJ)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gx171e/i_was_bored_ya_know/",
    "score": 101,
    "upvote_ratio": 0.92,
    "created_utc": 1591348498.0,
    "num_comments": 57,
    "links": [
        [
            "http://imgur.com/a/gTQ1NwJ"
        ]
    ],
    "comments": [
        {
            "body": "Like... DO Y’ALL SEE THE THUMBS UP PHOTO",
            "author": "AfroBabySugg",
            "id": "fsyfxg0",
            "parent_id": "t3_gx171e",
            "score": 94,
            "created_utc": 1591349268.0,
            "replies": [
                {
                    "body": "I mean I guess technically they gave me one 🤣🤣",
                    "author": "Agent_3w",
                    "id": "fsyfz6c",
                    "parent_id": "t1_fsyfxg0",
                    "score": 27,
                    "created_utc": 1591349316.0,
                    "replies": []
                },
                {
                    "body": "That’s hysterical that same girl has been running a fake pic scam in VB, those pics actually belong to an internet adult model lmao",
                    "author": "T3301975",
                    "id": "ft19rrh",
                    "parent_id": "t1_fsyfxg0",
                    "score": 2,
                    "created_utc": 1591404018.0,
                    "replies": [
                        {
                            "body": "Interesting... What's VB?",
                            "author": "Agent_3w",
                            "id": "ft3so2t",
                            "parent_id": "t1_ft19rrh",
                            "score": 1,
                            "created_utc": 1591442797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This can’t be real😭",
            "author": null,
            "id": "fsyfngj",
            "parent_id": "t3_gx171e",
            "score": 32,
            "created_utc": 1591349000.0,
            "replies": [
                {
                    "body": "The snap convo was even more hilarious tbh",
                    "author": "Agent_3w",
                    "id": "fsyfs2i",
                    "parent_id": "t1_fsyfngj",
                    "score": 11,
                    "created_utc": 1591349123.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I cackled, only specific kinds of men talk like that 😂 he didn’t even try with the thumbs up😭😭😂",
            "author": "AfroBabySugg",
            "id": "fsyfwrc",
            "parent_id": "t3_gx171e",
            "score": 20,
            "created_utc": 1591349248.0,
            "replies": []
        },
        {
            "body": "A for effort for her. Photoshop skills need some work though.",
            "author": "ograx",
            "id": "fsyqmva",
            "parent_id": "t3_gx171e",
            "score": 19,
            "created_utc": 1591358718.0,
            "replies": [
                {
                    "body": "Yep business must be slow... They stuck with me for a better part of a few hrs grinding it out. My jaw dropped when I saw the pic the first time tho 🤣",
                    "author": "Agent_3w",
                    "id": "fsyqw0z",
                    "parent_id": "t1_fsyqmva",
                    "score": 12,
                    "created_utc": 1591358909.0,
                    "replies": [
                        {
                            "body": "I’m in a decent sized Canadian city and I’ve never had a scammer who has my home city as profile city message me ever. Lucky there cause I hate wasting time.",
                            "author": "ograx",
                            "id": "fsyr5d0",
                            "parent_id": "t1_fsyqw0z",
                            "score": 5,
                            "created_utc": 1591359100.0,
                            "replies": [
                                {
                                    "body": "Very fortunate my guy. I live near two of the largest cities in the US and I get several a day. The scammers are usually easy to brush off cuz there are so many red flags via a quick profile glance alone (little to no description/just joined etc..) it's the online only profiles that suck the life outta you.. start with standard greetings and replies that may take hours if not days  and then she finally hits you with the Im not comfortable meeting yet but I'm open to an online arrangement 😭",
                                    "author": "Agent_3w",
                                    "id": "fsyshs6",
                                    "parent_id": "t1_fsyr5d0",
                                    "score": 2,
                                    "created_utc": 1591360066.0,
                                    "replies": [
                                        {
                                            "body": "Most girls here have Facebook or IG verified on their profiles so I’m not sure how easy that is to fake or if scammers go to those lengths. I live in a university town with huge amount of students.",
                                            "author": "ograx",
                                            "id": "fsyswv5",
                                            "parent_id": "t1_fsyshs6",
                                            "score": 1,
                                            "created_utc": 1591360356.0,
                                            "replies": [
                                                {
                                                    "body": "That used to be an easy way to filter them out but turns out it's very easy to create and link a fake IG or FB acct 😵\nIt is what it is... SA is still the only reliable source for this lifestyle. I've actually been contacted recently by an SA reps regarding said accounts 😅 ... Maybe something is actually being done",
                                                    "author": "Agent_3w",
                                                    "id": "fsyv7ds",
                                                    "parent_id": "t1_fsyswv5",
                                                    "score": 2,
                                                    "created_utc": 1591361858.0,
                                                    "replies": [
                                                        {
                                                            "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
                                                            "author": "ograx",
                                                            "id": "fsyvgtc",
                                                            "parent_id": "t1_fsyv7ds",
                                                            "score": 1,
                                                            "created_utc": 1591362022.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                                                                    "author": "Agent_3w",
                                                                    "id": "fsyvye3",
                                                                    "parent_id": "t1_fsyvgtc",
                                                                    "score": 1,
                                                                    "created_utc": 1591362326.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                                                                            "author": "ograx",
                                                                            "id": "fsyww4u",
                                                                            "parent_id": "t1_fsyvye3",
                                                                            "score": 0,
                                                                            "created_utc": 1591362893.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "How do you not get banned for leaving that in your profile?",
                                                                    "author": "LiliaTheSuccubus",
                                                                    "id": "fsz676s",
                                                                    "parent_id": "t1_fsyvgtc",
                                                                    "score": 1,
                                                                    "created_utc": 1591368014.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Why would I? Could mean anything",
                                                                            "author": "ograx",
                                                                            "id": "fszbh6h",
                                                                            "parent_id": "t1_fsz676s",
                                                                            "score": 1,
                                                                            "created_utc": 1591370643.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                                                                    "author": "LiliaTheSuccubus",
                                                                                    "id": "fszghcm",
                                                                                    "parent_id": "t1_fszbh6h",
                                                                                    "score": 1,
                                                                                    "created_utc": 1591373057.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I second this. I live in a mid-size Canadian city as well. There are certainly some unsavoury characters to filter through but I don’t receive hardly any scammer messages. 🤷‍♀️ I think it’s a benefit of living in a lesser known city.",
                                    "author": "alpha_delta_echo_",
                                    "id": "fsyufch",
                                    "parent_id": "t1_fsyr5d0",
                                    "score": 0,
                                    "created_utc": 1591361358.0,
                                    "replies": [
                                        {
                                            "body": "Yes very fortunate... Im pretty sure the majority of scamming is done in the larger well know cities. Most scammers don't actually live in that actually city of course but will change location to cities they know have large populations which in turn have more \"targets\"",
                                            "author": "Agent_3w",
                                            "id": "fsyx22n",
                                            "parent_id": "t1_fsyufch",
                                            "score": 2,
                                            "created_utc": 1591362992.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yessss! Wasting their time is key. If many of us did that as an approach to any scammer, then they’ll be so pissed. Waste the time of time wasters. 🤣🤣🤣",
            "author": "BeautyGr8ce",
            "id": "fsyh281",
            "parent_id": "t3_gx171e",
            "score": 20,
            "created_utc": 1591350376.0,
            "replies": [
                {
                    "body": "Unfortunately I just don't have the time and usually just block them as soon as I see the familiar phrases but in this one instance I was just stressed and couldn't sleep 😅 but again they certainly should all be reported on both sides of course... Even if it makes alil dent in the roster that's better than nothing",
                    "author": "Agent_3w",
                    "id": "fsyhd3e",
                    "parent_id": "t1_fsyh281",
                    "score": 8,
                    "created_utc": 1591350673.0,
                    "replies": []
                },
                {
                    "body": "\"Wasting their time is the key.\"  <--- It's called \"resource burning\" in the computer science research community. It's a legitimate defense strategy used in distributed computing to secure computer networks against all kinds of spammers and other attackers.",
                    "author": "ugly_and_fat",
                    "id": "ft14jhw",
                    "parent_id": "t1_fsyh281",
                    "score": 3,
                    "created_utc": 1591401774.0,
                    "replies": [
                        {
                            "body": "Neat! Power to the techies",
                            "author": "BeautyGr8ce",
                            "id": "ft16dfq",
                            "parent_id": "t1_ft14jhw",
                            "score": 4,
                            "created_utc": 1591402551.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There was one time where I sent a selfie holding a piece of paper with a POT's name written on it. We were going to do a M&G, but he looked nothing like his photos when I saw him drive up to the cafe, so I hid in the bathroom & had to ask to leave through the back door 😖 He ended up blackmailing me with that photo, saying that he'd tell everyone I knew about my sugar lifestyle. I mean he didn't in the end, but it was still scary!!\n\nNow I only do video calls on WhatsApp (they don't let you screen record).",
            "author": "discorsion",
            "id": "ft0eu7m",
            "parent_id": "t3_gx171e",
            "score": 4,
            "created_utc": 1591389525.0,
            "replies": [
                {
                    "body": "Damn something similar happened to me as well on my very first m&g I was nervous and got to location much earlier and waited in my car with a view of the only entrance/exit of the cafe... I finally see someone kinda matching the description and wearing what they texted they would and at first I'm in denial 🤣 but then I texted an almost there message and they confirmed they've arrived ... I take off the jacket I described myself to be wearing and put a hat and glasses on 😆 and walked in thinking maybe its better up close... nope 😵 ... Bought myself a drink and walked out and minutes later texted \"sorry my wife found out 🤦‍♂️can't make it\" she called me out on my lie in which I responded with the truth and then she threatened to report me and blacklist my username to all SB only sites and boards and then even harassed and spammed my number (fortunately it was a burner)\n\nSooo since then after greetings and some rapport building  I'd quickly set up a m&g and a short vid chat prior to confirm no catfishing and if they're serious that really should simple and quick and 'misunderstandings' are avoided",
                    "author": "Agent_3w",
                    "id": "ft0hn92",
                    "parent_id": "t1_ft0eu7m",
                    "score": 5,
                    "created_utc": 1591390923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love finding profiles that use pictures from known Instagram models",
            "author": "KnocDown",
            "id": "fsz6z6o",
            "parent_id": "t3_gx171e",
            "score": 5,
            "created_utc": 1591368401.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsz7rgc",
            "parent_id": "t3_gx171e",
            "score": 4,
            "created_utc": 1591368800.0,
            "replies": [
                {
                    "body": "I was thinking the same as it was happening 😂😅",
                    "author": "Agent_3w",
                    "id": "fsz7zgu",
                    "parent_id": "t1_fsz7rgc",
                    "score": 3,
                    "created_utc": 1591368912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s freaking hilarious. Thanks for the good laugh \n\nI just feel bad for the girl who’s pictures got stolen",
            "author": "wndrlnds",
            "id": "fsz9x11",
            "parent_id": "t3_gx171e",
            "score": 4,
            "created_utc": 1591369878.0,
            "replies": [
                {
                    "body": "Eh its a pornstar🤷‍♀️",
                    "author": "iHaveAOriginalName",
                    "id": "ftfzncp",
                    "parent_id": "t1_fsz9x11",
                    "score": 2,
                    "created_utc": 1591676088.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Should have asked for a feet photo.",
            "author": "eurosd",
            "id": "fsyfq0w",
            "parent_id": "t3_gx171e",
            "score": 5,
            "created_utc": 1591349069.0,
            "replies": [
                {
                    "body": "Would've been interesting how they would have tried to Photoshop that in 🤣🤣",
                    "author": "Agent_3w",
                    "id": "fsyfw7p",
                    "parent_id": "t1_fsyfq0w",
                    "score": 7,
                    "created_utc": 1591349235.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. I'm.... speechless.....",
            "author": "PombaGira1",
            "id": "fsyx4ck",
            "parent_id": "t3_gx171e",
            "score": 3,
            "created_utc": 1591363029.0,
            "replies": [
                {
                    "body": "They definitely got a lil lazy... Maybe I wore em out too much 😅 ... I wish I had screenshots of the Snapchat convo cuz it was just as ridiculous 🤣",
                    "author": "Agent_3w",
                    "id": "fsyxw6d",
                    "parent_id": "t1_fsyx4ck",
                    "score": 1,
                    "created_utc": 1591363484.0,
                    "replies": [
                        {
                            "body": "I work in multi-media, so to see a photoshop job this bad offends me.",
                            "author": "PombaGira1",
                            "id": "fsyzbzd",
                            "parent_id": "t1_fsyxw6d",
                            "score": 2,
                            "created_utc": 1591364323.0,
                            "replies": [
                                {
                                    "body": "Tbh I was getting a bit sleepy and my first reaction was my tired eyes are deceiving me 🤣🤣",
                                    "author": "Agent_3w",
                                    "id": "fsyzw69",
                                    "parent_id": "t1_fsyzbzd",
                                    "score": 1,
                                    "created_utc": 1591364644.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao. I’ve always thought about doing this!",
            "author": null,
            "id": "fsz8gu6",
            "parent_id": "t3_gx171e",
            "score": 3,
            "created_utc": 1591369158.0,
            "replies": [
                {
                    "body": "It was so ridiculous and hilarious and tbh the whole time I was wondering how gullible some ppl must be to really believe it.  It actually became exhausting pretending to be so naive for so long",
                    "author": "Agent_3w",
                    "id": "fsz9oah",
                    "parent_id": "t1_fsz8gu6",
                    "score": 1,
                    "created_utc": 1591369761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "IM DEEE3333333EE3EEEEEED",
            "author": "atypicalsb",
            "id": "fszeaql",
            "parent_id": "t3_gx171e",
            "score": 3,
            "created_utc": 1591372011.0,
            "replies": []
        },
        {
            "body": "That was fucking hilarious",
            "author": "Newlifemn",
            "id": "fszozlp",
            "parent_id": "t3_gx171e",
            "score": 3,
            "created_utc": 1591377117.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ft0xtvg",
            "parent_id": "t3_gx171e",
            "score": 3,
            "created_utc": 1591398734.0,
            "replies": [
                {
                    "body": "I should've kept on and asked for feet pics and enjoyed all the entertainment that would have brought along 🤣🤣",
                    "author": "Agent_3w",
                    "id": "ft1301e",
                    "parent_id": "t1_ft0xtvg",
                    "score": 2,
                    "created_utc": 1591401064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OMG I died",
            "author": "sugarprincessp",
            "id": "fsyyoqm",
            "parent_id": "t3_gx171e",
            "score": 2,
            "created_utc": 1591363946.0,
            "replies": [
                {
                    "body": "🤣🤣",
                    "author": "Agent_3w",
                    "id": "fsyzn84",
                    "parent_id": "t1_fsyyoqm",
                    "score": 1,
                    "created_utc": 1591364502.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Priceless.",
            "author": "craa141",
            "id": "fsyzwz5",
            "parent_id": "t3_gx171e",
            "score": 2,
            "created_utc": 1591364657.0,
            "replies": [
                {
                    "body": "Monthly SA premium subscription $89.95 , avg monthly allowance in my area $xxxx , forcing a scammer into a rushed Photoshop pic ... Priceless",
                    "author": "Agent_3w",
                    "id": "fsz1msw",
                    "parent_id": "t1_fsyzwz5",
                    "score": 5,
                    "created_utc": 1591365602.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "👍",
            "author": "LucidDion",
            "id": "fsyzzqn",
            "parent_id": "t3_gx171e",
            "score": 2,
            "created_utc": 1591364700.0,
            "replies": []
        },
        {
            "body": "Oh my god. 😂",
            "author": "princessregime",
            "id": "fsyfxl8",
            "parent_id": "t3_gx171e",
            "score": 2,
            "created_utc": 1591349271.0,
            "replies": [
                {
                    "body": "If anything comes out of this I'm hoping it at least puts a smile on some faces that see this 😊",
                    "author": "Agent_3w",
                    "id": "fsygbf5",
                    "parent_id": "t1_fsyfxl8",
                    "score": 7,
                    "created_utc": 1591349648.0,
                    "replies": [
                        {
                            "body": "It did! Thanks, I needed it!",
                            "author": "princessregime",
                            "id": "fsyjgrr",
                            "parent_id": "t1_fsygbf5",
                            "score": 1,
                            "created_utc": 1591352685.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a guy refusing to send verification photos now calling me a whore because I won't talk to him.",
            "author": "drunky_crowette",
            "id": "ft1hnkk",
            "parent_id": "t3_gx171e",
            "score": 1,
            "created_utc": 1591407468.0,
            "replies": [
                {
                    "body": "Ahhh scammer tactic #21 the old piss her off by calling her degrading name's and make her believe she's in the wrong so she responds back 🤣🤣",
                    "author": "Agent_3w",
                    "id": "ft1ie7a",
                    "parent_id": "t1_ft1hnkk",
                    "score": 1,
                    "created_utc": 1591407791.0,
                    "replies": [
                        {
                            "body": "Unfortunately they got the order wrong.\n\nIt's wooing, flirting, **then** degradation and begging. Haven't even brought up my safe word yet!",
                            "author": "drunky_crowette",
                            "id": "ft1jsmo",
                            "parent_id": "t1_ft1ie7a",
                            "score": 3,
                            "created_utc": 1591408415.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seems legit /s 😂",
            "author": "DramaticStruggle0",
            "id": "fsyo5fb",
            "parent_id": "t3_gx171e",
            "score": 1,
            "created_utc": 1591356788.0,
            "replies": []
        },
        {
            "body": "This made my day 😂😂",
            "author": "alpha_delta_echo_",
            "id": "fsyujas",
            "parent_id": "t3_gx171e",
            "score": 1,
            "created_utc": 1591361427.0,
            "replies": [
                {
                    "body": "Ayye I'm happy it did 😊 . This comment made my day 😆",
                    "author": "Agent_3w",
                    "id": "fsz3zxs",
                    "parent_id": "t1_fsyujas",
                    "score": 1,
                    "created_utc": 1591366860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On a side note: for the first time in my (almost full) lifetime of wearing glasses I got round frames similar to yours. You look so good with them. I aspire to look as good as you with mine!",
            "author": "justjokingya",
            "id": "fsz7apn",
            "parent_id": "t3_gx171e",
            "score": 0,
            "created_utc": 1591368565.0,
            "replies": []
        },
        {
            "body": "I mean I guess technically they gave me one 🤣🤣",
            "author": "Agent_3w",
            "id": "fsyfz6c",
            "parent_id": "t1_fsyfxg0",
            "score": 27,
            "created_utc": 1591349316.0,
            "replies": []
        },
        {
            "body": "That’s hysterical that same girl has been running a fake pic scam in VB, those pics actually belong to an internet adult model lmao",
            "author": "T3301975",
            "id": "ft19rrh",
            "parent_id": "t1_fsyfxg0",
            "score": 2,
            "created_utc": 1591404018.0,
            "replies": [
                {
                    "body": "Interesting... What's VB?",
                    "author": "Agent_3w",
                    "id": "ft3so2t",
                    "parent_id": "t1_ft19rrh",
                    "score": 1,
                    "created_utc": 1591442797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The snap convo was even more hilarious tbh",
            "author": "Agent_3w",
            "id": "fsyfs2i",
            "parent_id": "t1_fsyfngj",
            "score": 11,
            "created_utc": 1591349123.0,
            "replies": []
        },
        {
            "body": "Yep business must be slow... They stuck with me for a better part of a few hrs grinding it out. My jaw dropped when I saw the pic the first time tho 🤣",
            "author": "Agent_3w",
            "id": "fsyqw0z",
            "parent_id": "t1_fsyqmva",
            "score": 12,
            "created_utc": 1591358909.0,
            "replies": [
                {
                    "body": "I’m in a decent sized Canadian city and I’ve never had a scammer who has my home city as profile city message me ever. Lucky there cause I hate wasting time.",
                    "author": "ograx",
                    "id": "fsyr5d0",
                    "parent_id": "t1_fsyqw0z",
                    "score": 5,
                    "created_utc": 1591359100.0,
                    "replies": [
                        {
                            "body": "Very fortunate my guy. I live near two of the largest cities in the US and I get several a day. The scammers are usually easy to brush off cuz there are so many red flags via a quick profile glance alone (little to no description/just joined etc..) it's the online only profiles that suck the life outta you.. start with standard greetings and replies that may take hours if not days  and then she finally hits you with the Im not comfortable meeting yet but I'm open to an online arrangement 😭",
                            "author": "Agent_3w",
                            "id": "fsyshs6",
                            "parent_id": "t1_fsyr5d0",
                            "score": 2,
                            "created_utc": 1591360066.0,
                            "replies": [
                                {
                                    "body": "Most girls here have Facebook or IG verified on their profiles so I’m not sure how easy that is to fake or if scammers go to those lengths. I live in a university town with huge amount of students.",
                                    "author": "ograx",
                                    "id": "fsyswv5",
                                    "parent_id": "t1_fsyshs6",
                                    "score": 1,
                                    "created_utc": 1591360356.0,
                                    "replies": [
                                        {
                                            "body": "That used to be an easy way to filter them out but turns out it's very easy to create and link a fake IG or FB acct 😵\nIt is what it is... SA is still the only reliable source for this lifestyle. I've actually been contacted recently by an SA reps regarding said accounts 😅 ... Maybe something is actually being done",
                                            "author": "Agent_3w",
                                            "id": "fsyv7ds",
                                            "parent_id": "t1_fsyswv5",
                                            "score": 2,
                                            "created_utc": 1591361858.0,
                                            "replies": [
                                                {
                                                    "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
                                                    "author": "ograx",
                                                    "id": "fsyvgtc",
                                                    "parent_id": "t1_fsyv7ds",
                                                    "score": 1,
                                                    "created_utc": 1591362022.0,
                                                    "replies": [
                                                        {
                                                            "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                                                            "author": "Agent_3w",
                                                            "id": "fsyvye3",
                                                            "parent_id": "t1_fsyvgtc",
                                                            "score": 1,
                                                            "created_utc": 1591362326.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                                                                    "author": "ograx",
                                                                    "id": "fsyww4u",
                                                                    "parent_id": "t1_fsyvye3",
                                                                    "score": 0,
                                                                    "created_utc": 1591362893.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "How do you not get banned for leaving that in your profile?",
                                                            "author": "LiliaTheSuccubus",
                                                            "id": "fsz676s",
                                                            "parent_id": "t1_fsyvgtc",
                                                            "score": 1,
                                                            "created_utc": 1591368014.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Why would I? Could mean anything",
                                                                    "author": "ograx",
                                                                    "id": "fszbh6h",
                                                                    "parent_id": "t1_fsz676s",
                                                                    "score": 1,
                                                                    "created_utc": 1591370643.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                                                            "author": "LiliaTheSuccubus",
                                                                            "id": "fszghcm",
                                                                            "parent_id": "t1_fszbh6h",
                                                                            "score": 1,
                                                                            "created_utc": 1591373057.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I second this. I live in a mid-size Canadian city as well. There are certainly some unsavoury characters to filter through but I don’t receive hardly any scammer messages. 🤷‍♀️ I think it’s a benefit of living in a lesser known city.",
                            "author": "alpha_delta_echo_",
                            "id": "fsyufch",
                            "parent_id": "t1_fsyr5d0",
                            "score": 0,
                            "created_utc": 1591361358.0,
                            "replies": [
                                {
                                    "body": "Yes very fortunate... Im pretty sure the majority of scamming is done in the larger well know cities. Most scammers don't actually live in that actually city of course but will change location to cities they know have large populations which in turn have more \"targets\"",
                                    "author": "Agent_3w",
                                    "id": "fsyx22n",
                                    "parent_id": "t1_fsyufch",
                                    "score": 2,
                                    "created_utc": 1591362992.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unfortunately I just don't have the time and usually just block them as soon as I see the familiar phrases but in this one instance I was just stressed and couldn't sleep 😅 but again they certainly should all be reported on both sides of course... Even if it makes alil dent in the roster that's better than nothing",
            "author": "Agent_3w",
            "id": "fsyhd3e",
            "parent_id": "t1_fsyh281",
            "score": 8,
            "created_utc": 1591350673.0,
            "replies": []
        },
        {
            "body": "\"Wasting their time is the key.\"  <--- It's called \"resource burning\" in the computer science research community. It's a legitimate defense strategy used in distributed computing to secure computer networks against all kinds of spammers and other attackers.",
            "author": "ugly_and_fat",
            "id": "ft14jhw",
            "parent_id": "t1_fsyh281",
            "score": 3,
            "created_utc": 1591401774.0,
            "replies": [
                {
                    "body": "Neat! Power to the techies",
                    "author": "BeautyGr8ce",
                    "id": "ft16dfq",
                    "parent_id": "t1_ft14jhw",
                    "score": 4,
                    "created_utc": 1591402551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn something similar happened to me as well on my very first m&g I was nervous and got to location much earlier and waited in my car with a view of the only entrance/exit of the cafe... I finally see someone kinda matching the description and wearing what they texted they would and at first I'm in denial 🤣 but then I texted an almost there message and they confirmed they've arrived ... I take off the jacket I described myself to be wearing and put a hat and glasses on 😆 and walked in thinking maybe its better up close... nope 😵 ... Bought myself a drink and walked out and minutes later texted \"sorry my wife found out 🤦‍♂️can't make it\" she called me out on my lie in which I responded with the truth and then she threatened to report me and blacklist my username to all SB only sites and boards and then even harassed and spammed my number (fortunately it was a burner)\n\nSooo since then after greetings and some rapport building  I'd quickly set up a m&g and a short vid chat prior to confirm no catfishing and if they're serious that really should simple and quick and 'misunderstandings' are avoided",
            "author": "Agent_3w",
            "id": "ft0hn92",
            "parent_id": "t1_ft0eu7m",
            "score": 5,
            "created_utc": 1591390923.0,
            "replies": []
        },
        {
            "body": "I was thinking the same as it was happening 😂😅",
            "author": "Agent_3w",
            "id": "fsz7zgu",
            "parent_id": "t1_fsz7rgc",
            "score": 3,
            "created_utc": 1591368912.0,
            "replies": []
        },
        {
            "body": "Eh its a pornstar🤷‍♀️",
            "author": "iHaveAOriginalName",
            "id": "ftfzncp",
            "parent_id": "t1_fsz9x11",
            "score": 2,
            "created_utc": 1591676088.0,
            "replies": []
        },
        {
            "body": "Would've been interesting how they would have tried to Photoshop that in 🤣🤣",
            "author": "Agent_3w",
            "id": "fsyfw7p",
            "parent_id": "t1_fsyfq0w",
            "score": 7,
            "created_utc": 1591349235.0,
            "replies": []
        },
        {
            "body": "They definitely got a lil lazy... Maybe I wore em out too much 😅 ... I wish I had screenshots of the Snapchat convo cuz it was just as ridiculous 🤣",
            "author": "Agent_3w",
            "id": "fsyxw6d",
            "parent_id": "t1_fsyx4ck",
            "score": 1,
            "created_utc": 1591363484.0,
            "replies": [
                {
                    "body": "I work in multi-media, so to see a photoshop job this bad offends me.",
                    "author": "PombaGira1",
                    "id": "fsyzbzd",
                    "parent_id": "t1_fsyxw6d",
                    "score": 2,
                    "created_utc": 1591364323.0,
                    "replies": [
                        {
                            "body": "Tbh I was getting a bit sleepy and my first reaction was my tired eyes are deceiving me 🤣🤣",
                            "author": "Agent_3w",
                            "id": "fsyzw69",
                            "parent_id": "t1_fsyzbzd",
                            "score": 1,
                            "created_utc": 1591364644.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was so ridiculous and hilarious and tbh the whole time I was wondering how gullible some ppl must be to really believe it.  It actually became exhausting pretending to be so naive for so long",
            "author": "Agent_3w",
            "id": "fsz9oah",
            "parent_id": "t1_fsz8gu6",
            "score": 1,
            "created_utc": 1591369761.0,
            "replies": []
        },
        {
            "body": "I should've kept on and asked for feet pics and enjoyed all the entertainment that would have brought along 🤣🤣",
            "author": "Agent_3w",
            "id": "ft1301e",
            "parent_id": "t1_ft0xtvg",
            "score": 2,
            "created_utc": 1591401064.0,
            "replies": []
        },
        {
            "body": "🤣🤣",
            "author": "Agent_3w",
            "id": "fsyzn84",
            "parent_id": "t1_fsyyoqm",
            "score": 1,
            "created_utc": 1591364502.0,
            "replies": []
        },
        {
            "body": "Monthly SA premium subscription $89.95 , avg monthly allowance in my area $xxxx , forcing a scammer into a rushed Photoshop pic ... Priceless",
            "author": "Agent_3w",
            "id": "fsz1msw",
            "parent_id": "t1_fsyzwz5",
            "score": 5,
            "created_utc": 1591365602.0,
            "replies": []
        },
        {
            "body": "If anything comes out of this I'm hoping it at least puts a smile on some faces that see this 😊",
            "author": "Agent_3w",
            "id": "fsygbf5",
            "parent_id": "t1_fsyfxl8",
            "score": 7,
            "created_utc": 1591349648.0,
            "replies": [
                {
                    "body": "It did! Thanks, I needed it!",
                    "author": "princessregime",
                    "id": "fsyjgrr",
                    "parent_id": "t1_fsygbf5",
                    "score": 1,
                    "created_utc": 1591352685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahhh scammer tactic #21 the old piss her off by calling her degrading name's and make her believe she's in the wrong so she responds back 🤣🤣",
            "author": "Agent_3w",
            "id": "ft1ie7a",
            "parent_id": "t1_ft1hnkk",
            "score": 1,
            "created_utc": 1591407791.0,
            "replies": [
                {
                    "body": "Unfortunately they got the order wrong.\n\nIt's wooing, flirting, **then** degradation and begging. Haven't even brought up my safe word yet!",
                    "author": "drunky_crowette",
                    "id": "ft1jsmo",
                    "parent_id": "t1_ft1ie7a",
                    "score": 3,
                    "created_utc": 1591408415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ayye I'm happy it did 😊 . This comment made my day 😆",
            "author": "Agent_3w",
            "id": "fsz3zxs",
            "parent_id": "t1_fsyujas",
            "score": 1,
            "created_utc": 1591366860.0,
            "replies": []
        },
        {
            "body": "Interesting... What's VB?",
            "author": "Agent_3w",
            "id": "ft3so2t",
            "parent_id": "t1_ft19rrh",
            "score": 1,
            "created_utc": 1591442797.0,
            "replies": []
        },
        {
            "body": "I’m in a decent sized Canadian city and I’ve never had a scammer who has my home city as profile city message me ever. Lucky there cause I hate wasting time.",
            "author": "ograx",
            "id": "fsyr5d0",
            "parent_id": "t1_fsyqw0z",
            "score": 5,
            "created_utc": 1591359100.0,
            "replies": [
                {
                    "body": "Very fortunate my guy. I live near two of the largest cities in the US and I get several a day. The scammers are usually easy to brush off cuz there are so many red flags via a quick profile glance alone (little to no description/just joined etc..) it's the online only profiles that suck the life outta you.. start with standard greetings and replies that may take hours if not days  and then she finally hits you with the Im not comfortable meeting yet but I'm open to an online arrangement 😭",
                    "author": "Agent_3w",
                    "id": "fsyshs6",
                    "parent_id": "t1_fsyr5d0",
                    "score": 2,
                    "created_utc": 1591360066.0,
                    "replies": [
                        {
                            "body": "Most girls here have Facebook or IG verified on their profiles so I’m not sure how easy that is to fake or if scammers go to those lengths. I live in a university town with huge amount of students.",
                            "author": "ograx",
                            "id": "fsyswv5",
                            "parent_id": "t1_fsyshs6",
                            "score": 1,
                            "created_utc": 1591360356.0,
                            "replies": [
                                {
                                    "body": "That used to be an easy way to filter them out but turns out it's very easy to create and link a fake IG or FB acct 😵\nIt is what it is... SA is still the only reliable source for this lifestyle. I've actually been contacted recently by an SA reps regarding said accounts 😅 ... Maybe something is actually being done",
                                    "author": "Agent_3w",
                                    "id": "fsyv7ds",
                                    "parent_id": "t1_fsyswv5",
                                    "score": 2,
                                    "created_utc": 1591361858.0,
                                    "replies": [
                                        {
                                            "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
                                            "author": "ograx",
                                            "id": "fsyvgtc",
                                            "parent_id": "t1_fsyv7ds",
                                            "score": 1,
                                            "created_utc": 1591362022.0,
                                            "replies": [
                                                {
                                                    "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                                                    "author": "Agent_3w",
                                                    "id": "fsyvye3",
                                                    "parent_id": "t1_fsyvgtc",
                                                    "score": 1,
                                                    "created_utc": 1591362326.0,
                                                    "replies": [
                                                        {
                                                            "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                                                            "author": "ograx",
                                                            "id": "fsyww4u",
                                                            "parent_id": "t1_fsyvye3",
                                                            "score": 0,
                                                            "created_utc": 1591362893.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "How do you not get banned for leaving that in your profile?",
                                                    "author": "LiliaTheSuccubus",
                                                    "id": "fsz676s",
                                                    "parent_id": "t1_fsyvgtc",
                                                    "score": 1,
                                                    "created_utc": 1591368014.0,
                                                    "replies": [
                                                        {
                                                            "body": "Why would I? Could mean anything",
                                                            "author": "ograx",
                                                            "id": "fszbh6h",
                                                            "parent_id": "t1_fsz676s",
                                                            "score": 1,
                                                            "created_utc": 1591370643.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                                                    "author": "LiliaTheSuccubus",
                                                                    "id": "fszghcm",
                                                                    "parent_id": "t1_fszbh6h",
                                                                    "score": 1,
                                                                    "created_utc": 1591373057.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I second this. I live in a mid-size Canadian city as well. There are certainly some unsavoury characters to filter through but I don’t receive hardly any scammer messages. 🤷‍♀️ I think it’s a benefit of living in a lesser known city.",
                    "author": "alpha_delta_echo_",
                    "id": "fsyufch",
                    "parent_id": "t1_fsyr5d0",
                    "score": 0,
                    "created_utc": 1591361358.0,
                    "replies": [
                        {
                            "body": "Yes very fortunate... Im pretty sure the majority of scamming is done in the larger well know cities. Most scammers don't actually live in that actually city of course but will change location to cities they know have large populations which in turn have more \"targets\"",
                            "author": "Agent_3w",
                            "id": "fsyx22n",
                            "parent_id": "t1_fsyufch",
                            "score": 2,
                            "created_utc": 1591362992.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neat! Power to the techies",
            "author": "BeautyGr8ce",
            "id": "ft16dfq",
            "parent_id": "t1_ft14jhw",
            "score": 4,
            "created_utc": 1591402551.0,
            "replies": []
        },
        {
            "body": "I work in multi-media, so to see a photoshop job this bad offends me.",
            "author": "PombaGira1",
            "id": "fsyzbzd",
            "parent_id": "t1_fsyxw6d",
            "score": 2,
            "created_utc": 1591364323.0,
            "replies": [
                {
                    "body": "Tbh I was getting a bit sleepy and my first reaction was my tired eyes are deceiving me 🤣🤣",
                    "author": "Agent_3w",
                    "id": "fsyzw69",
                    "parent_id": "t1_fsyzbzd",
                    "score": 1,
                    "created_utc": 1591364644.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It did! Thanks, I needed it!",
            "author": "princessregime",
            "id": "fsyjgrr",
            "parent_id": "t1_fsygbf5",
            "score": 1,
            "created_utc": 1591352685.0,
            "replies": []
        },
        {
            "body": "Unfortunately they got the order wrong.\n\nIt's wooing, flirting, **then** degradation and begging. Haven't even brought up my safe word yet!",
            "author": "drunky_crowette",
            "id": "ft1jsmo",
            "parent_id": "t1_ft1ie7a",
            "score": 3,
            "created_utc": 1591408415.0,
            "replies": []
        },
        {
            "body": "Very fortunate my guy. I live near two of the largest cities in the US and I get several a day. The scammers are usually easy to brush off cuz there are so many red flags via a quick profile glance alone (little to no description/just joined etc..) it's the online only profiles that suck the life outta you.. start with standard greetings and replies that may take hours if not days  and then she finally hits you with the Im not comfortable meeting yet but I'm open to an online arrangement 😭",
            "author": "Agent_3w",
            "id": "fsyshs6",
            "parent_id": "t1_fsyr5d0",
            "score": 2,
            "created_utc": 1591360066.0,
            "replies": [
                {
                    "body": "Most girls here have Facebook or IG verified on their profiles so I’m not sure how easy that is to fake or if scammers go to those lengths. I live in a university town with huge amount of students.",
                    "author": "ograx",
                    "id": "fsyswv5",
                    "parent_id": "t1_fsyshs6",
                    "score": 1,
                    "created_utc": 1591360356.0,
                    "replies": [
                        {
                            "body": "That used to be an easy way to filter them out but turns out it's very easy to create and link a fake IG or FB acct 😵\nIt is what it is... SA is still the only reliable source for this lifestyle. I've actually been contacted recently by an SA reps regarding said accounts 😅 ... Maybe something is actually being done",
                            "author": "Agent_3w",
                            "id": "fsyv7ds",
                            "parent_id": "t1_fsyswv5",
                            "score": 2,
                            "created_utc": 1591361858.0,
                            "replies": [
                                {
                                    "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
                                    "author": "ograx",
                                    "id": "fsyvgtc",
                                    "parent_id": "t1_fsyv7ds",
                                    "score": 1,
                                    "created_utc": 1591362022.0,
                                    "replies": [
                                        {
                                            "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                                            "author": "Agent_3w",
                                            "id": "fsyvye3",
                                            "parent_id": "t1_fsyvgtc",
                                            "score": 1,
                                            "created_utc": 1591362326.0,
                                            "replies": [
                                                {
                                                    "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                                                    "author": "ograx",
                                                    "id": "fsyww4u",
                                                    "parent_id": "t1_fsyvye3",
                                                    "score": 0,
                                                    "created_utc": 1591362893.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "How do you not get banned for leaving that in your profile?",
                                            "author": "LiliaTheSuccubus",
                                            "id": "fsz676s",
                                            "parent_id": "t1_fsyvgtc",
                                            "score": 1,
                                            "created_utc": 1591368014.0,
                                            "replies": [
                                                {
                                                    "body": "Why would I? Could mean anything",
                                                    "author": "ograx",
                                                    "id": "fszbh6h",
                                                    "parent_id": "t1_fsz676s",
                                                    "score": 1,
                                                    "created_utc": 1591370643.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                                            "author": "LiliaTheSuccubus",
                                                            "id": "fszghcm",
                                                            "parent_id": "t1_fszbh6h",
                                                            "score": 1,
                                                            "created_utc": 1591373057.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I second this. I live in a mid-size Canadian city as well. There are certainly some unsavoury characters to filter through but I don’t receive hardly any scammer messages. 🤷‍♀️ I think it’s a benefit of living in a lesser known city.",
            "author": "alpha_delta_echo_",
            "id": "fsyufch",
            "parent_id": "t1_fsyr5d0",
            "score": 0,
            "created_utc": 1591361358.0,
            "replies": [
                {
                    "body": "Yes very fortunate... Im pretty sure the majority of scamming is done in the larger well know cities. Most scammers don't actually live in that actually city of course but will change location to cities they know have large populations which in turn have more \"targets\"",
                    "author": "Agent_3w",
                    "id": "fsyx22n",
                    "parent_id": "t1_fsyufch",
                    "score": 2,
                    "created_utc": 1591362992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tbh I was getting a bit sleepy and my first reaction was my tired eyes are deceiving me 🤣🤣",
            "author": "Agent_3w",
            "id": "fsyzw69",
            "parent_id": "t1_fsyzbzd",
            "score": 1,
            "created_utc": 1591364644.0,
            "replies": []
        },
        {
            "body": "Most girls here have Facebook or IG verified on their profiles so I’m not sure how easy that is to fake or if scammers go to those lengths. I live in a university town with huge amount of students.",
            "author": "ograx",
            "id": "fsyswv5",
            "parent_id": "t1_fsyshs6",
            "score": 1,
            "created_utc": 1591360356.0,
            "replies": [
                {
                    "body": "That used to be an easy way to filter them out but turns out it's very easy to create and link a fake IG or FB acct 😵\nIt is what it is... SA is still the only reliable source for this lifestyle. I've actually been contacted recently by an SA reps regarding said accounts 😅 ... Maybe something is actually being done",
                    "author": "Agent_3w",
                    "id": "fsyv7ds",
                    "parent_id": "t1_fsyswv5",
                    "score": 2,
                    "created_utc": 1591361858.0,
                    "replies": [
                        {
                            "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
                            "author": "ograx",
                            "id": "fsyvgtc",
                            "parent_id": "t1_fsyv7ds",
                            "score": 1,
                            "created_utc": 1591362022.0,
                            "replies": [
                                {
                                    "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                                    "author": "Agent_3w",
                                    "id": "fsyvye3",
                                    "parent_id": "t1_fsyvgtc",
                                    "score": 1,
                                    "created_utc": 1591362326.0,
                                    "replies": [
                                        {
                                            "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                                            "author": "ograx",
                                            "id": "fsyww4u",
                                            "parent_id": "t1_fsyvye3",
                                            "score": 0,
                                            "created_utc": 1591362893.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "How do you not get banned for leaving that in your profile?",
                                    "author": "LiliaTheSuccubus",
                                    "id": "fsz676s",
                                    "parent_id": "t1_fsyvgtc",
                                    "score": 1,
                                    "created_utc": 1591368014.0,
                                    "replies": [
                                        {
                                            "body": "Why would I? Could mean anything",
                                            "author": "ograx",
                                            "id": "fszbh6h",
                                            "parent_id": "t1_fsz676s",
                                            "score": 1,
                                            "created_utc": 1591370643.0,
                                            "replies": [
                                                {
                                                    "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                                    "author": "LiliaTheSuccubus",
                                                    "id": "fszghcm",
                                                    "parent_id": "t1_fszbh6h",
                                                    "score": 1,
                                                    "created_utc": 1591373057.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes very fortunate... Im pretty sure the majority of scamming is done in the larger well know cities. Most scammers don't actually live in that actually city of course but will change location to cities they know have large populations which in turn have more \"targets\"",
            "author": "Agent_3w",
            "id": "fsyx22n",
            "parent_id": "t1_fsyufch",
            "score": 2,
            "created_utc": 1591362992.0,
            "replies": []
        },
        {
            "body": "That used to be an easy way to filter them out but turns out it's very easy to create and link a fake IG or FB acct 😵\nIt is what it is... SA is still the only reliable source for this lifestyle. I've actually been contacted recently by an SA reps regarding said accounts 😅 ... Maybe something is actually being done",
            "author": "Agent_3w",
            "id": "fsyv7ds",
            "parent_id": "t1_fsyswv5",
            "score": 2,
            "created_utc": 1591361858.0,
            "replies": [
                {
                    "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
                    "author": "ograx",
                    "id": "fsyvgtc",
                    "parent_id": "t1_fsyv7ds",
                    "score": 1,
                    "created_utc": 1591362022.0,
                    "replies": [
                        {
                            "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                            "author": "Agent_3w",
                            "id": "fsyvye3",
                            "parent_id": "t1_fsyvgtc",
                            "score": 1,
                            "created_utc": 1591362326.0,
                            "replies": [
                                {
                                    "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                                    "author": "ograx",
                                    "id": "fsyww4u",
                                    "parent_id": "t1_fsyvye3",
                                    "score": 0,
                                    "created_utc": 1591362893.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "How do you not get banned for leaving that in your profile?",
                            "author": "LiliaTheSuccubus",
                            "id": "fsz676s",
                            "parent_id": "t1_fsyvgtc",
                            "score": 1,
                            "created_utc": 1591368014.0,
                            "replies": [
                                {
                                    "body": "Why would I? Could mean anything",
                                    "author": "ograx",
                                    "id": "fszbh6h",
                                    "parent_id": "t1_fsz676s",
                                    "score": 1,
                                    "created_utc": 1591370643.0,
                                    "replies": [
                                        {
                                            "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                            "author": "LiliaTheSuccubus",
                                            "id": "fszghcm",
                                            "parent_id": "t1_fszbh6h",
                                            "score": 1,
                                            "created_utc": 1591373057.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really? I’ve had better luck with tinder and putting SD $$$ in my profile. Draws in girls who don’t know about SA maybe or that are on fence.",
            "author": "ograx",
            "id": "fsyvgtc",
            "parent_id": "t1_fsyv7ds",
            "score": 1,
            "created_utc": 1591362022.0,
            "replies": [
                {
                    "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
                    "author": "Agent_3w",
                    "id": "fsyvye3",
                    "parent_id": "t1_fsyvgtc",
                    "score": 1,
                    "created_utc": 1591362326.0,
                    "replies": [
                        {
                            "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                            "author": "ograx",
                            "id": "fsyww4u",
                            "parent_id": "t1_fsyvye3",
                            "score": 0,
                            "created_utc": 1591362893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How do you not get banned for leaving that in your profile?",
                    "author": "LiliaTheSuccubus",
                    "id": "fsz676s",
                    "parent_id": "t1_fsyvgtc",
                    "score": 1,
                    "created_utc": 1591368014.0,
                    "replies": [
                        {
                            "body": "Why would I? Could mean anything",
                            "author": "ograx",
                            "id": "fszbh6h",
                            "parent_id": "t1_fsz676s",
                            "score": 1,
                            "created_utc": 1591370643.0,
                            "replies": [
                                {
                                    "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                                    "author": "LiliaTheSuccubus",
                                    "id": "fszghcm",
                                    "parent_id": "t1_fszbh6h",
                                    "score": 1,
                                    "created_utc": 1591373057.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely not in my area. Also note that my area frequents several pros as well ... Traveling and based near.",
            "author": "Agent_3w",
            "id": "fsyvye3",
            "parent_id": "t1_fsyvgtc",
            "score": 1,
            "created_utc": 1591362326.0,
            "replies": [
                {
                    "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
                    "author": "ograx",
                    "id": "fsyww4u",
                    "parent_id": "t1_fsyvye3",
                    "score": 0,
                    "created_utc": 1591362893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How do you not get banned for leaving that in your profile?",
            "author": "LiliaTheSuccubus",
            "id": "fsz676s",
            "parent_id": "t1_fsyvgtc",
            "score": 1,
            "created_utc": 1591368014.0,
            "replies": [
                {
                    "body": "Why would I? Could mean anything",
                    "author": "ograx",
                    "id": "fszbh6h",
                    "parent_id": "t1_fsz676s",
                    "score": 1,
                    "created_utc": 1591370643.0,
                    "replies": [
                        {
                            "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                            "author": "LiliaTheSuccubus",
                            "id": "fszghcm",
                            "parent_id": "t1_fszbh6h",
                            "score": 1,
                            "created_utc": 1591373057.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like newbies so I prefer to go with them whenever possible. Lots of loser SD out there that give the life a bad name and find good portion of more experienced SB to have an innate initial bad attitude. I totally understand that from them but I prefer to just avoid any complications like that.",
            "author": "ograx",
            "id": "fsyww4u",
            "parent_id": "t1_fsyvye3",
            "score": 0,
            "created_utc": 1591362893.0,
            "replies": []
        },
        {
            "body": "Why would I? Could mean anything",
            "author": "ograx",
            "id": "fszbh6h",
            "parent_id": "t1_fsz676s",
            "score": 1,
            "created_utc": 1591370643.0,
            "replies": [
                {
                    "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
                    "author": "LiliaTheSuccubus",
                    "id": "fszghcm",
                    "parent_id": "t1_fszbh6h",
                    "score": 1,
                    "created_utc": 1591373057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah, guess so. Thought they were anal about what people put in their profiles haha.",
            "author": "LiliaTheSuccubus",
            "id": "fszghcm",
            "parent_id": "t1_fszbh6h",
            "score": 1,
            "created_utc": 1591373057.0,
            "replies": []
        }
    ]
}