{
    "title": "Small confession: I thought they were exaggerating when they called YJS \"Nation's MC\"",
    "post_id": "mc1c7r",
    "post_url": "https://www.reddit.com/r/runningman/comments/mc1c7r/small_confession_i_thought_they_were_exaggerating/",
    "author": "Trick_Literature_",
    "body": "When I first started RM, I kept seeing \"Nation's MC\" everytime Jaesuk did something/anything. He does his signature dance move? \"Nation's MC\" pops up. He does something nice? \"Nation's MC\" appears again.\n\nI thought, \"Okaaay... Weird flex, but okay.\" I chalked it up to them (RM prod) building him up and giving him a nickname to boost views and memorability. Cause it's their show, y'know, *of course* they want their member to have memorable nicknames.\n\n***Boy, was I wrong.***\n\nThe more episodes I watched, the more I realized it wasn't an exaggeration. Every time they went out, more people would flock to Jaesuk compared to the other members. Even with all the hotshot celebrity guests they have, people *still* go to Jaesuk.\n\nAnd then I'd hear comments about him from other people. Celebs, passersby, the fricking entertainment news outlets. Remember that one news about him discretely doing monthly sponsorships at a hospital. *Dude*. Not to mention the yearly rankings and the awards he consistently sweeps.\n\nThey didn't call him the Nation's MC just for kicks. They didn't do it just for the show.\n\nThey call YJS the Nation's MC, because he *is* the Nation's MC.",
    "url": "https://www.reddit.com/r/runningman/comments/mc1c7r/small_confession_i_thought_they_were_exaggerating/",
    "score": 254,
    "upvote_ratio": 0.98,
    "created_utc": 1616577217.0,
    "num_comments": 70,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I recall their RM episode 8 where it showed the members' humble beginnings. From that you have to appreciate and respect YJS dedication and passion to his craft. He may even be considered the most hardworking host despite all his achievements and wealth.",
            "author": "dadarsotero",
            "id": "gs1fmc3",
            "parent_id": "t3_mc1c7r",
            "score": 67,
            "created_utc": 1616588067.0,
            "replies": [
                {
                    "body": "Not to mention he's one of the cleanest K-celebrity out there - no scandals, doesn't drink, no social media, does a lot of charitable causes. He's literally a national treasure haha.",
                    "author": "koki_2706",
                    "id": "gs1qsm8",
                    "parent_id": "t1_gs1fmc3",
                    "score": 54,
                    "created_utc": 1616593993.0,
                    "replies": [
                        {
                            "body": "And he seems like a genuinely nice guy on and off the camera.  I forget if RM or IC but there were a couple of hidden camera situations, one where they put an old lady struggling with groceries to see what each member would do and YJS had one of his assistants drive her home!  Another was a speeding car in a narrow street as members walk with a female assistant and YJS naturally pulled her away so that he was more exposed to the danger.  Love this guy.",
                            "author": "iruvit",
                            "id": "gs2nk3z",
                            "parent_id": "t1_gs1qsm8",
                            "score": 29,
                            "created_utc": 1616607929.0,
                            "replies": []
                        },
                        {
                            "body": "He also quitted smoking after he join infinite challenge. He used to smoke a lot",
                            "author": "meklavier",
                            "id": "gs4q6j5",
                            "parent_id": "t1_gs1qsm8",
                            "score": 5,
                            "created_utc": 1616642521.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "... until he started \"working out\" topless. Regardless of his intentions, that was one helluva interesting visual lol",
                    "author": "snowysnowy",
                    "id": "gs1pgjy",
                    "parent_id": "t1_gs1fmc3",
                    "score": 27,
                    "created_utc": 1616593362.0,
                    "replies": [
                        {
                            "body": "Went to watch the video clip again. I guess I agree his nipples are a bit low as mentioned in this week episode. 😅",
                            "author": "mitchytan92",
                            "id": "gs2gt8l",
                            "parent_id": "t1_gs1pgjy",
                            "score": 8,
                            "created_utc": 1616605087.0,
                            "replies": [
                                {
                                    "body": "Wait where do i watch this clip?",
                                    "author": "lolipoppss",
                                    "id": "gs2s3b2",
                                    "parent_id": "t1_gs2gt8l",
                                    "score": 1,
                                    "created_utc": 1616609851.0,
                                    "replies": [
                                        {
                                            "body": "https://youtu.be/miQsv1QuDP8\n\nAs an added bonus, hear JSJs famous \"I Swear!\"",
                                            "author": "dadarsotero",
                                            "id": "gs3g4bw",
                                            "parent_id": "t1_gs2s3b2",
                                            "score": 5,
                                            "created_utc": 1616619900.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Thanks for the reminder. 😂",
                            "author": "dadarsotero",
                            "id": "gs2179z",
                            "parent_id": "t1_gs1pgjy",
                            "score": 4,
                            "created_utc": 1616598580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I chalked it up to them (RM prod) building him up and giving him a nickname to boost views and memorability\n\nLol no way. The backlash would be so huge and the PD would be criticized to hell by netizens if he went around giving people \"titles\" that weren't true. \n\nAlso, YJS is the host for multiple variety shows, won more awards than we can count and earns a shitton of money. He's super rich.",
            "author": "WashooGonnaDo",
            "id": "gs13b4n",
            "parent_id": "t3_mc1c7r",
            "score": 88,
            "created_utc": 1616577999.0,
            "replies": [
                {
                    "body": "In terms of variety shows, nobody currently straddles more channels than JS:  \nSBS: Running Man  \nMBS: Hangout with Yoo  \nKBS:  Come Back Home (coming soon)  \nTvN: You Quiz on the Block & Sixth Sense 2 (coming soon)\n\nSometimes I really wonder how he can keep up with all these filming schedules.",
                    "author": "koki_2706",
                    "id": "gs14uff",
                    "parent_id": "t1_gs13b4n",
                    "score": 65,
                    "created_utc": 1616579541.0,
                    "replies": [
                        {
                            "body": "I think there are definitely entertainers who have more shows than YJS (Jun Hyun Moo has a lot of shows for example) but no one comes close to Jaesuk for the longevity and popularity of all his shows domestically and internationally. He’s got a good mix of quality + quantity.",
                            "author": "zaichii",
                            "id": "gs1pc8g",
                            "parent_id": "t1_gs14uff",
                            "score": 52,
                            "created_utc": 1616593305.0,
                            "replies": [
                                {
                                    "body": "Yup, I forgot about Jun Hyun Moo - he seems to be everywhere as well.",
                                    "author": "koki_2706",
                                    "id": "gs1r910",
                                    "parent_id": "t1_gs1pc8g",
                                    "score": 1,
                                    "created_utc": 1616594202.0,
                                    "replies": [
                                        {
                                            "body": "If we consider YJS and KHD as S tiers based on the longevity of their fame and popularity, then there are plenty of entertainers who are A tier and actually have a lot of shows because they’re more affordable tbh, though they’re either not as internationally famous or they’re in one or two big shows and the rest are like not as famous. Lee Sang Min is apparently in 5 shows but probably only MUD and Knowing Brothers is more known. Jang Sung Kyu was also in a lot of shows when he broke out too. Kim Sook is also in a lot of shows that did well domestically which was what helped her win the Daesang (boss in the mirror, problem child in the house) but I feel those aren’t internationally popular.",
                                            "author": "zaichii",
                                            "id": "gs1sbh9",
                                            "parent_id": "t1_gs1r910",
                                            "score": 7,
                                            "created_utc": 1616594688.0,
                                            "replies": [
                                                {
                                                    "body": "KHD was an S tier before his tax evasion scandals in 2011. not sure if you can still consider him an S tier becuase he's not on any mainstream channels - KBS, SBS, MBC - but only on cable channels like tvn, jtbc, some nature channels, etc. he's more close to a borderline A/B tier celebrity now.",
                                                    "author": "numberforty",
                                                    "id": "gs2p4ye",
                                                    "parent_id": "t1_gs1sbh9",
                                                    "score": 8,
                                                    "created_utc": 1616608594.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
                                                            "author": "zaichii",
                                                            "id": "gs3ff3f",
                                                            "parent_id": "t1_gs2p4ye",
                                                            "score": 2,
                                                            "created_utc": 1616619599.0,
                                                            "replies": [
                                                                {
                                                                    "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                                                                    "author": "taylorsanatomy13_",
                                                                    "id": "hqv6bpn",
                                                                    "parent_id": "t1_gs3ff3f",
                                                                    "score": 1,
                                                                    "created_utc": 1641079651.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And all of them are so successful. But I guess it’s successful because of his name brand as well. You’d tune in to watch something with YJS in it. \n\nFrom comments made by the cast and production staff over time, he seems to be someone very meticulous when it comes to his craft. I remember one of the pd saying that he called YJS to share with him the happy news that one of their episodes hit a really high viewer rating and YJS in turn discussed with him for about 2 hours on how they could improve the planning of the program lmao. The hardest working man on television, my lazy ass could never.",
                            "author": "swearyirishman",
                            "id": "gs1udur",
                            "parent_id": "t1_gs14uff",
                            "score": 17,
                            "created_utc": 1616595625.0,
                            "replies": []
                        },
                        {
                            "body": "And now Netflix too",
                            "author": "iRelapse",
                            "id": "gs37ieg",
                            "parent_id": "t1_gs14uff",
                            "score": 3,
                            "created_utc": 1616616253.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I knew nothing about Korean variety before I watched RM, lol. The only person I recognized among the members was Kwangsoo, and then Jihyo after a bit of staring.\n\nAfter watching RM, I got to know more about Korean entertainment and not just what the dramas show. My lack of knowledge is definitely the reason why I though they were exaggerating.",
                    "author": "Trick_Literature_",
                    "id": "gs140go",
                    "parent_id": "t1_gs13b4n",
                    "score": 26,
                    "created_utc": 1616578713.0,
                    "replies": [
                        {
                            "body": "YJS was amazing on Family Outing!",
                            "author": "takeheadedof",
                            "id": "gs21nif",
                            "parent_id": "t1_gs140go",
                            "score": 6,
                            "created_utc": 1616598770.0,
                            "replies": [
                                {
                                    "body": "YJS was amazing on family outing but let's also not forget about Hyori and KJK who carried the show just as much.",
                                    "author": "numberforty",
                                    "id": "gs2u6oz",
                                    "parent_id": "t1_gs21nif",
                                    "score": 5,
                                    "created_utc": 1616610735.0,
                                    "replies": [
                                        {
                                            "body": "Oh for sure! And Chunderlla and his \"step-mom\". Daesung and KJK were great together, too! Season 1 has a special place in my heart!",
                                            "author": "takeheadedof",
                                            "id": "gs2uj9q",
                                            "parent_id": "t1_gs2u6oz",
                                            "score": 3,
                                            "created_utc": 1616610881.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "When I was a kid my sister love Asian horror movie very much.. right after I started to watch RM, deja vu kick in, like I've seen her (SJH) in some 2000' movie before.. and my mind blown when I realized that girl in Wishing Stairs is SJH.. lol",
                            "author": null,
                            "id": "gs1p8qe",
                            "parent_id": "t1_gs140go",
                            "score": 4,
                            "created_utc": 1616593258.0,
                            "replies": [
                                {
                                    "body": "The mindblow happened to me when my sister rewatched Princess Hours (Goong). She acted as the love rival, opposite of Yoon Eunhye.",
                                    "author": "Trick_Literature_",
                                    "id": "gs1yawu",
                                    "parent_id": "t1_gs1p8qe",
                                    "score": 3,
                                    "created_utc": 1616597339.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup. Nobody can touch him. Even during the monthly rankings, he consistently doubles the score of whoever is in second place.",
            "author": "badstewie",
            "id": "gs1dvc8",
            "parent_id": "t3_mc1c7r",
            "score": 20,
            "created_utc": 1616586931.0,
            "replies": []
        },
        {
            "body": "Fun fact: YJS is the 1st MC in Korea to have a variety TV show air for over 10 years on all 3 major broadcast channels, Infinity Challenge MBC, Happy Together KBS, Running Man SBS. He's the Nation's MC for a reason.",
            "author": "jhdnhc",
            "id": "gs22j75",
            "parent_id": "t3_mc1c7r",
            "score": 19,
            "created_utc": 1616599142.0,
            "replies": [
                {
                    "body": "Thats 500+ episodes, and man, Running Man right now is going 548. I'm getting emotional huhuhu",
                    "author": "glassesinglamour",
                    "id": "gs2bkcb",
                    "parent_id": "t1_gs22j75",
                    "score": 6,
                    "created_utc": 1616602903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The 100 vs 100 episode showcase the capabilities of YJS as MC. I remembered people were skeptical about the shows distributing guests screen time when news about RM invited 100 guests but YJS delivered.",
            "author": "honechan",
            "id": "gs1z8be",
            "parent_id": "t3_mc1c7r",
            "score": 18,
            "created_utc": 1616597739.0,
            "replies": []
        },
        {
            "body": "There was this politician who criticized him for wearing the colors of his opposing party during an election. You can only imagine what happened. You just don't talk shit about the Nation's MC. Unless you're in RM xD",
            "author": "xmodifier",
            "id": "gs2fuoe",
            "parent_id": "t3_mc1c7r",
            "score": 14,
            "created_utc": 1616604680.0,
            "replies": []
        },
        {
            "body": "When I first started watching RM I didn’t get YJS, didn’t understand why he was annoying and always wanted to beat KJK. Then I discovered X Man and Family Outing and The Village. Because of RM I became a fan of YJS, because of YJS I am obsessed by Korean Variety. When you go back and watch his earlier work and see how he crafted his persona and realise not only is he incredibly hard working but appears genuine and honest - a rarity these days.",
            "author": "Mitchtwiz",
            "id": "gs14q4p",
            "parent_id": "t3_mc1c7r",
            "score": 37,
            "created_utc": 1616579425.0,
            "replies": [
                {
                    "body": "Infinity Challenge too. That's why in my mind there's no rivalry between him and Kang Ho Dong. YJS is leagues ahead.",
                    "author": "bbbbbap",
                    "id": "gs1fcy5",
                    "parent_id": "t1_gs14q4p",
                    "score": 25,
                    "created_utc": 1616587902.0,
                    "replies": [
                        {
                            "body": "I still haven’t accepted it’s not on anymore.",
                            "author": "Mitchtwiz",
                            "id": "gs1pi0b",
                            "parent_id": "t1_gs1fcy5",
                            "score": 3,
                            "created_utc": 1616593382.0,
                            "replies": [
                                {
                                    "body": "hangout with yoo is basically infinite challenge without the other side kicks. it got to a point where they couldn't do any new challenges worth watching because many were out of shape and/or dealing with physical changes due to their aging (mainly park myung soo and jung jun ha). tae-ho pd could've shaken up the roster but he knew things wouldn't be the same if he kicked off some and kept others so he had no choice but to terminate it and start over with only YJS. as much as i loved infinite challenge and how sad i was over it ending, i'm happy tae-ho pd did what he did to start over. now he's able to utilize resources that wouldve been spent on side kicks for more bold and daring challenges (ssak-3 and refund sisters for example were one of the greatest projects of 2020)",
                                    "author": "numberforty",
                                    "id": "gs2rxeo",
                                    "parent_id": "t1_gs1pi0b",
                                    "score": 8,
                                    "created_utc": 1616609781.0,
                                    "replies": [
                                        {
                                            "body": "Yeah love Hangout with Yoo SSAK3 and Refund Sisters were massive last year. Also enjoy him in 6th Sense and Happy Together when it was about.",
                                            "author": "Mitchtwiz",
                                            "id": "gs2tvqw",
                                            "parent_id": "t1_gs2rxeo",
                                            "score": 5,
                                            "created_utc": 1616610609.0,
                                            "replies": [
                                                {
                                                    "body": "most definitely. i can't wait for the new seasons for both. just praying YJS will be back for Happy Together if it hasn't been confirmed already.",
                                                    "author": "numberforty",
                                                    "id": "gs2v58d",
                                                    "parent_id": "t1_gs2tvqw",
                                                    "score": 1,
                                                    "created_utc": 1616611138.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Where did you watch family outing? I've been trying for ages to find it online (with english subs) and no dice",
                    "author": "justahalfling",
                    "id": "gs1hcwd",
                    "parent_id": "t1_gs14q4p",
                    "score": 2,
                    "created_utc": 1616589103.0,
                    "replies": [
                        {
                            "body": "if you google \"family outing streaming\" you'll find lots of illegal streaming places with subtitles that i'm not going to link here\n\nunfortunately there are no legal streaming options, it's too old for streaming services to care",
                            "author": "echo-256",
                            "id": "gs1k8uh",
                            "parent_id": "t1_gs1hcwd",
                            "score": 4,
                            "created_utc": 1616590721.0,
                            "replies": []
                        },
                        {
                            "body": "Just PMed you",
                            "author": "Mitchtwiz",
                            "id": "gs1pc33",
                            "parent_id": "t1_gs1hcwd",
                            "score": 1,
                            "created_utc": 1616593303.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "may he lives a long life. i mean seriously, i want to see what will he do to JK at the age 70. like he used to say",
            "author": "idksowhtevr",
            "id": "gs1zgs5",
            "parent_id": "t3_mc1c7r",
            "score": 13,
            "created_utc": 1616597838.0,
            "replies": []
        },
        {
            "body": "I have the same sentiment when i first start watching rm. Then i could sort of understand after researching all that. Nowadays, after watching rm and all his other shows i definitely understand. It’s his mad skills to operate the flow of the show. I think one commenter from a past thread compare him to a traffic enforcer. Manipulate traffic. We can definitely see that through episodes where other members was able to MC like seokjin and haha and maybe others. They can’t handle MC’ing well and still they passed the job back to yoo jae suk lol. Also remember when they were in Mongolia and he was able to translate accurately even though he doesn’t know the language? In how do you play, when the refund sisters first met each other yjs was able interpret the vibe of each and the overall vibe. He has the ability to recognise other’s intentions and feelings. In psychology, i think they can call him an interpersonal genius.",
            "author": null,
            "id": "gs2lrj5",
            "parent_id": "t3_mc1c7r",
            "score": 8,
            "created_utc": 1616607168.0,
            "replies": []
        },
        {
            "body": "i know what you mean. for me, it was that i didn’t realize how famous he was. I knew he was big in the variety field but I thought he wasn’t even comparable to the big kpop or kdrama stars in terms of recognition.... boy was I wrong. Huge fan of YJS now, he’s a national treasure and certainly has the skills to back his nation’s MC title.",
            "author": "kiwibirdd7",
            "id": "gs1wjbq",
            "parent_id": "t3_mc1c7r",
            "score": 7,
            "created_utc": 1616596571.0,
            "replies": [
                {
                    "body": "That's totally it!!! I had no idea he was famous. I just thought \"oh he's a member of RM, aight\". Didn't even know anything about varieties. Now that my eyes are opened, all I wanna watch are variety shows, and he's almost always in them, lol.",
                    "author": "Trick_Literature_",
                    "id": "gs1yssy",
                    "parent_id": "t1_gs1wjbq",
                    "score": 3,
                    "created_utc": 1616597556.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No idea if anything I said was accurate. This is just how I feel towards him in general, lol.",
            "author": "Trick_Literature_",
            "id": "gs12noa",
            "parent_id": "t3_mc1c7r",
            "score": 5,
            "created_utc": 1616577347.0,
            "replies": [
                {
                    "body": "You're not wrong. He is, by far, the most awarded MC and variety show star in S Korea in modern times.",
                    "author": "phiwong",
                    "id": "gs133em",
                    "parent_id": "t1_gs12noa",
                    "score": 20,
                    "created_utc": 1616577783.0,
                    "replies": [
                        {
                            "body": "Not only so, he has constantly ranked first in popularity surveys before BTS & IU, as shown in this thread here  - [https://www.reddit.com/r/runningman/comments/jzb5qf/yu\\_jae\\_seok\\_once\\_again\\_ranked\\_as\\_most\\_popular/](https://www.reddit.com/r/runningman/comments/jzb5qf/yu_jae_seok_once_again_ranked_as_most_popular/)",
                            "author": "koki_2706",
                            "id": "gs14hwy",
                            "parent_id": "t1_gs133em",
                            "score": 16,
                            "created_utc": 1616579197.0,
                            "replies": [
                                {
                                    "body": "I’m a BTS stan and even I’d be more tempted to meet YJS than them, he’s got the best vibe to him and knows how to make a person feel comfortable whilst also keeping them engaged.",
                                    "author": "real_highlight_reel",
                                    "id": "gs19jw3",
                                    "parent_id": "t1_gs14hwy",
                                    "score": 22,
                                    "created_utc": 1616583778.0,
                                    "replies": [
                                        {
                                            "body": "In this case, I strongly recommend you to watch the latest 2 episodes of Hangout with Yoo (84 and 85) if you haven't watched it. The humble way which he treats people really shows his authentic side.",
                                            "author": "koki_2706",
                                            "id": "gs1bxf5",
                                            "parent_id": "t1_gs19jw3",
                                            "score": 5,
                                            "created_utc": 1616585575.0,
                                            "replies": [
                                                {
                                                    "body": "I’ve never watched korean variety other than RM. I just watched both episodes. YJS really is a nice and down-to-earth. I mean, he successfully taught the aunty how to ride a bike! He even took photos of the steak out of courtesy. Thank you!!! u/koki_2706",
                                                    "author": "Cousin_Carl",
                                                    "id": "gsa9g3g",
                                                    "parent_id": "t1_gs1bxf5",
                                                    "score": 3,
                                                    "created_utc": 1616762377.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Is this the same show as Yoo Quiz on the Block? I saw the preview with BTS as the guests, it supposedly aired today (haven't watch it yet)",
                                                    "author": "dindillap",
                                                    "id": "gs1t8d5",
                                                    "parent_id": "t1_gs1bxf5",
                                                    "score": 1,
                                                    "created_utc": 1616595108.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
                                                            "author": "koki_2706",
                                                            "id": "gs1uydv",
                                                            "parent_id": "t1_gs1t8d5",
                                                            "score": 2,
                                                            "created_utc": 1616595877.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yea I think I'll be way more starstruck meeting YJS than BTS haha",
                                            "author": "justahalfling",
                                            "id": "gs1hgoo",
                                            "parent_id": "t1_gs19jw3",
                                            "score": 4,
                                            "created_utc": 1616589164.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is so popular, not only because he's funny guy. He is just genuinely good guy and hard-worker. I heard that he is just the same person in front and behind camera. I don't know if it's true, but he calls every staff member by name (hundreds of people in different shows).",
            "author": "nh42v",
            "id": "gs28bsc",
            "parent_id": "t3_mc1c7r",
            "score": 4,
            "created_utc": 1616601539.0,
            "replies": []
        },
        {
            "body": "I’ve never heard of him until I started watching RM so I didn’t understand the whole “nation mc” thing too (and lol korea really gives out a national title for anything) but man... he really deserves it! Without a doubt the cleanest celebrity ever.",
            "author": "iwantaspudgun",
            "id": "gs2hoir",
            "parent_id": "t3_mc1c7r",
            "score": 4,
            "created_utc": 1616605450.0,
            "replies": []
        },
        {
            "body": "Also if you weren't aware, Korea tends to give its celebrities national titles (i.e. Nation's First Love, Nation's Little Sister...\"",
            "author": "xander_yi",
            "id": "gs3b0c4",
            "parent_id": "t3_mc1c7r",
            "score": 5,
            "created_utc": 1616617721.0,
            "replies": []
        },
        {
            "body": "\\+\n\nI always notices that the main PD (in RM) always follows YJS. Whenever there are divided by teams and there are in different locations, the main PD is with the team where YJS is.",
            "author": "EKFLF",
            "id": "gs1rdan",
            "parent_id": "t3_mc1c7r",
            "score": 3,
            "created_utc": 1616594257.0,
            "replies": []
        },
        {
            "body": "With the latest episode where they have to follow what the mc is saying, you can see how exceptional of an MC YJS is.",
            "author": "MaromaSamsa",
            "id": "gs24bqo",
            "parent_id": "t3_mc1c7r",
            "score": 3,
            "created_utc": 1616599897.0,
            "replies": []
        },
        {
            "body": "i really admire his ability to involved and make guest comfortable. no one can't beat him yet",
            "author": "extravous",
            "id": "gs4zt1o",
            "parent_id": "t3_mc1c7r",
            "score": 3,
            "created_utc": 1616648753.0,
            "replies": []
        },
        {
            "body": "YJS probably could run as a mayor of medium sized city and win .\n\nThat's how big he is.",
            "author": "Moonz92",
            "id": "gs98syt",
            "parent_id": "t3_mc1c7r",
            "score": 3,
            "created_utc": 1616731930.0,
            "replies": []
        },
        {
            "body": "TBF RM gives out superlatives willy nilly especially to guests. It's just with YJS, it is actually true.",
            "author": "JADlloyd",
            "id": "gs2vjkc",
            "parent_id": "t3_mc1c7r",
            "score": 2,
            "created_utc": 1616611306.0,
            "replies": []
        },
        {
            "body": "I mean if only KHD didnt have that mess about his accounting, that title would still be vague and prob not even favoring YJS.",
            "author": "klnic3ajer",
            "id": "gs1inb9",
            "parent_id": "t3_mc1c7r",
            "score": 2,
            "created_utc": 1616589842.0,
            "replies": [
                {
                    "body": "True, but if you back far enough, then YJS was the host of X-Men. KHD played second fiddle. So I think you could say that KHD is from the YJS line. In fact somebody joked about that with KHD on Knowing Bros to needle him.",
                    "author": "Phocion-",
                    "id": "gs1r9ww",
                    "parent_id": "t1_gs1inb9",
                    "score": 7,
                    "created_utc": 1616594214.0,
                    "replies": []
                },
                {
                    "body": "imo, KHD would still be less popular now even if the tax scandal didn’t happen. I think his style just isn’t appealing to people anymore. Even in Knowing Brothers, the punchlines about him still focus on “hierarchy/seniority”. I do think a lot of the guests’ Star King accusations are exaggerated, but has a little bit of truth in them. Now I notice that he’s more ok with being the punching-bag of jokes, which makes him more approachable unlike in his Star King days",
                    "author": "Cjvxcii",
                    "id": "gs4xmm1",
                    "parent_id": "t1_gs1inb9",
                    "score": 2,
                    "created_utc": 1616647217.0,
                    "replies": []
                },
                {
                    "body": "what happened with KHD?",
                    "author": "kiwibirdd7",
                    "id": "gs1wlb2",
                    "parent_id": "t1_gs1inb9",
                    "score": 1,
                    "created_utc": 1616596595.0,
                    "replies": [
                        {
                            "body": "In 2011, KHD was accused of tax evasion, something which proved to be false due to a mistake by his agency's accountants. His reputation took a hit for a while, and after a short hiatus in 2011-2012, he started to change his hosting style to the one we are seeing now.  \n\n\nThere's an old thread in k/variety reddit discussing his changed hosting style - [https://www.reddit.com/r/koreanvariety/comments/8mhpno/dissing\\_kang\\_ho\\_dong/](https://www.reddit.com/r/koreanvariety/comments/8mhpno/dissing_kang_ho_dong/)",
                            "author": "koki_2706",
                            "id": "gs1yc2j",
                            "parent_id": "t1_gs1wlb2",
                            "score": 7,
                            "created_utc": 1616597353.0,
                            "replies": []
                        },
                        {
                            "body": "Same question, I hope they can answer.",
                            "author": "Trick_Literature_",
                            "id": "gs1yis6",
                            "parent_id": "t1_gs1wlb2",
                            "score": 1,
                            "created_utc": 1616597435.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me also. I first watched RM on episode 398 where twice guest in because I'm a twice fanboy. Then there's the scene that they tease jae suk that he's the nation's MC yet he couldn't recall whats the score is because he still keeping it in count on both of his hands. That time it's just really nonsense and i don't believe it. But as i watch more RM epiosodes and start from the beginning, i really couldn't believe how famous he is and yet still have few haters or bashers. He is really Excellent at his work plus his attitude really gives it off for all the succes he deserved.",
            "author": "kentwansue",
            "id": "gs2v3h8",
            "parent_id": "t3_mc1c7r",
            "score": 1,
            "created_utc": 1616611117.0,
            "replies": []
        },
        {
            "body": "I’ve been a fan of YJS since I started watching Family Outing back in 2008. He is extremely witty and you can see how he makes guests comfortable whenever they appear on his shows. YJS is also a mood maker and a really great one at that.",
            "author": "Tidus3960",
            "id": "gsnp746",
            "parent_id": "t3_mc1c7r",
            "score": 1,
            "created_utc": 1616995603.0,
            "replies": []
        },
        {
            "body": "Haha I had this same moment of revelation when watching Running Man for the first time last year..YJS is truly an amazing human!",
            "author": "Kbdrama",
            "id": "gszlp03",
            "parent_id": "t3_mc1c7r",
            "score": 1,
            "created_utc": 1617245335.0,
            "replies": []
        },
        {
            "body": "Not to mention he's one of the cleanest K-celebrity out there - no scandals, doesn't drink, no social media, does a lot of charitable causes. He's literally a national treasure haha.",
            "author": "koki_2706",
            "id": "gs1qsm8",
            "parent_id": "t1_gs1fmc3",
            "score": 54,
            "created_utc": 1616593993.0,
            "replies": [
                {
                    "body": "And he seems like a genuinely nice guy on and off the camera.  I forget if RM or IC but there were a couple of hidden camera situations, one where they put an old lady struggling with groceries to see what each member would do and YJS had one of his assistants drive her home!  Another was a speeding car in a narrow street as members walk with a female assistant and YJS naturally pulled her away so that he was more exposed to the danger.  Love this guy.",
                    "author": "iruvit",
                    "id": "gs2nk3z",
                    "parent_id": "t1_gs1qsm8",
                    "score": 29,
                    "created_utc": 1616607929.0,
                    "replies": []
                },
                {
                    "body": "He also quitted smoking after he join infinite challenge. He used to smoke a lot",
                    "author": "meklavier",
                    "id": "gs4q6j5",
                    "parent_id": "t1_gs1qsm8",
                    "score": 5,
                    "created_utc": 1616642521.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "... until he started \"working out\" topless. Regardless of his intentions, that was one helluva interesting visual lol",
            "author": "snowysnowy",
            "id": "gs1pgjy",
            "parent_id": "t1_gs1fmc3",
            "score": 27,
            "created_utc": 1616593362.0,
            "replies": [
                {
                    "body": "Went to watch the video clip again. I guess I agree his nipples are a bit low as mentioned in this week episode. 😅",
                    "author": "mitchytan92",
                    "id": "gs2gt8l",
                    "parent_id": "t1_gs1pgjy",
                    "score": 8,
                    "created_utc": 1616605087.0,
                    "replies": [
                        {
                            "body": "Wait where do i watch this clip?",
                            "author": "lolipoppss",
                            "id": "gs2s3b2",
                            "parent_id": "t1_gs2gt8l",
                            "score": 1,
                            "created_utc": 1616609851.0,
                            "replies": [
                                {
                                    "body": "https://youtu.be/miQsv1QuDP8\n\nAs an added bonus, hear JSJs famous \"I Swear!\"",
                                    "author": "dadarsotero",
                                    "id": "gs3g4bw",
                                    "parent_id": "t1_gs2s3b2",
                                    "score": 5,
                                    "created_utc": 1616619900.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thanks for the reminder. 😂",
                    "author": "dadarsotero",
                    "id": "gs2179z",
                    "parent_id": "t1_gs1pgjy",
                    "score": 4,
                    "created_utc": 1616598580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In terms of variety shows, nobody currently straddles more channels than JS:  \nSBS: Running Man  \nMBS: Hangout with Yoo  \nKBS:  Come Back Home (coming soon)  \nTvN: You Quiz on the Block & Sixth Sense 2 (coming soon)\n\nSometimes I really wonder how he can keep up with all these filming schedules.",
            "author": "koki_2706",
            "id": "gs14uff",
            "parent_id": "t1_gs13b4n",
            "score": 65,
            "created_utc": 1616579541.0,
            "replies": [
                {
                    "body": "I think there are definitely entertainers who have more shows than YJS (Jun Hyun Moo has a lot of shows for example) but no one comes close to Jaesuk for the longevity and popularity of all his shows domestically and internationally. He’s got a good mix of quality + quantity.",
                    "author": "zaichii",
                    "id": "gs1pc8g",
                    "parent_id": "t1_gs14uff",
                    "score": 52,
                    "created_utc": 1616593305.0,
                    "replies": [
                        {
                            "body": "Yup, I forgot about Jun Hyun Moo - he seems to be everywhere as well.",
                            "author": "koki_2706",
                            "id": "gs1r910",
                            "parent_id": "t1_gs1pc8g",
                            "score": 1,
                            "created_utc": 1616594202.0,
                            "replies": [
                                {
                                    "body": "If we consider YJS and KHD as S tiers based on the longevity of their fame and popularity, then there are plenty of entertainers who are A tier and actually have a lot of shows because they’re more affordable tbh, though they’re either not as internationally famous or they’re in one or two big shows and the rest are like not as famous. Lee Sang Min is apparently in 5 shows but probably only MUD and Knowing Brothers is more known. Jang Sung Kyu was also in a lot of shows when he broke out too. Kim Sook is also in a lot of shows that did well domestically which was what helped her win the Daesang (boss in the mirror, problem child in the house) but I feel those aren’t internationally popular.",
                                    "author": "zaichii",
                                    "id": "gs1sbh9",
                                    "parent_id": "t1_gs1r910",
                                    "score": 7,
                                    "created_utc": 1616594688.0,
                                    "replies": [
                                        {
                                            "body": "KHD was an S tier before his tax evasion scandals in 2011. not sure if you can still consider him an S tier becuase he's not on any mainstream channels - KBS, SBS, MBC - but only on cable channels like tvn, jtbc, some nature channels, etc. he's more close to a borderline A/B tier celebrity now.",
                                            "author": "numberforty",
                                            "id": "gs2p4ye",
                                            "parent_id": "t1_gs1sbh9",
                                            "score": 8,
                                            "created_utc": 1616608594.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
                                                    "author": "zaichii",
                                                    "id": "gs3ff3f",
                                                    "parent_id": "t1_gs2p4ye",
                                                    "score": 2,
                                                    "created_utc": 1616619599.0,
                                                    "replies": [
                                                        {
                                                            "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                                                            "author": "taylorsanatomy13_",
                                                            "id": "hqv6bpn",
                                                            "parent_id": "t1_gs3ff3f",
                                                            "score": 1,
                                                            "created_utc": 1641079651.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And all of them are so successful. But I guess it’s successful because of his name brand as well. You’d tune in to watch something with YJS in it. \n\nFrom comments made by the cast and production staff over time, he seems to be someone very meticulous when it comes to his craft. I remember one of the pd saying that he called YJS to share with him the happy news that one of their episodes hit a really high viewer rating and YJS in turn discussed with him for about 2 hours on how they could improve the planning of the program lmao. The hardest working man on television, my lazy ass could never.",
                    "author": "swearyirishman",
                    "id": "gs1udur",
                    "parent_id": "t1_gs14uff",
                    "score": 17,
                    "created_utc": 1616595625.0,
                    "replies": []
                },
                {
                    "body": "And now Netflix too",
                    "author": "iRelapse",
                    "id": "gs37ieg",
                    "parent_id": "t1_gs14uff",
                    "score": 3,
                    "created_utc": 1616616253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I knew nothing about Korean variety before I watched RM, lol. The only person I recognized among the members was Kwangsoo, and then Jihyo after a bit of staring.\n\nAfter watching RM, I got to know more about Korean entertainment and not just what the dramas show. My lack of knowledge is definitely the reason why I though they were exaggerating.",
            "author": "Trick_Literature_",
            "id": "gs140go",
            "parent_id": "t1_gs13b4n",
            "score": 26,
            "created_utc": 1616578713.0,
            "replies": [
                {
                    "body": "YJS was amazing on Family Outing!",
                    "author": "takeheadedof",
                    "id": "gs21nif",
                    "parent_id": "t1_gs140go",
                    "score": 6,
                    "created_utc": 1616598770.0,
                    "replies": [
                        {
                            "body": "YJS was amazing on family outing but let's also not forget about Hyori and KJK who carried the show just as much.",
                            "author": "numberforty",
                            "id": "gs2u6oz",
                            "parent_id": "t1_gs21nif",
                            "score": 5,
                            "created_utc": 1616610735.0,
                            "replies": [
                                {
                                    "body": "Oh for sure! And Chunderlla and his \"step-mom\". Daesung and KJK were great together, too! Season 1 has a special place in my heart!",
                                    "author": "takeheadedof",
                                    "id": "gs2uj9q",
                                    "parent_id": "t1_gs2u6oz",
                                    "score": 3,
                                    "created_utc": 1616610881.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "When I was a kid my sister love Asian horror movie very much.. right after I started to watch RM, deja vu kick in, like I've seen her (SJH) in some 2000' movie before.. and my mind blown when I realized that girl in Wishing Stairs is SJH.. lol",
                    "author": null,
                    "id": "gs1p8qe",
                    "parent_id": "t1_gs140go",
                    "score": 4,
                    "created_utc": 1616593258.0,
                    "replies": [
                        {
                            "body": "The mindblow happened to me when my sister rewatched Princess Hours (Goong). She acted as the love rival, opposite of Yoon Eunhye.",
                            "author": "Trick_Literature_",
                            "id": "gs1yawu",
                            "parent_id": "t1_gs1p8qe",
                            "score": 3,
                            "created_utc": 1616597339.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thats 500+ episodes, and man, Running Man right now is going 548. I'm getting emotional huhuhu",
            "author": "glassesinglamour",
            "id": "gs2bkcb",
            "parent_id": "t1_gs22j75",
            "score": 6,
            "created_utc": 1616602903.0,
            "replies": []
        },
        {
            "body": "Infinity Challenge too. That's why in my mind there's no rivalry between him and Kang Ho Dong. YJS is leagues ahead.",
            "author": "bbbbbap",
            "id": "gs1fcy5",
            "parent_id": "t1_gs14q4p",
            "score": 25,
            "created_utc": 1616587902.0,
            "replies": [
                {
                    "body": "I still haven’t accepted it’s not on anymore.",
                    "author": "Mitchtwiz",
                    "id": "gs1pi0b",
                    "parent_id": "t1_gs1fcy5",
                    "score": 3,
                    "created_utc": 1616593382.0,
                    "replies": [
                        {
                            "body": "hangout with yoo is basically infinite challenge without the other side kicks. it got to a point where they couldn't do any new challenges worth watching because many were out of shape and/or dealing with physical changes due to their aging (mainly park myung soo and jung jun ha). tae-ho pd could've shaken up the roster but he knew things wouldn't be the same if he kicked off some and kept others so he had no choice but to terminate it and start over with only YJS. as much as i loved infinite challenge and how sad i was over it ending, i'm happy tae-ho pd did what he did to start over. now he's able to utilize resources that wouldve been spent on side kicks for more bold and daring challenges (ssak-3 and refund sisters for example were one of the greatest projects of 2020)",
                            "author": "numberforty",
                            "id": "gs2rxeo",
                            "parent_id": "t1_gs1pi0b",
                            "score": 8,
                            "created_utc": 1616609781.0,
                            "replies": [
                                {
                                    "body": "Yeah love Hangout with Yoo SSAK3 and Refund Sisters were massive last year. Also enjoy him in 6th Sense and Happy Together when it was about.",
                                    "author": "Mitchtwiz",
                                    "id": "gs2tvqw",
                                    "parent_id": "t1_gs2rxeo",
                                    "score": 5,
                                    "created_utc": 1616610609.0,
                                    "replies": [
                                        {
                                            "body": "most definitely. i can't wait for the new seasons for both. just praying YJS will be back for Happy Together if it hasn't been confirmed already.",
                                            "author": "numberforty",
                                            "id": "gs2v58d",
                                            "parent_id": "t1_gs2tvqw",
                                            "score": 1,
                                            "created_utc": 1616611138.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where did you watch family outing? I've been trying for ages to find it online (with english subs) and no dice",
            "author": "justahalfling",
            "id": "gs1hcwd",
            "parent_id": "t1_gs14q4p",
            "score": 2,
            "created_utc": 1616589103.0,
            "replies": [
                {
                    "body": "if you google \"family outing streaming\" you'll find lots of illegal streaming places with subtitles that i'm not going to link here\n\nunfortunately there are no legal streaming options, it's too old for streaming services to care",
                    "author": "echo-256",
                    "id": "gs1k8uh",
                    "parent_id": "t1_gs1hcwd",
                    "score": 4,
                    "created_utc": 1616590721.0,
                    "replies": []
                },
                {
                    "body": "Just PMed you",
                    "author": "Mitchtwiz",
                    "id": "gs1pc33",
                    "parent_id": "t1_gs1hcwd",
                    "score": 1,
                    "created_utc": 1616593303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's totally it!!! I had no idea he was famous. I just thought \"oh he's a member of RM, aight\". Didn't even know anything about varieties. Now that my eyes are opened, all I wanna watch are variety shows, and he's almost always in them, lol.",
            "author": "Trick_Literature_",
            "id": "gs1yssy",
            "parent_id": "t1_gs1wjbq",
            "score": 3,
            "created_utc": 1616597556.0,
            "replies": []
        },
        {
            "body": "You're not wrong. He is, by far, the most awarded MC and variety show star in S Korea in modern times.",
            "author": "phiwong",
            "id": "gs133em",
            "parent_id": "t1_gs12noa",
            "score": 20,
            "created_utc": 1616577783.0,
            "replies": [
                {
                    "body": "Not only so, he has constantly ranked first in popularity surveys before BTS & IU, as shown in this thread here  - [https://www.reddit.com/r/runningman/comments/jzb5qf/yu\\_jae\\_seok\\_once\\_again\\_ranked\\_as\\_most\\_popular/](https://www.reddit.com/r/runningman/comments/jzb5qf/yu_jae_seok_once_again_ranked_as_most_popular/)",
                    "author": "koki_2706",
                    "id": "gs14hwy",
                    "parent_id": "t1_gs133em",
                    "score": 16,
                    "created_utc": 1616579197.0,
                    "replies": [
                        {
                            "body": "I’m a BTS stan and even I’d be more tempted to meet YJS than them, he’s got the best vibe to him and knows how to make a person feel comfortable whilst also keeping them engaged.",
                            "author": "real_highlight_reel",
                            "id": "gs19jw3",
                            "parent_id": "t1_gs14hwy",
                            "score": 22,
                            "created_utc": 1616583778.0,
                            "replies": [
                                {
                                    "body": "In this case, I strongly recommend you to watch the latest 2 episodes of Hangout with Yoo (84 and 85) if you haven't watched it. The humble way which he treats people really shows his authentic side.",
                                    "author": "koki_2706",
                                    "id": "gs1bxf5",
                                    "parent_id": "t1_gs19jw3",
                                    "score": 5,
                                    "created_utc": 1616585575.0,
                                    "replies": [
                                        {
                                            "body": "I’ve never watched korean variety other than RM. I just watched both episodes. YJS really is a nice and down-to-earth. I mean, he successfully taught the aunty how to ride a bike! He even took photos of the steak out of courtesy. Thank you!!! u/koki_2706",
                                            "author": "Cousin_Carl",
                                            "id": "gsa9g3g",
                                            "parent_id": "t1_gs1bxf5",
                                            "score": 3,
                                            "created_utc": 1616762377.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Is this the same show as Yoo Quiz on the Block? I saw the preview with BTS as the guests, it supposedly aired today (haven't watch it yet)",
                                            "author": "dindillap",
                                            "id": "gs1t8d5",
                                            "parent_id": "t1_gs1bxf5",
                                            "score": 1,
                                            "created_utc": 1616595108.0,
                                            "replies": [
                                                {
                                                    "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
                                                    "author": "koki_2706",
                                                    "id": "gs1uydv",
                                                    "parent_id": "t1_gs1t8d5",
                                                    "score": 2,
                                                    "created_utc": 1616595877.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yea I think I'll be way more starstruck meeting YJS than BTS haha",
                                    "author": "justahalfling",
                                    "id": "gs1hgoo",
                                    "parent_id": "t1_gs19jw3",
                                    "score": 4,
                                    "created_utc": 1616589164.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "True, but if you back far enough, then YJS was the host of X-Men. KHD played second fiddle. So I think you could say that KHD is from the YJS line. In fact somebody joked about that with KHD on Knowing Bros to needle him.",
            "author": "Phocion-",
            "id": "gs1r9ww",
            "parent_id": "t1_gs1inb9",
            "score": 7,
            "created_utc": 1616594214.0,
            "replies": []
        },
        {
            "body": "imo, KHD would still be less popular now even if the tax scandal didn’t happen. I think his style just isn’t appealing to people anymore. Even in Knowing Brothers, the punchlines about him still focus on “hierarchy/seniority”. I do think a lot of the guests’ Star King accusations are exaggerated, but has a little bit of truth in them. Now I notice that he’s more ok with being the punching-bag of jokes, which makes him more approachable unlike in his Star King days",
            "author": "Cjvxcii",
            "id": "gs4xmm1",
            "parent_id": "t1_gs1inb9",
            "score": 2,
            "created_utc": 1616647217.0,
            "replies": []
        },
        {
            "body": "what happened with KHD?",
            "author": "kiwibirdd7",
            "id": "gs1wlb2",
            "parent_id": "t1_gs1inb9",
            "score": 1,
            "created_utc": 1616596595.0,
            "replies": [
                {
                    "body": "In 2011, KHD was accused of tax evasion, something which proved to be false due to a mistake by his agency's accountants. His reputation took a hit for a while, and after a short hiatus in 2011-2012, he started to change his hosting style to the one we are seeing now.  \n\n\nThere's an old thread in k/variety reddit discussing his changed hosting style - [https://www.reddit.com/r/koreanvariety/comments/8mhpno/dissing\\_kang\\_ho\\_dong/](https://www.reddit.com/r/koreanvariety/comments/8mhpno/dissing_kang_ho_dong/)",
                    "author": "koki_2706",
                    "id": "gs1yc2j",
                    "parent_id": "t1_gs1wlb2",
                    "score": 7,
                    "created_utc": 1616597353.0,
                    "replies": []
                },
                {
                    "body": "Same question, I hope they can answer.",
                    "author": "Trick_Literature_",
                    "id": "gs1yis6",
                    "parent_id": "t1_gs1wlb2",
                    "score": 1,
                    "created_utc": 1616597435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And he seems like a genuinely nice guy on and off the camera.  I forget if RM or IC but there were a couple of hidden camera situations, one where they put an old lady struggling with groceries to see what each member would do and YJS had one of his assistants drive her home!  Another was a speeding car in a narrow street as members walk with a female assistant and YJS naturally pulled her away so that he was more exposed to the danger.  Love this guy.",
            "author": "iruvit",
            "id": "gs2nk3z",
            "parent_id": "t1_gs1qsm8",
            "score": 29,
            "created_utc": 1616607929.0,
            "replies": []
        },
        {
            "body": "He also quitted smoking after he join infinite challenge. He used to smoke a lot",
            "author": "meklavier",
            "id": "gs4q6j5",
            "parent_id": "t1_gs1qsm8",
            "score": 5,
            "created_utc": 1616642521.0,
            "replies": []
        },
        {
            "body": "Went to watch the video clip again. I guess I agree his nipples are a bit low as mentioned in this week episode. 😅",
            "author": "mitchytan92",
            "id": "gs2gt8l",
            "parent_id": "t1_gs1pgjy",
            "score": 8,
            "created_utc": 1616605087.0,
            "replies": [
                {
                    "body": "Wait where do i watch this clip?",
                    "author": "lolipoppss",
                    "id": "gs2s3b2",
                    "parent_id": "t1_gs2gt8l",
                    "score": 1,
                    "created_utc": 1616609851.0,
                    "replies": [
                        {
                            "body": "https://youtu.be/miQsv1QuDP8\n\nAs an added bonus, hear JSJs famous \"I Swear!\"",
                            "author": "dadarsotero",
                            "id": "gs3g4bw",
                            "parent_id": "t1_gs2s3b2",
                            "score": 5,
                            "created_utc": 1616619900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the reminder. 😂",
            "author": "dadarsotero",
            "id": "gs2179z",
            "parent_id": "t1_gs1pgjy",
            "score": 4,
            "created_utc": 1616598580.0,
            "replies": []
        },
        {
            "body": "I think there are definitely entertainers who have more shows than YJS (Jun Hyun Moo has a lot of shows for example) but no one comes close to Jaesuk for the longevity and popularity of all his shows domestically and internationally. He’s got a good mix of quality + quantity.",
            "author": "zaichii",
            "id": "gs1pc8g",
            "parent_id": "t1_gs14uff",
            "score": 52,
            "created_utc": 1616593305.0,
            "replies": [
                {
                    "body": "Yup, I forgot about Jun Hyun Moo - he seems to be everywhere as well.",
                    "author": "koki_2706",
                    "id": "gs1r910",
                    "parent_id": "t1_gs1pc8g",
                    "score": 1,
                    "created_utc": 1616594202.0,
                    "replies": [
                        {
                            "body": "If we consider YJS and KHD as S tiers based on the longevity of their fame and popularity, then there are plenty of entertainers who are A tier and actually have a lot of shows because they’re more affordable tbh, though they’re either not as internationally famous or they’re in one or two big shows and the rest are like not as famous. Lee Sang Min is apparently in 5 shows but probably only MUD and Knowing Brothers is more known. Jang Sung Kyu was also in a lot of shows when he broke out too. Kim Sook is also in a lot of shows that did well domestically which was what helped her win the Daesang (boss in the mirror, problem child in the house) but I feel those aren’t internationally popular.",
                            "author": "zaichii",
                            "id": "gs1sbh9",
                            "parent_id": "t1_gs1r910",
                            "score": 7,
                            "created_utc": 1616594688.0,
                            "replies": [
                                {
                                    "body": "KHD was an S tier before his tax evasion scandals in 2011. not sure if you can still consider him an S tier becuase he's not on any mainstream channels - KBS, SBS, MBC - but only on cable channels like tvn, jtbc, some nature channels, etc. he's more close to a borderline A/B tier celebrity now.",
                                    "author": "numberforty",
                                    "id": "gs2p4ye",
                                    "parent_id": "t1_gs1sbh9",
                                    "score": 8,
                                    "created_utc": 1616608594.0,
                                    "replies": [
                                        {
                                            "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
                                            "author": "zaichii",
                                            "id": "gs3ff3f",
                                            "parent_id": "t1_gs2p4ye",
                                            "score": 2,
                                            "created_utc": 1616619599.0,
                                            "replies": [
                                                {
                                                    "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                                                    "author": "taylorsanatomy13_",
                                                    "id": "hqv6bpn",
                                                    "parent_id": "t1_gs3ff3f",
                                                    "score": 1,
                                                    "created_utc": 1641079651.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And all of them are so successful. But I guess it’s successful because of his name brand as well. You’d tune in to watch something with YJS in it. \n\nFrom comments made by the cast and production staff over time, he seems to be someone very meticulous when it comes to his craft. I remember one of the pd saying that he called YJS to share with him the happy news that one of their episodes hit a really high viewer rating and YJS in turn discussed with him for about 2 hours on how they could improve the planning of the program lmao. The hardest working man on television, my lazy ass could never.",
            "author": "swearyirishman",
            "id": "gs1udur",
            "parent_id": "t1_gs14uff",
            "score": 17,
            "created_utc": 1616595625.0,
            "replies": []
        },
        {
            "body": "And now Netflix too",
            "author": "iRelapse",
            "id": "gs37ieg",
            "parent_id": "t1_gs14uff",
            "score": 3,
            "created_utc": 1616616253.0,
            "replies": []
        },
        {
            "body": "YJS was amazing on Family Outing!",
            "author": "takeheadedof",
            "id": "gs21nif",
            "parent_id": "t1_gs140go",
            "score": 6,
            "created_utc": 1616598770.0,
            "replies": [
                {
                    "body": "YJS was amazing on family outing but let's also not forget about Hyori and KJK who carried the show just as much.",
                    "author": "numberforty",
                    "id": "gs2u6oz",
                    "parent_id": "t1_gs21nif",
                    "score": 5,
                    "created_utc": 1616610735.0,
                    "replies": [
                        {
                            "body": "Oh for sure! And Chunderlla and his \"step-mom\". Daesung and KJK were great together, too! Season 1 has a special place in my heart!",
                            "author": "takeheadedof",
                            "id": "gs2uj9q",
                            "parent_id": "t1_gs2u6oz",
                            "score": 3,
                            "created_utc": 1616610881.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When I was a kid my sister love Asian horror movie very much.. right after I started to watch RM, deja vu kick in, like I've seen her (SJH) in some 2000' movie before.. and my mind blown when I realized that girl in Wishing Stairs is SJH.. lol",
            "author": null,
            "id": "gs1p8qe",
            "parent_id": "t1_gs140go",
            "score": 4,
            "created_utc": 1616593258.0,
            "replies": [
                {
                    "body": "The mindblow happened to me when my sister rewatched Princess Hours (Goong). She acted as the love rival, opposite of Yoon Eunhye.",
                    "author": "Trick_Literature_",
                    "id": "gs1yawu",
                    "parent_id": "t1_gs1p8qe",
                    "score": 3,
                    "created_utc": 1616597339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I still haven’t accepted it’s not on anymore.",
            "author": "Mitchtwiz",
            "id": "gs1pi0b",
            "parent_id": "t1_gs1fcy5",
            "score": 3,
            "created_utc": 1616593382.0,
            "replies": [
                {
                    "body": "hangout with yoo is basically infinite challenge without the other side kicks. it got to a point where they couldn't do any new challenges worth watching because many were out of shape and/or dealing with physical changes due to their aging (mainly park myung soo and jung jun ha). tae-ho pd could've shaken up the roster but he knew things wouldn't be the same if he kicked off some and kept others so he had no choice but to terminate it and start over with only YJS. as much as i loved infinite challenge and how sad i was over it ending, i'm happy tae-ho pd did what he did to start over. now he's able to utilize resources that wouldve been spent on side kicks for more bold and daring challenges (ssak-3 and refund sisters for example were one of the greatest projects of 2020)",
                    "author": "numberforty",
                    "id": "gs2rxeo",
                    "parent_id": "t1_gs1pi0b",
                    "score": 8,
                    "created_utc": 1616609781.0,
                    "replies": [
                        {
                            "body": "Yeah love Hangout with Yoo SSAK3 and Refund Sisters were massive last year. Also enjoy him in 6th Sense and Happy Together when it was about.",
                            "author": "Mitchtwiz",
                            "id": "gs2tvqw",
                            "parent_id": "t1_gs2rxeo",
                            "score": 5,
                            "created_utc": 1616610609.0,
                            "replies": [
                                {
                                    "body": "most definitely. i can't wait for the new seasons for both. just praying YJS will be back for Happy Together if it hasn't been confirmed already.",
                                    "author": "numberforty",
                                    "id": "gs2v58d",
                                    "parent_id": "t1_gs2tvqw",
                                    "score": 1,
                                    "created_utc": 1616611138.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "if you google \"family outing streaming\" you'll find lots of illegal streaming places with subtitles that i'm not going to link here\n\nunfortunately there are no legal streaming options, it's too old for streaming services to care",
            "author": "echo-256",
            "id": "gs1k8uh",
            "parent_id": "t1_gs1hcwd",
            "score": 4,
            "created_utc": 1616590721.0,
            "replies": []
        },
        {
            "body": "Just PMed you",
            "author": "Mitchtwiz",
            "id": "gs1pc33",
            "parent_id": "t1_gs1hcwd",
            "score": 1,
            "created_utc": 1616593303.0,
            "replies": []
        },
        {
            "body": "Not only so, he has constantly ranked first in popularity surveys before BTS & IU, as shown in this thread here  - [https://www.reddit.com/r/runningman/comments/jzb5qf/yu\\_jae\\_seok\\_once\\_again\\_ranked\\_as\\_most\\_popular/](https://www.reddit.com/r/runningman/comments/jzb5qf/yu_jae_seok_once_again_ranked_as_most_popular/)",
            "author": "koki_2706",
            "id": "gs14hwy",
            "parent_id": "t1_gs133em",
            "score": 16,
            "created_utc": 1616579197.0,
            "replies": [
                {
                    "body": "I’m a BTS stan and even I’d be more tempted to meet YJS than them, he’s got the best vibe to him and knows how to make a person feel comfortable whilst also keeping them engaged.",
                    "author": "real_highlight_reel",
                    "id": "gs19jw3",
                    "parent_id": "t1_gs14hwy",
                    "score": 22,
                    "created_utc": 1616583778.0,
                    "replies": [
                        {
                            "body": "In this case, I strongly recommend you to watch the latest 2 episodes of Hangout with Yoo (84 and 85) if you haven't watched it. The humble way which he treats people really shows his authentic side.",
                            "author": "koki_2706",
                            "id": "gs1bxf5",
                            "parent_id": "t1_gs19jw3",
                            "score": 5,
                            "created_utc": 1616585575.0,
                            "replies": [
                                {
                                    "body": "I’ve never watched korean variety other than RM. I just watched both episodes. YJS really is a nice and down-to-earth. I mean, he successfully taught the aunty how to ride a bike! He even took photos of the steak out of courtesy. Thank you!!! u/koki_2706",
                                    "author": "Cousin_Carl",
                                    "id": "gsa9g3g",
                                    "parent_id": "t1_gs1bxf5",
                                    "score": 3,
                                    "created_utc": 1616762377.0,
                                    "replies": []
                                },
                                {
                                    "body": "Is this the same show as Yoo Quiz on the Block? I saw the preview with BTS as the guests, it supposedly aired today (haven't watch it yet)",
                                    "author": "dindillap",
                                    "id": "gs1t8d5",
                                    "parent_id": "t1_gs1bxf5",
                                    "score": 1,
                                    "created_utc": 1616595108.0,
                                    "replies": [
                                        {
                                            "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
                                            "author": "koki_2706",
                                            "id": "gs1uydv",
                                            "parent_id": "t1_gs1t8d5",
                                            "score": 2,
                                            "created_utc": 1616595877.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yea I think I'll be way more starstruck meeting YJS than BTS haha",
                            "author": "justahalfling",
                            "id": "gs1hgoo",
                            "parent_id": "t1_gs19jw3",
                            "score": 4,
                            "created_utc": 1616589164.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In 2011, KHD was accused of tax evasion, something which proved to be false due to a mistake by his agency's accountants. His reputation took a hit for a while, and after a short hiatus in 2011-2012, he started to change his hosting style to the one we are seeing now.  \n\n\nThere's an old thread in k/variety reddit discussing his changed hosting style - [https://www.reddit.com/r/koreanvariety/comments/8mhpno/dissing\\_kang\\_ho\\_dong/](https://www.reddit.com/r/koreanvariety/comments/8mhpno/dissing_kang_ho_dong/)",
            "author": "koki_2706",
            "id": "gs1yc2j",
            "parent_id": "t1_gs1wlb2",
            "score": 7,
            "created_utc": 1616597353.0,
            "replies": []
        },
        {
            "body": "Same question, I hope they can answer.",
            "author": "Trick_Literature_",
            "id": "gs1yis6",
            "parent_id": "t1_gs1wlb2",
            "score": 1,
            "created_utc": 1616597435.0,
            "replies": []
        },
        {
            "body": "Wait where do i watch this clip?",
            "author": "lolipoppss",
            "id": "gs2s3b2",
            "parent_id": "t1_gs2gt8l",
            "score": 1,
            "created_utc": 1616609851.0,
            "replies": [
                {
                    "body": "https://youtu.be/miQsv1QuDP8\n\nAs an added bonus, hear JSJs famous \"I Swear!\"",
                    "author": "dadarsotero",
                    "id": "gs3g4bw",
                    "parent_id": "t1_gs2s3b2",
                    "score": 5,
                    "created_utc": 1616619900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup, I forgot about Jun Hyun Moo - he seems to be everywhere as well.",
            "author": "koki_2706",
            "id": "gs1r910",
            "parent_id": "t1_gs1pc8g",
            "score": 1,
            "created_utc": 1616594202.0,
            "replies": [
                {
                    "body": "If we consider YJS and KHD as S tiers based on the longevity of their fame and popularity, then there are plenty of entertainers who are A tier and actually have a lot of shows because they’re more affordable tbh, though they’re either not as internationally famous or they’re in one or two big shows and the rest are like not as famous. Lee Sang Min is apparently in 5 shows but probably only MUD and Knowing Brothers is more known. Jang Sung Kyu was also in a lot of shows when he broke out too. Kim Sook is also in a lot of shows that did well domestically which was what helped her win the Daesang (boss in the mirror, problem child in the house) but I feel those aren’t internationally popular.",
                    "author": "zaichii",
                    "id": "gs1sbh9",
                    "parent_id": "t1_gs1r910",
                    "score": 7,
                    "created_utc": 1616594688.0,
                    "replies": [
                        {
                            "body": "KHD was an S tier before his tax evasion scandals in 2011. not sure if you can still consider him an S tier becuase he's not on any mainstream channels - KBS, SBS, MBC - but only on cable channels like tvn, jtbc, some nature channels, etc. he's more close to a borderline A/B tier celebrity now.",
                            "author": "numberforty",
                            "id": "gs2p4ye",
                            "parent_id": "t1_gs1sbh9",
                            "score": 8,
                            "created_utc": 1616608594.0,
                            "replies": [
                                {
                                    "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
                                    "author": "zaichii",
                                    "id": "gs3ff3f",
                                    "parent_id": "t1_gs2p4ye",
                                    "score": 2,
                                    "created_utc": 1616619599.0,
                                    "replies": [
                                        {
                                            "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                                            "author": "taylorsanatomy13_",
                                            "id": "hqv6bpn",
                                            "parent_id": "t1_gs3ff3f",
                                            "score": 1,
                                            "created_utc": 1641079651.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "YJS was amazing on family outing but let's also not forget about Hyori and KJK who carried the show just as much.",
            "author": "numberforty",
            "id": "gs2u6oz",
            "parent_id": "t1_gs21nif",
            "score": 5,
            "created_utc": 1616610735.0,
            "replies": [
                {
                    "body": "Oh for sure! And Chunderlla and his \"step-mom\". Daesung and KJK were great together, too! Season 1 has a special place in my heart!",
                    "author": "takeheadedof",
                    "id": "gs2uj9q",
                    "parent_id": "t1_gs2u6oz",
                    "score": 3,
                    "created_utc": 1616610881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The mindblow happened to me when my sister rewatched Princess Hours (Goong). She acted as the love rival, opposite of Yoon Eunhye.",
            "author": "Trick_Literature_",
            "id": "gs1yawu",
            "parent_id": "t1_gs1p8qe",
            "score": 3,
            "created_utc": 1616597339.0,
            "replies": []
        },
        {
            "body": "hangout with yoo is basically infinite challenge without the other side kicks. it got to a point where they couldn't do any new challenges worth watching because many were out of shape and/or dealing with physical changes due to their aging (mainly park myung soo and jung jun ha). tae-ho pd could've shaken up the roster but he knew things wouldn't be the same if he kicked off some and kept others so he had no choice but to terminate it and start over with only YJS. as much as i loved infinite challenge and how sad i was over it ending, i'm happy tae-ho pd did what he did to start over. now he's able to utilize resources that wouldve been spent on side kicks for more bold and daring challenges (ssak-3 and refund sisters for example were one of the greatest projects of 2020)",
            "author": "numberforty",
            "id": "gs2rxeo",
            "parent_id": "t1_gs1pi0b",
            "score": 8,
            "created_utc": 1616609781.0,
            "replies": [
                {
                    "body": "Yeah love Hangout with Yoo SSAK3 and Refund Sisters were massive last year. Also enjoy him in 6th Sense and Happy Together when it was about.",
                    "author": "Mitchtwiz",
                    "id": "gs2tvqw",
                    "parent_id": "t1_gs2rxeo",
                    "score": 5,
                    "created_utc": 1616610609.0,
                    "replies": [
                        {
                            "body": "most definitely. i can't wait for the new seasons for both. just praying YJS will be back for Happy Together if it hasn't been confirmed already.",
                            "author": "numberforty",
                            "id": "gs2v58d",
                            "parent_id": "t1_gs2tvqw",
                            "score": 1,
                            "created_utc": 1616611138.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m a BTS stan and even I’d be more tempted to meet YJS than them, he’s got the best vibe to him and knows how to make a person feel comfortable whilst also keeping them engaged.",
            "author": "real_highlight_reel",
            "id": "gs19jw3",
            "parent_id": "t1_gs14hwy",
            "score": 22,
            "created_utc": 1616583778.0,
            "replies": [
                {
                    "body": "In this case, I strongly recommend you to watch the latest 2 episodes of Hangout with Yoo (84 and 85) if you haven't watched it. The humble way which he treats people really shows his authentic side.",
                    "author": "koki_2706",
                    "id": "gs1bxf5",
                    "parent_id": "t1_gs19jw3",
                    "score": 5,
                    "created_utc": 1616585575.0,
                    "replies": [
                        {
                            "body": "I’ve never watched korean variety other than RM. I just watched both episodes. YJS really is a nice and down-to-earth. I mean, he successfully taught the aunty how to ride a bike! He even took photos of the steak out of courtesy. Thank you!!! u/koki_2706",
                            "author": "Cousin_Carl",
                            "id": "gsa9g3g",
                            "parent_id": "t1_gs1bxf5",
                            "score": 3,
                            "created_utc": 1616762377.0,
                            "replies": []
                        },
                        {
                            "body": "Is this the same show as Yoo Quiz on the Block? I saw the preview with BTS as the guests, it supposedly aired today (haven't watch it yet)",
                            "author": "dindillap",
                            "id": "gs1t8d5",
                            "parent_id": "t1_gs1bxf5",
                            "score": 1,
                            "created_utc": 1616595108.0,
                            "replies": [
                                {
                                    "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
                                    "author": "koki_2706",
                                    "id": "gs1uydv",
                                    "parent_id": "t1_gs1t8d5",
                                    "score": 2,
                                    "created_utc": 1616595877.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yea I think I'll be way more starstruck meeting YJS than BTS haha",
                    "author": "justahalfling",
                    "id": "gs1hgoo",
                    "parent_id": "t1_gs19jw3",
                    "score": 4,
                    "created_utc": 1616589164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "https://youtu.be/miQsv1QuDP8\n\nAs an added bonus, hear JSJs famous \"I Swear!\"",
            "author": "dadarsotero",
            "id": "gs3g4bw",
            "parent_id": "t1_gs2s3b2",
            "score": 5,
            "created_utc": 1616619900.0,
            "replies": []
        },
        {
            "body": "If we consider YJS and KHD as S tiers based on the longevity of their fame and popularity, then there are plenty of entertainers who are A tier and actually have a lot of shows because they’re more affordable tbh, though they’re either not as internationally famous or they’re in one or two big shows and the rest are like not as famous. Lee Sang Min is apparently in 5 shows but probably only MUD and Knowing Brothers is more known. Jang Sung Kyu was also in a lot of shows when he broke out too. Kim Sook is also in a lot of shows that did well domestically which was what helped her win the Daesang (boss in the mirror, problem child in the house) but I feel those aren’t internationally popular.",
            "author": "zaichii",
            "id": "gs1sbh9",
            "parent_id": "t1_gs1r910",
            "score": 7,
            "created_utc": 1616594688.0,
            "replies": [
                {
                    "body": "KHD was an S tier before his tax evasion scandals in 2011. not sure if you can still consider him an S tier becuase he's not on any mainstream channels - KBS, SBS, MBC - but only on cable channels like tvn, jtbc, some nature channels, etc. he's more close to a borderline A/B tier celebrity now.",
                    "author": "numberforty",
                    "id": "gs2p4ye",
                    "parent_id": "t1_gs1sbh9",
                    "score": 8,
                    "created_utc": 1616608594.0,
                    "replies": [
                        {
                            "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
                            "author": "zaichii",
                            "id": "gs3ff3f",
                            "parent_id": "t1_gs2p4ye",
                            "score": 2,
                            "created_utc": 1616619599.0,
                            "replies": [
                                {
                                    "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                                    "author": "taylorsanatomy13_",
                                    "id": "hqv6bpn",
                                    "parent_id": "t1_gs3ff3f",
                                    "score": 1,
                                    "created_utc": 1641079651.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh for sure! And Chunderlla and his \"step-mom\". Daesung and KJK were great together, too! Season 1 has a special place in my heart!",
            "author": "takeheadedof",
            "id": "gs2uj9q",
            "parent_id": "t1_gs2u6oz",
            "score": 3,
            "created_utc": 1616610881.0,
            "replies": []
        },
        {
            "body": "Yeah love Hangout with Yoo SSAK3 and Refund Sisters were massive last year. Also enjoy him in 6th Sense and Happy Together when it was about.",
            "author": "Mitchtwiz",
            "id": "gs2tvqw",
            "parent_id": "t1_gs2rxeo",
            "score": 5,
            "created_utc": 1616610609.0,
            "replies": [
                {
                    "body": "most definitely. i can't wait for the new seasons for both. just praying YJS will be back for Happy Together if it hasn't been confirmed already.",
                    "author": "numberforty",
                    "id": "gs2v58d",
                    "parent_id": "t1_gs2tvqw",
                    "score": 1,
                    "created_utc": 1616611138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In this case, I strongly recommend you to watch the latest 2 episodes of Hangout with Yoo (84 and 85) if you haven't watched it. The humble way which he treats people really shows his authentic side.",
            "author": "koki_2706",
            "id": "gs1bxf5",
            "parent_id": "t1_gs19jw3",
            "score": 5,
            "created_utc": 1616585575.0,
            "replies": [
                {
                    "body": "I’ve never watched korean variety other than RM. I just watched both episodes. YJS really is a nice and down-to-earth. I mean, he successfully taught the aunty how to ride a bike! He even took photos of the steak out of courtesy. Thank you!!! u/koki_2706",
                    "author": "Cousin_Carl",
                    "id": "gsa9g3g",
                    "parent_id": "t1_gs1bxf5",
                    "score": 3,
                    "created_utc": 1616762377.0,
                    "replies": []
                },
                {
                    "body": "Is this the same show as Yoo Quiz on the Block? I saw the preview with BTS as the guests, it supposedly aired today (haven't watch it yet)",
                    "author": "dindillap",
                    "id": "gs1t8d5",
                    "parent_id": "t1_gs1bxf5",
                    "score": 1,
                    "created_utc": 1616595108.0,
                    "replies": [
                        {
                            "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
                            "author": "koki_2706",
                            "id": "gs1uydv",
                            "parent_id": "t1_gs1t8d5",
                            "score": 2,
                            "created_utc": 1616595877.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yea I think I'll be way more starstruck meeting YJS than BTS haha",
            "author": "justahalfling",
            "id": "gs1hgoo",
            "parent_id": "t1_gs19jw3",
            "score": 4,
            "created_utc": 1616589164.0,
            "replies": []
        },
        {
            "body": "KHD was an S tier before his tax evasion scandals in 2011. not sure if you can still consider him an S tier becuase he's not on any mainstream channels - KBS, SBS, MBC - but only on cable channels like tvn, jtbc, some nature channels, etc. he's more close to a borderline A/B tier celebrity now.",
            "author": "numberforty",
            "id": "gs2p4ye",
            "parent_id": "t1_gs1sbh9",
            "score": 8,
            "created_utc": 1616608594.0,
            "replies": [
                {
                    "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
                    "author": "zaichii",
                    "id": "gs3ff3f",
                    "parent_id": "t1_gs2p4ye",
                    "score": 2,
                    "created_utc": 1616619599.0,
                    "replies": [
                        {
                            "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                            "author": "taylorsanatomy13_",
                            "id": "hqv6bpn",
                            "parent_id": "t1_gs3ff3f",
                            "score": 1,
                            "created_utc": 1641079651.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "most definitely. i can't wait for the new seasons for both. just praying YJS will be back for Happy Together if it hasn't been confirmed already.",
            "author": "numberforty",
            "id": "gs2v58d",
            "parent_id": "t1_gs2tvqw",
            "score": 1,
            "created_utc": 1616611138.0,
            "replies": []
        },
        {
            "body": "I’ve never watched korean variety other than RM. I just watched both episodes. YJS really is a nice and down-to-earth. I mean, he successfully taught the aunty how to ride a bike! He even took photos of the steak out of courtesy. Thank you!!! u/koki_2706",
            "author": "Cousin_Carl",
            "id": "gsa9g3g",
            "parent_id": "t1_gs1bxf5",
            "score": 3,
            "created_utc": 1616762377.0,
            "replies": []
        },
        {
            "body": "Is this the same show as Yoo Quiz on the Block? I saw the preview with BTS as the guests, it supposedly aired today (haven't watch it yet)",
            "author": "dindillap",
            "id": "gs1t8d5",
            "parent_id": "t1_gs1bxf5",
            "score": 1,
            "created_utc": 1616595108.0,
            "replies": [
                {
                    "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
                    "author": "koki_2706",
                    "id": "gs1uydv",
                    "parent_id": "t1_gs1t8d5",
                    "score": 2,
                    "created_utc": 1616595877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah definitely not at the same level of fame/peak but I guess he's the only other person really considered/achieved or using the \"nation MC title\"",
            "author": "zaichii",
            "id": "gs3ff3f",
            "parent_id": "t1_gs2p4ye",
            "score": 2,
            "created_utc": 1616619599.0,
            "replies": [
                {
                    "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
                    "author": "taylorsanatomy13_",
                    "id": "hqv6bpn",
                    "parent_id": "t1_gs3ff3f",
                    "score": 1,
                    "created_utc": 1641079651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope, Hangout with Yoo is an MBC show while Yoo Quiz on the Block is from TvN (cable tv). As far as I know, Yoo Quiz is not available officially where I live (SEA).",
            "author": "koki_2706",
            "id": "gs1uydv",
            "parent_id": "t1_gs1t8d5",
            "score": 2,
            "created_utc": 1616595877.0,
            "replies": []
        },
        {
            "body": "lmao big fan of KHD, too but others considering him at YJS’s level is a stretch. sure, he’s popular but YJS spent his life building a formula of career, talent, image, and grit just for KHD, a retired athlete, be considered his equal. but I guess, no one could come as close to KHD.",
            "author": "taylorsanatomy13_",
            "id": "hqv6bpn",
            "parent_id": "t1_gs3ff3f",
            "score": 1,
            "created_utc": 1641079651.0,
            "replies": []
        }
    ]
}