{
    "title": "Treat him like a John? He’ll be a John. Treat her like an escort? She’ll be an escort.",
    "post_id": "va565z",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/va565z/treat_him_like_a_john_hell_be_a_john_treat_her/",
    "author": "bubblerush",
    "body": "Listen, if you’re a SB and you’re sending messages like “my rate is xxx per hour” you’re going to attract Johns, plain and simple. You won’t be able to find a genuine connection with someone who wants to support you because they care about you. \n\nIn the reverse, if you’re a SD and your attitude is “dinner and hotel for 5 hours for xxx, no extra gifts” the SB you end up with isn’t going to view you as anything more than an ATM, because you’re acting like an ATM. \n\nDon’t come on here and complain that the SB/SD you’re seeing isn’t treating you right, when you’re not treating them right either. That’s not how this works. If you’re both in it because you care for the other person, you care about their well-being, and you enjoy your time with them, then you can find really great sugar relationships. If either of you are treating it like a John/Escort thing, that’s what it’ll feel like, that’s what it’ll be. There’s nothing wrong with escorting! But if that’s not the relationship you’re looking for, be careful with how you treat your partner.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/va565z/treat_him_like_a_john_hell_be_a_john_treat_her/",
    "score": 116,
    "upvote_ratio": 0.9,
    "created_utc": 1654977191.0,
    "num_comments": 57,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I agree with this. You catch the fish you bait your line for. If you act like a john/\nescort, you will only find johns/escorts. It's easy to convince yourself that everyone sugar dates the same way you do, but that isn't the case.",
            "author": "willfromvb",
            "id": "ic0m1ck",
            "parent_id": "t3_va565z",
            "score": 11,
            "created_utc": 1654982211.0,
            "replies": []
        },
        {
            "body": "Yep. \n\nGonna put these two comments in the same place. [This awesome man behavior](https://www.reddit.com/r/sugarlifestyleforum/comments/v73pkj/how_does_your_sd_take_care_of_you/ibj95pu/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) and [this behavior on my part](https://www.reddit.com/r/sugarlifestyleforum/comments/v80mm9/you_have_to_either_be_a_model_or_an_extrovert_to/ibnrygk/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) exist together. \n\nYou get back what you put out into the world.",
            "author": null,
            "id": "ic11yot",
            "parent_id": "t3_va565z",
            "score": 7,
            "created_utc": 1654990468.0,
            "replies": []
        },
        {
            "body": "I think the whole thing starts at the texting and m&g stage - the seeds you sow then generally produce the outcome you desire \n\nIn my experience those who communicated callously, weren’t punctual or respectful of your time and attention during the initial stage never ended up working out, no matter how otherwise attractive",
            "author": "OCbird22",
            "id": "ic15xjz",
            "parent_id": "t3_va565z",
            "score": 6,
            "created_utc": 1654992592.0,
            "replies": []
        },
        {
            "body": "100% agree.  This is the problem right now on SA too many folks mis matched expectations.\n\nA SR is very much a relationship it requires trust, commitment and showing up.  Without that it just becomes as the OP says - dark and murky attracting the wrong type of people to you",
            "author": "Jonconnerysd",
            "id": "ic2v522",
            "parent_id": "t3_va565z",
            "score": 5,
            "created_utc": 1655035496.0,
            "replies": []
        },
        {
            "body": "And to those who treat an SB like a queen but is treated in return like a John - ish. Or the SBs who treat their SDs really well but in return are not treated well. What do you to that.?\n\nBecause truth be told more of my SRs I have given gifts, paid multiple months of rent, taken on trips, talk/text as much as they want, take them to nice places , spa days etc and yet…… but I don’t get the same in return which is why I end them. That’s been my experience. Which is why I am taking a break. \n\nI wish I could find people who say what they mean and do what they say. But seems that is nowadays an impossible ask.",
            "author": "thereadinessisall",
            "id": "ic0cnfm",
            "parent_id": "t3_va565z",
            "score": 14,
            "created_utc": 1654977548.0,
            "replies": [
                {
                    "body": ">\tAnd to those who treat an SB like a queen but is treated in return like a John - ish. Or the SBs who treat their SDs really well but in return are not treated well. What do you to that.?\n\nSame thing you do in a vanilla relationship when you feel there’s an inequitable distribution of love and care and effort.\n\nYou have the hard conversation or you find a new partner.",
                    "author": "j19104",
                    "id": "ic0dr3x",
                    "parent_id": "t1_ic0cnfm",
                    "score": 28,
                    "created_utc": 1654978077.0,
                    "replies": [
                        {
                            "body": "AKA, handle it like an adult.",
                            "author": "Y_4Z44",
                            "id": "ic0sgbm",
                            "parent_id": "t1_ic0dr3x",
                            "score": 12,
                            "created_utc": 1654985492.0,
                            "replies": []
                        },
                        {
                            "body": "Yes 100%",
                            "author": "bubblerush",
                            "id": "ic0edtt",
                            "parent_id": "t1_ic0dr3x",
                            "score": 4,
                            "created_utc": 1654978392.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If you tolerate that behavior, you’ll continue to serve in that role.",
                    "author": "garret6758",
                    "id": "ic0jdx6",
                    "parent_id": "t1_ic0cnfm",
                    "score": 10,
                    "created_utc": 1654980862.0,
                    "replies": [
                        {
                            "body": "I don’t tolerate that. But one does it and I move on. Next does it and I move on. People present all committed and then slowly stop honoring the arrangement. Happens on both sides I feel.",
                            "author": "thereadinessisall",
                            "id": "ic0juo3",
                            "parent_id": "t1_ic0jdx6",
                            "score": 4,
                            "created_utc": 1654981102.0,
                            "replies": [
                                {
                                    "body": "I'm sorry for saying that but that's because of you. You choose this type of girls. You allow this to happen. Sounds like it happens systematically to you. Do something, change yourself.",
                                    "author": "SeekingInSydney",
                                    "id": "ic9anrl",
                                    "parent_id": "t1_ic0juo3",
                                    "score": 1,
                                    "created_utc": 1655158751.0,
                                    "replies": [
                                        {
                                            "body": "yes - so from now on I'll be a dick, won't show care, won't spoil, won't gift, won't trip, won't trust, etc -- that seems to be my option.... not a great one at that....",
                                            "author": "thereadinessisall",
                                            "id": "ic9azqi",
                                            "parent_id": "t1_ic9anrl",
                                            "score": 1,
                                            "created_utc": 1655158878.0,
                                            "replies": [
                                                {
                                                    "body": "No mate, that's not the way to go. It'll only multiply amount of shit in this word. Please grow above that, and establish another attitude to vibe with \\_another\\_ type.\n\nAnd hey, I hear you. Just now I've been through the same situation. I know, it sucks. Anyway, please don't come to dark side.",
                                                    "author": "SeekingInSydney",
                                                    "id": "ic9bh3n",
                                                    "parent_id": "t1_ic9azqi",
                                                    "score": 2,
                                                    "created_utc": 1655159095.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wish I knew what my SD wanted. I go out of my way to express gratitude but sometimes question what more I can do that is still appropriate given our arrangement. I think we could all benefit from being more direct about what we want from our partner.",
                    "author": "MJline",
                    "id": "ic1e2tg",
                    "parent_id": "t1_ic0cnfm",
                    "score": 4,
                    "created_utc": 1654997028.0,
                    "replies": []
                },
                {
                    "body": "What do you expect in return, just curious.",
                    "author": null,
                    "id": "ic0kr8v",
                    "parent_id": "t1_ic0cnfm",
                    "score": 3,
                    "created_utc": 1654981561.0,
                    "replies": [
                        {
                            "body": "Nothing out of the ordinary. An actual focused thank you, a verbal show of appreciation (“this really helped me out and thank you so for this” “or that was so much fun it made me feel so good to get that from you - thank you for that”) - my love language is touch and I express that to my partners - so curling up and snuggling is a great way for me to feel appreciated. \n\nBut I am amazed how many people have such a hard time saying a genuine and authentic Expression of gratitude or appreciation and value.",
                            "author": "thereadinessisall",
                            "id": "ic6pof2",
                            "parent_id": "t1_ic0kr8v",
                            "score": 2,
                            "created_utc": 1655113719.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Unfortunately there’s a lot of that too. Which is why I said that it’ll feel like a John/Escort arrangement if EITHER partner is treating it that way.",
                    "author": "bubblerush",
                    "id": "ic0d0tw",
                    "parent_id": "t1_ic0cnfm",
                    "score": 4,
                    "created_utc": 1654977729.0,
                    "replies": [
                        {
                            "body": "I just brought that up because I think it is much more prevalent in sugar than a straight up John/escort. I think start things well and then fall off quick because either lack of appreciation and honoring the arrangement or devolving into viewing as a sex object. I could be wrong though.",
                            "author": "thereadinessisall",
                            "id": "ic0fnj1",
                            "parent_id": "t1_ic0d0tw",
                            "score": 2,
                            "created_utc": 1654979008.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> And to those who treat an SB like a queen but is treated in return like a John - ish. Or the SBs who treat their SDs really well but in return are not treated well. What do you to that.?\n\nFind a new SR?  It's really not that hard.... ?",
                    "author": "SDstartingOut",
                    "id": "ic1048w",
                    "parent_id": "t1_ic0cnfm",
                    "score": 2,
                    "created_utc": 1654989488.0,
                    "replies": []
                },
                {
                    "body": "Lmao this is why you are where you are. No one likes a whiner or a man who presents as a weakling. If you feel unappreciated, move on. If you want some girl to pretend to the extent that she’s treating you like a serious relationship, set those expectations and compensate her accordingly.",
                    "author": "Dormouse_in_a_teapot",
                    "id": "ic1qoah",
                    "parent_id": "t1_ic0cnfm",
                    "score": 2,
                    "created_utc": 1655003975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree.  I've said it on here countless times before - I always approach the allowance conversation from a monthly allowance perspective.  It sets a completely different one, and weeds out a lot of people (like, most of the escorts, who do not want a MA).",
            "author": "SDstartingOut",
            "id": "ic108we",
            "parent_id": "t3_va565z",
            "score": 7,
            "created_utc": 1654989557.0,
            "replies": [
                {
                    "body": "Everyone wants a monthly allowance. The difference is some want it only once.",
                    "author": "YlangScent",
                    "id": "ic28dss",
                    "parent_id": "t1_ic108we",
                    "score": 1,
                    "created_utc": 1655015899.0,
                    "replies": [
                        {
                            "body": "> Everyone wants a monthly allowance. The difference is some want it only once.\n\nAre you an SD that leads the conversation talking about a MA?  I\"m assuming you aren't.\n\nI am someone that does.  You are welcome to believe me/not believe me - but plenty of people push back/towards a PPM.  Either flat out, or symbolically.  (stipulating that an allowance is only prepaid PPM is the same as saying no to it).",
                            "author": "SDstartingOut",
                            "id": "ic2t5da",
                            "parent_id": "t1_ic28dss",
                            "score": 2,
                            "created_utc": 1655034130.0,
                            "replies": [
                                {
                                    "body": "I have 0 issues with it and my approach varies based on what I feel like. My single PPM typically already exceeds what most other in a month, so that's not really the point.\n\nIn my experience there is no difference in approaching things with an allowance or PPM mind set. Especially not for a SB. They will gladly take the allowance even if they don't see it working out.",
                                    "author": "YlangScent",
                                    "id": "ic6a3am",
                                    "parent_id": "t1_ic2t5da",
                                    "score": 3,
                                    "created_utc": 1655099711.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What escort is going to turn down a monthly allowance paid up front?",
                    "author": "sparky_SD16",
                    "id": "ic2sb6m",
                    "parent_id": "t1_ic108we",
                    "score": 1,
                    "created_utc": 1655033528.0,
                    "replies": [
                        {
                            "body": "> What escort is going to turn down a monthly allowance paid up front?\n\nIts all in the nuance/understanding of the conversation.\n\nI bring up an allowance.\n\nShe counters with either:\n\n1.  I only do PPM.  My number is X.\n\n2.  My PPM is X.  So an allowance of 3X would be a max of 3 dates a month.\n\nDemanding that an allowance is nothing more than prepaid meets - is the same thing as saying you don't want a monthly allowance.",
                            "author": "SDstartingOut",
                            "id": "ic2t0qg",
                            "parent_id": "t1_ic2sb6m",
                            "score": 3,
                            "created_utc": 1655034046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your network is your net worth. I wholeheartedly agree to this post. Raising standards never hurt anyone, except scammers and time wasters.",
            "author": "Creepy-Night936",
            "id": "ic2kd49",
            "parent_id": "t3_va565z",
            "score": 3,
            "created_utc": 1655026643.0,
            "replies": []
        },
        {
            "body": "More so, watch out for escort language. Don’t call your pot “hun” or “babe” off the bat",
            "author": "YakiMe",
            "id": "ic10mph",
            "parent_id": "t3_va565z",
            "score": 2,
            "created_utc": 1654989759.0,
            "replies": [
                {
                    "body": "Or “love”",
                    "author": "UnearthlyDinosaur",
                    "id": "ic1og3o",
                    "parent_id": "t1_ic10mph",
                    "score": 3,
                    "created_utc": 1655002710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can get treated like an ATM for other reasons as well one of which is if you cannot put your foot down and say \"NO\".  The key is to establish a healthy relationship of mutual respect with the right boundaries.",
            "author": null,
            "id": "ic18vhw",
            "parent_id": "t3_va565z",
            "score": 3,
            "created_utc": 1654994195.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ic1y5hl",
            "parent_id": "t3_va565z",
            "score": 3,
            "created_utc": 1655008490.0,
            "replies": [
                {
                    "body": "Wow that sucks. Idk how people are like that. I’ve always been the one being scammed I guess I forgot it’s the other way around a lot of the times.",
                    "author": null,
                    "id": "ic2c007",
                    "parent_id": "t1_ic1y5hl",
                    "score": 2,
                    "created_utc": 1655018991.0,
                    "replies": []
                },
                {
                    "body": "I love when they have no pictures showing their face and they badger me to show mine.",
                    "author": "throwawayrtyggv",
                    "id": "ic5jayk",
                    "parent_id": "t1_ic1y5hl",
                    "score": 1,
                    "created_utc": 1655083375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More and more SB are using this MO. And then complain they got scammed.",
            "author": "UnearthlyDinosaur",
            "id": "ic0h0sc",
            "parent_id": "t3_va565z",
            "score": 4,
            "created_utc": 1654979679.0,
            "replies": [
                {
                    "body": "More and more SDs are acting like johns, and then wondering why they’re getting treated as such. :)",
                    "author": "bubblerush",
                    "id": "ic0hnw1",
                    "parent_id": "t1_ic0h0sc",
                    "score": 14,
                    "created_utc": 1654979995.0,
                    "replies": [
                        {
                            "body": "Maybe they should all just find each other? \n\nNothing wrong with it…people are just looking for different things.",
                            "author": "throwawayrtyggv",
                            "id": "ic5j5uw",
                            "parent_id": "t1_ic0hnw1",
                            "score": 2,
                            "created_utc": 1655083298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love the post, thank you!",
            "author": "LaylaSB",
            "id": "ic10dti",
            "parent_id": "t3_va565z",
            "score": 2,
            "created_utc": 1654989628.0,
            "replies": []
        },
        {
            "body": "Well said... Well said...👋🏼👋🏼👋🏼👋🏼👋🏼",
            "author": "Ruddie71",
            "id": "ic10v02",
            "parent_id": "t3_va565z",
            "score": 1,
            "created_utc": 1654989876.0,
            "replies": []
        },
        {
            "body": "I think when pay for play became a thing to \"protect\" \"SD\"s this was where things were headed.",
            "author": "clownface2-0",
            "id": "ic0x628",
            "parent_id": "t3_va565z",
            "score": 0,
            "created_utc": 1654987921.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ic10jff",
                    "parent_id": "t1_ic0x628",
                    "score": 3,
                    "created_utc": 1654989709.0,
                    "replies": [
                        {
                            "body": "Scammed? In what ways?",
                            "author": "bubblerush",
                            "id": "ic1djkd",
                            "parent_id": "t1_ic10jff",
                            "score": 2,
                            "created_utc": 1654996738.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ic27gwi",
                                    "parent_id": "t1_ic1djkd",
                                    "score": 4,
                                    "created_utc": 1655015146.0,
                                    "replies": [
                                        {
                                            "body": "I really don’t like using the word “scam” when talking about sugar relationships. “I paid her to sleep with me, and she didn’t. I got scammed!” To me that sounds like escort territory. It’s a relationship, if you choose to pay your partners rent, and then they don’t want to sleep with you or they end the relationship, you’re not getting scammed. Is manipulating men for money a dick move? Yes, but it’s not a scam.",
                                            "author": "bubblerush",
                                            "id": "icd282u",
                                            "parent_id": "t1_ic27gwi",
                                            "score": 3,
                                            "created_utc": 1655232879.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "But it does protect SDs, no need for quotation marks there.",
                    "author": null,
                    "id": "ic1n9nq",
                    "parent_id": "t1_ic0x628",
                    "score": 1,
                    "created_utc": 1655002059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most SA girls these days are really just escorts.  Because they have no intentions or interest of being in a continuous relationship that requires upkeep or attentiveness.  They just wanna show up get the job done like a plumber.",
            "author": "MKTekke",
            "id": "ic0q72b",
            "parent_id": "t3_va565z",
            "score": 0,
            "created_utc": 1654984320.0,
            "replies": [
                {
                    "body": "Are you offering a generous amount of money to date and build a connection before expecting sex?",
                    "author": "clownface2-0",
                    "id": "ic0xbhi",
                    "parent_id": "t1_ic0q72b",
                    "score": 7,
                    "created_utc": 1654987998.0,
                    "replies": [
                        {
                            "body": "No amount of money can buy younger women their attentiveness.  It doesn’t give them the same dopamine effects as Instagram.  Look at women being paid 6 figures at a job still sitting on their Instagram app.",
                            "author": "MKTekke",
                            "id": "ic14vbc",
                            "parent_id": "t1_ic0xbhi",
                            "score": -2,
                            "created_utc": 1654992014.0,
                            "replies": [
                                {
                                    "body": "lol soo much to unpack.\n\nA very young person does not have a fully developed prefrontal cortex, the part of the brain involved in long term planning, delay of gratification, selective attention...the list goes on and on.\n\nThe effects of dopamine aren't gendered, and older men aren't immune either or there wouldn't be any older male addicts.  \n\nMoney can only go so far.  If you're boring and unpleasant, sure someone with an adult level of maturity can work with that in small windows for a high amount of money, but emotional labour has limits.",
                                    "author": "clownface2-0",
                                    "id": "ic1fnj3",
                                    "parent_id": "t1_ic14vbc",
                                    "score": 5,
                                    "created_utc": 1654997885.0,
                                    "replies": []
                                },
                                {
                                    "body": "This. Womens primary goal is ATTENTION.  They would rather have 100K followers than a regular five figure allowance.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "ic1ocv2",
                                    "parent_id": "t1_ic14vbc",
                                    "score": -7,
                                    "created_utc": 1655002658.0,
                                    "replies": [
                                        {
                                            "body": "I think maybe you’re generalizing too much. It has a lot to do with time, trust, and past experiences.",
                                            "author": null,
                                            "id": "ic2bvf1",
                                            "parent_id": "t1_ic1ocv2",
                                            "score": 5,
                                            "created_utc": 1655018878.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Spoken truth bomb",
                                    "author": null,
                                    "id": "ic1hzyx",
                                    "parent_id": "t1_ic14vbc",
                                    "score": -2,
                                    "created_utc": 1654999182.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This might sound harsh, but absolutely not. All that does is encourage her to go on three dates and run.",
                            "author": "throwawayrtyggv",
                            "id": "ic5jfcx",
                            "parent_id": "t1_ic0xbhi",
                            "score": 1,
                            "created_utc": 1655083443.0,
                            "replies": [
                                {
                                    "body": "But if you have that mindset: that the women you're meeting absolutely don't want to sleep with you, you have to use the money like a literal carrot/stick then why sugar.\n\nIsn't sugar supposed to have some element of authentic attraction...at the very least some positive feelings?",
                                    "author": "clownface2-0",
                                    "id": "ic86phh",
                                    "parent_id": "t1_ic5jfcx",
                                    "score": 0,
                                    "created_utc": 1655141691.0,
                                    "replies": [
                                        {
                                            "body": "I mean then I’d counter with why not date me vanilla. \n\nOne of the root reasons to sugar is to date women out of your league.",
                                            "author": "throwawayrtyggv",
                                            "id": "ic886pk",
                                            "parent_id": "t1_ic86phh",
                                            "score": 0,
                                            "created_utc": 1655142317.0,
                                            "replies": [
                                                {
                                                    "body": "I think you replied to the wrong comment.\n\nSugar is the opportunity to date someone you normally couldn't, not hold money over someone's head when you know they need it to extract sex before there is any connection, trust, attraction or comfort level.\n\nThat's not dating someone out of your league, that's something else entirely.",
                                                    "author": "clownface2-0",
                                                    "id": "icf8kkk",
                                                    "parent_id": "t1_ic886pk",
                                                    "score": 0,
                                                    "created_utc": 1655271646.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Similar kinds always end up together anyway. 🤔\nDesperate people look for and attract desperate people. A Clingy man can only last in a relationship with a woman who is also clingy.",
            "author": null,
            "id": "ic17m1o",
            "parent_id": "t3_va565z",
            "score": 0,
            "created_utc": 1654993500.0,
            "replies": []
        },
        {
            "body": "I don’t know how these people aren’t banned from SA immediately",
            "author": "s3r3n31",
            "id": "ic1ud8h",
            "parent_id": "t3_va565z",
            "score": 1,
            "created_utc": 1655006176.0,
            "replies": []
        },
        {
            "body": ">\tAnd to those who treat an SB like a queen but is treated in return like a John - ish. Or the SBs who treat their SDs really well but in return are not treated well. What do you to that.?\n\nSame thing you do in a vanilla relationship when you feel there’s an inequitable distribution of love and care and effort.\n\nYou have the hard conversation or you find a new partner.",
            "author": "j19104",
            "id": "ic0dr3x",
            "parent_id": "t1_ic0cnfm",
            "score": 28,
            "created_utc": 1654978077.0,
            "replies": [
                {
                    "body": "AKA, handle it like an adult.",
                    "author": "Y_4Z44",
                    "id": "ic0sgbm",
                    "parent_id": "t1_ic0dr3x",
                    "score": 12,
                    "created_utc": 1654985492.0,
                    "replies": []
                },
                {
                    "body": "Yes 100%",
                    "author": "bubblerush",
                    "id": "ic0edtt",
                    "parent_id": "t1_ic0dr3x",
                    "score": 4,
                    "created_utc": 1654978392.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you tolerate that behavior, you’ll continue to serve in that role.",
            "author": "garret6758",
            "id": "ic0jdx6",
            "parent_id": "t1_ic0cnfm",
            "score": 10,
            "created_utc": 1654980862.0,
            "replies": [
                {
                    "body": "I don’t tolerate that. But one does it and I move on. Next does it and I move on. People present all committed and then slowly stop honoring the arrangement. Happens on both sides I feel.",
                    "author": "thereadinessisall",
                    "id": "ic0juo3",
                    "parent_id": "t1_ic0jdx6",
                    "score": 4,
                    "created_utc": 1654981102.0,
                    "replies": [
                        {
                            "body": "I'm sorry for saying that but that's because of you. You choose this type of girls. You allow this to happen. Sounds like it happens systematically to you. Do something, change yourself.",
                            "author": "SeekingInSydney",
                            "id": "ic9anrl",
                            "parent_id": "t1_ic0juo3",
                            "score": 1,
                            "created_utc": 1655158751.0,
                            "replies": [
                                {
                                    "body": "yes - so from now on I'll be a dick, won't show care, won't spoil, won't gift, won't trip, won't trust, etc -- that seems to be my option.... not a great one at that....",
                                    "author": "thereadinessisall",
                                    "id": "ic9azqi",
                                    "parent_id": "t1_ic9anrl",
                                    "score": 1,
                                    "created_utc": 1655158878.0,
                                    "replies": [
                                        {
                                            "body": "No mate, that's not the way to go. It'll only multiply amount of shit in this word. Please grow above that, and establish another attitude to vibe with \\_another\\_ type.\n\nAnd hey, I hear you. Just now I've been through the same situation. I know, it sucks. Anyway, please don't come to dark side.",
                                            "author": "SeekingInSydney",
                                            "id": "ic9bh3n",
                                            "parent_id": "t1_ic9azqi",
                                            "score": 2,
                                            "created_utc": 1655159095.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish I knew what my SD wanted. I go out of my way to express gratitude but sometimes question what more I can do that is still appropriate given our arrangement. I think we could all benefit from being more direct about what we want from our partner.",
            "author": "MJline",
            "id": "ic1e2tg",
            "parent_id": "t1_ic0cnfm",
            "score": 4,
            "created_utc": 1654997028.0,
            "replies": []
        },
        {
            "body": "What do you expect in return, just curious.",
            "author": null,
            "id": "ic0kr8v",
            "parent_id": "t1_ic0cnfm",
            "score": 3,
            "created_utc": 1654981561.0,
            "replies": [
                {
                    "body": "Nothing out of the ordinary. An actual focused thank you, a verbal show of appreciation (“this really helped me out and thank you so for this” “or that was so much fun it made me feel so good to get that from you - thank you for that”) - my love language is touch and I express that to my partners - so curling up and snuggling is a great way for me to feel appreciated. \n\nBut I am amazed how many people have such a hard time saying a genuine and authentic Expression of gratitude or appreciation and value.",
                    "author": "thereadinessisall",
                    "id": "ic6pof2",
                    "parent_id": "t1_ic0kr8v",
                    "score": 2,
                    "created_utc": 1655113719.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately there’s a lot of that too. Which is why I said that it’ll feel like a John/Escort arrangement if EITHER partner is treating it that way.",
            "author": "bubblerush",
            "id": "ic0d0tw",
            "parent_id": "t1_ic0cnfm",
            "score": 4,
            "created_utc": 1654977729.0,
            "replies": [
                {
                    "body": "I just brought that up because I think it is much more prevalent in sugar than a straight up John/escort. I think start things well and then fall off quick because either lack of appreciation and honoring the arrangement or devolving into viewing as a sex object. I could be wrong though.",
                    "author": "thereadinessisall",
                    "id": "ic0fnj1",
                    "parent_id": "t1_ic0d0tw",
                    "score": 2,
                    "created_utc": 1654979008.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> And to those who treat an SB like a queen but is treated in return like a John - ish. Or the SBs who treat their SDs really well but in return are not treated well. What do you to that.?\n\nFind a new SR?  It's really not that hard.... ?",
            "author": "SDstartingOut",
            "id": "ic1048w",
            "parent_id": "t1_ic0cnfm",
            "score": 2,
            "created_utc": 1654989488.0,
            "replies": []
        },
        {
            "body": "Lmao this is why you are where you are. No one likes a whiner or a man who presents as a weakling. If you feel unappreciated, move on. If you want some girl to pretend to the extent that she’s treating you like a serious relationship, set those expectations and compensate her accordingly.",
            "author": "Dormouse_in_a_teapot",
            "id": "ic1qoah",
            "parent_id": "t1_ic0cnfm",
            "score": 2,
            "created_utc": 1655003975.0,
            "replies": []
        },
        {
            "body": "Everyone wants a monthly allowance. The difference is some want it only once.",
            "author": "YlangScent",
            "id": "ic28dss",
            "parent_id": "t1_ic108we",
            "score": 1,
            "created_utc": 1655015899.0,
            "replies": [
                {
                    "body": "> Everyone wants a monthly allowance. The difference is some want it only once.\n\nAre you an SD that leads the conversation talking about a MA?  I\"m assuming you aren't.\n\nI am someone that does.  You are welcome to believe me/not believe me - but plenty of people push back/towards a PPM.  Either flat out, or symbolically.  (stipulating that an allowance is only prepaid PPM is the same as saying no to it).",
                    "author": "SDstartingOut",
                    "id": "ic2t5da",
                    "parent_id": "t1_ic28dss",
                    "score": 2,
                    "created_utc": 1655034130.0,
                    "replies": [
                        {
                            "body": "I have 0 issues with it and my approach varies based on what I feel like. My single PPM typically already exceeds what most other in a month, so that's not really the point.\n\nIn my experience there is no difference in approaching things with an allowance or PPM mind set. Especially not for a SB. They will gladly take the allowance even if they don't see it working out.",
                            "author": "YlangScent",
                            "id": "ic6a3am",
                            "parent_id": "t1_ic2t5da",
                            "score": 3,
                            "created_utc": 1655099711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What escort is going to turn down a monthly allowance paid up front?",
            "author": "sparky_SD16",
            "id": "ic2sb6m",
            "parent_id": "t1_ic108we",
            "score": 1,
            "created_utc": 1655033528.0,
            "replies": [
                {
                    "body": "> What escort is going to turn down a monthly allowance paid up front?\n\nIts all in the nuance/understanding of the conversation.\n\nI bring up an allowance.\n\nShe counters with either:\n\n1.  I only do PPM.  My number is X.\n\n2.  My PPM is X.  So an allowance of 3X would be a max of 3 dates a month.\n\nDemanding that an allowance is nothing more than prepaid meets - is the same thing as saying you don't want a monthly allowance.",
                    "author": "SDstartingOut",
                    "id": "ic2t0qg",
                    "parent_id": "t1_ic2sb6m",
                    "score": 3,
                    "created_utc": 1655034046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or “love”",
            "author": "UnearthlyDinosaur",
            "id": "ic1og3o",
            "parent_id": "t1_ic10mph",
            "score": 3,
            "created_utc": 1655002710.0,
            "replies": []
        },
        {
            "body": "Wow that sucks. Idk how people are like that. I’ve always been the one being scammed I guess I forgot it’s the other way around a lot of the times.",
            "author": null,
            "id": "ic2c007",
            "parent_id": "t1_ic1y5hl",
            "score": 2,
            "created_utc": 1655018991.0,
            "replies": []
        },
        {
            "body": "I love when they have no pictures showing their face and they badger me to show mine.",
            "author": "throwawayrtyggv",
            "id": "ic5jayk",
            "parent_id": "t1_ic1y5hl",
            "score": 1,
            "created_utc": 1655083375.0,
            "replies": []
        },
        {
            "body": "More and more SDs are acting like johns, and then wondering why they’re getting treated as such. :)",
            "author": "bubblerush",
            "id": "ic0hnw1",
            "parent_id": "t1_ic0h0sc",
            "score": 14,
            "created_utc": 1654979995.0,
            "replies": [
                {
                    "body": "Maybe they should all just find each other? \n\nNothing wrong with it…people are just looking for different things.",
                    "author": "throwawayrtyggv",
                    "id": "ic5j5uw",
                    "parent_id": "t1_ic0hnw1",
                    "score": 2,
                    "created_utc": 1655083298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ic10jff",
            "parent_id": "t1_ic0x628",
            "score": 3,
            "created_utc": 1654989709.0,
            "replies": [
                {
                    "body": "Scammed? In what ways?",
                    "author": "bubblerush",
                    "id": "ic1djkd",
                    "parent_id": "t1_ic10jff",
                    "score": 2,
                    "created_utc": 1654996738.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ic27gwi",
                            "parent_id": "t1_ic1djkd",
                            "score": 4,
                            "created_utc": 1655015146.0,
                            "replies": [
                                {
                                    "body": "I really don’t like using the word “scam” when talking about sugar relationships. “I paid her to sleep with me, and she didn’t. I got scammed!” To me that sounds like escort territory. It’s a relationship, if you choose to pay your partners rent, and then they don’t want to sleep with you or they end the relationship, you’re not getting scammed. Is manipulating men for money a dick move? Yes, but it’s not a scam.",
                                    "author": "bubblerush",
                                    "id": "icd282u",
                                    "parent_id": "t1_ic27gwi",
                                    "score": 3,
                                    "created_utc": 1655232879.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But it does protect SDs, no need for quotation marks there.",
            "author": null,
            "id": "ic1n9nq",
            "parent_id": "t1_ic0x628",
            "score": 1,
            "created_utc": 1655002059.0,
            "replies": []
        },
        {
            "body": "Are you offering a generous amount of money to date and build a connection before expecting sex?",
            "author": "clownface2-0",
            "id": "ic0xbhi",
            "parent_id": "t1_ic0q72b",
            "score": 7,
            "created_utc": 1654987998.0,
            "replies": [
                {
                    "body": "No amount of money can buy younger women their attentiveness.  It doesn’t give them the same dopamine effects as Instagram.  Look at women being paid 6 figures at a job still sitting on their Instagram app.",
                    "author": "MKTekke",
                    "id": "ic14vbc",
                    "parent_id": "t1_ic0xbhi",
                    "score": -2,
                    "created_utc": 1654992014.0,
                    "replies": [
                        {
                            "body": "lol soo much to unpack.\n\nA very young person does not have a fully developed prefrontal cortex, the part of the brain involved in long term planning, delay of gratification, selective attention...the list goes on and on.\n\nThe effects of dopamine aren't gendered, and older men aren't immune either or there wouldn't be any older male addicts.  \n\nMoney can only go so far.  If you're boring and unpleasant, sure someone with an adult level of maturity can work with that in small windows for a high amount of money, but emotional labour has limits.",
                            "author": "clownface2-0",
                            "id": "ic1fnj3",
                            "parent_id": "t1_ic14vbc",
                            "score": 5,
                            "created_utc": 1654997885.0,
                            "replies": []
                        },
                        {
                            "body": "This. Womens primary goal is ATTENTION.  They would rather have 100K followers than a regular five figure allowance.",
                            "author": "UnearthlyDinosaur",
                            "id": "ic1ocv2",
                            "parent_id": "t1_ic14vbc",
                            "score": -7,
                            "created_utc": 1655002658.0,
                            "replies": [
                                {
                                    "body": "I think maybe you’re generalizing too much. It has a lot to do with time, trust, and past experiences.",
                                    "author": null,
                                    "id": "ic2bvf1",
                                    "parent_id": "t1_ic1ocv2",
                                    "score": 5,
                                    "created_utc": 1655018878.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Spoken truth bomb",
                            "author": null,
                            "id": "ic1hzyx",
                            "parent_id": "t1_ic14vbc",
                            "score": -2,
                            "created_utc": 1654999182.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This might sound harsh, but absolutely not. All that does is encourage her to go on three dates and run.",
                    "author": "throwawayrtyggv",
                    "id": "ic5jfcx",
                    "parent_id": "t1_ic0xbhi",
                    "score": 1,
                    "created_utc": 1655083443.0,
                    "replies": [
                        {
                            "body": "But if you have that mindset: that the women you're meeting absolutely don't want to sleep with you, you have to use the money like a literal carrot/stick then why sugar.\n\nIsn't sugar supposed to have some element of authentic attraction...at the very least some positive feelings?",
                            "author": "clownface2-0",
                            "id": "ic86phh",
                            "parent_id": "t1_ic5jfcx",
                            "score": 0,
                            "created_utc": 1655141691.0,
                            "replies": [
                                {
                                    "body": "I mean then I’d counter with why not date me vanilla. \n\nOne of the root reasons to sugar is to date women out of your league.",
                                    "author": "throwawayrtyggv",
                                    "id": "ic886pk",
                                    "parent_id": "t1_ic86phh",
                                    "score": 0,
                                    "created_utc": 1655142317.0,
                                    "replies": [
                                        {
                                            "body": "I think you replied to the wrong comment.\n\nSugar is the opportunity to date someone you normally couldn't, not hold money over someone's head when you know they need it to extract sex before there is any connection, trust, attraction or comfort level.\n\nThat's not dating someone out of your league, that's something else entirely.",
                                            "author": "clownface2-0",
                                            "id": "icf8kkk",
                                            "parent_id": "t1_ic886pk",
                                            "score": 0,
                                            "created_utc": 1655271646.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "AKA, handle it like an adult.",
            "author": "Y_4Z44",
            "id": "ic0sgbm",
            "parent_id": "t1_ic0dr3x",
            "score": 12,
            "created_utc": 1654985492.0,
            "replies": []
        },
        {
            "body": "Yes 100%",
            "author": "bubblerush",
            "id": "ic0edtt",
            "parent_id": "t1_ic0dr3x",
            "score": 4,
            "created_utc": 1654978392.0,
            "replies": []
        },
        {
            "body": "I don’t tolerate that. But one does it and I move on. Next does it and I move on. People present all committed and then slowly stop honoring the arrangement. Happens on both sides I feel.",
            "author": "thereadinessisall",
            "id": "ic0juo3",
            "parent_id": "t1_ic0jdx6",
            "score": 4,
            "created_utc": 1654981102.0,
            "replies": [
                {
                    "body": "I'm sorry for saying that but that's because of you. You choose this type of girls. You allow this to happen. Sounds like it happens systematically to you. Do something, change yourself.",
                    "author": "SeekingInSydney",
                    "id": "ic9anrl",
                    "parent_id": "t1_ic0juo3",
                    "score": 1,
                    "created_utc": 1655158751.0,
                    "replies": [
                        {
                            "body": "yes - so from now on I'll be a dick, won't show care, won't spoil, won't gift, won't trip, won't trust, etc -- that seems to be my option.... not a great one at that....",
                            "author": "thereadinessisall",
                            "id": "ic9azqi",
                            "parent_id": "t1_ic9anrl",
                            "score": 1,
                            "created_utc": 1655158878.0,
                            "replies": [
                                {
                                    "body": "No mate, that's not the way to go. It'll only multiply amount of shit in this word. Please grow above that, and establish another attitude to vibe with \\_another\\_ type.\n\nAnd hey, I hear you. Just now I've been through the same situation. I know, it sucks. Anyway, please don't come to dark side.",
                                    "author": "SeekingInSydney",
                                    "id": "ic9bh3n",
                                    "parent_id": "t1_ic9azqi",
                                    "score": 2,
                                    "created_utc": 1655159095.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nothing out of the ordinary. An actual focused thank you, a verbal show of appreciation (“this really helped me out and thank you so for this” “or that was so much fun it made me feel so good to get that from you - thank you for that”) - my love language is touch and I express that to my partners - so curling up and snuggling is a great way for me to feel appreciated. \n\nBut I am amazed how many people have such a hard time saying a genuine and authentic Expression of gratitude or appreciation and value.",
            "author": "thereadinessisall",
            "id": "ic6pof2",
            "parent_id": "t1_ic0kr8v",
            "score": 2,
            "created_utc": 1655113719.0,
            "replies": []
        },
        {
            "body": "I just brought that up because I think it is much more prevalent in sugar than a straight up John/escort. I think start things well and then fall off quick because either lack of appreciation and honoring the arrangement or devolving into viewing as a sex object. I could be wrong though.",
            "author": "thereadinessisall",
            "id": "ic0fnj1",
            "parent_id": "t1_ic0d0tw",
            "score": 2,
            "created_utc": 1654979008.0,
            "replies": []
        },
        {
            "body": "> Everyone wants a monthly allowance. The difference is some want it only once.\n\nAre you an SD that leads the conversation talking about a MA?  I\"m assuming you aren't.\n\nI am someone that does.  You are welcome to believe me/not believe me - but plenty of people push back/towards a PPM.  Either flat out, or symbolically.  (stipulating that an allowance is only prepaid PPM is the same as saying no to it).",
            "author": "SDstartingOut",
            "id": "ic2t5da",
            "parent_id": "t1_ic28dss",
            "score": 2,
            "created_utc": 1655034130.0,
            "replies": [
                {
                    "body": "I have 0 issues with it and my approach varies based on what I feel like. My single PPM typically already exceeds what most other in a month, so that's not really the point.\n\nIn my experience there is no difference in approaching things with an allowance or PPM mind set. Especially not for a SB. They will gladly take the allowance even if they don't see it working out.",
                    "author": "YlangScent",
                    "id": "ic6a3am",
                    "parent_id": "t1_ic2t5da",
                    "score": 3,
                    "created_utc": 1655099711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> What escort is going to turn down a monthly allowance paid up front?\n\nIts all in the nuance/understanding of the conversation.\n\nI bring up an allowance.\n\nShe counters with either:\n\n1.  I only do PPM.  My number is X.\n\n2.  My PPM is X.  So an allowance of 3X would be a max of 3 dates a month.\n\nDemanding that an allowance is nothing more than prepaid meets - is the same thing as saying you don't want a monthly allowance.",
            "author": "SDstartingOut",
            "id": "ic2t0qg",
            "parent_id": "t1_ic2sb6m",
            "score": 3,
            "created_utc": 1655034046.0,
            "replies": []
        },
        {
            "body": "Maybe they should all just find each other? \n\nNothing wrong with it…people are just looking for different things.",
            "author": "throwawayrtyggv",
            "id": "ic5j5uw",
            "parent_id": "t1_ic0hnw1",
            "score": 2,
            "created_utc": 1655083298.0,
            "replies": []
        },
        {
            "body": "Scammed? In what ways?",
            "author": "bubblerush",
            "id": "ic1djkd",
            "parent_id": "t1_ic10jff",
            "score": 2,
            "created_utc": 1654996738.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ic27gwi",
                    "parent_id": "t1_ic1djkd",
                    "score": 4,
                    "created_utc": 1655015146.0,
                    "replies": [
                        {
                            "body": "I really don’t like using the word “scam” when talking about sugar relationships. “I paid her to sleep with me, and she didn’t. I got scammed!” To me that sounds like escort territory. It’s a relationship, if you choose to pay your partners rent, and then they don’t want to sleep with you or they end the relationship, you’re not getting scammed. Is manipulating men for money a dick move? Yes, but it’s not a scam.",
                            "author": "bubblerush",
                            "id": "icd282u",
                            "parent_id": "t1_ic27gwi",
                            "score": 3,
                            "created_utc": 1655232879.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No amount of money can buy younger women their attentiveness.  It doesn’t give them the same dopamine effects as Instagram.  Look at women being paid 6 figures at a job still sitting on their Instagram app.",
            "author": "MKTekke",
            "id": "ic14vbc",
            "parent_id": "t1_ic0xbhi",
            "score": -2,
            "created_utc": 1654992014.0,
            "replies": [
                {
                    "body": "lol soo much to unpack.\n\nA very young person does not have a fully developed prefrontal cortex, the part of the brain involved in long term planning, delay of gratification, selective attention...the list goes on and on.\n\nThe effects of dopamine aren't gendered, and older men aren't immune either or there wouldn't be any older male addicts.  \n\nMoney can only go so far.  If you're boring and unpleasant, sure someone with an adult level of maturity can work with that in small windows for a high amount of money, but emotional labour has limits.",
                    "author": "clownface2-0",
                    "id": "ic1fnj3",
                    "parent_id": "t1_ic14vbc",
                    "score": 5,
                    "created_utc": 1654997885.0,
                    "replies": []
                },
                {
                    "body": "This. Womens primary goal is ATTENTION.  They would rather have 100K followers than a regular five figure allowance.",
                    "author": "UnearthlyDinosaur",
                    "id": "ic1ocv2",
                    "parent_id": "t1_ic14vbc",
                    "score": -7,
                    "created_utc": 1655002658.0,
                    "replies": [
                        {
                            "body": "I think maybe you’re generalizing too much. It has a lot to do with time, trust, and past experiences.",
                            "author": null,
                            "id": "ic2bvf1",
                            "parent_id": "t1_ic1ocv2",
                            "score": 5,
                            "created_utc": 1655018878.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Spoken truth bomb",
                    "author": null,
                    "id": "ic1hzyx",
                    "parent_id": "t1_ic14vbc",
                    "score": -2,
                    "created_utc": 1654999182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This might sound harsh, but absolutely not. All that does is encourage her to go on three dates and run.",
            "author": "throwawayrtyggv",
            "id": "ic5jfcx",
            "parent_id": "t1_ic0xbhi",
            "score": 1,
            "created_utc": 1655083443.0,
            "replies": [
                {
                    "body": "But if you have that mindset: that the women you're meeting absolutely don't want to sleep with you, you have to use the money like a literal carrot/stick then why sugar.\n\nIsn't sugar supposed to have some element of authentic attraction...at the very least some positive feelings?",
                    "author": "clownface2-0",
                    "id": "ic86phh",
                    "parent_id": "t1_ic5jfcx",
                    "score": 0,
                    "created_utc": 1655141691.0,
                    "replies": [
                        {
                            "body": "I mean then I’d counter with why not date me vanilla. \n\nOne of the root reasons to sugar is to date women out of your league.",
                            "author": "throwawayrtyggv",
                            "id": "ic886pk",
                            "parent_id": "t1_ic86phh",
                            "score": 0,
                            "created_utc": 1655142317.0,
                            "replies": [
                                {
                                    "body": "I think you replied to the wrong comment.\n\nSugar is the opportunity to date someone you normally couldn't, not hold money over someone's head when you know they need it to extract sex before there is any connection, trust, attraction or comfort level.\n\nThat's not dating someone out of your league, that's something else entirely.",
                                    "author": "clownface2-0",
                                    "id": "icf8kkk",
                                    "parent_id": "t1_ic886pk",
                                    "score": 0,
                                    "created_utc": 1655271646.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sorry for saying that but that's because of you. You choose this type of girls. You allow this to happen. Sounds like it happens systematically to you. Do something, change yourself.",
            "author": "SeekingInSydney",
            "id": "ic9anrl",
            "parent_id": "t1_ic0juo3",
            "score": 1,
            "created_utc": 1655158751.0,
            "replies": [
                {
                    "body": "yes - so from now on I'll be a dick, won't show care, won't spoil, won't gift, won't trip, won't trust, etc -- that seems to be my option.... not a great one at that....",
                    "author": "thereadinessisall",
                    "id": "ic9azqi",
                    "parent_id": "t1_ic9anrl",
                    "score": 1,
                    "created_utc": 1655158878.0,
                    "replies": [
                        {
                            "body": "No mate, that's not the way to go. It'll only multiply amount of shit in this word. Please grow above that, and establish another attitude to vibe with \\_another\\_ type.\n\nAnd hey, I hear you. Just now I've been through the same situation. I know, it sucks. Anyway, please don't come to dark side.",
                            "author": "SeekingInSydney",
                            "id": "ic9bh3n",
                            "parent_id": "t1_ic9azqi",
                            "score": 2,
                            "created_utc": 1655159095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have 0 issues with it and my approach varies based on what I feel like. My single PPM typically already exceeds what most other in a month, so that's not really the point.\n\nIn my experience there is no difference in approaching things with an allowance or PPM mind set. Especially not for a SB. They will gladly take the allowance even if they don't see it working out.",
            "author": "YlangScent",
            "id": "ic6a3am",
            "parent_id": "t1_ic2t5da",
            "score": 3,
            "created_utc": 1655099711.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ic27gwi",
            "parent_id": "t1_ic1djkd",
            "score": 4,
            "created_utc": 1655015146.0,
            "replies": [
                {
                    "body": "I really don’t like using the word “scam” when talking about sugar relationships. “I paid her to sleep with me, and she didn’t. I got scammed!” To me that sounds like escort territory. It’s a relationship, if you choose to pay your partners rent, and then they don’t want to sleep with you or they end the relationship, you’re not getting scammed. Is manipulating men for money a dick move? Yes, but it’s not a scam.",
                    "author": "bubblerush",
                    "id": "icd282u",
                    "parent_id": "t1_ic27gwi",
                    "score": 3,
                    "created_utc": 1655232879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol soo much to unpack.\n\nA very young person does not have a fully developed prefrontal cortex, the part of the brain involved in long term planning, delay of gratification, selective attention...the list goes on and on.\n\nThe effects of dopamine aren't gendered, and older men aren't immune either or there wouldn't be any older male addicts.  \n\nMoney can only go so far.  If you're boring and unpleasant, sure someone with an adult level of maturity can work with that in small windows for a high amount of money, but emotional labour has limits.",
            "author": "clownface2-0",
            "id": "ic1fnj3",
            "parent_id": "t1_ic14vbc",
            "score": 5,
            "created_utc": 1654997885.0,
            "replies": []
        },
        {
            "body": "This. Womens primary goal is ATTENTION.  They would rather have 100K followers than a regular five figure allowance.",
            "author": "UnearthlyDinosaur",
            "id": "ic1ocv2",
            "parent_id": "t1_ic14vbc",
            "score": -7,
            "created_utc": 1655002658.0,
            "replies": [
                {
                    "body": "I think maybe you’re generalizing too much. It has a lot to do with time, trust, and past experiences.",
                    "author": null,
                    "id": "ic2bvf1",
                    "parent_id": "t1_ic1ocv2",
                    "score": 5,
                    "created_utc": 1655018878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Spoken truth bomb",
            "author": null,
            "id": "ic1hzyx",
            "parent_id": "t1_ic14vbc",
            "score": -2,
            "created_utc": 1654999182.0,
            "replies": []
        },
        {
            "body": "But if you have that mindset: that the women you're meeting absolutely don't want to sleep with you, you have to use the money like a literal carrot/stick then why sugar.\n\nIsn't sugar supposed to have some element of authentic attraction...at the very least some positive feelings?",
            "author": "clownface2-0",
            "id": "ic86phh",
            "parent_id": "t1_ic5jfcx",
            "score": 0,
            "created_utc": 1655141691.0,
            "replies": [
                {
                    "body": "I mean then I’d counter with why not date me vanilla. \n\nOne of the root reasons to sugar is to date women out of your league.",
                    "author": "throwawayrtyggv",
                    "id": "ic886pk",
                    "parent_id": "t1_ic86phh",
                    "score": 0,
                    "created_utc": 1655142317.0,
                    "replies": [
                        {
                            "body": "I think you replied to the wrong comment.\n\nSugar is the opportunity to date someone you normally couldn't, not hold money over someone's head when you know they need it to extract sex before there is any connection, trust, attraction or comfort level.\n\nThat's not dating someone out of your league, that's something else entirely.",
                            "author": "clownface2-0",
                            "id": "icf8kkk",
                            "parent_id": "t1_ic886pk",
                            "score": 0,
                            "created_utc": 1655271646.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes - so from now on I'll be a dick, won't show care, won't spoil, won't gift, won't trip, won't trust, etc -- that seems to be my option.... not a great one at that....",
            "author": "thereadinessisall",
            "id": "ic9azqi",
            "parent_id": "t1_ic9anrl",
            "score": 1,
            "created_utc": 1655158878.0,
            "replies": [
                {
                    "body": "No mate, that's not the way to go. It'll only multiply amount of shit in this word. Please grow above that, and establish another attitude to vibe with \\_another\\_ type.\n\nAnd hey, I hear you. Just now I've been through the same situation. I know, it sucks. Anyway, please don't come to dark side.",
                    "author": "SeekingInSydney",
                    "id": "ic9bh3n",
                    "parent_id": "t1_ic9azqi",
                    "score": 2,
                    "created_utc": 1655159095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really don’t like using the word “scam” when talking about sugar relationships. “I paid her to sleep with me, and she didn’t. I got scammed!” To me that sounds like escort territory. It’s a relationship, if you choose to pay your partners rent, and then they don’t want to sleep with you or they end the relationship, you’re not getting scammed. Is manipulating men for money a dick move? Yes, but it’s not a scam.",
            "author": "bubblerush",
            "id": "icd282u",
            "parent_id": "t1_ic27gwi",
            "score": 3,
            "created_utc": 1655232879.0,
            "replies": []
        },
        {
            "body": "I think maybe you’re generalizing too much. It has a lot to do with time, trust, and past experiences.",
            "author": null,
            "id": "ic2bvf1",
            "parent_id": "t1_ic1ocv2",
            "score": 5,
            "created_utc": 1655018878.0,
            "replies": []
        },
        {
            "body": "I mean then I’d counter with why not date me vanilla. \n\nOne of the root reasons to sugar is to date women out of your league.",
            "author": "throwawayrtyggv",
            "id": "ic886pk",
            "parent_id": "t1_ic86phh",
            "score": 0,
            "created_utc": 1655142317.0,
            "replies": [
                {
                    "body": "I think you replied to the wrong comment.\n\nSugar is the opportunity to date someone you normally couldn't, not hold money over someone's head when you know they need it to extract sex before there is any connection, trust, attraction or comfort level.\n\nThat's not dating someone out of your league, that's something else entirely.",
                    "author": "clownface2-0",
                    "id": "icf8kkk",
                    "parent_id": "t1_ic886pk",
                    "score": 0,
                    "created_utc": 1655271646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No mate, that's not the way to go. It'll only multiply amount of shit in this word. Please grow above that, and establish another attitude to vibe with \\_another\\_ type.\n\nAnd hey, I hear you. Just now I've been through the same situation. I know, it sucks. Anyway, please don't come to dark side.",
            "author": "SeekingInSydney",
            "id": "ic9bh3n",
            "parent_id": "t1_ic9azqi",
            "score": 2,
            "created_utc": 1655159095.0,
            "replies": []
        },
        {
            "body": "I think you replied to the wrong comment.\n\nSugar is the opportunity to date someone you normally couldn't, not hold money over someone's head when you know they need it to extract sex before there is any connection, trust, attraction or comfort level.\n\nThat's not dating someone out of your league, that's something else entirely.",
            "author": "clownface2-0",
            "id": "icf8kkk",
            "parent_id": "t1_ic886pk",
            "score": 0,
            "created_utc": 1655271646.0,
            "replies": []
        }
    ]
}