{
    "title": "What's a nice way to tell a SB that she's going to have to start putting out consistently if she wants this to continue?",
    "post_id": "wmk5t3",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wmk5t3/whats_a_nice_way_to_tell_a_sb_that_shes_going_to/",
    "author": "DragonflyDry9717",
    "body": "I like to think I'm a good SD. I happily spoil my SB with an above-average PPM, plus plenty of gifts.\n\nAbout a month ago, we had sex for the first time. We had been seeing each other for two months before that, and as we're both new to this, we were nervous. But we both had a really good time, or so I was led to believe. \n\nWe've seen each other twice since then and it hasn't gotten physical. The first of these times I assumed we'd be having sex (because she texted me some pretty spicy stuff), but then she put an appointment to get her nails done right after we met for some reason. The second time she told me that she needed to help her friend with some shopping, again dipping out a short time after I took her out to dinner.\n\nI'm honestly kind of miffed about this. As much as I enjoy her company, part of the reason I'm doing this is sex. I'm half inclined to think she's just playing me, but I feel like she deserves a chance because I really do like her a lot. \n\nIs there any way to word this without coming across like a colossal prick?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wmk5t3/whats_a_nice_way_to_tell_a_sb_that_shes_going_to/",
    "score": 95,
    "upvote_ratio": 0.9,
    "created_utc": 1660307606.0,
    "num_comments": 177,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "She set up a nails appointment for *after* your date?\n\nYeah, she's not into you. She just wants whatever gifts you are giving her. She's moved on, you probably should as well.",
            "author": "NinCarolina",
            "id": "ijzrzpl",
            "parent_id": "t3_wmk5t3",
            "score": 193,
            "created_utc": 1660311613.0,
            "replies": [
                {
                    "body": "yeah, i thought that too. at a bare minimum she should have kept that time open \"just in case\".... so the obvious conclusion is that she wanted the time blocked out so there won't be a \"just in case\" opportunity. You probably aren't going to get anywhere further - worth finding out for sure but instinct is probably right in this matter",
                    "author": "Fabulous_Storm2437",
                    "id": "ik1frd1",
                    "parent_id": "t1_ijzrzpl",
                    "score": 18,
                    "created_utc": 1660334754.0,
                    "replies": []
                },
                {
                    "body": "she used the money OP gave her to pay for the nails appointment\n\nseeing OP is actually a pit stop to the ATM. she's gotta pick up the cash for the nails appointment. OP is a good cash dispenser. she's actually really smart",
                    "author": "isthisit51",
                    "id": "ik0aeeh",
                    "parent_id": "t1_ijzrzpl",
                    "score": 69,
                    "created_utc": 1660318990.0,
                    "replies": []
                },
                {
                    "body": "And when he cuts the cord she’ll come here and complain he wasn’t a real sugar daddy.",
                    "author": "andrewofflorida",
                    "id": "ik2g8c9",
                    "parent_id": "t1_ijzrzpl",
                    "score": 14,
                    "created_utc": 1660350241.0,
                    "replies": []
                },
                {
                    "body": "That might not be true — I’ve had to do that before when my nails looked like trash and that was the only time I actually had for nails, but then I later scheduled the date with SD… I couldn’t say no to either one, so I went after the date.",
                    "author": "Koroleva7z",
                    "id": "ik0ukn5",
                    "parent_id": "t1_ijzrzpl",
                    "score": 8,
                    "created_utc": 1660326534.0,
                    "replies": [
                        {
                            "body": "if it was a date, wouldn't she have wanted the nails nice prior to the meetup? or is there another more important date to get ready for?",
                            "author": "Fabulous_Storm2437",
                            "id": "ik1fwak",
                            "parent_id": "t1_ik0ukn5",
                            "score": 10,
                            "created_utc": 1660334808.0,
                            "replies": [
                                {
                                    "body": "Tbf she could have multiple SDs (but if that’s the case, she might not to work on her time management…)",
                                    "author": "paroxysmique",
                                    "id": "ik1kimk",
                                    "parent_id": "t1_ik1fwak",
                                    "score": -4,
                                    "created_utc": 1660336633.0,
                                    "replies": [
                                        {
                                            "body": "sounds like one of them is about to be freed up, so she will have more time, but might need to find a cheaper nail place with the lost income",
                                            "author": "Fabulous_Storm2437",
                                            "id": "ik1pwdx",
                                            "parent_id": "t1_ik1kimk",
                                            "score": 4,
                                            "created_utc": 1660338811.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You couldn't ask if you could reschedule the date?",
                            "author": "NinCarolina",
                            "id": "ik32qrw",
                            "parent_id": "t1_ik0ukn5",
                            "score": 1,
                            "created_utc": 1660360926.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "repeat after me\n\nI will beg for sex.\n\nI will pay for sex.\n\nI will NOT beg to pay for sex.\n\nyou have most definitely moved into category 3 and need to fix it.",
            "author": "joc13",
            "id": "ik00100",
            "parent_id": "t3_wmk5t3",
            "score": 213,
            "created_utc": 1660314956.0,
            "replies": [
                {
                    "body": "Yeah you know, reading this comment, it really made me realize the gravity of my situation ... am I really trying to convince her to let me *pay for sex*? 😂\n\nHoly fuck man I need a drink.",
                    "author": "DragonflyDry9717",
                    "id": "ik42txp",
                    "parent_id": "t1_ik00100",
                    "score": 33,
                    "created_utc": 1660386737.0,
                    "replies": [
                        {
                            "body": "This is part of the flawed thinking that sometimes occurs with women in general, Some SB’s in particular. The belief that all men equally value the time and attention that they give us with sex, so we should be happy (and pay for) the former even if we’re not getting the latter.",
                            "author": "Truly-2nd-2none",
                            "id": "ik8wm05",
                            "parent_id": "t1_ik42txp",
                            "score": 8,
                            "created_utc": 1660480967.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "~~I will NOT beg to pay for sex.~~\n\nI will NOT pay to beg for sex.\n\nFtfy",
                    "author": "cuse13203",
                    "id": "ik21aiz",
                    "parent_id": "t1_ik00100",
                    "score": 43,
                    "created_utc": 1660343615.0,
                    "replies": []
                },
                {
                    "body": "This should be the top piece of advice for SDs.",
                    "author": null,
                    "id": "ik07bu3",
                    "parent_id": "t1_ik00100",
                    "score": 29,
                    "created_utc": 1660317811.0,
                    "replies": []
                },
                {
                    "body": "100000%",
                    "author": null,
                    "id": "ik1n19x",
                    "parent_id": "t1_ik00100",
                    "score": 5,
                    "created_utc": 1660337634.0,
                    "replies": []
                },
                {
                    "body": "Please don't beg for sex, pressuring someone to sleep with you is damaging to both people involved. Just move on",
                    "author": "kneesocksbabe",
                    "id": "ik146dv",
                    "parent_id": "t1_ik00100",
                    "score": 25,
                    "created_utc": 1660330204.0,
                    "replies": [
                        {
                            "body": "it meant metaphorically begging.... like bringing up something that should have already been agreed to as a commitment, that kind of begging",
                            "author": "Fabulous_Storm2437",
                            "id": "ik1g0x6",
                            "parent_id": "t1_ik146dv",
                            "score": 22,
                            "created_utc": 1660334859.0,
                            "replies": [
                                {
                                    "body": "or as a metaphor for vanilla dating, where You are courting someone and just hoping that sex will be the outcome of what you are doing.",
                                    "author": "joc13",
                                    "id": "ik1jfad",
                                    "parent_id": "t1_ik1g0x6",
                                    "score": 8,
                                    "created_utc": 1660336198.0,
                                    "replies": [
                                        {
                                            "body": "you could always just tell the other person you want sex and not need to hope.",
                                            "author": "leavsssesthrowaway",
                                            "id": "ik2hav6",
                                            "parent_id": "t1_ik1jfad",
                                            "score": 2,
                                            "created_utc": 1660350734.0,
                                            "replies": [
                                                {
                                                    "body": "yeah, cause that goes over really when vanilla dating 😂",
                                                    "author": "joc13",
                                                    "id": "ik2m4a3",
                                                    "parent_id": "t1_ik2hav6",
                                                    "score": 5,
                                                    "created_utc": 1660352949.0,
                                                    "replies": [
                                                        {
                                                            "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
                                                            "author": "leavsssesthrowaway",
                                                            "id": "ik2obeq",
                                                            "parent_id": "t1_ik2m4a3",
                                                            "score": -1,
                                                            "created_utc": 1660353955.0,
                                                            "replies": [
                                                                {
                                                                    "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                                                                    "author": "joc13",
                                                                    "id": "ik2oo8c",
                                                                    "parent_id": "t1_ik2obeq",
                                                                    "score": 17,
                                                                    "created_utc": 1660354118.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                                                                            "author": "leavsssesthrowaway",
                                                                            "id": "ik2ovp2",
                                                                            "parent_id": "t1_ik2oo8c",
                                                                            "score": 2,
                                                                            "created_utc": 1660354212.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                                                                    "author": "Briellexox",
                                                                    "id": "ikdoo9a",
                                                                    "parent_id": "t1_ik2obeq",
                                                                    "score": 3,
                                                                    "created_utc": 1660569916.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                                                                            "author": "leavsssesthrowaway",
                                                                            "id": "ikdq61f",
                                                                            "parent_id": "t1_ikdoo9a",
                                                                            "score": 1,
                                                                            "created_utc": 1660570607.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It’s gentlemanly to pay for a lady.",
                                                                                    "author": "Briellexox",
                                                                                    "id": "ikdukbr",
                                                                                    "parent_id": "t1_ikdq61f",
                                                                                    "score": 1,
                                                                                    "created_utc": 1660572536.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes it is - but you kinda have to tell someone that your sexual needs not being met is just putting you off of them.  That’s pressure -  Im going to take away an income stream on par with all your basic expenses away if you dont have sex at times when you wouldnt do so naturally.  It’s actually pressure just built in.  Terrible but true.",
                            "author": "JDMultralight",
                            "id": "ik2se0r",
                            "parent_id": "t1_ik146dv",
                            "score": 3,
                            "created_utc": 1660355838.0,
                            "replies": [
                                {
                                    "body": "And hence, mutually beneficial and what a man wants in an arrangement takes a back seat to what she want/needs. The reason the income stream for her exists is because she has agreed to certain behaviors. I can’t expect my employer to continue to pay me if I stop performing the work that I agreed to, so why can a SB?  Unless sugaring and being a SD has turned into a charity and someone failed to inform me.  Glorify it as some may want, SR is the exchange of goods for services.",
                                    "author": "Truly-2nd-2none",
                                    "id": "ik8x573",
                                    "parent_id": "t1_ik2se0r",
                                    "score": 3,
                                    "created_utc": 1660481271.0,
                                    "replies": []
                                },
                                {
                                    "body": "Woah",
                                    "author": "madhuraksha",
                                    "id": "ik3gomd",
                                    "parent_id": "t1_ik2se0r",
                                    "score": 2,
                                    "created_utc": 1660369209.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is no fixing it. You can’t change her and shouldn’t want to. You dated for a little while and you just aren’t on the same page, that’s totally fine. Pressuring her won’t make either of you happy. She will either do it begrudgingly or continue to find excuses. Either way you lose.\n\nFind someone who is excited for the physical side. You will be so much happier.\n\nBy the way. I offer this without accusing her of anything. I don’t think she’s intentionally trying to “rinse” you. I don’t think she “owes you sex”. There is nothing negative in my reply except to say you aren’t on the same page. Find someone who matches you better.",
            "author": "TwerkingAvocado",
            "id": "ijzy2g4",
            "parent_id": "t3_wmk5t3",
            "score": 94,
            "created_utc": 1660314162.0,
            "replies": [
                {
                    "body": "I may be naive, but I agree. I don't think she's intentionally trying to rinse me. I actually do think there's a physical attraction there. Yes I know it's possible to stroke someone's ego to make them feel that way, but I've been around long enough to know the difference between a woman who's playing me and a woman who's not. \n\nI was fine with the non-sexual arrangement for a while, but I guess having sex with her changed that. It was phenomenal. \n\nBut as you say, someone being excited for the physical side would be a huge step in the right direction.",
                    "author": "DragonflyDry9717",
                    "id": "ik1rg93",
                    "parent_id": "t1_ijzy2g4",
                    "score": 12,
                    "created_utc": 1660339459.0,
                    "replies": [
                        {
                            "body": "I think have this exact conversation with her. It was worth the wait, but after the incredible experience, you want to know her view on a way forward. Maybe something happened that she’s not comfortable with? Have the discussion. Worst case, it’s a mismatch and you go separate ways.",
                            "author": "GulfCoastFlamingo",
                            "id": "ik32eh6",
                            "parent_id": "t1_ik1rg93",
                            "score": 6,
                            "created_utc": 1660360748.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree with this.",
                    "author": "Koroleva7z",
                    "id": "ik0uslt",
                    "parent_id": "t1_ijzy2g4",
                    "score": 5,
                    "created_utc": 1660326619.0,
                    "replies": []
                },
                {
                    "body": "This thinking is problematic for me that she doesn’t “owe him sex.”  Then is it fair to say that he doesn’t “owe her money?”  This double standard pops up a lot on this forum.  They “owe” each other whatever they mutually agreed to when the arrangement started or what was negotiated after.  Why do SD get held to a higher standard than SB so frequently here?",
                    "author": "Truly-2nd-2none",
                    "id": "ik8w7vc",
                    "parent_id": "t1_ijzy2g4",
                    "score": 3,
                    "created_utc": 1660480739.0,
                    "replies": []
                },
                {
                    "body": "Big picture it's probably not going to work. But given that has no payoff other than your freedom a three step program might work.  \n\nTalk to her about your mutual feelings/intent.   Ask her what she thinks the two of you should do.  \n\nAt that point make a decision.  \n\nA good rule for dog training and maintaining a sound arrangement (for both sides)  \" Don't reward consistent bad behavior\"    That doesn't mean that a good SD is not flexible but rather that the overall relationship needs to be managed.",
                    "author": "pinotandsugar",
                    "id": "ik0pvma",
                    "parent_id": "t1_ijzy2g4",
                    "score": 6,
                    "created_utc": 1660324762.0,
                    "replies": []
                },
                {
                    "body": "This is really sweet and i agree with this!\nYou can't force someone into it",
                    "author": "madhuraksha",
                    "id": "ik3gtv4",
                    "parent_id": "t1_ijzy2g4",
                    "score": 2,
                    "created_utc": 1660369306.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why don’t you simply tell her what your plans are? Just plan the date and communicate with her - “hey, I made reservations for insert restaurant here on Friday evening. I’d love to catch up over dinner and I’ve booked us a room at insert hotel here so we can enjoy some alone time since it’s been a while since we’ve been intimate.”\n\nIt’s pretty simple and straightforward, you’re clearly letting your expectations be known without harsh words or threats to end the relationship. Now if she still tries to bail after dinner when you had already told her the plan, this would be the time I would say you confront her directly and ask if she does not want to be intimate with you and let her know you desire frequent intimacy within a sugar relationship and if she is not interested, perhaps it is best you each go your own ways.",
            "author": "GlitterAndSugar",
            "id": "ijzzwe8",
            "parent_id": "t3_wmk5t3",
            "score": 69,
            "created_utc": 1660314905.0,
            "replies": [
                {
                    "body": "Thank you for your response. Your idea is perfect for me--I'm a really nonconfrontational guy, and this is a good way of bringing it up without being pushy. If she makes an excuse/decides to bail, it's 100% over though.",
                    "author": "DragonflyDry9717",
                    "id": "ik1u72j",
                    "parent_id": "t1_ijzzwe8",
                    "score": 7,
                    "created_utc": 1660340596.0,
                    "replies": [
                        {
                            "body": "I’d like an update if this works lol.",
                            "author": "Longjumping-Look-299",
                            "id": "ikcb5kj",
                            "parent_id": "t1_ik1u72j",
                            "score": 1,
                            "created_utc": 1660536045.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Here’s the issue with this. Most people outside of SLF don’t use the word intimacy when referring to sex. The OP has to spell it out for this woman and say: “I like sex and it’s important to me, if you’re not able to provide it consistently then I don’t think we are a good match.” Easy. \n\nThe whole beating around the bush and using words like intimacy aren’t going to get through to a SB like the one the OP has. Even talking about a hotel date, a lot of women won’t put two and two together that the SD is trying to have sex. How many times have we seen stories on here where a POT SB goes back to the guys hotel room/house and didn’t realize they wanted sex.",
                    "author": null,
                    "id": "ik1ne40",
                    "parent_id": "t1_ijzzwe8",
                    "score": 8,
                    "created_utc": 1660337778.0,
                    "replies": [
                        {
                            "body": "Well she is in the bowl so I’m sure she is aware and If the word intimacy really is too vague, just replace it with sex? He can still say what I recommended and just switch it to sex. \n\nHe could also use your words, but I would encourage him to not use the word “provide” because now it comes off as though she is simply a sex worker and some people are sensitive about that implication.",
                            "author": "GlitterAndSugar",
                            "id": "ik1oc86",
                            "parent_id": "t1_ik1ne40",
                            "score": 5,
                            "created_utc": 1660338167.0,
                            "replies": [
                                {
                                    "body": "\"hi I'm here to get down with it.\" \n\nDone.",
                                    "author": "mad_dabz",
                                    "id": "ik2idgy",
                                    "parent_id": "t1_ik1oc86",
                                    "score": 2,
                                    "created_utc": 1660351231.0,
                                    "replies": []
                                },
                                {
                                    "body": "I should’ve said people outside of SLF. I can’t tell you how many times I’ve said the word intimacy to a POT SB and they asked what I meant by that lol. So now I spell it out and make it clear what I’m looking for. \n\nBut I agree with you, there’s a certain way you have to do it. In the OP’s case I think he needs to be as clear as possible of what he’s expecting no matter how harsh/transactional/sex worker-y he comes across.",
                                    "author": null,
                                    "id": "ik1oy2z",
                                    "parent_id": "t1_ik1oc86",
                                    "score": 1,
                                    "created_utc": 1660338415.0,
                                    "replies": [
                                        {
                                            "body": "Well if it sounds sex-workery and harsh she may just back out anyways because it can come across as “hey I’m just here to get my dick wet” rather than “I care about about you as a person, but I also have needs within this relationship”.",
                                            "author": "GlitterAndSugar",
                                            "id": "ik1quke",
                                            "parent_id": "t1_ik1oy2z",
                                            "score": 4,
                                            "created_utc": 1660339211.0,
                                            "replies": [
                                                {
                                                    "body": "Agreed. But it needs to be said because she’s not holding up her end of the bargain. The OP has seemingly been extra patient with her. \n\nEither way, sounds like they’re just not a fit for each other.",
                                                    "author": null,
                                                    "id": "ik1r1l4",
                                                    "parent_id": "t1_ik1quke",
                                                    "score": 3,
                                                    "created_utc": 1660339290.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
                                                            "author": "GlitterAndSugar",
                                                            "id": "ik1sbic",
                                                            "parent_id": "t1_ik1r1l4",
                                                            "score": 3,
                                                            "created_utc": 1660339816.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well she is abundantly aware she isnt sleeping with him tho after two months . . . got to be something that’s in her mind right now otherwise she’s just utterly stupid.\n\nI find women are very smart when it comes to tracking this stuff",
                            "author": "JDMultralight",
                            "id": "ik36r1w",
                            "parent_id": "t1_ik1ne40",
                            "score": 3,
                            "created_utc": 1660363094.0,
                            "replies": []
                        },
                        {
                            "body": ">The whole beating around the bush and using words like intimacy aren’t going to get through to a SB like the one the OP has. Even talking about a hotel date a lot of women won’t put two and two together that the OP is trying to have sex. How many times have we seen stories on here where a POT SB goes back to the guys hotel room/house and didn’t realize they wanted sex.\n\nIt's true. I often really wonder how some of these folks could be so naive, or so self deluded, as to not understand that sex was right around the corner.",
                            "author": "BinghamtonSD",
                            "id": "ik8wp8i",
                            "parent_id": "t1_ik1ne40",
                            "score": 1,
                            "created_utc": 1660481018.0,
                            "replies": [
                                {
                                    "body": "100%. I see this in real life as well. Inexperienced POT SB’s have told me that they went over a guys house on the first meeting, the guy tried getting handsy with them, they got creeped out and left. I wanted to be like why would you go over a guys house on the first meet, what did you think would happen!!",
                                    "author": null,
                                    "id": "ik8x7zx",
                                    "parent_id": "t1_ik8wp8i",
                                    "score": 3,
                                    "created_utc": 1660481315.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've had SBs like this. They never get better. End it, block, and move on.",
            "author": "BigBearSD",
            "id": "ik0ejwv",
            "parent_id": "t3_wmk5t3",
            "score": 12,
            "created_utc": 1660320573.0,
            "replies": []
        },
        {
            "body": "Giving her the benefit of the doubt (that she is into you she’s just shy/ignorant of how this works/some other understandable excuse), I would say something like:-\n\n“I was thinking our next date could include some intimacy, if you’re comfortable with that; was gonna book a hotel.”\n\nNow maybe she’s nervous and she doesn’t feel ready, that needs to be a conversation to have asap. Does she make an excuse as to why you shouldn’t book a hotel? She’s not into you, move on. Does she bail on you last minute? Again, she’s using you, move on.",
            "author": "evelyn_lovelace",
            "id": "ijztrii",
            "parent_id": "t3_wmk5t3",
            "score": 19,
            "created_utc": 1660312380.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ijzy52r",
                    "parent_id": "t1_ijztrii",
                    "score": 8,
                    "created_utc": 1660314192.0,
                    "replies": [
                        {
                            "body": "Yeah, I honestly just didn't want to come across as sleazy? Pressuring her? Making her feel like I was only interested in her body?\n\nToo much conditioning in my youth about never expressing myself sexually.",
                            "author": "DragonflyDry9717",
                            "id": "ik43fqj",
                            "parent_id": "t1_ijzy52r",
                            "score": 2,
                            "created_utc": 1660387222.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is the best approach. So many SDs complain that SBs don’t communicate so how about you, OP, communicate",
                    "author": "Sweetcheeks864",
                    "id": "ik0kgwb",
                    "parent_id": "t1_ijztrii",
                    "score": 7,
                    "created_utc": 1660322786.0,
                    "replies": [
                        {
                            "body": "well here is another side of the token - if intimacy had already been agreed to, and SB committed to it, then they are equally able to fulfill it. think of it as a \"contractual obligation\" - because arrangements kind of are a verbal contract, even if unenforceable. it isn't a game where the SB withhold sex until the guy indicates he \"really really wants it\", this already should have been part of the agreement. and not a game to see how long the guy will wait to initiate.... what's stopping the SB from doing so? if it is lack of sexual interest then need to find that out pronto or just leave.",
                            "author": "Fabulous_Storm2437",
                            "id": "ik1gwyf",
                            "parent_id": "t1_ik0kgwb",
                            "score": 3,
                            "created_utc": 1660335213.0,
                            "replies": [
                                {
                                    "body": "Right, so how would he find that out? To ask",
                                    "author": "Sweetcheeks864",
                                    "id": "ik1pkhf",
                                    "parent_id": "t1_ik1gwyf",
                                    "score": 1,
                                    "created_utc": 1660338675.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "As an SB, I agree with this approach. Be direct that intimacy is part of the deal, and that you should both want it. Excuses to avoid intimacy on a consistent basis mean she's using you. So far you can give her the benefit of the doubt because it seems like you haven't been direct with her. But if you plan a date that specifically includes alone time afterwards, and she finds a reason not to go, you have your answer. Shut down the ATM, because that's all she sees you as.",
                    "author": "HailToTheQuinn",
                    "id": "ik0bxaa",
                    "parent_id": "t1_ijztrii",
                    "score": 9,
                    "created_utc": 1660319570.0,
                    "replies": []
                },
                {
                    "body": "Thank you for the response. I did exactly that actually. My message (although it wasn't in English) went something like:\n\n>Hey, I reserved us a table for lunch at this restaurant. It seems pretty nice and their pasta is great. I know you've been craving some good pasta lately.\n\n>Afterwards, I want to have some private intimate time.\n\nDon't get hung up on the \"private intimate time\" part. It's a hard-to-translate phrase that unambiguously meets sex. \n\nAnything other than a positive response is gonna have me looking for a new arrangement. Plenty of young stunning women out there who would love for the arrangement I'm willing to provide. Just wish the woman I'm seeing now and I didn't have such spot-on similar interests!",
                    "author": "DragonflyDry9717",
                    "id": "ik43cu7",
                    "parent_id": "t1_ijztrii",
                    "score": 3,
                    "created_utc": 1660387157.0,
                    "replies": [
                        {
                            "body": "Im so curious to see how this all pans out, update me on this please",
                            "author": "GhostsInTheParrot",
                            "id": "ik45xjh",
                            "parent_id": "t1_ik43cu7",
                            "score": 1,
                            "created_utc": 1660389115.0,
                            "replies": [
                                {
                                    "body": "Yep, definitely going to update at least in this post no matter how it goes. I'll make sure to ping you when I do.",
                                    "author": "DragonflyDry9717",
                                    "id": "ik466pc",
                                    "parent_id": "t1_ik45xjh",
                                    "score": 2,
                                    "created_utc": 1660389301.0,
                                    "replies": [
                                        {
                                            "body": "Thanks man I wish you well and hope she responds in a desirable way. Id hate to run into a rinser myself",
                                            "author": "GhostsInTheParrot",
                                            "id": "ik48mmh",
                                            "parent_id": "t1_ik466pc",
                                            "score": 1,
                                            "created_utc": 1660391010.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for the well wishes. It's actually super depressing because I like her a lot, but I'm not gonna get played anymore.",
                                                    "author": "DragonflyDry9717",
                                                    "id": "ik49d9m",
                                                    "parent_id": "t1_ik48mmh",
                                                    "score": 1,
                                                    "created_utc": 1660391493.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You mostly likely are being played.  \n\nI would put your concerns on the table and give her a chance to react. I would tell her that you want a Sugar Relationship that feels more like normal dating, but with boundaries and financial support where sex feels like a natural part of the relationship. You are not interested in an arrangement with someone that is not attracted to you. \n\nYou can tell her, that given you've only had sex once in several months, you are getting the impression she is either not attracted to you or not very sexual and that you may not be a good match.  You can tell her you dont want her to feel obligated to have sex every time you meet, but if she is attracted to you, you would expect to have sex most times you meet. This is a more polite way to say if you aren't having more sex soon, you will end the arrangement.",
            "author": "willfromvb",
            "id": "ijzxslm",
            "parent_id": "t3_wmk5t3",
            "score": 6,
            "created_utc": 1660314054.0,
            "replies": []
        },
        {
            "body": "She sounds like an accidental rinser to me. She intended to be intimate, but once you hooked up she realized she can't do it; either with you or at all. But she likes your gifts and since you were previously ok seeing her plantonically for TWO MONTHS she probably figured you'd be good for a few more.\n\nHonestly, you should try to move to intimacy on the first or second date after M&G for both your sakes. Sexual attraction and compatibility is about more than appearance and is always a bit of a crapshoot. You could just as easily have had the opposite experience; go two months before intimacy and then discover you don't really enjoy sex with her.",
            "author": "kingporterstomp",
            "id": "ik0yy2l",
            "parent_id": "t3_wmk5t3",
            "score": 5,
            "created_utc": 1660328203.0,
            "replies": [
                {
                    "body": "Yes.\n\nSee, I bet there are possibly more accidental rinsers than there are women running scams.  Its just so much more normal to go into a situation thinking\n\n “I’ll just feel the sex part out and not do anything I dont want to do nor will I hold back if I feel like it.  And this guy isnt sexy to me but not obviously disgusting so who knows?  That’s within the limits of an undiscussed situation”\n\nPeople also don’t like to feel like fucking con artists and dont like to admit it to themselves.  And since thats subconscious it makes them an accidental rinser.  Your volition has to be conscious or it’s not volition.",
                    "author": "JDMultralight",
                    "id": "ik38aqb",
                    "parent_id": "t1_ik0yy2l",
                    "score": 3,
                    "created_utc": 1660363972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Many people telling you to end it, which I agree with. But, you asked how to word the request. I'd just tell her how much you enjoyed the sex, and the spicy content after which got you worked up, and if there's a reason she hasn't wanted to sleep together again. She'll probably give you a lame non-reason, but at least you asked. I'd specifically tell her that getting the spicy content and then no follow-through was frustrating, because you assumed that was some early foreplay, and ask if she wants to discuss expectations and what she likes more clearly.\n\nLike others have said, this isn't going to work out, but give it a shot if oyu want.",
            "author": "NoLimitLexa",
            "id": "ik0597h",
            "parent_id": "t3_wmk5t3",
            "score": 8,
            "created_utc": 1660317014.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijzr6ze",
            "parent_id": "t3_wmk5t3",
            "score": 25,
            "created_utc": 1660311262.0,
            "replies": [
                {
                    "body": "And then?\n\nA girl who is obviously no into OP grinding her way through sex while \"thinking on Britain?\" because she wants/needs the money?\n\nHe should move on and find someone who is more into him.",
                    "author": "A-touchofreality",
                    "id": "ijzwwnm",
                    "parent_id": "t1_ijzr6ze",
                    "score": 13,
                    "created_utc": 1660313692.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ijzxmdk",
                            "parent_id": "t1_ijzwwnm",
                            "score": 8,
                            "created_utc": 1660313984.0,
                            "replies": [
                                {
                                    "body": "Thanks, I thought it was Britain, but you get the grasp. ;)",
                                    "author": "A-touchofreality",
                                    "id": "ik1w5gf",
                                    "parent_id": "t1_ijzxmdk",
                                    "score": 2,
                                    "created_utc": 1660341415.0,
                                    "replies": []
                                },
                                {
                                    "body": "So apparently historians now thing ol’ Vicky actually loved a nice roll in the royal hay.",
                                    "author": "JDMultralight",
                                    "id": "ik37492",
                                    "parent_id": "t1_ijzxmdk",
                                    "score": 1,
                                    "created_utc": 1660363298.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "“thinking of Britain” \n\n🇬🇧 \n\n🤣🙈",
                            "author": "Pitkin_SD",
                            "id": "ik022we",
                            "parent_id": "t1_ijzwwnm",
                            "score": 2,
                            "created_utc": 1660315778.0,
                            "replies": []
                        },
                        {
                            "body": "Precisely.",
                            "author": "celestialsavage",
                            "id": "ijzxmr7",
                            "parent_id": "t1_ijzwwnm",
                            "score": 1,
                            "created_utc": 1660313989.0,
                            "replies": []
                        },
                        {
                            "body": "there are many decent actresses out there",
                            "author": "huizeng",
                            "id": "ik0v3c3",
                            "parent_id": "t1_ijzwwnm",
                            "score": 1,
                            "created_utc": 1660326732.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ik187kg",
                                    "parent_id": "t1_ik0v3c3",
                                    "score": 2,
                                    "created_utc": 1660331779.0,
                                    "replies": [
                                        {
                                            "body": "If you kegel enough you most certainly can contract at will ;)",
                                            "author": "Nydahlia",
                                            "id": "ik1dsla",
                                            "parent_id": "t1_ik187kg",
                                            "score": 3,
                                            "created_utc": 1660333990.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ik1e41w",
                                                    "parent_id": "t1_ik1dsla",
                                                    "score": 1,
                                                    "created_utc": 1660334114.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well if it's a challenge what's the reward?",
                                                            "author": "Nydahlia",
                                                            "id": "ik1ed06",
                                                            "parent_id": "t1_ik1e41w",
                                                            "score": 3,
                                                            "created_utc": 1660334211.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Can’t girls just contract at will?  I tell girls to squeeze me all the time and havent had any say “ \nI cant”",
                                            "author": "JDMultralight",
                                            "id": "ik2t9a1",
                                            "parent_id": "t1_ik187kg",
                                            "score": 1,
                                            "created_utc": 1660356247.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Dude it’s England!!!!  I know because I’m telepathic - it’s always England.",
                            "author": "JDMultralight",
                            "id": "ik3703k",
                            "parent_id": "t1_ijzwwnm",
                            "score": 1,
                            "created_utc": 1660363234.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have a pretty adept rinser. Your first mistake was setting the pace with no sex for two months. Her putting  you off twice is disrespectful and insulting. You have to be more  assertive and tell her what you expect of your dates. I doubt if she is \"fixable\". The  other rinsers will call you out -how DARE  you want sex at each date. That is why 99.9% of us are sugaring.",
            "author": "GSSD",
            "id": "ik0dmgn",
            "parent_id": "t3_wmk5t3",
            "score": 8,
            "created_utc": 1660320214.0,
            "replies": [
                {
                    "body": "yeah if you took 2 months you have already well-signalled that the sex is optional. by waiting 2 months to challenge this notion, you just gave her easy income. a good SB would have made sure it didn't get to this point - either they would have advanced is sexually, or ended it (just joking - that part will never happen if you are paying without receiving - easiest money anyone could ever make, literally. being paid for dinner and shopping dates)",
                    "author": "Fabulous_Storm2437",
                    "id": "ik1gg56",
                    "parent_id": "t1_ik0dmgn",
                    "score": 2,
                    "created_utc": 1660335026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly did you discuss expectations from the start? I mean being physically intimate is a big deal for both parties imho.",
            "author": null,
            "id": "ik17lf7",
            "parent_id": "t3_wmk5t3",
            "score": 4,
            "created_utc": 1660331533.0,
            "replies": []
        },
        {
            "body": "Just dump her and start afresh this can’t be saved\n\nIn the future you need to screen better",
            "author": "wb19081908",
            "id": "ik33fzk",
            "parent_id": "t3_wmk5t3",
            "score": 4,
            "created_utc": 1660361295.0,
            "replies": []
        },
        {
            "body": "paying to not have sex. wild.",
            "author": "Bamkill",
            "id": "ik181zl",
            "parent_id": "t3_wmk5t3",
            "score": 8,
            "created_utc": 1660331716.0,
            "replies": []
        },
        {
            "body": "She’s playing you. There’s no fixing this.",
            "author": "celestialsavage",
            "id": "ijztq76",
            "parent_id": "t3_wmk5t3",
            "score": 9,
            "created_utc": 1660312364.0,
            "replies": []
        },
        {
            "body": "Two months before you had sex! Did she put you in the friend zone by any chance? See other women mate, block her now. I cannot see why you would put up with her if she cannot bring her A game. Money and time don’t grow on trees. Invest them elsewhere.",
            "author": null,
            "id": "ijzzrn0",
            "parent_id": "t3_wmk5t3",
            "score": 10,
            "created_utc": 1660314854.0,
            "replies": []
        },
        {
            "body": "I just told mine she wasn't putting out corresponding to my investment. She of course got pissed, I told her fine, we can end it. About a month later I was in Vegas and sent her a picture of something she missed on our prior trip. She mentioned \"yeah, I'm supposed to be there\" I told her yup, how do you fuck this up? Cut to the end, she's been fucking me weekly now, I've tailed off my investment until we get back in equilibrium. \n\nGood luck, it's not easy.",
            "author": "Beginning_Pear_1263",
            "id": "ik1qcdm",
            "parent_id": "t3_wmk5t3",
            "score": 6,
            "created_utc": 1660339001.0,
            "replies": [
                {
                    "body": "I have had a similar situation.  She wasn’t a bad person but she was inexperienced SB who had a few friends lying to her about what they received for what they provided.  I cut her off.  She met a few others on SA and had bad experiences then come back to me and we were good for another 6 months.  Since then I learned to just end it when I sense entitlement.",
                    "author": "LotBuilder",
                    "id": "ik2u0sb",
                    "parent_id": "t1_ik1qcdm",
                    "score": 5,
                    "created_utc": 1660356596.0,
                    "replies": [
                        {
                            "body": "This is similar. Her first, and my SR. She was listening to a bunch of friends BS. What really keeps it in check, and allows us to repair and advance is I've known her half her life, she's 30, I'm 66. She's in a world of financial hurt, I can and am helping. And for the age difference the sex is pretty damn good. I hope when this ends, we can salvage our previous friendship. Time will tell.",
                            "author": "Beginning_Pear_1263",
                            "id": "ik2uv9n",
                            "parent_id": "t1_ik2u0sb",
                            "score": 5,
                            "created_utc": 1660356994.0,
                            "replies": []
                        },
                        {
                            "body": "It is nice to see not everyone on this subreddit is a simp just begging to be taken advantage of!",
                            "author": "CarnalParamour",
                            "id": "ikccn4p",
                            "parent_id": "t1_ik2u0sb",
                            "score": 1,
                            "created_utc": 1660536902.0,
                            "replies": [
                                {
                                    "body": "There are givers and takers.  I’m a giver.  Unfortunately I had to learn the hard way to set boundaries or completely cut off takers because they have no boundaries.",
                                    "author": "LotBuilder",
                                    "id": "ikcd43a",
                                    "parent_id": "t1_ikccn4p",
                                    "score": 1,
                                    "created_utc": 1660537177.0,
                                    "replies": [
                                        {
                                            "body": "I think most good SDs are givers.\n\nBut in a SR you are just receiving something back also.",
                                            "author": "CarnalParamour",
                                            "id": "ikcdnkj",
                                            "parent_id": "t1_ikcd43a",
                                            "score": 1,
                                            "created_utc": 1660537495.0,
                                            "replies": [
                                                {
                                                    "body": "Most yes,  but there are definitely guys that try to get every ounce out of the other person.   One poor girl I met used to have overnights and the guy would limp dick her for half the night and the morning.  She would be blowing him 20 mins with him getting hard for 1 minute then losing it.  Over and over. Poor girl",
                                                    "author": "LotBuilder",
                                                    "id": "ikce9f5",
                                                    "parent_id": "t1_ikcdnkj",
                                                    "score": 1,
                                                    "created_utc": 1660537867.0,
                                                    "replies": [
                                                        {
                                                            "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
                                                            "author": "CarnalParamour",
                                                            "id": "ikcgul7",
                                                            "parent_id": "t1_ikce9f5",
                                                            "score": 1,
                                                            "created_utc": 1660539482.0,
                                                            "replies": [
                                                                {
                                                                    "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                                                                    "author": "LotBuilder",
                                                                    "id": "ikch142",
                                                                    "parent_id": "t1_ikcgul7",
                                                                    "score": 1,
                                                                    "created_utc": 1660539598.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If it was me, I’d send the following:\n\n“Hey Ms. Dragonfly, I want to make sure we’re on the same page in this relationship.  I’m looking for something where we’re intimate a couple times a month, which would be most of our dates.  The last couple times we went out, I felt like you weren’t making time for us to be alone together.  Please let me know if we’re on the same page.  I really connect with you and I’d hate to have to find someone new.”\n\nThen, before you go on your next date, just say: \n\n“I’m looking forward to having some time alone with you tonight at the hotel.  How late can you hang out?  Or, want to stay overnight?  I’ll order room service or book the spa in the morning, if you like”.",
            "author": "ORD-inary",
            "id": "ijzty3m",
            "parent_id": "t3_wmk5t3",
            "score": 7,
            "created_utc": 1660312457.0,
            "replies": [
                {
                    "body": "I couldn't have said it better myself! In my longest SD-SB relationship (several years), we would discuss what type of date we wanted to have ahead of time. That way, we could both be honest about our time commitments and there was no confusion or disappointment. Sometimes he would ask for a \"hotel date\", other times I would express that I wanted a \"hotel date\" or that I had a busy week but wanted to see him and chat over dinner. \n\nI can't speak for everyone, but as an SB, I'm well aware that SDs want intimacy, and I love that part of a relationship. It's just like any relationship--if your girlfriend seemed to suddenly change her mind about sex, would you just dump her, or would you talk to her about it? I'd hope you would have a conversation first!",
                    "author": "daisywestcoast1",
                    "id": "ik2qv84",
                    "parent_id": "t1_ijzty3m",
                    "score": 4,
                    "created_utc": 1660355127.0,
                    "replies": []
                },
                {
                    "body": "This is a good way to go",
                    "author": "NeighborhoodItchy943",
                    "id": "ik06ixj",
                    "parent_id": "t1_ijzty3m",
                    "score": 1,
                    "created_utc": 1660317508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dump her now. She is playing games already. If you are paying for each date. She needs to give up the sugar. \n\nYou are not being a prick. She is not holding up her end of the deal",
            "author": "CenTexFunGuy",
            "id": "ik04et1",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660316687.0,
            "replies": []
        },
        {
            "body": "You're way overthinking all of this.\n\nIt's a simple contractual verbal agreement for a mutually beneficial relationship.\n\nYou have your needs, she has her needs. If she's not fulfilling your needs you shouldn't be buying her gifts or paying her money, it's as simple as that.",
            "author": "ThrowAwayGuy1945",
            "id": "ik08wgl",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660318410.0,
            "replies": []
        },
        {
            "body": "Just don't pay her . She'll ask why , then you can tell her.",
            "author": "malcolm_reyn0lds",
            "id": "ik0gmuw",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660321360.0,
            "replies": []
        },
        {
            "body": "Yeah, she's moved on (or you're just an ATM to her), but a fun test would be...\n\n\"Hey, I bought you something from Victoria's Secret/Lounge/Agent Provacateur.  Can't wait for you to come over and see how you look in it.\"\n\nIf she says \"Wow that 's great!  Can you just send it to me and I'll send you pictures?\" then move on cowboy.",
            "author": "Patrucio71",
            "id": "ik0ja7b",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660322355.0,
            "replies": [
                {
                    "body": "Thats actually a very good indirect transition into suggesting sex without being blunt about it. I applaud you",
                    "author": "GhostsInTheParrot",
                    "id": "ik47mq3",
                    "parent_id": "t1_ik0ja7b",
                    "score": 1,
                    "created_utc": 1660390331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey girl let's fuck. - you can phrase it differently but get your point across. \n\nIf it's not a fuck yes it's a no.",
            "author": "SD1070",
            "id": "ik25cqj",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660345374.0,
            "replies": []
        },
        {
            "body": "Id be over it.  Dating is sexual and I know a girl would worry if in the heat of the very beginning of our relationship I just stopped hooking up with her.  The nail appointment is really disrespectful.",
            "author": "JDMultralight",
            "id": "ik2ql2m",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660354997.0,
            "replies": []
        },
        {
            "body": "There’s no good way to tell her unfortunately. She’s just a Rinser and she’s just going to get the maximum out of you before you realize the fact. The sooner you end this, the less damaging it will be for your psyche.\n\nAll the best",
            "author": "supportiveceo",
            "id": "ijztcy3",
            "parent_id": "t3_wmk5t3",
            "score": 10,
            "created_utc": 1660312206.0,
            "replies": []
        },
        {
            "body": "Sorry man, she’s not into you at that level.\nKeep the search going and don’t even bother getting into the reasons you are booking less dates.\n\nIt is not common when a SB is really into us at first.  But after a couple of months if the chemistry hasn’t clicked and turned to some sort of attraction then it is just a job for her.\n\nDo you both a favor and just politely move on.  No harm done.",
            "author": "TXPolyDaddy",
            "id": "ijzzzv4",
            "parent_id": "t3_wmk5t3",
            "score": 5,
            "created_utc": 1660314943.0,
            "replies": []
        },
        {
            "body": ">I'm half inclined to think she's just playing me, but I feel like she deserves a chance because I really do like her a lot. \n\nYou should be fully inclined to think that she's just playing you, because she is. Why would you think she deserves another chance when she's clearly taking advantage of you and basically talking you for a sucker. She doesn't like you and is treating you like trash. You need to see through her BS and see her for what she is. Learn from this or you'll just end up in the same situation again.",
            "author": "non_giant_panda",
            "id": "ijzxf70",
            "parent_id": "t3_wmk5t3",
            "score": 5,
            "created_utc": 1660313905.0,
            "replies": []
        },
        {
            "body": "Dude stop wasting your money and time. Learn from this mistake and move on",
            "author": "CryptographerFast835",
            "id": "ik06fsb",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660317476.0,
            "replies": []
        },
        {
            "body": "You’re being majorly used. If you’re actually treating her like a SB and giving her an allowance or PPM and she’s doing that it’s pretty messed up.",
            "author": "lifting12",
            "id": "ik0cxqm",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660319954.0,
            "replies": []
        },
        {
            "body": "Here is the thing.\n\nI come up with 3 likely scenarios, in order (in my opinion) of their likelihood.  None of them bode well for you.\n\nScenario 1:  She's playing you.  This was a slow rinse, and her goal is going to be to sleep with you as little as possible.\n\nScenario 2:  She's just not into you physically/sexually.  So she's putting sex off, and trying to limit it as much.  While still reaping the rewards.\n\nScenario 3:  She likes you, but she isn't that into sex.\n\nI mean, the only scenario that isn't remotely awfully is scenario 3, but that still isn't tenable for a sugar relationship.",
            "author": "SDstartingOut",
            "id": "ik0je6q",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660322397.0,
            "replies": [
                {
                    "body": "I think scenario 3 could be fixable. The best part of any sexual relationship is getting to know what turns the other person on, and exploring new sexual boundaries. I think there is a lot of pressure for SBs to just \"put out\" when really, it should be two people having fun and exploring together. Part of that means asking her what she wants in bed! (If she seems dismissive or disinterested, that would be a red flag--but she may just have specific kinks or moves she likes in the bedroom that she was too shy to mention).",
                    "author": "daisywestcoast1",
                    "id": "ik2rfp0",
                    "parent_id": "t1_ik0je6q",
                    "score": 1,
                    "created_utc": 1660355388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Third time charm, if she comes again with some bs excuse, block, delete, move on. I can understand that great nail tech are busy and it is sometimes difficult to get appointment, I also understand that friends sometimes needs us. But unless she uses you she is upfront and reassuring that you will make up for the last time she did not have time. If your gut feeling is telling you she is using you, skip the third date and just block, delete and move on.",
            "author": "idontlikespiderplant",
            "id": "ik1m2tv",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660337252.0,
            "replies": []
        },
        {
            "body": "Love without sex is not love but sex without love is still sex. Unless she’s gravely ill (period doesn’t count) there’s no excuse. Find another SB ASAP.",
            "author": "No_Tomatillo_5284",
            "id": "ik1ok36",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660338255.0,
            "replies": []
        },
        {
            "body": "Next her\n\nWhy are you paying her",
            "author": "LuckyINTJ",
            "id": "ik26o08",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660345947.0,
            "replies": []
        },
        {
            "body": "She is playing you. If you were doing this for sex then you should've had sex the first time you met. You might as well go out with a regular girl. It will cost you less if you're only paying for actual dates instead of ppm.\n\nBtw the part of her being nervous and new to this is a joke. She's done this plenty of times. You're not the first or last person she's going to try this on.\n\nMove on. Put your money to better use on a girl that is going to bang you",
            "author": "Heree2Comment",
            "id": "ik28919",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660346650.0,
            "replies": []
        },
        {
            "body": "You gotta be straight up honest. No funny, no money.",
            "author": "Automatic_Joke_4414",
            "id": "ik2kp03",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660352305.0,
            "replies": []
        },
        {
            "body": "“Hey, for me this is like dating and part of dating is intimacy when we both feel like it. I noticed we haven’t done that recently so I wanted to see if perhaps you aren’t interesting in a dating relationship after all, despite the closeness we shared the first time.”",
            "author": "SD-47",
            "id": "ik2sqi2",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660356003.0,
            "replies": []
        },
        {
            "body": "I would just not commit to another date.  When she asks why, just say “I just don’t feel a spark.”\n\nLet her chase you if she wants to make it work.",
            "author": "robhudsondfw",
            "id": "ik39q5g",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660364802.0,
            "replies": []
        },
        {
            "body": "It does sound like she doesn’t enjoy spending time with you. \n\nSex is easy but faking feelings is always hard. \n\nMoney can’t buy feelings .. so if you think she just doesn’t want to spend time with you, you should find another girl who genuinely does. \n\nPaying her more money won’t solve this problem.",
            "author": null,
            "id": "ik3e80e",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660367594.0,
            "replies": []
        },
        {
            "body": "Next",
            "author": "blk-tye",
            "id": "ik3v1o8",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660380183.0,
            "replies": []
        },
        {
            "body": "You're being rinsed my friend. I used to do half PPM for a SB, but sometimes, I said no, I'd rather catch a movie or do something else. She had to text me a code word beforehand so I could opt out, and I oftentimes I did, but not always. \n\nI had put her on allowance but she started to miss meets. So I returned her to PPM. Truth is, I didn't mind an occasional platonic or activity only meet, but since she also had a boyfriend at some point, it didn't feel right to pay her for platonic (rinsing me). \n\nSo you have to tell her she's getting paid only is she puts out, unless you agree to a platonic meet. If she doesn't intend to put out, tell her she has to tell you beforehand so you can opt out. Otherwise, if she does the meet and it's platonic, you're not paying her. \n\nShe's playing on your confusion and lack of clarity and experience right now, and you have to stop paying her when she doesn't put out. You're the one paying, lead and clarify the rules, if she's unhappy, to bad for her, you'll find someone else. Act like you don't care if you need to replace her, even if you do a little.",
            "author": "sugardad123",
            "id": "ijztpvb",
            "parent_id": "t3_wmk5t3",
            "score": 6,
            "created_utc": 1660312360.0,
            "replies": []
        },
        {
            "body": "It’s time to end it.  Just tell her it’s not working out and wish her well.  \n\nIf she wants to know why you’re ending it you can get into specifics, but I’m guessing she’ll just move on.",
            "author": "NVOkie9018",
            "id": "ijzucqq",
            "parent_id": "t3_wmk5t3",
            "score": 4,
            "created_utc": 1660312629.0,
            "replies": []
        },
        {
            "body": "Do you like to lather up with soap right before meeting you? That way the rinsing is much more satisfying …",
            "author": "daddoms",
            "id": "ijzyubv",
            "parent_id": "t3_wmk5t3",
            "score": 3,
            "created_utc": 1660314477.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ik0021c",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660314968.0,
            "replies": [
                {
                    "body": "Exactly, this dude lost the battle months ago",
                    "author": null,
                    "id": "ik0jlt2",
                    "parent_id": "t1_ik0021c",
                    "score": 2,
                    "created_utc": 1660322474.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She’s not into you, tried to rinse you, then finally gave into sex once and is doing everything she can to keep subsequent dates platonic.  There is zero way to turn this into what you want.  Give up now before you waste any more energy and money.",
            "author": "UseTheForceRey",
            "id": "ijzwkt6",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660313555.0,
            "replies": []
        },
        {
            "body": "Assume it's over and stop reaching out to her. If she reaches out to you with a \"Hey, do you want to get together?\" respond with \n\n\"do you? the last couple of times we've seen each other you were in a rush to leave and I feel like you were only there for what you were getting out of it. I'm not an ATM so if that's how this is going to be, you need to find someone else. If you want to pursue a real SR, then yes, I'd be interested in seeing you again.\"\n\nI've done this in similar (not exact) situations and ended up getting some toe curling \"I'm sorry for treating you that way\" sex out of it.",
            "author": "Then-Explanation8567",
            "id": "ik1qr3f",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660339172.0,
            "replies": [
                {
                    "body": "Brother, that reads *extremely* hostile.",
                    "author": "JDMultralight",
                    "id": "ik2tkwa",
                    "parent_id": "t1_ik1qr3f",
                    "score": 0,
                    "created_utc": 1660356394.0,
                    "replies": [
                        {
                            "body": "I just have very little patience for being taken advantage of",
                            "author": "Then-Explanation8567",
                            "id": "ik43otv",
                            "parent_id": "t1_ik2tkwa",
                            "score": 1,
                            "created_utc": 1660387419.0,
                            "replies": [
                                {
                                    "body": "I guess the thought for me is that laying down the law that hard shifts  the dynamic out of the sugar “good place” so might as well bail before doing that.  Like she could be really uneasy and you wont know - then youve got a scared sb which is kinda awful",
                                    "author": "JDMultralight",
                                    "id": "ik5rki9",
                                    "parent_id": "t1_ik43otv",
                                    "score": 1,
                                    "created_utc": 1660416280.0,
                                    "replies": [
                                        {
                                            "body": "I don't even see that as coming down hard. To me coming down hard would be \n\n\"You're going to show up on time and I'll deduct from your gift for every minute you're late. You're going to wear what I tell you to and you aren't going to leave until I'm satisfied.\"\n\nWhat I posted (and said to a SB once) is basically a very blunt  callout that essentially says \"hey, this is supposed to be a mutually beneficial relationship with an obvious give and take. I feel like I've been holding up my end but you've been coming up short on yours\"\n\nAs for shifting the dynamic, she already did that. She made it a \"pay me to go to dinner with you\" arrangement without OPs consent. He expected a fairly traditional SR with the trappings of a relationship. My suggestion would either move it back to what they originally agreed to or end things. Regardless of the outcome, OP wouldn't be in a SR that he wasn't happy with anymore.",
                                            "author": "Then-Explanation8567",
                                            "id": "ik8t1wj",
                                            "parent_id": "t1_ik5rki9",
                                            "score": 2,
                                            "created_utc": 1660478802.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ahhhhh I had the SAME problem. And I so wanted it to be that this kid was well mending, just naive or whatever. I so didn’t want them to be a scammer. \n\nBut they were.  \n\nEventually I did have a “so you know what your side of the deal is…” talk and it was fucking awkward.  It was like a poor job performance review.   Very odd. It didn’t help, they for sure knew what was expected, strung me on for a few more weeks anyway, until I finally dumped them and they basically said “oh, okay cool”. \n\nThat stung, actually.  \n\nBut yeah.  Serious talk time and then I think you’ll have to walk.  I’m sorry",
            "author": "TemperatureBig5672",
            "id": "ijzvgdz",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660313089.0,
            "replies": []
        },
        {
            "body": "What you have is all the disadvantages of vanilla dating with the disadvantages of sugar dating.  That is you aren't getting sex and you are paying for to not get laid. \n\nI get accused of being too transactional, but that is because I want both parties to know the rules up front:  I gift so much for a platonic date and so much more for an intimate date and so much more for an overnighter or trip.\n\nYou should drop this one and toughen up with your next one.",
            "author": "Psychological-Ad5939",
            "id": "ijzyr6t",
            "parent_id": "t3_wmk5t3",
            "score": 2,
            "created_utc": 1660314443.0,
            "replies": [
                {
                    "body": "While I generally don't agree with PPM's, your approach makes sense in a situation like this. OP wouldn't waste a full PPM on a girl that never holds up her end of the relationship, and it would be clear to her that he wants intimacy. But if this girl IS a rinser, she would be happy with taking the bare minimum PPM for basically just showing up for a dinner date. That's how most uninitiated girls think being a sugar baby works anyway 🤷‍♀️",
                    "author": "HailToTheQuinn",
                    "id": "ik0cmxh",
                    "parent_id": "t1_ijzyr6t",
                    "score": 3,
                    "created_utc": 1660319841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "just don't pay her until actually in your hotel room or bedroom\n\nif she needs to dip out after the date, cool\n\ndon't pay her. let her leave",
            "author": "isthisit51",
            "id": "ik0a988",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660318934.0,
            "replies": []
        },
        {
            "body": "I’m sorry, I think she’s playing you. It wouldn’t hurt to have an honest conversation, but best for both parties would be to end things. There’s a pattern here and it’s not changing.",
            "author": "Phagoat",
            "id": "ijzxz25",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660314125.0,
            "replies": []
        },
        {
            "body": "I probably would not even bother talking about my feelings or expectations but instead just ghost and block, and then find someone who will happily and enthusiastically jump my bones. \n\nThe world is full of dead bedrooms. Don’t be paying for a dead bedroom.",
            "author": null,
            "id": "ik11jiw",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660329194.0,
            "replies": []
        },
        {
            "body": "That you would express the issue as ,\n\n \" she's got to start putting out\" \n\n might indicate an incompatibility.",
            "author": "pinotandsugar",
            "id": "ik23whs",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660344744.0,
            "replies": []
        },
        {
            "body": "Sorry, brother. Sounds like a fierce conversation I’d in order. Be ready to stand your ground and walk away unless there is an immediate apology and commitment to change. \n\nIn leadership we call this a Performance Improvement Plan (PIP) which you might have heard of before.",
            "author": "NorthEastSD",
            "id": "ijzto3j",
            "parent_id": "t3_wmk5t3",
            "score": 0,
            "created_utc": 1660312339.0,
            "replies": []
        },
        {
            "body": "Just let her know you were hoping to have a more physical arrangement, if she doesnt want that then youre going to start dating again to see if you can find it. You enjoy her company and would love that person to be her but doesnt look like its going in that direction. If she still wants to meet and have this platonic relationship youre happy to buy dinner or pay for whatever you are doing but your PPM will be going to this other girl.  \nIm happy to hang out platonically with someone I have been seeing for a while but generally thats under the terms of an allowance not PPM for me.",
            "author": "Upper-District-50",
            "id": "ijztsrb",
            "parent_id": "t3_wmk5t3",
            "score": 0,
            "created_utc": 1660312395.0,
            "replies": []
        },
        {
            "body": "There is no fixing this.  Given her ducking out on multiple occasions, she is rinsing you.  Just end it and tell her why.",
            "author": "Mainlyharmless",
            "id": "ijzunqi",
            "parent_id": "t3_wmk5t3",
            "score": 0,
            "created_utc": 1660312758.0,
            "replies": []
        },
        {
            "body": "Don’t. It’s not going to work out for you. \nGo find someone that’s willing to fulfill your needs. \n\nShe’s aware and she’s choosing to do this, to see what you’ll do or not do. \n\nBecause he says something about it all she gonna say is this isn’t supposed to be all about sex and throw it back at you. The only way our address is it say you’re needing more sexy time, if she cares she’ll respond in kind and well if she doesn’t… she doesn’t care\n\nIf she’s dipping out earlier like that bro she’s playing you. Call her out respectfully and just tell her that’s if she’s going to remain in with you that isn’t something you’re going to allow for a lady in your life, and you get emergencies happen no big deal. \n\nIf she gets aggressive and augmentative with you,  leave  her. \n\nTo me the only acceptable response is her saying she understands, accepts it, or apologies as she didn’t realize it made you feel that way. \n\n\nShe’s shit testing you, and seeing if she can get away with it. \n\nIf she does anything besides reply in agreement, she’s doing you a favor and showing you her true nature. It’s not a debate it’s not a negotiation. \n\nIf you’re going to be in my life as a lady in my life this is the standard of respect I’m expecting and not going to allow anything less.",
            "author": "ntxstud007",
            "id": "ijzx0c0",
            "parent_id": "t3_wmk5t3",
            "score": 0,
            "created_utc": 1660313734.0,
            "replies": []
        },
        {
            "body": "Phrase it like this: “I expect from now on that you put up more efforts consistently if you want this SR to move forward”. \nThat is the best way. \n\nPS: i had only read tue tittle. So, here are a follow up. You just finished your Sugar Class 101. Now you know what not to do. \nMove to the next class and get yourself a new and better “tutor”. 😀",
            "author": "gapaf",
            "id": "ik02ubn",
            "parent_id": "t3_wmk5t3",
            "score": 0,
            "created_utc": 1660316077.0,
            "replies": []
        },
        {
            "body": "*\"Darling, I just want to make you aware that this relationship isn't meeting my needs so I am moving on. While you've been lavished with gifts, wined and dined, there hasn't been the mutual benefits that comes with this type of relationship.\"*\n\nBet you a donut that she wants to see you TONIGHT, wants to bring satisfaction to all your needs...and then goes back to the way she was, sadly.",
            "author": "Awkward_Solution_567",
            "id": "ijzzs5e",
            "parent_id": "t3_wmk5t3",
            "score": -1,
            "created_utc": 1660314859.0,
            "replies": [
                {
                    "body": "That last line hit hardest 😂",
                    "author": "DragonflyDry9717",
                    "id": "ik42k7j",
                    "parent_id": "t1_ijzzs5e",
                    "score": 1,
                    "created_utc": 1660386518.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No honey, no money. It works both ways.",
            "author": "SD1971",
            "id": "ik02e2k",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660315900.0,
            "replies": []
        },
        {
            "body": "Dump her IMMEDIATELY. Colossal prick mode approved.",
            "author": "StealyMissile",
            "id": "ik04ugr",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660316854.0,
            "replies": []
        },
        {
            "body": "She wasn't into you only your wallet. I would just ghost her. I'm not usually into that but in this case I would think it's appropriate.",
            "author": "Federal_Garage_4307",
            "id": "ik0erpa",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660320656.0,
            "replies": []
        },
        {
            "body": "It looks like you've given her two chances already. \n\nSo unless you have a colossal prick, you are but a dinner and cash dispenser.",
            "author": "ohh-daddy",
            "id": "ik0eygv",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660320728.0,
            "replies": []
        },
        {
            "body": "I would honestly move on.",
            "author": "Cdnsugarr",
            "id": "ik0f0ew",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660320748.0,
            "replies": []
        },
        {
            "body": "Ask if u don’t like the answer move on. If u don’t like the answer and u still stay around u just like being shitted on 🤣🥹 and if so I like free money too :P but I’m way nicer I like sex ;) \nGood luck dudesy",
            "author": "Organic-Med-1999",
            "id": "ik0hcom",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660321628.0,
            "replies": []
        },
        {
            "body": "Next. There is much better in the bowl, and the sooner you start looking again, the sooner you will get to enjoy having your needs met.",
            "author": "SeaSDOptimist",
            "id": "ik0hoid",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660321753.0,
            "replies": []
        },
        {
            "body": "She’s SUPER playing you unless she’s so inept that she can’t pick up on social cues or understand how this works. \n\nTell her your expectations and needs for being able to continue to see her. Tell her you want a relationship/friendship with a woman that would include sex and that you’re not pressuring her to do anything she isn’t comfortable with but if she doesn’t feel the same way towards you then it won’t workout. Key is to not come off entitled to sex because you’re supporting her, but to have her understand you want there to be a mutual desire for intimacy and frequency and the allowance has nothing to do with it = you want to be wanted etc.",
            "author": "spicycookie26",
            "id": "ik0p7mw",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660324509.0,
            "replies": []
        },
        {
            "body": "she's playing you. no reason she 'has' to help a friend shop. and that's something that can definitely be rescheduled. so she is taking advantage, but this doesn't mean that you have to start making ultimatums. that can damage the level of trust that you've already built should the relationship actually be repairable. it should be approached cautiously\n\njust explain that she has her needs - which you are meeting. and you have yours - which are not being met at the current time. if there's no sugar for you on the next date, there won't be sugar for her either. if this doesn't change, then it's clear that you're not compatible and you'll have to end the relationship. if she reacts poorly to this (indignant, angry, etc) then it's over and you should part ways",
            "author": "davitech73",
            "id": "ik0rw21",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660325519.0,
            "replies": [
                {
                    "body": "There is no trust built here - she is coming up with BS excuses, I would not call such approach trust.",
                    "author": "SeaSDOptimist",
                    "id": "ik0zkkj",
                    "parent_id": "t1_ik0rw21",
                    "score": 2,
                    "created_utc": 1660328445.0,
                    "replies": [
                        {
                            "body": "it could be bs excuses. and it could be life getting in the way. i tend to think it's the former. point is, -if- there is any trust left, laying down an ultimatum could destroy that. then -if- that's a concern, proceed with caution. the alternative is to cut loses and run. it's really up to the op how to proceed\n\nsolutions aren't always to bring in a hammer and start destroying things. it's an option, but not the only path",
                            "author": "davitech73",
                            "id": "ik1fotp",
                            "parent_id": "t1_ik0zkkj",
                            "score": 1,
                            "created_utc": 1660334728.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well don’t like her a lot if she’s not reciprocating a lot, she’s using you… tell her the deal, it’s not negotiable… if you can’t agree, cut her loose… my sb and I have a blast, bang it out every time without even discussing… she never has cancelled, always shows up on time, always happy and engaging and asks for nothing from me!! I treat her very well…. Great sb’s are out there… yours is not a good one…",
            "author": "BigTinBaltimore",
            "id": "ik0t6ix",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660326014.0,
            "replies": []
        },
        {
            "body": "Time to move on. This one is that simple.",
            "author": "Ssd4me408",
            "id": "ik0yiwd",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660328047.0,
            "replies": []
        },
        {
            "body": "She sounds awful!  Find a new SB.",
            "author": "unique_leek_critique",
            "id": "ik18slg",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660332010.0,
            "replies": []
        },
        {
            "body": "I think you should explain it to her exactly like you did in this post, tell her you enjoy her company and tell her she needs to be more consistent with the intimacy. Or find a new SB who will be more than happy to.",
            "author": "39sherry",
            "id": "ik194jc",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660332138.0,
            "replies": []
        },
        {
            "body": "Be straight up with your expectations. I don’t know why so many SB and SD don’t do this.",
            "author": "SW1981",
            "id": "ik1dnu9",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660333938.0,
            "replies": []
        },
        {
            "body": "sounds like she has cold feet on the sex but does enjoy your company or your money or both. Communication is usually the key! just something like, \"hey, i have really been enjoying this and was wanting to see your comfort level with things progressing physically a little more?\". throw in specific things that have been attracting you, daydreaming you might have been doing about her, depends on your conversation style.  It is also possible you got bait and switched, i had this happen where once its time for intimacy you get the \"I;m not comfortable with that\". You have to respect it when you hear it, but it might be a deal breaker. and she would know that.... part of why she might not have brought it up but could be relieved if you do.",
            "author": "Fabulous_Storm2437",
            "id": "ik1fgxe",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660334642.0,
            "replies": []
        },
        {
            "body": "interesting topic and discussion, one more thought to add to the pile:  if you are doing sugar dating for personal growth, which i know not many acknowledge but i do, then use it as an opportunity to practice assertive communication - just as suggested, communicate your feelings, assertively. You could be kind and say \"I just wanted to make sure you're feeling ready\" or you could point back to a prior agreement \"I just wanted to see if anything changed since we agreed on \\_\\_\\_\\_ because I am sensing something may have changed\". depends on the style you are comfortable with. \n\nBut this is not to resolve the situation - it is already clear that is over. It is to get better at proactively communicating, and linking it back to YOUR FEELINGS while also taking hers into consideration. I have learned that when you explain how something makes you feel, it shows the emotional impact something is having on you and that is something people cannot criticize. you have a right to your feelings, as long as you aren't making your feelings more important than hers. And maybe it can fix the situation - sometimes communication can do that. it's hard. good luck",
            "author": "Fabulous_Storm2437",
            "id": "ik1i3py",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660335677.0,
            "replies": []
        },
        {
            "body": "I’d say that you’re being fleeced and not in a good way. \n\nHaving sex after a month makes me think she really isn’t into you as this has never happened to me before (apart from that one moisturiser incident lol!) so I’d sadly move on. \n\nLet me tell you - it ain’t gonna improve no matter what you say or propose. \n\nI mean getting nails done or going shopping with a friend after dinner - classic diversion tactics. \n\ndrop her like a sack of potatoes buddy right now and freeze your feelings as she clearly ain’t got any for you.",
            "author": "Jonconnerysd",
            "id": "ik1o1ms",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660338045.0,
            "replies": []
        },
        {
            "body": "Move on bro.",
            "author": "Frosty-Surprise-6059",
            "id": "ik1trwg",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660340419.0,
            "replies": []
        },
        {
            "body": "You're paying PPM when no sex takes place? Why?",
            "author": "gaxxzz",
            "id": "ik1v00y",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660340932.0,
            "replies": []
        },
        {
            "body": "Sounds like she’s basically rinsing you. I’d recommend not initiating any more dates. If she asks, something like “I don’t feel like we’re a match anymore” is vague enough. If she presses, “sex and attraction are important to me, and we weren’t having anywhere near enough sex to convince me that the attraction went both ways”.",
            "author": "sdthrowaway006",
            "id": "ik1vmm8",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660341194.0,
            "replies": []
        },
        {
            "body": "Def sounds like she's using you as a walking ATM. Just talk to her n if she comes up with excuses just move on",
            "author": "Canadian_Ricky",
            "id": "ik202su",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660343090.0,
            "replies": []
        },
        {
            "body": "I learned that the hard way after 6 months of no sex with my very first sb.  I guess I’m a slow learner.",
            "author": "TaskMaster59",
            "id": "ik20ipo",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660343281.0,
            "replies": [
                {
                    "body": "Ah yeah that's rough. I mean, when you're positively smitten with a woman, I guess you'll put up with a lot yeah?\n\nFunny how even at our age we can still fall for someone so hard.",
                    "author": "DragonflyDry9717",
                    "id": "ik22yhj",
                    "parent_id": "t1_ik20ipo",
                    "score": 1,
                    "created_utc": 1660344338.0,
                    "replies": [
                        {
                            "body": "If you equate attractiveness with eagerness you will fall into this trap.",
                            "author": "BusddhistDSM",
                            "id": "ik2js80",
                            "parent_id": "t1_ik22yhj",
                            "score": 1,
                            "created_utc": 1660351879.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No sugar without sugar.  Don't give PPM unless physical activities will be done.  Don't PPM until back at the hotel",
            "author": "MrRhoarke",
            "id": "ik2f35k",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660349724.0,
            "replies": []
        },
        {
            "body": "If sugar dating has taught me anything, it's that both parties need to be up front about their wants and needs. Maybe intimacy isn't off the table for her, but she might need something she isn't getting. (It's just as much on her to communicate that with you as it is on you to ask her about it, but it doesn't hurt to be the one to start the conversation). \n\nPersonally, I would say something like \"Intimacy is important to me in a relationship.\" That's a very normal need and want in any kind of dating situation, and sugaring is no different.",
            "author": "daisywestcoast1",
            "id": "ik2px9o",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660354691.0,
            "replies": []
        },
        {
            "body": "I think I would just leave this relationship though.  There’s an understanding that this relationship is supposed to be highly sexual.\n\nJust not being sexual and not saying shit about it is like not discussing any relationship issue that is obviously going to disappoint your partner.  Its disrespectful - shows you dont give a fuck about what makes them happy.",
            "author": "JDMultralight",
            "id": "ik2smri",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660355954.0,
            "replies": []
        },
        {
            "body": "Have you guys discussed the expectation prior to establishing this relationship?",
            "author": "discreteSD",
            "id": "ik36b4a",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660362844.0,
            "replies": []
        },
        {
            "body": "Idk I may be new but that's something I wouldn't do! She's probably playing you sir and I'm sorry to say this but you probably need to find someone that's going to actually want to be with you because she's just there for the money. Aka this is just another pay day to her.",
            "author": "UniqueCrowsNest",
            "id": "ik3lw4j",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660372884.0,
            "replies": []
        },
        {
            "body": "\\> Is there any way to word this without coming across like a colossal prick?\n\n&#x200B;\n\nYes. Silence, and never contact her again or return her messages. Mate, you have been owned. There is no another scenario. I'm sorry.",
            "author": "SeekingInSydney",
            "id": "ik839kv",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660458506.0,
            "replies": []
        },
        {
            "body": "New to \"the sugaring\" or not....if you're paying me an allowance ALREADY or a ppm AND you already got me gifts and dinner....pssshhhaaa, YEAH, hun....you need to have a talk with her on this.  Part of the fun of sugaring, is that we CAN be more up front and honest, bc sugaring is supposed to leave the bullshit at the door.",
            "author": "JustAsk4Alice",
            "id": "ika7k52",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660501658.0,
            "replies": []
        },
        {
            "body": "The irony is that OP is annoyed at her because she treats him exactly like he treat her. \n\n“One of the reasons I’m doing this is sex” well the reason she’s doing this is the cash. Maybe she is thinking exactly the same thing like “maybe he’s playing me” and trying to jump ship before it sinks 🤷",
            "author": "b_n008",
            "id": "ikcr1sx",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660546793.0,
            "replies": []
        },
        {
            "body": "Wait wait wait ...... sugar daddy's are real?????",
            "author": "killakrissy82",
            "id": "ikt2mrz",
            "parent_id": "t3_wmk5t3",
            "score": 1,
            "created_utc": 1660836790.0,
            "replies": []
        },
        {
            "body": "yeah, i thought that too. at a bare minimum she should have kept that time open \"just in case\".... so the obvious conclusion is that she wanted the time blocked out so there won't be a \"just in case\" opportunity. You probably aren't going to get anywhere further - worth finding out for sure but instinct is probably right in this matter",
            "author": "Fabulous_Storm2437",
            "id": "ik1frd1",
            "parent_id": "t1_ijzrzpl",
            "score": 18,
            "created_utc": 1660334754.0,
            "replies": []
        },
        {
            "body": "she used the money OP gave her to pay for the nails appointment\n\nseeing OP is actually a pit stop to the ATM. she's gotta pick up the cash for the nails appointment. OP is a good cash dispenser. she's actually really smart",
            "author": "isthisit51",
            "id": "ik0aeeh",
            "parent_id": "t1_ijzrzpl",
            "score": 69,
            "created_utc": 1660318990.0,
            "replies": []
        },
        {
            "body": "And when he cuts the cord she’ll come here and complain he wasn’t a real sugar daddy.",
            "author": "andrewofflorida",
            "id": "ik2g8c9",
            "parent_id": "t1_ijzrzpl",
            "score": 14,
            "created_utc": 1660350241.0,
            "replies": []
        },
        {
            "body": "That might not be true — I’ve had to do that before when my nails looked like trash and that was the only time I actually had for nails, but then I later scheduled the date with SD… I couldn’t say no to either one, so I went after the date.",
            "author": "Koroleva7z",
            "id": "ik0ukn5",
            "parent_id": "t1_ijzrzpl",
            "score": 8,
            "created_utc": 1660326534.0,
            "replies": [
                {
                    "body": "if it was a date, wouldn't she have wanted the nails nice prior to the meetup? or is there another more important date to get ready for?",
                    "author": "Fabulous_Storm2437",
                    "id": "ik1fwak",
                    "parent_id": "t1_ik0ukn5",
                    "score": 10,
                    "created_utc": 1660334808.0,
                    "replies": [
                        {
                            "body": "Tbf she could have multiple SDs (but if that’s the case, she might not to work on her time management…)",
                            "author": "paroxysmique",
                            "id": "ik1kimk",
                            "parent_id": "t1_ik1fwak",
                            "score": -4,
                            "created_utc": 1660336633.0,
                            "replies": [
                                {
                                    "body": "sounds like one of them is about to be freed up, so she will have more time, but might need to find a cheaper nail place with the lost income",
                                    "author": "Fabulous_Storm2437",
                                    "id": "ik1pwdx",
                                    "parent_id": "t1_ik1kimk",
                                    "score": 4,
                                    "created_utc": 1660338811.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You couldn't ask if you could reschedule the date?",
                    "author": "NinCarolina",
                    "id": "ik32qrw",
                    "parent_id": "t1_ik0ukn5",
                    "score": 1,
                    "created_utc": 1660360926.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah you know, reading this comment, it really made me realize the gravity of my situation ... am I really trying to convince her to let me *pay for sex*? 😂\n\nHoly fuck man I need a drink.",
            "author": "DragonflyDry9717",
            "id": "ik42txp",
            "parent_id": "t1_ik00100",
            "score": 33,
            "created_utc": 1660386737.0,
            "replies": [
                {
                    "body": "This is part of the flawed thinking that sometimes occurs with women in general, Some SB’s in particular. The belief that all men equally value the time and attention that they give us with sex, so we should be happy (and pay for) the former even if we’re not getting the latter.",
                    "author": "Truly-2nd-2none",
                    "id": "ik8wm05",
                    "parent_id": "t1_ik42txp",
                    "score": 8,
                    "created_utc": 1660480967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "~~I will NOT beg to pay for sex.~~\n\nI will NOT pay to beg for sex.\n\nFtfy",
            "author": "cuse13203",
            "id": "ik21aiz",
            "parent_id": "t1_ik00100",
            "score": 43,
            "created_utc": 1660343615.0,
            "replies": []
        },
        {
            "body": "This should be the top piece of advice for SDs.",
            "author": null,
            "id": "ik07bu3",
            "parent_id": "t1_ik00100",
            "score": 29,
            "created_utc": 1660317811.0,
            "replies": []
        },
        {
            "body": "100000%",
            "author": null,
            "id": "ik1n19x",
            "parent_id": "t1_ik00100",
            "score": 5,
            "created_utc": 1660337634.0,
            "replies": []
        },
        {
            "body": "Please don't beg for sex, pressuring someone to sleep with you is damaging to both people involved. Just move on",
            "author": "kneesocksbabe",
            "id": "ik146dv",
            "parent_id": "t1_ik00100",
            "score": 25,
            "created_utc": 1660330204.0,
            "replies": [
                {
                    "body": "it meant metaphorically begging.... like bringing up something that should have already been agreed to as a commitment, that kind of begging",
                    "author": "Fabulous_Storm2437",
                    "id": "ik1g0x6",
                    "parent_id": "t1_ik146dv",
                    "score": 22,
                    "created_utc": 1660334859.0,
                    "replies": [
                        {
                            "body": "or as a metaphor for vanilla dating, where You are courting someone and just hoping that sex will be the outcome of what you are doing.",
                            "author": "joc13",
                            "id": "ik1jfad",
                            "parent_id": "t1_ik1g0x6",
                            "score": 8,
                            "created_utc": 1660336198.0,
                            "replies": [
                                {
                                    "body": "you could always just tell the other person you want sex and not need to hope.",
                                    "author": "leavsssesthrowaway",
                                    "id": "ik2hav6",
                                    "parent_id": "t1_ik1jfad",
                                    "score": 2,
                                    "created_utc": 1660350734.0,
                                    "replies": [
                                        {
                                            "body": "yeah, cause that goes over really when vanilla dating 😂",
                                            "author": "joc13",
                                            "id": "ik2m4a3",
                                            "parent_id": "t1_ik2hav6",
                                            "score": 5,
                                            "created_utc": 1660352949.0,
                                            "replies": [
                                                {
                                                    "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
                                                    "author": "leavsssesthrowaway",
                                                    "id": "ik2obeq",
                                                    "parent_id": "t1_ik2m4a3",
                                                    "score": -1,
                                                    "created_utc": 1660353955.0,
                                                    "replies": [
                                                        {
                                                            "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                                                            "author": "joc13",
                                                            "id": "ik2oo8c",
                                                            "parent_id": "t1_ik2obeq",
                                                            "score": 17,
                                                            "created_utc": 1660354118.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                                                                    "author": "leavsssesthrowaway",
                                                                    "id": "ik2ovp2",
                                                                    "parent_id": "t1_ik2oo8c",
                                                                    "score": 2,
                                                                    "created_utc": 1660354212.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                                                            "author": "Briellexox",
                                                            "id": "ikdoo9a",
                                                            "parent_id": "t1_ik2obeq",
                                                            "score": 3,
                                                            "created_utc": 1660569916.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                                                                    "author": "leavsssesthrowaway",
                                                                    "id": "ikdq61f",
                                                                    "parent_id": "t1_ikdoo9a",
                                                                    "score": 1,
                                                                    "created_utc": 1660570607.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It’s gentlemanly to pay for a lady.",
                                                                            "author": "Briellexox",
                                                                            "id": "ikdukbr",
                                                                            "parent_id": "t1_ikdq61f",
                                                                            "score": 1,
                                                                            "created_utc": 1660572536.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes it is - but you kinda have to tell someone that your sexual needs not being met is just putting you off of them.  That’s pressure -  Im going to take away an income stream on par with all your basic expenses away if you dont have sex at times when you wouldnt do so naturally.  It’s actually pressure just built in.  Terrible but true.",
                    "author": "JDMultralight",
                    "id": "ik2se0r",
                    "parent_id": "t1_ik146dv",
                    "score": 3,
                    "created_utc": 1660355838.0,
                    "replies": [
                        {
                            "body": "And hence, mutually beneficial and what a man wants in an arrangement takes a back seat to what she want/needs. The reason the income stream for her exists is because she has agreed to certain behaviors. I can’t expect my employer to continue to pay me if I stop performing the work that I agreed to, so why can a SB?  Unless sugaring and being a SD has turned into a charity and someone failed to inform me.  Glorify it as some may want, SR is the exchange of goods for services.",
                            "author": "Truly-2nd-2none",
                            "id": "ik8x573",
                            "parent_id": "t1_ik2se0r",
                            "score": 3,
                            "created_utc": 1660481271.0,
                            "replies": []
                        },
                        {
                            "body": "Woah",
                            "author": "madhuraksha",
                            "id": "ik3gomd",
                            "parent_id": "t1_ik2se0r",
                            "score": 2,
                            "created_utc": 1660369209.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I may be naive, but I agree. I don't think she's intentionally trying to rinse me. I actually do think there's a physical attraction there. Yes I know it's possible to stroke someone's ego to make them feel that way, but I've been around long enough to know the difference between a woman who's playing me and a woman who's not. \n\nI was fine with the non-sexual arrangement for a while, but I guess having sex with her changed that. It was phenomenal. \n\nBut as you say, someone being excited for the physical side would be a huge step in the right direction.",
            "author": "DragonflyDry9717",
            "id": "ik1rg93",
            "parent_id": "t1_ijzy2g4",
            "score": 12,
            "created_utc": 1660339459.0,
            "replies": [
                {
                    "body": "I think have this exact conversation with her. It was worth the wait, but after the incredible experience, you want to know her view on a way forward. Maybe something happened that she’s not comfortable with? Have the discussion. Worst case, it’s a mismatch and you go separate ways.",
                    "author": "GulfCoastFlamingo",
                    "id": "ik32eh6",
                    "parent_id": "t1_ik1rg93",
                    "score": 6,
                    "created_utc": 1660360748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with this.",
            "author": "Koroleva7z",
            "id": "ik0uslt",
            "parent_id": "t1_ijzy2g4",
            "score": 5,
            "created_utc": 1660326619.0,
            "replies": []
        },
        {
            "body": "This thinking is problematic for me that she doesn’t “owe him sex.”  Then is it fair to say that he doesn’t “owe her money?”  This double standard pops up a lot on this forum.  They “owe” each other whatever they mutually agreed to when the arrangement started or what was negotiated after.  Why do SD get held to a higher standard than SB so frequently here?",
            "author": "Truly-2nd-2none",
            "id": "ik8w7vc",
            "parent_id": "t1_ijzy2g4",
            "score": 3,
            "created_utc": 1660480739.0,
            "replies": []
        },
        {
            "body": "Big picture it's probably not going to work. But given that has no payoff other than your freedom a three step program might work.  \n\nTalk to her about your mutual feelings/intent.   Ask her what she thinks the two of you should do.  \n\nAt that point make a decision.  \n\nA good rule for dog training and maintaining a sound arrangement (for both sides)  \" Don't reward consistent bad behavior\"    That doesn't mean that a good SD is not flexible but rather that the overall relationship needs to be managed.",
            "author": "pinotandsugar",
            "id": "ik0pvma",
            "parent_id": "t1_ijzy2g4",
            "score": 6,
            "created_utc": 1660324762.0,
            "replies": []
        },
        {
            "body": "This is really sweet and i agree with this!\nYou can't force someone into it",
            "author": "madhuraksha",
            "id": "ik3gtv4",
            "parent_id": "t1_ijzy2g4",
            "score": 2,
            "created_utc": 1660369306.0,
            "replies": []
        },
        {
            "body": "Thank you for your response. Your idea is perfect for me--I'm a really nonconfrontational guy, and this is a good way of bringing it up without being pushy. If she makes an excuse/decides to bail, it's 100% over though.",
            "author": "DragonflyDry9717",
            "id": "ik1u72j",
            "parent_id": "t1_ijzzwe8",
            "score": 7,
            "created_utc": 1660340596.0,
            "replies": [
                {
                    "body": "I’d like an update if this works lol.",
                    "author": "Longjumping-Look-299",
                    "id": "ikcb5kj",
                    "parent_id": "t1_ik1u72j",
                    "score": 1,
                    "created_utc": 1660536045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here’s the issue with this. Most people outside of SLF don’t use the word intimacy when referring to sex. The OP has to spell it out for this woman and say: “I like sex and it’s important to me, if you’re not able to provide it consistently then I don’t think we are a good match.” Easy. \n\nThe whole beating around the bush and using words like intimacy aren’t going to get through to a SB like the one the OP has. Even talking about a hotel date, a lot of women won’t put two and two together that the SD is trying to have sex. How many times have we seen stories on here where a POT SB goes back to the guys hotel room/house and didn’t realize they wanted sex.",
            "author": null,
            "id": "ik1ne40",
            "parent_id": "t1_ijzzwe8",
            "score": 8,
            "created_utc": 1660337778.0,
            "replies": [
                {
                    "body": "Well she is in the bowl so I’m sure she is aware and If the word intimacy really is too vague, just replace it with sex? He can still say what I recommended and just switch it to sex. \n\nHe could also use your words, but I would encourage him to not use the word “provide” because now it comes off as though she is simply a sex worker and some people are sensitive about that implication.",
                    "author": "GlitterAndSugar",
                    "id": "ik1oc86",
                    "parent_id": "t1_ik1ne40",
                    "score": 5,
                    "created_utc": 1660338167.0,
                    "replies": [
                        {
                            "body": "\"hi I'm here to get down with it.\" \n\nDone.",
                            "author": "mad_dabz",
                            "id": "ik2idgy",
                            "parent_id": "t1_ik1oc86",
                            "score": 2,
                            "created_utc": 1660351231.0,
                            "replies": []
                        },
                        {
                            "body": "I should’ve said people outside of SLF. I can’t tell you how many times I’ve said the word intimacy to a POT SB and they asked what I meant by that lol. So now I spell it out and make it clear what I’m looking for. \n\nBut I agree with you, there’s a certain way you have to do it. In the OP’s case I think he needs to be as clear as possible of what he’s expecting no matter how harsh/transactional/sex worker-y he comes across.",
                            "author": null,
                            "id": "ik1oy2z",
                            "parent_id": "t1_ik1oc86",
                            "score": 1,
                            "created_utc": 1660338415.0,
                            "replies": [
                                {
                                    "body": "Well if it sounds sex-workery and harsh she may just back out anyways because it can come across as “hey I’m just here to get my dick wet” rather than “I care about about you as a person, but I also have needs within this relationship”.",
                                    "author": "GlitterAndSugar",
                                    "id": "ik1quke",
                                    "parent_id": "t1_ik1oy2z",
                                    "score": 4,
                                    "created_utc": 1660339211.0,
                                    "replies": [
                                        {
                                            "body": "Agreed. But it needs to be said because she’s not holding up her end of the bargain. The OP has seemingly been extra patient with her. \n\nEither way, sounds like they’re just not a fit for each other.",
                                            "author": null,
                                            "id": "ik1r1l4",
                                            "parent_id": "t1_ik1quke",
                                            "score": 3,
                                            "created_utc": 1660339290.0,
                                            "replies": [
                                                {
                                                    "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
                                                    "author": "GlitterAndSugar",
                                                    "id": "ik1sbic",
                                                    "parent_id": "t1_ik1r1l4",
                                                    "score": 3,
                                                    "created_utc": 1660339816.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well she is abundantly aware she isnt sleeping with him tho after two months . . . got to be something that’s in her mind right now otherwise she’s just utterly stupid.\n\nI find women are very smart when it comes to tracking this stuff",
                    "author": "JDMultralight",
                    "id": "ik36r1w",
                    "parent_id": "t1_ik1ne40",
                    "score": 3,
                    "created_utc": 1660363094.0,
                    "replies": []
                },
                {
                    "body": ">The whole beating around the bush and using words like intimacy aren’t going to get through to a SB like the one the OP has. Even talking about a hotel date a lot of women won’t put two and two together that the OP is trying to have sex. How many times have we seen stories on here where a POT SB goes back to the guys hotel room/house and didn’t realize they wanted sex.\n\nIt's true. I often really wonder how some of these folks could be so naive, or so self deluded, as to not understand that sex was right around the corner.",
                    "author": "BinghamtonSD",
                    "id": "ik8wp8i",
                    "parent_id": "t1_ik1ne40",
                    "score": 1,
                    "created_utc": 1660481018.0,
                    "replies": [
                        {
                            "body": "100%. I see this in real life as well. Inexperienced POT SB’s have told me that they went over a guys house on the first meeting, the guy tried getting handsy with them, they got creeped out and left. I wanted to be like why would you go over a guys house on the first meet, what did you think would happen!!",
                            "author": null,
                            "id": "ik8x7zx",
                            "parent_id": "t1_ik8wp8i",
                            "score": 3,
                            "created_utc": 1660481315.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijzy52r",
            "parent_id": "t1_ijztrii",
            "score": 8,
            "created_utc": 1660314192.0,
            "replies": [
                {
                    "body": "Yeah, I honestly just didn't want to come across as sleazy? Pressuring her? Making her feel like I was only interested in her body?\n\nToo much conditioning in my youth about never expressing myself sexually.",
                    "author": "DragonflyDry9717",
                    "id": "ik43fqj",
                    "parent_id": "t1_ijzy52r",
                    "score": 2,
                    "created_utc": 1660387222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the best approach. So many SDs complain that SBs don’t communicate so how about you, OP, communicate",
            "author": "Sweetcheeks864",
            "id": "ik0kgwb",
            "parent_id": "t1_ijztrii",
            "score": 7,
            "created_utc": 1660322786.0,
            "replies": [
                {
                    "body": "well here is another side of the token - if intimacy had already been agreed to, and SB committed to it, then they are equally able to fulfill it. think of it as a \"contractual obligation\" - because arrangements kind of are a verbal contract, even if unenforceable. it isn't a game where the SB withhold sex until the guy indicates he \"really really wants it\", this already should have been part of the agreement. and not a game to see how long the guy will wait to initiate.... what's stopping the SB from doing so? if it is lack of sexual interest then need to find that out pronto or just leave.",
                    "author": "Fabulous_Storm2437",
                    "id": "ik1gwyf",
                    "parent_id": "t1_ik0kgwb",
                    "score": 3,
                    "created_utc": 1660335213.0,
                    "replies": [
                        {
                            "body": "Right, so how would he find that out? To ask",
                            "author": "Sweetcheeks864",
                            "id": "ik1pkhf",
                            "parent_id": "t1_ik1gwyf",
                            "score": 1,
                            "created_utc": 1660338675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As an SB, I agree with this approach. Be direct that intimacy is part of the deal, and that you should both want it. Excuses to avoid intimacy on a consistent basis mean she's using you. So far you can give her the benefit of the doubt because it seems like you haven't been direct with her. But if you plan a date that specifically includes alone time afterwards, and she finds a reason not to go, you have your answer. Shut down the ATM, because that's all she sees you as.",
            "author": "HailToTheQuinn",
            "id": "ik0bxaa",
            "parent_id": "t1_ijztrii",
            "score": 9,
            "created_utc": 1660319570.0,
            "replies": []
        },
        {
            "body": "Thank you for the response. I did exactly that actually. My message (although it wasn't in English) went something like:\n\n>Hey, I reserved us a table for lunch at this restaurant. It seems pretty nice and their pasta is great. I know you've been craving some good pasta lately.\n\n>Afterwards, I want to have some private intimate time.\n\nDon't get hung up on the \"private intimate time\" part. It's a hard-to-translate phrase that unambiguously meets sex. \n\nAnything other than a positive response is gonna have me looking for a new arrangement. Plenty of young stunning women out there who would love for the arrangement I'm willing to provide. Just wish the woman I'm seeing now and I didn't have such spot-on similar interests!",
            "author": "DragonflyDry9717",
            "id": "ik43cu7",
            "parent_id": "t1_ijztrii",
            "score": 3,
            "created_utc": 1660387157.0,
            "replies": [
                {
                    "body": "Im so curious to see how this all pans out, update me on this please",
                    "author": "GhostsInTheParrot",
                    "id": "ik45xjh",
                    "parent_id": "t1_ik43cu7",
                    "score": 1,
                    "created_utc": 1660389115.0,
                    "replies": [
                        {
                            "body": "Yep, definitely going to update at least in this post no matter how it goes. I'll make sure to ping you when I do.",
                            "author": "DragonflyDry9717",
                            "id": "ik466pc",
                            "parent_id": "t1_ik45xjh",
                            "score": 2,
                            "created_utc": 1660389301.0,
                            "replies": [
                                {
                                    "body": "Thanks man I wish you well and hope she responds in a desirable way. Id hate to run into a rinser myself",
                                    "author": "GhostsInTheParrot",
                                    "id": "ik48mmh",
                                    "parent_id": "t1_ik466pc",
                                    "score": 1,
                                    "created_utc": 1660391010.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for the well wishes. It's actually super depressing because I like her a lot, but I'm not gonna get played anymore.",
                                            "author": "DragonflyDry9717",
                                            "id": "ik49d9m",
                                            "parent_id": "t1_ik48mmh",
                                            "score": 1,
                                            "created_utc": 1660391493.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes.\n\nSee, I bet there are possibly more accidental rinsers than there are women running scams.  Its just so much more normal to go into a situation thinking\n\n “I’ll just feel the sex part out and not do anything I dont want to do nor will I hold back if I feel like it.  And this guy isnt sexy to me but not obviously disgusting so who knows?  That’s within the limits of an undiscussed situation”\n\nPeople also don’t like to feel like fucking con artists and dont like to admit it to themselves.  And since thats subconscious it makes them an accidental rinser.  Your volition has to be conscious or it’s not volition.",
            "author": "JDMultralight",
            "id": "ik38aqb",
            "parent_id": "t1_ik0yy2l",
            "score": 3,
            "created_utc": 1660363972.0,
            "replies": []
        },
        {
            "body": "And then?\n\nA girl who is obviously no into OP grinding her way through sex while \"thinking on Britain?\" because she wants/needs the money?\n\nHe should move on and find someone who is more into him.",
            "author": "A-touchofreality",
            "id": "ijzwwnm",
            "parent_id": "t1_ijzr6ze",
            "score": 13,
            "created_utc": 1660313692.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ijzxmdk",
                    "parent_id": "t1_ijzwwnm",
                    "score": 8,
                    "created_utc": 1660313984.0,
                    "replies": [
                        {
                            "body": "Thanks, I thought it was Britain, but you get the grasp. ;)",
                            "author": "A-touchofreality",
                            "id": "ik1w5gf",
                            "parent_id": "t1_ijzxmdk",
                            "score": 2,
                            "created_utc": 1660341415.0,
                            "replies": []
                        },
                        {
                            "body": "So apparently historians now thing ol’ Vicky actually loved a nice roll in the royal hay.",
                            "author": "JDMultralight",
                            "id": "ik37492",
                            "parent_id": "t1_ijzxmdk",
                            "score": 1,
                            "created_utc": 1660363298.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“thinking of Britain” \n\n🇬🇧 \n\n🤣🙈",
                    "author": "Pitkin_SD",
                    "id": "ik022we",
                    "parent_id": "t1_ijzwwnm",
                    "score": 2,
                    "created_utc": 1660315778.0,
                    "replies": []
                },
                {
                    "body": "Precisely.",
                    "author": "celestialsavage",
                    "id": "ijzxmr7",
                    "parent_id": "t1_ijzwwnm",
                    "score": 1,
                    "created_utc": 1660313989.0,
                    "replies": []
                },
                {
                    "body": "there are many decent actresses out there",
                    "author": "huizeng",
                    "id": "ik0v3c3",
                    "parent_id": "t1_ijzwwnm",
                    "score": 1,
                    "created_utc": 1660326732.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ik187kg",
                            "parent_id": "t1_ik0v3c3",
                            "score": 2,
                            "created_utc": 1660331779.0,
                            "replies": [
                                {
                                    "body": "If you kegel enough you most certainly can contract at will ;)",
                                    "author": "Nydahlia",
                                    "id": "ik1dsla",
                                    "parent_id": "t1_ik187kg",
                                    "score": 3,
                                    "created_utc": 1660333990.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ik1e41w",
                                            "parent_id": "t1_ik1dsla",
                                            "score": 1,
                                            "created_utc": 1660334114.0,
                                            "replies": [
                                                {
                                                    "body": "Well if it's a challenge what's the reward?",
                                                    "author": "Nydahlia",
                                                    "id": "ik1ed06",
                                                    "parent_id": "t1_ik1e41w",
                                                    "score": 3,
                                                    "created_utc": 1660334211.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Can’t girls just contract at will?  I tell girls to squeeze me all the time and havent had any say “ \nI cant”",
                                    "author": "JDMultralight",
                                    "id": "ik2t9a1",
                                    "parent_id": "t1_ik187kg",
                                    "score": 1,
                                    "created_utc": 1660356247.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Dude it’s England!!!!  I know because I’m telepathic - it’s always England.",
                    "author": "JDMultralight",
                    "id": "ik3703k",
                    "parent_id": "t1_ijzwwnm",
                    "score": 1,
                    "created_utc": 1660363234.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeah if you took 2 months you have already well-signalled that the sex is optional. by waiting 2 months to challenge this notion, you just gave her easy income. a good SB would have made sure it didn't get to this point - either they would have advanced is sexually, or ended it (just joking - that part will never happen if you are paying without receiving - easiest money anyone could ever make, literally. being paid for dinner and shopping dates)",
            "author": "Fabulous_Storm2437",
            "id": "ik1gg56",
            "parent_id": "t1_ik0dmgn",
            "score": 2,
            "created_utc": 1660335026.0,
            "replies": []
        },
        {
            "body": "I have had a similar situation.  She wasn’t a bad person but she was inexperienced SB who had a few friends lying to her about what they received for what they provided.  I cut her off.  She met a few others on SA and had bad experiences then come back to me and we were good for another 6 months.  Since then I learned to just end it when I sense entitlement.",
            "author": "LotBuilder",
            "id": "ik2u0sb",
            "parent_id": "t1_ik1qcdm",
            "score": 5,
            "created_utc": 1660356596.0,
            "replies": [
                {
                    "body": "This is similar. Her first, and my SR. She was listening to a bunch of friends BS. What really keeps it in check, and allows us to repair and advance is I've known her half her life, she's 30, I'm 66. She's in a world of financial hurt, I can and am helping. And for the age difference the sex is pretty damn good. I hope when this ends, we can salvage our previous friendship. Time will tell.",
                    "author": "Beginning_Pear_1263",
                    "id": "ik2uv9n",
                    "parent_id": "t1_ik2u0sb",
                    "score": 5,
                    "created_utc": 1660356994.0,
                    "replies": []
                },
                {
                    "body": "It is nice to see not everyone on this subreddit is a simp just begging to be taken advantage of!",
                    "author": "CarnalParamour",
                    "id": "ikccn4p",
                    "parent_id": "t1_ik2u0sb",
                    "score": 1,
                    "created_utc": 1660536902.0,
                    "replies": [
                        {
                            "body": "There are givers and takers.  I’m a giver.  Unfortunately I had to learn the hard way to set boundaries or completely cut off takers because they have no boundaries.",
                            "author": "LotBuilder",
                            "id": "ikcd43a",
                            "parent_id": "t1_ikccn4p",
                            "score": 1,
                            "created_utc": 1660537177.0,
                            "replies": [
                                {
                                    "body": "I think most good SDs are givers.\n\nBut in a SR you are just receiving something back also.",
                                    "author": "CarnalParamour",
                                    "id": "ikcdnkj",
                                    "parent_id": "t1_ikcd43a",
                                    "score": 1,
                                    "created_utc": 1660537495.0,
                                    "replies": [
                                        {
                                            "body": "Most yes,  but there are definitely guys that try to get every ounce out of the other person.   One poor girl I met used to have overnights and the guy would limp dick her for half the night and the morning.  She would be blowing him 20 mins with him getting hard for 1 minute then losing it.  Over and over. Poor girl",
                                            "author": "LotBuilder",
                                            "id": "ikce9f5",
                                            "parent_id": "t1_ikcdnkj",
                                            "score": 1,
                                            "created_utc": 1660537867.0,
                                            "replies": [
                                                {
                                                    "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
                                                    "author": "CarnalParamour",
                                                    "id": "ikcgul7",
                                                    "parent_id": "t1_ikce9f5",
                                                    "score": 1,
                                                    "created_utc": 1660539482.0,
                                                    "replies": [
                                                        {
                                                            "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                                                            "author": "LotBuilder",
                                                            "id": "ikch142",
                                                            "parent_id": "t1_ikcgul7",
                                                            "score": 1,
                                                            "created_utc": 1660539598.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I couldn't have said it better myself! In my longest SD-SB relationship (several years), we would discuss what type of date we wanted to have ahead of time. That way, we could both be honest about our time commitments and there was no confusion or disappointment. Sometimes he would ask for a \"hotel date\", other times I would express that I wanted a \"hotel date\" or that I had a busy week but wanted to see him and chat over dinner. \n\nI can't speak for everyone, but as an SB, I'm well aware that SDs want intimacy, and I love that part of a relationship. It's just like any relationship--if your girlfriend seemed to suddenly change her mind about sex, would you just dump her, or would you talk to her about it? I'd hope you would have a conversation first!",
            "author": "daisywestcoast1",
            "id": "ik2qv84",
            "parent_id": "t1_ijzty3m",
            "score": 4,
            "created_utc": 1660355127.0,
            "replies": []
        },
        {
            "body": "This is a good way to go",
            "author": "NeighborhoodItchy943",
            "id": "ik06ixj",
            "parent_id": "t1_ijzty3m",
            "score": 1,
            "created_utc": 1660317508.0,
            "replies": []
        },
        {
            "body": "Thats actually a very good indirect transition into suggesting sex without being blunt about it. I applaud you",
            "author": "GhostsInTheParrot",
            "id": "ik47mq3",
            "parent_id": "t1_ik0ja7b",
            "score": 1,
            "created_utc": 1660390331.0,
            "replies": []
        },
        {
            "body": "I think scenario 3 could be fixable. The best part of any sexual relationship is getting to know what turns the other person on, and exploring new sexual boundaries. I think there is a lot of pressure for SBs to just \"put out\" when really, it should be two people having fun and exploring together. Part of that means asking her what she wants in bed! (If she seems dismissive or disinterested, that would be a red flag--but she may just have specific kinks or moves she likes in the bedroom that she was too shy to mention).",
            "author": "daisywestcoast1",
            "id": "ik2rfp0",
            "parent_id": "t1_ik0je6q",
            "score": 1,
            "created_utc": 1660355388.0,
            "replies": []
        },
        {
            "body": "Exactly, this dude lost the battle months ago",
            "author": null,
            "id": "ik0jlt2",
            "parent_id": "t1_ik0021c",
            "score": 2,
            "created_utc": 1660322474.0,
            "replies": []
        },
        {
            "body": "Brother, that reads *extremely* hostile.",
            "author": "JDMultralight",
            "id": "ik2tkwa",
            "parent_id": "t1_ik1qr3f",
            "score": 0,
            "created_utc": 1660356394.0,
            "replies": [
                {
                    "body": "I just have very little patience for being taken advantage of",
                    "author": "Then-Explanation8567",
                    "id": "ik43otv",
                    "parent_id": "t1_ik2tkwa",
                    "score": 1,
                    "created_utc": 1660387419.0,
                    "replies": [
                        {
                            "body": "I guess the thought for me is that laying down the law that hard shifts  the dynamic out of the sugar “good place” so might as well bail before doing that.  Like she could be really uneasy and you wont know - then youve got a scared sb which is kinda awful",
                            "author": "JDMultralight",
                            "id": "ik5rki9",
                            "parent_id": "t1_ik43otv",
                            "score": 1,
                            "created_utc": 1660416280.0,
                            "replies": [
                                {
                                    "body": "I don't even see that as coming down hard. To me coming down hard would be \n\n\"You're going to show up on time and I'll deduct from your gift for every minute you're late. You're going to wear what I tell you to and you aren't going to leave until I'm satisfied.\"\n\nWhat I posted (and said to a SB once) is basically a very blunt  callout that essentially says \"hey, this is supposed to be a mutually beneficial relationship with an obvious give and take. I feel like I've been holding up my end but you've been coming up short on yours\"\n\nAs for shifting the dynamic, she already did that. She made it a \"pay me to go to dinner with you\" arrangement without OPs consent. He expected a fairly traditional SR with the trappings of a relationship. My suggestion would either move it back to what they originally agreed to or end things. Regardless of the outcome, OP wouldn't be in a SR that he wasn't happy with anymore.",
                                    "author": "Then-Explanation8567",
                                    "id": "ik8t1wj",
                                    "parent_id": "t1_ik5rki9",
                                    "score": 2,
                                    "created_utc": 1660478802.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "While I generally don't agree with PPM's, your approach makes sense in a situation like this. OP wouldn't waste a full PPM on a girl that never holds up her end of the relationship, and it would be clear to her that he wants intimacy. But if this girl IS a rinser, she would be happy with taking the bare minimum PPM for basically just showing up for a dinner date. That's how most uninitiated girls think being a sugar baby works anyway 🤷‍♀️",
            "author": "HailToTheQuinn",
            "id": "ik0cmxh",
            "parent_id": "t1_ijzyr6t",
            "score": 3,
            "created_utc": 1660319841.0,
            "replies": []
        },
        {
            "body": "That last line hit hardest 😂",
            "author": "DragonflyDry9717",
            "id": "ik42k7j",
            "parent_id": "t1_ijzzs5e",
            "score": 1,
            "created_utc": 1660386518.0,
            "replies": []
        },
        {
            "body": "There is no trust built here - she is coming up with BS excuses, I would not call such approach trust.",
            "author": "SeaSDOptimist",
            "id": "ik0zkkj",
            "parent_id": "t1_ik0rw21",
            "score": 2,
            "created_utc": 1660328445.0,
            "replies": [
                {
                    "body": "it could be bs excuses. and it could be life getting in the way. i tend to think it's the former. point is, -if- there is any trust left, laying down an ultimatum could destroy that. then -if- that's a concern, proceed with caution. the alternative is to cut loses and run. it's really up to the op how to proceed\n\nsolutions aren't always to bring in a hammer and start destroying things. it's an option, but not the only path",
                    "author": "davitech73",
                    "id": "ik1fotp",
                    "parent_id": "t1_ik0zkkj",
                    "score": 1,
                    "created_utc": 1660334728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah yeah that's rough. I mean, when you're positively smitten with a woman, I guess you'll put up with a lot yeah?\n\nFunny how even at our age we can still fall for someone so hard.",
            "author": "DragonflyDry9717",
            "id": "ik22yhj",
            "parent_id": "t1_ik20ipo",
            "score": 1,
            "created_utc": 1660344338.0,
            "replies": [
                {
                    "body": "If you equate attractiveness with eagerness you will fall into this trap.",
                    "author": "BusddhistDSM",
                    "id": "ik2js80",
                    "parent_id": "t1_ik22yhj",
                    "score": 1,
                    "created_utc": 1660351879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "if it was a date, wouldn't she have wanted the nails nice prior to the meetup? or is there another more important date to get ready for?",
            "author": "Fabulous_Storm2437",
            "id": "ik1fwak",
            "parent_id": "t1_ik0ukn5",
            "score": 10,
            "created_utc": 1660334808.0,
            "replies": [
                {
                    "body": "Tbf she could have multiple SDs (but if that’s the case, she might not to work on her time management…)",
                    "author": "paroxysmique",
                    "id": "ik1kimk",
                    "parent_id": "t1_ik1fwak",
                    "score": -4,
                    "created_utc": 1660336633.0,
                    "replies": [
                        {
                            "body": "sounds like one of them is about to be freed up, so she will have more time, but might need to find a cheaper nail place with the lost income",
                            "author": "Fabulous_Storm2437",
                            "id": "ik1pwdx",
                            "parent_id": "t1_ik1kimk",
                            "score": 4,
                            "created_utc": 1660338811.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You couldn't ask if you could reschedule the date?",
            "author": "NinCarolina",
            "id": "ik32qrw",
            "parent_id": "t1_ik0ukn5",
            "score": 1,
            "created_utc": 1660360926.0,
            "replies": []
        },
        {
            "body": "This is part of the flawed thinking that sometimes occurs with women in general, Some SB’s in particular. The belief that all men equally value the time and attention that they give us with sex, so we should be happy (and pay for) the former even if we’re not getting the latter.",
            "author": "Truly-2nd-2none",
            "id": "ik8wm05",
            "parent_id": "t1_ik42txp",
            "score": 8,
            "created_utc": 1660480967.0,
            "replies": []
        },
        {
            "body": "it meant metaphorically begging.... like bringing up something that should have already been agreed to as a commitment, that kind of begging",
            "author": "Fabulous_Storm2437",
            "id": "ik1g0x6",
            "parent_id": "t1_ik146dv",
            "score": 22,
            "created_utc": 1660334859.0,
            "replies": [
                {
                    "body": "or as a metaphor for vanilla dating, where You are courting someone and just hoping that sex will be the outcome of what you are doing.",
                    "author": "joc13",
                    "id": "ik1jfad",
                    "parent_id": "t1_ik1g0x6",
                    "score": 8,
                    "created_utc": 1660336198.0,
                    "replies": [
                        {
                            "body": "you could always just tell the other person you want sex and not need to hope.",
                            "author": "leavsssesthrowaway",
                            "id": "ik2hav6",
                            "parent_id": "t1_ik1jfad",
                            "score": 2,
                            "created_utc": 1660350734.0,
                            "replies": [
                                {
                                    "body": "yeah, cause that goes over really when vanilla dating 😂",
                                    "author": "joc13",
                                    "id": "ik2m4a3",
                                    "parent_id": "t1_ik2hav6",
                                    "score": 5,
                                    "created_utc": 1660352949.0,
                                    "replies": [
                                        {
                                            "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
                                            "author": "leavsssesthrowaway",
                                            "id": "ik2obeq",
                                            "parent_id": "t1_ik2m4a3",
                                            "score": -1,
                                            "created_utc": 1660353955.0,
                                            "replies": [
                                                {
                                                    "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                                                    "author": "joc13",
                                                    "id": "ik2oo8c",
                                                    "parent_id": "t1_ik2obeq",
                                                    "score": 17,
                                                    "created_utc": 1660354118.0,
                                                    "replies": [
                                                        {
                                                            "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                                                            "author": "leavsssesthrowaway",
                                                            "id": "ik2ovp2",
                                                            "parent_id": "t1_ik2oo8c",
                                                            "score": 2,
                                                            "created_utc": 1660354212.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                                                    "author": "Briellexox",
                                                    "id": "ikdoo9a",
                                                    "parent_id": "t1_ik2obeq",
                                                    "score": 3,
                                                    "created_utc": 1660569916.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                                                            "author": "leavsssesthrowaway",
                                                            "id": "ikdq61f",
                                                            "parent_id": "t1_ikdoo9a",
                                                            "score": 1,
                                                            "created_utc": 1660570607.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It’s gentlemanly to pay for a lady.",
                                                                    "author": "Briellexox",
                                                                    "id": "ikdukbr",
                                                                    "parent_id": "t1_ikdq61f",
                                                                    "score": 1,
                                                                    "created_utc": 1660572536.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes it is - but you kinda have to tell someone that your sexual needs not being met is just putting you off of them.  That’s pressure -  Im going to take away an income stream on par with all your basic expenses away if you dont have sex at times when you wouldnt do so naturally.  It’s actually pressure just built in.  Terrible but true.",
            "author": "JDMultralight",
            "id": "ik2se0r",
            "parent_id": "t1_ik146dv",
            "score": 3,
            "created_utc": 1660355838.0,
            "replies": [
                {
                    "body": "And hence, mutually beneficial and what a man wants in an arrangement takes a back seat to what she want/needs. The reason the income stream for her exists is because she has agreed to certain behaviors. I can’t expect my employer to continue to pay me if I stop performing the work that I agreed to, so why can a SB?  Unless sugaring and being a SD has turned into a charity and someone failed to inform me.  Glorify it as some may want, SR is the exchange of goods for services.",
                    "author": "Truly-2nd-2none",
                    "id": "ik8x573",
                    "parent_id": "t1_ik2se0r",
                    "score": 3,
                    "created_utc": 1660481271.0,
                    "replies": []
                },
                {
                    "body": "Woah",
                    "author": "madhuraksha",
                    "id": "ik3gomd",
                    "parent_id": "t1_ik2se0r",
                    "score": 2,
                    "created_utc": 1660369209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think have this exact conversation with her. It was worth the wait, but after the incredible experience, you want to know her view on a way forward. Maybe something happened that she’s not comfortable with? Have the discussion. Worst case, it’s a mismatch and you go separate ways.",
            "author": "GulfCoastFlamingo",
            "id": "ik32eh6",
            "parent_id": "t1_ik1rg93",
            "score": 6,
            "created_utc": 1660360748.0,
            "replies": []
        },
        {
            "body": "I’d like an update if this works lol.",
            "author": "Longjumping-Look-299",
            "id": "ikcb5kj",
            "parent_id": "t1_ik1u72j",
            "score": 1,
            "created_utc": 1660536045.0,
            "replies": []
        },
        {
            "body": "Well she is in the bowl so I’m sure she is aware and If the word intimacy really is too vague, just replace it with sex? He can still say what I recommended and just switch it to sex. \n\nHe could also use your words, but I would encourage him to not use the word “provide” because now it comes off as though she is simply a sex worker and some people are sensitive about that implication.",
            "author": "GlitterAndSugar",
            "id": "ik1oc86",
            "parent_id": "t1_ik1ne40",
            "score": 5,
            "created_utc": 1660338167.0,
            "replies": [
                {
                    "body": "\"hi I'm here to get down with it.\" \n\nDone.",
                    "author": "mad_dabz",
                    "id": "ik2idgy",
                    "parent_id": "t1_ik1oc86",
                    "score": 2,
                    "created_utc": 1660351231.0,
                    "replies": []
                },
                {
                    "body": "I should’ve said people outside of SLF. I can’t tell you how many times I’ve said the word intimacy to a POT SB and they asked what I meant by that lol. So now I spell it out and make it clear what I’m looking for. \n\nBut I agree with you, there’s a certain way you have to do it. In the OP’s case I think he needs to be as clear as possible of what he’s expecting no matter how harsh/transactional/sex worker-y he comes across.",
                    "author": null,
                    "id": "ik1oy2z",
                    "parent_id": "t1_ik1oc86",
                    "score": 1,
                    "created_utc": 1660338415.0,
                    "replies": [
                        {
                            "body": "Well if it sounds sex-workery and harsh she may just back out anyways because it can come across as “hey I’m just here to get my dick wet” rather than “I care about about you as a person, but I also have needs within this relationship”.",
                            "author": "GlitterAndSugar",
                            "id": "ik1quke",
                            "parent_id": "t1_ik1oy2z",
                            "score": 4,
                            "created_utc": 1660339211.0,
                            "replies": [
                                {
                                    "body": "Agreed. But it needs to be said because she’s not holding up her end of the bargain. The OP has seemingly been extra patient with her. \n\nEither way, sounds like they’re just not a fit for each other.",
                                    "author": null,
                                    "id": "ik1r1l4",
                                    "parent_id": "t1_ik1quke",
                                    "score": 3,
                                    "created_utc": 1660339290.0,
                                    "replies": [
                                        {
                                            "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
                                            "author": "GlitterAndSugar",
                                            "id": "ik1sbic",
                                            "parent_id": "t1_ik1r1l4",
                                            "score": 3,
                                            "created_utc": 1660339816.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well she is abundantly aware she isnt sleeping with him tho after two months . . . got to be something that’s in her mind right now otherwise she’s just utterly stupid.\n\nI find women are very smart when it comes to tracking this stuff",
            "author": "JDMultralight",
            "id": "ik36r1w",
            "parent_id": "t1_ik1ne40",
            "score": 3,
            "created_utc": 1660363094.0,
            "replies": []
        },
        {
            "body": ">The whole beating around the bush and using words like intimacy aren’t going to get through to a SB like the one the OP has. Even talking about a hotel date a lot of women won’t put two and two together that the OP is trying to have sex. How many times have we seen stories on here where a POT SB goes back to the guys hotel room/house and didn’t realize they wanted sex.\n\nIt's true. I often really wonder how some of these folks could be so naive, or so self deluded, as to not understand that sex was right around the corner.",
            "author": "BinghamtonSD",
            "id": "ik8wp8i",
            "parent_id": "t1_ik1ne40",
            "score": 1,
            "created_utc": 1660481018.0,
            "replies": [
                {
                    "body": "100%. I see this in real life as well. Inexperienced POT SB’s have told me that they went over a guys house on the first meeting, the guy tried getting handsy with them, they got creeped out and left. I wanted to be like why would you go over a guys house on the first meet, what did you think would happen!!",
                    "author": null,
                    "id": "ik8x7zx",
                    "parent_id": "t1_ik8wp8i",
                    "score": 3,
                    "created_utc": 1660481315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I honestly just didn't want to come across as sleazy? Pressuring her? Making her feel like I was only interested in her body?\n\nToo much conditioning in my youth about never expressing myself sexually.",
            "author": "DragonflyDry9717",
            "id": "ik43fqj",
            "parent_id": "t1_ijzy52r",
            "score": 2,
            "created_utc": 1660387222.0,
            "replies": []
        },
        {
            "body": "well here is another side of the token - if intimacy had already been agreed to, and SB committed to it, then they are equally able to fulfill it. think of it as a \"contractual obligation\" - because arrangements kind of are a verbal contract, even if unenforceable. it isn't a game where the SB withhold sex until the guy indicates he \"really really wants it\", this already should have been part of the agreement. and not a game to see how long the guy will wait to initiate.... what's stopping the SB from doing so? if it is lack of sexual interest then need to find that out pronto or just leave.",
            "author": "Fabulous_Storm2437",
            "id": "ik1gwyf",
            "parent_id": "t1_ik0kgwb",
            "score": 3,
            "created_utc": 1660335213.0,
            "replies": [
                {
                    "body": "Right, so how would he find that out? To ask",
                    "author": "Sweetcheeks864",
                    "id": "ik1pkhf",
                    "parent_id": "t1_ik1gwyf",
                    "score": 1,
                    "created_utc": 1660338675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im so curious to see how this all pans out, update me on this please",
            "author": "GhostsInTheParrot",
            "id": "ik45xjh",
            "parent_id": "t1_ik43cu7",
            "score": 1,
            "created_utc": 1660389115.0,
            "replies": [
                {
                    "body": "Yep, definitely going to update at least in this post no matter how it goes. I'll make sure to ping you when I do.",
                    "author": "DragonflyDry9717",
                    "id": "ik466pc",
                    "parent_id": "t1_ik45xjh",
                    "score": 2,
                    "created_utc": 1660389301.0,
                    "replies": [
                        {
                            "body": "Thanks man I wish you well and hope she responds in a desirable way. Id hate to run into a rinser myself",
                            "author": "GhostsInTheParrot",
                            "id": "ik48mmh",
                            "parent_id": "t1_ik466pc",
                            "score": 1,
                            "created_utc": 1660391010.0,
                            "replies": [
                                {
                                    "body": "Thanks for the well wishes. It's actually super depressing because I like her a lot, but I'm not gonna get played anymore.",
                                    "author": "DragonflyDry9717",
                                    "id": "ik49d9m",
                                    "parent_id": "t1_ik48mmh",
                                    "score": 1,
                                    "created_utc": 1660391493.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijzxmdk",
            "parent_id": "t1_ijzwwnm",
            "score": 8,
            "created_utc": 1660313984.0,
            "replies": [
                {
                    "body": "Thanks, I thought it was Britain, but you get the grasp. ;)",
                    "author": "A-touchofreality",
                    "id": "ik1w5gf",
                    "parent_id": "t1_ijzxmdk",
                    "score": 2,
                    "created_utc": 1660341415.0,
                    "replies": []
                },
                {
                    "body": "So apparently historians now thing ol’ Vicky actually loved a nice roll in the royal hay.",
                    "author": "JDMultralight",
                    "id": "ik37492",
                    "parent_id": "t1_ijzxmdk",
                    "score": 1,
                    "created_utc": 1660363298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“thinking of Britain” \n\n🇬🇧 \n\n🤣🙈",
            "author": "Pitkin_SD",
            "id": "ik022we",
            "parent_id": "t1_ijzwwnm",
            "score": 2,
            "created_utc": 1660315778.0,
            "replies": []
        },
        {
            "body": "Precisely.",
            "author": "celestialsavage",
            "id": "ijzxmr7",
            "parent_id": "t1_ijzwwnm",
            "score": 1,
            "created_utc": 1660313989.0,
            "replies": []
        },
        {
            "body": "there are many decent actresses out there",
            "author": "huizeng",
            "id": "ik0v3c3",
            "parent_id": "t1_ijzwwnm",
            "score": 1,
            "created_utc": 1660326732.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ik187kg",
                    "parent_id": "t1_ik0v3c3",
                    "score": 2,
                    "created_utc": 1660331779.0,
                    "replies": [
                        {
                            "body": "If you kegel enough you most certainly can contract at will ;)",
                            "author": "Nydahlia",
                            "id": "ik1dsla",
                            "parent_id": "t1_ik187kg",
                            "score": 3,
                            "created_utc": 1660333990.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ik1e41w",
                                    "parent_id": "t1_ik1dsla",
                                    "score": 1,
                                    "created_utc": 1660334114.0,
                                    "replies": [
                                        {
                                            "body": "Well if it's a challenge what's the reward?",
                                            "author": "Nydahlia",
                                            "id": "ik1ed06",
                                            "parent_id": "t1_ik1e41w",
                                            "score": 3,
                                            "created_utc": 1660334211.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Can’t girls just contract at will?  I tell girls to squeeze me all the time and havent had any say “ \nI cant”",
                            "author": "JDMultralight",
                            "id": "ik2t9a1",
                            "parent_id": "t1_ik187kg",
                            "score": 1,
                            "created_utc": 1660356247.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude it’s England!!!!  I know because I’m telepathic - it’s always England.",
            "author": "JDMultralight",
            "id": "ik3703k",
            "parent_id": "t1_ijzwwnm",
            "score": 1,
            "created_utc": 1660363234.0,
            "replies": []
        },
        {
            "body": "This is similar. Her first, and my SR. She was listening to a bunch of friends BS. What really keeps it in check, and allows us to repair and advance is I've known her half her life, she's 30, I'm 66. She's in a world of financial hurt, I can and am helping. And for the age difference the sex is pretty damn good. I hope when this ends, we can salvage our previous friendship. Time will tell.",
            "author": "Beginning_Pear_1263",
            "id": "ik2uv9n",
            "parent_id": "t1_ik2u0sb",
            "score": 5,
            "created_utc": 1660356994.0,
            "replies": []
        },
        {
            "body": "It is nice to see not everyone on this subreddit is a simp just begging to be taken advantage of!",
            "author": "CarnalParamour",
            "id": "ikccn4p",
            "parent_id": "t1_ik2u0sb",
            "score": 1,
            "created_utc": 1660536902.0,
            "replies": [
                {
                    "body": "There are givers and takers.  I’m a giver.  Unfortunately I had to learn the hard way to set boundaries or completely cut off takers because they have no boundaries.",
                    "author": "LotBuilder",
                    "id": "ikcd43a",
                    "parent_id": "t1_ikccn4p",
                    "score": 1,
                    "created_utc": 1660537177.0,
                    "replies": [
                        {
                            "body": "I think most good SDs are givers.\n\nBut in a SR you are just receiving something back also.",
                            "author": "CarnalParamour",
                            "id": "ikcdnkj",
                            "parent_id": "t1_ikcd43a",
                            "score": 1,
                            "created_utc": 1660537495.0,
                            "replies": [
                                {
                                    "body": "Most yes,  but there are definitely guys that try to get every ounce out of the other person.   One poor girl I met used to have overnights and the guy would limp dick her for half the night and the morning.  She would be blowing him 20 mins with him getting hard for 1 minute then losing it.  Over and over. Poor girl",
                                    "author": "LotBuilder",
                                    "id": "ikce9f5",
                                    "parent_id": "t1_ikcdnkj",
                                    "score": 1,
                                    "created_utc": 1660537867.0,
                                    "replies": [
                                        {
                                            "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
                                            "author": "CarnalParamour",
                                            "id": "ikcgul7",
                                            "parent_id": "t1_ikce9f5",
                                            "score": 1,
                                            "created_utc": 1660539482.0,
                                            "replies": [
                                                {
                                                    "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                                                    "author": "LotBuilder",
                                                    "id": "ikch142",
                                                    "parent_id": "t1_ikcgul7",
                                                    "score": 1,
                                                    "created_utc": 1660539598.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just have very little patience for being taken advantage of",
            "author": "Then-Explanation8567",
            "id": "ik43otv",
            "parent_id": "t1_ik2tkwa",
            "score": 1,
            "created_utc": 1660387419.0,
            "replies": [
                {
                    "body": "I guess the thought for me is that laying down the law that hard shifts  the dynamic out of the sugar “good place” so might as well bail before doing that.  Like she could be really uneasy and you wont know - then youve got a scared sb which is kinda awful",
                    "author": "JDMultralight",
                    "id": "ik5rki9",
                    "parent_id": "t1_ik43otv",
                    "score": 1,
                    "created_utc": 1660416280.0,
                    "replies": [
                        {
                            "body": "I don't even see that as coming down hard. To me coming down hard would be \n\n\"You're going to show up on time and I'll deduct from your gift for every minute you're late. You're going to wear what I tell you to and you aren't going to leave until I'm satisfied.\"\n\nWhat I posted (and said to a SB once) is basically a very blunt  callout that essentially says \"hey, this is supposed to be a mutually beneficial relationship with an obvious give and take. I feel like I've been holding up my end but you've been coming up short on yours\"\n\nAs for shifting the dynamic, she already did that. She made it a \"pay me to go to dinner with you\" arrangement without OPs consent. He expected a fairly traditional SR with the trappings of a relationship. My suggestion would either move it back to what they originally agreed to or end things. Regardless of the outcome, OP wouldn't be in a SR that he wasn't happy with anymore.",
                            "author": "Then-Explanation8567",
                            "id": "ik8t1wj",
                            "parent_id": "t1_ik5rki9",
                            "score": 2,
                            "created_utc": 1660478802.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "it could be bs excuses. and it could be life getting in the way. i tend to think it's the former. point is, -if- there is any trust left, laying down an ultimatum could destroy that. then -if- that's a concern, proceed with caution. the alternative is to cut loses and run. it's really up to the op how to proceed\n\nsolutions aren't always to bring in a hammer and start destroying things. it's an option, but not the only path",
            "author": "davitech73",
            "id": "ik1fotp",
            "parent_id": "t1_ik0zkkj",
            "score": 1,
            "created_utc": 1660334728.0,
            "replies": []
        },
        {
            "body": "If you equate attractiveness with eagerness you will fall into this trap.",
            "author": "BusddhistDSM",
            "id": "ik2js80",
            "parent_id": "t1_ik22yhj",
            "score": 1,
            "created_utc": 1660351879.0,
            "replies": []
        },
        {
            "body": "Tbf she could have multiple SDs (but if that’s the case, she might not to work on her time management…)",
            "author": "paroxysmique",
            "id": "ik1kimk",
            "parent_id": "t1_ik1fwak",
            "score": -4,
            "created_utc": 1660336633.0,
            "replies": [
                {
                    "body": "sounds like one of them is about to be freed up, so she will have more time, but might need to find a cheaper nail place with the lost income",
                    "author": "Fabulous_Storm2437",
                    "id": "ik1pwdx",
                    "parent_id": "t1_ik1kimk",
                    "score": 4,
                    "created_utc": 1660338811.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "or as a metaphor for vanilla dating, where You are courting someone and just hoping that sex will be the outcome of what you are doing.",
            "author": "joc13",
            "id": "ik1jfad",
            "parent_id": "t1_ik1g0x6",
            "score": 8,
            "created_utc": 1660336198.0,
            "replies": [
                {
                    "body": "you could always just tell the other person you want sex and not need to hope.",
                    "author": "leavsssesthrowaway",
                    "id": "ik2hav6",
                    "parent_id": "t1_ik1jfad",
                    "score": 2,
                    "created_utc": 1660350734.0,
                    "replies": [
                        {
                            "body": "yeah, cause that goes over really when vanilla dating 😂",
                            "author": "joc13",
                            "id": "ik2m4a3",
                            "parent_id": "t1_ik2hav6",
                            "score": 5,
                            "created_utc": 1660352949.0,
                            "replies": [
                                {
                                    "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
                                    "author": "leavsssesthrowaway",
                                    "id": "ik2obeq",
                                    "parent_id": "t1_ik2m4a3",
                                    "score": -1,
                                    "created_utc": 1660353955.0,
                                    "replies": [
                                        {
                                            "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                                            "author": "joc13",
                                            "id": "ik2oo8c",
                                            "parent_id": "t1_ik2obeq",
                                            "score": 17,
                                            "created_utc": 1660354118.0,
                                            "replies": [
                                                {
                                                    "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                                                    "author": "leavsssesthrowaway",
                                                    "id": "ik2ovp2",
                                                    "parent_id": "t1_ik2oo8c",
                                                    "score": 2,
                                                    "created_utc": 1660354212.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                                            "author": "Briellexox",
                                            "id": "ikdoo9a",
                                            "parent_id": "t1_ik2obeq",
                                            "score": 3,
                                            "created_utc": 1660569916.0,
                                            "replies": [
                                                {
                                                    "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                                                    "author": "leavsssesthrowaway",
                                                    "id": "ikdq61f",
                                                    "parent_id": "t1_ikdoo9a",
                                                    "score": 1,
                                                    "created_utc": 1660570607.0,
                                                    "replies": [
                                                        {
                                                            "body": "It’s gentlemanly to pay for a lady.",
                                                            "author": "Briellexox",
                                                            "id": "ikdukbr",
                                                            "parent_id": "t1_ikdq61f",
                                                            "score": 1,
                                                            "created_utc": 1660572536.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And hence, mutually beneficial and what a man wants in an arrangement takes a back seat to what she want/needs. The reason the income stream for her exists is because she has agreed to certain behaviors. I can’t expect my employer to continue to pay me if I stop performing the work that I agreed to, so why can a SB?  Unless sugaring and being a SD has turned into a charity and someone failed to inform me.  Glorify it as some may want, SR is the exchange of goods for services.",
            "author": "Truly-2nd-2none",
            "id": "ik8x573",
            "parent_id": "t1_ik2se0r",
            "score": 3,
            "created_utc": 1660481271.0,
            "replies": []
        },
        {
            "body": "Woah",
            "author": "madhuraksha",
            "id": "ik3gomd",
            "parent_id": "t1_ik2se0r",
            "score": 2,
            "created_utc": 1660369209.0,
            "replies": []
        },
        {
            "body": "\"hi I'm here to get down with it.\" \n\nDone.",
            "author": "mad_dabz",
            "id": "ik2idgy",
            "parent_id": "t1_ik1oc86",
            "score": 2,
            "created_utc": 1660351231.0,
            "replies": []
        },
        {
            "body": "I should’ve said people outside of SLF. I can’t tell you how many times I’ve said the word intimacy to a POT SB and they asked what I meant by that lol. So now I spell it out and make it clear what I’m looking for. \n\nBut I agree with you, there’s a certain way you have to do it. In the OP’s case I think he needs to be as clear as possible of what he’s expecting no matter how harsh/transactional/sex worker-y he comes across.",
            "author": null,
            "id": "ik1oy2z",
            "parent_id": "t1_ik1oc86",
            "score": 1,
            "created_utc": 1660338415.0,
            "replies": [
                {
                    "body": "Well if it sounds sex-workery and harsh she may just back out anyways because it can come across as “hey I’m just here to get my dick wet” rather than “I care about about you as a person, but I also have needs within this relationship”.",
                    "author": "GlitterAndSugar",
                    "id": "ik1quke",
                    "parent_id": "t1_ik1oy2z",
                    "score": 4,
                    "created_utc": 1660339211.0,
                    "replies": [
                        {
                            "body": "Agreed. But it needs to be said because she’s not holding up her end of the bargain. The OP has seemingly been extra patient with her. \n\nEither way, sounds like they’re just not a fit for each other.",
                            "author": null,
                            "id": "ik1r1l4",
                            "parent_id": "t1_ik1quke",
                            "score": 3,
                            "created_utc": 1660339290.0,
                            "replies": [
                                {
                                    "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
                                    "author": "GlitterAndSugar",
                                    "id": "ik1sbic",
                                    "parent_id": "t1_ik1r1l4",
                                    "score": 3,
                                    "created_utc": 1660339816.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "100%. I see this in real life as well. Inexperienced POT SB’s have told me that they went over a guys house on the first meeting, the guy tried getting handsy with them, they got creeped out and left. I wanted to be like why would you go over a guys house on the first meet, what did you think would happen!!",
            "author": null,
            "id": "ik8x7zx",
            "parent_id": "t1_ik8wp8i",
            "score": 3,
            "created_utc": 1660481315.0,
            "replies": []
        },
        {
            "body": "Right, so how would he find that out? To ask",
            "author": "Sweetcheeks864",
            "id": "ik1pkhf",
            "parent_id": "t1_ik1gwyf",
            "score": 1,
            "created_utc": 1660338675.0,
            "replies": []
        },
        {
            "body": "Yep, definitely going to update at least in this post no matter how it goes. I'll make sure to ping you when I do.",
            "author": "DragonflyDry9717",
            "id": "ik466pc",
            "parent_id": "t1_ik45xjh",
            "score": 2,
            "created_utc": 1660389301.0,
            "replies": [
                {
                    "body": "Thanks man I wish you well and hope she responds in a desirable way. Id hate to run into a rinser myself",
                    "author": "GhostsInTheParrot",
                    "id": "ik48mmh",
                    "parent_id": "t1_ik466pc",
                    "score": 1,
                    "created_utc": 1660391010.0,
                    "replies": [
                        {
                            "body": "Thanks for the well wishes. It's actually super depressing because I like her a lot, but I'm not gonna get played anymore.",
                            "author": "DragonflyDry9717",
                            "id": "ik49d9m",
                            "parent_id": "t1_ik48mmh",
                            "score": 1,
                            "created_utc": 1660391493.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks, I thought it was Britain, but you get the grasp. ;)",
            "author": "A-touchofreality",
            "id": "ik1w5gf",
            "parent_id": "t1_ijzxmdk",
            "score": 2,
            "created_utc": 1660341415.0,
            "replies": []
        },
        {
            "body": "So apparently historians now thing ol’ Vicky actually loved a nice roll in the royal hay.",
            "author": "JDMultralight",
            "id": "ik37492",
            "parent_id": "t1_ijzxmdk",
            "score": 1,
            "created_utc": 1660363298.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ik187kg",
            "parent_id": "t1_ik0v3c3",
            "score": 2,
            "created_utc": 1660331779.0,
            "replies": [
                {
                    "body": "If you kegel enough you most certainly can contract at will ;)",
                    "author": "Nydahlia",
                    "id": "ik1dsla",
                    "parent_id": "t1_ik187kg",
                    "score": 3,
                    "created_utc": 1660333990.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ik1e41w",
                            "parent_id": "t1_ik1dsla",
                            "score": 1,
                            "created_utc": 1660334114.0,
                            "replies": [
                                {
                                    "body": "Well if it's a challenge what's the reward?",
                                    "author": "Nydahlia",
                                    "id": "ik1ed06",
                                    "parent_id": "t1_ik1e41w",
                                    "score": 3,
                                    "created_utc": 1660334211.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Can’t girls just contract at will?  I tell girls to squeeze me all the time and havent had any say “ \nI cant”",
                    "author": "JDMultralight",
                    "id": "ik2t9a1",
                    "parent_id": "t1_ik187kg",
                    "score": 1,
                    "created_utc": 1660356247.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are givers and takers.  I’m a giver.  Unfortunately I had to learn the hard way to set boundaries or completely cut off takers because they have no boundaries.",
            "author": "LotBuilder",
            "id": "ikcd43a",
            "parent_id": "t1_ikccn4p",
            "score": 1,
            "created_utc": 1660537177.0,
            "replies": [
                {
                    "body": "I think most good SDs are givers.\n\nBut in a SR you are just receiving something back also.",
                    "author": "CarnalParamour",
                    "id": "ikcdnkj",
                    "parent_id": "t1_ikcd43a",
                    "score": 1,
                    "created_utc": 1660537495.0,
                    "replies": [
                        {
                            "body": "Most yes,  but there are definitely guys that try to get every ounce out of the other person.   One poor girl I met used to have overnights and the guy would limp dick her for half the night and the morning.  She would be blowing him 20 mins with him getting hard for 1 minute then losing it.  Over and over. Poor girl",
                            "author": "LotBuilder",
                            "id": "ikce9f5",
                            "parent_id": "t1_ikcdnkj",
                            "score": 1,
                            "created_utc": 1660537867.0,
                            "replies": [
                                {
                                    "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
                                    "author": "CarnalParamour",
                                    "id": "ikcgul7",
                                    "parent_id": "t1_ikce9f5",
                                    "score": 1,
                                    "created_utc": 1660539482.0,
                                    "replies": [
                                        {
                                            "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                                            "author": "LotBuilder",
                                            "id": "ikch142",
                                            "parent_id": "t1_ikcgul7",
                                            "score": 1,
                                            "created_utc": 1660539598.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess the thought for me is that laying down the law that hard shifts  the dynamic out of the sugar “good place” so might as well bail before doing that.  Like she could be really uneasy and you wont know - then youve got a scared sb which is kinda awful",
            "author": "JDMultralight",
            "id": "ik5rki9",
            "parent_id": "t1_ik43otv",
            "score": 1,
            "created_utc": 1660416280.0,
            "replies": [
                {
                    "body": "I don't even see that as coming down hard. To me coming down hard would be \n\n\"You're going to show up on time and I'll deduct from your gift for every minute you're late. You're going to wear what I tell you to and you aren't going to leave until I'm satisfied.\"\n\nWhat I posted (and said to a SB once) is basically a very blunt  callout that essentially says \"hey, this is supposed to be a mutually beneficial relationship with an obvious give and take. I feel like I've been holding up my end but you've been coming up short on yours\"\n\nAs for shifting the dynamic, she already did that. She made it a \"pay me to go to dinner with you\" arrangement without OPs consent. He expected a fairly traditional SR with the trappings of a relationship. My suggestion would either move it back to what they originally agreed to or end things. Regardless of the outcome, OP wouldn't be in a SR that he wasn't happy with anymore.",
                    "author": "Then-Explanation8567",
                    "id": "ik8t1wj",
                    "parent_id": "t1_ik5rki9",
                    "score": 2,
                    "created_utc": 1660478802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sounds like one of them is about to be freed up, so she will have more time, but might need to find a cheaper nail place with the lost income",
            "author": "Fabulous_Storm2437",
            "id": "ik1pwdx",
            "parent_id": "t1_ik1kimk",
            "score": 4,
            "created_utc": 1660338811.0,
            "replies": []
        },
        {
            "body": "you could always just tell the other person you want sex and not need to hope.",
            "author": "leavsssesthrowaway",
            "id": "ik2hav6",
            "parent_id": "t1_ik1jfad",
            "score": 2,
            "created_utc": 1660350734.0,
            "replies": [
                {
                    "body": "yeah, cause that goes over really when vanilla dating 😂",
                    "author": "joc13",
                    "id": "ik2m4a3",
                    "parent_id": "t1_ik2hav6",
                    "score": 5,
                    "created_utc": 1660352949.0,
                    "replies": [
                        {
                            "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
                            "author": "leavsssesthrowaway",
                            "id": "ik2obeq",
                            "parent_id": "t1_ik2m4a3",
                            "score": -1,
                            "created_utc": 1660353955.0,
                            "replies": [
                                {
                                    "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                                    "author": "joc13",
                                    "id": "ik2oo8c",
                                    "parent_id": "t1_ik2obeq",
                                    "score": 17,
                                    "created_utc": 1660354118.0,
                                    "replies": [
                                        {
                                            "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                                            "author": "leavsssesthrowaway",
                                            "id": "ik2ovp2",
                                            "parent_id": "t1_ik2oo8c",
                                            "score": 2,
                                            "created_utc": 1660354212.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                                    "author": "Briellexox",
                                    "id": "ikdoo9a",
                                    "parent_id": "t1_ik2obeq",
                                    "score": 3,
                                    "created_utc": 1660569916.0,
                                    "replies": [
                                        {
                                            "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                                            "author": "leavsssesthrowaway",
                                            "id": "ikdq61f",
                                            "parent_id": "t1_ikdoo9a",
                                            "score": 1,
                                            "created_utc": 1660570607.0,
                                            "replies": [
                                                {
                                                    "body": "It’s gentlemanly to pay for a lady.",
                                                    "author": "Briellexox",
                                                    "id": "ikdukbr",
                                                    "parent_id": "t1_ikdq61f",
                                                    "score": 1,
                                                    "created_utc": 1660572536.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well if it sounds sex-workery and harsh she may just back out anyways because it can come across as “hey I’m just here to get my dick wet” rather than “I care about about you as a person, but I also have needs within this relationship”.",
            "author": "GlitterAndSugar",
            "id": "ik1quke",
            "parent_id": "t1_ik1oy2z",
            "score": 4,
            "created_utc": 1660339211.0,
            "replies": [
                {
                    "body": "Agreed. But it needs to be said because she’s not holding up her end of the bargain. The OP has seemingly been extra patient with her. \n\nEither way, sounds like they’re just not a fit for each other.",
                    "author": null,
                    "id": "ik1r1l4",
                    "parent_id": "t1_ik1quke",
                    "score": 3,
                    "created_utc": 1660339290.0,
                    "replies": [
                        {
                            "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
                            "author": "GlitterAndSugar",
                            "id": "ik1sbic",
                            "parent_id": "t1_ik1r1l4",
                            "score": 3,
                            "created_utc": 1660339816.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks man I wish you well and hope she responds in a desirable way. Id hate to run into a rinser myself",
            "author": "GhostsInTheParrot",
            "id": "ik48mmh",
            "parent_id": "t1_ik466pc",
            "score": 1,
            "created_utc": 1660391010.0,
            "replies": [
                {
                    "body": "Thanks for the well wishes. It's actually super depressing because I like her a lot, but I'm not gonna get played anymore.",
                    "author": "DragonflyDry9717",
                    "id": "ik49d9m",
                    "parent_id": "t1_ik48mmh",
                    "score": 1,
                    "created_utc": 1660391493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you kegel enough you most certainly can contract at will ;)",
            "author": "Nydahlia",
            "id": "ik1dsla",
            "parent_id": "t1_ik187kg",
            "score": 3,
            "created_utc": 1660333990.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ik1e41w",
                    "parent_id": "t1_ik1dsla",
                    "score": 1,
                    "created_utc": 1660334114.0,
                    "replies": [
                        {
                            "body": "Well if it's a challenge what's the reward?",
                            "author": "Nydahlia",
                            "id": "ik1ed06",
                            "parent_id": "t1_ik1e41w",
                            "score": 3,
                            "created_utc": 1660334211.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can’t girls just contract at will?  I tell girls to squeeze me all the time and havent had any say “ \nI cant”",
            "author": "JDMultralight",
            "id": "ik2t9a1",
            "parent_id": "t1_ik187kg",
            "score": 1,
            "created_utc": 1660356247.0,
            "replies": []
        },
        {
            "body": "I think most good SDs are givers.\n\nBut in a SR you are just receiving something back also.",
            "author": "CarnalParamour",
            "id": "ikcdnkj",
            "parent_id": "t1_ikcd43a",
            "score": 1,
            "created_utc": 1660537495.0,
            "replies": [
                {
                    "body": "Most yes,  but there are definitely guys that try to get every ounce out of the other person.   One poor girl I met used to have overnights and the guy would limp dick her for half the night and the morning.  She would be blowing him 20 mins with him getting hard for 1 minute then losing it.  Over and over. Poor girl",
                    "author": "LotBuilder",
                    "id": "ikce9f5",
                    "parent_id": "t1_ikcdnkj",
                    "score": 1,
                    "created_utc": 1660537867.0,
                    "replies": [
                        {
                            "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
                            "author": "CarnalParamour",
                            "id": "ikcgul7",
                            "parent_id": "t1_ikce9f5",
                            "score": 1,
                            "created_utc": 1660539482.0,
                            "replies": [
                                {
                                    "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                                    "author": "LotBuilder",
                                    "id": "ikch142",
                                    "parent_id": "t1_ikcgul7",
                                    "score": 1,
                                    "created_utc": 1660539598.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't even see that as coming down hard. To me coming down hard would be \n\n\"You're going to show up on time and I'll deduct from your gift for every minute you're late. You're going to wear what I tell you to and you aren't going to leave until I'm satisfied.\"\n\nWhat I posted (and said to a SB once) is basically a very blunt  callout that essentially says \"hey, this is supposed to be a mutually beneficial relationship with an obvious give and take. I feel like I've been holding up my end but you've been coming up short on yours\"\n\nAs for shifting the dynamic, she already did that. She made it a \"pay me to go to dinner with you\" arrangement without OPs consent. He expected a fairly traditional SR with the trappings of a relationship. My suggestion would either move it back to what they originally agreed to or end things. Regardless of the outcome, OP wouldn't be in a SR that he wasn't happy with anymore.",
            "author": "Then-Explanation8567",
            "id": "ik8t1wj",
            "parent_id": "t1_ik5rki9",
            "score": 2,
            "created_utc": 1660478802.0,
            "replies": []
        },
        {
            "body": "yeah, cause that goes over really when vanilla dating 😂",
            "author": "joc13",
            "id": "ik2m4a3",
            "parent_id": "t1_ik2hav6",
            "score": 5,
            "created_utc": 1660352949.0,
            "replies": [
                {
                    "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
                    "author": "leavsssesthrowaway",
                    "id": "ik2obeq",
                    "parent_id": "t1_ik2m4a3",
                    "score": -1,
                    "created_utc": 1660353955.0,
                    "replies": [
                        {
                            "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                            "author": "joc13",
                            "id": "ik2oo8c",
                            "parent_id": "t1_ik2obeq",
                            "score": 17,
                            "created_utc": 1660354118.0,
                            "replies": [
                                {
                                    "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                                    "author": "leavsssesthrowaway",
                                    "id": "ik2ovp2",
                                    "parent_id": "t1_ik2oo8c",
                                    "score": 2,
                                    "created_utc": 1660354212.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                            "author": "Briellexox",
                            "id": "ikdoo9a",
                            "parent_id": "t1_ik2obeq",
                            "score": 3,
                            "created_utc": 1660569916.0,
                            "replies": [
                                {
                                    "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                                    "author": "leavsssesthrowaway",
                                    "id": "ikdq61f",
                                    "parent_id": "t1_ikdoo9a",
                                    "score": 1,
                                    "created_utc": 1660570607.0,
                                    "replies": [
                                        {
                                            "body": "It’s gentlemanly to pay for a lady.",
                                            "author": "Briellexox",
                                            "id": "ikdukbr",
                                            "parent_id": "t1_ikdq61f",
                                            "score": 1,
                                            "created_utc": 1660572536.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed. But it needs to be said because she’s not holding up her end of the bargain. The OP has seemingly been extra patient with her. \n\nEither way, sounds like they’re just not a fit for each other.",
            "author": null,
            "id": "ik1r1l4",
            "parent_id": "t1_ik1quke",
            "score": 3,
            "created_utc": 1660339290.0,
            "replies": [
                {
                    "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
                    "author": "GlitterAndSugar",
                    "id": "ik1sbic",
                    "parent_id": "t1_ik1r1l4",
                    "score": 3,
                    "created_utc": 1660339816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the well wishes. It's actually super depressing because I like her a lot, but I'm not gonna get played anymore.",
            "author": "DragonflyDry9717",
            "id": "ik49d9m",
            "parent_id": "t1_ik48mmh",
            "score": 1,
            "created_utc": 1660391493.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ik1e41w",
            "parent_id": "t1_ik1dsla",
            "score": 1,
            "created_utc": 1660334114.0,
            "replies": [
                {
                    "body": "Well if it's a challenge what's the reward?",
                    "author": "Nydahlia",
                    "id": "ik1ed06",
                    "parent_id": "t1_ik1e41w",
                    "score": 3,
                    "created_utc": 1660334211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most yes,  but there are definitely guys that try to get every ounce out of the other person.   One poor girl I met used to have overnights and the guy would limp dick her for half the night and the morning.  She would be blowing him 20 mins with him getting hard for 1 minute then losing it.  Over and over. Poor girl",
            "author": "LotBuilder",
            "id": "ikce9f5",
            "parent_id": "t1_ikcdnkj",
            "score": 1,
            "created_utc": 1660537867.0,
            "replies": [
                {
                    "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
                    "author": "CarnalParamour",
                    "id": "ikcgul7",
                    "parent_id": "t1_ikce9f5",
                    "score": 1,
                    "created_utc": 1660539482.0,
                    "replies": [
                        {
                            "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                            "author": "LotBuilder",
                            "id": "ikch142",
                            "parent_id": "t1_ikcgul7",
                            "score": 1,
                            "created_utc": 1660539598.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I literally did that the last three girls i was with on the first dates and it always went pretty much the same:\n\nInterior:\nBar, about 6:30, 2 beers in.\nME \n\"Im currently so horny i am at a loss of words. I know thats really forward but i just cant help it, youre so sexy in the way you talk and look.\"\n\nHER:\nOh wow, that IS forward of you, but refreshing...\n\nME:\n\nFor example, right now id love to bend you over this table....\n\nHER:\n\nOh really? *moves closer* \n------------\nAnd so it goes on. I make it clear that I am interested in them sexually. I also make it clear that I will not consider dating if sex isnt good. At some point of course the topic changes or it gets more intense. Without fail every girl ive been with is always HAPPY that i am direct and dont beat around the bush. \n\nUsually after that when we get somewhere discreet they cant help themselves. \n\nIm pretty sure this is from \"mode one\" by alan roger currie.\n\n\nAlso, i usually dont but the first drinks, as I gauge the girls intensions, if she seems hesitant about her paying her own 6 margaritas, then thats a massive red flag, however if shes super cool I usually surprise them with paying at the second location",
            "author": "leavsssesthrowaway",
            "id": "ik2obeq",
            "parent_id": "t1_ik2m4a3",
            "score": -1,
            "created_utc": 1660353955.0,
            "replies": [
                {
                    "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
                    "author": "joc13",
                    "id": "ik2oo8c",
                    "parent_id": "t1_ik2obeq",
                    "score": 17,
                    "created_utc": 1660354118.0,
                    "replies": [
                        {
                            "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                            "author": "leavsssesthrowaway",
                            "id": "ik2ovp2",
                            "parent_id": "t1_ik2oo8c",
                            "score": 2,
                            "created_utc": 1660354212.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
                    "author": "Briellexox",
                    "id": "ikdoo9a",
                    "parent_id": "t1_ik2obeq",
                    "score": 3,
                    "created_utc": 1660569916.0,
                    "replies": [
                        {
                            "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                            "author": "leavsssesthrowaway",
                            "id": "ikdq61f",
                            "parent_id": "t1_ikdoo9a",
                            "score": 1,
                            "created_utc": 1660570607.0,
                            "replies": [
                                {
                                    "body": "It’s gentlemanly to pay for a lady.",
                                    "author": "Briellexox",
                                    "id": "ikdukbr",
                                    "parent_id": "t1_ikdq61f",
                                    "score": 1,
                                    "created_utc": 1660572536.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well if he never let his expectations known in the first place, which is sounds like he never has, he isn’t actually being patient, he just sabotaged his own SR by not advocating for himself - SBs aren’t mind readers.\n\nOverall I think they just had a fault in communication and I don’t think it’s on just one or the other, they seem to just never have had the conversation so their SR isn’t as fulfilling as it could be.",
            "author": "GlitterAndSugar",
            "id": "ik1sbic",
            "parent_id": "t1_ik1r1l4",
            "score": 3,
            "created_utc": 1660339816.0,
            "replies": []
        },
        {
            "body": "Well if it's a challenge what's the reward?",
            "author": "Nydahlia",
            "id": "ik1ed06",
            "parent_id": "t1_ik1e41w",
            "score": 3,
            "created_utc": 1660334211.0,
            "replies": []
        },
        {
            "body": "Brutal.\n\nThose cavemen have one purpose: they make the SBs appreciate the rest of us more!",
            "author": "CarnalParamour",
            "id": "ikcgul7",
            "parent_id": "t1_ikce9f5",
            "score": 1,
            "created_utc": 1660539482.0,
            "replies": [
                {
                    "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
                    "author": "LotBuilder",
                    "id": "ikch142",
                    "parent_id": "t1_ikcgul7",
                    "score": 1,
                    "created_utc": 1660539598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sorry, I just don't have a sexually thirsty asshole gear in my transmission.\n\npersonally, I wouldn't want to be with any women that fell for crap like that.",
            "author": "joc13",
            "id": "ik2oo8c",
            "parent_id": "t1_ik2obeq",
            "score": 17,
            "created_utc": 1660354118.0,
            "replies": [
                {
                    "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
                    "author": "leavsssesthrowaway",
                    "id": "ik2ovp2",
                    "parent_id": "t1_ik2oo8c",
                    "score": 2,
                    "created_utc": 1660354212.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was with you on the first half. I would think that’s hot, but if you didn’t even pay for my drinks, my pussy would dry up immediately.",
            "author": "Briellexox",
            "id": "ikdoo9a",
            "parent_id": "t1_ik2obeq",
            "score": 3,
            "created_utc": 1660569916.0,
            "replies": [
                {
                    "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
                    "author": "leavsssesthrowaway",
                    "id": "ikdq61f",
                    "parent_id": "t1_ikdoo9a",
                    "score": 1,
                    "created_utc": 1660570607.0,
                    "replies": [
                        {
                            "body": "It’s gentlemanly to pay for a lady.",
                            "author": "Briellexox",
                            "id": "ikdukbr",
                            "parent_id": "t1_ikdq61f",
                            "score": 1,
                            "created_utc": 1660572536.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True.  That was her first SB and I was her second.  She was one of the most grateful girls I have ever met.",
            "author": "LotBuilder",
            "id": "ikch142",
            "parent_id": "t1_ikcgul7",
            "score": 1,
            "created_utc": 1660539598.0,
            "replies": []
        },
        {
            "body": "Please explain what i am doing that is wrong? \n\nYou quite literally said what I do isnt possible/ideal. Then i say it is, now you insult it. Not really a productive discussion... but whatever i was just trying to help\n\nAlso, why does it make me an asshole if i am being honest about how i feel? Do you not get turned on when you are with a woman? Why is that taboo?",
            "author": "leavsssesthrowaway",
            "id": "ik2ovp2",
            "parent_id": "t1_ik2oo8c",
            "score": 2,
            "created_utc": 1660354212.0,
            "replies": []
        },
        {
            "body": "Lol im a guy in my early twenties. I usually do fine without paying for anything. I can see it kinda being meh if i was older. \n\nThanks for admitting being honest about ones emotions is hot :)",
            "author": "leavsssesthrowaway",
            "id": "ikdq61f",
            "parent_id": "t1_ikdoo9a",
            "score": 1,
            "created_utc": 1660570607.0,
            "replies": [
                {
                    "body": "It’s gentlemanly to pay for a lady.",
                    "author": "Briellexox",
                    "id": "ikdukbr",
                    "parent_id": "t1_ikdq61f",
                    "score": 1,
                    "created_utc": 1660572536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s gentlemanly to pay for a lady.",
            "author": "Briellexox",
            "id": "ikdukbr",
            "parent_id": "t1_ikdq61f",
            "score": 1,
            "created_utc": 1660572536.0,
            "replies": []
        }
    ]
}