{
    "title": "[Update] SB isn't really into the physical aspect. I'm no longer into the financial aspect.",
    "post_id": "wo58gq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wo58gq/update_sb_isnt_really_into_the_physical_aspect_im/",
    "author": "DragonflyDry9717",
    "body": "First post was here: \n\nhttps://www.reddit.com/r/sugarlifestyleforum/comments/wmk5t3/whats_a_nice_way_to_tell_a_sb_that_shes_going_to/\n\nWell, I took the suggestions to heart and sent her info about the restaurant I reserved and wanting to have some intimate time together.\n\nIn response I got an apologetic text saying that she was extending her trip by a day and couldn't see me on the 16th anymore. She knows that starting on the 17th I have a one-week business trip that I'm super stressed about. \n\nNormally this wouldn't be a big deal. She's visiting family. But since this is her second time canceling on me this month, third time in total, and she *only* told me that she couldn't make it after not responding for two days, it looks like the gravy train is no longer in service. I used to think it was a bit sleazy to be super upfront about sex as a SD, but I guess this is why you don't take things slowly in a SD/SB relationship.\n\nI just sent her a response: \"Got it. Have a safe trip.\" Blocked and done.\n\nI guess that's what I get for trying to respect boundaries and be a gentleman.\n\nEdit: sorry, please do not solicit me with offers in DMs. I live nowhere near anyone here.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wo58gq/update_sb_isnt_really_into_the_physical_aspect_im/",
    "score": 105,
    "upvote_ratio": 0.82,
    "created_utc": 1660480058.0,
    "num_comments": 91,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/wmk5t3/whats_a_nice_way_to_tell_a_sb_that_shes_going_to/"
        ]
    ],
    "comments": [
        {
            "body": "I was right in step with you right up until “guess this is what I get for trying to respect boundaries and be a gentleman” what are you, 12? Yikes. \n\nHow about “lesson learned on direct communication, and communicating like an adult. Now in the future I won’t be so passive about the things I want” ?",
            "author": null,
            "id": "ik9umtx",
            "parent_id": "t3_wo58gq",
            "score": 136,
            "created_utc": 1660496458.0,
            "replies": [
                {
                    "body": "Second this",
                    "author": "_lil_one_",
                    "id": "ikcc7s3",
                    "parent_id": "t1_ik9umtx",
                    "score": 7,
                    "created_utc": 1660536649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did the decent thing and gave her a final chance and she showed you her true colours.\n\nHowever, don’t fall into this butt-hurt “this is what I get” nonsense. There are times when bad people take advantage of good people, but that shouldn’t make you want to stop being a good person.",
            "author": "evelyn_lovelace",
            "id": "ik90nw2",
            "parent_id": "t3_wo58gq",
            "score": 134,
            "created_utc": 1660483213.0,
            "replies": [
                {
                    "body": "Golden post.",
                    "author": "mad_dabz",
                    "id": "ika76em",
                    "parent_id": "t1_ik90nw2",
                    "score": 8,
                    "created_utc": 1660501501.0,
                    "replies": []
                },
                {
                    "body": "Well said!\n\n    People are often unreasonable, illogical and self centered;\n    Forgive them anyway.\n    \n    If you are kind, people may accuse you of selfish, ulterior motives;\n    Be kind anyway.\n    \n    If you are successful, you will win some false friends and some true enemies;\n    Succeed anyway.\n    \n    If you are honest and frank, people may cheat you;\n    Be honest and frank anyway.\n    \n    What you spend years building, someone could destroy overnight;\n    Build anyway.\n    \n    If you find serenity and happiness, they may be jealous;\n    Be happy anyway.\n    \n    The good you do today, people will often forget tomorrow;\n    Do good anyway.\n    \n    Give the world the best you have, and it may never be enough;\n    Give the world the best you've got anyway.\n    \n    You see, in the final analysis, it is between you and your God;\n    It was never between you and them anyway.\n    \n    Mother Teresa",
                    "author": "sd424242",
                    "id": "ikafprx",
                    "parent_id": "t1_ik90nw2",
                    "score": 12,
                    "created_utc": 1660505050.0,
                    "replies": [
                        {
                            "body": "The Mother Theresa quote has me in tears 😂 this subreddit seems like a place she would approve of 💁‍♀️ \n\nOP - I would suggest writing up an agreement outlining the arrangement and your needs and negotiated with future SB’s. Less room for miscommunication. Everyone is happy",
                            "author": "LadyDaisyDiablo",
                            "id": "ikaolgo",
                            "parent_id": "t1_ikafprx",
                            "score": 5,
                            "created_utc": 1660508757.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Exactly.",
                    "author": "ShaArt5",
                    "id": "ikaz2nr",
                    "parent_id": "t1_ik90nw2",
                    "score": 1,
                    "created_utc": 1660513185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You didn’t get negative consequences by respecting boundaries, that’s a warped perspective. The lesson here is effective communication.",
            "author": "nuitbelle",
            "id": "ikat80y",
            "parent_id": "t3_wo58gq",
            "score": 27,
            "created_utc": 1660510704.0,
            "replies": []
        },
        {
            "body": ">I guess that's what I get for trying to respect boundaries and be a gentleman.\n\nNope. Respecting boundaries is bare minimum so skip that sentence :D. I can be gorgeous sensual and elegant lady with manners and I will still happen to meet men which come to date in designer sweatpants or spreading butter over bread and handing it over to me like if I am child. And yes I am talking from experience. Does it mean  I should lower my qualities to be more successful? No.",
            "author": "idontlikespiderplant",
            "id": "ikbci5x",
            "parent_id": "t3_wo58gq",
            "score": 15,
            "created_utc": 1660519136.0,
            "replies": []
        },
        {
            "body": "The good news is there are sugar babies who love sex and who will love sex with you",
            "author": "Aphrodisiatic922",
            "id": "ik984mj",
            "parent_id": "t3_wo58gq",
            "score": 26,
            "created_utc": 1660486894.0,
            "replies": []
        },
        {
            "body": "I had an SB once took her on 10 dates, including like hockey games with seats on the ice!!! 5 star restaurants, etc… plus an allowance we never got physical once!!! At the beginning we talked about this being a physical relationship, and she said she was ok with that once she felt comfortable, then at like date 8 or 9 I asked again, and she said she was still down for a physical relationship. Shortly after that she got COVID (or so she said) but then she posts a Snapchat of her at a bar on trivia night, also a Sunday night, cause I could see the football game I was watching on TV on the TVs in the bar. So I ask her about the Snapchat video and she tells me she reposted an older video to help the guy that runs trivia out… so I called her on it and ended the arrangement. It was after this experience that I decided to 1. Always start with ppm and not an allowance and 2. Never do more that 2 platonic dates to start an arrangement, if they are not comfortable after that, I assume they never will be.",
            "author": "Glock9prfction",
            "id": "ik8xcrr",
            "parent_id": "t3_wo58gq",
            "score": 37,
            "created_utc": 1660481389.0,
            "replies": [
                {
                    "body": "Ouch, 10 platonic dates with allowance? That is next level rinser lol. Im curious, did you ever invite her to a hotel or your home for a date and she rejected? \n\nI think we’ve all been there and that’s why we have rules in place to avoid getting rinsed/used.",
                    "author": null,
                    "id": "ik8zaya",
                    "parent_id": "t1_ik8xcrr",
                    "score": 26,
                    "created_utc": 1660482473.0,
                    "replies": [
                        {
                            "body": "Yea we did a couple of dates at my place at around date 3 and then again around date 6. Well the allowance wasn’t a lot, like less that half of what other SBs had been asking for, I assumed or really planned to up the amount once things got physical, and honestly I enjoyed her company she was a lot of fun to just hang out with.\n\nBut yea I have made a lot of rookie mistakes I guess since I started this a couple of years ago.",
                            "author": "Glock9prfction",
                            "id": "ik8znhn",
                            "parent_id": "t1_ik8zaya",
                            "score": 7,
                            "created_utc": 1660482665.0,
                            "replies": [
                                {
                                    "body": "Did you ever make a move on her when she was at your place?",
                                    "author": null,
                                    "id": "ik90021",
                                    "parent_id": "t1_ik8znhn",
                                    "score": 3,
                                    "created_utc": 1660482855.0,
                                    "replies": [
                                        {
                                            "body": "No, i intended to you know, but while we were having dinner or relaxing on my porch she would say something that would make sure that didn’t happen, the first time she just mentioned not being ready (and coming from Vanilla you kind of have it in your head that 3-6 dates is usually when sex would happen), then at date 6 she mentioned being on her period (which may have been true there were some female products left in my bathroom trash, I wasn’t going to investigate to see if they were used). In retrospect I think she knew exactly what she was doing, that is why she faked being sick with Covid, she figured she would get another 2 weeks out of me without having to be pressured or see me. She just got stupid and forgot I was on her Snapchat",
                                            "author": "Glock9prfction",
                                            "id": "ik90hnu",
                                            "parent_id": "t1_ik90021",
                                            "score": 5,
                                            "created_utc": 1660483122.0,
                                            "replies": [
                                                {
                                                    "body": "Gotcha. I’ve been there. Lesson learned! You give an inch, they take a mile.",
                                                    "author": null,
                                                    "id": "ik90rjp",
                                                    "parent_id": "t1_ik90hnu",
                                                    "score": 2,
                                                    "created_utc": 1660483266.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Been there too. Almost exactly the same, pretend COVID and active socials. It’s tough when you really like the girl under the bs.",
                    "author": "halmone",
                    "id": "ik9dupd",
                    "parent_id": "t1_ik8xcrr",
                    "score": 3,
                    "created_utc": 1660489448.0,
                    "replies": []
                },
                {
                    "body": "She taught you a very expensive lesson!",
                    "author": null,
                    "id": "ik9gjwe",
                    "parent_id": "t1_ik8xcrr",
                    "score": 4,
                    "created_utc": 1660490611.0,
                    "replies": []
                },
                {
                    "body": "I usually have sex with the gal before I establish any kind of allowance with them. Just to make sure there’s some kind of emotional connection. I’m also younger and pretty charming so idk if that factors into this. It’s pretty easy to tell if there’s any kind of mutual attraction on the first date alone.",
                    "author": "YoungDorkySD",
                    "id": "ik98acy",
                    "parent_id": "t1_ik8xcrr",
                    "score": -6,
                    "created_utc": 1660486966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've had ones cancel on me last minute and always with crazy excuses. Like 1 in a million life events (I mean, how many times this girl's grandma died, I wonder) 😂 I simply let her know that it's not working out and good luck with her search. Next. There's too many choices out there to waste your time on flaky behaviour. I get matches daily with eligible ladies, so why worry about one?",
            "author": "Pretend-Musician-912",
            "id": "ik8yqo9",
            "parent_id": "t3_wo58gq",
            "score": 9,
            "created_utc": 1660482166.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ikagim8",
                    "parent_id": "t1_ik8yqo9",
                    "score": 11,
                    "created_utc": 1660505385.0,
                    "replies": [
                        {
                            "body": "Jeez... The nerve of some people 😂 just makeup anything to avoid confronting people",
                            "author": "Pretend-Musician-912",
                            "id": "ikakg6a",
                            "parent_id": "t1_ikagim8",
                            "score": 4,
                            "created_utc": 1660507029.0,
                            "replies": []
                        },
                        {
                            "body": "in all fairness it could have been sarcasm. but if not, and he actually thinks you'd believe him - that's a bit much",
                            "author": "davitech73",
                            "id": "ikki4m4",
                            "parent_id": "t1_ikagim8",
                            "score": 1,
                            "created_utc": 1660682724.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I guess that's what I get for trying to respect boundaries and be a gentleman.\n\nNo.  You sound like an incel complaining that women don't like \"nice\" guys.\n\nI consider myself a gentlemen, and I fully respect boundaries.  But I also have my OWN boundaries.  And my own expectations.  And I'm mature enough to to be able to communicate, and stand by them.\n\nSo again, no, the problem was *not* you being a gentlemen.",
            "author": "SDstartingOut",
            "id": "ik8yb71",
            "parent_id": "t3_wo58gq",
            "score": 90,
            "created_utc": 1660481926.0,
            "replies": [
                {
                    "body": "Very much this ^ \n\nBeing “nice” doesn’t mean being taken advantage of and your remark really does sound like you’re starting to wander down the path of self-pity instead of learning from this experience and committing in the future to communicate boundaries and expectations clearly.  This will reduce the risk of being rinsed and increase the chances that you’ll end up with an arrangement you want.  \n\nThis includes stating at some point in the early stages of messaging something along the lines of (assuming this is accurate for you):  “To me, an arrangement is a relationship that involves financial support and companionship, including intimate companionship.  Accordingly, while I’m certainly willing to spend a little time so we can get to know each other better, the arrangement doesn’t begin until we both are comfortable enough for intimacy.”  \n\nI have a longer vetting process than most and make sure POT SBs know what they are getting into.  (I’ll often suggest that they visit this subreddit to learn more).  That way, no one is surprised at or after the M&G.  In my nearly 5 years of having long-term arrangements I’ve had very few misunderstandings.  \n\nWishing you happy (and safe) sugaring.",
                    "author": "leyapaul",
                    "id": "ik9lsgm",
                    "parent_id": "t1_ik8yb71",
                    "score": 28,
                    "created_utc": 1660492825.0,
                    "replies": []
                },
                {
                    "body": "That’s very nicely said!",
                    "author": "Phagoat",
                    "id": "ik9wrfq",
                    "parent_id": "t1_ik8yb71",
                    "score": 3,
                    "created_utc": 1660497306.0,
                    "replies": []
                },
                {
                    "body": "Nah, eat shit.\n\nShe said that she wanted to take it slowly. The gentlemanly thing to do in that situation is to express your desire, not push the issue, and enjoy our time together. That's precisely what I did, and it got me a SB who walked all over me, got an appointment for her nails immediately after a date, and canceled on me all the time.\n\nFor some people, if you give them an inch they'll take a mile. And that's what happened to me. Calling me an incel for stating that is pretty fucking weird.",
                    "author": "DragonflyDry9717",
                    "id": "ik90dm9",
                    "parent_id": "t1_ik8yb71",
                    "score": -30,
                    "created_utc": 1660483059.0,
                    "replies": [
                        {
                            "body": "The guy is harsh but right. Its your boundaries that are missing.\n\nA gentleman expects respect and is clear about it. \n\nYou have confusion about that. No need to be bitter. The guy is trying to do you a favor.",
                            "author": "earthen-monkey",
                            "id": "ik91ntn",
                            "parent_id": "t1_ik90dm9",
                            "score": 50,
                            "created_utc": 1660483738.0,
                            "replies": [
                                {
                                    "body": "There’s nothing sexier than a man who’s respectful and considerate but also has strong boundaries. Guys like that don’t argue, pout, or pity themselves when their boundaries are crossed; they just don’t continue to deal with a person or situation that disregards their needs.",
                                    "author": "celestialsavage",
                                    "id": "ik9301e",
                                    "parent_id": "t1_ik91ntn",
                                    "score": 36,
                                    "created_utc": 1660484430.0,
                                    "replies": [
                                        {
                                            "body": "Nothing sexier you say? 😙",
                                            "author": "earthen-monkey",
                                            "id": "ik97p8x",
                                            "parent_id": "t1_ik9301e",
                                            "score": 5,
                                            "created_utc": 1660486700.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> Nah, eat shit.\n\nYeah, your not a gentleman, lol.\n\n> Calling me an incel\n\nI didn't call you an incel.  Simply comparing it to the situation you see with them complaining about \"nice guys\".  And that it's how you risk coming across.",
                            "author": "SDstartingOut",
                            "id": "ik90pnl",
                            "parent_id": "t1_ik90dm9",
                            "score": 22,
                            "created_utc": 1660483239.0,
                            "replies": [
                                {
                                    "body": "Pretty sure OP meant they were a gentleman to the SB, not to the person calling them an incel",
                                    "author": "paperclipestate",
                                    "id": "ikbsjpw",
                                    "parent_id": "t1_ik90pnl",
                                    "score": 2,
                                    "created_utc": 1660526670.0,
                                    "replies": []
                                },
                                {
                                    "body": "Telling a guy who calls you an incel to eat shit is about as gentlemanly as it gets 😂",
                                    "author": "DragonflyDry9717",
                                    "id": "ik91qgg",
                                    "parent_id": "t1_ik90pnl",
                                    "score": -18,
                                    "created_utc": 1660483776.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ok, your replies are not gentlemanly but. .  .\n\nYou did the right thing. This type of dating is “sex work lite,” if you will. She’s absolutely not into you in that way and you handled it correctly.  She wants rewards for showing up for 10 minutes and you’re not getting what you would like.  She already took the money. In sugar dating, this is largely unacceptable. In vanilla, it’s ok not to be on the same page about intimacy at the start.  \n\nProbably a TikTok SB.\n\nI don’t agree with the SD judgements above. You bring up your desires and she finally responds to cancel. She’s obviously not your SB!",
                            "author": "JSBelle",
                            "id": "ik93g4s",
                            "parent_id": "t1_ik90dm9",
                            "score": 9,
                            "created_utc": 1660484658.0,
                            "replies": [
                                {
                                    "body": "> You did the right thing\n\nDepends what you mean.  Did he do the right thing from the start of the SR?  No.  Given where he is at today, did he do the right thing?  Absolutely.\n\nThe shit he is getting (at least from me) - is implying that he ended in the situation for being a \"gentlemen\" and respecting her boundaries.  That is incorrect.  He needs his own boundaries.",
                                    "author": "SDstartingOut",
                                    "id": "ik966zh",
                                    "parent_id": "t1_ik93g4s",
                                    "score": 8,
                                    "created_utc": 1660485980.0,
                                    "replies": [
                                        {
                                            "body": "I mean in terms of ending it. He’s a grown man and I’m not commenting on his capabilities. Just the situation at hand. She had sex with him, took financial help, and avoided sex thereafter. She clearly did not enjoy sex with him. As a woman, that would be my reason to avoid it.  If I disliked the guy.",
                                            "author": "JSBelle",
                                            "id": "ik972uo",
                                            "parent_id": "t1_ik966zh",
                                            "score": 3,
                                            "created_utc": 1660486403.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm a woman and I agree it's not incel at all... like all catch phrases people overuse them and misuse them. You're not bitter women are not having sex with you because you're nice. You were taken advantage of in a business arrangement and because you were being a gentleman it went on longer than it should have.",
                            "author": "Electronic_Yam5838",
                            "id": "ik9mk7h",
                            "parent_id": "t1_ik90dm9",
                            "score": 2,
                            "created_utc": 1660493143.0,
                            "replies": []
                        },
                        {
                            "body": "You shouldn't accept a women who is canceling only you constantly. You have to put the boundary of one warning then you're done. You let her get away with a lot comparatively",
                            "author": "NeighborhoodItchy943",
                            "id": "ika3xd4",
                            "parent_id": "t1_ik90dm9",
                            "score": 1,
                            "created_utc": 1660500163.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You're mature yet call OP an incel. Ok bud.",
                    "author": "NotARussianBot1984",
                    "id": "ik9i0ff",
                    "parent_id": "t1_ik8yb71",
                    "score": -6,
                    "created_utc": 1660491244.0,
                    "replies": [
                        {
                            "body": "OP is an incel though...",
                            "author": "Bamkill",
                            "id": "ik9p2ps",
                            "parent_id": "t1_ik9i0ff",
                            "score": 2,
                            "created_utc": 1660494173.0,
                            "replies": [
                                {
                                    "body": "How can a SD be an incel? He did have sex with her. Read first post. \nLol i swear idiots throw incel around without knowing what it stands for.",
                                    "author": "NotARussianBot1984",
                                    "id": "ik9uc5c",
                                    "parent_id": "t1_ik9p2ps",
                                    "score": 1,
                                    "created_utc": 1660496342.0,
                                    "replies": [
                                        {
                                            "body": "It's changed to describe men that get bitter and are overly sensitive. Someone with confidence and boundaries will still be hurt in OP's situation, but won't lash out. It's the lashing out in the comments that seems like incel behavior.",
                                            "author": "TravelingSunbunny",
                                            "id": "ik9yo6l",
                                            "parent_id": "t1_ik9uc5c",
                                            "score": 11,
                                            "created_utc": 1660498065.0,
                                            "replies": [
                                                {
                                                    "body": "That’s a nice guy not an incel",
                                                    "author": "paperclipestate",
                                                    "id": "ikbsnzu",
                                                    "parent_id": "t1_ik9yo6l",
                                                    "score": 2,
                                                    "created_utc": 1660526727.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Perfectly stated.",
                    "author": "lifting12",
                    "id": "ikbzwgi",
                    "parent_id": "t1_ik8yb71",
                    "score": 1,
                    "created_utc": 1660530172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"i guess that's what i get for trying to respect boundaries\"\n\nlmao",
            "author": "MissMilkerss",
            "id": "ik9aywi",
            "parent_id": "t3_wo58gq",
            "score": 18,
            "created_utc": 1660488168.0,
            "replies": []
        },
        {
            "body": "*I guess that's what I get for trying to respect boundaries and be a gentleman.*\n\nYou should respect boundaries and you Should be a gentleman at all times.\n\nThis, however is NOT the same as being a sucker for a rinser (or wash & Rinse - or however we should classify your former SB).\n\nBoundaries are wonderful - and you should have some too - like clear expectations up front that Sugar starts when Sugar starts :-)  before that there can be gifting - but that is optional (your choice).  \n\nIf an SB wants more time then that is fine - but the general process is no allowance, and certainly no shopping until the intimacy starts - otherwise the risk of Rinsing is too great. \n\nThis is the reasonable compromise that most agree on in the Bowl. \n\nIt is normal to have 1 Meet & Greet - and a few platonic and unpaid dates - however, if 1-3 dates are not enough to 'get comfortable' then it is time to have a frank discussion of what are the requirements for 'comfort' - otherwise - Next them",
            "author": "sd424242",
            "id": "ikacctm",
            "parent_id": "t3_wo58gq",
            "score": 6,
            "created_utc": 1660503652.0,
            "replies": []
        },
        {
            "body": "Move on man, don’t be a dick lol",
            "author": "macz786",
            "id": "ikazfz9",
            "parent_id": "t3_wo58gq",
            "score": 8,
            "created_utc": 1660513346.0,
            "replies": [
                {
                    "body": "atta boy mac",
                    "author": null,
                    "id": "ikcc0tm",
                    "parent_id": "t1_ikazfz9",
                    "score": 2,
                    "created_utc": 1660536536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Since she did have sex once and then refused to again it sounds like she really didn’t enjoy it",
            "author": "Altruistic_Yellow387",
            "id": "ikbfyni",
            "parent_id": "t3_wo58gq",
            "score": 4,
            "created_utc": 1660520731.0,
            "replies": []
        },
        {
            "body": "If I was an SD, I would have done the same - it’s not sleazy to call attention to terms of an arrangement that’s being unfulfilled (like if she was a good SB and you kept canceling on her last minute or forgetting payment and she confronted you about it). Hope you find another fun distraction before your stressful trip!",
            "author": "Frostybrat",
            "id": "ik9jyw1",
            "parent_id": "t3_wo58gq",
            "score": 3,
            "created_utc": 1660492077.0,
            "replies": [
                {
                    "body": "Thanks for your candor. In discussions about sugar dating, I have occasionally called out the hypocrisy of some SBs expecting more from the SDs than they are willing to give in return. They don’t like to hear it  For some reason they are never quite able to specify why their point of view is justified.  Go figure.",
                    "author": "Chill_SD1974",
                    "id": "ikbncws",
                    "parent_id": "t1_ik9jyw1",
                    "score": 1,
                    "created_utc": 1660524242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If sex is part of the reason you are doing this, then there should be sex on the very first ppm date. Otherwise you are just leading yourself down this path. You set these expectations but, let me be totally honest, being a total simp doormat.\n\nI am only being harsh to help you learn from this and not repeat it in the future.\n\nDiscuss this stuff in advance, preferably before the meet & greet. Make sure she understands this is a physical, intimate relationship. If she isn't cool with that, no problem. That is 100% her right of course. But make it clear up front so you don't get taken advantage of like this again.",
            "author": "CarnalParamour",
            "id": "ikag95h",
            "parent_id": "t3_wo58gq",
            "score": 3,
            "created_utc": 1660505275.0,
            "replies": []
        },
        {
            "body": "I think you can still be a gentleman & wait a date or 2 . You have to learn to take a clue unfortunately . She should of been eagerly trying to reschedule & make it up to you after the 1st time . The delay in response is a clue and also just ask ARE YOU ATTRACTED TO ME  ask in person or over video chat atleast twice Good Luck",
            "author": "NewHereJune2020",
            "id": "ikbq3g8",
            "parent_id": "t3_wo58gq",
            "score": 3,
            "created_utc": 1660525527.0,
            "replies": []
        },
        {
            "body": "Every SD I’m dating has said “we can get physical when you’re comfortable take as long as you need.” That’s not being a gentleman, that’s the lowest bar to meet for being a decent ethical person. Would intimacy even be fun with someone who clearly isn’t enthusiastic and comfortable?\n\nOn the other side of the coin, you shouldn’t tolerate anything you wouldn’t tolerate with vanilla dating. If people cancel or are late repeatedly I’ll ghost them. No hard feelings but no time to deal with that and there are legit people to find out there and that’s who I need my time for.\n\nETA- a man whether vanilla or sugar who prioritizes my comfort immediately stands a much better chance with me taking my clothes off sooner. Too much pressure definitely puts me in anxiety mode and I’m not only not into intimacy in that headspace but even if I give it up I’m definitely not the great lover I am when I’m relaxed and feel good about it.",
            "author": null,
            "id": "ik993k6",
            "parent_id": "t3_wo58gq",
            "score": 14,
            "created_utc": 1660487333.0,
            "replies": [
                {
                    "body": "Yeah, I think this is what a lot of this sub needs. Very often, I hear the “3 date rule”, and if she doesn’t have intimacy on 2nd or 3rd date, she’s a “rinser”: no matter how good those dates were, no matter if she gave physical affection during those dates, nothing. I don’t mind if the SD abides by this rule and is up front about it- but now I see a lot of SDs that just expect it without communicating their want for intimacy quickly.\n\nMany of the old-fashioned SRs are quite lost on this sub. There isn’t a one size fits all for SRs. As long as you set boundaries on both sides, it will be successful. Of course, you also have to find people that respect each other, which is also hard to find in the bowl haha! The ghosting showed a lack of respect from her side, so ultimately, it is good that they ended things. I’m just not too sure OP’s mindset is good, now that this happened, for a successful SR in the future.",
                    "author": "SevvyChan",
                    "id": "ik9jktb",
                    "parent_id": "t1_ik993k6",
                    "score": 10,
                    "created_utc": 1660491910.0,
                    "replies": [
                        {
                            "body": "Oh yeah I get why OP is a bit steamed. Dating is hard and people are annoying.\n\nBut can’t let it molder inside you and become something toxic that colors all your future encounters. Just gotta tell yourself there’s more people out there and better times are around the corner and learn red flags to look out for and move on.",
                            "author": null,
                            "id": "ik9qbua",
                            "parent_id": "t1_ik9jktb",
                            "score": 5,
                            "created_utc": 1660494692.0,
                            "replies": []
                        },
                        {
                            "body": "For me this is the best part of the Bowl\n\nThere is NO SUCH THING as a \"normal SR\" - the relationship is what is created between the 2 people in the relationship and belongs only to them!\n\nTherefore it is very possible to create whatever you want. \n\nIf you are an SB and you want 5-10 dates before Intimacy?  Go For it - just be clear up front that this is what you will be looking for - and then the SD is free to accept, decline, or make a counter offer (how about 4-6?)  - the point is All Issues can be resolved with Open Communication of what you want!   \n\nMeasure your desires against that of your partner and see what you can come together to create.  Always go for Win/Win - there never needs to be any Win/Lose or Lose/Win",
                            "author": "sd424242",
                            "id": "ikaf2sg",
                            "parent_id": "t1_ik9jktb",
                            "score": 4,
                            "created_utc": 1660504784.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Any pressure or coercion is most definitely unacceptable.\n\nCommunication is something that anyone who has seen my comments know I am committed to supporting.  (When in doubt - SAY SOMETHING!) \n\nThe beauty  of the bowl is that it is perfectly acceptable to have very clear, deeply honest and extremely direct communications about what to expect when from **both sides**.  This supports the boundaries that both SD and SB have.  Both sides are respected and no one feels pressured. \n\nIf an SB wants a few more 'platonic dates' then that can be fine if it is being clearly communicated, along with what the SD can do increase the comfort and relaxation of the SB.  \n\nIt should also be a standard expectation that Allowance will not start until the intimacy starts - otherwise this encourages the Rinsers.   They are every bit as vile for SDs as the Pushy obnoxious \"I shouldn't have to pay\" entitled types who pretend to be an SD are for SBs.  \n\nThe problem with BOTH of these nasty creatures is their sense of Entitlement - \"Well I DESERVE THIS\" - whatever it is they think they should have - and comes from a lack of concern for the other person   \n\"What? You expect to be treated like an actual Person? What do you mean you are NOT my Plaything???? - THE NERVE!!\"   \nEntitled people do have a Lot of Nerve - yet accuse the other person of having it. \n\nThis is why any whiff of Entitlement is an Instant Red flag and should be an automatic NEXT for the Responsible SB and SD alike!",
                    "author": "sd424242",
                    "id": "ikaegrz",
                    "parent_id": "t1_ik993k6",
                    "score": 3,
                    "created_utc": 1660504526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well done! On to the next one.",
            "author": "SDinAsia",
            "id": "ik8vm3x",
            "parent_id": "t3_wo58gq",
            "score": 4,
            "created_utc": 1660480388.0,
            "replies": []
        },
        {
            "body": "It sounds like this has been a common theme for many SD’s, myself included.  I think you handled you handled it well— cutting it off, you can only get blown off so much.  I unfortunately was always making excuses or trying to believe mine for missed appointments (sickness— physical and mental health issues), family emergencies, job related shifts.  If definitely played with my ego.  I went into a mini-depression because of it.   I have learned due in large part to this group that issues were hers, not mine, and that I’m much better off without her in my life.  Thanks for sharing your journey and helping others with similar stories.",
            "author": "PracticePositive69",
            "id": "ika9rhv",
            "parent_id": "t3_wo58gq",
            "score": 2,
            "created_utc": 1660502572.0,
            "replies": []
        },
        {
            "body": "It’s so telling that you are getting DM offers. Yet all the women here have multiple SDs??  Lol I could just roll over at this point.",
            "author": "JSBelle",
            "id": "ik93vnn",
            "parent_id": "t3_wo58gq",
            "score": 5,
            "created_utc": 1660484871.0,
            "replies": [
                {
                    "body": "They can all smell an easy bag.",
                    "author": null,
                    "id": "ik9qzzg",
                    "parent_id": "t1_ik93vnn",
                    "score": 8,
                    "created_utc": 1660494968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I once had a sb who we had three platonic dates.  At the end of the third one she just stuck her hand out.  I never saw her again after that.",
            "author": "wedge1174",
            "id": "ik9917p",
            "parent_id": "t3_wo58gq",
            "score": 4,
            "created_utc": 1660487303.0,
            "replies": [
                {
                    "body": "Did you not even give her a high five?",
                    "author": null,
                    "id": "ik9qkk9",
                    "parent_id": "t1_ik9917p",
                    "score": 13,
                    "created_utc": 1660494793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No honey, no money. I’m a Demi-Financial.",
            "author": "3hrs2thebeach",
            "id": "ik9gxm0",
            "parent_id": "t3_wo58gq",
            "score": 2,
            "created_utc": 1660490776.0,
            "replies": []
        },
        {
            "body": "this is what makes it such a game, of the SB acting like they \"might\" have sex if they feel comfortable, and then the rest of the relationship becomes a game to see if they will actually be interested but they collect their earnings in the meantime regardless. there might be other benefits of the relationship too of course, it just comes down to what had been agreed upon. but when they see \"if I am comfortable, i will have sex\", they will always end up not being comfortable. they are just wording it in a way to have a chance to collect some easier money",
            "author": "Fabulous_Storm2437",
            "id": "ik9q7tj",
            "parent_id": "t3_wo58gq",
            "score": 2,
            "created_utc": 1660494646.0,
            "replies": [
                {
                    "body": "Yeah, to that, I just say, I'm not comfortable providing financial support until there is intimacy.  In other words, that comfort goes both ways.  \n\nEvery time I've said that, to some POT \"SB\" who said she just wants enough dates to be \"comfortable\" with intimacy... they all basically ghost.  Which tends to support my theory that they were all rinsers.  \n\nTo be clear, I always say I am fine with more platonic dates to get to know each other and get more comfortable with each other.  I just also make clear financial support only starts when there is intimacy.  Amazing how fast those types all disappear when I make that clear.",
                    "author": "Mainlyharmless",
                    "id": "ikacqjo",
                    "parent_id": "t1_ik9q7tj",
                    "score": 0,
                    "created_utc": 1660503810.0,
                    "replies": [
                        {
                            "body": "Great approach. Turn it back to your comfort level too since you are an equal party in the relationship. And yet you are still thoughtful in regard to her concerns, win win",
                            "author": "Fabulous_Storm2437",
                            "id": "ikb146f",
                            "parent_id": "t1_ikacqjo",
                            "score": 1,
                            "created_utc": 1660514062.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Man, I just needed to create an account to give my comments on this. \n\nYour post just make me feel the angriest person on Earth. \n\nMany men (most problably you're one of those) are begging for love when they're not loving themselves. \n\nEven in a Vainilla relationship after 2 or 3 no reason canceled dates, there's no return point. NEXT!\n\nWhy would you keep PAYING (key word, don't forget it) someone after 1-2 dates where there's nothing physical involved?\n\nIf you're good with supporting someone financially endlessly and with nothing in return, that's fine. But as you said in your first post, you're looking for sex so why would you keep paying someone if there's no interest from her side. Trust me, an escort is way cheaper.",
            "author": "Nobodi010203",
            "id": "ikbept4",
            "parent_id": "t3_wo58gq",
            "score": 2,
            "created_utc": 1660520154.0,
            "replies": []
        },
        {
            "body": "You gave her way too much time! What a waste of time and resources that could have been invested elsewhere.",
            "author": null,
            "id": "ik9gfcd",
            "parent_id": "t3_wo58gq",
            "score": 3,
            "created_utc": 1660490556.0,
            "replies": []
        },
        {
            "body": "Good on you. Onward and upward!",
            "author": null,
            "id": "ik8wuj8",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660481103.0,
            "replies": []
        },
        {
            "body": "You'll get used to vet rinsers and escorts.",
            "author": "sugardad123",
            "id": "ik9eqtd",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660489835.0,
            "replies": []
        },
        {
            "body": "You have to be very direct with these women or they will walk all over you lol",
            "author": "WalterWhite2016",
            "id": "ikax005",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660512293.0,
            "replies": []
        },
        {
            "body": "Good for you on dropping the rinser",
            "author": "BigBearSD",
            "id": "ik998mn",
            "parent_id": "t3_wo58gq",
            "score": 0,
            "created_utc": 1660487398.0,
            "replies": []
        },
        {
            "body": "Well done. You are a seasoned and understanding SD who gets it.",
            "author": "Defiant-Theory",
            "id": "ik9h7jv",
            "parent_id": "t3_wo58gq",
            "score": 0,
            "created_utc": 1660490895.0,
            "replies": []
        },
        {
            "body": "Ppm only.  Intimate on the second date.  Keep it simple.  Anything outside of this can be abused by either side.\n\n\nYou are less petty than I am, I would’ve strung her along until the 30th and then dumped her right when she thought she was getting allowance again.",
            "author": "LotBuilder",
            "id": "ik9z592",
            "parent_id": "t3_wo58gq",
            "score": -3,
            "created_utc": 1660498244.0,
            "replies": []
        },
        {
            "body": "As a late friend of mine used to say 'Walk away, Renoir.'\n\nPull up your big boy trousers, mark it down to experience, and fuggedaboutit.\n\nMove on.",
            "author": "Captain-Marmite",
            "id": "ikaqwae",
            "parent_id": "t3_wo58gq",
            "score": 0,
            "created_utc": 1660509724.0,
            "replies": []
        },
        {
            "body": "This is a numbers game. You’re due for a good experience now",
            "author": "Realistic_Scratch912",
            "id": "ikat9ei",
            "parent_id": "t3_wo58gq",
            "score": 0,
            "created_utc": 1660510720.0,
            "replies": []
        },
        {
            "body": "Well done buddy.  She was totally rinsing you\n\nLearn your lessons and move on we’ve all been in that situation with leeches",
            "author": "wb19081908",
            "id": "ikbxt3i",
            "parent_id": "t3_wo58gq",
            "score": 0,
            "created_utc": 1660529160.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ik8vmge",
            "parent_id": "t3_wo58gq",
            "score": -18,
            "created_utc": 1660480394.0,
            "replies": [
                {
                    "body": "You can be a gentleman and set boundaries and not be taken advantage of. I always treat any SB I meet with respect, I give them the benefit of the doubt for awhile, but too many cancellations or excuses or weird behaviour or too much entitlement and I’m out. There are just too many good or better options out there.",
                    "author": null,
                    "id": "ik8wqaq",
                    "parent_id": "t1_ik8vmge",
                    "score": 15,
                    "created_utc": 1660481035.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good luck buddy onwards and upwards!",
            "author": "Jonconnerysd",
            "id": "ik90cvd",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660483048.0,
            "replies": []
        },
        {
            "body": "Good for. You'll find another SB that'll be willing to agree with your terms.",
            "author": "Automatic_Joke_4414",
            "id": "ik9bt3d",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660488547.0,
            "replies": []
        },
        {
            "body": "Good job!!",
            "author": "Heree2Comment",
            "id": "ika88jv",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660501937.0,
            "replies": []
        },
        {
            "body": "Thanks for the update!",
            "author": "Fertility18",
            "id": "ikb3idr",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660515101.0,
            "replies": []
        },
        {
            "body": "As much as I hate to say it but it’s an order without delivery now so just break it I guess. Save both parties the suffering.",
            "author": "Cimegs5088",
            "id": "ikccdzt",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660536751.0,
            "replies": []
        },
        {
            "body": "As someone that used to be a SB; these young girls on TikTok have 0 idea what they’re getting into. It’s a beneficial situation (both parties) I understand new age social media has made it seem like you do nothing and get $$$ but realistically this isn’t it. \n\nI’m glad you did what you needed to benefit you.",
            "author": "Universecentre",
            "id": "ikcisv8",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660540769.0,
            "replies": []
        },
        {
            "body": "Dear Lawd!  Already getting so many offers, that the poor dude had to make an edit!🙈🙊🙉\n\nI wish you the very best hun, where ever in the 🌎 that you may be.\nPlease don't give up on being a gentleman though....remember, you had several ladies helping to answer you previously....ergo, there is still some beauty, somewhere, that has hopes to make you feel equally adored😘.🥰",
            "author": "JustAsk4Alice",
            "id": "ikcoasn",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660544663.0,
            "replies": []
        },
        {
            "body": "Just keep it simple next time. Have a stricter & more accelerated timeline. If after 2 unpaid platonic she's not open to put out, then move on.  If she stop putting out after the relationship starts, you move on all the same.",
            "author": "vdzz000",
            "id": "ikdcy0z",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660563653.0,
            "replies": []
        },
        {
            "body": "this is why you don't take things slowly in a SD/SB relationship.\n\nYou have gotten your Master's degree in sugaring. Now straighten up and do it right. \n\nGive her the pink slip.",
            "author": "GSSD",
            "id": "ikdjkty",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660567400.0,
            "replies": []
        },
        {
            "body": "Thanks. The only different thing for me would be having sent a gracious thank you, and telling her that the relationship is not working for me.",
            "author": "sfwinefan",
            "id": "ikdmx40",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660569080.0,
            "replies": []
        },
        {
            "body": "Where are all the SD at?? Lol I never find any in my area",
            "author": "Ayla_la",
            "id": "ikdta4n",
            "parent_id": "t3_wo58gq",
            "score": 1,
            "created_utc": 1660571985.0,
            "replies": []
        },
        {
            "body": "Second this",
            "author": "_lil_one_",
            "id": "ikcc7s3",
            "parent_id": "t1_ik9umtx",
            "score": 7,
            "created_utc": 1660536649.0,
            "replies": []
        },
        {
            "body": "Golden post.",
            "author": "mad_dabz",
            "id": "ika76em",
            "parent_id": "t1_ik90nw2",
            "score": 8,
            "created_utc": 1660501501.0,
            "replies": []
        },
        {
            "body": "Well said!\n\n    People are often unreasonable, illogical and self centered;\n    Forgive them anyway.\n    \n    If you are kind, people may accuse you of selfish, ulterior motives;\n    Be kind anyway.\n    \n    If you are successful, you will win some false friends and some true enemies;\n    Succeed anyway.\n    \n    If you are honest and frank, people may cheat you;\n    Be honest and frank anyway.\n    \n    What you spend years building, someone could destroy overnight;\n    Build anyway.\n    \n    If you find serenity and happiness, they may be jealous;\n    Be happy anyway.\n    \n    The good you do today, people will often forget tomorrow;\n    Do good anyway.\n    \n    Give the world the best you have, and it may never be enough;\n    Give the world the best you've got anyway.\n    \n    You see, in the final analysis, it is between you and your God;\n    It was never between you and them anyway.\n    \n    Mother Teresa",
            "author": "sd424242",
            "id": "ikafprx",
            "parent_id": "t1_ik90nw2",
            "score": 12,
            "created_utc": 1660505050.0,
            "replies": [
                {
                    "body": "The Mother Theresa quote has me in tears 😂 this subreddit seems like a place she would approve of 💁‍♀️ \n\nOP - I would suggest writing up an agreement outlining the arrangement and your needs and negotiated with future SB’s. Less room for miscommunication. Everyone is happy",
                    "author": "LadyDaisyDiablo",
                    "id": "ikaolgo",
                    "parent_id": "t1_ikafprx",
                    "score": 5,
                    "created_utc": 1660508757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly.",
            "author": "ShaArt5",
            "id": "ikaz2nr",
            "parent_id": "t1_ik90nw2",
            "score": 1,
            "created_utc": 1660513185.0,
            "replies": []
        },
        {
            "body": "Ouch, 10 platonic dates with allowance? That is next level rinser lol. Im curious, did you ever invite her to a hotel or your home for a date and she rejected? \n\nI think we’ve all been there and that’s why we have rules in place to avoid getting rinsed/used.",
            "author": null,
            "id": "ik8zaya",
            "parent_id": "t1_ik8xcrr",
            "score": 26,
            "created_utc": 1660482473.0,
            "replies": [
                {
                    "body": "Yea we did a couple of dates at my place at around date 3 and then again around date 6. Well the allowance wasn’t a lot, like less that half of what other SBs had been asking for, I assumed or really planned to up the amount once things got physical, and honestly I enjoyed her company she was a lot of fun to just hang out with.\n\nBut yea I have made a lot of rookie mistakes I guess since I started this a couple of years ago.",
                    "author": "Glock9prfction",
                    "id": "ik8znhn",
                    "parent_id": "t1_ik8zaya",
                    "score": 7,
                    "created_utc": 1660482665.0,
                    "replies": [
                        {
                            "body": "Did you ever make a move on her when she was at your place?",
                            "author": null,
                            "id": "ik90021",
                            "parent_id": "t1_ik8znhn",
                            "score": 3,
                            "created_utc": 1660482855.0,
                            "replies": [
                                {
                                    "body": "No, i intended to you know, but while we were having dinner or relaxing on my porch she would say something that would make sure that didn’t happen, the first time she just mentioned not being ready (and coming from Vanilla you kind of have it in your head that 3-6 dates is usually when sex would happen), then at date 6 she mentioned being on her period (which may have been true there were some female products left in my bathroom trash, I wasn’t going to investigate to see if they were used). In retrospect I think she knew exactly what she was doing, that is why she faked being sick with Covid, she figured she would get another 2 weeks out of me without having to be pressured or see me. She just got stupid and forgot I was on her Snapchat",
                                    "author": "Glock9prfction",
                                    "id": "ik90hnu",
                                    "parent_id": "t1_ik90021",
                                    "score": 5,
                                    "created_utc": 1660483122.0,
                                    "replies": [
                                        {
                                            "body": "Gotcha. I’ve been there. Lesson learned! You give an inch, they take a mile.",
                                            "author": null,
                                            "id": "ik90rjp",
                                            "parent_id": "t1_ik90hnu",
                                            "score": 2,
                                            "created_utc": 1660483266.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Been there too. Almost exactly the same, pretend COVID and active socials. It’s tough when you really like the girl under the bs.",
            "author": "halmone",
            "id": "ik9dupd",
            "parent_id": "t1_ik8xcrr",
            "score": 3,
            "created_utc": 1660489448.0,
            "replies": []
        },
        {
            "body": "She taught you a very expensive lesson!",
            "author": null,
            "id": "ik9gjwe",
            "parent_id": "t1_ik8xcrr",
            "score": 4,
            "created_utc": 1660490611.0,
            "replies": []
        },
        {
            "body": "I usually have sex with the gal before I establish any kind of allowance with them. Just to make sure there’s some kind of emotional connection. I’m also younger and pretty charming so idk if that factors into this. It’s pretty easy to tell if there’s any kind of mutual attraction on the first date alone.",
            "author": "YoungDorkySD",
            "id": "ik98acy",
            "parent_id": "t1_ik8xcrr",
            "score": -6,
            "created_utc": 1660486966.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ikagim8",
            "parent_id": "t1_ik8yqo9",
            "score": 11,
            "created_utc": 1660505385.0,
            "replies": [
                {
                    "body": "Jeez... The nerve of some people 😂 just makeup anything to avoid confronting people",
                    "author": "Pretend-Musician-912",
                    "id": "ikakg6a",
                    "parent_id": "t1_ikagim8",
                    "score": 4,
                    "created_utc": 1660507029.0,
                    "replies": []
                },
                {
                    "body": "in all fairness it could have been sarcasm. but if not, and he actually thinks you'd believe him - that's a bit much",
                    "author": "davitech73",
                    "id": "ikki4m4",
                    "parent_id": "t1_ikagim8",
                    "score": 1,
                    "created_utc": 1660682724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very much this ^ \n\nBeing “nice” doesn’t mean being taken advantage of and your remark really does sound like you’re starting to wander down the path of self-pity instead of learning from this experience and committing in the future to communicate boundaries and expectations clearly.  This will reduce the risk of being rinsed and increase the chances that you’ll end up with an arrangement you want.  \n\nThis includes stating at some point in the early stages of messaging something along the lines of (assuming this is accurate for you):  “To me, an arrangement is a relationship that involves financial support and companionship, including intimate companionship.  Accordingly, while I’m certainly willing to spend a little time so we can get to know each other better, the arrangement doesn’t begin until we both are comfortable enough for intimacy.”  \n\nI have a longer vetting process than most and make sure POT SBs know what they are getting into.  (I’ll often suggest that they visit this subreddit to learn more).  That way, no one is surprised at or after the M&G.  In my nearly 5 years of having long-term arrangements I’ve had very few misunderstandings.  \n\nWishing you happy (and safe) sugaring.",
            "author": "leyapaul",
            "id": "ik9lsgm",
            "parent_id": "t1_ik8yb71",
            "score": 28,
            "created_utc": 1660492825.0,
            "replies": []
        },
        {
            "body": "That’s very nicely said!",
            "author": "Phagoat",
            "id": "ik9wrfq",
            "parent_id": "t1_ik8yb71",
            "score": 3,
            "created_utc": 1660497306.0,
            "replies": []
        },
        {
            "body": "Nah, eat shit.\n\nShe said that she wanted to take it slowly. The gentlemanly thing to do in that situation is to express your desire, not push the issue, and enjoy our time together. That's precisely what I did, and it got me a SB who walked all over me, got an appointment for her nails immediately after a date, and canceled on me all the time.\n\nFor some people, if you give them an inch they'll take a mile. And that's what happened to me. Calling me an incel for stating that is pretty fucking weird.",
            "author": "DragonflyDry9717",
            "id": "ik90dm9",
            "parent_id": "t1_ik8yb71",
            "score": -30,
            "created_utc": 1660483059.0,
            "replies": [
                {
                    "body": "The guy is harsh but right. Its your boundaries that are missing.\n\nA gentleman expects respect and is clear about it. \n\nYou have confusion about that. No need to be bitter. The guy is trying to do you a favor.",
                    "author": "earthen-monkey",
                    "id": "ik91ntn",
                    "parent_id": "t1_ik90dm9",
                    "score": 50,
                    "created_utc": 1660483738.0,
                    "replies": [
                        {
                            "body": "There’s nothing sexier than a man who’s respectful and considerate but also has strong boundaries. Guys like that don’t argue, pout, or pity themselves when their boundaries are crossed; they just don’t continue to deal with a person or situation that disregards their needs.",
                            "author": "celestialsavage",
                            "id": "ik9301e",
                            "parent_id": "t1_ik91ntn",
                            "score": 36,
                            "created_utc": 1660484430.0,
                            "replies": [
                                {
                                    "body": "Nothing sexier you say? 😙",
                                    "author": "earthen-monkey",
                                    "id": "ik97p8x",
                                    "parent_id": "t1_ik9301e",
                                    "score": 5,
                                    "created_utc": 1660486700.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Nah, eat shit.\n\nYeah, your not a gentleman, lol.\n\n> Calling me an incel\n\nI didn't call you an incel.  Simply comparing it to the situation you see with them complaining about \"nice guys\".  And that it's how you risk coming across.",
                    "author": "SDstartingOut",
                    "id": "ik90pnl",
                    "parent_id": "t1_ik90dm9",
                    "score": 22,
                    "created_utc": 1660483239.0,
                    "replies": [
                        {
                            "body": "Pretty sure OP meant they were a gentleman to the SB, not to the person calling them an incel",
                            "author": "paperclipestate",
                            "id": "ikbsjpw",
                            "parent_id": "t1_ik90pnl",
                            "score": 2,
                            "created_utc": 1660526670.0,
                            "replies": []
                        },
                        {
                            "body": "Telling a guy who calls you an incel to eat shit is about as gentlemanly as it gets 😂",
                            "author": "DragonflyDry9717",
                            "id": "ik91qgg",
                            "parent_id": "t1_ik90pnl",
                            "score": -18,
                            "created_utc": 1660483776.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ok, your replies are not gentlemanly but. .  .\n\nYou did the right thing. This type of dating is “sex work lite,” if you will. She’s absolutely not into you in that way and you handled it correctly.  She wants rewards for showing up for 10 minutes and you’re not getting what you would like.  She already took the money. In sugar dating, this is largely unacceptable. In vanilla, it’s ok not to be on the same page about intimacy at the start.  \n\nProbably a TikTok SB.\n\nI don’t agree with the SD judgements above. You bring up your desires and she finally responds to cancel. She’s obviously not your SB!",
                    "author": "JSBelle",
                    "id": "ik93g4s",
                    "parent_id": "t1_ik90dm9",
                    "score": 9,
                    "created_utc": 1660484658.0,
                    "replies": [
                        {
                            "body": "> You did the right thing\n\nDepends what you mean.  Did he do the right thing from the start of the SR?  No.  Given where he is at today, did he do the right thing?  Absolutely.\n\nThe shit he is getting (at least from me) - is implying that he ended in the situation for being a \"gentlemen\" and respecting her boundaries.  That is incorrect.  He needs his own boundaries.",
                            "author": "SDstartingOut",
                            "id": "ik966zh",
                            "parent_id": "t1_ik93g4s",
                            "score": 8,
                            "created_utc": 1660485980.0,
                            "replies": [
                                {
                                    "body": "I mean in terms of ending it. He’s a grown man and I’m not commenting on his capabilities. Just the situation at hand. She had sex with him, took financial help, and avoided sex thereafter. She clearly did not enjoy sex with him. As a woman, that would be my reason to avoid it.  If I disliked the guy.",
                                    "author": "JSBelle",
                                    "id": "ik972uo",
                                    "parent_id": "t1_ik966zh",
                                    "score": 3,
                                    "created_utc": 1660486403.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm a woman and I agree it's not incel at all... like all catch phrases people overuse them and misuse them. You're not bitter women are not having sex with you because you're nice. You were taken advantage of in a business arrangement and because you were being a gentleman it went on longer than it should have.",
                    "author": "Electronic_Yam5838",
                    "id": "ik9mk7h",
                    "parent_id": "t1_ik90dm9",
                    "score": 2,
                    "created_utc": 1660493143.0,
                    "replies": []
                },
                {
                    "body": "You shouldn't accept a women who is canceling only you constantly. You have to put the boundary of one warning then you're done. You let her get away with a lot comparatively",
                    "author": "NeighborhoodItchy943",
                    "id": "ika3xd4",
                    "parent_id": "t1_ik90dm9",
                    "score": 1,
                    "created_utc": 1660500163.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're mature yet call OP an incel. Ok bud.",
            "author": "NotARussianBot1984",
            "id": "ik9i0ff",
            "parent_id": "t1_ik8yb71",
            "score": -6,
            "created_utc": 1660491244.0,
            "replies": [
                {
                    "body": "OP is an incel though...",
                    "author": "Bamkill",
                    "id": "ik9p2ps",
                    "parent_id": "t1_ik9i0ff",
                    "score": 2,
                    "created_utc": 1660494173.0,
                    "replies": [
                        {
                            "body": "How can a SD be an incel? He did have sex with her. Read first post. \nLol i swear idiots throw incel around without knowing what it stands for.",
                            "author": "NotARussianBot1984",
                            "id": "ik9uc5c",
                            "parent_id": "t1_ik9p2ps",
                            "score": 1,
                            "created_utc": 1660496342.0,
                            "replies": [
                                {
                                    "body": "It's changed to describe men that get bitter and are overly sensitive. Someone with confidence and boundaries will still be hurt in OP's situation, but won't lash out. It's the lashing out in the comments that seems like incel behavior.",
                                    "author": "TravelingSunbunny",
                                    "id": "ik9yo6l",
                                    "parent_id": "t1_ik9uc5c",
                                    "score": 11,
                                    "created_utc": 1660498065.0,
                                    "replies": [
                                        {
                                            "body": "That’s a nice guy not an incel",
                                            "author": "paperclipestate",
                                            "id": "ikbsnzu",
                                            "parent_id": "t1_ik9yo6l",
                                            "score": 2,
                                            "created_utc": 1660526727.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Perfectly stated.",
            "author": "lifting12",
            "id": "ikbzwgi",
            "parent_id": "t1_ik8yb71",
            "score": 1,
            "created_utc": 1660530172.0,
            "replies": []
        },
        {
            "body": "atta boy mac",
            "author": null,
            "id": "ikcc0tm",
            "parent_id": "t1_ikazfz9",
            "score": 2,
            "created_utc": 1660536536.0,
            "replies": []
        },
        {
            "body": "Thanks for your candor. In discussions about sugar dating, I have occasionally called out the hypocrisy of some SBs expecting more from the SDs than they are willing to give in return. They don’t like to hear it  For some reason they are never quite able to specify why their point of view is justified.  Go figure.",
            "author": "Chill_SD1974",
            "id": "ikbncws",
            "parent_id": "t1_ik9jyw1",
            "score": 1,
            "created_utc": 1660524242.0,
            "replies": []
        },
        {
            "body": "Yeah, I think this is what a lot of this sub needs. Very often, I hear the “3 date rule”, and if she doesn’t have intimacy on 2nd or 3rd date, she’s a “rinser”: no matter how good those dates were, no matter if she gave physical affection during those dates, nothing. I don’t mind if the SD abides by this rule and is up front about it- but now I see a lot of SDs that just expect it without communicating their want for intimacy quickly.\n\nMany of the old-fashioned SRs are quite lost on this sub. There isn’t a one size fits all for SRs. As long as you set boundaries on both sides, it will be successful. Of course, you also have to find people that respect each other, which is also hard to find in the bowl haha! The ghosting showed a lack of respect from her side, so ultimately, it is good that they ended things. I’m just not too sure OP’s mindset is good, now that this happened, for a successful SR in the future.",
            "author": "SevvyChan",
            "id": "ik9jktb",
            "parent_id": "t1_ik993k6",
            "score": 10,
            "created_utc": 1660491910.0,
            "replies": [
                {
                    "body": "Oh yeah I get why OP is a bit steamed. Dating is hard and people are annoying.\n\nBut can’t let it molder inside you and become something toxic that colors all your future encounters. Just gotta tell yourself there’s more people out there and better times are around the corner and learn red flags to look out for and move on.",
                    "author": null,
                    "id": "ik9qbua",
                    "parent_id": "t1_ik9jktb",
                    "score": 5,
                    "created_utc": 1660494692.0,
                    "replies": []
                },
                {
                    "body": "For me this is the best part of the Bowl\n\nThere is NO SUCH THING as a \"normal SR\" - the relationship is what is created between the 2 people in the relationship and belongs only to them!\n\nTherefore it is very possible to create whatever you want. \n\nIf you are an SB and you want 5-10 dates before Intimacy?  Go For it - just be clear up front that this is what you will be looking for - and then the SD is free to accept, decline, or make a counter offer (how about 4-6?)  - the point is All Issues can be resolved with Open Communication of what you want!   \n\nMeasure your desires against that of your partner and see what you can come together to create.  Always go for Win/Win - there never needs to be any Win/Lose or Lose/Win",
                    "author": "sd424242",
                    "id": "ikaf2sg",
                    "parent_id": "t1_ik9jktb",
                    "score": 4,
                    "created_utc": 1660504784.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any pressure or coercion is most definitely unacceptable.\n\nCommunication is something that anyone who has seen my comments know I am committed to supporting.  (When in doubt - SAY SOMETHING!) \n\nThe beauty  of the bowl is that it is perfectly acceptable to have very clear, deeply honest and extremely direct communications about what to expect when from **both sides**.  This supports the boundaries that both SD and SB have.  Both sides are respected and no one feels pressured. \n\nIf an SB wants a few more 'platonic dates' then that can be fine if it is being clearly communicated, along with what the SD can do increase the comfort and relaxation of the SB.  \n\nIt should also be a standard expectation that Allowance will not start until the intimacy starts - otherwise this encourages the Rinsers.   They are every bit as vile for SDs as the Pushy obnoxious \"I shouldn't have to pay\" entitled types who pretend to be an SD are for SBs.  \n\nThe problem with BOTH of these nasty creatures is their sense of Entitlement - \"Well I DESERVE THIS\" - whatever it is they think they should have - and comes from a lack of concern for the other person   \n\"What? You expect to be treated like an actual Person? What do you mean you are NOT my Plaything???? - THE NERVE!!\"   \nEntitled people do have a Lot of Nerve - yet accuse the other person of having it. \n\nThis is why any whiff of Entitlement is an Instant Red flag and should be an automatic NEXT for the Responsible SB and SD alike!",
            "author": "sd424242",
            "id": "ikaegrz",
            "parent_id": "t1_ik993k6",
            "score": 3,
            "created_utc": 1660504526.0,
            "replies": []
        },
        {
            "body": "They can all smell an easy bag.",
            "author": null,
            "id": "ik9qzzg",
            "parent_id": "t1_ik93vnn",
            "score": 8,
            "created_utc": 1660494968.0,
            "replies": []
        },
        {
            "body": "Did you not even give her a high five?",
            "author": null,
            "id": "ik9qkk9",
            "parent_id": "t1_ik9917p",
            "score": 13,
            "created_utc": 1660494793.0,
            "replies": []
        },
        {
            "body": "Yeah, to that, I just say, I'm not comfortable providing financial support until there is intimacy.  In other words, that comfort goes both ways.  \n\nEvery time I've said that, to some POT \"SB\" who said she just wants enough dates to be \"comfortable\" with intimacy... they all basically ghost.  Which tends to support my theory that they were all rinsers.  \n\nTo be clear, I always say I am fine with more platonic dates to get to know each other and get more comfortable with each other.  I just also make clear financial support only starts when there is intimacy.  Amazing how fast those types all disappear when I make that clear.",
            "author": "Mainlyharmless",
            "id": "ikacqjo",
            "parent_id": "t1_ik9q7tj",
            "score": 0,
            "created_utc": 1660503810.0,
            "replies": [
                {
                    "body": "Great approach. Turn it back to your comfort level too since you are an equal party in the relationship. And yet you are still thoughtful in regard to her concerns, win win",
                    "author": "Fabulous_Storm2437",
                    "id": "ikb146f",
                    "parent_id": "t1_ikacqjo",
                    "score": 1,
                    "created_utc": 1660514062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can be a gentleman and set boundaries and not be taken advantage of. I always treat any SB I meet with respect, I give them the benefit of the doubt for awhile, but too many cancellations or excuses or weird behaviour or too much entitlement and I’m out. There are just too many good or better options out there.",
            "author": null,
            "id": "ik8wqaq",
            "parent_id": "t1_ik8vmge",
            "score": 15,
            "created_utc": 1660481035.0,
            "replies": []
        },
        {
            "body": "The Mother Theresa quote has me in tears 😂 this subreddit seems like a place she would approve of 💁‍♀️ \n\nOP - I would suggest writing up an agreement outlining the arrangement and your needs and negotiated with future SB’s. Less room for miscommunication. Everyone is happy",
            "author": "LadyDaisyDiablo",
            "id": "ikaolgo",
            "parent_id": "t1_ikafprx",
            "score": 5,
            "created_utc": 1660508757.0,
            "replies": []
        },
        {
            "body": "Yea we did a couple of dates at my place at around date 3 and then again around date 6. Well the allowance wasn’t a lot, like less that half of what other SBs had been asking for, I assumed or really planned to up the amount once things got physical, and honestly I enjoyed her company she was a lot of fun to just hang out with.\n\nBut yea I have made a lot of rookie mistakes I guess since I started this a couple of years ago.",
            "author": "Glock9prfction",
            "id": "ik8znhn",
            "parent_id": "t1_ik8zaya",
            "score": 7,
            "created_utc": 1660482665.0,
            "replies": [
                {
                    "body": "Did you ever make a move on her when she was at your place?",
                    "author": null,
                    "id": "ik90021",
                    "parent_id": "t1_ik8znhn",
                    "score": 3,
                    "created_utc": 1660482855.0,
                    "replies": [
                        {
                            "body": "No, i intended to you know, but while we were having dinner or relaxing on my porch she would say something that would make sure that didn’t happen, the first time she just mentioned not being ready (and coming from Vanilla you kind of have it in your head that 3-6 dates is usually when sex would happen), then at date 6 she mentioned being on her period (which may have been true there were some female products left in my bathroom trash, I wasn’t going to investigate to see if they were used). In retrospect I think she knew exactly what she was doing, that is why she faked being sick with Covid, she figured she would get another 2 weeks out of me without having to be pressured or see me. She just got stupid and forgot I was on her Snapchat",
                            "author": "Glock9prfction",
                            "id": "ik90hnu",
                            "parent_id": "t1_ik90021",
                            "score": 5,
                            "created_utc": 1660483122.0,
                            "replies": [
                                {
                                    "body": "Gotcha. I’ve been there. Lesson learned! You give an inch, they take a mile.",
                                    "author": null,
                                    "id": "ik90rjp",
                                    "parent_id": "t1_ik90hnu",
                                    "score": 2,
                                    "created_utc": 1660483266.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jeez... The nerve of some people 😂 just makeup anything to avoid confronting people",
            "author": "Pretend-Musician-912",
            "id": "ikakg6a",
            "parent_id": "t1_ikagim8",
            "score": 4,
            "created_utc": 1660507029.0,
            "replies": []
        },
        {
            "body": "in all fairness it could have been sarcasm. but if not, and he actually thinks you'd believe him - that's a bit much",
            "author": "davitech73",
            "id": "ikki4m4",
            "parent_id": "t1_ikagim8",
            "score": 1,
            "created_utc": 1660682724.0,
            "replies": []
        },
        {
            "body": "The guy is harsh but right. Its your boundaries that are missing.\n\nA gentleman expects respect and is clear about it. \n\nYou have confusion about that. No need to be bitter. The guy is trying to do you a favor.",
            "author": "earthen-monkey",
            "id": "ik91ntn",
            "parent_id": "t1_ik90dm9",
            "score": 50,
            "created_utc": 1660483738.0,
            "replies": [
                {
                    "body": "There’s nothing sexier than a man who’s respectful and considerate but also has strong boundaries. Guys like that don’t argue, pout, or pity themselves when their boundaries are crossed; they just don’t continue to deal with a person or situation that disregards their needs.",
                    "author": "celestialsavage",
                    "id": "ik9301e",
                    "parent_id": "t1_ik91ntn",
                    "score": 36,
                    "created_utc": 1660484430.0,
                    "replies": [
                        {
                            "body": "Nothing sexier you say? 😙",
                            "author": "earthen-monkey",
                            "id": "ik97p8x",
                            "parent_id": "t1_ik9301e",
                            "score": 5,
                            "created_utc": 1660486700.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Nah, eat shit.\n\nYeah, your not a gentleman, lol.\n\n> Calling me an incel\n\nI didn't call you an incel.  Simply comparing it to the situation you see with them complaining about \"nice guys\".  And that it's how you risk coming across.",
            "author": "SDstartingOut",
            "id": "ik90pnl",
            "parent_id": "t1_ik90dm9",
            "score": 22,
            "created_utc": 1660483239.0,
            "replies": [
                {
                    "body": "Pretty sure OP meant they were a gentleman to the SB, not to the person calling them an incel",
                    "author": "paperclipestate",
                    "id": "ikbsjpw",
                    "parent_id": "t1_ik90pnl",
                    "score": 2,
                    "created_utc": 1660526670.0,
                    "replies": []
                },
                {
                    "body": "Telling a guy who calls you an incel to eat shit is about as gentlemanly as it gets 😂",
                    "author": "DragonflyDry9717",
                    "id": "ik91qgg",
                    "parent_id": "t1_ik90pnl",
                    "score": -18,
                    "created_utc": 1660483776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, your replies are not gentlemanly but. .  .\n\nYou did the right thing. This type of dating is “sex work lite,” if you will. She’s absolutely not into you in that way and you handled it correctly.  She wants rewards for showing up for 10 minutes and you’re not getting what you would like.  She already took the money. In sugar dating, this is largely unacceptable. In vanilla, it’s ok not to be on the same page about intimacy at the start.  \n\nProbably a TikTok SB.\n\nI don’t agree with the SD judgements above. You bring up your desires and she finally responds to cancel. She’s obviously not your SB!",
            "author": "JSBelle",
            "id": "ik93g4s",
            "parent_id": "t1_ik90dm9",
            "score": 9,
            "created_utc": 1660484658.0,
            "replies": [
                {
                    "body": "> You did the right thing\n\nDepends what you mean.  Did he do the right thing from the start of the SR?  No.  Given where he is at today, did he do the right thing?  Absolutely.\n\nThe shit he is getting (at least from me) - is implying that he ended in the situation for being a \"gentlemen\" and respecting her boundaries.  That is incorrect.  He needs his own boundaries.",
                    "author": "SDstartingOut",
                    "id": "ik966zh",
                    "parent_id": "t1_ik93g4s",
                    "score": 8,
                    "created_utc": 1660485980.0,
                    "replies": [
                        {
                            "body": "I mean in terms of ending it. He’s a grown man and I’m not commenting on his capabilities. Just the situation at hand. She had sex with him, took financial help, and avoided sex thereafter. She clearly did not enjoy sex with him. As a woman, that would be my reason to avoid it.  If I disliked the guy.",
                            "author": "JSBelle",
                            "id": "ik972uo",
                            "parent_id": "t1_ik966zh",
                            "score": 3,
                            "created_utc": 1660486403.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a woman and I agree it's not incel at all... like all catch phrases people overuse them and misuse them. You're not bitter women are not having sex with you because you're nice. You were taken advantage of in a business arrangement and because you were being a gentleman it went on longer than it should have.",
            "author": "Electronic_Yam5838",
            "id": "ik9mk7h",
            "parent_id": "t1_ik90dm9",
            "score": 2,
            "created_utc": 1660493143.0,
            "replies": []
        },
        {
            "body": "You shouldn't accept a women who is canceling only you constantly. You have to put the boundary of one warning then you're done. You let her get away with a lot comparatively",
            "author": "NeighborhoodItchy943",
            "id": "ika3xd4",
            "parent_id": "t1_ik90dm9",
            "score": 1,
            "created_utc": 1660500163.0,
            "replies": []
        },
        {
            "body": "OP is an incel though...",
            "author": "Bamkill",
            "id": "ik9p2ps",
            "parent_id": "t1_ik9i0ff",
            "score": 2,
            "created_utc": 1660494173.0,
            "replies": [
                {
                    "body": "How can a SD be an incel? He did have sex with her. Read first post. \nLol i swear idiots throw incel around without knowing what it stands for.",
                    "author": "NotARussianBot1984",
                    "id": "ik9uc5c",
                    "parent_id": "t1_ik9p2ps",
                    "score": 1,
                    "created_utc": 1660496342.0,
                    "replies": [
                        {
                            "body": "It's changed to describe men that get bitter and are overly sensitive. Someone with confidence and boundaries will still be hurt in OP's situation, but won't lash out. It's the lashing out in the comments that seems like incel behavior.",
                            "author": "TravelingSunbunny",
                            "id": "ik9yo6l",
                            "parent_id": "t1_ik9uc5c",
                            "score": 11,
                            "created_utc": 1660498065.0,
                            "replies": [
                                {
                                    "body": "That’s a nice guy not an incel",
                                    "author": "paperclipestate",
                                    "id": "ikbsnzu",
                                    "parent_id": "t1_ik9yo6l",
                                    "score": 2,
                                    "created_utc": 1660526727.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh yeah I get why OP is a bit steamed. Dating is hard and people are annoying.\n\nBut can’t let it molder inside you and become something toxic that colors all your future encounters. Just gotta tell yourself there’s more people out there and better times are around the corner and learn red flags to look out for and move on.",
            "author": null,
            "id": "ik9qbua",
            "parent_id": "t1_ik9jktb",
            "score": 5,
            "created_utc": 1660494692.0,
            "replies": []
        },
        {
            "body": "For me this is the best part of the Bowl\n\nThere is NO SUCH THING as a \"normal SR\" - the relationship is what is created between the 2 people in the relationship and belongs only to them!\n\nTherefore it is very possible to create whatever you want. \n\nIf you are an SB and you want 5-10 dates before Intimacy?  Go For it - just be clear up front that this is what you will be looking for - and then the SD is free to accept, decline, or make a counter offer (how about 4-6?)  - the point is All Issues can be resolved with Open Communication of what you want!   \n\nMeasure your desires against that of your partner and see what you can come together to create.  Always go for Win/Win - there never needs to be any Win/Lose or Lose/Win",
            "author": "sd424242",
            "id": "ikaf2sg",
            "parent_id": "t1_ik9jktb",
            "score": 4,
            "created_utc": 1660504784.0,
            "replies": []
        },
        {
            "body": "Great approach. Turn it back to your comfort level too since you are an equal party in the relationship. And yet you are still thoughtful in regard to her concerns, win win",
            "author": "Fabulous_Storm2437",
            "id": "ikb146f",
            "parent_id": "t1_ikacqjo",
            "score": 1,
            "created_utc": 1660514062.0,
            "replies": []
        },
        {
            "body": "Did you ever make a move on her when she was at your place?",
            "author": null,
            "id": "ik90021",
            "parent_id": "t1_ik8znhn",
            "score": 3,
            "created_utc": 1660482855.0,
            "replies": [
                {
                    "body": "No, i intended to you know, but while we were having dinner or relaxing on my porch she would say something that would make sure that didn’t happen, the first time she just mentioned not being ready (and coming from Vanilla you kind of have it in your head that 3-6 dates is usually when sex would happen), then at date 6 she mentioned being on her period (which may have been true there were some female products left in my bathroom trash, I wasn’t going to investigate to see if they were used). In retrospect I think she knew exactly what she was doing, that is why she faked being sick with Covid, she figured she would get another 2 weeks out of me without having to be pressured or see me. She just got stupid and forgot I was on her Snapchat",
                    "author": "Glock9prfction",
                    "id": "ik90hnu",
                    "parent_id": "t1_ik90021",
                    "score": 5,
                    "created_utc": 1660483122.0,
                    "replies": [
                        {
                            "body": "Gotcha. I’ve been there. Lesson learned! You give an inch, they take a mile.",
                            "author": null,
                            "id": "ik90rjp",
                            "parent_id": "t1_ik90hnu",
                            "score": 2,
                            "created_utc": 1660483266.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s nothing sexier than a man who’s respectful and considerate but also has strong boundaries. Guys like that don’t argue, pout, or pity themselves when their boundaries are crossed; they just don’t continue to deal with a person or situation that disregards their needs.",
            "author": "celestialsavage",
            "id": "ik9301e",
            "parent_id": "t1_ik91ntn",
            "score": 36,
            "created_utc": 1660484430.0,
            "replies": [
                {
                    "body": "Nothing sexier you say? 😙",
                    "author": "earthen-monkey",
                    "id": "ik97p8x",
                    "parent_id": "t1_ik9301e",
                    "score": 5,
                    "created_utc": 1660486700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pretty sure OP meant they were a gentleman to the SB, not to the person calling them an incel",
            "author": "paperclipestate",
            "id": "ikbsjpw",
            "parent_id": "t1_ik90pnl",
            "score": 2,
            "created_utc": 1660526670.0,
            "replies": []
        },
        {
            "body": "Telling a guy who calls you an incel to eat shit is about as gentlemanly as it gets 😂",
            "author": "DragonflyDry9717",
            "id": "ik91qgg",
            "parent_id": "t1_ik90pnl",
            "score": -18,
            "created_utc": 1660483776.0,
            "replies": []
        },
        {
            "body": "> You did the right thing\n\nDepends what you mean.  Did he do the right thing from the start of the SR?  No.  Given where he is at today, did he do the right thing?  Absolutely.\n\nThe shit he is getting (at least from me) - is implying that he ended in the situation for being a \"gentlemen\" and respecting her boundaries.  That is incorrect.  He needs his own boundaries.",
            "author": "SDstartingOut",
            "id": "ik966zh",
            "parent_id": "t1_ik93g4s",
            "score": 8,
            "created_utc": 1660485980.0,
            "replies": [
                {
                    "body": "I mean in terms of ending it. He’s a grown man and I’m not commenting on his capabilities. Just the situation at hand. She had sex with him, took financial help, and avoided sex thereafter. She clearly did not enjoy sex with him. As a woman, that would be my reason to avoid it.  If I disliked the guy.",
                    "author": "JSBelle",
                    "id": "ik972uo",
                    "parent_id": "t1_ik966zh",
                    "score": 3,
                    "created_utc": 1660486403.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How can a SD be an incel? He did have sex with her. Read first post. \nLol i swear idiots throw incel around without knowing what it stands for.",
            "author": "NotARussianBot1984",
            "id": "ik9uc5c",
            "parent_id": "t1_ik9p2ps",
            "score": 1,
            "created_utc": 1660496342.0,
            "replies": [
                {
                    "body": "It's changed to describe men that get bitter and are overly sensitive. Someone with confidence and boundaries will still be hurt in OP's situation, but won't lash out. It's the lashing out in the comments that seems like incel behavior.",
                    "author": "TravelingSunbunny",
                    "id": "ik9yo6l",
                    "parent_id": "t1_ik9uc5c",
                    "score": 11,
                    "created_utc": 1660498065.0,
                    "replies": [
                        {
                            "body": "That’s a nice guy not an incel",
                            "author": "paperclipestate",
                            "id": "ikbsnzu",
                            "parent_id": "t1_ik9yo6l",
                            "score": 2,
                            "created_utc": 1660526727.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, i intended to you know, but while we were having dinner or relaxing on my porch she would say something that would make sure that didn’t happen, the first time she just mentioned not being ready (and coming from Vanilla you kind of have it in your head that 3-6 dates is usually when sex would happen), then at date 6 she mentioned being on her period (which may have been true there were some female products left in my bathroom trash, I wasn’t going to investigate to see if they were used). In retrospect I think she knew exactly what she was doing, that is why she faked being sick with Covid, she figured she would get another 2 weeks out of me without having to be pressured or see me. She just got stupid and forgot I was on her Snapchat",
            "author": "Glock9prfction",
            "id": "ik90hnu",
            "parent_id": "t1_ik90021",
            "score": 5,
            "created_utc": 1660483122.0,
            "replies": [
                {
                    "body": "Gotcha. I’ve been there. Lesson learned! You give an inch, they take a mile.",
                    "author": null,
                    "id": "ik90rjp",
                    "parent_id": "t1_ik90hnu",
                    "score": 2,
                    "created_utc": 1660483266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nothing sexier you say? 😙",
            "author": "earthen-monkey",
            "id": "ik97p8x",
            "parent_id": "t1_ik9301e",
            "score": 5,
            "created_utc": 1660486700.0,
            "replies": []
        },
        {
            "body": "I mean in terms of ending it. He’s a grown man and I’m not commenting on his capabilities. Just the situation at hand. She had sex with him, took financial help, and avoided sex thereafter. She clearly did not enjoy sex with him. As a woman, that would be my reason to avoid it.  If I disliked the guy.",
            "author": "JSBelle",
            "id": "ik972uo",
            "parent_id": "t1_ik966zh",
            "score": 3,
            "created_utc": 1660486403.0,
            "replies": []
        },
        {
            "body": "It's changed to describe men that get bitter and are overly sensitive. Someone with confidence and boundaries will still be hurt in OP's situation, but won't lash out. It's the lashing out in the comments that seems like incel behavior.",
            "author": "TravelingSunbunny",
            "id": "ik9yo6l",
            "parent_id": "t1_ik9uc5c",
            "score": 11,
            "created_utc": 1660498065.0,
            "replies": [
                {
                    "body": "That’s a nice guy not an incel",
                    "author": "paperclipestate",
                    "id": "ikbsnzu",
                    "parent_id": "t1_ik9yo6l",
                    "score": 2,
                    "created_utc": 1660526727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gotcha. I’ve been there. Lesson learned! You give an inch, they take a mile.",
            "author": null,
            "id": "ik90rjp",
            "parent_id": "t1_ik90hnu",
            "score": 2,
            "created_utc": 1660483266.0,
            "replies": []
        },
        {
            "body": "That’s a nice guy not an incel",
            "author": "paperclipestate",
            "id": "ikbsnzu",
            "parent_id": "t1_ik9yo6l",
            "score": 2,
            "created_utc": 1660526727.0,
            "replies": []
        }
    ]
}