{
    "title": "Saved my dogs life.",
    "post_id": "dhqq2d",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/dhqq2d/saved_my_dogs_life/",
    "author": "Gremlin_baby",
    "body": "Through a online, platonic thing that I accidentally fell into. I know, I know, neither of those things exist, whatever. \n\nHe does exist though, and it's kind of wild. We've formed a very strange special little friendship that isn't sexual in nature, through a dating app, off of which I told him I'm a sugar baby. He told me he isn't a sugar daddy however, and doesn't plan to be. But, since then we talk most days, I talk to him about a lot of his dating problems while he's jet setting around the place and he has taken a massive interest in my art, bought several pieces, and given me larger transfers to \"sponsor\" my supplies or enable me to be able to print more. This week he got my eyes tested. \n\nSo, tonight I was in maccas complaining to him between mouthfuls of hot cake (endearing, I know) about the very very shitty POT date I went on tonight, when I got a secondary call from my flatmates who were babysitting my dog during said date, to say that my dog had eaten a Toblerone. Yup. Like a full one. A full giant ass dark chocolate toblerone. \n\nAll jets are go, I'm running red lights to get home to get her to the emergency vet, crying like a lunatic, poor noodle was so confused but loves the car so was pleased with her midnight outing, until we got there. \nNot so great once we got there, everything was looking pretty grim and the vets kept not telling me whether she was going to pull through. They kept quoting me more and more, but like, I've got $17 in my bank account until payday but I kept telling them to do whatever to make it work. \n\nBefore any of y'all are like \"its just a dog\", it's not. It's my goofy goober of a alien horse, I'm an introverted artist and I spend every minute of my day with her. I mean she goes to galleries and showing and art markets and music performance and bars, she's in training currently to be able to put me in recovery when I have seizures so I don't die. She's a superdog, and the light of my fucking life. \n\nSo, this guy was on the phone to me when I first learnt and naturally he had offered to pay. Eventually, I said yes. $900, morphine, induced vomiting, 3 lots of charcoal, 1.5 litres of IV and a couple nights in hospital, and shes gonna live. \n\nThis is why I love the bowl. It's not straight up and down, it's frustrating and never hands me what I expect, but god damn a sugar stranger saved the light of my life tonight. \nY'all, sometimes SB emergencies actually exist.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/dhqq2d/saved_my_dogs_life/",
    "score": 108,
    "upvote_ratio": 0.91,
    "created_utc": 1571060491.0,
    "num_comments": 48,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I'm very glad the alien-horse pulled through. That guy has a good heart, I hope you treat him well",
            "author": "roscoe7585",
            "id": "f3pms98",
            "parent_id": "t3_dhqq2d",
            "score": 50,
            "created_utc": 1571061714.0,
            "replies": [
                {
                    "body": "I try!",
                    "author": "Gremlin_baby",
                    "id": "f3ptk2x",
                    "parent_id": "t1_f3pms98",
                    "score": 9,
                    "created_utc": 1571064797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl, I’m so glad everything was okay for your pup! \n\nI’m dead serious when I say that my #1 motivator for trying out sugaring is so I can get pet insurance and have enough saved that I’ll be ok if I have to pay any emergency vet bills because I stress about that alllll the time",
            "author": "RoseGlow96",
            "id": "f3pzl5k",
            "parent_id": "t3_dhqq2d",
            "score": 21,
            "created_utc": 1571067393.0,
            "replies": [
                {
                    "body": "YES. THIS. \n\nHuman health insurance in NZ isn't even a regular thing but after my childhood \"12k rescue\" I wasn't going to risk it. \nHowever, between SDs and before deciding on a plan this happens... Really puts the fire under my ass. If my friend didn't exist I would've been trying to sell my kidney on the street in front of the vets.",
                    "author": "Gremlin_baby",
                    "id": "f3qh0l0",
                    "parent_id": "t1_f3pzl5k",
                    "score": 7,
                    "created_utc": 1571074559.0,
                    "replies": [
                        {
                            "body": "Maybe you need a SD that's a kiwi vet. *cough, cough*",
                            "author": "hg2120",
                            "id": "f3sztyr",
                            "parent_id": "t1_f3qh0l0",
                            "score": 3,
                            "created_utc": 1571113669.0,
                            "replies": [
                                {
                                    "body": "Veryyyyyy smooth there.... But you're not wrong",
                                    "author": "Gremlin_baby",
                                    "id": "f3t0xl4",
                                    "parent_id": "t1_f3sztyr",
                                    "score": 1,
                                    "created_utc": 1571114652.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Best SB motivation I've heard thus far - vet bills are expensive, yo!",
                    "author": "roscoe7585",
                    "id": "f3sq2g3",
                    "parent_id": "t1_f3pzl5k",
                    "score": 1,
                    "created_utc": 1571106889.0,
                    "replies": [
                        {
                            "body": "Preach 🙌🏻",
                            "author": "RoseGlow96",
                            "id": "f3sqxf1",
                            "parent_id": "t1_f3sq2g3",
                            "score": 1,
                            "created_utc": 1571107408.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sooooo glad your dog is ok!!! I'm also an introverted (extroverted hybrid) with a dog I can't live without. I did just want to note though that we don't reaaallllyyy need to worry too much when our dogs eat chocolate. Of course a whole Toblerone bar is quite a bit, but the dangerous chemicals is the theobromine, which is found in PURE chocolate but is pretty low in most commercial chocolate bars.\n\nPeople tend to think that ANY kind of chocolate in any form will kill your dogs - not true! theobromine and caffeine affect the central nervous system and can cause your dog's heart rate to increase and potentially lead to death but fairly unlikely from any standard americanized/commercial chocolate bar (unless the dog weighs like 3 lbs and ate a whole bar of pure dark chocolate). But chocolate in general is not very dangerous. Of course, a vet isn't necessarily going to tell you not to worry because they will gladly take your money. Here's a calculator to determine if you need to worry:  [http://www.anycalculator.com/dogtoxicitycalculator.html](http://www.anycalculator.com/dogtoxicitycalculator.html)\n\nRegardless, my giant dog-mom heart is so happy to hear your little alien babe is ok!",
            "author": null,
            "id": "f3q5nx2",
            "parent_id": "t3_dhqq2d",
            "score": 11,
            "created_utc": 1571069990.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3pskp0",
            "parent_id": "t3_dhqq2d",
            "score": 20,
            "created_utc": 1571064356.0,
            "replies": [
                {
                    "body": "> Those \"it's just a dog\" people have a special flaming seat waiting for them in hell.\n\nCould not agree more. \n\nI make it very clear I appreciate the company of animals over most people. The thing is, you ALWAYS know where the Hell you stand with an animal. Humans? Meh. Not so much.",
                    "author": "SDRippington",
                    "id": "f3pt59y",
                    "parent_id": "t1_f3pskp0",
                    "score": 16,
                    "created_utc": 1571064612.0,
                    "replies": [
                        {
                            "body": "when i'm walking my dogs, I regularly come in contact with my neighbors who have dogs.  I'll avoid eye contact or talking directly to my neighbors but be gooshing with love over the dog. LOL and I don't even know my neighbors names, but you'd be damned if I didn't know their dogs names!",
                            "author": null,
                            "id": "f3q61fj",
                            "parent_id": "t1_f3pt59y",
                            "score": 6,
                            "created_utc": 1571070135.0,
                            "replies": [
                                {
                                    "body": "You. I like you.\n\n:-)",
                                    "author": "SDRippington",
                                    "id": "f3q6590",
                                    "parent_id": "t1_f3q61fj",
                                    "score": 3,
                                    "created_utc": 1571070178.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't trust anyone who doesn't treat their dogs like family!",
                    "author": null,
                    "id": "f3q5u6q",
                    "parent_id": "t1_f3pskp0",
                    "score": 8,
                    "created_utc": 1571070057.0,
                    "replies": [
                        {
                            "body": "People in general who \"aren't really dog people\" are massive red flags in my book. Who doesn't love the personification of joy rolled up in a warm fluffy slobbery bundle.",
                            "author": "Gremlin_baby",
                            "id": "f3qhbzk",
                            "parent_id": "t1_f3q5u6q",
                            "score": 7,
                            "created_utc": 1571074715.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Gosh darn like I know chocolate and HDMI cords both look tasty, but still. \nI'm so sorry to hear about your buddy, and also your marriage. It's big the impression those fuzzy happy bastards can make on us.",
                    "author": "Gremlin_baby",
                    "id": "f3ptzlg",
                    "parent_id": "t1_f3pskp0",
                    "score": 4,
                    "created_utc": 1571064988.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f3q3wdw",
                            "parent_id": "t1_f3ptzlg",
                            "score": 6,
                            "created_utc": 1571069269.0,
                            "replies": [
                                {
                                    "body": "That's a really beautiful way of looking at separation, for both of those relationships. I hope to have as much grace as you when the time comes for me.",
                                    "author": "Gremlin_baby",
                                    "id": "f3qh77h",
                                    "parent_id": "t1_f3q3wdw",
                                    "score": 4,
                                    "created_utc": 1571074649.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3sqp85",
                    "parent_id": "t1_f3pskp0",
                    "score": 2,
                    "created_utc": 1571107265.0,
                    "replies": []
                },
                {
                    "body": "Dogs are better than humans and I’m sure yours was a great one. I’m so sorry for your loss :(",
                    "author": "soullessfreckles",
                    "id": "f3pujx7",
                    "parent_id": "t1_f3pskp0",
                    "score": 3,
                    "created_utc": 1571065222.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f3puoj3",
                            "parent_id": "t1_f3pujx7",
                            "score": 5,
                            "created_utc": 1571065277.0,
                            "replies": [
                                {
                                    "body": "I totally get it. I still miss my dog Wheaties every day. And he passed 6 years ago. I have a cat now. It’s not the same.....even a little bit 😒",
                                    "author": "soullessfreckles",
                                    "id": "f3pvheq",
                                    "parent_id": "t1_f3puoj3",
                                    "score": 5,
                                    "created_utc": 1571065614.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f3pvxl2",
                                            "parent_id": "t1_f3pvheq",
                                            "score": 1,
                                            "created_utc": 1571065811.0,
                                            "replies": [
                                                {
                                                    "body": "Nah. My cat is great as far as cats go as well. It’s great having an animal I can leave for a day or two. But it sucks having an animal that doesn’t care if I leave for a day or two lol.",
                                                    "author": "soullessfreckles",
                                                    "id": "f3pz91e",
                                                    "parent_id": "t1_f3pvxl2",
                                                    "score": 2,
                                                    "created_utc": 1571067249.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "f3pzfws",
                                                            "parent_id": "t1_f3pz91e",
                                                            "score": 6,
                                                            "created_utc": 1571067331.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ha! He’ll suddenly love you in a few months.",
                                                                    "author": "soullessfreckles",
                                                                    "id": "f3tp2sa",
                                                                    "parent_id": "t1_f3pzfws",
                                                                    "score": 1,
                                                                    "created_utc": 1571142233.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He sounds like an amazing person, hoping he gets as much as hes giving out emotion wise cause it sounds like he cares a lot.",
            "author": null,
            "id": "f3pp4y4",
            "parent_id": "t3_dhqq2d",
            "score": 5,
            "created_utc": 1571062771.0,
            "replies": [
                {
                    "body": "Honestly I do my best to but I'm not entirely sure what he wants. He says he just enjoys my virtual company and my outlook on this weird practical joke of a universe we're all living in, so that's what I give him.",
                    "author": "Gremlin_baby",
                    "id": "f3pts45",
                    "parent_id": "t1_f3pp4y4",
                    "score": 3,
                    "created_utc": 1571064900.0,
                    "replies": [
                        {
                            "body": "the internet has afforded us the opportunity to make friends who don't know everything about us. I have a couple friends like this, one in sweden who I speak to pretty regularly. we tell each other our secrets, the things we worry about but can't tell our friends because then our friends will have follow up questions. There's something incredibly relaxing about having a friend you can confide in, who is there when you need them, but doesn't ask for too much in return. Just friendship. Not going to nag you or anything and can keep your secrets because who am I gonna tell???  \n\n\nI've had a handful of these friendships since I started using the internet, and I can truly say that they were appreciated with every ounce of my heart.",
                            "author": null,
                            "id": "f3q6bf7",
                            "parent_id": "t1_f3pts45",
                            "score": 5,
                            "created_utc": 1571070249.0,
                            "replies": []
                        },
                        {
                            "body": "Have you offered to meet him in person ? I mean i understand he is not a sugar daddy but it seems to me you 2 have great chemistry and he would be worth considering vanilla. Seems like a guy who could take care of you probably better than a sd but will need a less structured format than sb/sd if anything you already a few ppm ahead nothing wasted in giving it a shot? See where it goes?\n\nSorry if i come across as naive",
                            "author": "Ttimewellspent",
                            "id": "f3sizku",
                            "parent_id": "t1_f3pts45",
                            "score": 1,
                            "created_utc": 1571103613.0,
                            "replies": [
                                {
                                    "body": "Not at all! It doesn't. I have offered a few times. I also offered to come nurse for him after his recent eye surgery. \nHe's not often in the same city as me as his work has him on the road a whole lot so it's usually about that I guess?",
                                    "author": "Gremlin_baby",
                                    "id": "f3sjbyc",
                                    "parent_id": "t1_f3sizku",
                                    "score": 1,
                                    "created_utc": 1571103772.0,
                                    "replies": []
                                },
                                {
                                    "body": "OMG I forgot I also offered to drive a 7 hour round trip at 1am the other day to come save him from an awful position he accidentally put himself in.",
                                    "author": "Gremlin_baby",
                                    "id": "f3sjfm4",
                                    "parent_id": "t1_f3sizku",
                                    "score": 1,
                                    "created_utc": 1571103822.0,
                                    "replies": [
                                        {
                                            "body": "Wow well time will tell if yoi two manage to work it out",
                                            "author": "Ttimewellspent",
                                            "id": "f3slxva",
                                            "parent_id": "t1_f3sjfm4",
                                            "score": 1,
                                            "created_utc": 1571104960.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am very glad your little gal is ok! Sorry to hear all of that happened! Sounds great!\n\nI know how important she is to you. I am glad your friend helped\n Fuck those people that say its just a dog. I would give  last cent and do anything i could for my 2 love mutts!",
            "author": "BigBearSD",
            "id": "f3pzisv",
            "parent_id": "t3_dhqq2d",
            "score": 3,
            "created_utc": 1571067365.0,
            "replies": [
                {
                    "body": "Omg I know you would! I know how much you love them too... You totally understand that world shattering would do anything for them kind of moment",
                    "author": "Gremlin_baby",
                    "id": "f3qi8el",
                    "parent_id": "t1_f3pzisv",
                    "score": 1,
                    "created_utc": 1571075146.0,
                    "replies": [
                        {
                            "body": "Hahaha yep! You see how much I post about my dogs on social media. Would give me kidney if needed somehow for them.",
                            "author": "BigBearSD",
                            "id": "f3rudmw",
                            "parent_id": "t1_f3qi8el",
                            "score": 1,
                            "created_utc": 1571092013.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They definitely do.  I kind of had someone/something like this. It wasn't an official arrangement and I don't think he'd identify as a SD, but he helped out when it really mattered sometimes.  Kind of miss the relationship because it wasn't all about the cash.  There was a connection, also sucked it had to end so abruptly",
            "author": "KiKiPAWG",
            "id": "f3rlxoz",
            "parent_id": "t3_dhqq2d",
            "score": 3,
            "created_utc": 1571089320.0,
            "replies": []
        },
        {
            "body": "That’s kind of him,  there are times when money doesn’t matter.  One of my SB’s had a boxer that had walked in a planting bed that had been strayed with round up then licked his feet.  \nIt was awful.",
            "author": "LotBuilder",
            "id": "f3q3i52",
            "parent_id": "t3_dhqq2d",
            "score": 2,
            "created_utc": 1571069106.0,
            "replies": [
                {
                    "body": "Thank you so much for the Willie Brown story, gave me a good laugh, (the hot boxing and picnic raiding, not the accidental flower box poisoning). \n\nI have a real special spot for boxers in my heart, grew up with one that was the same age as me from when I was a toddler. Also the smallest fartiest old dude. \nIdk if this is a worldwide thing, but in NZ our beaches have this habit of killing people with our currents, so you swim between these flags to stay safe. One time in the height of summer our boxer trotter over and laid a huge deuce right between the flags while staring everyone down, everyone was really upset and the lifeguard blew the whistle at us, but it still gives me a laugh.",
                    "author": "Gremlin_baby",
                    "id": "f3qi4vl",
                    "parent_id": "t1_f3q3i52",
                    "score": 2,
                    "created_utc": 1571075100.0,
                    "replies": [
                        {
                            "body": "“Staring everyone down”.    When Willie visited my house he would shit on the same lawn every single walk.  Of course it was that one house on the block with the old retired guy that was always outside.  The first time he did it I bagged as much of that vile soft old dog poop as I could and put the bag in his trash (that was out and uncollected).  He was pissed but I resemble a Sopranos character so he bit hits tongue.  Every walk after that he stared the guy down and pooped.   The guy started running his sprinklers and Willie was unfazed,   He would walk in the sprinklers and dump in the same spot.  Only now I am not going into the sprinklers to bag it.  “You played yourself crusty old man” - said in my version of what I though Willie would sound like if he could talk.",
                            "author": "LotBuilder",
                            "id": "f3qmgrz",
                            "parent_id": "t1_f3qi4vl",
                            "score": 5,
                            "created_utc": 1571077171.0,
                            "replies": [
                                {
                                    "body": "AAAAAAAAH WILLIE YES. Willie is my new true hero, what a dude.",
                                    "author": "Gremlin_baby",
                                    "id": "f3qqh87",
                                    "parent_id": "t1_f3qmgrz",
                                    "score": 1,
                                    "created_utc": 1571079111.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "oh god no!!!!",
                    "author": null,
                    "id": "f3q6f7v",
                    "parent_id": "t1_f3q3i52",
                    "score": 1,
                    "created_utc": 1571070294.0,
                    "replies": [
                        {
                            "body": "He survived.  Then he got some eye issues that cost me like $300/mo for 2 years.  He was the stinkiest most love-able old guy.  We still laugh about a road trip we took to the beach.  90 minute drive each way and we couldn’t talk because he would hot box us with the worst old dog farts ever so we had to keep the windows down.   We finally get to the beach and he catches a rare burst of energy and steals a sandwich from a couple trying to have a romantic picnic.  RIP Willie Brown,  the $10,000 rescue dog.",
                            "author": "LotBuilder",
                            "id": "f3q7j17",
                            "parent_id": "t1_f3q6f7v",
                            "score": 6,
                            "created_utc": 1571070782.0,
                            "replies": [
                                {
                                    "body": "oh good. and yeah my old dog had to get special medicated eye drops and my mom always complained about the cost. We need dog insurance, like real, legit dog insurance, but we can't even get human insurance right so I have low expectations. I looked into dog insurance where I live, and it was all super expensive then barely covered routine exams.",
                                    "author": null,
                                    "id": "f3q7xc0",
                                    "parent_id": "t1_f3q7j17",
                                    "score": 2,
                                    "created_utc": 1571070951.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh wow! So happy your dog gets to live another day 😘",
            "author": "curiousalways95",
            "id": "f3r0jr0",
            "parent_id": "t3_dhqq2d",
            "score": 1,
            "created_utc": 1571083157.0,
            "replies": []
        },
        {
            "body": "The feel good story of the day! Happy for you!",
            "author": "captainIsBack4u",
            "id": "f3rdfpb",
            "parent_id": "t3_dhqq2d",
            "score": 1,
            "created_utc": 1571086937.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3qvend",
            "parent_id": "t3_dhqq2d",
            "score": 1,
            "created_utc": 1571081428.0,
            "replies": [
                {
                    "body": "I study full time, work two jobs, and care for a sick parent. I earn $300 a week and my rent is half of that. You're a butt.",
                    "author": "Gremlin_baby",
                    "id": "f3qx1rv",
                    "parent_id": "t1_f3qvend",
                    "score": 3,
                    "created_utc": 1571082159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The idea that chocolate is deadlyto dogs is stupid. My dog has eaten so much chocolate without a single issue. It's very, very rare for chocolate to actually give a dog problems but the vets are of course more than happy to take your money to do these drastic \"emergency\" treatments.\n\nA Toblerone would be nowhere near enough to kill your dog. \n\nhttps://www.scientificamerican.com/article/fact-or-fiction-chocolate-is-poisonous-to-dogs/",
            "author": "Seven_league_boots",
            "id": "f3pt7p6",
            "parent_id": "t3_dhqq2d",
            "score": -2,
            "created_utc": 1571064640.0,
            "replies": [
                {
                    "body": "Sir, it literally says in your article that less than 4 ou of milk chocolate could kill a small dog, and that dark chocolate holds 6x as much than that (of which I said she ate).",
                    "author": "Gremlin_baby",
                    "id": "f3pw0in",
                    "parent_id": "t1_f3pt7p6",
                    "score": 8,
                    "created_utc": 1571065845.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3ptn8l",
                    "parent_id": "t1_f3pt7p6",
                    "score": 5,
                    "created_utc": 1571064836.0,
                    "replies": [
                        {
                            "body": "not just the amount of chocolate but what KIND of chocolate. Milk chocolate has less theobromine than dark bakers chocolate. unless a dog weighs less than 5lbs, we don't have to worry about it eating any of the chocolate that comes off the shelves at a gas station in america because those bars just don't have much caffeine or theobromine.",
                            "author": null,
                            "id": "f3q6mkg",
                            "parent_id": "t1_f3ptn8l",
                            "score": 3,
                            "created_utc": 1571070380.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ahhhh yes, but A) she's a breed that's known for their sensitivity to basically everything, and B) it was a TRAVEL TOBLERONE sized bar of dark chocolate. You're welcome to google those toxicity results yourself. \nSome dogs are built like brick shit houses. My past dog jumped off the back of my ute into an oncoming car, yelped and ran home, was fine. Some, not so much.",
                    "author": "Gremlin_baby",
                    "id": "f3puc0a",
                    "parent_id": "t1_f3pt7p6",
                    "score": 3,
                    "created_utc": 1571065130.0,
                    "replies": [
                        {
                            "body": "a travel sized toblerone? Because then you definitely wouldn't need to worry! And a sensitive stomach is not the same thing as their metabolism. Lots of dogs have sensitive stomachs and can eat stuff that upset their stomachs but not come even close to killing them. two completely separate concerns.  \n\n\nThe problem with chocolate is how the theobromine and caffeine is metabolised, so having a sensitive stomach wouldn't make a difference in the threat.   \n\n\nEither way, i have a dog, so i understand your fears! I think we are all just trying to help calm your worries so you don't have to spend another 900 when the dog likely wasn't in fatal danger to begin with.",
                            "author": null,
                            "id": "f3q725w",
                            "parent_id": "t1_f3puc0a",
                            "score": 1,
                            "created_utc": 1571070569.0,
                            "replies": [
                                {
                                    "body": "Exactly. That was 900 dollars straight down drain.",
                                    "author": "Seven_league_boots",
                                    "id": "f3qfowi",
                                    "parent_id": "t1_f3q725w",
                                    "score": 2,
                                    "created_utc": 1571074011.0,
                                    "replies": [
                                        {
                                            "body": "It was half a KG of 80% cocoa. I know y'all are trying to be helpful, but it doesn't really seem like the take away point of this thread eh? \nYou're welcome to keep arguing it, but I'm glad I did what I could for someone I care about more than anything.",
                                            "author": "Gremlin_baby",
                                            "id": "f3qqeee",
                                            "parent_id": "t1_f3qfowi",
                                            "score": 3,
                                            "created_utc": 1571079074.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I try!",
            "author": "Gremlin_baby",
            "id": "f3ptk2x",
            "parent_id": "t1_f3pms98",
            "score": 9,
            "created_utc": 1571064797.0,
            "replies": []
        },
        {
            "body": "YES. THIS. \n\nHuman health insurance in NZ isn't even a regular thing but after my childhood \"12k rescue\" I wasn't going to risk it. \nHowever, between SDs and before deciding on a plan this happens... Really puts the fire under my ass. If my friend didn't exist I would've been trying to sell my kidney on the street in front of the vets.",
            "author": "Gremlin_baby",
            "id": "f3qh0l0",
            "parent_id": "t1_f3pzl5k",
            "score": 7,
            "created_utc": 1571074559.0,
            "replies": [
                {
                    "body": "Maybe you need a SD that's a kiwi vet. *cough, cough*",
                    "author": "hg2120",
                    "id": "f3sztyr",
                    "parent_id": "t1_f3qh0l0",
                    "score": 3,
                    "created_utc": 1571113669.0,
                    "replies": [
                        {
                            "body": "Veryyyyyy smooth there.... But you're not wrong",
                            "author": "Gremlin_baby",
                            "id": "f3t0xl4",
                            "parent_id": "t1_f3sztyr",
                            "score": 1,
                            "created_utc": 1571114652.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best SB motivation I've heard thus far - vet bills are expensive, yo!",
            "author": "roscoe7585",
            "id": "f3sq2g3",
            "parent_id": "t1_f3pzl5k",
            "score": 1,
            "created_utc": 1571106889.0,
            "replies": [
                {
                    "body": "Preach 🙌🏻",
                    "author": "RoseGlow96",
                    "id": "f3sqxf1",
                    "parent_id": "t1_f3sq2g3",
                    "score": 1,
                    "created_utc": 1571107408.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Those \"it's just a dog\" people have a special flaming seat waiting for them in hell.\n\nCould not agree more. \n\nI make it very clear I appreciate the company of animals over most people. The thing is, you ALWAYS know where the Hell you stand with an animal. Humans? Meh. Not so much.",
            "author": "SDRippington",
            "id": "f3pt59y",
            "parent_id": "t1_f3pskp0",
            "score": 16,
            "created_utc": 1571064612.0,
            "replies": [
                {
                    "body": "when i'm walking my dogs, I regularly come in contact with my neighbors who have dogs.  I'll avoid eye contact or talking directly to my neighbors but be gooshing with love over the dog. LOL and I don't even know my neighbors names, but you'd be damned if I didn't know their dogs names!",
                    "author": null,
                    "id": "f3q61fj",
                    "parent_id": "t1_f3pt59y",
                    "score": 6,
                    "created_utc": 1571070135.0,
                    "replies": [
                        {
                            "body": "You. I like you.\n\n:-)",
                            "author": "SDRippington",
                            "id": "f3q6590",
                            "parent_id": "t1_f3q61fj",
                            "score": 3,
                            "created_utc": 1571070178.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't trust anyone who doesn't treat their dogs like family!",
            "author": null,
            "id": "f3q5u6q",
            "parent_id": "t1_f3pskp0",
            "score": 8,
            "created_utc": 1571070057.0,
            "replies": [
                {
                    "body": "People in general who \"aren't really dog people\" are massive red flags in my book. Who doesn't love the personification of joy rolled up in a warm fluffy slobbery bundle.",
                    "author": "Gremlin_baby",
                    "id": "f3qhbzk",
                    "parent_id": "t1_f3q5u6q",
                    "score": 7,
                    "created_utc": 1571074715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gosh darn like I know chocolate and HDMI cords both look tasty, but still. \nI'm so sorry to hear about your buddy, and also your marriage. It's big the impression those fuzzy happy bastards can make on us.",
            "author": "Gremlin_baby",
            "id": "f3ptzlg",
            "parent_id": "t1_f3pskp0",
            "score": 4,
            "created_utc": 1571064988.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3q3wdw",
                    "parent_id": "t1_f3ptzlg",
                    "score": 6,
                    "created_utc": 1571069269.0,
                    "replies": [
                        {
                            "body": "That's a really beautiful way of looking at separation, for both of those relationships. I hope to have as much grace as you when the time comes for me.",
                            "author": "Gremlin_baby",
                            "id": "f3qh77h",
                            "parent_id": "t1_f3q3wdw",
                            "score": 4,
                            "created_utc": 1571074649.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3sqp85",
            "parent_id": "t1_f3pskp0",
            "score": 2,
            "created_utc": 1571107265.0,
            "replies": []
        },
        {
            "body": "Dogs are better than humans and I’m sure yours was a great one. I’m so sorry for your loss :(",
            "author": "soullessfreckles",
            "id": "f3pujx7",
            "parent_id": "t1_f3pskp0",
            "score": 3,
            "created_utc": 1571065222.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3puoj3",
                    "parent_id": "t1_f3pujx7",
                    "score": 5,
                    "created_utc": 1571065277.0,
                    "replies": [
                        {
                            "body": "I totally get it. I still miss my dog Wheaties every day. And he passed 6 years ago. I have a cat now. It’s not the same.....even a little bit 😒",
                            "author": "soullessfreckles",
                            "id": "f3pvheq",
                            "parent_id": "t1_f3puoj3",
                            "score": 5,
                            "created_utc": 1571065614.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f3pvxl2",
                                    "parent_id": "t1_f3pvheq",
                                    "score": 1,
                                    "created_utc": 1571065811.0,
                                    "replies": [
                                        {
                                            "body": "Nah. My cat is great as far as cats go as well. It’s great having an animal I can leave for a day or two. But it sucks having an animal that doesn’t care if I leave for a day or two lol.",
                                            "author": "soullessfreckles",
                                            "id": "f3pz91e",
                                            "parent_id": "t1_f3pvxl2",
                                            "score": 2,
                                            "created_utc": 1571067249.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f3pzfws",
                                                    "parent_id": "t1_f3pz91e",
                                                    "score": 6,
                                                    "created_utc": 1571067331.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ha! He’ll suddenly love you in a few months.",
                                                            "author": "soullessfreckles",
                                                            "id": "f3tp2sa",
                                                            "parent_id": "t1_f3pzfws",
                                                            "score": 1,
                                                            "created_utc": 1571142233.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly I do my best to but I'm not entirely sure what he wants. He says he just enjoys my virtual company and my outlook on this weird practical joke of a universe we're all living in, so that's what I give him.",
            "author": "Gremlin_baby",
            "id": "f3pts45",
            "parent_id": "t1_f3pp4y4",
            "score": 3,
            "created_utc": 1571064900.0,
            "replies": [
                {
                    "body": "the internet has afforded us the opportunity to make friends who don't know everything about us. I have a couple friends like this, one in sweden who I speak to pretty regularly. we tell each other our secrets, the things we worry about but can't tell our friends because then our friends will have follow up questions. There's something incredibly relaxing about having a friend you can confide in, who is there when you need them, but doesn't ask for too much in return. Just friendship. Not going to nag you or anything and can keep your secrets because who am I gonna tell???  \n\n\nI've had a handful of these friendships since I started using the internet, and I can truly say that they were appreciated with every ounce of my heart.",
                    "author": null,
                    "id": "f3q6bf7",
                    "parent_id": "t1_f3pts45",
                    "score": 5,
                    "created_utc": 1571070249.0,
                    "replies": []
                },
                {
                    "body": "Have you offered to meet him in person ? I mean i understand he is not a sugar daddy but it seems to me you 2 have great chemistry and he would be worth considering vanilla. Seems like a guy who could take care of you probably better than a sd but will need a less structured format than sb/sd if anything you already a few ppm ahead nothing wasted in giving it a shot? See where it goes?\n\nSorry if i come across as naive",
                    "author": "Ttimewellspent",
                    "id": "f3sizku",
                    "parent_id": "t1_f3pts45",
                    "score": 1,
                    "created_utc": 1571103613.0,
                    "replies": [
                        {
                            "body": "Not at all! It doesn't. I have offered a few times. I also offered to come nurse for him after his recent eye surgery. \nHe's not often in the same city as me as his work has him on the road a whole lot so it's usually about that I guess?",
                            "author": "Gremlin_baby",
                            "id": "f3sjbyc",
                            "parent_id": "t1_f3sizku",
                            "score": 1,
                            "created_utc": 1571103772.0,
                            "replies": []
                        },
                        {
                            "body": "OMG I forgot I also offered to drive a 7 hour round trip at 1am the other day to come save him from an awful position he accidentally put himself in.",
                            "author": "Gremlin_baby",
                            "id": "f3sjfm4",
                            "parent_id": "t1_f3sizku",
                            "score": 1,
                            "created_utc": 1571103822.0,
                            "replies": [
                                {
                                    "body": "Wow well time will tell if yoi two manage to work it out",
                                    "author": "Ttimewellspent",
                                    "id": "f3slxva",
                                    "parent_id": "t1_f3sjfm4",
                                    "score": 1,
                                    "created_utc": 1571104960.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg I know you would! I know how much you love them too... You totally understand that world shattering would do anything for them kind of moment",
            "author": "Gremlin_baby",
            "id": "f3qi8el",
            "parent_id": "t1_f3pzisv",
            "score": 1,
            "created_utc": 1571075146.0,
            "replies": [
                {
                    "body": "Hahaha yep! You see how much I post about my dogs on social media. Would give me kidney if needed somehow for them.",
                    "author": "BigBearSD",
                    "id": "f3rudmw",
                    "parent_id": "t1_f3qi8el",
                    "score": 1,
                    "created_utc": 1571092013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much for the Willie Brown story, gave me a good laugh, (the hot boxing and picnic raiding, not the accidental flower box poisoning). \n\nI have a real special spot for boxers in my heart, grew up with one that was the same age as me from when I was a toddler. Also the smallest fartiest old dude. \nIdk if this is a worldwide thing, but in NZ our beaches have this habit of killing people with our currents, so you swim between these flags to stay safe. One time in the height of summer our boxer trotter over and laid a huge deuce right between the flags while staring everyone down, everyone was really upset and the lifeguard blew the whistle at us, but it still gives me a laugh.",
            "author": "Gremlin_baby",
            "id": "f3qi4vl",
            "parent_id": "t1_f3q3i52",
            "score": 2,
            "created_utc": 1571075100.0,
            "replies": [
                {
                    "body": "“Staring everyone down”.    When Willie visited my house he would shit on the same lawn every single walk.  Of course it was that one house on the block with the old retired guy that was always outside.  The first time he did it I bagged as much of that vile soft old dog poop as I could and put the bag in his trash (that was out and uncollected).  He was pissed but I resemble a Sopranos character so he bit hits tongue.  Every walk after that he stared the guy down and pooped.   The guy started running his sprinklers and Willie was unfazed,   He would walk in the sprinklers and dump in the same spot.  Only now I am not going into the sprinklers to bag it.  “You played yourself crusty old man” - said in my version of what I though Willie would sound like if he could talk.",
                    "author": "LotBuilder",
                    "id": "f3qmgrz",
                    "parent_id": "t1_f3qi4vl",
                    "score": 5,
                    "created_utc": 1571077171.0,
                    "replies": [
                        {
                            "body": "AAAAAAAAH WILLIE YES. Willie is my new true hero, what a dude.",
                            "author": "Gremlin_baby",
                            "id": "f3qqh87",
                            "parent_id": "t1_f3qmgrz",
                            "score": 1,
                            "created_utc": 1571079111.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "oh god no!!!!",
            "author": null,
            "id": "f3q6f7v",
            "parent_id": "t1_f3q3i52",
            "score": 1,
            "created_utc": 1571070294.0,
            "replies": [
                {
                    "body": "He survived.  Then he got some eye issues that cost me like $300/mo for 2 years.  He was the stinkiest most love-able old guy.  We still laugh about a road trip we took to the beach.  90 minute drive each way and we couldn’t talk because he would hot box us with the worst old dog farts ever so we had to keep the windows down.   We finally get to the beach and he catches a rare burst of energy and steals a sandwich from a couple trying to have a romantic picnic.  RIP Willie Brown,  the $10,000 rescue dog.",
                    "author": "LotBuilder",
                    "id": "f3q7j17",
                    "parent_id": "t1_f3q6f7v",
                    "score": 6,
                    "created_utc": 1571070782.0,
                    "replies": [
                        {
                            "body": "oh good. and yeah my old dog had to get special medicated eye drops and my mom always complained about the cost. We need dog insurance, like real, legit dog insurance, but we can't even get human insurance right so I have low expectations. I looked into dog insurance where I live, and it was all super expensive then barely covered routine exams.",
                            "author": null,
                            "id": "f3q7xc0",
                            "parent_id": "t1_f3q7j17",
                            "score": 2,
                            "created_utc": 1571070951.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I study full time, work two jobs, and care for a sick parent. I earn $300 a week and my rent is half of that. You're a butt.",
            "author": "Gremlin_baby",
            "id": "f3qx1rv",
            "parent_id": "t1_f3qvend",
            "score": 3,
            "created_utc": 1571082159.0,
            "replies": []
        },
        {
            "body": "Sir, it literally says in your article that less than 4 ou of milk chocolate could kill a small dog, and that dark chocolate holds 6x as much than that (of which I said she ate).",
            "author": "Gremlin_baby",
            "id": "f3pw0in",
            "parent_id": "t1_f3pt7p6",
            "score": 8,
            "created_utc": 1571065845.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3ptn8l",
            "parent_id": "t1_f3pt7p6",
            "score": 5,
            "created_utc": 1571064836.0,
            "replies": [
                {
                    "body": "not just the amount of chocolate but what KIND of chocolate. Milk chocolate has less theobromine than dark bakers chocolate. unless a dog weighs less than 5lbs, we don't have to worry about it eating any of the chocolate that comes off the shelves at a gas station in america because those bars just don't have much caffeine or theobromine.",
                    "author": null,
                    "id": "f3q6mkg",
                    "parent_id": "t1_f3ptn8l",
                    "score": 3,
                    "created_utc": 1571070380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahhhh yes, but A) she's a breed that's known for their sensitivity to basically everything, and B) it was a TRAVEL TOBLERONE sized bar of dark chocolate. You're welcome to google those toxicity results yourself. \nSome dogs are built like brick shit houses. My past dog jumped off the back of my ute into an oncoming car, yelped and ran home, was fine. Some, not so much.",
            "author": "Gremlin_baby",
            "id": "f3puc0a",
            "parent_id": "t1_f3pt7p6",
            "score": 3,
            "created_utc": 1571065130.0,
            "replies": [
                {
                    "body": "a travel sized toblerone? Because then you definitely wouldn't need to worry! And a sensitive stomach is not the same thing as their metabolism. Lots of dogs have sensitive stomachs and can eat stuff that upset their stomachs but not come even close to killing them. two completely separate concerns.  \n\n\nThe problem with chocolate is how the theobromine and caffeine is metabolised, so having a sensitive stomach wouldn't make a difference in the threat.   \n\n\nEither way, i have a dog, so i understand your fears! I think we are all just trying to help calm your worries so you don't have to spend another 900 when the dog likely wasn't in fatal danger to begin with.",
                    "author": null,
                    "id": "f3q725w",
                    "parent_id": "t1_f3puc0a",
                    "score": 1,
                    "created_utc": 1571070569.0,
                    "replies": [
                        {
                            "body": "Exactly. That was 900 dollars straight down drain.",
                            "author": "Seven_league_boots",
                            "id": "f3qfowi",
                            "parent_id": "t1_f3q725w",
                            "score": 2,
                            "created_utc": 1571074011.0,
                            "replies": [
                                {
                                    "body": "It was half a KG of 80% cocoa. I know y'all are trying to be helpful, but it doesn't really seem like the take away point of this thread eh? \nYou're welcome to keep arguing it, but I'm glad I did what I could for someone I care about more than anything.",
                                    "author": "Gremlin_baby",
                                    "id": "f3qqeee",
                                    "parent_id": "t1_f3qfowi",
                                    "score": 3,
                                    "created_utc": 1571079074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe you need a SD that's a kiwi vet. *cough, cough*",
            "author": "hg2120",
            "id": "f3sztyr",
            "parent_id": "t1_f3qh0l0",
            "score": 3,
            "created_utc": 1571113669.0,
            "replies": [
                {
                    "body": "Veryyyyyy smooth there.... But you're not wrong",
                    "author": "Gremlin_baby",
                    "id": "f3t0xl4",
                    "parent_id": "t1_f3sztyr",
                    "score": 1,
                    "created_utc": 1571114652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Preach 🙌🏻",
            "author": "RoseGlow96",
            "id": "f3sqxf1",
            "parent_id": "t1_f3sq2g3",
            "score": 1,
            "created_utc": 1571107408.0,
            "replies": []
        },
        {
            "body": "when i'm walking my dogs, I regularly come in contact with my neighbors who have dogs.  I'll avoid eye contact or talking directly to my neighbors but be gooshing with love over the dog. LOL and I don't even know my neighbors names, but you'd be damned if I didn't know their dogs names!",
            "author": null,
            "id": "f3q61fj",
            "parent_id": "t1_f3pt59y",
            "score": 6,
            "created_utc": 1571070135.0,
            "replies": [
                {
                    "body": "You. I like you.\n\n:-)",
                    "author": "SDRippington",
                    "id": "f3q6590",
                    "parent_id": "t1_f3q61fj",
                    "score": 3,
                    "created_utc": 1571070178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People in general who \"aren't really dog people\" are massive red flags in my book. Who doesn't love the personification of joy rolled up in a warm fluffy slobbery bundle.",
            "author": "Gremlin_baby",
            "id": "f3qhbzk",
            "parent_id": "t1_f3q5u6q",
            "score": 7,
            "created_utc": 1571074715.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3q3wdw",
            "parent_id": "t1_f3ptzlg",
            "score": 6,
            "created_utc": 1571069269.0,
            "replies": [
                {
                    "body": "That's a really beautiful way of looking at separation, for both of those relationships. I hope to have as much grace as you when the time comes for me.",
                    "author": "Gremlin_baby",
                    "id": "f3qh77h",
                    "parent_id": "t1_f3q3wdw",
                    "score": 4,
                    "created_utc": 1571074649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3puoj3",
            "parent_id": "t1_f3pujx7",
            "score": 5,
            "created_utc": 1571065277.0,
            "replies": [
                {
                    "body": "I totally get it. I still miss my dog Wheaties every day. And he passed 6 years ago. I have a cat now. It’s not the same.....even a little bit 😒",
                    "author": "soullessfreckles",
                    "id": "f3pvheq",
                    "parent_id": "t1_f3puoj3",
                    "score": 5,
                    "created_utc": 1571065614.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f3pvxl2",
                            "parent_id": "t1_f3pvheq",
                            "score": 1,
                            "created_utc": 1571065811.0,
                            "replies": [
                                {
                                    "body": "Nah. My cat is great as far as cats go as well. It’s great having an animal I can leave for a day or two. But it sucks having an animal that doesn’t care if I leave for a day or two lol.",
                                    "author": "soullessfreckles",
                                    "id": "f3pz91e",
                                    "parent_id": "t1_f3pvxl2",
                                    "score": 2,
                                    "created_utc": 1571067249.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f3pzfws",
                                            "parent_id": "t1_f3pz91e",
                                            "score": 6,
                                            "created_utc": 1571067331.0,
                                            "replies": [
                                                {
                                                    "body": "Ha! He’ll suddenly love you in a few months.",
                                                    "author": "soullessfreckles",
                                                    "id": "f3tp2sa",
                                                    "parent_id": "t1_f3pzfws",
                                                    "score": 1,
                                                    "created_utc": 1571142233.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "the internet has afforded us the opportunity to make friends who don't know everything about us. I have a couple friends like this, one in sweden who I speak to pretty regularly. we tell each other our secrets, the things we worry about but can't tell our friends because then our friends will have follow up questions. There's something incredibly relaxing about having a friend you can confide in, who is there when you need them, but doesn't ask for too much in return. Just friendship. Not going to nag you or anything and can keep your secrets because who am I gonna tell???  \n\n\nI've had a handful of these friendships since I started using the internet, and I can truly say that they were appreciated with every ounce of my heart.",
            "author": null,
            "id": "f3q6bf7",
            "parent_id": "t1_f3pts45",
            "score": 5,
            "created_utc": 1571070249.0,
            "replies": []
        },
        {
            "body": "Have you offered to meet him in person ? I mean i understand he is not a sugar daddy but it seems to me you 2 have great chemistry and he would be worth considering vanilla. Seems like a guy who could take care of you probably better than a sd but will need a less structured format than sb/sd if anything you already a few ppm ahead nothing wasted in giving it a shot? See where it goes?\n\nSorry if i come across as naive",
            "author": "Ttimewellspent",
            "id": "f3sizku",
            "parent_id": "t1_f3pts45",
            "score": 1,
            "created_utc": 1571103613.0,
            "replies": [
                {
                    "body": "Not at all! It doesn't. I have offered a few times. I also offered to come nurse for him after his recent eye surgery. \nHe's not often in the same city as me as his work has him on the road a whole lot so it's usually about that I guess?",
                    "author": "Gremlin_baby",
                    "id": "f3sjbyc",
                    "parent_id": "t1_f3sizku",
                    "score": 1,
                    "created_utc": 1571103772.0,
                    "replies": []
                },
                {
                    "body": "OMG I forgot I also offered to drive a 7 hour round trip at 1am the other day to come save him from an awful position he accidentally put himself in.",
                    "author": "Gremlin_baby",
                    "id": "f3sjfm4",
                    "parent_id": "t1_f3sizku",
                    "score": 1,
                    "created_utc": 1571103822.0,
                    "replies": [
                        {
                            "body": "Wow well time will tell if yoi two manage to work it out",
                            "author": "Ttimewellspent",
                            "id": "f3slxva",
                            "parent_id": "t1_f3sjfm4",
                            "score": 1,
                            "created_utc": 1571104960.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hahaha yep! You see how much I post about my dogs on social media. Would give me kidney if needed somehow for them.",
            "author": "BigBearSD",
            "id": "f3rudmw",
            "parent_id": "t1_f3qi8el",
            "score": 1,
            "created_utc": 1571092013.0,
            "replies": []
        },
        {
            "body": "“Staring everyone down”.    When Willie visited my house he would shit on the same lawn every single walk.  Of course it was that one house on the block with the old retired guy that was always outside.  The first time he did it I bagged as much of that vile soft old dog poop as I could and put the bag in his trash (that was out and uncollected).  He was pissed but I resemble a Sopranos character so he bit hits tongue.  Every walk after that he stared the guy down and pooped.   The guy started running his sprinklers and Willie was unfazed,   He would walk in the sprinklers and dump in the same spot.  Only now I am not going into the sprinklers to bag it.  “You played yourself crusty old man” - said in my version of what I though Willie would sound like if he could talk.",
            "author": "LotBuilder",
            "id": "f3qmgrz",
            "parent_id": "t1_f3qi4vl",
            "score": 5,
            "created_utc": 1571077171.0,
            "replies": [
                {
                    "body": "AAAAAAAAH WILLIE YES. Willie is my new true hero, what a dude.",
                    "author": "Gremlin_baby",
                    "id": "f3qqh87",
                    "parent_id": "t1_f3qmgrz",
                    "score": 1,
                    "created_utc": 1571079111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He survived.  Then he got some eye issues that cost me like $300/mo for 2 years.  He was the stinkiest most love-able old guy.  We still laugh about a road trip we took to the beach.  90 minute drive each way and we couldn’t talk because he would hot box us with the worst old dog farts ever so we had to keep the windows down.   We finally get to the beach and he catches a rare burst of energy and steals a sandwich from a couple trying to have a romantic picnic.  RIP Willie Brown,  the $10,000 rescue dog.",
            "author": "LotBuilder",
            "id": "f3q7j17",
            "parent_id": "t1_f3q6f7v",
            "score": 6,
            "created_utc": 1571070782.0,
            "replies": [
                {
                    "body": "oh good. and yeah my old dog had to get special medicated eye drops and my mom always complained about the cost. We need dog insurance, like real, legit dog insurance, but we can't even get human insurance right so I have low expectations. I looked into dog insurance where I live, and it was all super expensive then barely covered routine exams.",
                    "author": null,
                    "id": "f3q7xc0",
                    "parent_id": "t1_f3q7j17",
                    "score": 2,
                    "created_utc": 1571070951.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "not just the amount of chocolate but what KIND of chocolate. Milk chocolate has less theobromine than dark bakers chocolate. unless a dog weighs less than 5lbs, we don't have to worry about it eating any of the chocolate that comes off the shelves at a gas station in america because those bars just don't have much caffeine or theobromine.",
            "author": null,
            "id": "f3q6mkg",
            "parent_id": "t1_f3ptn8l",
            "score": 3,
            "created_utc": 1571070380.0,
            "replies": []
        },
        {
            "body": "a travel sized toblerone? Because then you definitely wouldn't need to worry! And a sensitive stomach is not the same thing as their metabolism. Lots of dogs have sensitive stomachs and can eat stuff that upset their stomachs but not come even close to killing them. two completely separate concerns.  \n\n\nThe problem with chocolate is how the theobromine and caffeine is metabolised, so having a sensitive stomach wouldn't make a difference in the threat.   \n\n\nEither way, i have a dog, so i understand your fears! I think we are all just trying to help calm your worries so you don't have to spend another 900 when the dog likely wasn't in fatal danger to begin with.",
            "author": null,
            "id": "f3q725w",
            "parent_id": "t1_f3puc0a",
            "score": 1,
            "created_utc": 1571070569.0,
            "replies": [
                {
                    "body": "Exactly. That was 900 dollars straight down drain.",
                    "author": "Seven_league_boots",
                    "id": "f3qfowi",
                    "parent_id": "t1_f3q725w",
                    "score": 2,
                    "created_utc": 1571074011.0,
                    "replies": [
                        {
                            "body": "It was half a KG of 80% cocoa. I know y'all are trying to be helpful, but it doesn't really seem like the take away point of this thread eh? \nYou're welcome to keep arguing it, but I'm glad I did what I could for someone I care about more than anything.",
                            "author": "Gremlin_baby",
                            "id": "f3qqeee",
                            "parent_id": "t1_f3qfowi",
                            "score": 3,
                            "created_utc": 1571079074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Veryyyyyy smooth there.... But you're not wrong",
            "author": "Gremlin_baby",
            "id": "f3t0xl4",
            "parent_id": "t1_f3sztyr",
            "score": 1,
            "created_utc": 1571114652.0,
            "replies": []
        },
        {
            "body": "You. I like you.\n\n:-)",
            "author": "SDRippington",
            "id": "f3q6590",
            "parent_id": "t1_f3q61fj",
            "score": 3,
            "created_utc": 1571070178.0,
            "replies": []
        },
        {
            "body": "That's a really beautiful way of looking at separation, for both of those relationships. I hope to have as much grace as you when the time comes for me.",
            "author": "Gremlin_baby",
            "id": "f3qh77h",
            "parent_id": "t1_f3q3wdw",
            "score": 4,
            "created_utc": 1571074649.0,
            "replies": []
        },
        {
            "body": "I totally get it. I still miss my dog Wheaties every day. And he passed 6 years ago. I have a cat now. It’s not the same.....even a little bit 😒",
            "author": "soullessfreckles",
            "id": "f3pvheq",
            "parent_id": "t1_f3puoj3",
            "score": 5,
            "created_utc": 1571065614.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3pvxl2",
                    "parent_id": "t1_f3pvheq",
                    "score": 1,
                    "created_utc": 1571065811.0,
                    "replies": [
                        {
                            "body": "Nah. My cat is great as far as cats go as well. It’s great having an animal I can leave for a day or two. But it sucks having an animal that doesn’t care if I leave for a day or two lol.",
                            "author": "soullessfreckles",
                            "id": "f3pz91e",
                            "parent_id": "t1_f3pvxl2",
                            "score": 2,
                            "created_utc": 1571067249.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f3pzfws",
                                    "parent_id": "t1_f3pz91e",
                                    "score": 6,
                                    "created_utc": 1571067331.0,
                                    "replies": [
                                        {
                                            "body": "Ha! He’ll suddenly love you in a few months.",
                                            "author": "soullessfreckles",
                                            "id": "f3tp2sa",
                                            "parent_id": "t1_f3pzfws",
                                            "score": 1,
                                            "created_utc": 1571142233.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not at all! It doesn't. I have offered a few times. I also offered to come nurse for him after his recent eye surgery. \nHe's not often in the same city as me as his work has him on the road a whole lot so it's usually about that I guess?",
            "author": "Gremlin_baby",
            "id": "f3sjbyc",
            "parent_id": "t1_f3sizku",
            "score": 1,
            "created_utc": 1571103772.0,
            "replies": []
        },
        {
            "body": "OMG I forgot I also offered to drive a 7 hour round trip at 1am the other day to come save him from an awful position he accidentally put himself in.",
            "author": "Gremlin_baby",
            "id": "f3sjfm4",
            "parent_id": "t1_f3sizku",
            "score": 1,
            "created_utc": 1571103822.0,
            "replies": [
                {
                    "body": "Wow well time will tell if yoi two manage to work it out",
                    "author": "Ttimewellspent",
                    "id": "f3slxva",
                    "parent_id": "t1_f3sjfm4",
                    "score": 1,
                    "created_utc": 1571104960.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "AAAAAAAAH WILLIE YES. Willie is my new true hero, what a dude.",
            "author": "Gremlin_baby",
            "id": "f3qqh87",
            "parent_id": "t1_f3qmgrz",
            "score": 1,
            "created_utc": 1571079111.0,
            "replies": []
        },
        {
            "body": "oh good. and yeah my old dog had to get special medicated eye drops and my mom always complained about the cost. We need dog insurance, like real, legit dog insurance, but we can't even get human insurance right so I have low expectations. I looked into dog insurance where I live, and it was all super expensive then barely covered routine exams.",
            "author": null,
            "id": "f3q7xc0",
            "parent_id": "t1_f3q7j17",
            "score": 2,
            "created_utc": 1571070951.0,
            "replies": []
        },
        {
            "body": "Exactly. That was 900 dollars straight down drain.",
            "author": "Seven_league_boots",
            "id": "f3qfowi",
            "parent_id": "t1_f3q725w",
            "score": 2,
            "created_utc": 1571074011.0,
            "replies": [
                {
                    "body": "It was half a KG of 80% cocoa. I know y'all are trying to be helpful, but it doesn't really seem like the take away point of this thread eh? \nYou're welcome to keep arguing it, but I'm glad I did what I could for someone I care about more than anything.",
                    "author": "Gremlin_baby",
                    "id": "f3qqeee",
                    "parent_id": "t1_f3qfowi",
                    "score": 3,
                    "created_utc": 1571079074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3pvxl2",
            "parent_id": "t1_f3pvheq",
            "score": 1,
            "created_utc": 1571065811.0,
            "replies": [
                {
                    "body": "Nah. My cat is great as far as cats go as well. It’s great having an animal I can leave for a day or two. But it sucks having an animal that doesn’t care if I leave for a day or two lol.",
                    "author": "soullessfreckles",
                    "id": "f3pz91e",
                    "parent_id": "t1_f3pvxl2",
                    "score": 2,
                    "created_utc": 1571067249.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f3pzfws",
                            "parent_id": "t1_f3pz91e",
                            "score": 6,
                            "created_utc": 1571067331.0,
                            "replies": [
                                {
                                    "body": "Ha! He’ll suddenly love you in a few months.",
                                    "author": "soullessfreckles",
                                    "id": "f3tp2sa",
                                    "parent_id": "t1_f3pzfws",
                                    "score": 1,
                                    "created_utc": 1571142233.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow well time will tell if yoi two manage to work it out",
            "author": "Ttimewellspent",
            "id": "f3slxva",
            "parent_id": "t1_f3sjfm4",
            "score": 1,
            "created_utc": 1571104960.0,
            "replies": []
        },
        {
            "body": "It was half a KG of 80% cocoa. I know y'all are trying to be helpful, but it doesn't really seem like the take away point of this thread eh? \nYou're welcome to keep arguing it, but I'm glad I did what I could for someone I care about more than anything.",
            "author": "Gremlin_baby",
            "id": "f3qqeee",
            "parent_id": "t1_f3qfowi",
            "score": 3,
            "created_utc": 1571079074.0,
            "replies": []
        },
        {
            "body": "Nah. My cat is great as far as cats go as well. It’s great having an animal I can leave for a day or two. But it sucks having an animal that doesn’t care if I leave for a day or two lol.",
            "author": "soullessfreckles",
            "id": "f3pz91e",
            "parent_id": "t1_f3pvxl2",
            "score": 2,
            "created_utc": 1571067249.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3pzfws",
                    "parent_id": "t1_f3pz91e",
                    "score": 6,
                    "created_utc": 1571067331.0,
                    "replies": [
                        {
                            "body": "Ha! He’ll suddenly love you in a few months.",
                            "author": "soullessfreckles",
                            "id": "f3tp2sa",
                            "parent_id": "t1_f3pzfws",
                            "score": 1,
                            "created_utc": 1571142233.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3pzfws",
            "parent_id": "t1_f3pz91e",
            "score": 6,
            "created_utc": 1571067331.0,
            "replies": [
                {
                    "body": "Ha! He’ll suddenly love you in a few months.",
                    "author": "soullessfreckles",
                    "id": "f3tp2sa",
                    "parent_id": "t1_f3pzfws",
                    "score": 1,
                    "created_utc": 1571142233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ha! He’ll suddenly love you in a few months.",
            "author": "soullessfreckles",
            "id": "f3tp2sa",
            "parent_id": "t1_f3pzfws",
            "score": 1,
            "created_utc": 1571142233.0,
            "replies": []
        }
    ]
}