{
    "title": "How do I avoid my hair from becoming a charcoal mop at the end of the day?",
    "post_id": "l3zere",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/l3zere/how_do_i_avoid_my_hair_from_becoming_a_charcoal/",
    "author": "optimists_unite",
    "body": "",
    "url": "https://i.imgur.com/hDFmEWG.jpg",
    "score": 348,
    "upvote_ratio": 0.99,
    "created_utc": 1611494811.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You could try growing it out a bit to help weigh it down.",
            "author": "FBI_Bear",
            "id": "gklq6st",
            "parent_id": "t3_l3zere",
            "score": 39,
            "created_utc": 1611507736.0,
            "replies": [
                {
                    "body": "Yep! that’s what I’m planning to do after years of school haircut rules (private school things) so I can’t wait hahah",
                    "author": "optimists_unite",
                    "id": "gkmzu06",
                    "parent_id": "t1_gklq6st",
                    "score": 10,
                    "created_utc": 1611525218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "**Trust me, this will work**... First get a proper haircut, i recommend getting a buzz on the sides and getting a trim on the top.\n**Do not** use water pomade or gel or moose on your hair (It will continue giving you that mop look) \n\nIf you want more of a natural finish with style I highly recommend sticking with Clay, Styling Cream or Wax hair products. They will give you a low shine with a matte finish and it will leave your hair looking good and healthy (It's what you're looking for)\n\nI shower, blow dry my hair on low and wait for a mild-damp feel and I use Paul Mitch Reformer Texturizing Hair Putty. **The key:** using less is more, start with just a little bit and continue applying until you get the style you're looking for!\n\n**Note:** There are so many products out there, but start with Mitch Reformer. Avoid Wax if you can, it will dry your scalp, and no one will be able to play with your hair :) I hope this helps, would love to get a DM on your finish look!",
            "author": "Catdroidpart2",
            "id": "gkm5cfr",
            "parent_id": "t3_l3zere",
            "score": 153,
            "created_utc": 1611511813.0,
            "replies": [
                {
                    "body": "Do you think a Matt clay with medium finish is good enough to get a part-curtain style? I’ve been styling my hair as a combover for years (straight thick hair) and thought a curtain would fit?\n\nI have a very low widows peak, barely noticeable but it leaves a dangle of hair in the middle, thoughts on that? I usually salt spray and clay it in the combover shape. \n\nGrew out my hair quite long, don’t want it to go to waste ya know? Any advice is really appreciated. It’s just you sound like a pro on this!",
                    "author": "ButterStick212",
                    "id": "gkmi459",
                    "parent_id": "t1_gkm5cfr",
                    "score": 10,
                    "created_utc": 1611516692.0,
                    "replies": [
                        {
                            "body": ">  Mitch Reformer\n\nHaha believe me I'm no pro, but I've tried one too many dozen products over the years and sure i'd be happy to be give ya some advice.\n\nDo you a photo of what your hair looks like now and wish it could look it?",
                            "author": "Catdroidpart2",
                            "id": "gkmlp1i",
                            "parent_id": "t1_gkmi459",
                            "score": 4,
                            "created_utc": 1611518514.0,
                            "replies": [
                                {
                                    "body": "I’ll take a couple photos and post them on this sub for advice in a couple days. School for me is right around the corner and I need a cut really BAD. It’s a jungle up there honestly.",
                                    "author": "ButterStick212",
                                    "id": "gkmokxy",
                                    "parent_id": "t1_gkmlp1i",
                                    "score": 4,
                                    "created_utc": 1611519982.0,
                                    "replies": [
                                        {
                                            "body": "Thanks!",
                                            "author": "optimists_unite",
                                            "id": "gknn9qw",
                                            "parent_id": "t1_gkmokxy",
                                            "score": 3,
                                            "created_utc": 1611536196.0,
                                            "replies": [
                                                {
                                                    "body": "Wait no I meant advice for me lol, my hair isn’t as straight as yours but it’s a damn mess, I need serious help..",
                                                    "author": "ButterStick212",
                                                    "id": "gknt4hd",
                                                    "parent_id": "t1_gknn9qw",
                                                    "score": 2,
                                                    "created_utc": 1611539175.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">\tI highly recommend … Wax hair products\n\n>\tAvoid Wax if you can\n\nSorry can you elaborate haha",
                    "author": "optimists_unite",
                    "id": "gknnhkf",
                    "parent_id": "t1_gkm5cfr",
                    "score": 5,
                    "created_utc": 1611536308.0,
                    "replies": [
                        {
                            "body": "It's an option to throw in with the rest of the similar products, but it comes with damage. It's like choosing Charizard, he's strong and has high HP but deals ALOT of damage from the rest of the pokemon",
                            "author": "Catdroidpart2",
                            "id": "gknolrl",
                            "parent_id": "t1_gknnhkf",
                            "score": 6,
                            "created_utc": 1611536874.0,
                            "replies": []
                        },
                        {
                            "body": "I believe he was recommending wax as an implied last resort.",
                            "author": "digitalAlchemist413",
                            "id": "gknor33",
                            "parent_id": "t1_gknnhkf",
                            "score": 6,
                            "created_utc": 1611536950.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I use pomade specifically because it prevents the frizzy fluff up.",
                    "author": "salgat",
                    "id": "gknwlh2",
                    "parent_id": "t1_gkm5cfr",
                    "score": 3,
                    "created_utc": 1611540957.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone here is mentioning products and shit but honestly, are you using conditioner? Blow dryer? Looks kinda frizzy to me.",
            "author": null,
            "id": "gkmeoyp",
            "parent_id": "t3_l3zere",
            "score": 41,
            "created_utc": 1611514922.0,
            "replies": [
                {
                    "body": "Surprised to see only one answer talking about this and everyone else recommending product.  My hair, when it’s shorter like this, has a pretty similar texture to it from shampooing.  OP, I’m guessing you use shampoo during every shower so I would look into co-washing.  Shampooing makes my hair poof into a ball like that and makes it feel very dry, so I only do it 1-2 times a week and use a little bit of conditioner every shower.  Find a conditioner that works well for you, give your hair a couple weeks to adjust and balance it’s oils out, and you should see much less frizz and be able to move your hair how you want it  little bit more without necessarily adding product.",
                    "author": "Roemax",
                    "id": "gkmnpwk",
                    "parent_id": "t1_gkmeoyp",
                    "score": 11,
                    "created_utc": 1611519564.0,
                    "replies": [
                        {
                            "body": "Yeah I’d suggest a haircut and some conditioner before anything else here. I do wash my hair daily but I have a super fine, soft hair texture and use conditioner roughly 3x a week + moisturizing shampoo on days where I don’t unless things get really greasy. Looking at OP’s hair, I’d guess that they could ease up on washing. \n\nAnother thing to consider is how aggressive you’re being with a towel + comb. I usually pat my hair dry and try to be gentle with a towel. Some folks recommend a t shirt or something softer. Definitely don’t aggressively scrub at your head with a towel because that’ll fuck things up too.",
                            "author": null,
                            "id": "gkmt2zd",
                            "parent_id": "t1_gkmnpwk",
                            "score": 5,
                            "created_utc": 1611522154.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah I’ve only started doing all this about two weeks ago, so I guess I have to wait\n\nThanks!",
                            "author": "optimists_unite",
                            "id": "gkn0etd",
                            "parent_id": "t1_gkmnpwk",
                            "score": 1,
                            "created_utc": 1611525493.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I've never blow-dried my hair. How does it change the game compared to drying it with a towel or a letting it dry naturally?\n\nEdit: typo",
                    "author": "noobvorld",
                    "id": "gkmg7xi",
                    "parent_id": "t1_gkmeoyp",
                    "score": 7,
                    "created_utc": 1611515686.0,
                    "replies": [
                        {
                            "body": "The heat damages the hair itself (it's made of protein, and protein doesn't like heat).",
                            "author": "ImmovableGonzalez",
                            "id": "gkmk0qq",
                            "parent_id": "t1_gkmg7xi",
                            "score": 10,
                            "created_utc": 1611517656.0,
                            "replies": [
                                {
                                    "body": "So it's better to *not* blowdry?",
                                    "author": "noobvorld",
                                    "id": "gkmk5y1",
                                    "parent_id": "t1_gkmk0qq",
                                    "score": 7,
                                    "created_utc": 1611517733.0,
                                    "replies": [
                                        {
                                            "body": "It’s better not to blow dry all the time, and when you do to not use too much heat directly on the hair",
                                            "author": "Hmm_would_bang",
                                            "id": "gkmm6ds",
                                            "parent_id": "t1_gkmk5y1",
                                            "score": 6,
                                            "created_utc": 1611518768.0,
                                            "replies": [
                                                {
                                                    "body": "This is incorrect (sort of). Here's a paper on the topic:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/)  \n\n\n>Conclusion  \n>  \n>Although using a hair dryer causes more surface damage than natural drying, using a hair dryer at a distance of 15 cm with continuous motion causes less damage than drying hair naturally.",
                                                    "author": "The_Wisest_of_Fools",
                                                    "id": "gkmyt3c",
                                                    "parent_id": "t1_gkmm6ds",
                                                    "score": 4,
                                                    "created_utc": 1611524780.0,
                                                    "replies": [
                                                        {
                                                            "body": "15 cm is 5.91 inches",
                                                            "author": "converter-bot",
                                                            "id": "gkmyufr",
                                                            "parent_id": "t1_gkmyt3c",
                                                            "score": 2,
                                                            "created_utc": 1611524795.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
                                                            "author": "Hmm_would_bang",
                                                            "id": "gkn12ew",
                                                            "parent_id": "t1_gkmyt3c",
                                                            "score": 1,
                                                            "created_utc": 1611525803.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                                                                    "author": "noobvorld",
                                                                    "id": "gknjs63",
                                                                    "parent_id": "t1_gkn12ew",
                                                                    "score": 7,
                                                                    "created_utc": 1611534466.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "also to add to this if you blow dry with hot air , i recommend using a heat protectant sprays.It makes a difference and your hair feels less damaged. It also helps with styling the hair as a base before your main product.",
                                                    "author": null,
                                                    "id": "gko0xdn",
                                                    "parent_id": "t1_gkmm6ds",
                                                    "score": 3,
                                                    "created_utc": 1611543142.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Same! I never blow dry, I have no idea in that department and would also like some advice on that. \n\nI never really noticed a difference? I’m probably doing it wrong though.",
                            "author": "ButterStick212",
                            "id": "gkmiek3",
                            "parent_id": "t1_gkmg7xi",
                            "score": 2,
                            "created_utc": 1611516839.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I used to use shampoo and conditioner every day until around two years ago but I’m still kinda confused on when to use them. I don’t use a blow dryer",
                    "author": "optimists_unite",
                    "id": "gkmz58j",
                    "parent_id": "t1_gkmeoyp",
                    "score": 1,
                    "created_utc": 1611524921.0,
                    "replies": [
                        {
                            "body": "Don’t shampoo every day, try every other day. It strips your natural hair oils too often leaving your hair dry and frizzy like a mop",
                            "author": "RaphaTlr",
                            "id": "gkn4x9q",
                            "parent_id": "t1_gkmz58j",
                            "score": 6,
                            "created_utc": 1611527601.0,
                            "replies": []
                        },
                        {
                            "body": "Rule of thumb: Shampoo for the roots, conditioner for the ends.",
                            "author": "dbonx",
                            "id": "gknqbgl",
                            "parent_id": "t1_gkmz58j",
                            "score": 1,
                            "created_utc": 1611537750.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just keep growing it out. Right now, it’s too short for it to be weighed down. Just wait it out and get some trims along the way my guy, it’ll be worth it.",
            "author": "MILF_Tiddy",
            "id": "gkmf4ut",
            "parent_id": "t3_l3zere",
            "score": 6,
            "created_utc": 1611515143.0,
            "replies": []
        },
        {
            "body": "Use some product like water pomade which give ur hair lil shine but doesnt make them stiff like gel.",
            "author": "rajavir",
            "id": "gklf6j8",
            "parent_id": "t3_l3zere",
            "score": 9,
            "created_utc": 1611505372.0,
            "replies": []
        },
        {
            "body": "Oil based pomade or clay",
            "author": "hate_machine_",
            "id": "gkmdxcw",
            "parent_id": "t3_l3zere",
            "score": 3,
            "created_utc": 1611514556.0,
            "replies": []
        },
        {
            "body": "I have the same hair as yours. I keep my hair short on the side then textured at the top.  Low maintenance and easy to manage. I use wax when i style my hair. I use a little bit of shine if i want to be formal, and matte if i want to be casual.",
            "author": "crookedup",
            "id": "gkn4972",
            "parent_id": "t3_l3zere",
            "score": 3,
            "created_utc": 1611527315.0,
            "replies": []
        },
        {
            "body": "A product like Reuzel Pink will hold that all day and keep the shine. I agree with /u/catdroidpart2 though, trim the sides some more.\n\nIt looks as if you're using a water-based pomade, maybe from Old Spice or something, if that's the case that's what's causing it to end up like it is at the end of the day.",
            "author": "adamsmith93",
            "id": "gko3n8q",
            "parent_id": "t3_l3zere",
            "score": 2,
            "created_utc": 1611544526.0,
            "replies": []
        },
        {
            "body": "As a fellow Asian, I recommend the Japanese Gatsby products. Their stuff is designed for super straight Asian hair like yours. Might wanna try growing your hair out a bit too. [Just rub the clay on your hand and apply, and if you want those spikes get more clay on your fingertips and start twisting tips of your hair.](https://www.youtube.com/watch?v=NeW96cSToNs)\n\nIt should hold all day. If not, apply more. My hair is thick and wavy so I apply and style mine differently than yours and I use other products, but for you, try out some [Gatsby Moving Rubber (the pink one)](https://www.youtube.com/watch?v=UH6SUHBIy9c). It's the same my friend uses who has the same type of hair as yours.\n\n[Here's another demo.](https://www.youtube.com/watch?v=4TrxGFDELbw)",
            "author": "drunkenstyle",
            "id": "gkoix8b",
            "parent_id": "t3_l3zere",
            "score": 2,
            "created_utc": 1611554390.0,
            "replies": [
                {
                    "body": "Finally, I was looking for alternatives people were listing, thanks!!",
                    "author": "optimists_unite",
                    "id": "gkor7xb",
                    "parent_id": "t1_gkoix8b",
                    "score": 1,
                    "created_utc": 1611561515.0,
                    "replies": [
                        {
                            "body": "Not that they're wrong, but I definitely feel this specifically applies to you so I had to jump in! Glad I could help.\n\nAlso, Gatsby Moving Rubber is water-based so it's easy to wash out.",
                            "author": "drunkenstyle",
                            "id": "gkouq17",
                            "parent_id": "t1_gkor7xb",
                            "score": 2,
                            "created_utc": 1611564921.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fellow asian here. Grow it out for a bit of weight and flexibility in styling. Don't shampoo and condition in the same shower; only one or the other. Try shampooing every couple of days, and condition in between to maintain a level of oil needed. Use more advanced hair products such as pomades or clays. Invest in some nice combs and a brush to help with styling. Blow drying properly will help achieve volume should you need it.",
            "author": "HeyyyKoolAid",
            "id": "gkouf68",
            "parent_id": "t3_l3zere",
            "score": 2,
            "created_utc": 1611564620.0,
            "replies": []
        },
        {
            "body": "I see a lot of frizz happening as it is drying. It might be the lighting but your hair looks on the coarser side to me. On top of being straight, that is a difficult combo to deal with!! Coarse hair has a very tight and thick cuticle layer surrounding the cortex of your hair, which makes it resistant to styling and moisture, so it tends to run on the dryer side of things. A professional smoothing/moisturizing shampoo and conditioner should help! You can also use hair oil to help control the frizz, dont use too much though or you will look greasy. Your hair needs acidic ingredients to help lower the pH. awapuhi wild ginger is a GREAT ingredient to look for in products. They are a little bit of an investment, but the Paul Mitchell Awapuhi line is fantastic. If you do plan on blow drying like other users have suggested, I would wait until your hair is a bit longer, otherwise it will be difficult to control. when you blow dry, apply some of your product to your wet hair and work it through. Use a heat protectant!!!! Blow drying can damage your hair, yes, but what is actually happening is you are breaking hydrogen bonds within your hair, and this allows for the change in style. Start at the root of your hair and move it in the direction you would like to style. Do not blow the air up the hair shaft (toward your scalp), use the blow drying on the hair away from you. Blowing the hot hair UP toward the scalp causes the cuticle to blow open, causing frizz. This will take some practice!!! Paul Mitchell Boomerang restyling mist is a GREAT product to have on hand. No hold to your style, but you can wet down your hair with it to restyle and reactivate your hair product without causing a lot of frizz like water sometimes can, plus it is hydrating. I use it a lot when I have unruly bedhead and I need to fix some spots lol. Do not use fine tooth combs to comb your hair when dry or wet, these cause breakage. A brush with a cushion-y center (when you press on the bristles they should all go down easily), is safe to use on wet or dry hair, less tension on your hairs. Dont worry too much about styling products right now. There are LOTS and it is trial and error for what works for your hair. Sorry for the gigantic wall of text, I just get excited when someone is actually interested in what is best for their hair! Most people shrug me off :( lol",
            "author": "kitt5yk",
            "id": "gkpj5v4",
            "parent_id": "t3_l3zere",
            "score": 2,
            "created_utc": 1611584559.0,
            "replies": [
                {
                    "body": "Thanks so much!",
                    "author": "optimists_unite",
                    "id": "gkrv288",
                    "parent_id": "t1_gkpj5v4",
                    "score": 1,
                    "created_utc": 1611623284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I second the no use of gels they dehydrated your hair and make it a fuck’n mess and the dandruff is a fuck’n nightmare, I do hair mask and use deep conditioners and that has really helped my hair feel nice and look ALOT better.",
            "author": "Deweyfinnrocks",
            "id": "gkn46wj",
            "parent_id": "t3_l3zere",
            "score": 2,
            "created_utc": 1611527285.0,
            "replies": []
        },
        {
            "body": "Hahaha jt s like i made this post i feel You Brother",
            "author": "jizzos",
            "id": "gkofzc8",
            "parent_id": "t3_l3zere",
            "score": 2,
            "created_utc": 1611552195.0,
            "replies": []
        },
        {
            "body": "Looks to me like you are over shampooing and not conditioning it.",
            "author": "accidentaldouche",
            "id": "gkokbub",
            "parent_id": "t3_l3zere",
            "score": 1,
            "created_utc": 1611555501.0,
            "replies": []
        },
        {
            "body": "My hair used to look like this, they called me the hedgehog lmfao. I loved it and this gave me nostalgia, honestly if I didn't care about other people's opinion (especially from girls) I would've gone back to this cut lol.\n\nI think I just growed it out and then got a sidecut, then it sorted itself out from there.",
            "author": null,
            "id": "gkovvif",
            "parent_id": "t3_l3zere",
            "score": 1,
            "created_utc": 1611566051.0,
            "replies": [
                {
                    "body": "thanks for giving me hope",
                    "author": "optimists_unite",
                    "id": "gkow4oe",
                    "parent_id": "t1_gkovvif",
                    "score": 1,
                    "created_utc": 1611566305.0,
                    "replies": [
                        {
                            "body": "My hair has an insane problem with getting frazzled and insanely unmanageable feeling like it has a mind of it's own if I don't address it correctly. I have many clays, water based & unorthodox water based pomades, oil based pomades, waxes, cremes, pastes, tonics, pre stylers, texture sprays etc. The main thing I would recommend before any of those (and all those things have a place and are important) would be just try a hair oil. That's the #1 thing for me that keeps my hair in a domain that just allows everything else to work properly and have desirable results. I recommend argan oil as a go to, you can get 4oz which will last a long time for under $20 on amazon. My favorite oil is cloud control from Blumaan but I feel it's a bit pricey but still worth it. Shear revival saw bones oil also good or even Lockharts groom cream. Also I try to only use shampoo 1 time / week ideally 3 times / week max, everyday is way too much.",
                            "author": "thecatalyst11",
                            "id": "gkoxoid",
                            "parent_id": "t1_gkow4oe",
                            "score": 2,
                            "created_utc": 1611567812.0,
                            "replies": []
                        },
                        {
                            "body": "my hair was way worse than yours btw, if it was raining it looked like every single strain of hair was separated, straight up looked like sticks",
                            "author": null,
                            "id": "gkowi8k",
                            "parent_id": "t1_gkow4oe",
                            "score": 1,
                            "created_utc": 1611566679.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep! that’s what I’m planning to do after years of school haircut rules (private school things) so I can’t wait hahah",
            "author": "optimists_unite",
            "id": "gkmzu06",
            "parent_id": "t1_gklq6st",
            "score": 10,
            "created_utc": 1611525218.0,
            "replies": []
        },
        {
            "body": "Do you think a Matt clay with medium finish is good enough to get a part-curtain style? I’ve been styling my hair as a combover for years (straight thick hair) and thought a curtain would fit?\n\nI have a very low widows peak, barely noticeable but it leaves a dangle of hair in the middle, thoughts on that? I usually salt spray and clay it in the combover shape. \n\nGrew out my hair quite long, don’t want it to go to waste ya know? Any advice is really appreciated. It’s just you sound like a pro on this!",
            "author": "ButterStick212",
            "id": "gkmi459",
            "parent_id": "t1_gkm5cfr",
            "score": 10,
            "created_utc": 1611516692.0,
            "replies": [
                {
                    "body": ">  Mitch Reformer\n\nHaha believe me I'm no pro, but I've tried one too many dozen products over the years and sure i'd be happy to be give ya some advice.\n\nDo you a photo of what your hair looks like now and wish it could look it?",
                    "author": "Catdroidpart2",
                    "id": "gkmlp1i",
                    "parent_id": "t1_gkmi459",
                    "score": 4,
                    "created_utc": 1611518514.0,
                    "replies": [
                        {
                            "body": "I’ll take a couple photos and post them on this sub for advice in a couple days. School for me is right around the corner and I need a cut really BAD. It’s a jungle up there honestly.",
                            "author": "ButterStick212",
                            "id": "gkmokxy",
                            "parent_id": "t1_gkmlp1i",
                            "score": 4,
                            "created_utc": 1611519982.0,
                            "replies": [
                                {
                                    "body": "Thanks!",
                                    "author": "optimists_unite",
                                    "id": "gknn9qw",
                                    "parent_id": "t1_gkmokxy",
                                    "score": 3,
                                    "created_utc": 1611536196.0,
                                    "replies": [
                                        {
                                            "body": "Wait no I meant advice for me lol, my hair isn’t as straight as yours but it’s a damn mess, I need serious help..",
                                            "author": "ButterStick212",
                                            "id": "gknt4hd",
                                            "parent_id": "t1_gknn9qw",
                                            "score": 2,
                                            "created_utc": 1611539175.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">\tI highly recommend … Wax hair products\n\n>\tAvoid Wax if you can\n\nSorry can you elaborate haha",
            "author": "optimists_unite",
            "id": "gknnhkf",
            "parent_id": "t1_gkm5cfr",
            "score": 5,
            "created_utc": 1611536308.0,
            "replies": [
                {
                    "body": "It's an option to throw in with the rest of the similar products, but it comes with damage. It's like choosing Charizard, he's strong and has high HP but deals ALOT of damage from the rest of the pokemon",
                    "author": "Catdroidpart2",
                    "id": "gknolrl",
                    "parent_id": "t1_gknnhkf",
                    "score": 6,
                    "created_utc": 1611536874.0,
                    "replies": []
                },
                {
                    "body": "I believe he was recommending wax as an implied last resort.",
                    "author": "digitalAlchemist413",
                    "id": "gknor33",
                    "parent_id": "t1_gknnhkf",
                    "score": 6,
                    "created_utc": 1611536950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I use pomade specifically because it prevents the frizzy fluff up.",
            "author": "salgat",
            "id": "gknwlh2",
            "parent_id": "t1_gkm5cfr",
            "score": 3,
            "created_utc": 1611540957.0,
            "replies": []
        },
        {
            "body": "Surprised to see only one answer talking about this and everyone else recommending product.  My hair, when it’s shorter like this, has a pretty similar texture to it from shampooing.  OP, I’m guessing you use shampoo during every shower so I would look into co-washing.  Shampooing makes my hair poof into a ball like that and makes it feel very dry, so I only do it 1-2 times a week and use a little bit of conditioner every shower.  Find a conditioner that works well for you, give your hair a couple weeks to adjust and balance it’s oils out, and you should see much less frizz and be able to move your hair how you want it  little bit more without necessarily adding product.",
            "author": "Roemax",
            "id": "gkmnpwk",
            "parent_id": "t1_gkmeoyp",
            "score": 11,
            "created_utc": 1611519564.0,
            "replies": [
                {
                    "body": "Yeah I’d suggest a haircut and some conditioner before anything else here. I do wash my hair daily but I have a super fine, soft hair texture and use conditioner roughly 3x a week + moisturizing shampoo on days where I don’t unless things get really greasy. Looking at OP’s hair, I’d guess that they could ease up on washing. \n\nAnother thing to consider is how aggressive you’re being with a towel + comb. I usually pat my hair dry and try to be gentle with a towel. Some folks recommend a t shirt or something softer. Definitely don’t aggressively scrub at your head with a towel because that’ll fuck things up too.",
                    "author": null,
                    "id": "gkmt2zd",
                    "parent_id": "t1_gkmnpwk",
                    "score": 5,
                    "created_utc": 1611522154.0,
                    "replies": []
                },
                {
                    "body": "Yeah I’ve only started doing all this about two weeks ago, so I guess I have to wait\n\nThanks!",
                    "author": "optimists_unite",
                    "id": "gkn0etd",
                    "parent_id": "t1_gkmnpwk",
                    "score": 1,
                    "created_utc": 1611525493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've never blow-dried my hair. How does it change the game compared to drying it with a towel or a letting it dry naturally?\n\nEdit: typo",
            "author": "noobvorld",
            "id": "gkmg7xi",
            "parent_id": "t1_gkmeoyp",
            "score": 7,
            "created_utc": 1611515686.0,
            "replies": [
                {
                    "body": "The heat damages the hair itself (it's made of protein, and protein doesn't like heat).",
                    "author": "ImmovableGonzalez",
                    "id": "gkmk0qq",
                    "parent_id": "t1_gkmg7xi",
                    "score": 10,
                    "created_utc": 1611517656.0,
                    "replies": [
                        {
                            "body": "So it's better to *not* blowdry?",
                            "author": "noobvorld",
                            "id": "gkmk5y1",
                            "parent_id": "t1_gkmk0qq",
                            "score": 7,
                            "created_utc": 1611517733.0,
                            "replies": [
                                {
                                    "body": "It’s better not to blow dry all the time, and when you do to not use too much heat directly on the hair",
                                    "author": "Hmm_would_bang",
                                    "id": "gkmm6ds",
                                    "parent_id": "t1_gkmk5y1",
                                    "score": 6,
                                    "created_utc": 1611518768.0,
                                    "replies": [
                                        {
                                            "body": "This is incorrect (sort of). Here's a paper on the topic:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/)  \n\n\n>Conclusion  \n>  \n>Although using a hair dryer causes more surface damage than natural drying, using a hair dryer at a distance of 15 cm with continuous motion causes less damage than drying hair naturally.",
                                            "author": "The_Wisest_of_Fools",
                                            "id": "gkmyt3c",
                                            "parent_id": "t1_gkmm6ds",
                                            "score": 4,
                                            "created_utc": 1611524780.0,
                                            "replies": [
                                                {
                                                    "body": "15 cm is 5.91 inches",
                                                    "author": "converter-bot",
                                                    "id": "gkmyufr",
                                                    "parent_id": "t1_gkmyt3c",
                                                    "score": 2,
                                                    "created_utc": 1611524795.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
                                                    "author": "Hmm_would_bang",
                                                    "id": "gkn12ew",
                                                    "parent_id": "t1_gkmyt3c",
                                                    "score": 1,
                                                    "created_utc": 1611525803.0,
                                                    "replies": [
                                                        {
                                                            "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                                                            "author": "noobvorld",
                                                            "id": "gknjs63",
                                                            "parent_id": "t1_gkn12ew",
                                                            "score": 7,
                                                            "created_utc": 1611534466.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "also to add to this if you blow dry with hot air , i recommend using a heat protectant sprays.It makes a difference and your hair feels less damaged. It also helps with styling the hair as a base before your main product.",
                                            "author": null,
                                            "id": "gko0xdn",
                                            "parent_id": "t1_gkmm6ds",
                                            "score": 3,
                                            "created_utc": 1611543142.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Same! I never blow dry, I have no idea in that department and would also like some advice on that. \n\nI never really noticed a difference? I’m probably doing it wrong though.",
                    "author": "ButterStick212",
                    "id": "gkmiek3",
                    "parent_id": "t1_gkmg7xi",
                    "score": 2,
                    "created_utc": 1611516839.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I used to use shampoo and conditioner every day until around two years ago but I’m still kinda confused on when to use them. I don’t use a blow dryer",
            "author": "optimists_unite",
            "id": "gkmz58j",
            "parent_id": "t1_gkmeoyp",
            "score": 1,
            "created_utc": 1611524921.0,
            "replies": [
                {
                    "body": "Don’t shampoo every day, try every other day. It strips your natural hair oils too often leaving your hair dry and frizzy like a mop",
                    "author": "RaphaTlr",
                    "id": "gkn4x9q",
                    "parent_id": "t1_gkmz58j",
                    "score": 6,
                    "created_utc": 1611527601.0,
                    "replies": []
                },
                {
                    "body": "Rule of thumb: Shampoo for the roots, conditioner for the ends.",
                    "author": "dbonx",
                    "id": "gknqbgl",
                    "parent_id": "t1_gkmz58j",
                    "score": 1,
                    "created_utc": 1611537750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Finally, I was looking for alternatives people were listing, thanks!!",
            "author": "optimists_unite",
            "id": "gkor7xb",
            "parent_id": "t1_gkoix8b",
            "score": 1,
            "created_utc": 1611561515.0,
            "replies": [
                {
                    "body": "Not that they're wrong, but I definitely feel this specifically applies to you so I had to jump in! Glad I could help.\n\nAlso, Gatsby Moving Rubber is water-based so it's easy to wash out.",
                    "author": "drunkenstyle",
                    "id": "gkouq17",
                    "parent_id": "t1_gkor7xb",
                    "score": 2,
                    "created_utc": 1611564921.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks so much!",
            "author": "optimists_unite",
            "id": "gkrv288",
            "parent_id": "t1_gkpj5v4",
            "score": 1,
            "created_utc": 1611623284.0,
            "replies": []
        },
        {
            "body": "thanks for giving me hope",
            "author": "optimists_unite",
            "id": "gkow4oe",
            "parent_id": "t1_gkovvif",
            "score": 1,
            "created_utc": 1611566305.0,
            "replies": [
                {
                    "body": "My hair has an insane problem with getting frazzled and insanely unmanageable feeling like it has a mind of it's own if I don't address it correctly. I have many clays, water based & unorthodox water based pomades, oil based pomades, waxes, cremes, pastes, tonics, pre stylers, texture sprays etc. The main thing I would recommend before any of those (and all those things have a place and are important) would be just try a hair oil. That's the #1 thing for me that keeps my hair in a domain that just allows everything else to work properly and have desirable results. I recommend argan oil as a go to, you can get 4oz which will last a long time for under $20 on amazon. My favorite oil is cloud control from Blumaan but I feel it's a bit pricey but still worth it. Shear revival saw bones oil also good or even Lockharts groom cream. Also I try to only use shampoo 1 time / week ideally 3 times / week max, everyday is way too much.",
                    "author": "thecatalyst11",
                    "id": "gkoxoid",
                    "parent_id": "t1_gkow4oe",
                    "score": 2,
                    "created_utc": 1611567812.0,
                    "replies": []
                },
                {
                    "body": "my hair was way worse than yours btw, if it was raining it looked like every single strain of hair was separated, straight up looked like sticks",
                    "author": null,
                    "id": "gkowi8k",
                    "parent_id": "t1_gkow4oe",
                    "score": 1,
                    "created_utc": 1611566679.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">  Mitch Reformer\n\nHaha believe me I'm no pro, but I've tried one too many dozen products over the years and sure i'd be happy to be give ya some advice.\n\nDo you a photo of what your hair looks like now and wish it could look it?",
            "author": "Catdroidpart2",
            "id": "gkmlp1i",
            "parent_id": "t1_gkmi459",
            "score": 4,
            "created_utc": 1611518514.0,
            "replies": [
                {
                    "body": "I’ll take a couple photos and post them on this sub for advice in a couple days. School for me is right around the corner and I need a cut really BAD. It’s a jungle up there honestly.",
                    "author": "ButterStick212",
                    "id": "gkmokxy",
                    "parent_id": "t1_gkmlp1i",
                    "score": 4,
                    "created_utc": 1611519982.0,
                    "replies": [
                        {
                            "body": "Thanks!",
                            "author": "optimists_unite",
                            "id": "gknn9qw",
                            "parent_id": "t1_gkmokxy",
                            "score": 3,
                            "created_utc": 1611536196.0,
                            "replies": [
                                {
                                    "body": "Wait no I meant advice for me lol, my hair isn’t as straight as yours but it’s a damn mess, I need serious help..",
                                    "author": "ButterStick212",
                                    "id": "gknt4hd",
                                    "parent_id": "t1_gknn9qw",
                                    "score": 2,
                                    "created_utc": 1611539175.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's an option to throw in with the rest of the similar products, but it comes with damage. It's like choosing Charizard, he's strong and has high HP but deals ALOT of damage from the rest of the pokemon",
            "author": "Catdroidpart2",
            "id": "gknolrl",
            "parent_id": "t1_gknnhkf",
            "score": 6,
            "created_utc": 1611536874.0,
            "replies": []
        },
        {
            "body": "I believe he was recommending wax as an implied last resort.",
            "author": "digitalAlchemist413",
            "id": "gknor33",
            "parent_id": "t1_gknnhkf",
            "score": 6,
            "created_utc": 1611536950.0,
            "replies": []
        },
        {
            "body": "Yeah I’d suggest a haircut and some conditioner before anything else here. I do wash my hair daily but I have a super fine, soft hair texture and use conditioner roughly 3x a week + moisturizing shampoo on days where I don’t unless things get really greasy. Looking at OP’s hair, I’d guess that they could ease up on washing. \n\nAnother thing to consider is how aggressive you’re being with a towel + comb. I usually pat my hair dry and try to be gentle with a towel. Some folks recommend a t shirt or something softer. Definitely don’t aggressively scrub at your head with a towel because that’ll fuck things up too.",
            "author": null,
            "id": "gkmt2zd",
            "parent_id": "t1_gkmnpwk",
            "score": 5,
            "created_utc": 1611522154.0,
            "replies": []
        },
        {
            "body": "Yeah I’ve only started doing all this about two weeks ago, so I guess I have to wait\n\nThanks!",
            "author": "optimists_unite",
            "id": "gkn0etd",
            "parent_id": "t1_gkmnpwk",
            "score": 1,
            "created_utc": 1611525493.0,
            "replies": []
        },
        {
            "body": "The heat damages the hair itself (it's made of protein, and protein doesn't like heat).",
            "author": "ImmovableGonzalez",
            "id": "gkmk0qq",
            "parent_id": "t1_gkmg7xi",
            "score": 10,
            "created_utc": 1611517656.0,
            "replies": [
                {
                    "body": "So it's better to *not* blowdry?",
                    "author": "noobvorld",
                    "id": "gkmk5y1",
                    "parent_id": "t1_gkmk0qq",
                    "score": 7,
                    "created_utc": 1611517733.0,
                    "replies": [
                        {
                            "body": "It’s better not to blow dry all the time, and when you do to not use too much heat directly on the hair",
                            "author": "Hmm_would_bang",
                            "id": "gkmm6ds",
                            "parent_id": "t1_gkmk5y1",
                            "score": 6,
                            "created_utc": 1611518768.0,
                            "replies": [
                                {
                                    "body": "This is incorrect (sort of). Here's a paper on the topic:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/)  \n\n\n>Conclusion  \n>  \n>Although using a hair dryer causes more surface damage than natural drying, using a hair dryer at a distance of 15 cm with continuous motion causes less damage than drying hair naturally.",
                                    "author": "The_Wisest_of_Fools",
                                    "id": "gkmyt3c",
                                    "parent_id": "t1_gkmm6ds",
                                    "score": 4,
                                    "created_utc": 1611524780.0,
                                    "replies": [
                                        {
                                            "body": "15 cm is 5.91 inches",
                                            "author": "converter-bot",
                                            "id": "gkmyufr",
                                            "parent_id": "t1_gkmyt3c",
                                            "score": 2,
                                            "created_utc": 1611524795.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
                                            "author": "Hmm_would_bang",
                                            "id": "gkn12ew",
                                            "parent_id": "t1_gkmyt3c",
                                            "score": 1,
                                            "created_utc": 1611525803.0,
                                            "replies": [
                                                {
                                                    "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                                                    "author": "noobvorld",
                                                    "id": "gknjs63",
                                                    "parent_id": "t1_gkn12ew",
                                                    "score": 7,
                                                    "created_utc": 1611534466.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "also to add to this if you blow dry with hot air , i recommend using a heat protectant sprays.It makes a difference and your hair feels less damaged. It also helps with styling the hair as a base before your main product.",
                                    "author": null,
                                    "id": "gko0xdn",
                                    "parent_id": "t1_gkmm6ds",
                                    "score": 3,
                                    "created_utc": 1611543142.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same! I never blow dry, I have no idea in that department and would also like some advice on that. \n\nI never really noticed a difference? I’m probably doing it wrong though.",
            "author": "ButterStick212",
            "id": "gkmiek3",
            "parent_id": "t1_gkmg7xi",
            "score": 2,
            "created_utc": 1611516839.0,
            "replies": []
        },
        {
            "body": "Don’t shampoo every day, try every other day. It strips your natural hair oils too often leaving your hair dry and frizzy like a mop",
            "author": "RaphaTlr",
            "id": "gkn4x9q",
            "parent_id": "t1_gkmz58j",
            "score": 6,
            "created_utc": 1611527601.0,
            "replies": []
        },
        {
            "body": "Rule of thumb: Shampoo for the roots, conditioner for the ends.",
            "author": "dbonx",
            "id": "gknqbgl",
            "parent_id": "t1_gkmz58j",
            "score": 1,
            "created_utc": 1611537750.0,
            "replies": []
        },
        {
            "body": "Not that they're wrong, but I definitely feel this specifically applies to you so I had to jump in! Glad I could help.\n\nAlso, Gatsby Moving Rubber is water-based so it's easy to wash out.",
            "author": "drunkenstyle",
            "id": "gkouq17",
            "parent_id": "t1_gkor7xb",
            "score": 2,
            "created_utc": 1611564921.0,
            "replies": []
        },
        {
            "body": "My hair has an insane problem with getting frazzled and insanely unmanageable feeling like it has a mind of it's own if I don't address it correctly. I have many clays, water based & unorthodox water based pomades, oil based pomades, waxes, cremes, pastes, tonics, pre stylers, texture sprays etc. The main thing I would recommend before any of those (and all those things have a place and are important) would be just try a hair oil. That's the #1 thing for me that keeps my hair in a domain that just allows everything else to work properly and have desirable results. I recommend argan oil as a go to, you can get 4oz which will last a long time for under $20 on amazon. My favorite oil is cloud control from Blumaan but I feel it's a bit pricey but still worth it. Shear revival saw bones oil also good or even Lockharts groom cream. Also I try to only use shampoo 1 time / week ideally 3 times / week max, everyday is way too much.",
            "author": "thecatalyst11",
            "id": "gkoxoid",
            "parent_id": "t1_gkow4oe",
            "score": 2,
            "created_utc": 1611567812.0,
            "replies": []
        },
        {
            "body": "my hair was way worse than yours btw, if it was raining it looked like every single strain of hair was separated, straight up looked like sticks",
            "author": null,
            "id": "gkowi8k",
            "parent_id": "t1_gkow4oe",
            "score": 1,
            "created_utc": 1611566679.0,
            "replies": []
        },
        {
            "body": "I’ll take a couple photos and post them on this sub for advice in a couple days. School for me is right around the corner and I need a cut really BAD. It’s a jungle up there honestly.",
            "author": "ButterStick212",
            "id": "gkmokxy",
            "parent_id": "t1_gkmlp1i",
            "score": 4,
            "created_utc": 1611519982.0,
            "replies": [
                {
                    "body": "Thanks!",
                    "author": "optimists_unite",
                    "id": "gknn9qw",
                    "parent_id": "t1_gkmokxy",
                    "score": 3,
                    "created_utc": 1611536196.0,
                    "replies": [
                        {
                            "body": "Wait no I meant advice for me lol, my hair isn’t as straight as yours but it’s a damn mess, I need serious help..",
                            "author": "ButterStick212",
                            "id": "gknt4hd",
                            "parent_id": "t1_gknn9qw",
                            "score": 2,
                            "created_utc": 1611539175.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So it's better to *not* blowdry?",
            "author": "noobvorld",
            "id": "gkmk5y1",
            "parent_id": "t1_gkmk0qq",
            "score": 7,
            "created_utc": 1611517733.0,
            "replies": [
                {
                    "body": "It’s better not to blow dry all the time, and when you do to not use too much heat directly on the hair",
                    "author": "Hmm_would_bang",
                    "id": "gkmm6ds",
                    "parent_id": "t1_gkmk5y1",
                    "score": 6,
                    "created_utc": 1611518768.0,
                    "replies": [
                        {
                            "body": "This is incorrect (sort of). Here's a paper on the topic:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/)  \n\n\n>Conclusion  \n>  \n>Although using a hair dryer causes more surface damage than natural drying, using a hair dryer at a distance of 15 cm with continuous motion causes less damage than drying hair naturally.",
                            "author": "The_Wisest_of_Fools",
                            "id": "gkmyt3c",
                            "parent_id": "t1_gkmm6ds",
                            "score": 4,
                            "created_utc": 1611524780.0,
                            "replies": [
                                {
                                    "body": "15 cm is 5.91 inches",
                                    "author": "converter-bot",
                                    "id": "gkmyufr",
                                    "parent_id": "t1_gkmyt3c",
                                    "score": 2,
                                    "created_utc": 1611524795.0,
                                    "replies": []
                                },
                                {
                                    "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
                                    "author": "Hmm_would_bang",
                                    "id": "gkn12ew",
                                    "parent_id": "t1_gkmyt3c",
                                    "score": 1,
                                    "created_utc": 1611525803.0,
                                    "replies": [
                                        {
                                            "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                                            "author": "noobvorld",
                                            "id": "gknjs63",
                                            "parent_id": "t1_gkn12ew",
                                            "score": 7,
                                            "created_utc": 1611534466.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "also to add to this if you blow dry with hot air , i recommend using a heat protectant sprays.It makes a difference and your hair feels less damaged. It also helps with styling the hair as a base before your main product.",
                            "author": null,
                            "id": "gko0xdn",
                            "parent_id": "t1_gkmm6ds",
                            "score": 3,
                            "created_utc": 1611543142.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks!",
            "author": "optimists_unite",
            "id": "gknn9qw",
            "parent_id": "t1_gkmokxy",
            "score": 3,
            "created_utc": 1611536196.0,
            "replies": [
                {
                    "body": "Wait no I meant advice for me lol, my hair isn’t as straight as yours but it’s a damn mess, I need serious help..",
                    "author": "ButterStick212",
                    "id": "gknt4hd",
                    "parent_id": "t1_gknn9qw",
                    "score": 2,
                    "created_utc": 1611539175.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s better not to blow dry all the time, and when you do to not use too much heat directly on the hair",
            "author": "Hmm_would_bang",
            "id": "gkmm6ds",
            "parent_id": "t1_gkmk5y1",
            "score": 6,
            "created_utc": 1611518768.0,
            "replies": [
                {
                    "body": "This is incorrect (sort of). Here's a paper on the topic:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/)  \n\n\n>Conclusion  \n>  \n>Although using a hair dryer causes more surface damage than natural drying, using a hair dryer at a distance of 15 cm with continuous motion causes less damage than drying hair naturally.",
                    "author": "The_Wisest_of_Fools",
                    "id": "gkmyt3c",
                    "parent_id": "t1_gkmm6ds",
                    "score": 4,
                    "created_utc": 1611524780.0,
                    "replies": [
                        {
                            "body": "15 cm is 5.91 inches",
                            "author": "converter-bot",
                            "id": "gkmyufr",
                            "parent_id": "t1_gkmyt3c",
                            "score": 2,
                            "created_utc": 1611524795.0,
                            "replies": []
                        },
                        {
                            "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
                            "author": "Hmm_would_bang",
                            "id": "gkn12ew",
                            "parent_id": "t1_gkmyt3c",
                            "score": 1,
                            "created_utc": 1611525803.0,
                            "replies": [
                                {
                                    "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                                    "author": "noobvorld",
                                    "id": "gknjs63",
                                    "parent_id": "t1_gkn12ew",
                                    "score": 7,
                                    "created_utc": 1611534466.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "also to add to this if you blow dry with hot air , i recommend using a heat protectant sprays.It makes a difference and your hair feels less damaged. It also helps with styling the hair as a base before your main product.",
                    "author": null,
                    "id": "gko0xdn",
                    "parent_id": "t1_gkmm6ds",
                    "score": 3,
                    "created_utc": 1611543142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wait no I meant advice for me lol, my hair isn’t as straight as yours but it’s a damn mess, I need serious help..",
            "author": "ButterStick212",
            "id": "gknt4hd",
            "parent_id": "t1_gknn9qw",
            "score": 2,
            "created_utc": 1611539175.0,
            "replies": []
        },
        {
            "body": "This is incorrect (sort of). Here's a paper on the topic:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3229938/)  \n\n\n>Conclusion  \n>  \n>Although using a hair dryer causes more surface damage than natural drying, using a hair dryer at a distance of 15 cm with continuous motion causes less damage than drying hair naturally.",
            "author": "The_Wisest_of_Fools",
            "id": "gkmyt3c",
            "parent_id": "t1_gkmm6ds",
            "score": 4,
            "created_utc": 1611524780.0,
            "replies": [
                {
                    "body": "15 cm is 5.91 inches",
                    "author": "converter-bot",
                    "id": "gkmyufr",
                    "parent_id": "t1_gkmyt3c",
                    "score": 2,
                    "created_utc": 1611524795.0,
                    "replies": []
                },
                {
                    "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
                    "author": "Hmm_would_bang",
                    "id": "gkn12ew",
                    "parent_id": "t1_gkmyt3c",
                    "score": 1,
                    "created_utc": 1611525803.0,
                    "replies": [
                        {
                            "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                            "author": "noobvorld",
                            "id": "gknjs63",
                            "parent_id": "t1_gkn12ew",
                            "score": 7,
                            "created_utc": 1611534466.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "also to add to this if you blow dry with hot air , i recommend using a heat protectant sprays.It makes a difference and your hair feels less damaged. It also helps with styling the hair as a base before your main product.",
            "author": null,
            "id": "gko0xdn",
            "parent_id": "t1_gkmm6ds",
            "score": 3,
            "created_utc": 1611543142.0,
            "replies": []
        },
        {
            "body": "15 cm is 5.91 inches",
            "author": "converter-bot",
            "id": "gkmyufr",
            "parent_id": "t1_gkmyt3c",
            "score": 2,
            "created_utc": 1611524795.0,
            "replies": []
        },
        {
            "body": "That study doesn’t really disprove what I’m saying.. \n\n> Hair drying without a hair dryer produced a relatively well protected hair surface, while hair that was dried using a hair dryer showed more damage of hair surfaces. In addition, the hair surfaces showed an overall tendency to become more damaged as the temperature increased, with the most severe surface damage produced after drying with the highest temperature (95℃). No cortex damage was noted in any group, suggesting that the surface of the hair might play a role as a barrier to prevent cortex damage. The cortex might be more damaged with increased repetition of the process, when the barrier of hair surface is broken. The CMC was damaged only in the naturally dried group. This result was quite unexpected, because increased temperatures generally led to more hair damage. It took over 2 h to dry the hair tress completely under ambient conditions. The hair shaft swells when in contact with water, as does the delta-layer of the CMC. The delta-layer is the sole route through which water diffuses into hair16, and so we speculate that the CMC could be damaged when it is in contact with water for prolonged periods. Longer contact with water might be more harmful to the CMC compared to temperature of hair drying.",
            "author": "Hmm_would_bang",
            "id": "gkn12ew",
            "parent_id": "t1_gkmyt3c",
            "score": 1,
            "created_utc": 1611525803.0,
            "replies": [
                {
                    "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
                    "author": "noobvorld",
                    "id": "gknjs63",
                    "parent_id": "t1_gkn12ew",
                    "score": 7,
                    "created_utc": 1611534466.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This tells me I need to stop taking long showers in hot water. Goddamn it, I need the warmth to offset my empty soul.",
            "author": "noobvorld",
            "id": "gknjs63",
            "parent_id": "t1_gkn12ew",
            "score": 7,
            "created_utc": 1611534466.0,
            "replies": []
        }
    ]
}