{
    "title": "What I wish I knew before I joined SA after saying after over 30 meets and ending my 'career'",
    "post_id": "mq8ahq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mq8ahq/what_i_wish_i_knew_before_i_joined_sa_after/",
    "author": null,
    "body": "Hey everyone!\n\nSince I met generally a lot of guys from SA (probably about 30 - many was just for one time ) and I thought I can write. At first, after a short introduction, I will point some random things I observed, then you can find some SB advice I wish I knew. If there is sth you disagree with/ agree it would be great to hear.\n\nMy general observations/experience:\n\n\\-  I noticed was that men are the most prejudiced towards each other. I often heard sth like 'I suppose guys weren't treating you right' or sth that kind. Surprisingly the reality was not bad, nobody was rude in person towards me.\n\n\\- basically, there are just guys seeking mainly sexual experiences. there are some who also want a closer relationship/ talk but it is not a majority. Also, it is probably very hard to find sth platonic as a girl if that's what you want\n\n\\- it is surprising that even some middle-aged guys did not realise that sexting in a first message does not work\n\n\\- meeting older man you can see different lifestyles - see who you want or do not want to become. I always found. it surprising since I started engaging with work in business how much people don't know what they're doing. They talk a lot thinking they know sth but they don't. Also, I found a lot of this on SA\n\n\\- some SDs were nice but not that attractive and tbh it made me feel a bit bad about the men who think that they do not have another option to date than SA\n\n\\- most of the guys there are bankers, lawyers, working in corporations or having small companies. I  met a couple of guys that had impressive careers/ did something impressive but it is a minority\n\n\\- many people don't know what they are doing- at work, business, dating. The same is on here so that my scepticism towards listening to career/ life advice and relying on it too seriously.\n\n\\-  sometimes it requires a couple of meets to meet the right person for you, but it is worth it. It is also always good to be genuine and straightforward\n\n&#x200B;\n\nSB advice I'd wish I got before I joined:\n\n1. Be always honest and straightforward. Life is already complicated & time is scarce, let's not make it more complicated and. be genuine with anyone anywhere including SA\n2. I don't send any nude pics before the meeting/ don't sext or do anything like that. Mainly bc iI don't like it, want to protect my privacy and also some guys just seem to settle on it/ want to talk too much\n3. I realised many guys appreciated having interests/ appearing intelligent (even if there were not :p) so don't hide who you are or pretend dumber ;)\n4. It is not a way to make money - it can be a side thing, when you like someone it is awesome. But the moment you start viewing it as a job, it became not so far off prostitution. If you are struggling to try to find support through uni help funds/ organisations/ work/ family.\n5. Don't meet at the hotel for the first date. It is usually better to have a first meet without any expectation, to see what you put yourself into and check how do you feel with each other. It is like in business - do some analysis before you sign yourself into sth. Even if at first it might be just a couple of meetings not going anywhere it pays off when you get to meet the right person instead of agreeing on the first offer you get\n6. Be respectful and nice -- it should apply for anyone anywhere but I find that on SA you can come across some angry or rude people - just ignore it. It so dumb to waste your emotional energy on getting angry with a random dude online\n7. If you are looking for a mentor/ career advice go to the conferences, try to contact people you admire, use your uni services -- of course it is great if your SD offers you some advice but keep in mind ppl are opinionated, you are the only one who knows your skills and situation. Some of the 'advice' I got was a bit crap so you know\n\nMaybe many of the points I made are obvious, but I would have been better off If I'd known about all this before I started doing it. Hence, there might be a person that finds it helpful.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mq8ahq/what_i_wish_i_knew_before_i_joined_sa_after/",
    "score": 114,
    "upvote_ratio": 0.88,
    "created_utc": 1618338266.0,
    "num_comments": 57,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Always strikes me as totally weird when SBs claim to want professional mentorship. Not a great strategy to mix your professional goals and being a paid girlfriend IMO. What is your SD going to recommend you to a colleague like, well she gives great head!",
            "author": "supermarket_Ba",
            "id": "gufbred",
            "parent_id": "t3_mq8ahq",
            "score": 52,
            "created_utc": 1618354555.0,
            "replies": [
                {
                    "body": "Hahaha I just laughed so hard at this",
                    "author": "Binab2020",
                    "id": "gufw22c",
                    "parent_id": "t1_gufbred",
                    "score": 9,
                    "created_utc": 1618365063.0,
                    "replies": []
                },
                {
                    "body": "Many of my colleagues would really appreciate such referrals actually.",
                    "author": "Ideal_Jerk",
                    "id": "gugohpe",
                    "parent_id": "t1_gufbred",
                    "score": 8,
                    "created_utc": 1618384233.0,
                    "replies": []
                },
                {
                    "body": "A SD is best served by keeping his career and sugar life at safe distances.",
                    "author": null,
                    "id": "guhjr1l",
                    "parent_id": "t1_gufbred",
                    "score": 6,
                    "created_utc": 1618408268.0,
                    "replies": []
                },
                {
                    "body": "I used to have an in with an Ivy League college previously that I leveraged the hell out of for my sugar purposes. You have to be very smart about those things though, the SB still have to be an honors+ student to have anywhere near a shot.\n\n\nSadly (for me) Operation Varsity Blues made colleges super restrictive of any admissions other than straight front door or whale legacy. Refferals aren't cutting it anymore.",
                    "author": "KeyToGramercy",
                    "id": "gugvufz",
                    "parent_id": "t1_gufbred",
                    "score": 4,
                    "created_utc": 1618391412.0,
                    "replies": [
                        {
                            "body": "An in with an Ivy and a key to Gramercy Park - my man, you are living the dream!",
                            "author": null,
                            "id": "gugz9sz",
                            "parent_id": "t1_gugvufz",
                            "score": 6,
                            "created_utc": 1618394785.0,
                            "replies": [
                                {
                                    "body": "From 5 years on this forum you're the first to catch the reference. A man of culture.",
                                    "author": "KeyToGramercy",
                                    "id": "guhzo5v",
                                    "parent_id": "t1_gugz9sz",
                                    "score": 5,
                                    "created_utc": 1618415429.0,
                                    "replies": [
                                        {
                                            "body": "come to Boston and I'll meet you in Louisburg Square",
                                            "author": null,
                                            "id": "guixhlv",
                                            "parent_id": "t1_guhzo5v",
                                            "score": 2,
                                            "created_utc": 1618430180.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This seriously made me LOL. 😂😂😂",
                    "author": "FoxyFreckles1989",
                    "id": "gug9jb6",
                    "parent_id": "t1_gufbred",
                    "score": 3,
                    "created_utc": 1618372737.0,
                    "replies": []
                },
                {
                    "body": "Ive met girls in SA that I would ABSOLUTELY recommend to any high end academic institution. What the fuck does having had sex with her have to do with her intellect.",
                    "author": "RockyLeal",
                    "id": "guh0mfc",
                    "parent_id": "t1_gufbred",
                    "score": 5,
                    "created_utc": 1618396036.0,
                    "replies": [
                        {
                            "body": "It doesn’t lol.",
                            "author": "supermarket_Ba",
                            "id": "guhm30r",
                            "parent_id": "t1_guh0mfc",
                            "score": 0,
                            "created_utc": 1618409386.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good read. I wonder how much of what you experienced is regional/geography or just cultural, i.e. men from one part of the country behave differently from another part of the country. Were you observations in a particular region?",
            "author": "stpatricks81",
            "id": "gueqcw0",
            "parent_id": "t3_mq8ahq",
            "score": 13,
            "created_utc": 1618344217.0,
            "replies": [
                {
                    "body": "That's a very good point. I was using SA almost only in London, however, I met people from very different nationalites/backgrouds. I did not see any large cultural differences in terms of how dates looked like, but it's probably because most of men lived and worked here at least a couple of years.",
                    "author": null,
                    "id": "guerebg",
                    "parent_id": "t1_gueqcw0",
                    "score": 10,
                    "created_utc": 1618344694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "great post :-) after lots of time at this, I feel this to be very accurate",
            "author": "rodnarf",
            "id": "guemrf1",
            "parent_id": "t3_mq8ahq",
            "score": 10,
            "created_utc": 1618342615.0,
            "replies": [
                {
                    "body": "Deserves to be carved in stone",
                    "author": "pinotandsugar",
                    "id": "gufv7jr",
                    "parent_id": "t1_guemrf1",
                    "score": 3,
                    "created_utc": 1618364627.0,
                    "replies": []
                },
                {
                    "body": "Thank you x",
                    "author": null,
                    "id": "guep54z",
                    "parent_id": "t1_guemrf1",
                    "score": 1,
                    "created_utc": 1618343664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "guejrm5",
            "parent_id": "t3_mq8ahq",
            "score": 7,
            "created_utc": 1618341285.0,
            "replies": [
                {
                    "body": "There are a few reasons.\n\n1. I am focusing more on work/ projects so don't have too much time. \n2. It always takes me a few meets before I meet someone I actually like and want to be seeing so it requires energy\n3. I feel like I met different kinds of SDs and I had my lessons/experiences.\n4. There is still a covid thing going on so possibilities are limited \n\nAlso, there is just time for anything in life to come and go :)",
                    "author": null,
                    "id": "guep3t0",
                    "parent_id": "t1_guejrm5",
                    "score": 16,
                    "created_utc": 1618343648.0,
                    "replies": [
                        {
                            "body": "This is the best list I think I've ever seen for leaving the bowl. You had the experience, you gained from it, and you are ready to move on.  \n\nWishing you great success in your life moving forward.",
                            "author": null,
                            "id": "gugzd4d",
                            "parent_id": "t1_guep3t0",
                            "score": 2,
                            "created_utc": 1618394874.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a very interesting post.  Some good advice and some inaccuracies but then again SRs are a YMMV type adventure.  If your context is a “career “ of 30 mostly one off meetings I’m not sure you got the full experience.   I did it for over 20 years and was still learning.  On your observations:\n- yes guys are highly prejudiced to each other, I’ve found SBs to be the same way.  I think this is common everywhere not just SA though.\n\n- everyone is seeking some form of sexual relationship, anyone that tells you different is lying or trying to scam you wether you realize or not.\n\n- spot on on the sexting in the first message thing.  I think some guys are coming into this with the hooker mindset and it shows.\n\n- people not knowing what they are doing.  Yup, a sad fact of life.  Very few people are in the driver’s seat of their own life.  I’m always of the belief you can learn something from anyone though, just need to keep in mind their experience level.\n\n- yup not every SB is a super model either and it always surprised me that some were surprised to find that out on their own or never did lol.  Don’t be fooled into thinking that every SD is the same either.  Personally I had plenty of options, just chose SRs for simplicity and efficiency.  Then again I’m not a hideous chud either lol.\n\n- need to know who you are with before taking advice.  I know several SDs that are very involved in career mentoring.  Personally that’s part of what I do as a career and I’ve also helped launch several startups with my SBs.  Just depends on the opportunity.  Give me a good idea or business plan and I’ll look at it if I can see you are serious. Again definitely can vary.\n\n- Definitely requires more than 1 meeting.  Rarely would anything good happen from 1 meeting.\n\nOn your numbered advice it’s mainly spot on and should be a requirement to read before you start:\n\n1-3 Absolutely!\n4 - I’d agree here as well.  It should never be considered an income source except in very limited circumstances.  I’ve talked more girls out of doing this than in.  My advice was always if this is something you’d like to do (date older men and find them attractive) then why not be there and get some benefits to compensate you for the occasional inconvenience and compression of the normal course of a relationship.  If you are just here for the money there are easier ways.\n\n5 -  Hell yes, unless there is a coffee shop or restaurant there and the SD is traveling through.  Still I would never set an expectation.\n\n6 -  cant stress this enough.  I could write a book on the unbelievably bad behavior of people I’ve met.  Be polite even if it isn’t what you want.\n\n7 - mostly agree depending on who the SD is.  I’ve heard some horrible advice given to SBs by the guidance office of a school.  Probably explains why they are in a school and not in business.  If you really do want career/ business advice from an SD just make sure they are in a position to give that.  Take the sum of all advice and make your own decision.\n\nAnyway thanks for sharing.  So knowing all that would you consider doing it again?  Why or why not?",
            "author": "RedHeavyG603",
            "id": "guhfzg6",
            "parent_id": "t3_mq8ahq",
            "score": 3,
            "created_utc": 1618406382.0,
            "replies": [
                {
                    "body": "Most of my meetings were one or two time but I met about 5 guys I was seeing for longer. \nI'm sure that it's possible to get good career advice from SD but I was always sceptical towards any career advice because they were very different and based on someone's subjective experience and also I just always knew more less what I want to do. Also I got some interns offers or some SDs that said that they could invest in one of my projects but I never eneded up taking any of that. Not because of any moral values but rather the situation or the thing that I wanted to do things my own way or I just had some examples in my environment where mixing relationship with businiess had often not the best outcomes. \n\nWould I do it again? Well, I don't regret doing it at the time. I met some interesting people had some great time and learned some things from it. Also, I met many people I wouldn't have met otherwise. \nHowever, if I could tell sth to myslef younger knowing what I know now I wouold say to myself to take a uni loan (the reason why I joined SA on the first place was finnancial), learn more about my interests, do more netwroing and work more on my projects instead of dating. At the time I could not know anything for certain and I was always scpetical to loans so did not want to risk. \nAlso, it's hard for me to say what role SA really played in my life. I met especially one guy who was a quite successful entrepreneur and talking to him gave me a really good perspective on things and knowleadge. It also impressed me how much can one person do. The fact that he thought I am similar to him made me belive in myself more which helped me a lot.\nThe other things was some of my SDs I talked to were some kind of investors and I realised how often they invest not really undestaning (or even trying to understand) the concept or science behind business but more based on general trends or the way project is presented which was also a good thing to know.\nIn the future I don't think I will do that again as I'm looking for more long term relationship and I don't care about finnancial side of it.",
                    "author": null,
                    "id": "gulf777",
                    "parent_id": "t1_guhfzg6",
                    "score": 2,
                    "created_utc": 1618487545.0,
                    "replies": [
                        {
                            "body": "Fair enough, thanks for the response!  The key to career advice is finding someone who knows that industry well.  I work in software and unfortunately I’d get half my POT from a nearby medical school and I had no idea what advice to offer medical students and told them that when they asked lol.  In order to invest with someone I’d need to know them for a while.  Wouldn’t consider it until at least 6 months or more into it and again it had to be a solid idea and the girl had to have a good work ethic.  2 of my investments are still ongoing and have worked out well to this day but most didn’t make it but that’s typical of startups anyway.  You are right though, I always find it amazing how many people would invest in things with little or no knowledge.",
                            "author": "RedHeavyG603",
                            "id": "gulg5k2",
                            "parent_id": "t1_gulf777",
                            "score": 1,
                            "created_utc": 1618488197.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> many people don't know what they are doing\n\nNobody really knows what they're doing or why. If you think *you* do, you haven't had enough life experience yet.",
            "author": "Dull_Palpitation_762",
            "id": "gufducx",
            "parent_id": "t3_mq8ahq",
            "score": 8,
            "created_utc": 1618355623.0,
            "replies": [
                {
                    "body": "I was shocked by this myself when I first got a job after college at a large company. People don’t really know what they’re doing but they’re successful",
                    "author": null,
                    "id": "gug28ix",
                    "parent_id": "t1_gufducx",
                    "score": 4,
                    "created_utc": 1618368378.0,
                    "replies": []
                },
                {
                    "body": "Many people don’t realize how much luck comes into play to be successful. So they think they are doing something right but I think most are just blundering around.",
                    "author": "ama_nigerian_prince",
                    "id": "gufxc5j",
                    "parent_id": "t1_gufducx",
                    "score": 3,
                    "created_utc": 1618365733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "4 absolutely. Don’t rely on this as your main income. I love the side hustle.\n\nAlso my observation (and no offense to the married SDs here) but the SDs that need discretion bc they’re sneaking around their wives make me sad. I realize there are so many circumstances on why a man would cheat but I will never be that other woman.",
            "author": "fidgetfuckboi",
            "id": "gufvczf",
            "parent_id": "t3_mq8ahq",
            "score": 7,
            "created_utc": 1618364705.0,
            "replies": [
                {
                    "body": "Neither will I! Nice to see other SBs with the same boundary",
                    "author": null,
                    "id": "gufxuvp",
                    "parent_id": "t1_gufvczf",
                    "score": 5,
                    "created_utc": 1618366006.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being a banker, lawyer, or small business owner isn't impressive to you? What is then? Being a neurosurgeon or being a c-suite executive? 😂",
            "author": null,
            "id": "gugxuod",
            "parent_id": "t3_mq8ahq",
            "score": 5,
            "created_utc": 1618393402.0,
            "replies": [
                {
                    "body": "She does not know :)",
                    "author": null,
                    "id": "gui9g54",
                    "parent_id": "t1_gugxuod",
                    "score": 0,
                    "created_utc": 1618419664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post , thank you for sharing !",
            "author": "cipi23",
            "id": "guf3k6o",
            "parent_id": "t3_mq8ahq",
            "score": 2,
            "created_utc": 1618350433.0,
            "replies": []
        },
        {
            "body": "Good post. I can only speak for myself 37M, but I don’t know what I’m doing with career, dating and life in general. I learn as much from my sb as she does from me!",
            "author": "jakes9",
            "id": "gufz5lh",
            "parent_id": "t3_mq8ahq",
            "score": 2,
            "created_utc": 1618366692.0,
            "replies": []
        },
        {
            "body": "What a helpful post especially for SB’S.\n\nI’m a little surprised more guys weren’t into the relationship side rather mainly the sex side.\nIf I didn’t have the friendship part I wouldn’t bother.\n\nAlso be honest, I never pretended to be something I wasn’t like say a big time CEO.\n\nGreat you have interests / hobbies. That’s one thing I’ve noticed, girls tend to have less hobbies than us guys.\n\nWow and middle aged guys (Im middle aged) sexting when you haven’t even met, how clueless.\nI don’t do that even now after nearly two years, just weird.",
            "author": "sydsyd3",
            "id": "gug2ya8",
            "parent_id": "t3_mq8ahq",
            "score": 2,
            "created_utc": 1618368780.0,
            "replies": []
        },
        {
            "body": "Why does a SB care about what a man knows or doesnt know about his job?\n\nWho cares?",
            "author": "SugarDaddyMaximo",
            "id": "guhrve5",
            "parent_id": "t3_mq8ahq",
            "score": 2,
            "created_utc": 1618412034.0,
            "replies": [
                {
                    "body": "I think it usually doesn't matter at all, but I was trying to figure out how the world works so it mattered for me.",
                    "author": null,
                    "id": "gulfgwa",
                    "parent_id": "t1_guhrve5",
                    "score": 1,
                    "created_utc": 1618487728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why isn’t it a way to make money as a side hustle? I saw something and it said in most small towns an average PPM is $2,000. So if you had 2 SDs that could be $4,000 extra a month and $48,000 extra a year.",
            "author": "coopersushi",
            "id": "gulskew",
            "parent_id": "t3_mq8ahq",
            "score": 2,
            "created_utc": 1618495099.0,
            "replies": []
        },
        {
            "body": "Sorry but this came across as a bit jaded.  Theres some good advice which has been mentioned before.\n\nIt seems the op actually expected all sd to be actual whales.  Lawyers and high corporate types earn ridiculous money anyway more than enough for a healthy ppm.\n\nAnd thinking that someone who is 20 years older has no idea about life and hence.not to take their advice is just silly.\n\nI remember how I was like at 20 and 30 years later im still learning.  From what I can gather from this post the op thinks she can learn nothing or little from sd and if they arent a billionaire their career choices are not so exciting.",
            "author": "wb19081908",
            "id": "gugeuq1",
            "parent_id": "t3_mq8ahq",
            "score": 5,
            "created_utc": 1618376339.0,
            "replies": [
                {
                    "body": "I agree. I feel the OP hasn't done enough self-reflection. I mean to have 30 m&g with \"many as one-offs\" there must have been several red flags that cause many of these guys to keep OP in the POT category. \n\nOP was only impressed by a **minority** of what these SD POTs did. I'd like to know what she expected to find.....an F1 driver *(Lewis Hamilton for the UK reference)?* Maybe, a Space Shuttle astronaut? Idris Elba inviting her to a M&G at one of his DJ shows? \n\nThere is no critical self-assessment, just regular complaints we see in all the other SB posts about crappy experiences. \n\nOP, hope I'm not being overly critical, but I'd be curious to know how far did your longest arrangement go? (i.e. 2 dates, 3 months, 1 year?",
                    "author": "pfc_6ixgodconsumer",
                    "id": "gugl2f2",
                    "parent_id": "t1_gugeuq1",
                    "score": 4,
                    "created_utc": 1618381259.0,
                    "replies": [
                        {
                            "body": "The bowl just isn't for everyone.  Both sides have people who have unrealistic expectations.",
                            "author": "wb19081908",
                            "id": "gugm1nx",
                            "parent_id": "t1_gugl2f2",
                            "score": 3,
                            "created_utc": 1618382091.0,
                            "replies": []
                        },
                        {
                            "body": "Usually I was not interested to meet again, vey rarely the other way just because I did not feel connection or interest. I do have high expectations not financial but generally about people’s interests and what they do because otherwise I got bored quickly. It is definitely my perception of life and dating and I am totally fine that it goes with one off meetings as I think it is better to meet someone I am not sure about once over than waste more time on it. I met some great people I had longer arrangements with and it was wonderful in any aspect of it that lasted for a couple of months because I was also traveling out of London for some time so it usually ended naturally because of geographic reasons \nThe point I wanted to make is also not to agree on the first person you meet but to seek what truly workers the best. I don’t mean to complain, more to share thoughts that would be helpful for me to know when I started.",
                            "author": null,
                            "id": "gugpsuf",
                            "parent_id": "t1_gugl2f2",
                            "score": 0,
                            "created_utc": 1618385436.0,
                            "replies": [
                                {
                                    "body": "You have a right to have high expectations! Great that you were able to find some great people through your process.",
                                    "author": null,
                                    "id": "gugz3mf",
                                    "parent_id": "t1_gugpsuf",
                                    "score": 2,
                                    "created_utc": 1618394626.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed. Some good points but a lot of it sounds pretentious af.",
                    "author": "slfsd20201",
                    "id": "guh05rj",
                    "parent_id": "t1_gugeuq1",
                    "score": 2,
                    "created_utc": 1618395617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gug2rni",
            "parent_id": "t3_mq8ahq",
            "score": 4,
            "created_utc": 1618368678.0,
            "replies": [
                {
                    "body": "Hahaha somebody had to do it! It was so distracting",
                    "author": "ewwitsjessagain",
                    "id": "gugj0f4",
                    "parent_id": "t1_gug2rni",
                    "score": 4,
                    "created_utc": 1618379579.0,
                    "replies": []
                },
                {
                    "body": "This. \n\nAlso, someone please tell me what “sth” is supposed to mean. 🤨 please.",
                    "author": "tattoosandtail",
                    "id": "guhee62",
                    "parent_id": "t1_gug2rni",
                    "score": 3,
                    "created_utc": 1618405536.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "guhf08q",
                            "parent_id": "t1_guhee62",
                            "score": 3,
                            "created_utc": 1618405869.0,
                            "replies": [
                                {
                                    "body": "🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️",
                                    "author": "tattoosandtail",
                                    "id": "guhkvjp",
                                    "parent_id": "t1_guhf08q",
                                    "score": 2,
                                    "created_utc": 1618408806.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gugn8or",
                    "parent_id": "t1_gug2rni",
                    "score": 1,
                    "created_utc": 1618383124.0,
                    "replies": [
                        {
                            "body": "Honestly, it might seem petty (maybe it's cultural?) but, for an advice piece, this was written in a very jarring and juvenile style. I found it hard to take OP, or the points that OP made, seriously.",
                            "author": "ewwitsjessagain",
                            "id": "gugseoi",
                            "parent_id": "t1_gugn8or",
                            "score": 6,
                            "created_utc": 1618387973.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "guh3t2a",
            "parent_id": "t3_mq8ahq",
            "score": 2,
            "created_utc": 1618398730.0,
            "replies": [
                {
                    "body": "Everything can be impressive while put in the right context so I did not mean too judge anyone. I was more trying to find people I would like to became and learn from them. I didn't care that much about money",
                    "author": null,
                    "id": "gulfqq3",
                    "parent_id": "t1_guh3t2a",
                    "score": 2,
                    "created_utc": 1618487915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "guftkk9",
            "parent_id": "t3_mq8ahq",
            "score": 1,
            "created_utc": 1618363782.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gug6zro",
                    "parent_id": "t1_guftkk9",
                    "score": 4,
                    "created_utc": 1618371130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a quality post!  Especially #4 of your first set of bullets - very wise of you to observe and take lessons from that unique part of the lifestyle - cheers!",
            "author": null,
            "id": "guevto4",
            "parent_id": "t3_mq8ahq",
            "score": 1,
            "created_utc": 1618346684.0,
            "replies": []
        },
        {
            "body": "Ok so OP, I have a question after reading your post, what do you consider 'impressive careers'? I'm very curious what that means, I guess it's something different for different girls? Are there careers men have that are universally agreed to be 'better'? Obviously a lawyer doesn't impress you, fair enough, but what does?",
            "author": "RockyLeal",
            "id": "guh114y",
            "parent_id": "t3_mq8ahq",
            "score": 1,
            "created_utc": 1618396409.0,
            "replies": [
                {
                    "body": "I am not the one to judge in general as depending on a situation even a simple thing can be impressive. When I said there is a lot of bankers and lawyers I mean it's cool in that generation but what I saw at my uni or among my peers is that many wants to be banker or lawyer and as it was good in the past or still is but I think that in the future demand for those will be much lower (as many banks or that kind of institutions are too big and too old to be efficient or at least I saw very questionable things and ways to do things while working there). Also, in my uni or at the time I knew many ppl in investment banks and law firms so at some point I wanted to meet people who did things differently.\n\nI respect all the professions and know we need them all (or most), but I was more into looking for people who did something what I found inspiring/ significant in therms of business or any field they are at. I know it is a minority and I don't think that career sucess makes anyone a better person but idk it's just more interesting for me. I just like meeting people with unusual but interesing views about the future or technology or any field they are into.\n\n Also, the career thing is not the most imporant in dating, just was a bit of my interest since I was trying to figure out what I want to do and how to do it.",
                    "author": null,
                    "id": "guh2jci",
                    "parent_id": "t1_guh114y",
                    "score": 0,
                    "created_utc": 1618397696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What’s SA pls?",
            "author": "janefr02",
            "id": "guf7ay0",
            "parent_id": "t3_mq8ahq",
            "score": -7,
            "created_utc": 1618352294.0,
            "replies": [
                {
                    "body": "Seeking arrangements\n\nEdit : I definitely meant seeking but I’ve been so exhausted from work that I just typed out seeking and it autocorrected to secret for some reason and I didn’t know ! Lol",
                    "author": "Binab2020",
                    "id": "gufw5wz",
                    "parent_id": "t1_guf7ay0",
                    "score": 0,
                    "created_utc": 1618365118.0,
                    "replies": [
                        {
                            "body": "Isn’t it “seeking”?",
                            "author": null,
                            "id": "gug2bor",
                            "parent_id": "t1_gufw5wz",
                            "score": 1,
                            "created_utc": 1618368426.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i loved reading this post! you seem so thoughtful and genuine :) 💕 thanks for sharing 🤗",
            "author": "searchfete",
            "id": "gug66wj",
            "parent_id": "t3_mq8ahq",
            "score": 1,
            "created_utc": 1618370649.0,
            "replies": [
                {
                    "body": "Thank you :))",
                    "author": null,
                    "id": "gugpu11",
                    "parent_id": "t1_gug66wj",
                    "score": 2,
                    "created_utc": 1618385468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a high quality post. Thank you for being brave enough to write this down. It's also refreshing to hear such a very unfiltered perspective. \n\nWhile there are some folks in the comment section here who may disagree, I feel generally SDs are guilty of playing into a specific archetype, which prevents us from remembering to listen more, myself included.",
            "author": "415proton",
            "id": "gughavf",
            "parent_id": "t3_mq8ahq",
            "score": 1,
            "created_utc": 1618378198.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gvl1o0x",
            "parent_id": "t3_mq8ahq",
            "score": 1,
            "created_utc": 1619196273.0,
            "replies": []
        },
        {
            "body": "Hahaha I just laughed so hard at this",
            "author": "Binab2020",
            "id": "gufw22c",
            "parent_id": "t1_gufbred",
            "score": 9,
            "created_utc": 1618365063.0,
            "replies": []
        },
        {
            "body": "Many of my colleagues would really appreciate such referrals actually.",
            "author": "Ideal_Jerk",
            "id": "gugohpe",
            "parent_id": "t1_gufbred",
            "score": 8,
            "created_utc": 1618384233.0,
            "replies": []
        },
        {
            "body": "A SD is best served by keeping his career and sugar life at safe distances.",
            "author": null,
            "id": "guhjr1l",
            "parent_id": "t1_gufbred",
            "score": 6,
            "created_utc": 1618408268.0,
            "replies": []
        },
        {
            "body": "I used to have an in with an Ivy League college previously that I leveraged the hell out of for my sugar purposes. You have to be very smart about those things though, the SB still have to be an honors+ student to have anywhere near a shot.\n\n\nSadly (for me) Operation Varsity Blues made colleges super restrictive of any admissions other than straight front door or whale legacy. Refferals aren't cutting it anymore.",
            "author": "KeyToGramercy",
            "id": "gugvufz",
            "parent_id": "t1_gufbred",
            "score": 4,
            "created_utc": 1618391412.0,
            "replies": [
                {
                    "body": "An in with an Ivy and a key to Gramercy Park - my man, you are living the dream!",
                    "author": null,
                    "id": "gugz9sz",
                    "parent_id": "t1_gugvufz",
                    "score": 6,
                    "created_utc": 1618394785.0,
                    "replies": [
                        {
                            "body": "From 5 years on this forum you're the first to catch the reference. A man of culture.",
                            "author": "KeyToGramercy",
                            "id": "guhzo5v",
                            "parent_id": "t1_gugz9sz",
                            "score": 5,
                            "created_utc": 1618415429.0,
                            "replies": [
                                {
                                    "body": "come to Boston and I'll meet you in Louisburg Square",
                                    "author": null,
                                    "id": "guixhlv",
                                    "parent_id": "t1_guhzo5v",
                                    "score": 2,
                                    "created_utc": 1618430180.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This seriously made me LOL. 😂😂😂",
            "author": "FoxyFreckles1989",
            "id": "gug9jb6",
            "parent_id": "t1_gufbred",
            "score": 3,
            "created_utc": 1618372737.0,
            "replies": []
        },
        {
            "body": "Ive met girls in SA that I would ABSOLUTELY recommend to any high end academic institution. What the fuck does having had sex with her have to do with her intellect.",
            "author": "RockyLeal",
            "id": "guh0mfc",
            "parent_id": "t1_gufbred",
            "score": 5,
            "created_utc": 1618396036.0,
            "replies": [
                {
                    "body": "It doesn’t lol.",
                    "author": "supermarket_Ba",
                    "id": "guhm30r",
                    "parent_id": "t1_guh0mfc",
                    "score": 0,
                    "created_utc": 1618409386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a very good point. I was using SA almost only in London, however, I met people from very different nationalites/backgrouds. I did not see any large cultural differences in terms of how dates looked like, but it's probably because most of men lived and worked here at least a couple of years.",
            "author": null,
            "id": "guerebg",
            "parent_id": "t1_gueqcw0",
            "score": 10,
            "created_utc": 1618344694.0,
            "replies": []
        },
        {
            "body": "Deserves to be carved in stone",
            "author": "pinotandsugar",
            "id": "gufv7jr",
            "parent_id": "t1_guemrf1",
            "score": 3,
            "created_utc": 1618364627.0,
            "replies": []
        },
        {
            "body": "Thank you x",
            "author": null,
            "id": "guep54z",
            "parent_id": "t1_guemrf1",
            "score": 1,
            "created_utc": 1618343664.0,
            "replies": []
        },
        {
            "body": "There are a few reasons.\n\n1. I am focusing more on work/ projects so don't have too much time. \n2. It always takes me a few meets before I meet someone I actually like and want to be seeing so it requires energy\n3. I feel like I met different kinds of SDs and I had my lessons/experiences.\n4. There is still a covid thing going on so possibilities are limited \n\nAlso, there is just time for anything in life to come and go :)",
            "author": null,
            "id": "guep3t0",
            "parent_id": "t1_guejrm5",
            "score": 16,
            "created_utc": 1618343648.0,
            "replies": [
                {
                    "body": "This is the best list I think I've ever seen for leaving the bowl. You had the experience, you gained from it, and you are ready to move on.  \n\nWishing you great success in your life moving forward.",
                    "author": null,
                    "id": "gugzd4d",
                    "parent_id": "t1_guep3t0",
                    "score": 2,
                    "created_utc": 1618394874.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most of my meetings were one or two time but I met about 5 guys I was seeing for longer. \nI'm sure that it's possible to get good career advice from SD but I was always sceptical towards any career advice because they were very different and based on someone's subjective experience and also I just always knew more less what I want to do. Also I got some interns offers or some SDs that said that they could invest in one of my projects but I never eneded up taking any of that. Not because of any moral values but rather the situation or the thing that I wanted to do things my own way or I just had some examples in my environment where mixing relationship with businiess had often not the best outcomes. \n\nWould I do it again? Well, I don't regret doing it at the time. I met some interesting people had some great time and learned some things from it. Also, I met many people I wouldn't have met otherwise. \nHowever, if I could tell sth to myslef younger knowing what I know now I wouold say to myself to take a uni loan (the reason why I joined SA on the first place was finnancial), learn more about my interests, do more netwroing and work more on my projects instead of dating. At the time I could not know anything for certain and I was always scpetical to loans so did not want to risk. \nAlso, it's hard for me to say what role SA really played in my life. I met especially one guy who was a quite successful entrepreneur and talking to him gave me a really good perspective on things and knowleadge. It also impressed me how much can one person do. The fact that he thought I am similar to him made me belive in myself more which helped me a lot.\nThe other things was some of my SDs I talked to were some kind of investors and I realised how often they invest not really undestaning (or even trying to understand) the concept or science behind business but more based on general trends or the way project is presented which was also a good thing to know.\nIn the future I don't think I will do that again as I'm looking for more long term relationship and I don't care about finnancial side of it.",
            "author": null,
            "id": "gulf777",
            "parent_id": "t1_guhfzg6",
            "score": 2,
            "created_utc": 1618487545.0,
            "replies": [
                {
                    "body": "Fair enough, thanks for the response!  The key to career advice is finding someone who knows that industry well.  I work in software and unfortunately I’d get half my POT from a nearby medical school and I had no idea what advice to offer medical students and told them that when they asked lol.  In order to invest with someone I’d need to know them for a while.  Wouldn’t consider it until at least 6 months or more into it and again it had to be a solid idea and the girl had to have a good work ethic.  2 of my investments are still ongoing and have worked out well to this day but most didn’t make it but that’s typical of startups anyway.  You are right though, I always find it amazing how many people would invest in things with little or no knowledge.",
                    "author": "RedHeavyG603",
                    "id": "gulg5k2",
                    "parent_id": "t1_gulf777",
                    "score": 1,
                    "created_utc": 1618488197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was shocked by this myself when I first got a job after college at a large company. People don’t really know what they’re doing but they’re successful",
            "author": null,
            "id": "gug28ix",
            "parent_id": "t1_gufducx",
            "score": 4,
            "created_utc": 1618368378.0,
            "replies": []
        },
        {
            "body": "Many people don’t realize how much luck comes into play to be successful. So they think they are doing something right but I think most are just blundering around.",
            "author": "ama_nigerian_prince",
            "id": "gufxc5j",
            "parent_id": "t1_gufducx",
            "score": 3,
            "created_utc": 1618365733.0,
            "replies": []
        },
        {
            "body": "Neither will I! Nice to see other SBs with the same boundary",
            "author": null,
            "id": "gufxuvp",
            "parent_id": "t1_gufvczf",
            "score": 5,
            "created_utc": 1618366006.0,
            "replies": []
        },
        {
            "body": "She does not know :)",
            "author": null,
            "id": "gui9g54",
            "parent_id": "t1_gugxuod",
            "score": 0,
            "created_utc": 1618419664.0,
            "replies": []
        },
        {
            "body": "I think it usually doesn't matter at all, but I was trying to figure out how the world works so it mattered for me.",
            "author": null,
            "id": "gulfgwa",
            "parent_id": "t1_guhrve5",
            "score": 1,
            "created_utc": 1618487728.0,
            "replies": []
        },
        {
            "body": "I agree. I feel the OP hasn't done enough self-reflection. I mean to have 30 m&g with \"many as one-offs\" there must have been several red flags that cause many of these guys to keep OP in the POT category. \n\nOP was only impressed by a **minority** of what these SD POTs did. I'd like to know what she expected to find.....an F1 driver *(Lewis Hamilton for the UK reference)?* Maybe, a Space Shuttle astronaut? Idris Elba inviting her to a M&G at one of his DJ shows? \n\nThere is no critical self-assessment, just regular complaints we see in all the other SB posts about crappy experiences. \n\nOP, hope I'm not being overly critical, but I'd be curious to know how far did your longest arrangement go? (i.e. 2 dates, 3 months, 1 year?",
            "author": "pfc_6ixgodconsumer",
            "id": "gugl2f2",
            "parent_id": "t1_gugeuq1",
            "score": 4,
            "created_utc": 1618381259.0,
            "replies": [
                {
                    "body": "The bowl just isn't for everyone.  Both sides have people who have unrealistic expectations.",
                    "author": "wb19081908",
                    "id": "gugm1nx",
                    "parent_id": "t1_gugl2f2",
                    "score": 3,
                    "created_utc": 1618382091.0,
                    "replies": []
                },
                {
                    "body": "Usually I was not interested to meet again, vey rarely the other way just because I did not feel connection or interest. I do have high expectations not financial but generally about people’s interests and what they do because otherwise I got bored quickly. It is definitely my perception of life and dating and I am totally fine that it goes with one off meetings as I think it is better to meet someone I am not sure about once over than waste more time on it. I met some great people I had longer arrangements with and it was wonderful in any aspect of it that lasted for a couple of months because I was also traveling out of London for some time so it usually ended naturally because of geographic reasons \nThe point I wanted to make is also not to agree on the first person you meet but to seek what truly workers the best. I don’t mean to complain, more to share thoughts that would be helpful for me to know when I started.",
                    "author": null,
                    "id": "gugpsuf",
                    "parent_id": "t1_gugl2f2",
                    "score": 0,
                    "created_utc": 1618385436.0,
                    "replies": [
                        {
                            "body": "You have a right to have high expectations! Great that you were able to find some great people through your process.",
                            "author": null,
                            "id": "gugz3mf",
                            "parent_id": "t1_gugpsuf",
                            "score": 2,
                            "created_utc": 1618394626.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed. Some good points but a lot of it sounds pretentious af.",
            "author": "slfsd20201",
            "id": "guh05rj",
            "parent_id": "t1_gugeuq1",
            "score": 2,
            "created_utc": 1618395617.0,
            "replies": []
        },
        {
            "body": "Hahaha somebody had to do it! It was so distracting",
            "author": "ewwitsjessagain",
            "id": "gugj0f4",
            "parent_id": "t1_gug2rni",
            "score": 4,
            "created_utc": 1618379579.0,
            "replies": []
        },
        {
            "body": "This. \n\nAlso, someone please tell me what “sth” is supposed to mean. 🤨 please.",
            "author": "tattoosandtail",
            "id": "guhee62",
            "parent_id": "t1_gug2rni",
            "score": 3,
            "created_utc": 1618405536.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "guhf08q",
                    "parent_id": "t1_guhee62",
                    "score": 3,
                    "created_utc": 1618405869.0,
                    "replies": [
                        {
                            "body": "🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️",
                            "author": "tattoosandtail",
                            "id": "guhkvjp",
                            "parent_id": "t1_guhf08q",
                            "score": 2,
                            "created_utc": 1618408806.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gugn8or",
            "parent_id": "t1_gug2rni",
            "score": 1,
            "created_utc": 1618383124.0,
            "replies": [
                {
                    "body": "Honestly, it might seem petty (maybe it's cultural?) but, for an advice piece, this was written in a very jarring and juvenile style. I found it hard to take OP, or the points that OP made, seriously.",
                    "author": "ewwitsjessagain",
                    "id": "gugseoi",
                    "parent_id": "t1_gugn8or",
                    "score": 6,
                    "created_utc": 1618387973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everything can be impressive while put in the right context so I did not mean too judge anyone. I was more trying to find people I would like to became and learn from them. I didn't care that much about money",
            "author": null,
            "id": "gulfqq3",
            "parent_id": "t1_guh3t2a",
            "score": 2,
            "created_utc": 1618487915.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gug6zro",
            "parent_id": "t1_guftkk9",
            "score": 4,
            "created_utc": 1618371130.0,
            "replies": []
        },
        {
            "body": "I am not the one to judge in general as depending on a situation even a simple thing can be impressive. When I said there is a lot of bankers and lawyers I mean it's cool in that generation but what I saw at my uni or among my peers is that many wants to be banker or lawyer and as it was good in the past or still is but I think that in the future demand for those will be much lower (as many banks or that kind of institutions are too big and too old to be efficient or at least I saw very questionable things and ways to do things while working there). Also, in my uni or at the time I knew many ppl in investment banks and law firms so at some point I wanted to meet people who did things differently.\n\nI respect all the professions and know we need them all (or most), but I was more into looking for people who did something what I found inspiring/ significant in therms of business or any field they are at. I know it is a minority and I don't think that career sucess makes anyone a better person but idk it's just more interesting for me. I just like meeting people with unusual but interesing views about the future or technology or any field they are into.\n\n Also, the career thing is not the most imporant in dating, just was a bit of my interest since I was trying to figure out what I want to do and how to do it.",
            "author": null,
            "id": "guh2jci",
            "parent_id": "t1_guh114y",
            "score": 0,
            "created_utc": 1618397696.0,
            "replies": []
        },
        {
            "body": "Seeking arrangements\n\nEdit : I definitely meant seeking but I’ve been so exhausted from work that I just typed out seeking and it autocorrected to secret for some reason and I didn’t know ! Lol",
            "author": "Binab2020",
            "id": "gufw5wz",
            "parent_id": "t1_guf7ay0",
            "score": 0,
            "created_utc": 1618365118.0,
            "replies": [
                {
                    "body": "Isn’t it “seeking”?",
                    "author": null,
                    "id": "gug2bor",
                    "parent_id": "t1_gufw5wz",
                    "score": 1,
                    "created_utc": 1618368426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you :))",
            "author": null,
            "id": "gugpu11",
            "parent_id": "t1_gug66wj",
            "score": 2,
            "created_utc": 1618385468.0,
            "replies": []
        },
        {
            "body": "An in with an Ivy and a key to Gramercy Park - my man, you are living the dream!",
            "author": null,
            "id": "gugz9sz",
            "parent_id": "t1_gugvufz",
            "score": 6,
            "created_utc": 1618394785.0,
            "replies": [
                {
                    "body": "From 5 years on this forum you're the first to catch the reference. A man of culture.",
                    "author": "KeyToGramercy",
                    "id": "guhzo5v",
                    "parent_id": "t1_gugz9sz",
                    "score": 5,
                    "created_utc": 1618415429.0,
                    "replies": [
                        {
                            "body": "come to Boston and I'll meet you in Louisburg Square",
                            "author": null,
                            "id": "guixhlv",
                            "parent_id": "t1_guhzo5v",
                            "score": 2,
                            "created_utc": 1618430180.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It doesn’t lol.",
            "author": "supermarket_Ba",
            "id": "guhm30r",
            "parent_id": "t1_guh0mfc",
            "score": 0,
            "created_utc": 1618409386.0,
            "replies": []
        },
        {
            "body": "This is the best list I think I've ever seen for leaving the bowl. You had the experience, you gained from it, and you are ready to move on.  \n\nWishing you great success in your life moving forward.",
            "author": null,
            "id": "gugzd4d",
            "parent_id": "t1_guep3t0",
            "score": 2,
            "created_utc": 1618394874.0,
            "replies": []
        },
        {
            "body": "Fair enough, thanks for the response!  The key to career advice is finding someone who knows that industry well.  I work in software and unfortunately I’d get half my POT from a nearby medical school and I had no idea what advice to offer medical students and told them that when they asked lol.  In order to invest with someone I’d need to know them for a while.  Wouldn’t consider it until at least 6 months or more into it and again it had to be a solid idea and the girl had to have a good work ethic.  2 of my investments are still ongoing and have worked out well to this day but most didn’t make it but that’s typical of startups anyway.  You are right though, I always find it amazing how many people would invest in things with little or no knowledge.",
            "author": "RedHeavyG603",
            "id": "gulg5k2",
            "parent_id": "t1_gulf777",
            "score": 1,
            "created_utc": 1618488197.0,
            "replies": []
        },
        {
            "body": "The bowl just isn't for everyone.  Both sides have people who have unrealistic expectations.",
            "author": "wb19081908",
            "id": "gugm1nx",
            "parent_id": "t1_gugl2f2",
            "score": 3,
            "created_utc": 1618382091.0,
            "replies": []
        },
        {
            "body": "Usually I was not interested to meet again, vey rarely the other way just because I did not feel connection or interest. I do have high expectations not financial but generally about people’s interests and what they do because otherwise I got bored quickly. It is definitely my perception of life and dating and I am totally fine that it goes with one off meetings as I think it is better to meet someone I am not sure about once over than waste more time on it. I met some great people I had longer arrangements with and it was wonderful in any aspect of it that lasted for a couple of months because I was also traveling out of London for some time so it usually ended naturally because of geographic reasons \nThe point I wanted to make is also not to agree on the first person you meet but to seek what truly workers the best. I don’t mean to complain, more to share thoughts that would be helpful for me to know when I started.",
            "author": null,
            "id": "gugpsuf",
            "parent_id": "t1_gugl2f2",
            "score": 0,
            "created_utc": 1618385436.0,
            "replies": [
                {
                    "body": "You have a right to have high expectations! Great that you were able to find some great people through your process.",
                    "author": null,
                    "id": "gugz3mf",
                    "parent_id": "t1_gugpsuf",
                    "score": 2,
                    "created_utc": 1618394626.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "guhf08q",
            "parent_id": "t1_guhee62",
            "score": 3,
            "created_utc": 1618405869.0,
            "replies": [
                {
                    "body": "🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️",
                    "author": "tattoosandtail",
                    "id": "guhkvjp",
                    "parent_id": "t1_guhf08q",
                    "score": 2,
                    "created_utc": 1618408806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, it might seem petty (maybe it's cultural?) but, for an advice piece, this was written in a very jarring and juvenile style. I found it hard to take OP, or the points that OP made, seriously.",
            "author": "ewwitsjessagain",
            "id": "gugseoi",
            "parent_id": "t1_gugn8or",
            "score": 6,
            "created_utc": 1618387973.0,
            "replies": []
        },
        {
            "body": "Isn’t it “seeking”?",
            "author": null,
            "id": "gug2bor",
            "parent_id": "t1_gufw5wz",
            "score": 1,
            "created_utc": 1618368426.0,
            "replies": []
        },
        {
            "body": "From 5 years on this forum you're the first to catch the reference. A man of culture.",
            "author": "KeyToGramercy",
            "id": "guhzo5v",
            "parent_id": "t1_gugz9sz",
            "score": 5,
            "created_utc": 1618415429.0,
            "replies": [
                {
                    "body": "come to Boston and I'll meet you in Louisburg Square",
                    "author": null,
                    "id": "guixhlv",
                    "parent_id": "t1_guhzo5v",
                    "score": 2,
                    "created_utc": 1618430180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a right to have high expectations! Great that you were able to find some great people through your process.",
            "author": null,
            "id": "gugz3mf",
            "parent_id": "t1_gugpsuf",
            "score": 2,
            "created_utc": 1618394626.0,
            "replies": []
        },
        {
            "body": "🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️",
            "author": "tattoosandtail",
            "id": "guhkvjp",
            "parent_id": "t1_guhf08q",
            "score": 2,
            "created_utc": 1618408806.0,
            "replies": []
        },
        {
            "body": "come to Boston and I'll meet you in Louisburg Square",
            "author": null,
            "id": "guixhlv",
            "parent_id": "t1_guhzo5v",
            "score": 2,
            "created_utc": 1618430180.0,
            "replies": []
        }
    ]
}