{
    "title": "“I don’t want this to be transactional”",
    "post_id": "d1v8bi",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/d1v8bi/i_dont_want_this_to_be_transactional/",
    "author": null,
    "body": "...okay but it IS a transaction? Everything about human nature screams transaction. I’m a very gentle and kind person but even when I do nice things for others I’m getting something out of it, even if it’s just intrinsic reward. I find it very irritating when POT refuse to talk details because they don’t want to think about the transaction. There will be a transaction involved, and that’s totally okay! That’s why we’re here, yeah? It doesn’t make either of us less of a person, it’s just a non traditional relationship that’s mutually beneficial!!!\nRant over.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/d1v8bi/i_dont_want_this_to_be_transactional/",
    "score": 163,
    "upvote_ratio": 0.96,
    "created_utc": 1568055234.0,
    "num_comments": 84,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You have two really great options-\n\nBlock anyone who says that. You will never see a dime from them. They are scammers. \n\nOr my favorite-\n\n“Omg I totally agree! It’s like none of these men want to help me financially unless I have sex with them! To avoid the transactional nature I think it would be great for you to just help me with my current past due bills and then we can slowly get to know each other.”\n\n😂",
            "author": "MsDReid",
            "id": "ezqc814",
            "parent_id": "t3_d1v8bi",
            "score": 179,
            "created_utc": 1568057388.0,
            "replies": [
                {
                    "body": "Hahahaha omgggg I cannot IMAGINE how that conversation would go down",
                    "author": null,
                    "id": "ezqfaqv",
                    "parent_id": "t1_ezqc814",
                    "score": 41,
                    "created_utc": 1568058484.0,
                    "replies": [
                        {
                            "body": "It happens all the time. Girls that ask for money in advance for some \"emergency\" or to \"prove you're real\" is the flip side of guys that \"dont want this to feel like a transaction\"  I'm sure there are real people on both sides, but the number of scammers is so high you have to assume they're all scammers.",
                            "author": "willfromvb",
                            "id": "ezqux93",
                            "parent_id": "t1_ezqfaqv",
                            "score": 15,
                            "created_utc": 1568064256.0,
                            "replies": [
                                {
                                    "body": "Will,\n\nI think that it was clear in this post that this was in response to a man who is trying to trick/scam a girl into sleeping with him for free. A girl that says this to a scammer isn’t scamming. She’s just turning his own con against him:)",
                                    "author": "MsDReid",
                                    "id": "ezrg9z6",
                                    "parent_id": "t1_ezqux93",
                                    "score": 20,
                                    "created_utc": 1568073444.0,
                                    "replies": [
                                        {
                                            "body": "I understand and agree. \n\nI'm just suggesting you can expose (and have fun with) scammers by agreeing with them and proposing the opposite scam.  If a girl proposes that I need to \"prove myself\" prior to sex, I suggest they \"prove themsleves\" prior to an allowance.  I dont actually expect them to accept my offer!  Lol\n\nI dont consider messing with scammers as being a scammer yourself.   It's more like a hobby!  Lol",
                                            "author": "willfromvb",
                                            "id": "ezrpi0n",
                                            "parent_id": "t1_ezrg9z6",
                                            "score": 4,
                                            "created_utc": 1568077017.0,
                                            "replies": [
                                                {
                                                    "body": "Yes it’s my favorite lol! Super entertaining. I also know that as long as they are wasting time with me it’s less time they have to mess with someone else.",
                                                    "author": "MsDReid",
                                                    "id": "ezrsgyn",
                                                    "parent_id": "t1_ezrpi0n",
                                                    "score": 2,
                                                    "created_utc": 1568078163.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Cardinal rule of a good life ........  don't let assholes live rent free in your brain.  Dismiss and move on...............",
                                                    "author": "pinotandsugar",
                                                    "id": "ezs89xj",
                                                    "parent_id": "t1_ezrpi0n",
                                                    "score": 1,
                                                    "created_utc": 1568084659.0,
                                                    "replies": [
                                                        {
                                                            "body": "I find them entertaining:)",
                                                            "author": "MsDReid",
                                                            "id": "ezsdfcq",
                                                            "parent_id": "t1_ezs89xj",
                                                            "score": 3,
                                                            "created_utc": 1568087921.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                                                                    "author": "willfromvb",
                                                                    "id": "ezspu1s",
                                                                    "parent_id": "t1_ezsdfcq",
                                                                    "score": 2,
                                                                    "created_utc": 1568102751.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Always turn their excuses back on them!",
                    "author": null,
                    "id": "ezqn6oz",
                    "parent_id": "t1_ezqc814",
                    "score": 8,
                    "created_utc": 1568061496.0,
                    "replies": []
                },
                {
                    "body": "Saving this comment to use down the road. 😂😂",
                    "author": "soullessfreckles",
                    "id": "ezqkfkv",
                    "parent_id": "t1_ezqc814",
                    "score": 10,
                    "created_utc": 1568060436.0,
                    "replies": []
                },
                {
                    "body": "Or even simpler .......\n\nYou are so right,  we can keep this non transactional ,   a $5,000  gift certificate (insert name of choice ) will get our discussions off on a perfectly non transactional basis.",
                    "author": "pinotandsugar",
                    "id": "ezs85kx",
                    "parent_id": "t1_ezqc814",
                    "score": 3,
                    "created_utc": 1568084596.0,
                    "replies": []
                },
                {
                    "body": "This is great..",
                    "author": "shouldmakesure",
                    "id": "ezqgcyj",
                    "parent_id": "t1_ezqc814",
                    "score": 4,
                    "created_utc": 1568058853.0,
                    "replies": []
                },
                {
                    "body": "Deja Vu 🤣🤣🤣🤣",
                    "author": "Dax_NZ",
                    "id": "ezr5g3b",
                    "parent_id": "t1_ezqc814",
                    "score": 1,
                    "created_utc": 1568069022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezq8nus",
            "parent_id": "t3_d1v8bi",
            "score": 33,
            "created_utc": 1568056138.0,
            "replies": [
                {
                    "body": "Either that or \"but I don't pay for sex\". They don't realize that all guys pay for sex in one way or another, just like all women have used sex to get their way at least once.",
                    "author": "shouldmakesure",
                    "id": "ezqg7x8",
                    "parent_id": "t1_ezq8nus",
                    "score": 9,
                    "created_utc": 1568058803.0,
                    "replies": [
                        {
                            "body": "> just like all women have used sex to get their way at least once.\n\nThis is a little tmi/crude, but I have a friend who talks her husband into giving her shoulder massages by trading BJs. 🤷 I've heard of girls doing anal for special circumstances/trades to (in a purely vanilla relationship). It definitely does happen.",
                            "author": "2catsandacomputer",
                            "id": "ezstbqi",
                            "parent_id": "t1_ezqg7x8",
                            "score": 2,
                            "created_utc": 1568108549.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“ I agree that it can get awkward so if you just Venmo me my weekly allowance on Monday morning then we are both free to just enjoy each other without any underlying financial stress.",
            "author": "LotBuilder",
            "id": "ezqiqqu",
            "parent_id": "t3_d1v8bi",
            "score": 33,
            "created_utc": 1568059790.0,
            "replies": []
        },
        {
            "body": "So I went to a Mercedes dealer and said I really liked one model - it was elegant and built with quality. So the dealer said I could have it for $78,000. I said that I admired it but didn't want things to be transactional, which was too crude compared to the glowing engineering and aesthetic quality of the car. Why bring this down to the level of a crass transaction?\n\nSo he kicked my ass out of the dealership and told me to take a bus",
            "author": "doctorcoolpop",
            "id": "ezrctgw",
            "parent_id": "t3_d1v8bi",
            "score": 23,
            "created_utc": 1568071950.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezq713y",
            "parent_id": "t3_d1v8bi",
            "score": 44,
            "created_utc": 1568055580.0,
            "replies": [
                {
                    "body": "Omg YES. So well said.",
                    "author": null,
                    "id": "ezqbgfj",
                    "parent_id": "t1_ezq713y",
                    "score": 4,
                    "created_utc": 1568057123.0,
                    "replies": []
                },
                {
                    "body": "hol up?  you mean, you don't want to be an island hopper?   You don't accept euros?",
                    "author": "Academic_Set",
                    "id": "ezq8jrb",
                    "parent_id": "t1_ezq713y",
                    "score": 0,
                    "created_utc": 1568056100.0,
                    "replies": []
                },
                {
                    "body": "Right because everyone that wants to be more than just a John is a dead beat..  cool \n\nIf being a John is your gig, awesome.. Own it but you don't represent all SDs..  \n\nIf the original poster wants to focus on a SW career, her right.  Some would say she is missing on the larger picture but this is true capitalism.",
                    "author": "TXPolyDaddy",
                    "id": "ezqi8bc",
                    "parent_id": "t1_ezq713y",
                    "score": -12,
                    "created_utc": 1568059601.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ezrkf6j",
                            "parent_id": "t1_ezqi8bc",
                            "score": 13,
                            "created_utc": 1568075127.0,
                            "replies": [
                                {
                                    "body": "Saying \"next that dude\" and the rest of your opener are shit advice.  There are more than a few real SDs that prefer something deeper, or at least the illusion of it.   No worries it is the same shit advice the SWs give to newbies.\n\nHad my newbie SB taken that advice we would have never met and given she has stayed 19 months I think she's okay with non transactional.",
                                    "author": "TXPolyDaddy",
                                    "id": "ezro7v4",
                                    "parent_id": "t1_ezrkf6j",
                                    "score": -7,
                                    "created_utc": 1568076559.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That. And also, what's up with the whole \"experience daddy\". Sure I'd love to just go to another country/city every few weeks, but if you're not going to help me with bills, I have to work, if I have to work I can't be on Malibu/Rome/Paris with you. \nMaybe I'm an ass about this but why would I choose you if I can have a SUGAR daddy, who is able to offer me vacations AND support?",
            "author": null,
            "id": "ezso997",
            "parent_id": "t3_d1v8bi",
            "score": 10,
            "created_utc": 1568100287.0,
            "replies": []
        },
        {
            "body": "POT refuse to talk details because they don’t want to think about the transaction.\n\nC'mon -you know that means they want your pussy for free. Exit stage right the minute you see those words scroll across the screen.",
            "author": "GSSD",
            "id": "ezqrdc6",
            "parent_id": "t3_d1v8bi",
            "score": 19,
            "created_utc": 1568063018.0,
            "replies": [
                {
                    "body": "Come on, you know there’s No such thing as free pussy. That’s a fairy tale like Santa and the Easter Bunny 😂",
                    "author": "ruphun",
                    "id": "ezqs61u",
                    "parent_id": "t1_ezqrdc6",
                    "score": 4,
                    "created_utc": 1568063305.0,
                    "replies": [
                        {
                            "body": "LOL -true that. But these guys don't want to do the down payment",
                            "author": "GSSD",
                            "id": "ezqsdmu",
                            "parent_id": "t1_ezqs61u",
                            "score": 5,
                            "created_utc": 1568063378.0,
                            "replies": [
                                {
                                    "body": "i don’t mind the down payment. But that ballon payment at the end can be a real b*tch. I guess they haven’t figured out that in the long run it’s  cheaper to lease then it is to buy 😂",
                                    "author": "ruphun",
                                    "id": "ezqt9gm",
                                    "parent_id": "t1_ezqsdmu",
                                    "score": 1,
                                    "created_utc": 1568063697.0,
                                    "replies": [
                                        {
                                            "body": "And you wonder why some posters think you're a John.",
                                            "author": "2catsandacomputer",
                                            "id": "ezstfde",
                                            "parent_id": "t1_ezqt9gm",
                                            "score": 2,
                                            "created_utc": 1568108705.0,
                                            "replies": [
                                                {
                                                    "body": "are you just here to bust my balls? 😈\n\nIm not sure what you’re talking about or why you or any posters would think I’m a John. Im the one that typically gets chastised here for calling out people that treat SR like sex work. I’m a proponent of SR being real relationships with a sugar element..\n\nNow all of a sudden I’ve gone from being the poster guy for traditional sugar relationships to being a transactional John treating SR like sexy work.? \n\nNot to mention my comment was referring to SR being like a lease, whereas  marriage which often ends with divorce having a balloon payment at the end 🤯",
                                                    "author": "ruphun",
                                                    "id": "ezt1l5u",
                                                    "parent_id": "t1_ezstfde",
                                                    "score": -1,
                                                    "created_utc": 1568118491.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Bunny's not real?",
                            "author": "NYDancesInGermany",
                            "id": "ezsf3pq",
                            "parent_id": "t1_ezqs61u",
                            "score": 1,
                            "created_utc": 1568089473.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This and experience SDs are the equivalent of women looking for platonic and online only.  \n\nwhile it's possible to find, more than likely most people aren't looking for any of this",
            "author": "saltgrindr",
            "id": "ezqfknr",
            "parent_id": "t3_d1v8bi",
            "score": 9,
            "created_utc": 1568058579.0,
            "replies": []
        },
        {
            "body": "Your message is laced with condemnation, so thanks for that, straight up. If you genuinely cared to ask my situation, yes I have a low paying job. I studied social work and am now a therapist for special needs children which is rewarding but low pay. In addition, I’m still learning how to manage my money well. \nI don’t know what else you were looking for in your comment. Do you think you’re above everyone else because you don’t do PPM? Cool beans! Good for you bro!",
            "author": null,
            "id": "ezqjop4",
            "parent_id": "t3_d1v8bi",
            "score": 23,
            "created_utc": 1568060157.0,
            "replies": [
                {
                    "body": "I can tell who you meant to reply to, but you replied to your thread instead of him just so you know",
                    "author": "miuxiu",
                    "id": "ezqqv6e",
                    "parent_id": "t1_ezqjop4",
                    "score": 8,
                    "created_utc": 1568062831.0,
                    "replies": [
                        {
                            "body": "Oh, thank you. Sometimes I still don’t know how to Reddit haha.",
                            "author": null,
                            "id": "ezslu4z",
                            "parent_id": "t1_ezqqv6e",
                            "score": 2,
                            "created_utc": 1568096898.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ezrkt8l",
                            "parent_id": "t1_ezqqv6e",
                            "score": 1,
                            "created_utc": 1568075268.0,
                            "replies": [
                                {
                                    "body": "I thought it was one of his other comments.. the poolside/deadbeat one. I guess it works in response to both lol",
                                    "author": "miuxiu",
                                    "id": "ezrnd2a",
                                    "parent_id": "t1_ezrkt8l",
                                    "score": 2,
                                    "created_utc": 1568076247.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All human interaction is a transaction in some sense.  I don't really see how focusing the  word 'transactional' is helpful.",
            "author": "HappyBear1952",
            "id": "ezqzk60",
            "parent_id": "t3_d1v8bi",
            "score": 7,
            "created_utc": 1568065869.0,
            "replies": [
                {
                    "body": "I totally agree, it's just semantics- some people mean transaction in a 'I want an emotional relationship/non SW' way and some mean it to be ' I don't want to have a conversation about payment'\n\nIt's subjective to the point where it has no meaning.",
                    "author": "itsyrgirl",
                    "id": "eztwe3m",
                    "parent_id": "t1_ezqzk60",
                    "score": 2,
                    "created_utc": 1568140138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My main SD is forever dropping that line. We haven’t had any intimacy and he’s been paying me between $850-2k monthly since February, gave me a 2016 Prius SC and an iPhone X.\n\nLots of people say lots of things. Scrape his pockets like he didn’t or don’t and just move on. There’s always one that will do what another one won’t.\n\n🤙🏽🤙🏽Best of luck, Queen! 👑",
            "author": "xxxcelestialkitten",
            "id": "ezskgkg",
            "parent_id": "t3_d1v8bi",
            "score": 7,
            "created_utc": 1568095141.0,
            "replies": []
        },
        {
            "body": "Guys don’t want it to be “transactional” cause they want sex with much younger girls for free or cheap. Not sure there is any other reason for that!",
            "author": null,
            "id": "ezqegjh",
            "parent_id": "t3_d1v8bi",
            "score": 19,
            "created_utc": 1568058185.0,
            "replies": [
                {
                    "body": "Honestly like I have barely any money to my name but when I want something really nice I’m willing to splurge for it. I feel like sugar relationships should be the same way.",
                    "author": null,
                    "id": "ezqf8b5",
                    "parent_id": "t1_ezqegjh",
                    "score": 14,
                    "created_utc": 1568058459.0,
                    "replies": [
                        {
                            "body": "Beautifully put, April.  A sugar relationship is something really nice, so it sure doesn’t hurt to spend a little more on it.\nWe spend money on what we value.... often times, the more we spend on it/them, the more we value it/them.\nWhat you wrote above is a wonderful lesson in learning how to truly know your own worth, and how to live from a place of abundance instead of a place of lack. \nThat may be a little too woo woo for some people to understand, but it’s all about the energy. I have a feeling you know what I mean💖",
                            "author": "RealEarthAngel",
                            "id": "ezr0372",
                            "parent_id": "t1_ezqf8b5",
                            "score": 12,
                            "created_utc": 1568066056.0,
                            "replies": [
                                {
                                    "body": "Oh 100%! Thank you for your comment:)",
                                    "author": null,
                                    "id": "ezsly2m",
                                    "parent_id": "t1_ezr0372",
                                    "score": 2,
                                    "created_utc": 1568097040.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You have barely any money exactly why?  Either your income is low or you overspend what you earn, or both.  Many SDs have the ability to teach you how they became successful,  if you cared to learn.  \n\nWhere will you be in 10 years?  The 18 to 24 girls keep arriving daily in the bowl..  where is that new iPhone or hand bag then?\n\nBut hey, apparently to some I am a dead beat since I don't do PPM (at least not yet).\n\n<Sent from poolside in Puerto Vallarta next to my SB>\n\nDeadbeat out.",
                            "author": "TXPolyDaddy",
                            "id": "ezqjc1w",
                            "parent_id": "t1_ezqf8b5",
                            "score": -25,
                            "created_utc": 1568060019.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ezqstm0",
                                    "parent_id": "t1_ezqjc1w",
                                    "score": 16,
                                    "created_utc": 1568063538.0,
                                    "replies": [
                                        {
                                            "body": "Nope.  I just think it is sad that so many SWs will be washed up and bitter by 30s when they had people right next to them whom could have helped their long term. \n\nI don't empower you or anyone else to attack or offend me.  I ran out of give a fuks long ago.",
                                            "author": "TXPolyDaddy",
                                            "id": "ezquqso",
                                            "parent_id": "t1_ezqstm0",
                                            "score": -9,
                                            "created_utc": 1568064197.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Mentioning the fact that you're poolside, really just shows you're not caring to help, but instead just want to rub it in her face.\n\nNEXT.",
                                    "author": "OllieAlleOllio",
                                    "id": "ezqqsng",
                                    "parent_id": "t1_ezqjc1w",
                                    "score": 17,
                                    "created_utc": 1568062807.0,
                                    "replies": [
                                        {
                                            "body": "Uh no she wasn't asking for help.  She was basically saying that it is transactional or shit.  I simply disagree. \n\nIf someone wanted my help they would DM me.",
                                            "author": "TXPolyDaddy",
                                            "id": "ezqufuw",
                                            "parent_id": "t1_ezqqsng",
                                            "score": -2,
                                            "created_utc": 1568064090.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Out of curiosity, you don’t do PPM. You start out with allowance straight away? \n\nOr is my assumption incorrect?",
                                    "author": null,
                                    "id": "ezr1phe",
                                    "parent_id": "t1_ezqjc1w",
                                    "score": 7,
                                    "created_utc": 1568066995.0,
                                    "replies": [
                                        {
                                            "body": "To be honest we were both really new to the bowl.\nI paid for college classes(specialize certification courses), other basic expenses, and she actually ended up moving in.  She was in a really bad spot and needed a safe place in the storm of life.\n\nNot typical circumstances I know and likely not recommended but it worked.",
                                            "author": "TXPolyDaddy",
                                            "id": "ezr2kiy",
                                            "parent_id": "t1_ezr1phe",
                                            "score": -4,
                                            "created_utc": 1568067457.0,
                                            "replies": [
                                                {
                                                    "body": "Like I said down below, if it works for you and her, then nothing else matters",
                                                    "author": null,
                                                    "id": "ezr3vob",
                                                    "parent_id": "t1_ezr2kiy",
                                                    "score": 3,
                                                    "created_utc": 1568068187.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "lmao....  talk about down voting..  I bet I can guess which group did that..  hits way to close to home I guess.  yawn.",
                                    "author": "TXPolyDaddy",
                                    "id": "ezr2p01",
                                    "parent_id": "t1_ezqjc1w",
                                    "score": -4,
                                    "created_utc": 1568067524.0,
                                    "replies": [
                                        {
                                            "body": "\\> Posts inflammatory incorrect statements with absurd levels of butthurt\n\\> Surprised Pikachu face when downvoted \n\nYawn. Be better not bitter.",
                                            "author": "2catsandacomputer",
                                            "id": "ezstjs3",
                                            "parent_id": "t1_ezr2p01",
                                            "score": 2,
                                            "created_utc": 1568108899.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The guys who don’t want it to be transactional are also the ones who want to do PPM as well as only starting allowance after intimacy occurs 😂😂 lord make it make sense",
            "author": null,
            "id": "ezqnmv7",
            "parent_id": "t3_d1v8bi",
            "score": 18,
            "created_utc": 1568061659.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezrleid",
                    "parent_id": "t1_ezqnmv7",
                    "score": 2,
                    "created_utc": 1568075490.0,
                    "replies": [
                        {
                            "body": "Ppm + only paying after intimacy is (arguably) a way of treating you like an escort, but escorts get paid and guys who “don’t want things to be transactional” say that as an excuse for not giving you $$",
                            "author": null,
                            "id": "ezrm8aw",
                            "parent_id": "t1_ezrleid",
                            "score": 10,
                            "created_utc": 1568075811.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then SD needs to pony up allowance or saccharin daddy needs to eff off, the end.",
            "author": "OneMOARPlz",
            "id": "ezrag9c",
            "parent_id": "t3_d1v8bi",
            "score": 5,
            "created_utc": 1568070984.0,
            "replies": []
        },
        {
            "body": "Did you get this from my profile? Ive had these exact words in my profile about not being transactional. I am not a scammer! What it means is I want a connection and someone who is very attracted to me and money isnt their only motivation to be intimate with me. I dont want to be intimate with someone who isnt into me and is really disgusted inside by what they're doing. I would never hire an escort.  \n\n\nOn the other hand I'm very willing to discuss details about allowance. I'm not like this guy who refuses to discuss the allowance.",
            "author": "DoomAndSouls",
            "id": "ezsrtfn",
            "parent_id": "t3_d1v8bi",
            "score": 6,
            "created_utc": 1568106069.0,
            "replies": [
                {
                    "body": "Basically my thoughts too.",
                    "author": null,
                    "id": "ezsyslr",
                    "parent_id": "t1_ezsrtfn",
                    "score": 1,
                    "created_utc": 1568115723.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its not transactional at all in most cases.\n\nAs a guy, I date someone I like...we have a fun date, good conversation, good food and wine, and usually end up in the bedroom.  Seems pretty natural to help her with rent, etc.",
            "author": "mtncityguy",
            "id": "ezqbm7d",
            "parent_id": "t3_d1v8bi",
            "score": 17,
            "created_utc": 1568057177.0,
            "replies": [
                {
                    "body": "I love that! It’s just a relationship, right? Guys my age aren’t able to help me in that regard but I’d like to think they would if they could (probably they wouldn’t though haha).",
                    "author": null,
                    "id": "ezqffl5",
                    "parent_id": "t1_ezqbm7d",
                    "score": 4,
                    "created_utc": 1568058531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a hotel amd restaurant manager, I firmly believe in transformations over transactions.\n\nWith this said, you aren't just making a transaction, you are affecting people with what you do as well as taking in the experience of the customer.\n\nFor example, you aren't just having sex w your SD, your both becoming more detailed lovers in a journey where he transforms your life w money",
            "author": "send-nudes-4-science",
            "id": "ezr6gjx",
            "parent_id": "t3_d1v8bi",
            "score": 4,
            "created_utc": 1568069451.0,
            "replies": []
        },
        {
            "body": "I hate when they’re like that. Okay, so don’t do PPM then, if that feels too impersonal. And if you’re wanting something else, get out of the bowl 🤣",
            "author": "Curvyandwet4you",
            "id": "ezspxsn",
            "parent_id": "t3_d1v8bi",
            "score": 5,
            "created_utc": 1568102924.0,
            "replies": [
                {
                    "body": "\nThat’s one reason I don’t do PPM… It’s a complete oxymoron for someone to say they don’t want things to feel transactional, and then ask me to do PPM. Makes no sense to me at all!",
                    "author": "RealEarthAngel",
                    "id": "f1ni0pm",
                    "parent_id": "t1_ezspxsn",
                    "score": 1,
                    "created_utc": 1569617742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eztbn7i",
            "parent_id": "t3_d1v8bi",
            "score": 4,
            "created_utc": 1568126441.0,
            "replies": []
        },
        {
            "body": "I say \"I don't want this to be transactional\" and it's not a scam. I use it to frame the conversation:\n\n* I don't want PPM\n* I will pay a monthly allowance\n* Additional money is at my discretion, and not for anything \"extra\"\n\nThis isn't a dis to any other arrangements. It's just my preference. I'm fully aware that the entire thing is transactional, but I prefer someone aware enough to embrace the fiction.",
            "author": "riotmaster",
            "id": "ezqzx8q",
            "parent_id": "t3_d1v8bi",
            "score": 7,
            "created_utc": 1568065997.0,
            "replies": [
                {
                    "body": "I could get behind this. As someone with an experience daddy, I don't mind \"non-transactional\" relationships. They're still fulfilling. What I do mind is people who don't understand that at the end of the day, even if it's unspoken, there's an expectation for both parties to provide something---and that's a transaction. And I especially don't like the mental gymnastics some people do to pretend they are better than others who accept this train of thought. It's baffling and kinda cringey.",
                    "author": "2catsandacomputer",
                    "id": "ezsud29",
                    "parent_id": "t1_ezqzx8q",
                    "score": 5,
                    "created_utc": 1568110163.0,
                    "replies": []
                },
                {
                    "body": "Out of curiosity, do you give the allowance at the beginning of the month?",
                    "author": "bsbdfw",
                    "id": "ezrfbk4",
                    "parent_id": "t1_ezqzx8q",
                    "score": 2,
                    "created_utc": 1568073033.0,
                    "replies": [
                        {
                            "body": "First date, then first of the month",
                            "author": "riotmaster",
                            "id": "ezrji76",
                            "parent_id": "t1_ezrfbk4",
                            "score": 5,
                            "created_utc": 1568074778.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In all I've read it seems SBs generally want to hold themselves in higher regard than SWs. Interesting distinctions like if its monthly its different to ppm. Why is it important who get put down? As an SB I do see myself as a SW as well. I think my only advice is don't do anything you don't want to do. Make your own choices. I've been tested a lot in this lifestyle. My real beliefs and what I will stay strong on have been exposed, to me. Some things I have done, not just for money mind you, being open to adventures and in the bowl exposes you to some interesting people. I've also been asked to do things I am opposed to, offered really obscene amounts of money, and I said \"No\", not a hypothetical I'm-sure-I'd-say-no, a real no. For me, ultimately all of this is about self-discovery and being true to oneself.",
            "author": "NYDancesInGermany",
            "id": "ezsfxz0",
            "parent_id": "t3_d1v8bi",
            "score": 3,
            "created_utc": 1568090290.0,
            "replies": []
        },
        {
            "body": "When POT SDs say they don't want it to be transactional, it just means you aren't going to get sugar - as has been frequently mentioned here. That said, I (a SD) have a slightly different take on this.   \nIf one visits an escort, it is transactional.  A sugar relationship with a regular partner is supposed to avoid the transactional feeling.  If I do pay but she acts more like an escort than a SB, I would feel the relationship is transactional. My SRs have worked well when I sense she is genuinely excited to be with me, I mean more to her than just the allowance and (while I don't look for exclusivity), her schedule and nature are such that she's not into multiple relationships.  \n\nI don't like being in a position where I have to be the highest bidder to qualify to be her SD, where her body language indicates disinterest and the only thing that matters to her is the allowance.",
            "author": "Dean_46",
            "id": "ezsgbiw",
            "parent_id": "t3_d1v8bi",
            "score": 3,
            "created_utc": 1568090651.0,
            "replies": []
        },
        {
            "body": "You are exactly right!",
            "author": "SDforreal",
            "id": "ezq693t",
            "parent_id": "t3_d1v8bi",
            "score": 3,
            "created_utc": 1568055304.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezqlt4v",
            "parent_id": "t3_d1v8bi",
            "score": 1,
            "created_utc": 1568060965.0,
            "replies": [
                {
                    "body": "I guess I personally have a muddled line between the two so that’s why I don’t see why people get so offended by a give this to get this type of relationship. That’s what I’m looking for!",
                    "author": null,
                    "id": "ezqmtta",
                    "parent_id": "t1_ezqlt4v",
                    "score": 5,
                    "created_utc": 1568061362.0,
                    "replies": [
                        {
                            "body": "I don't think that you are the one with the muddled line. If, because of the addition of financial support, a girl is seeing/sleeping with someone who she wouldn't choose over her vanilla dating options, then it's a transaction. A little separation in time between the money and the sex doesn't change that. But who cares if both sides are happy? You can still enjoy each other's company and appreciate each other without pretending that what's happening isn't happening.",
                            "author": "SD_Emeritus",
                            "id": "ezrtwaq",
                            "parent_id": "t1_ezqmtta",
                            "score": 2,
                            "created_utc": 1568078745.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All of it's pretty much a dead end argument, much like \"I'm not a prostitute, I won't sleep with you for money.\"\n\n*Oh? So you'll sleep with me because you're attracted to me?*\n\nWe have to be honest as much with ourselves as with others.\n\nNo, you're note a prostitute, but you will indeed sleep with me, because it pays the rent, bills and groceries.",
            "author": "gingerdaddy56",
            "id": "ezr5zml",
            "parent_id": "t3_d1v8bi",
            "score": 1,
            "created_utc": 1568069273.0,
            "replies": []
        },
        {
            "body": "A guy who says this may just mean that he doesn't want a ppm/escort type arrangement, which is not for everyone.",
            "author": "Pinstripes2019",
            "id": "ezrrvj8",
            "parent_id": "t3_d1v8bi",
            "score": 1,
            "created_utc": 1568077916.0,
            "replies": []
        },
        {
            "body": "You will get to a stage in your life where you do things for others without expecting anything in return.",
            "author": "dade_murphy1",
            "id": "ezsp4qa",
            "parent_id": "t3_d1v8bi",
            "score": 1,
            "created_utc": 1568101622.0,
            "replies": []
        },
        {
            "body": "semantics is everything.  My wife was looking for a FWB to have a monogamous relationship with and found a SD that was looking for the same thing.  He wanted to pay her for exclusivity and she took it as being paid for sex, which in her mind was not an option.  He finally convinced her that he was not paying her to have sex, he was paying her to not have sex with other guys.  They started out with a small PPM and he was so happy that he increased the payment and the meeting time.  Then he gave her a big chunk of cash to go on vacation for two weeks with him and when they came back, he increased the payment and he made her an employee of his company and she received direct deposits to her bank.  As their relationship progressed, they developed their own kinks and for the SD, her being married became a kink for him.  As he got her into doing anal and deep throat, his kinks expanded and finally he got her into talking \"potty mouth\".  One  day he called me and said, \" She is your wife, but she is my whore\", they had gone to a new level for sure. Life is not static.",
            "author": null,
            "id": "ezqrbaz",
            "parent_id": "t3_d1v8bi",
            "score": -1,
            "created_utc": 1568062996.0,
            "replies": [
                {
                    "body": "That escalated....very quickly.",
                    "author": null,
                    "id": "ezr1duh",
                    "parent_id": "t1_ezqrbaz",
                    "score": 7,
                    "created_utc": 1568066801.0,
                    "replies": [
                        {
                            "body": "1 thing you'll learn about Fred he likes to share his cuckold kink in damn near every post. That's just how he rolls.",
                            "author": "bsbdfw",
                            "id": "ezrfiki",
                            "parent_id": "t1_ezr1duh",
                            "score": 7,
                            "created_utc": 1568073120.0,
                            "replies": [
                                {
                                    "body": "I’ve been gone for way too long!",
                                    "author": null,
                                    "id": "ezrlhnc",
                                    "parent_id": "t1_ezrfiki",
                                    "score": 1,
                                    "created_utc": 1568075523.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "They both found what they were looking for, they were a good match for sure.  I think they both found a lot more that they were looking for, to be more exact.",
                            "author": null,
                            "id": "ezr1n4s",
                            "parent_id": "t1_ezr1duh",
                            "score": 0,
                            "created_utc": 1568066958.0,
                            "replies": [
                                {
                                    "body": "Hey, as long as it works for you, her, and her SD, then no one can judge. \nIt was just unexpected",
                                    "author": null,
                                    "id": "ezr1wbw",
                                    "parent_id": "t1_ezr1n4s",
                                    "score": 2,
                                    "created_utc": 1568067109.0,
                                    "replies": [
                                        {
                                            "body": "Thanks,I wake up every day thinking \"The best is yet to come\"",
                                            "author": null,
                                            "id": "ezr3kms",
                                            "parent_id": "t1_ezr1wbw",
                                            "score": -1,
                                            "created_utc": 1568068011.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Fuck me! That was harsh of him.",
                    "author": "SDforreal",
                    "id": "ezqti49",
                    "parent_id": "t1_ezqrbaz",
                    "score": 1,
                    "created_utc": 1568063777.0,
                    "replies": [
                        {
                            "body": "I sent you a PM",
                            "author": null,
                            "id": "ezr0hyr",
                            "parent_id": "t1_ezqti49",
                            "score": 0,
                            "created_utc": 1568066224.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I care just enough to be sad about the bad advice and consequence if the SW posing as SBs.",
            "author": "TXPolyDaddy",
            "id": "ezr549f",
            "parent_id": "t3_d1v8bi",
            "score": -3,
            "created_utc": 1568068860.0,
            "replies": []
        },
        {
            "body": "Hahahaha omgggg I cannot IMAGINE how that conversation would go down",
            "author": null,
            "id": "ezqfaqv",
            "parent_id": "t1_ezqc814",
            "score": 41,
            "created_utc": 1568058484.0,
            "replies": [
                {
                    "body": "It happens all the time. Girls that ask for money in advance for some \"emergency\" or to \"prove you're real\" is the flip side of guys that \"dont want this to feel like a transaction\"  I'm sure there are real people on both sides, but the number of scammers is so high you have to assume they're all scammers.",
                    "author": "willfromvb",
                    "id": "ezqux93",
                    "parent_id": "t1_ezqfaqv",
                    "score": 15,
                    "created_utc": 1568064256.0,
                    "replies": [
                        {
                            "body": "Will,\n\nI think that it was clear in this post that this was in response to a man who is trying to trick/scam a girl into sleeping with him for free. A girl that says this to a scammer isn’t scamming. She’s just turning his own con against him:)",
                            "author": "MsDReid",
                            "id": "ezrg9z6",
                            "parent_id": "t1_ezqux93",
                            "score": 20,
                            "created_utc": 1568073444.0,
                            "replies": [
                                {
                                    "body": "I understand and agree. \n\nI'm just suggesting you can expose (and have fun with) scammers by agreeing with them and proposing the opposite scam.  If a girl proposes that I need to \"prove myself\" prior to sex, I suggest they \"prove themsleves\" prior to an allowance.  I dont actually expect them to accept my offer!  Lol\n\nI dont consider messing with scammers as being a scammer yourself.   It's more like a hobby!  Lol",
                                    "author": "willfromvb",
                                    "id": "ezrpi0n",
                                    "parent_id": "t1_ezrg9z6",
                                    "score": 4,
                                    "created_utc": 1568077017.0,
                                    "replies": [
                                        {
                                            "body": "Yes it’s my favorite lol! Super entertaining. I also know that as long as they are wasting time with me it’s less time they have to mess with someone else.",
                                            "author": "MsDReid",
                                            "id": "ezrsgyn",
                                            "parent_id": "t1_ezrpi0n",
                                            "score": 2,
                                            "created_utc": 1568078163.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Cardinal rule of a good life ........  don't let assholes live rent free in your brain.  Dismiss and move on...............",
                                            "author": "pinotandsugar",
                                            "id": "ezs89xj",
                                            "parent_id": "t1_ezrpi0n",
                                            "score": 1,
                                            "created_utc": 1568084659.0,
                                            "replies": [
                                                {
                                                    "body": "I find them entertaining:)",
                                                    "author": "MsDReid",
                                                    "id": "ezsdfcq",
                                                    "parent_id": "t1_ezs89xj",
                                                    "score": 3,
                                                    "created_utc": 1568087921.0,
                                                    "replies": [
                                                        {
                                                            "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                                                            "author": "willfromvb",
                                                            "id": "ezspu1s",
                                                            "parent_id": "t1_ezsdfcq",
                                                            "score": 2,
                                                            "created_utc": 1568102751.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Always turn their excuses back on them!",
            "author": null,
            "id": "ezqn6oz",
            "parent_id": "t1_ezqc814",
            "score": 8,
            "created_utc": 1568061496.0,
            "replies": []
        },
        {
            "body": "Saving this comment to use down the road. 😂😂",
            "author": "soullessfreckles",
            "id": "ezqkfkv",
            "parent_id": "t1_ezqc814",
            "score": 10,
            "created_utc": 1568060436.0,
            "replies": []
        },
        {
            "body": "Or even simpler .......\n\nYou are so right,  we can keep this non transactional ,   a $5,000  gift certificate (insert name of choice ) will get our discussions off on a perfectly non transactional basis.",
            "author": "pinotandsugar",
            "id": "ezs85kx",
            "parent_id": "t1_ezqc814",
            "score": 3,
            "created_utc": 1568084596.0,
            "replies": []
        },
        {
            "body": "This is great..",
            "author": "shouldmakesure",
            "id": "ezqgcyj",
            "parent_id": "t1_ezqc814",
            "score": 4,
            "created_utc": 1568058853.0,
            "replies": []
        },
        {
            "body": "Deja Vu 🤣🤣🤣🤣",
            "author": "Dax_NZ",
            "id": "ezr5g3b",
            "parent_id": "t1_ezqc814",
            "score": 1,
            "created_utc": 1568069022.0,
            "replies": []
        },
        {
            "body": "Either that or \"but I don't pay for sex\". They don't realize that all guys pay for sex in one way or another, just like all women have used sex to get their way at least once.",
            "author": "shouldmakesure",
            "id": "ezqg7x8",
            "parent_id": "t1_ezq8nus",
            "score": 9,
            "created_utc": 1568058803.0,
            "replies": [
                {
                    "body": "> just like all women have used sex to get their way at least once.\n\nThis is a little tmi/crude, but I have a friend who talks her husband into giving her shoulder massages by trading BJs. 🤷 I've heard of girls doing anal for special circumstances/trades to (in a purely vanilla relationship). It definitely does happen.",
                    "author": "2catsandacomputer",
                    "id": "ezstbqi",
                    "parent_id": "t1_ezqg7x8",
                    "score": 2,
                    "created_utc": 1568108549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg YES. So well said.",
            "author": null,
            "id": "ezqbgfj",
            "parent_id": "t1_ezq713y",
            "score": 4,
            "created_utc": 1568057123.0,
            "replies": []
        },
        {
            "body": "hol up?  you mean, you don't want to be an island hopper?   You don't accept euros?",
            "author": "Academic_Set",
            "id": "ezq8jrb",
            "parent_id": "t1_ezq713y",
            "score": 0,
            "created_utc": 1568056100.0,
            "replies": []
        },
        {
            "body": "Right because everyone that wants to be more than just a John is a dead beat..  cool \n\nIf being a John is your gig, awesome.. Own it but you don't represent all SDs..  \n\nIf the original poster wants to focus on a SW career, her right.  Some would say she is missing on the larger picture but this is true capitalism.",
            "author": "TXPolyDaddy",
            "id": "ezqi8bc",
            "parent_id": "t1_ezq713y",
            "score": -12,
            "created_utc": 1568059601.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezrkf6j",
                    "parent_id": "t1_ezqi8bc",
                    "score": 13,
                    "created_utc": 1568075127.0,
                    "replies": [
                        {
                            "body": "Saying \"next that dude\" and the rest of your opener are shit advice.  There are more than a few real SDs that prefer something deeper, or at least the illusion of it.   No worries it is the same shit advice the SWs give to newbies.\n\nHad my newbie SB taken that advice we would have never met and given she has stayed 19 months I think she's okay with non transactional.",
                            "author": "TXPolyDaddy",
                            "id": "ezro7v4",
                            "parent_id": "t1_ezrkf6j",
                            "score": -7,
                            "created_utc": 1568076559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Come on, you know there’s No such thing as free pussy. That’s a fairy tale like Santa and the Easter Bunny 😂",
            "author": "ruphun",
            "id": "ezqs61u",
            "parent_id": "t1_ezqrdc6",
            "score": 4,
            "created_utc": 1568063305.0,
            "replies": [
                {
                    "body": "LOL -true that. But these guys don't want to do the down payment",
                    "author": "GSSD",
                    "id": "ezqsdmu",
                    "parent_id": "t1_ezqs61u",
                    "score": 5,
                    "created_utc": 1568063378.0,
                    "replies": [
                        {
                            "body": "i don’t mind the down payment. But that ballon payment at the end can be a real b*tch. I guess they haven’t figured out that in the long run it’s  cheaper to lease then it is to buy 😂",
                            "author": "ruphun",
                            "id": "ezqt9gm",
                            "parent_id": "t1_ezqsdmu",
                            "score": 1,
                            "created_utc": 1568063697.0,
                            "replies": [
                                {
                                    "body": "And you wonder why some posters think you're a John.",
                                    "author": "2catsandacomputer",
                                    "id": "ezstfde",
                                    "parent_id": "t1_ezqt9gm",
                                    "score": 2,
                                    "created_utc": 1568108705.0,
                                    "replies": [
                                        {
                                            "body": "are you just here to bust my balls? 😈\n\nIm not sure what you’re talking about or why you or any posters would think I’m a John. Im the one that typically gets chastised here for calling out people that treat SR like sex work. I’m a proponent of SR being real relationships with a sugar element..\n\nNow all of a sudden I’ve gone from being the poster guy for traditional sugar relationships to being a transactional John treating SR like sexy work.? \n\nNot to mention my comment was referring to SR being like a lease, whereas  marriage which often ends with divorce having a balloon payment at the end 🤯",
                                            "author": "ruphun",
                                            "id": "ezt1l5u",
                                            "parent_id": "t1_ezstfde",
                                            "score": -1,
                                            "created_utc": 1568118491.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bunny's not real?",
                    "author": "NYDancesInGermany",
                    "id": "ezsf3pq",
                    "parent_id": "t1_ezqs61u",
                    "score": 1,
                    "created_utc": 1568089473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can tell who you meant to reply to, but you replied to your thread instead of him just so you know",
            "author": "miuxiu",
            "id": "ezqqv6e",
            "parent_id": "t1_ezqjop4",
            "score": 8,
            "created_utc": 1568062831.0,
            "replies": [
                {
                    "body": "Oh, thank you. Sometimes I still don’t know how to Reddit haha.",
                    "author": null,
                    "id": "ezslu4z",
                    "parent_id": "t1_ezqqv6e",
                    "score": 2,
                    "created_utc": 1568096898.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezrkt8l",
                    "parent_id": "t1_ezqqv6e",
                    "score": 1,
                    "created_utc": 1568075268.0,
                    "replies": [
                        {
                            "body": "I thought it was one of his other comments.. the poolside/deadbeat one. I guess it works in response to both lol",
                            "author": "miuxiu",
                            "id": "ezrnd2a",
                            "parent_id": "t1_ezrkt8l",
                            "score": 2,
                            "created_utc": 1568076247.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I totally agree, it's just semantics- some people mean transaction in a 'I want an emotional relationship/non SW' way and some mean it to be ' I don't want to have a conversation about payment'\n\nIt's subjective to the point where it has no meaning.",
            "author": "itsyrgirl",
            "id": "eztwe3m",
            "parent_id": "t1_ezqzk60",
            "score": 2,
            "created_utc": 1568140138.0,
            "replies": []
        },
        {
            "body": "Honestly like I have barely any money to my name but when I want something really nice I’m willing to splurge for it. I feel like sugar relationships should be the same way.",
            "author": null,
            "id": "ezqf8b5",
            "parent_id": "t1_ezqegjh",
            "score": 14,
            "created_utc": 1568058459.0,
            "replies": [
                {
                    "body": "Beautifully put, April.  A sugar relationship is something really nice, so it sure doesn’t hurt to spend a little more on it.\nWe spend money on what we value.... often times, the more we spend on it/them, the more we value it/them.\nWhat you wrote above is a wonderful lesson in learning how to truly know your own worth, and how to live from a place of abundance instead of a place of lack. \nThat may be a little too woo woo for some people to understand, but it’s all about the energy. I have a feeling you know what I mean💖",
                    "author": "RealEarthAngel",
                    "id": "ezr0372",
                    "parent_id": "t1_ezqf8b5",
                    "score": 12,
                    "created_utc": 1568066056.0,
                    "replies": [
                        {
                            "body": "Oh 100%! Thank you for your comment:)",
                            "author": null,
                            "id": "ezsly2m",
                            "parent_id": "t1_ezr0372",
                            "score": 2,
                            "created_utc": 1568097040.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You have barely any money exactly why?  Either your income is low or you overspend what you earn, or both.  Many SDs have the ability to teach you how they became successful,  if you cared to learn.  \n\nWhere will you be in 10 years?  The 18 to 24 girls keep arriving daily in the bowl..  where is that new iPhone or hand bag then?\n\nBut hey, apparently to some I am a dead beat since I don't do PPM (at least not yet).\n\n<Sent from poolside in Puerto Vallarta next to my SB>\n\nDeadbeat out.",
                    "author": "TXPolyDaddy",
                    "id": "ezqjc1w",
                    "parent_id": "t1_ezqf8b5",
                    "score": -25,
                    "created_utc": 1568060019.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ezqstm0",
                            "parent_id": "t1_ezqjc1w",
                            "score": 16,
                            "created_utc": 1568063538.0,
                            "replies": [
                                {
                                    "body": "Nope.  I just think it is sad that so many SWs will be washed up and bitter by 30s when they had people right next to them whom could have helped their long term. \n\nI don't empower you or anyone else to attack or offend me.  I ran out of give a fuks long ago.",
                                    "author": "TXPolyDaddy",
                                    "id": "ezquqso",
                                    "parent_id": "t1_ezqstm0",
                                    "score": -9,
                                    "created_utc": 1568064197.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Mentioning the fact that you're poolside, really just shows you're not caring to help, but instead just want to rub it in her face.\n\nNEXT.",
                            "author": "OllieAlleOllio",
                            "id": "ezqqsng",
                            "parent_id": "t1_ezqjc1w",
                            "score": 17,
                            "created_utc": 1568062807.0,
                            "replies": [
                                {
                                    "body": "Uh no she wasn't asking for help.  She was basically saying that it is transactional or shit.  I simply disagree. \n\nIf someone wanted my help they would DM me.",
                                    "author": "TXPolyDaddy",
                                    "id": "ezqufuw",
                                    "parent_id": "t1_ezqqsng",
                                    "score": -2,
                                    "created_utc": 1568064090.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Out of curiosity, you don’t do PPM. You start out with allowance straight away? \n\nOr is my assumption incorrect?",
                            "author": null,
                            "id": "ezr1phe",
                            "parent_id": "t1_ezqjc1w",
                            "score": 7,
                            "created_utc": 1568066995.0,
                            "replies": [
                                {
                                    "body": "To be honest we were both really new to the bowl.\nI paid for college classes(specialize certification courses), other basic expenses, and she actually ended up moving in.  She was in a really bad spot and needed a safe place in the storm of life.\n\nNot typical circumstances I know and likely not recommended but it worked.",
                                    "author": "TXPolyDaddy",
                                    "id": "ezr2kiy",
                                    "parent_id": "t1_ezr1phe",
                                    "score": -4,
                                    "created_utc": 1568067457.0,
                                    "replies": [
                                        {
                                            "body": "Like I said down below, if it works for you and her, then nothing else matters",
                                            "author": null,
                                            "id": "ezr3vob",
                                            "parent_id": "t1_ezr2kiy",
                                            "score": 3,
                                            "created_utc": 1568068187.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "lmao....  talk about down voting..  I bet I can guess which group did that..  hits way to close to home I guess.  yawn.",
                            "author": "TXPolyDaddy",
                            "id": "ezr2p01",
                            "parent_id": "t1_ezqjc1w",
                            "score": -4,
                            "created_utc": 1568067524.0,
                            "replies": [
                                {
                                    "body": "\\> Posts inflammatory incorrect statements with absurd levels of butthurt\n\\> Surprised Pikachu face when downvoted \n\nYawn. Be better not bitter.",
                                    "author": "2catsandacomputer",
                                    "id": "ezstjs3",
                                    "parent_id": "t1_ezr2p01",
                                    "score": 2,
                                    "created_utc": 1568108899.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezrleid",
            "parent_id": "t1_ezqnmv7",
            "score": 2,
            "created_utc": 1568075490.0,
            "replies": [
                {
                    "body": "Ppm + only paying after intimacy is (arguably) a way of treating you like an escort, but escorts get paid and guys who “don’t want things to be transactional” say that as an excuse for not giving you $$",
                    "author": null,
                    "id": "ezrm8aw",
                    "parent_id": "t1_ezrleid",
                    "score": 10,
                    "created_utc": 1568075811.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Basically my thoughts too.",
            "author": null,
            "id": "ezsyslr",
            "parent_id": "t1_ezsrtfn",
            "score": 1,
            "created_utc": 1568115723.0,
            "replies": []
        },
        {
            "body": "I love that! It’s just a relationship, right? Guys my age aren’t able to help me in that regard but I’d like to think they would if they could (probably they wouldn’t though haha).",
            "author": null,
            "id": "ezqffl5",
            "parent_id": "t1_ezqbm7d",
            "score": 4,
            "created_utc": 1568058531.0,
            "replies": []
        },
        {
            "body": "\nThat’s one reason I don’t do PPM… It’s a complete oxymoron for someone to say they don’t want things to feel transactional, and then ask me to do PPM. Makes no sense to me at all!",
            "author": "RealEarthAngel",
            "id": "f1ni0pm",
            "parent_id": "t1_ezspxsn",
            "score": 1,
            "created_utc": 1569617742.0,
            "replies": []
        },
        {
            "body": "I could get behind this. As someone with an experience daddy, I don't mind \"non-transactional\" relationships. They're still fulfilling. What I do mind is people who don't understand that at the end of the day, even if it's unspoken, there's an expectation for both parties to provide something---and that's a transaction. And I especially don't like the mental gymnastics some people do to pretend they are better than others who accept this train of thought. It's baffling and kinda cringey.",
            "author": "2catsandacomputer",
            "id": "ezsud29",
            "parent_id": "t1_ezqzx8q",
            "score": 5,
            "created_utc": 1568110163.0,
            "replies": []
        },
        {
            "body": "Out of curiosity, do you give the allowance at the beginning of the month?",
            "author": "bsbdfw",
            "id": "ezrfbk4",
            "parent_id": "t1_ezqzx8q",
            "score": 2,
            "created_utc": 1568073033.0,
            "replies": [
                {
                    "body": "First date, then first of the month",
                    "author": "riotmaster",
                    "id": "ezrji76",
                    "parent_id": "t1_ezrfbk4",
                    "score": 5,
                    "created_utc": 1568074778.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess I personally have a muddled line between the two so that’s why I don’t see why people get so offended by a give this to get this type of relationship. That’s what I’m looking for!",
            "author": null,
            "id": "ezqmtta",
            "parent_id": "t1_ezqlt4v",
            "score": 5,
            "created_utc": 1568061362.0,
            "replies": [
                {
                    "body": "I don't think that you are the one with the muddled line. If, because of the addition of financial support, a girl is seeing/sleeping with someone who she wouldn't choose over her vanilla dating options, then it's a transaction. A little separation in time between the money and the sex doesn't change that. But who cares if both sides are happy? You can still enjoy each other's company and appreciate each other without pretending that what's happening isn't happening.",
                    "author": "SD_Emeritus",
                    "id": "ezrtwaq",
                    "parent_id": "t1_ezqmtta",
                    "score": 2,
                    "created_utc": 1568078745.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That escalated....very quickly.",
            "author": null,
            "id": "ezr1duh",
            "parent_id": "t1_ezqrbaz",
            "score": 7,
            "created_utc": 1568066801.0,
            "replies": [
                {
                    "body": "1 thing you'll learn about Fred he likes to share his cuckold kink in damn near every post. That's just how he rolls.",
                    "author": "bsbdfw",
                    "id": "ezrfiki",
                    "parent_id": "t1_ezr1duh",
                    "score": 7,
                    "created_utc": 1568073120.0,
                    "replies": [
                        {
                            "body": "I’ve been gone for way too long!",
                            "author": null,
                            "id": "ezrlhnc",
                            "parent_id": "t1_ezrfiki",
                            "score": 1,
                            "created_utc": 1568075523.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They both found what they were looking for, they were a good match for sure.  I think they both found a lot more that they were looking for, to be more exact.",
                    "author": null,
                    "id": "ezr1n4s",
                    "parent_id": "t1_ezr1duh",
                    "score": 0,
                    "created_utc": 1568066958.0,
                    "replies": [
                        {
                            "body": "Hey, as long as it works for you, her, and her SD, then no one can judge. \nIt was just unexpected",
                            "author": null,
                            "id": "ezr1wbw",
                            "parent_id": "t1_ezr1n4s",
                            "score": 2,
                            "created_utc": 1568067109.0,
                            "replies": [
                                {
                                    "body": "Thanks,I wake up every day thinking \"The best is yet to come\"",
                                    "author": null,
                                    "id": "ezr3kms",
                                    "parent_id": "t1_ezr1wbw",
                                    "score": -1,
                                    "created_utc": 1568068011.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fuck me! That was harsh of him.",
            "author": "SDforreal",
            "id": "ezqti49",
            "parent_id": "t1_ezqrbaz",
            "score": 1,
            "created_utc": 1568063777.0,
            "replies": [
                {
                    "body": "I sent you a PM",
                    "author": null,
                    "id": "ezr0hyr",
                    "parent_id": "t1_ezqti49",
                    "score": 0,
                    "created_utc": 1568066224.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It happens all the time. Girls that ask for money in advance for some \"emergency\" or to \"prove you're real\" is the flip side of guys that \"dont want this to feel like a transaction\"  I'm sure there are real people on both sides, but the number of scammers is so high you have to assume they're all scammers.",
            "author": "willfromvb",
            "id": "ezqux93",
            "parent_id": "t1_ezqfaqv",
            "score": 15,
            "created_utc": 1568064256.0,
            "replies": [
                {
                    "body": "Will,\n\nI think that it was clear in this post that this was in response to a man who is trying to trick/scam a girl into sleeping with him for free. A girl that says this to a scammer isn’t scamming. She’s just turning his own con against him:)",
                    "author": "MsDReid",
                    "id": "ezrg9z6",
                    "parent_id": "t1_ezqux93",
                    "score": 20,
                    "created_utc": 1568073444.0,
                    "replies": [
                        {
                            "body": "I understand and agree. \n\nI'm just suggesting you can expose (and have fun with) scammers by agreeing with them and proposing the opposite scam.  If a girl proposes that I need to \"prove myself\" prior to sex, I suggest they \"prove themsleves\" prior to an allowance.  I dont actually expect them to accept my offer!  Lol\n\nI dont consider messing with scammers as being a scammer yourself.   It's more like a hobby!  Lol",
                            "author": "willfromvb",
                            "id": "ezrpi0n",
                            "parent_id": "t1_ezrg9z6",
                            "score": 4,
                            "created_utc": 1568077017.0,
                            "replies": [
                                {
                                    "body": "Yes it’s my favorite lol! Super entertaining. I also know that as long as they are wasting time with me it’s less time they have to mess with someone else.",
                                    "author": "MsDReid",
                                    "id": "ezrsgyn",
                                    "parent_id": "t1_ezrpi0n",
                                    "score": 2,
                                    "created_utc": 1568078163.0,
                                    "replies": []
                                },
                                {
                                    "body": "Cardinal rule of a good life ........  don't let assholes live rent free in your brain.  Dismiss and move on...............",
                                    "author": "pinotandsugar",
                                    "id": "ezs89xj",
                                    "parent_id": "t1_ezrpi0n",
                                    "score": 1,
                                    "created_utc": 1568084659.0,
                                    "replies": [
                                        {
                                            "body": "I find them entertaining:)",
                                            "author": "MsDReid",
                                            "id": "ezsdfcq",
                                            "parent_id": "t1_ezs89xj",
                                            "score": 3,
                                            "created_utc": 1568087921.0,
                                            "replies": [
                                                {
                                                    "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                                                    "author": "willfromvb",
                                                    "id": "ezspu1s",
                                                    "parent_id": "t1_ezsdfcq",
                                                    "score": 2,
                                                    "created_utc": 1568102751.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> just like all women have used sex to get their way at least once.\n\nThis is a little tmi/crude, but I have a friend who talks her husband into giving her shoulder massages by trading BJs. 🤷 I've heard of girls doing anal for special circumstances/trades to (in a purely vanilla relationship). It definitely does happen.",
            "author": "2catsandacomputer",
            "id": "ezstbqi",
            "parent_id": "t1_ezqg7x8",
            "score": 2,
            "created_utc": 1568108549.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezrkf6j",
            "parent_id": "t1_ezqi8bc",
            "score": 13,
            "created_utc": 1568075127.0,
            "replies": [
                {
                    "body": "Saying \"next that dude\" and the rest of your opener are shit advice.  There are more than a few real SDs that prefer something deeper, or at least the illusion of it.   No worries it is the same shit advice the SWs give to newbies.\n\nHad my newbie SB taken that advice we would have never met and given she has stayed 19 months I think she's okay with non transactional.",
                    "author": "TXPolyDaddy",
                    "id": "ezro7v4",
                    "parent_id": "t1_ezrkf6j",
                    "score": -7,
                    "created_utc": 1568076559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL -true that. But these guys don't want to do the down payment",
            "author": "GSSD",
            "id": "ezqsdmu",
            "parent_id": "t1_ezqs61u",
            "score": 5,
            "created_utc": 1568063378.0,
            "replies": [
                {
                    "body": "i don’t mind the down payment. But that ballon payment at the end can be a real b*tch. I guess they haven’t figured out that in the long run it’s  cheaper to lease then it is to buy 😂",
                    "author": "ruphun",
                    "id": "ezqt9gm",
                    "parent_id": "t1_ezqsdmu",
                    "score": 1,
                    "created_utc": 1568063697.0,
                    "replies": [
                        {
                            "body": "And you wonder why some posters think you're a John.",
                            "author": "2catsandacomputer",
                            "id": "ezstfde",
                            "parent_id": "t1_ezqt9gm",
                            "score": 2,
                            "created_utc": 1568108705.0,
                            "replies": [
                                {
                                    "body": "are you just here to bust my balls? 😈\n\nIm not sure what you’re talking about or why you or any posters would think I’m a John. Im the one that typically gets chastised here for calling out people that treat SR like sex work. I’m a proponent of SR being real relationships with a sugar element..\n\nNow all of a sudden I’ve gone from being the poster guy for traditional sugar relationships to being a transactional John treating SR like sexy work.? \n\nNot to mention my comment was referring to SR being like a lease, whereas  marriage which often ends with divorce having a balloon payment at the end 🤯",
                                    "author": "ruphun",
                                    "id": "ezt1l5u",
                                    "parent_id": "t1_ezstfde",
                                    "score": -1,
                                    "created_utc": 1568118491.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bunny's not real?",
            "author": "NYDancesInGermany",
            "id": "ezsf3pq",
            "parent_id": "t1_ezqs61u",
            "score": 1,
            "created_utc": 1568089473.0,
            "replies": []
        },
        {
            "body": "Oh, thank you. Sometimes I still don’t know how to Reddit haha.",
            "author": null,
            "id": "ezslu4z",
            "parent_id": "t1_ezqqv6e",
            "score": 2,
            "created_utc": 1568096898.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezrkt8l",
            "parent_id": "t1_ezqqv6e",
            "score": 1,
            "created_utc": 1568075268.0,
            "replies": [
                {
                    "body": "I thought it was one of his other comments.. the poolside/deadbeat one. I guess it works in response to both lol",
                    "author": "miuxiu",
                    "id": "ezrnd2a",
                    "parent_id": "t1_ezrkt8l",
                    "score": 2,
                    "created_utc": 1568076247.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Beautifully put, April.  A sugar relationship is something really nice, so it sure doesn’t hurt to spend a little more on it.\nWe spend money on what we value.... often times, the more we spend on it/them, the more we value it/them.\nWhat you wrote above is a wonderful lesson in learning how to truly know your own worth, and how to live from a place of abundance instead of a place of lack. \nThat may be a little too woo woo for some people to understand, but it’s all about the energy. I have a feeling you know what I mean💖",
            "author": "RealEarthAngel",
            "id": "ezr0372",
            "parent_id": "t1_ezqf8b5",
            "score": 12,
            "created_utc": 1568066056.0,
            "replies": [
                {
                    "body": "Oh 100%! Thank you for your comment:)",
                    "author": null,
                    "id": "ezsly2m",
                    "parent_id": "t1_ezr0372",
                    "score": 2,
                    "created_utc": 1568097040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have barely any money exactly why?  Either your income is low or you overspend what you earn, or both.  Many SDs have the ability to teach you how they became successful,  if you cared to learn.  \n\nWhere will you be in 10 years?  The 18 to 24 girls keep arriving daily in the bowl..  where is that new iPhone or hand bag then?\n\nBut hey, apparently to some I am a dead beat since I don't do PPM (at least not yet).\n\n<Sent from poolside in Puerto Vallarta next to my SB>\n\nDeadbeat out.",
            "author": "TXPolyDaddy",
            "id": "ezqjc1w",
            "parent_id": "t1_ezqf8b5",
            "score": -25,
            "created_utc": 1568060019.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezqstm0",
                    "parent_id": "t1_ezqjc1w",
                    "score": 16,
                    "created_utc": 1568063538.0,
                    "replies": [
                        {
                            "body": "Nope.  I just think it is sad that so many SWs will be washed up and bitter by 30s when they had people right next to them whom could have helped their long term. \n\nI don't empower you or anyone else to attack or offend me.  I ran out of give a fuks long ago.",
                            "author": "TXPolyDaddy",
                            "id": "ezquqso",
                            "parent_id": "t1_ezqstm0",
                            "score": -9,
                            "created_utc": 1568064197.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Mentioning the fact that you're poolside, really just shows you're not caring to help, but instead just want to rub it in her face.\n\nNEXT.",
                    "author": "OllieAlleOllio",
                    "id": "ezqqsng",
                    "parent_id": "t1_ezqjc1w",
                    "score": 17,
                    "created_utc": 1568062807.0,
                    "replies": [
                        {
                            "body": "Uh no she wasn't asking for help.  She was basically saying that it is transactional or shit.  I simply disagree. \n\nIf someone wanted my help they would DM me.",
                            "author": "TXPolyDaddy",
                            "id": "ezqufuw",
                            "parent_id": "t1_ezqqsng",
                            "score": -2,
                            "created_utc": 1568064090.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Out of curiosity, you don’t do PPM. You start out with allowance straight away? \n\nOr is my assumption incorrect?",
                    "author": null,
                    "id": "ezr1phe",
                    "parent_id": "t1_ezqjc1w",
                    "score": 7,
                    "created_utc": 1568066995.0,
                    "replies": [
                        {
                            "body": "To be honest we were both really new to the bowl.\nI paid for college classes(specialize certification courses), other basic expenses, and she actually ended up moving in.  She was in a really bad spot and needed a safe place in the storm of life.\n\nNot typical circumstances I know and likely not recommended but it worked.",
                            "author": "TXPolyDaddy",
                            "id": "ezr2kiy",
                            "parent_id": "t1_ezr1phe",
                            "score": -4,
                            "created_utc": 1568067457.0,
                            "replies": [
                                {
                                    "body": "Like I said down below, if it works for you and her, then nothing else matters",
                                    "author": null,
                                    "id": "ezr3vob",
                                    "parent_id": "t1_ezr2kiy",
                                    "score": 3,
                                    "created_utc": 1568068187.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "lmao....  talk about down voting..  I bet I can guess which group did that..  hits way to close to home I guess.  yawn.",
                    "author": "TXPolyDaddy",
                    "id": "ezr2p01",
                    "parent_id": "t1_ezqjc1w",
                    "score": -4,
                    "created_utc": 1568067524.0,
                    "replies": [
                        {
                            "body": "\\> Posts inflammatory incorrect statements with absurd levels of butthurt\n\\> Surprised Pikachu face when downvoted \n\nYawn. Be better not bitter.",
                            "author": "2catsandacomputer",
                            "id": "ezstjs3",
                            "parent_id": "t1_ezr2p01",
                            "score": 2,
                            "created_utc": 1568108899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ppm + only paying after intimacy is (arguably) a way of treating you like an escort, but escorts get paid and guys who “don’t want things to be transactional” say that as an excuse for not giving you $$",
            "author": null,
            "id": "ezrm8aw",
            "parent_id": "t1_ezrleid",
            "score": 10,
            "created_utc": 1568075811.0,
            "replies": []
        },
        {
            "body": "First date, then first of the month",
            "author": "riotmaster",
            "id": "ezrji76",
            "parent_id": "t1_ezrfbk4",
            "score": 5,
            "created_utc": 1568074778.0,
            "replies": []
        },
        {
            "body": "I don't think that you are the one with the muddled line. If, because of the addition of financial support, a girl is seeing/sleeping with someone who she wouldn't choose over her vanilla dating options, then it's a transaction. A little separation in time between the money and the sex doesn't change that. But who cares if both sides are happy? You can still enjoy each other's company and appreciate each other without pretending that what's happening isn't happening.",
            "author": "SD_Emeritus",
            "id": "ezrtwaq",
            "parent_id": "t1_ezqmtta",
            "score": 2,
            "created_utc": 1568078745.0,
            "replies": []
        },
        {
            "body": "1 thing you'll learn about Fred he likes to share his cuckold kink in damn near every post. That's just how he rolls.",
            "author": "bsbdfw",
            "id": "ezrfiki",
            "parent_id": "t1_ezr1duh",
            "score": 7,
            "created_utc": 1568073120.0,
            "replies": [
                {
                    "body": "I’ve been gone for way too long!",
                    "author": null,
                    "id": "ezrlhnc",
                    "parent_id": "t1_ezrfiki",
                    "score": 1,
                    "created_utc": 1568075523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They both found what they were looking for, they were a good match for sure.  I think they both found a lot more that they were looking for, to be more exact.",
            "author": null,
            "id": "ezr1n4s",
            "parent_id": "t1_ezr1duh",
            "score": 0,
            "created_utc": 1568066958.0,
            "replies": [
                {
                    "body": "Hey, as long as it works for you, her, and her SD, then no one can judge. \nIt was just unexpected",
                    "author": null,
                    "id": "ezr1wbw",
                    "parent_id": "t1_ezr1n4s",
                    "score": 2,
                    "created_utc": 1568067109.0,
                    "replies": [
                        {
                            "body": "Thanks,I wake up every day thinking \"The best is yet to come\"",
                            "author": null,
                            "id": "ezr3kms",
                            "parent_id": "t1_ezr1wbw",
                            "score": -1,
                            "created_utc": 1568068011.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I sent you a PM",
            "author": null,
            "id": "ezr0hyr",
            "parent_id": "t1_ezqti49",
            "score": 0,
            "created_utc": 1568066224.0,
            "replies": []
        },
        {
            "body": "Will,\n\nI think that it was clear in this post that this was in response to a man who is trying to trick/scam a girl into sleeping with him for free. A girl that says this to a scammer isn’t scamming. She’s just turning his own con against him:)",
            "author": "MsDReid",
            "id": "ezrg9z6",
            "parent_id": "t1_ezqux93",
            "score": 20,
            "created_utc": 1568073444.0,
            "replies": [
                {
                    "body": "I understand and agree. \n\nI'm just suggesting you can expose (and have fun with) scammers by agreeing with them and proposing the opposite scam.  If a girl proposes that I need to \"prove myself\" prior to sex, I suggest they \"prove themsleves\" prior to an allowance.  I dont actually expect them to accept my offer!  Lol\n\nI dont consider messing with scammers as being a scammer yourself.   It's more like a hobby!  Lol",
                    "author": "willfromvb",
                    "id": "ezrpi0n",
                    "parent_id": "t1_ezrg9z6",
                    "score": 4,
                    "created_utc": 1568077017.0,
                    "replies": [
                        {
                            "body": "Yes it’s my favorite lol! Super entertaining. I also know that as long as they are wasting time with me it’s less time they have to mess with someone else.",
                            "author": "MsDReid",
                            "id": "ezrsgyn",
                            "parent_id": "t1_ezrpi0n",
                            "score": 2,
                            "created_utc": 1568078163.0,
                            "replies": []
                        },
                        {
                            "body": "Cardinal rule of a good life ........  don't let assholes live rent free in your brain.  Dismiss and move on...............",
                            "author": "pinotandsugar",
                            "id": "ezs89xj",
                            "parent_id": "t1_ezrpi0n",
                            "score": 1,
                            "created_utc": 1568084659.0,
                            "replies": [
                                {
                                    "body": "I find them entertaining:)",
                                    "author": "MsDReid",
                                    "id": "ezsdfcq",
                                    "parent_id": "t1_ezs89xj",
                                    "score": 3,
                                    "created_utc": 1568087921.0,
                                    "replies": [
                                        {
                                            "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                                            "author": "willfromvb",
                                            "id": "ezspu1s",
                                            "parent_id": "t1_ezsdfcq",
                                            "score": 2,
                                            "created_utc": 1568102751.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saying \"next that dude\" and the rest of your opener are shit advice.  There are more than a few real SDs that prefer something deeper, or at least the illusion of it.   No worries it is the same shit advice the SWs give to newbies.\n\nHad my newbie SB taken that advice we would have never met and given she has stayed 19 months I think she's okay with non transactional.",
            "author": "TXPolyDaddy",
            "id": "ezro7v4",
            "parent_id": "t1_ezrkf6j",
            "score": -7,
            "created_utc": 1568076559.0,
            "replies": []
        },
        {
            "body": "i don’t mind the down payment. But that ballon payment at the end can be a real b*tch. I guess they haven’t figured out that in the long run it’s  cheaper to lease then it is to buy 😂",
            "author": "ruphun",
            "id": "ezqt9gm",
            "parent_id": "t1_ezqsdmu",
            "score": 1,
            "created_utc": 1568063697.0,
            "replies": [
                {
                    "body": "And you wonder why some posters think you're a John.",
                    "author": "2catsandacomputer",
                    "id": "ezstfde",
                    "parent_id": "t1_ezqt9gm",
                    "score": 2,
                    "created_utc": 1568108705.0,
                    "replies": [
                        {
                            "body": "are you just here to bust my balls? 😈\n\nIm not sure what you’re talking about or why you or any posters would think I’m a John. Im the one that typically gets chastised here for calling out people that treat SR like sex work. I’m a proponent of SR being real relationships with a sugar element..\n\nNow all of a sudden I’ve gone from being the poster guy for traditional sugar relationships to being a transactional John treating SR like sexy work.? \n\nNot to mention my comment was referring to SR being like a lease, whereas  marriage which often ends with divorce having a balloon payment at the end 🤯",
                            "author": "ruphun",
                            "id": "ezt1l5u",
                            "parent_id": "t1_ezstfde",
                            "score": -1,
                            "created_utc": 1568118491.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought it was one of his other comments.. the poolside/deadbeat one. I guess it works in response to both lol",
            "author": "miuxiu",
            "id": "ezrnd2a",
            "parent_id": "t1_ezrkt8l",
            "score": 2,
            "created_utc": 1568076247.0,
            "replies": []
        },
        {
            "body": "Oh 100%! Thank you for your comment:)",
            "author": null,
            "id": "ezsly2m",
            "parent_id": "t1_ezr0372",
            "score": 2,
            "created_utc": 1568097040.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezqstm0",
            "parent_id": "t1_ezqjc1w",
            "score": 16,
            "created_utc": 1568063538.0,
            "replies": [
                {
                    "body": "Nope.  I just think it is sad that so many SWs will be washed up and bitter by 30s when they had people right next to them whom could have helped their long term. \n\nI don't empower you or anyone else to attack or offend me.  I ran out of give a fuks long ago.",
                    "author": "TXPolyDaddy",
                    "id": "ezquqso",
                    "parent_id": "t1_ezqstm0",
                    "score": -9,
                    "created_utc": 1568064197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mentioning the fact that you're poolside, really just shows you're not caring to help, but instead just want to rub it in her face.\n\nNEXT.",
            "author": "OllieAlleOllio",
            "id": "ezqqsng",
            "parent_id": "t1_ezqjc1w",
            "score": 17,
            "created_utc": 1568062807.0,
            "replies": [
                {
                    "body": "Uh no she wasn't asking for help.  She was basically saying that it is transactional or shit.  I simply disagree. \n\nIf someone wanted my help they would DM me.",
                    "author": "TXPolyDaddy",
                    "id": "ezqufuw",
                    "parent_id": "t1_ezqqsng",
                    "score": -2,
                    "created_utc": 1568064090.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Out of curiosity, you don’t do PPM. You start out with allowance straight away? \n\nOr is my assumption incorrect?",
            "author": null,
            "id": "ezr1phe",
            "parent_id": "t1_ezqjc1w",
            "score": 7,
            "created_utc": 1568066995.0,
            "replies": [
                {
                    "body": "To be honest we were both really new to the bowl.\nI paid for college classes(specialize certification courses), other basic expenses, and she actually ended up moving in.  She was in a really bad spot and needed a safe place in the storm of life.\n\nNot typical circumstances I know and likely not recommended but it worked.",
                    "author": "TXPolyDaddy",
                    "id": "ezr2kiy",
                    "parent_id": "t1_ezr1phe",
                    "score": -4,
                    "created_utc": 1568067457.0,
                    "replies": [
                        {
                            "body": "Like I said down below, if it works for you and her, then nothing else matters",
                            "author": null,
                            "id": "ezr3vob",
                            "parent_id": "t1_ezr2kiy",
                            "score": 3,
                            "created_utc": 1568068187.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "lmao....  talk about down voting..  I bet I can guess which group did that..  hits way to close to home I guess.  yawn.",
            "author": "TXPolyDaddy",
            "id": "ezr2p01",
            "parent_id": "t1_ezqjc1w",
            "score": -4,
            "created_utc": 1568067524.0,
            "replies": [
                {
                    "body": "\\> Posts inflammatory incorrect statements with absurd levels of butthurt\n\\> Surprised Pikachu face when downvoted \n\nYawn. Be better not bitter.",
                    "author": "2catsandacomputer",
                    "id": "ezstjs3",
                    "parent_id": "t1_ezr2p01",
                    "score": 2,
                    "created_utc": 1568108899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve been gone for way too long!",
            "author": null,
            "id": "ezrlhnc",
            "parent_id": "t1_ezrfiki",
            "score": 1,
            "created_utc": 1568075523.0,
            "replies": []
        },
        {
            "body": "Hey, as long as it works for you, her, and her SD, then no one can judge. \nIt was just unexpected",
            "author": null,
            "id": "ezr1wbw",
            "parent_id": "t1_ezr1n4s",
            "score": 2,
            "created_utc": 1568067109.0,
            "replies": [
                {
                    "body": "Thanks,I wake up every day thinking \"The best is yet to come\"",
                    "author": null,
                    "id": "ezr3kms",
                    "parent_id": "t1_ezr1wbw",
                    "score": -1,
                    "created_utc": 1568068011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I understand and agree. \n\nI'm just suggesting you can expose (and have fun with) scammers by agreeing with them and proposing the opposite scam.  If a girl proposes that I need to \"prove myself\" prior to sex, I suggest they \"prove themsleves\" prior to an allowance.  I dont actually expect them to accept my offer!  Lol\n\nI dont consider messing with scammers as being a scammer yourself.   It's more like a hobby!  Lol",
            "author": "willfromvb",
            "id": "ezrpi0n",
            "parent_id": "t1_ezrg9z6",
            "score": 4,
            "created_utc": 1568077017.0,
            "replies": [
                {
                    "body": "Yes it’s my favorite lol! Super entertaining. I also know that as long as they are wasting time with me it’s less time they have to mess with someone else.",
                    "author": "MsDReid",
                    "id": "ezrsgyn",
                    "parent_id": "t1_ezrpi0n",
                    "score": 2,
                    "created_utc": 1568078163.0,
                    "replies": []
                },
                {
                    "body": "Cardinal rule of a good life ........  don't let assholes live rent free in your brain.  Dismiss and move on...............",
                    "author": "pinotandsugar",
                    "id": "ezs89xj",
                    "parent_id": "t1_ezrpi0n",
                    "score": 1,
                    "created_utc": 1568084659.0,
                    "replies": [
                        {
                            "body": "I find them entertaining:)",
                            "author": "MsDReid",
                            "id": "ezsdfcq",
                            "parent_id": "t1_ezs89xj",
                            "score": 3,
                            "created_utc": 1568087921.0,
                            "replies": [
                                {
                                    "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                                    "author": "willfromvb",
                                    "id": "ezspu1s",
                                    "parent_id": "t1_ezsdfcq",
                                    "score": 2,
                                    "created_utc": 1568102751.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And you wonder why some posters think you're a John.",
            "author": "2catsandacomputer",
            "id": "ezstfde",
            "parent_id": "t1_ezqt9gm",
            "score": 2,
            "created_utc": 1568108705.0,
            "replies": [
                {
                    "body": "are you just here to bust my balls? 😈\n\nIm not sure what you’re talking about or why you or any posters would think I’m a John. Im the one that typically gets chastised here for calling out people that treat SR like sex work. I’m a proponent of SR being real relationships with a sugar element..\n\nNow all of a sudden I’ve gone from being the poster guy for traditional sugar relationships to being a transactional John treating SR like sexy work.? \n\nNot to mention my comment was referring to SR being like a lease, whereas  marriage which often ends with divorce having a balloon payment at the end 🤯",
                    "author": "ruphun",
                    "id": "ezt1l5u",
                    "parent_id": "t1_ezstfde",
                    "score": -1,
                    "created_utc": 1568118491.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope.  I just think it is sad that so many SWs will be washed up and bitter by 30s when they had people right next to them whom could have helped their long term. \n\nI don't empower you or anyone else to attack or offend me.  I ran out of give a fuks long ago.",
            "author": "TXPolyDaddy",
            "id": "ezquqso",
            "parent_id": "t1_ezqstm0",
            "score": -9,
            "created_utc": 1568064197.0,
            "replies": []
        },
        {
            "body": "Uh no she wasn't asking for help.  She was basically saying that it is transactional or shit.  I simply disagree. \n\nIf someone wanted my help they would DM me.",
            "author": "TXPolyDaddy",
            "id": "ezqufuw",
            "parent_id": "t1_ezqqsng",
            "score": -2,
            "created_utc": 1568064090.0,
            "replies": []
        },
        {
            "body": "To be honest we were both really new to the bowl.\nI paid for college classes(specialize certification courses), other basic expenses, and she actually ended up moving in.  She was in a really bad spot and needed a safe place in the storm of life.\n\nNot typical circumstances I know and likely not recommended but it worked.",
            "author": "TXPolyDaddy",
            "id": "ezr2kiy",
            "parent_id": "t1_ezr1phe",
            "score": -4,
            "created_utc": 1568067457.0,
            "replies": [
                {
                    "body": "Like I said down below, if it works for you and her, then nothing else matters",
                    "author": null,
                    "id": "ezr3vob",
                    "parent_id": "t1_ezr2kiy",
                    "score": 3,
                    "created_utc": 1568068187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\> Posts inflammatory incorrect statements with absurd levels of butthurt\n\\> Surprised Pikachu face when downvoted \n\nYawn. Be better not bitter.",
            "author": "2catsandacomputer",
            "id": "ezstjs3",
            "parent_id": "t1_ezr2p01",
            "score": 2,
            "created_utc": 1568108899.0,
            "replies": []
        },
        {
            "body": "Thanks,I wake up every day thinking \"The best is yet to come\"",
            "author": null,
            "id": "ezr3kms",
            "parent_id": "t1_ezr1wbw",
            "score": -1,
            "created_utc": 1568068011.0,
            "replies": []
        },
        {
            "body": "Yes it’s my favorite lol! Super entertaining. I also know that as long as they are wasting time with me it’s less time they have to mess with someone else.",
            "author": "MsDReid",
            "id": "ezrsgyn",
            "parent_id": "t1_ezrpi0n",
            "score": 2,
            "created_utc": 1568078163.0,
            "replies": []
        },
        {
            "body": "Cardinal rule of a good life ........  don't let assholes live rent free in your brain.  Dismiss and move on...............",
            "author": "pinotandsugar",
            "id": "ezs89xj",
            "parent_id": "t1_ezrpi0n",
            "score": 1,
            "created_utc": 1568084659.0,
            "replies": [
                {
                    "body": "I find them entertaining:)",
                    "author": "MsDReid",
                    "id": "ezsdfcq",
                    "parent_id": "t1_ezs89xj",
                    "score": 3,
                    "created_utc": 1568087921.0,
                    "replies": [
                        {
                            "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                            "author": "willfromvb",
                            "id": "ezspu1s",
                            "parent_id": "t1_ezsdfcq",
                            "score": 2,
                            "created_utc": 1568102751.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "are you just here to bust my balls? 😈\n\nIm not sure what you’re talking about or why you or any posters would think I’m a John. Im the one that typically gets chastised here for calling out people that treat SR like sex work. I’m a proponent of SR being real relationships with a sugar element..\n\nNow all of a sudden I’ve gone from being the poster guy for traditional sugar relationships to being a transactional John treating SR like sexy work.? \n\nNot to mention my comment was referring to SR being like a lease, whereas  marriage which often ends with divorce having a balloon payment at the end 🤯",
            "author": "ruphun",
            "id": "ezt1l5u",
            "parent_id": "t1_ezstfde",
            "score": -1,
            "created_utc": 1568118491.0,
            "replies": []
        },
        {
            "body": "Like I said down below, if it works for you and her, then nothing else matters",
            "author": null,
            "id": "ezr3vob",
            "parent_id": "t1_ezr2kiy",
            "score": 3,
            "created_utc": 1568068187.0,
            "replies": []
        },
        {
            "body": "I find them entertaining:)",
            "author": "MsDReid",
            "id": "ezsdfcq",
            "parent_id": "t1_ezs89xj",
            "score": 3,
            "created_utc": 1568087921.0,
            "replies": [
                {
                    "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
                    "author": "willfromvb",
                    "id": "ezspu1s",
                    "parent_id": "t1_ezsdfcq",
                    "score": 2,
                    "created_utc": 1568102751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do much the same.  It can be fun to lead them on.  I wish more people did as well.  The more we collectively waste the time of scammers the less attractive scamming would be and there would be fewer scammers to deal with.",
            "author": "willfromvb",
            "id": "ezspu1s",
            "parent_id": "t1_ezsdfcq",
            "score": 2,
            "created_utc": 1568102751.0,
            "replies": []
        }
    ]
}