{
    "title": "Types of SD Messages: A Comprehensive Study",
    "post_id": "dks8ch",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/dks8ch/types_of_sd_messages_a_comprehensive_study/",
    "author": "brownandsweet",
    "body": "The One In A Million: Hi, how are you? I’m looking for a young lady to spoil and am prepared to negotiate a pay per meet or a monthly allowance, dependant on whether we like each other or not. My email is XXX and please let me know if you’re interested after reading my profile. I’m staying at the XXX until the 10th and we can talk about it over champagne if you’re free this weekend?\n\nThe Scrapbooker: Got any more pics? X\n\nThe Conversationalist: Hey ;) \n\nThe Talking Clock: Hello beautiful :) I loved your profile and have messaged you once before but you didn’t seem to reply! If you’re going to take this seriously, you should reply PROMPTLY to the messages that people send you. I sent you a message on the 4th at 6.30pm and even though you were online you didn’t reply so I am trying again today on the 6th. I hope to receive a warm and friendly and PROMPT response as soon as you see this!!!\n\nThe Didn’t Read Your Profile: Me and my wife are looking for a young hot thing to spice up our sex lives ;) Must be sexually submissive, into rape fantasy and costumes xoxo\n\nThe Dad of Three: Hi :) I’m David and I already know I’m a bit old for you. I guess I’m wondering what a nice girl like you is doing on a site like this?\n\nThe Google Translate: hello there sexy, i can spoil and am gentle man. can give kisses and lots of spoils. message back with sexy pics in bikinis xxxxxxxxx\n\nThe Done This Before: Hello, I’m Michael. I’m 52 years old and run a successful firm in the city. I read your profile and have to say I’m intrigued. I am currently staying at the XXX and wondered if we could get together during my stay. I will compensate you for your time.\n\nThe Chicks Dig Doctors: Hi, I’m Sam :) I’m a medical professional living in the city and I went to university to study medicine, I am working in my medical practice, seeing to my many patients, and that’s why I can’t meet during the day.\n\nThe Midlife Crisis: Hey beautiful :p I am a professional man living in a city who is looking for a naughty partner in crime. I give generous gifts and dinners as well as tickling and kisses :p I can spoil you any way you like if you can spoil me :p I have a place in XXX and you can CUM by and we can have some adult fun :p :p message me back, I don’t bite...unless you want me to :p",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/dks8ch/types_of_sd_messages_a_comprehensive_study/",
    "score": 340,
    "upvote_ratio": 0.98,
    "created_utc": 1571616461.0,
    "num_comments": 96,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You forgot one!\n\nToo cheap to buy a membership: Request to view your private photos.\n\n🤣🤣🤣",
            "author": "MidwestSB",
            "id": "f4jcrg5",
            "parent_id": "t3_dks8ch",
            "score": 149,
            "created_utc": 1571617165.0,
            "replies": [
                {
                    "body": "Too cheap to buy a membership: \n\n>Hey baby, you look amazing. I'm attractive, great in bed, and funny. I'm looking for someone just like you. Text me at XXX-XXX-XXXX.",
                    "author": "MASugarBaby",
                    "id": "f4jd1df",
                    "parent_id": "t1_f4jcrg5",
                    "score": 39,
                    "created_utc": 1571617318.0,
                    "replies": [
                        {
                            "body": "Just curious, but what do women in general, or SBs in particular, think when a guy says he's great in bed?\n\nLike, every woman I've been with always tells me that I'm amazing in bed. I always say the same - I literally have told every woman I've been with that she's great. And it's not that they aren't, but it's rather meaningless and guys that say that come across as clueless IMO, but not sure how women think about that.",
                            "author": "2fast-2curious",
                            "id": "f4jgdpz",
                            "parent_id": "t1_f4jd1df",
                            "score": 16,
                            "created_utc": 1571619069.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f4jj2iq",
                                    "parent_id": "t1_f4jgdpz",
                                    "score": 89,
                                    "created_utc": 1571620474.0,
                                    "replies": [
                                        {
                                            "body": "HAHAH!!! Omg read my comment above, I totally agree with you!! Hahahahahahaha ❤️",
                                            "author": "kimchi_Queen",
                                            "id": "f5i6lpn",
                                            "parent_id": "t1_f4jj2iq",
                                            "score": 1,
                                            "created_utc": 1572211440.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue. Guys that actually have something to brag about don’t brag. It’s just like anyone who calls themselves and “alpha” is probably an insecure jackass. \n\nIn sugar it’s even more laughable. The audience of women who is giving the feedback is far form unbiased. How better to keep a guy enthralled with you than to flatter him and tell him how his old ass rocked your world. \n\nFinally, it’s sugar. Even if the guy is Casanova, I really don’t care. It could be a nice bonus, but ultimately good sex is not that important.",
                                    "author": "MASugarBaby",
                                    "id": "f4jh1ix",
                                    "parent_id": "t1_f4jgdpz",
                                    "score": 45,
                                    "created_utc": 1571619401.0,
                                    "replies": [
                                        {
                                            "body": "If he says he’s an alpha, he’s a beta 💁🏼‍♀️",
                                            "author": null,
                                            "id": "f4k2edq",
                                            "parent_id": "t1_f4jh1ix",
                                            "score": 9,
                                            "created_utc": 1571632918.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue.\n\nSo I shouldn't mention that from start to finish you wouldn't have shed a single droplet of sweat, nor felt anything special, besides a ~~slight~~ tiny tickle?",
                                            "author": "TA_SD_EU",
                                            "id": "f4k010r",
                                            "parent_id": "t1_f4jh1ix",
                                            "score": 7,
                                            "created_utc": 1571630663.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Over at r/asktrp today they were bashing the SDs and SBs from seeking and this sub. Some those guys are messed up.",
                                            "author": "agjrpsl",
                                            "id": "f4jlsio",
                                            "parent_id": "t1_f4jh1ix",
                                            "score": 5,
                                            "created_utc": 1571621877.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f4jvblx",
                                                    "parent_id": "t1_f4jlsio",
                                                    "score": 15,
                                                    "created_utc": 1571626969.0,
                                                    "replies": [
                                                        {
                                                            "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
                                                            "author": "willfromvb",
                                                            "id": "f4kllxh",
                                                            "parent_id": "t1_f4jvblx",
                                                            "score": 7,
                                                            "created_utc": 1571653893.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
                                                            "author": "agjrpsl",
                                                            "id": "f4jvqqp",
                                                            "parent_id": "t1_f4jvblx",
                                                            "score": 3,
                                                            "created_utc": 1571627201.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Please link the thread",
                                                    "author": "Gremlin_baby",
                                                    "id": "f4k22ir",
                                                    "parent_id": "t1_f4jlsio",
                                                    "score": 1,
                                                    "created_utc": 1571632595.0,
                                                    "replies": [
                                                        {
                                                            "body": "The post starts with \" I recently signed up as a sugar daddy\".",
                                                            "author": "agjrpsl",
                                                            "id": "f4k2bx8",
                                                            "parent_id": "t1_f4k22ir",
                                                            "score": 3,
                                                            "created_utc": 1571632851.0,
                                                            "replies": [
                                                                {
                                                                    "body": ":( I read it and now I feel sick",
                                                                    "author": "Gremlin_baby",
                                                                    "id": "f4k2xan",
                                                                    "parent_id": "t1_f4k2bx8",
                                                                    "score": 9,
                                                                    "created_utc": 1571633445.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                                                                            "author": "MidwestSB",
                                                                            "id": "f4k6q74",
                                                                            "parent_id": "t1_f4k2xan",
                                                                            "score": 8,
                                                                            "created_utc": 1571637692.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                                                                    "author": "2catsandacomputer",
                                                                                    "id": "f4n81pw",
                                                                                    "parent_id": "t1_f4k6q74",
                                                                                    "score": 6,
                                                                                    "created_utc": 1571686718.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                                                                            "author": "MidwestSB",
                                                                                            "id": "f4nezyu",
                                                                                            "parent_id": "t1_f4n81pw",
                                                                                            "score": 3,
                                                                                            "created_utc": 1571688771.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                                                                            "author": "RealEarthAngel",
                                                                                            "id": "f5xomb9",
                                                                                            "parent_id": "t1_f4n81pw",
                                                                                            "score": 2,
                                                                                            "created_utc": 1572543939.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                                                                    "author": "kimchi_Queen",
                                                                                    "id": "f5ia5fv",
                                                                                    "parent_id": "t1_f4k6q74",
                                                                                    "score": 3,
                                                                                    "created_utc": 1572212442.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Some really twisted minds there. Have a great week.",
                                                                            "author": "agjrpsl",
                                                                            "id": "f4k3mdu",
                                                                            "parent_id": "t1_f4k2xan",
                                                                            "score": 4,
                                                                            "created_utc": 1571634165.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                                                                            "author": "brownandsweet",
                                                                            "id": "f4llonp",
                                                                            "parent_id": "t1_f4k2xan",
                                                                            "score": 4,
                                                                            "created_utc": 1571668618.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "No wonder it is so difficult to find a true SD.",
                                                                            "author": "socharmer",
                                                                            "id": "f4mxt9d",
                                                                            "parent_id": "t1_f4k2xan",
                                                                            "score": 4,
                                                                            "created_utc": 1571683577.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
                                                            "author": "captainIsBack4u",
                                                            "id": "f4mk9ji",
                                                            "parent_id": "t1_f4k22ir",
                                                            "score": 2,
                                                            "created_utc": 1571679373.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I would but I'm on mobile. It was from today like around 12 noon.",
                                                            "author": "agjrpsl",
                                                            "id": "f4k27e5",
                                                            "parent_id": "t1_f4k22ir",
                                                            "score": 1,
                                                            "created_utc": 1571632727.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Do guys really lie about their penis size?  Seems like something that's going to be proven false pretty easily in a sexual relationship. \n\nThen again, I have a big penis, so it's never occurred to me to lie about it. 🤷‍♂️",
                                            "author": null,
                                            "id": "f4mfd85",
                                            "parent_id": "t1_f4jh1ix",
                                            "score": 1,
                                            "created_utc": 1571677676.0,
                                            "replies": [
                                                {
                                                    "body": "They never lie objectively - like they don't say \"I have a 10 inch dick\" when they're really a 5.5. They lie and say things like \"girls are always afraid it's too big\" and then whip out the 5.5. Or my favorite is the combo of lying AND trying to get out of wearing a condom - \"I can't wear those, I can only wear magnums\" as you're looking at their perfectly average size dick. \n\nIt's happened to me more times than I can count. My first SD use the mangum line - I never saw his dick to verify if it was accurate or not, but I doubted it based on the small tent he pitched.Mostly it's been vanilla guys though - always makes me roll my eyes.",
                                                    "author": "MASugarBaby",
                                                    "id": "f4miqgu",
                                                    "parent_id": "t1_f4mfd85",
                                                    "score": 5,
                                                    "created_utc": 1571678845.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
                                                            "author": null,
                                                            "id": "f4nfvfs",
                                                            "parent_id": "t1_f4miqgu",
                                                            "score": 0,
                                                            "created_utc": 1571689023.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Totally, I have had a partner that was the best sex I've ever had. And he's a great and successful person, super nice and engaging. But idk we haven't had that click that i crave, and the amazing sex isn't enough to have me hounding him or trying to get back in his sheets.",
                                            "author": "kimchi_Queen",
                                            "id": "f5i6ujp",
                                            "parent_id": "t1_f4jh1ix",
                                            "score": 1,
                                            "created_utc": 1572211530.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I love when you start your messages \"In my experience\". When It really should say \"Im my limited expererience, here is what I have noticed.\" \n\nInstead, you come off like an authority on SR, and SD, when you've previously admitted you've only had 2 \"platonic\" relationships and only 1 intimate SR.\n\nIt's kind of hard to make blanket statements about SD sexual skills or dick size when you've only supposedly slept with 1 out of 3 of your SD.",
                                            "author": "ruphun",
                                            "id": "f4kmmhf",
                                            "parent_id": "t1_f4jh1ix",
                                            "score": -10,
                                            "created_utc": 1571654505.0,
                                            "replies": [
                                                {
                                                    "body": "First of all: What does that have to do with her comment? Her comment is about men in dating apps. No where did she specifically say it was related to sugar dating. Just dating apps. Try again. \n\nSecond of all: what is the magical number we SBs are supposed to have to have enough experience without you bitching about us being \"pros\" or \"not SBs\". Is it 6? Because I wouldn't qualify. \n\nThird-party of all: she didn't even say anything inflammatory so I'm not sure why you're attacking her? Unless you felt personally attacked by the small size/self certified sex God comment, in which case, L O L.\n\nGod I wish your ban was permanent. Usually you're just annoying but now you're being a dick for no reason. You don't get to decide who is an SB and who isn't. So stop trying.",
                                                    "author": "2catsandacomputer",
                                                    "id": "f4miiuw",
                                                    "parent_id": "t1_f4kmmhf",
                                                    "score": 7,
                                                    "created_utc": 1571678776.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I think at the numbers of 0 my allowance will have 😂😂😂\n\nIf I’m feeling sarcastic I will play a bit and say « do you throw money in the bed or Chanel bags? »",
                                    "author": "Lilipuss25",
                                    "id": "f4jgysy",
                                    "parent_id": "t1_f4jgdpz",
                                    "score": 3,
                                    "created_utc": 1571619362.0,
                                    "replies": []
                                },
                                {
                                    "body": "I take it with a grain of salt. Show don’t tell.\n\nBut I’m really good at reading people. I can usually pick the freaks/perverts/sex gods out of the crowd. I’m rarely surprised when I go to bed with someone anymore",
                                    "author": "sweetnessalive",
                                    "id": "f4kr47i",
                                    "parent_id": "t1_f4jgdpz",
                                    "score": 3,
                                    "created_utc": 1571656510.0,
                                    "replies": []
                                },
                                {
                                    "body": "In the club during a private dance, I always ask guys what they love to do in bed. Every. Single. Person would say, \"I love going down on a girl. I love making a girl come and feel good, I'm unique in this I know.\nYeah ok dude, you just want to feed your already massively inflated ego and feel like your unusual in that you get off by feeling like you're so good that you can get a woman off. Ugh! No joke! Every single guy says the same thing!! \nSometimes ill even let them maybe show me their oral skills on my thigh or something, and 98% of the time they're just awful and going all over the place and they're so gross at it. Use articulated varying motions of your tongue and different pressure. Most just shove their face and tongue into it like they're a starving man that just got offered some tacos or ice cream.",
                                    "author": "kimchi_Queen",
                                    "id": "f5i6j42",
                                    "parent_id": "t1_f4jgdpz",
                                    "score": 3,
                                    "created_utc": 1572211409.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And the opposite : The Nigerian prince. \"I'm willing to pay you $ 1000 to meet for coffee and need your bank details....",
                    "author": "Dean_46",
                    "id": "f4jxmfk",
                    "parent_id": "t1_f4jcrg5",
                    "score": 4,
                    "created_utc": 1571628594.0,
                    "replies": []
                },
                {
                    "body": "Wait you need a membership to view private photos? I thought you have to request no matter what ?",
                    "author": "cali1993",
                    "id": "f4kb3v3",
                    "parent_id": "t1_f4jcrg5",
                    "score": 1,
                    "created_utc": 1571643567.0,
                    "replies": [
                        {
                            "body": "you do have to request no matter what.\n\nbut, the request to view private photos message is the ONLY message a guy without a premium account can send. he can also view and favorite, and hope a SB takes note of one of those two.",
                            "author": "joc13",
                            "id": "f4kkghh",
                            "parent_id": "t1_f4kb3v3",
                            "score": 6,
                            "created_utc": 1571653173.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Haha yes!!! Ugh I hate that! I even had it in my profile to not request my private photos right away because it's just so sleazy! So many times, I got either no message and a request, or a 'Hi i liked your profile, text me , REQUEST TO VIEW PRIVATE PHOTOS. \"\nToo many assume they are naked/explicit pics. I only had one other photo and it was just me doing yoga in a bikini. Which is actually a bit risque now that I see that in writing, but I know they were hoping for more and I hated it! One of the reasons I'm not on SA anymore.\nPrivate photos does not mean you get to see my privates!",
                    "author": "kimchi_Queen",
                    "id": "f5i5hah",
                    "parent_id": "t1_f4jcrg5",
                    "score": 1,
                    "created_utc": 1572211121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "the talking clock is spot on. and when you haven't replied to the message they sent 2 minutes ago you get- \"??????\"",
            "author": "almondflour24",
            "id": "f4ji6in",
            "parent_id": "t3_dks8ch",
            "score": 47,
            "created_utc": 1571620001.0,
            "replies": [
                {
                    "body": "Then they get aggressive and curse you out 😂",
                    "author": "brownandsweet",
                    "id": "f4jjkt4",
                    "parent_id": "t1_f4ji6in",
                    "score": 21,
                    "created_utc": 1571620737.0,
                    "replies": []
                },
                {
                    "body": "Yes!!! Soo annoying.",
                    "author": "dolllll",
                    "id": "f4uxyv9",
                    "parent_id": "t1_f4ji6in",
                    "score": 1,
                    "created_utc": 1571832871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Based on stories I’ve heard from former SB, here’s a couple of more SD messages to add: \n\nMr. John: I’ll give you $200 for a whole night of ducking.\n\nMr. Generosity:  Hey I’m generous and looking to spoil you. I’ll see you twice a week and give you $400 a month.\n\nMr. Employer: I’ll pay you $4000 per month through my company. See me twice a week and you’ll get paid at the end of the month.\n\nMr. Mentor: Honey, I don’t pay allowances but my advise and mentorship is worth tens of thousands. \n\nMr. Marriage: I’m looking for a lifetime companion to date and potentially marry.",
            "author": "SDToronto",
            "id": "f4ldvde",
            "parent_id": "t3_dks8ch",
            "score": 16,
            "created_utc": 1571665831.0,
            "replies": [
                {
                    "body": "Also Mr. Marriage: Wow, you're marriage material! Are you looking to get married at some point?",
                    "author": "ChobitsGirl",
                    "id": "f4of760",
                    "parent_id": "t1_f4ldvde",
                    "score": 2,
                    "created_utc": 1571700781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That awesome moment when you read a comment like this and realise your style matches the One In A Million, haha.",
            "author": "Sanctemagne",
            "id": "f4jg387",
            "parent_id": "t3_dks8ch",
            "score": 30,
            "created_utc": 1571618916.0,
            "replies": [
                {
                    "body": "Yeah...I thought offering emails immediately equaled scam...WHOOPS!",
                    "author": null,
                    "id": "f4k2idx",
                    "parent_id": "t1_f4jg387",
                    "score": 5,
                    "created_utc": 1571633030.0,
                    "replies": [
                        {
                            "body": "Rather than offering my email, I always say, “We can continue this conversation on WhatsApp, Kik or Telegram.” But email? No, I never offer it.",
                            "author": "gcatgc",
                            "id": "f4k63sw",
                            "parent_id": "t1_f4k2idx",
                            "score": 7,
                            "created_utc": 1571636943.0,
                            "replies": [
                                {
                                    "body": "Telegrammmmmm.😂",
                                    "author": null,
                                    "id": "f4k6p6r",
                                    "parent_id": "t1_f4k63sw",
                                    "score": 6,
                                    "created_utc": 1571637656.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah, I don't offer email either. I also offer WhatsApp or Kik. I didn't mean it was EXACTLY what I say, just more or less the same spirit.",
                                    "author": "Sanctemagne",
                                    "id": "f4kbdrb",
                                    "parent_id": "t1_f4k63sw",
                                    "score": 1,
                                    "created_utc": 1571643973.0,
                                    "replies": []
                                },
                                {
                                    "body": "Gotta get on Signal homie.",
                                    "author": null,
                                    "id": "f4r9xn0",
                                    "parent_id": "t1_f4k63sw",
                                    "score": 1,
                                    "created_utc": 1571764803.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Really? The One In A Million gets an immediate report and block from me. Maybe I am losing out thinking that all of these are scammers just because they are brand new THAT DAY and have 2 million and up in net worth. 🤣🤣🤣",
                    "author": "MidwestSB",
                    "id": "f4k1vht",
                    "parent_id": "t1_f4jg387",
                    "score": 8,
                    "created_utc": 1571632403.0,
                    "replies": [
                        {
                            "body": "Well I wouldn't be brand new that day, so at least there's that, haha.",
                            "author": "Sanctemagne",
                            "id": "f4kbcl5",
                            "parent_id": "t1_f4k1vht",
                            "score": 2,
                            "created_utc": 1571643922.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think that was meant as in \"this guy THINKS he's one in a million\" (but actually comes off like a scammer). That's how I take those sorts of messages anyway.",
                    "author": "MASugarBaby",
                    "id": "f4n4ukl",
                    "parent_id": "t1_f4jg387",
                    "score": 2,
                    "created_utc": 1571685723.0,
                    "replies": [
                        {
                            "body": "Oh, well I didn't think I was one in a million until this post told me I was, haha. Seriously though, might need to change my style then.",
                            "author": "Sanctemagne",
                            "id": "f4nxfr5",
                            "parent_id": "t1_f4n4ukl",
                            "score": 1,
                            "created_utc": 1571694020.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "lol I got lucky with “let’s meet up!” Sends his number. I ignore him and reply vaguely like “ok sure” every few months “still thinking of you. Let’s meet up. It’s been three months checking on you lol” 8 months later after m&g:\n\nNow in a SR with this man for four months.",
            "author": "yourmomomegalul",
            "id": "f4jrzni",
            "parent_id": "t3_dks8ch",
            "score": 10,
            "created_utc": 1571625189.0,
            "replies": [
                {
                    "body": "Persistence is not a bad thing",
                    "author": "girlz_are_42",
                    "id": "f4kfi57",
                    "parent_id": "t1_f4jrzni",
                    "score": 4,
                    "created_utc": 1571649619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where is Tasty to come to the SDs defense and post the same but for the SBs?",
            "author": "IESD951",
            "id": "f4jd832",
            "parent_id": "t3_dks8ch",
            "score": 21,
            "created_utc": 1571617419.0,
            "replies": []
        },
        {
            "body": "So is the “One in a Million “ response the one preferred by sugar babies?\n\nThe others I recognize as being satirical/critical but didn’t know about the first.\n\nI always struggle with my initial messages and have tried different approaches, would love to hear what SBs really want to hear.",
            "author": "Midwest-SD",
            "id": "f4jcp1y",
            "parent_id": "t3_dks8ch",
            "score": 10,
            "created_utc": 1571617129.0,
            "replies": [
                {
                    "body": "One in a Million is okay, just don’t discuss numbers until AFTER you’ve met. The ideal message for me: \n\n“Hi, Jane! Your profile caught my attention, and I’m glad I looked. I really like the fact that you enjoy expressing yourself. It’s like pulling teeth to get most to even write a sentence or two. Do you happen to have an interest in writing?\n\nOr\n\n“I love taking a jog down ocean drive, nothing beats palm trees blah blah blah..  (Referring to a photo of Jane on ocean drive) I am interested. Would you like to get coffee, have lunch or dinner sometime? Did you have an idea on how you would like to meet? You mentioned your interests. What are some of your favorite things to do?” \n\nIf she puts effort into her profile and pictures, use that to start a conversation. Let her know you’re interested and willing to meet.",
                    "author": "brownandsweet",
                    "id": "f4lhmsm",
                    "parent_id": "t1_f4jcp1y",
                    "score": 6,
                    "created_utc": 1571667135.0,
                    "replies": []
                },
                {
                    "body": "They are all satirical. None of them are preferred. \n\nJust a simple \"Hi there, I was intrigued by your profile and was wondering if you would like to chat to see if we have anything in common?\" Or reference something in her profile. Or what you are looking for but it's too early to bring up $. \n\nIf you can't think of anything to say, ask her who her favorite Disney princess is and why.  Or some other conversation starter. What her favorite food is or if she is a cat or dog person.",
                    "author": "MidwestSB",
                    "id": "f4k275s",
                    "parent_id": "t1_f4jcp1y",
                    "score": 8,
                    "created_utc": 1571632720.0,
                    "replies": [
                        {
                            "body": "\"None of them are preferred\" you say. The chicks just won't admit the message with CUM in capital letters works every time!",
                            "author": "highfructoseSD",
                            "id": "f4pl15p",
                            "parent_id": "t1_f4k275s",
                            "score": 5,
                            "created_utc": 1571736558.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f4l2jvo",
                            "parent_id": "t1_f4k275s",
                            "score": 0,
                            "created_utc": 1571661376.0,
                            "replies": [
                                {
                                    "body": "Really? Providing an email address/phone number/kik profile in the first message is an absolute red flag that this guy is either a scammer or too cheap to buy a membership.",
                                    "author": "MidwestSB",
                                    "id": "f4me2ul",
                                    "parent_id": "t1_f4l2jvo",
                                    "score": 2,
                                    "created_utc": 1571677229.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I would say yes. I mean,  I'm not a SB and am subbed to this community because I like to read the posts. So, am answering you just as a woman.  The \"One In a Million\" description is the desired message.",
                    "author": "Ld733k",
                    "id": "f4k06kv",
                    "parent_id": "t1_f4jcp1y",
                    "score": 1,
                    "created_utc": 1571630807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Scammer/phisher: Hello beautiful I noticed your profile ,I will like to be your sugar daddy and am willing to take care of you by giving you a weekly allowance of $700...TEXT ME +1 XXX XXX XXXX on KIK XXXX let’s talk better,I will be waiting thanks 😘",
            "author": "MidwestSB",
            "id": "f4jegmb",
            "parent_id": "t3_dks8ch",
            "score": 14,
            "created_utc": 1571618087.0,
            "replies": []
        },
        {
            "body": "But there is one more....  \"I am Very creative and open to anything..... **My subscription is up tonight** I'm very busy with my new foundation and frankly have not found anybody that I can really connect deeply with which is what life is about.... if you're interested please feel free to text me my number is xxx-xxx-xxxx In any event I wish you an awesome evening and thank you for your time bless you and be well... 🤗🌹🌈👍🏝️👑🚀🦄",
            "author": "IAm2Legit2Sit",
            "id": "f4mvs73",
            "parent_id": "t3_dks8ch",
            "score": 7,
            "created_utc": 1571682958.0,
            "replies": []
        },
        {
            "body": "The pig: Are you into anal and can you host tonight?",
            "author": "leeshylou",
            "id": "f4k6shi",
            "parent_id": "t3_dks8ch",
            "score": 13,
            "created_utc": 1571637768.0,
            "replies": [
                {
                    "body": "God forbid 🤦🏾‍♀️\n\nSounds like that website is wild AF — my b#tthole just clenched 😅",
                    "author": "EmilieBabie",
                    "id": "f729f37",
                    "parent_id": "t1_f4k6shi",
                    "score": 3,
                    "created_utc": 1573356301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm dead. These are all spot on.",
            "author": "MASugarBaby",
            "id": "f4jc1qm",
            "parent_id": "t3_dks8ch",
            "score": 17,
            "created_utc": 1571616768.0,
            "replies": []
        },
        {
            "body": "I’ve honestly moved to just offering money fairly quickly and a phone number.  Too many time wasters.  And then some obvious filters if something doesn’t feel right.  \n\nToo many platonic only and time wasters.\n\nFor the most part have met above average education levels.",
            "author": "chitraders",
            "id": "f4lfmpx",
            "parent_id": "t3_dks8ch",
            "score": 4,
            "created_utc": 1571666423.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f4jdbl1",
            "parent_id": "t3_dks8ch",
            "score": 9,
            "created_utc": 1571617470.0,
            "replies": [
                {
                    "body": "lol ditto",
                    "author": "2fast-2curious",
                    "id": "f4jg28q",
                    "parent_id": "t1_f4jdbl1",
                    "score": 2,
                    "created_utc": 1571618903.0,
                    "replies": []
                },
                {
                    "body": "Same",
                    "author": "girlz_are_42",
                    "id": "f4kfdnf",
                    "parent_id": "t1_f4jdbl1",
                    "score": 2,
                    "created_utc": 1571649519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm the conversationalist :(\n\nAll you have to do is say \"hi\" back, though, and then I know it's worth it to write you a thoughtful,  never before written message tailored to your profile and personality",
            "author": "Gemini-Fox",
            "id": "f4nuxcj",
            "parent_id": "t3_dks8ch",
            "score": 4,
            "created_utc": 1571693373.0,
            "replies": []
        },
        {
            "body": "So this is too perfect. Right as you posted this I get a clear copy/paster messaging me. I feel like they need to be their own type. For example:\n\n>Hi ! I'm Jack and not here for dating purposes. I'm sure you are here for the exact same reason 🎉If interested in this low key , fun ,mutually beneficial arrangement with a younger daddy, reply back. Yes, IN NYC / NJ . If you crave adventure, I'm your sugar daddy !  \nTo be completely clear, I will be able to help you financially, with loans,rent and cash.  \nJack ( Not Married )⭐️⭐️⭐️  \n\\[Phone number\\]",
            "author": "MASugarBaby",
            "id": "f4jdmgh",
            "parent_id": "t3_dks8ch",
            "score": 10,
            "created_utc": 1571617636.0,
            "replies": [
                {
                    "body": "Is it safe to assume that \"in NYC / NJ\" is better translated as \"in NJ\"? I mean, do people in Manhattan ever say that they're \"in NYC / NJ\"?",
                    "author": "2fast-2curious",
                    "id": "f4jgig0",
                    "parent_id": "t1_f4jdmgh",
                    "score": 22,
                    "created_utc": 1571619142.0,
                    "replies": [
                        {
                            "body": "I honestly have no idea. Lol. It’s irrelevant to me, I’m in Boston and I have no need or desire to travel for an arrangement.",
                            "author": "MASugarBaby",
                            "id": "f4jh94v",
                            "parent_id": "t1_f4jgig0",
                            "score": 3,
                            "created_utc": 1571619515.0,
                            "replies": []
                        },
                        {
                            "body": "Spot on. I've lived in Manhattan several years of my life. \n\nSaying I have a Greenwich/West Village 2Br apt has had a greater effect on my romantic relations than my wallet has ever had. I'd rather be caught cross dressing than with a NJ address.",
                            "author": "KeyToGramercy",
                            "id": "f4kcrg4",
                            "parent_id": "t1_f4jgig0",
                            "score": 5,
                            "created_utc": 1571646105.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Can o get jack’s number",
                    "author": "Lilipuss25",
                    "id": "f4jh3n9",
                    "parent_id": "t1_f4jdmgh",
                    "score": 8,
                    "created_utc": 1571619431.0,
                    "replies": []
                },
                {
                    "body": "Hahahaha MASugarBaby, we’re email Eskimo sisters!! Good ole (Not Married) Jack wrote me 2 days ago with a similar message!!",
                    "author": "LadyHormoneMonster",
                    "id": "f4jg5dy",
                    "parent_id": "t1_f4jdmgh",
                    "score": 7,
                    "created_utc": 1571618946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Spot on. My laugh for this evening",
            "author": null,
            "id": "f4jccpd",
            "parent_id": "t3_dks8ch",
            "score": 3,
            "created_utc": 1571616943.0,
            "replies": []
        },
        {
            "body": "Yesss! You nailed it :)",
            "author": null,
            "id": "f4jctag",
            "parent_id": "t3_dks8ch",
            "score": 3,
            "created_utc": 1571617193.0,
            "replies": []
        },
        {
            "body": "These are amazingly accurate",
            "author": "ksmith33672",
            "id": "f4jdlbt",
            "parent_id": "t3_dks8ch",
            "score": 3,
            "created_utc": 1571617619.0,
            "replies": []
        },
        {
            "body": "420 friendly?\n\nThis message is the only one I send these days and the success rate cannot be denied.",
            "author": "Mistawade504",
            "id": "f4l7010",
            "parent_id": "t3_dks8ch",
            "score": 3,
            "created_utc": 1571663196.0,
            "replies": []
        },
        {
            "body": "So, so real!",
            "author": "whatthehellhazel",
            "id": "f4jg6tn",
            "parent_id": "t3_dks8ch",
            "score": 2,
            "created_utc": 1571618967.0,
            "replies": []
        },
        {
            "body": "very funny.",
            "author": "doctorcoolpop",
            "id": "f4ji4je",
            "parent_id": "t3_dks8ch",
            "score": 2,
            "created_utc": 1571619970.0,
            "replies": []
        },
        {
            "body": "> The Google Translate: hello there sexy, i can spoil and am gentle man. can give kisses and lots of spoils. message back with sexy pics in bikinis xxxxxxxxx\n\nThere's a version of this that comes from the SBs in Venezuela, the Philippines, Uruguay, etc., too.",
            "author": "Ranger3752",
            "id": "f4jpgzd",
            "parent_id": "t3_dks8ch",
            "score": 2,
            "created_utc": 1571623818.0,
            "replies": []
        },
        {
            "body": "Well done Miss...I'm a guy and I laughed my ass off at this!!!!",
            "author": "puckhead4",
            "id": "f4ln767",
            "parent_id": "t3_dks8ch",
            "score": 2,
            "created_utc": 1571669157.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f4n9d15",
            "parent_id": "t3_dks8ch",
            "score": 2,
            "created_utc": 1571687115.0,
            "replies": [
                {
                    "body": "Sadly yes lol. This was a common one before Sesta/Fosta",
                    "author": "brownandsweet",
                    "id": "f4ncg3u",
                    "parent_id": "t1_f4n9d15",
                    "score": 2,
                    "created_utc": 1571688018.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my god the Dad of Three. Amazing.",
            "author": "lavitaetroppobreve1",
            "id": "f4ndjd3",
            "parent_id": "t3_dks8ch",
            "score": 2,
            "created_utc": 1571688343.0,
            "replies": []
        },
        {
            "body": "I am kind of disappointed that I don’t fall into any of the categories.",
            "author": "LotBuilder",
            "id": "f4jw5p6",
            "parent_id": "t3_dks8ch",
            "score": 1,
            "created_utc": 1571627450.0,
            "replies": []
        },
        {
            "body": "So which one works?",
            "author": null,
            "id": "f4o14oa",
            "parent_id": "t3_dks8ch",
            "score": 1,
            "created_utc": 1571695144.0,
            "replies": []
        },
        {
            "body": "Ahh is that why I get a lot of request to view photos, with no message attached ?",
            "author": "cali1993",
            "id": "f4p2592",
            "parent_id": "t3_dks8ch",
            "score": 1,
            "created_utc": 1571713922.0,
            "replies": []
        },
        {
            "body": "Bahahahahahahahahaha i fucking love this",
            "author": "kimchi_Queen",
            "id": "f5i4l4q",
            "parent_id": "t3_dks8ch",
            "score": 1,
            "created_utc": 1572210886.0,
            "replies": []
        },
        {
            "body": "Yes, lol! I’ve received every single one of those except the talking clock... prob because I respond to my messages In a very timely manner:)",
            "author": "RealEarthAngel",
            "id": "f5wvdck",
            "parent_id": "t3_dks8ch",
            "score": 1,
            "created_utc": 1572531185.0,
            "replies": []
        },
        {
            "body": "Fucking hell. I should start a diary of SB's email. \n\nAt least SD's can spell and put together a sentence.",
            "author": null,
            "id": "f4jmt70",
            "parent_id": "t3_dks8ch",
            "score": -2,
            "created_utc": 1571622399.0,
            "replies": [
                {
                    "body": "I’m shocked how many can’t actually. I get pretty excited when I get a message with proper spelling and grammar. \n\nBut you also should collect SB messages. It would be funny.",
                    "author": "MASugarBaby",
                    "id": "f4lpzxs",
                    "parent_id": "t1_f4jmt70",
                    "score": 7,
                    "created_utc": 1571670071.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f4jsq2l",
                    "parent_id": "t1_f4jmt70",
                    "score": 9,
                    "created_utc": 1571625587.0,
                    "replies": [
                        {
                            "body": "Second this, absolutely shocking",
                            "author": null,
                            "id": "f4jxdyd",
                            "parent_id": "t1_f4jsq2l",
                            "score": 4,
                            "created_utc": 1571628410.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Please do. It would be very educational to read how not to start a chat with a POT :) (and funny!)",
                    "author": "Kokhana",
                    "id": "f4k8czd",
                    "parent_id": "t1_f4jmt70",
                    "score": 2,
                    "created_utc": 1571639751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably the best post in the history of the world",
            "author": "Chublinsand",
            "id": "f4julim",
            "parent_id": "t3_dks8ch",
            "score": 0,
            "created_utc": 1571626588.0,
            "replies": []
        },
        {
            "body": "Too cheap to buy a membership: \n\n>Hey baby, you look amazing. I'm attractive, great in bed, and funny. I'm looking for someone just like you. Text me at XXX-XXX-XXXX.",
            "author": "MASugarBaby",
            "id": "f4jd1df",
            "parent_id": "t1_f4jcrg5",
            "score": 39,
            "created_utc": 1571617318.0,
            "replies": [
                {
                    "body": "Just curious, but what do women in general, or SBs in particular, think when a guy says he's great in bed?\n\nLike, every woman I've been with always tells me that I'm amazing in bed. I always say the same - I literally have told every woman I've been with that she's great. And it's not that they aren't, but it's rather meaningless and guys that say that come across as clueless IMO, but not sure how women think about that.",
                    "author": "2fast-2curious",
                    "id": "f4jgdpz",
                    "parent_id": "t1_f4jd1df",
                    "score": 16,
                    "created_utc": 1571619069.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f4jj2iq",
                            "parent_id": "t1_f4jgdpz",
                            "score": 89,
                            "created_utc": 1571620474.0,
                            "replies": [
                                {
                                    "body": "HAHAH!!! Omg read my comment above, I totally agree with you!! Hahahahahahaha ❤️",
                                    "author": "kimchi_Queen",
                                    "id": "f5i6lpn",
                                    "parent_id": "t1_f4jj2iq",
                                    "score": 1,
                                    "created_utc": 1572211440.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue. Guys that actually have something to brag about don’t brag. It’s just like anyone who calls themselves and “alpha” is probably an insecure jackass. \n\nIn sugar it’s even more laughable. The audience of women who is giving the feedback is far form unbiased. How better to keep a guy enthralled with you than to flatter him and tell him how his old ass rocked your world. \n\nFinally, it’s sugar. Even if the guy is Casanova, I really don’t care. It could be a nice bonus, but ultimately good sex is not that important.",
                            "author": "MASugarBaby",
                            "id": "f4jh1ix",
                            "parent_id": "t1_f4jgdpz",
                            "score": 45,
                            "created_utc": 1571619401.0,
                            "replies": [
                                {
                                    "body": "If he says he’s an alpha, he’s a beta 💁🏼‍♀️",
                                    "author": null,
                                    "id": "f4k2edq",
                                    "parent_id": "t1_f4jh1ix",
                                    "score": 9,
                                    "created_utc": 1571632918.0,
                                    "replies": []
                                },
                                {
                                    "body": ">In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue.\n\nSo I shouldn't mention that from start to finish you wouldn't have shed a single droplet of sweat, nor felt anything special, besides a ~~slight~~ tiny tickle?",
                                    "author": "TA_SD_EU",
                                    "id": "f4k010r",
                                    "parent_id": "t1_f4jh1ix",
                                    "score": 7,
                                    "created_utc": 1571630663.0,
                                    "replies": []
                                },
                                {
                                    "body": "Over at r/asktrp today they were bashing the SDs and SBs from seeking and this sub. Some those guys are messed up.",
                                    "author": "agjrpsl",
                                    "id": "f4jlsio",
                                    "parent_id": "t1_f4jh1ix",
                                    "score": 5,
                                    "created_utc": 1571621877.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f4jvblx",
                                            "parent_id": "t1_f4jlsio",
                                            "score": 15,
                                            "created_utc": 1571626969.0,
                                            "replies": [
                                                {
                                                    "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
                                                    "author": "willfromvb",
                                                    "id": "f4kllxh",
                                                    "parent_id": "t1_f4jvblx",
                                                    "score": 7,
                                                    "created_utc": 1571653893.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
                                                    "author": "agjrpsl",
                                                    "id": "f4jvqqp",
                                                    "parent_id": "t1_f4jvblx",
                                                    "score": 3,
                                                    "created_utc": 1571627201.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Please link the thread",
                                            "author": "Gremlin_baby",
                                            "id": "f4k22ir",
                                            "parent_id": "t1_f4jlsio",
                                            "score": 1,
                                            "created_utc": 1571632595.0,
                                            "replies": [
                                                {
                                                    "body": "The post starts with \" I recently signed up as a sugar daddy\".",
                                                    "author": "agjrpsl",
                                                    "id": "f4k2bx8",
                                                    "parent_id": "t1_f4k22ir",
                                                    "score": 3,
                                                    "created_utc": 1571632851.0,
                                                    "replies": [
                                                        {
                                                            "body": ":( I read it and now I feel sick",
                                                            "author": "Gremlin_baby",
                                                            "id": "f4k2xan",
                                                            "parent_id": "t1_f4k2bx8",
                                                            "score": 9,
                                                            "created_utc": 1571633445.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                                                                    "author": "MidwestSB",
                                                                    "id": "f4k6q74",
                                                                    "parent_id": "t1_f4k2xan",
                                                                    "score": 8,
                                                                    "created_utc": 1571637692.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                                                            "author": "2catsandacomputer",
                                                                            "id": "f4n81pw",
                                                                            "parent_id": "t1_f4k6q74",
                                                                            "score": 6,
                                                                            "created_utc": 1571686718.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                                                                    "author": "MidwestSB",
                                                                                    "id": "f4nezyu",
                                                                                    "parent_id": "t1_f4n81pw",
                                                                                    "score": 3,
                                                                                    "created_utc": 1571688771.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                                                                    "author": "RealEarthAngel",
                                                                                    "id": "f5xomb9",
                                                                                    "parent_id": "t1_f4n81pw",
                                                                                    "score": 2,
                                                                                    "created_utc": 1572543939.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                                                            "author": "kimchi_Queen",
                                                                            "id": "f5ia5fv",
                                                                            "parent_id": "t1_f4k6q74",
                                                                            "score": 3,
                                                                            "created_utc": 1572212442.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Some really twisted minds there. Have a great week.",
                                                                    "author": "agjrpsl",
                                                                    "id": "f4k3mdu",
                                                                    "parent_id": "t1_f4k2xan",
                                                                    "score": 4,
                                                                    "created_utc": 1571634165.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                                                                    "author": "brownandsweet",
                                                                    "id": "f4llonp",
                                                                    "parent_id": "t1_f4k2xan",
                                                                    "score": 4,
                                                                    "created_utc": 1571668618.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "No wonder it is so difficult to find a true SD.",
                                                                    "author": "socharmer",
                                                                    "id": "f4mxt9d",
                                                                    "parent_id": "t1_f4k2xan",
                                                                    "score": 4,
                                                                    "created_utc": 1571683577.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
                                                    "author": "captainIsBack4u",
                                                    "id": "f4mk9ji",
                                                    "parent_id": "t1_f4k22ir",
                                                    "score": 2,
                                                    "created_utc": 1571679373.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I would but I'm on mobile. It was from today like around 12 noon.",
                                                    "author": "agjrpsl",
                                                    "id": "f4k27e5",
                                                    "parent_id": "t1_f4k22ir",
                                                    "score": 1,
                                                    "created_utc": 1571632727.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Do guys really lie about their penis size?  Seems like something that's going to be proven false pretty easily in a sexual relationship. \n\nThen again, I have a big penis, so it's never occurred to me to lie about it. 🤷‍♂️",
                                    "author": null,
                                    "id": "f4mfd85",
                                    "parent_id": "t1_f4jh1ix",
                                    "score": 1,
                                    "created_utc": 1571677676.0,
                                    "replies": [
                                        {
                                            "body": "They never lie objectively - like they don't say \"I have a 10 inch dick\" when they're really a 5.5. They lie and say things like \"girls are always afraid it's too big\" and then whip out the 5.5. Or my favorite is the combo of lying AND trying to get out of wearing a condom - \"I can't wear those, I can only wear magnums\" as you're looking at their perfectly average size dick. \n\nIt's happened to me more times than I can count. My first SD use the mangum line - I never saw his dick to verify if it was accurate or not, but I doubted it based on the small tent he pitched.Mostly it's been vanilla guys though - always makes me roll my eyes.",
                                            "author": "MASugarBaby",
                                            "id": "f4miqgu",
                                            "parent_id": "t1_f4mfd85",
                                            "score": 5,
                                            "created_utc": 1571678845.0,
                                            "replies": [
                                                {
                                                    "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
                                                    "author": null,
                                                    "id": "f4nfvfs",
                                                    "parent_id": "t1_f4miqgu",
                                                    "score": 0,
                                                    "created_utc": 1571689023.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Totally, I have had a partner that was the best sex I've ever had. And he's a great and successful person, super nice and engaging. But idk we haven't had that click that i crave, and the amazing sex isn't enough to have me hounding him or trying to get back in his sheets.",
                                    "author": "kimchi_Queen",
                                    "id": "f5i6ujp",
                                    "parent_id": "t1_f4jh1ix",
                                    "score": 1,
                                    "created_utc": 1572211530.0,
                                    "replies": []
                                },
                                {
                                    "body": "I love when you start your messages \"In my experience\". When It really should say \"Im my limited expererience, here is what I have noticed.\" \n\nInstead, you come off like an authority on SR, and SD, when you've previously admitted you've only had 2 \"platonic\" relationships and only 1 intimate SR.\n\nIt's kind of hard to make blanket statements about SD sexual skills or dick size when you've only supposedly slept with 1 out of 3 of your SD.",
                                    "author": "ruphun",
                                    "id": "f4kmmhf",
                                    "parent_id": "t1_f4jh1ix",
                                    "score": -10,
                                    "created_utc": 1571654505.0,
                                    "replies": [
                                        {
                                            "body": "First of all: What does that have to do with her comment? Her comment is about men in dating apps. No where did she specifically say it was related to sugar dating. Just dating apps. Try again. \n\nSecond of all: what is the magical number we SBs are supposed to have to have enough experience without you bitching about us being \"pros\" or \"not SBs\". Is it 6? Because I wouldn't qualify. \n\nThird-party of all: she didn't even say anything inflammatory so I'm not sure why you're attacking her? Unless you felt personally attacked by the small size/self certified sex God comment, in which case, L O L.\n\nGod I wish your ban was permanent. Usually you're just annoying but now you're being a dick for no reason. You don't get to decide who is an SB and who isn't. So stop trying.",
                                            "author": "2catsandacomputer",
                                            "id": "f4miiuw",
                                            "parent_id": "t1_f4kmmhf",
                                            "score": 7,
                                            "created_utc": 1571678776.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think at the numbers of 0 my allowance will have 😂😂😂\n\nIf I’m feeling sarcastic I will play a bit and say « do you throw money in the bed or Chanel bags? »",
                            "author": "Lilipuss25",
                            "id": "f4jgysy",
                            "parent_id": "t1_f4jgdpz",
                            "score": 3,
                            "created_utc": 1571619362.0,
                            "replies": []
                        },
                        {
                            "body": "I take it with a grain of salt. Show don’t tell.\n\nBut I’m really good at reading people. I can usually pick the freaks/perverts/sex gods out of the crowd. I’m rarely surprised when I go to bed with someone anymore",
                            "author": "sweetnessalive",
                            "id": "f4kr47i",
                            "parent_id": "t1_f4jgdpz",
                            "score": 3,
                            "created_utc": 1571656510.0,
                            "replies": []
                        },
                        {
                            "body": "In the club during a private dance, I always ask guys what they love to do in bed. Every. Single. Person would say, \"I love going down on a girl. I love making a girl come and feel good, I'm unique in this I know.\nYeah ok dude, you just want to feed your already massively inflated ego and feel like your unusual in that you get off by feeling like you're so good that you can get a woman off. Ugh! No joke! Every single guy says the same thing!! \nSometimes ill even let them maybe show me their oral skills on my thigh or something, and 98% of the time they're just awful and going all over the place and they're so gross at it. Use articulated varying motions of your tongue and different pressure. Most just shove their face and tongue into it like they're a starving man that just got offered some tacos or ice cream.",
                            "author": "kimchi_Queen",
                            "id": "f5i6j42",
                            "parent_id": "t1_f4jgdpz",
                            "score": 3,
                            "created_utc": 1572211409.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And the opposite : The Nigerian prince. \"I'm willing to pay you $ 1000 to meet for coffee and need your bank details....",
            "author": "Dean_46",
            "id": "f4jxmfk",
            "parent_id": "t1_f4jcrg5",
            "score": 4,
            "created_utc": 1571628594.0,
            "replies": []
        },
        {
            "body": "Wait you need a membership to view private photos? I thought you have to request no matter what ?",
            "author": "cali1993",
            "id": "f4kb3v3",
            "parent_id": "t1_f4jcrg5",
            "score": 1,
            "created_utc": 1571643567.0,
            "replies": [
                {
                    "body": "you do have to request no matter what.\n\nbut, the request to view private photos message is the ONLY message a guy without a premium account can send. he can also view and favorite, and hope a SB takes note of one of those two.",
                    "author": "joc13",
                    "id": "f4kkghh",
                    "parent_id": "t1_f4kb3v3",
                    "score": 6,
                    "created_utc": 1571653173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha yes!!! Ugh I hate that! I even had it in my profile to not request my private photos right away because it's just so sleazy! So many times, I got either no message and a request, or a 'Hi i liked your profile, text me , REQUEST TO VIEW PRIVATE PHOTOS. \"\nToo many assume they are naked/explicit pics. I only had one other photo and it was just me doing yoga in a bikini. Which is actually a bit risque now that I see that in writing, but I know they were hoping for more and I hated it! One of the reasons I'm not on SA anymore.\nPrivate photos does not mean you get to see my privates!",
            "author": "kimchi_Queen",
            "id": "f5i5hah",
            "parent_id": "t1_f4jcrg5",
            "score": 1,
            "created_utc": 1572211121.0,
            "replies": []
        },
        {
            "body": "Then they get aggressive and curse you out 😂",
            "author": "brownandsweet",
            "id": "f4jjkt4",
            "parent_id": "t1_f4ji6in",
            "score": 21,
            "created_utc": 1571620737.0,
            "replies": []
        },
        {
            "body": "Yes!!! Soo annoying.",
            "author": "dolllll",
            "id": "f4uxyv9",
            "parent_id": "t1_f4ji6in",
            "score": 1,
            "created_utc": 1571832871.0,
            "replies": []
        },
        {
            "body": "Also Mr. Marriage: Wow, you're marriage material! Are you looking to get married at some point?",
            "author": "ChobitsGirl",
            "id": "f4of760",
            "parent_id": "t1_f4ldvde",
            "score": 2,
            "created_utc": 1571700781.0,
            "replies": []
        },
        {
            "body": "Yeah...I thought offering emails immediately equaled scam...WHOOPS!",
            "author": null,
            "id": "f4k2idx",
            "parent_id": "t1_f4jg387",
            "score": 5,
            "created_utc": 1571633030.0,
            "replies": [
                {
                    "body": "Rather than offering my email, I always say, “We can continue this conversation on WhatsApp, Kik or Telegram.” But email? No, I never offer it.",
                    "author": "gcatgc",
                    "id": "f4k63sw",
                    "parent_id": "t1_f4k2idx",
                    "score": 7,
                    "created_utc": 1571636943.0,
                    "replies": [
                        {
                            "body": "Telegrammmmmm.😂",
                            "author": null,
                            "id": "f4k6p6r",
                            "parent_id": "t1_f4k63sw",
                            "score": 6,
                            "created_utc": 1571637656.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, I don't offer email either. I also offer WhatsApp or Kik. I didn't mean it was EXACTLY what I say, just more or less the same spirit.",
                            "author": "Sanctemagne",
                            "id": "f4kbdrb",
                            "parent_id": "t1_f4k63sw",
                            "score": 1,
                            "created_utc": 1571643973.0,
                            "replies": []
                        },
                        {
                            "body": "Gotta get on Signal homie.",
                            "author": null,
                            "id": "f4r9xn0",
                            "parent_id": "t1_f4k63sw",
                            "score": 1,
                            "created_utc": 1571764803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really? The One In A Million gets an immediate report and block from me. Maybe I am losing out thinking that all of these are scammers just because they are brand new THAT DAY and have 2 million and up in net worth. 🤣🤣🤣",
            "author": "MidwestSB",
            "id": "f4k1vht",
            "parent_id": "t1_f4jg387",
            "score": 8,
            "created_utc": 1571632403.0,
            "replies": [
                {
                    "body": "Well I wouldn't be brand new that day, so at least there's that, haha.",
                    "author": "Sanctemagne",
                    "id": "f4kbcl5",
                    "parent_id": "t1_f4k1vht",
                    "score": 2,
                    "created_utc": 1571643922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think that was meant as in \"this guy THINKS he's one in a million\" (but actually comes off like a scammer). That's how I take those sorts of messages anyway.",
            "author": "MASugarBaby",
            "id": "f4n4ukl",
            "parent_id": "t1_f4jg387",
            "score": 2,
            "created_utc": 1571685723.0,
            "replies": [
                {
                    "body": "Oh, well I didn't think I was one in a million until this post told me I was, haha. Seriously though, might need to change my style then.",
                    "author": "Sanctemagne",
                    "id": "f4nxfr5",
                    "parent_id": "t1_f4n4ukl",
                    "score": 1,
                    "created_utc": 1571694020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Persistence is not a bad thing",
            "author": "girlz_are_42",
            "id": "f4kfi57",
            "parent_id": "t1_f4jrzni",
            "score": 4,
            "created_utc": 1571649619.0,
            "replies": []
        },
        {
            "body": "One in a Million is okay, just don’t discuss numbers until AFTER you’ve met. The ideal message for me: \n\n“Hi, Jane! Your profile caught my attention, and I’m glad I looked. I really like the fact that you enjoy expressing yourself. It’s like pulling teeth to get most to even write a sentence or two. Do you happen to have an interest in writing?\n\nOr\n\n“I love taking a jog down ocean drive, nothing beats palm trees blah blah blah..  (Referring to a photo of Jane on ocean drive) I am interested. Would you like to get coffee, have lunch or dinner sometime? Did you have an idea on how you would like to meet? You mentioned your interests. What are some of your favorite things to do?” \n\nIf she puts effort into her profile and pictures, use that to start a conversation. Let her know you’re interested and willing to meet.",
            "author": "brownandsweet",
            "id": "f4lhmsm",
            "parent_id": "t1_f4jcp1y",
            "score": 6,
            "created_utc": 1571667135.0,
            "replies": []
        },
        {
            "body": "They are all satirical. None of them are preferred. \n\nJust a simple \"Hi there, I was intrigued by your profile and was wondering if you would like to chat to see if we have anything in common?\" Or reference something in her profile. Or what you are looking for but it's too early to bring up $. \n\nIf you can't think of anything to say, ask her who her favorite Disney princess is and why.  Or some other conversation starter. What her favorite food is or if she is a cat or dog person.",
            "author": "MidwestSB",
            "id": "f4k275s",
            "parent_id": "t1_f4jcp1y",
            "score": 8,
            "created_utc": 1571632720.0,
            "replies": [
                {
                    "body": "\"None of them are preferred\" you say. The chicks just won't admit the message with CUM in capital letters works every time!",
                    "author": "highfructoseSD",
                    "id": "f4pl15p",
                    "parent_id": "t1_f4k275s",
                    "score": 5,
                    "created_utc": 1571736558.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f4l2jvo",
                    "parent_id": "t1_f4k275s",
                    "score": 0,
                    "created_utc": 1571661376.0,
                    "replies": [
                        {
                            "body": "Really? Providing an email address/phone number/kik profile in the first message is an absolute red flag that this guy is either a scammer or too cheap to buy a membership.",
                            "author": "MidwestSB",
                            "id": "f4me2ul",
                            "parent_id": "t1_f4l2jvo",
                            "score": 2,
                            "created_utc": 1571677229.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would say yes. I mean,  I'm not a SB and am subbed to this community because I like to read the posts. So, am answering you just as a woman.  The \"One In a Million\" description is the desired message.",
            "author": "Ld733k",
            "id": "f4k06kv",
            "parent_id": "t1_f4jcp1y",
            "score": 1,
            "created_utc": 1571630807.0,
            "replies": []
        },
        {
            "body": "God forbid 🤦🏾‍♀️\n\nSounds like that website is wild AF — my b#tthole just clenched 😅",
            "author": "EmilieBabie",
            "id": "f729f37",
            "parent_id": "t1_f4k6shi",
            "score": 3,
            "created_utc": 1573356301.0,
            "replies": []
        },
        {
            "body": "lol ditto",
            "author": "2fast-2curious",
            "id": "f4jg28q",
            "parent_id": "t1_f4jdbl1",
            "score": 2,
            "created_utc": 1571618903.0,
            "replies": []
        },
        {
            "body": "Same",
            "author": "girlz_are_42",
            "id": "f4kfdnf",
            "parent_id": "t1_f4jdbl1",
            "score": 2,
            "created_utc": 1571649519.0,
            "replies": []
        },
        {
            "body": "Is it safe to assume that \"in NYC / NJ\" is better translated as \"in NJ\"? I mean, do people in Manhattan ever say that they're \"in NYC / NJ\"?",
            "author": "2fast-2curious",
            "id": "f4jgig0",
            "parent_id": "t1_f4jdmgh",
            "score": 22,
            "created_utc": 1571619142.0,
            "replies": [
                {
                    "body": "I honestly have no idea. Lol. It’s irrelevant to me, I’m in Boston and I have no need or desire to travel for an arrangement.",
                    "author": "MASugarBaby",
                    "id": "f4jh94v",
                    "parent_id": "t1_f4jgig0",
                    "score": 3,
                    "created_utc": 1571619515.0,
                    "replies": []
                },
                {
                    "body": "Spot on. I've lived in Manhattan several years of my life. \n\nSaying I have a Greenwich/West Village 2Br apt has had a greater effect on my romantic relations than my wallet has ever had. I'd rather be caught cross dressing than with a NJ address.",
                    "author": "KeyToGramercy",
                    "id": "f4kcrg4",
                    "parent_id": "t1_f4jgig0",
                    "score": 5,
                    "created_utc": 1571646105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can o get jack’s number",
            "author": "Lilipuss25",
            "id": "f4jh3n9",
            "parent_id": "t1_f4jdmgh",
            "score": 8,
            "created_utc": 1571619431.0,
            "replies": []
        },
        {
            "body": "Hahahaha MASugarBaby, we’re email Eskimo sisters!! Good ole (Not Married) Jack wrote me 2 days ago with a similar message!!",
            "author": "LadyHormoneMonster",
            "id": "f4jg5dy",
            "parent_id": "t1_f4jdmgh",
            "score": 7,
            "created_utc": 1571618946.0,
            "replies": []
        },
        {
            "body": "Sadly yes lol. This was a common one before Sesta/Fosta",
            "author": "brownandsweet",
            "id": "f4ncg3u",
            "parent_id": "t1_f4n9d15",
            "score": 2,
            "created_utc": 1571688018.0,
            "replies": []
        },
        {
            "body": "I’m shocked how many can’t actually. I get pretty excited when I get a message with proper spelling and grammar. \n\nBut you also should collect SB messages. It would be funny.",
            "author": "MASugarBaby",
            "id": "f4lpzxs",
            "parent_id": "t1_f4jmt70",
            "score": 7,
            "created_utc": 1571670071.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f4jsq2l",
            "parent_id": "t1_f4jmt70",
            "score": 9,
            "created_utc": 1571625587.0,
            "replies": [
                {
                    "body": "Second this, absolutely shocking",
                    "author": null,
                    "id": "f4jxdyd",
                    "parent_id": "t1_f4jsq2l",
                    "score": 4,
                    "created_utc": 1571628410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please do. It would be very educational to read how not to start a chat with a POT :) (and funny!)",
            "author": "Kokhana",
            "id": "f4k8czd",
            "parent_id": "t1_f4jmt70",
            "score": 2,
            "created_utc": 1571639751.0,
            "replies": []
        },
        {
            "body": "Just curious, but what do women in general, or SBs in particular, think when a guy says he's great in bed?\n\nLike, every woman I've been with always tells me that I'm amazing in bed. I always say the same - I literally have told every woman I've been with that she's great. And it's not that they aren't, but it's rather meaningless and guys that say that come across as clueless IMO, but not sure how women think about that.",
            "author": "2fast-2curious",
            "id": "f4jgdpz",
            "parent_id": "t1_f4jd1df",
            "score": 16,
            "created_utc": 1571619069.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f4jj2iq",
                    "parent_id": "t1_f4jgdpz",
                    "score": 89,
                    "created_utc": 1571620474.0,
                    "replies": [
                        {
                            "body": "HAHAH!!! Omg read my comment above, I totally agree with you!! Hahahahahahaha ❤️",
                            "author": "kimchi_Queen",
                            "id": "f5i6lpn",
                            "parent_id": "t1_f4jj2iq",
                            "score": 1,
                            "created_utc": 1572211440.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue. Guys that actually have something to brag about don’t brag. It’s just like anyone who calls themselves and “alpha” is probably an insecure jackass. \n\nIn sugar it’s even more laughable. The audience of women who is giving the feedback is far form unbiased. How better to keep a guy enthralled with you than to flatter him and tell him how his old ass rocked your world. \n\nFinally, it’s sugar. Even if the guy is Casanova, I really don’t care. It could be a nice bonus, but ultimately good sex is not that important.",
                    "author": "MASugarBaby",
                    "id": "f4jh1ix",
                    "parent_id": "t1_f4jgdpz",
                    "score": 45,
                    "created_utc": 1571619401.0,
                    "replies": [
                        {
                            "body": "If he says he’s an alpha, he’s a beta 💁🏼‍♀️",
                            "author": null,
                            "id": "f4k2edq",
                            "parent_id": "t1_f4jh1ix",
                            "score": 9,
                            "created_utc": 1571632918.0,
                            "replies": []
                        },
                        {
                            "body": ">In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue.\n\nSo I shouldn't mention that from start to finish you wouldn't have shed a single droplet of sweat, nor felt anything special, besides a ~~slight~~ tiny tickle?",
                            "author": "TA_SD_EU",
                            "id": "f4k010r",
                            "parent_id": "t1_f4jh1ix",
                            "score": 7,
                            "created_utc": 1571630663.0,
                            "replies": []
                        },
                        {
                            "body": "Over at r/asktrp today they were bashing the SDs and SBs from seeking and this sub. Some those guys are messed up.",
                            "author": "agjrpsl",
                            "id": "f4jlsio",
                            "parent_id": "t1_f4jh1ix",
                            "score": 5,
                            "created_utc": 1571621877.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f4jvblx",
                                    "parent_id": "t1_f4jlsio",
                                    "score": 15,
                                    "created_utc": 1571626969.0,
                                    "replies": [
                                        {
                                            "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
                                            "author": "willfromvb",
                                            "id": "f4kllxh",
                                            "parent_id": "t1_f4jvblx",
                                            "score": 7,
                                            "created_utc": 1571653893.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
                                            "author": "agjrpsl",
                                            "id": "f4jvqqp",
                                            "parent_id": "t1_f4jvblx",
                                            "score": 3,
                                            "created_utc": 1571627201.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Please link the thread",
                                    "author": "Gremlin_baby",
                                    "id": "f4k22ir",
                                    "parent_id": "t1_f4jlsio",
                                    "score": 1,
                                    "created_utc": 1571632595.0,
                                    "replies": [
                                        {
                                            "body": "The post starts with \" I recently signed up as a sugar daddy\".",
                                            "author": "agjrpsl",
                                            "id": "f4k2bx8",
                                            "parent_id": "t1_f4k22ir",
                                            "score": 3,
                                            "created_utc": 1571632851.0,
                                            "replies": [
                                                {
                                                    "body": ":( I read it and now I feel sick",
                                                    "author": "Gremlin_baby",
                                                    "id": "f4k2xan",
                                                    "parent_id": "t1_f4k2bx8",
                                                    "score": 9,
                                                    "created_utc": 1571633445.0,
                                                    "replies": [
                                                        {
                                                            "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                                                            "author": "MidwestSB",
                                                            "id": "f4k6q74",
                                                            "parent_id": "t1_f4k2xan",
                                                            "score": 8,
                                                            "created_utc": 1571637692.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                                                    "author": "2catsandacomputer",
                                                                    "id": "f4n81pw",
                                                                    "parent_id": "t1_f4k6q74",
                                                                    "score": 6,
                                                                    "created_utc": 1571686718.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                                                            "author": "MidwestSB",
                                                                            "id": "f4nezyu",
                                                                            "parent_id": "t1_f4n81pw",
                                                                            "score": 3,
                                                                            "created_utc": 1571688771.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                                                            "author": "RealEarthAngel",
                                                                            "id": "f5xomb9",
                                                                            "parent_id": "t1_f4n81pw",
                                                                            "score": 2,
                                                                            "created_utc": 1572543939.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                                                    "author": "kimchi_Queen",
                                                                    "id": "f5ia5fv",
                                                                    "parent_id": "t1_f4k6q74",
                                                                    "score": 3,
                                                                    "created_utc": 1572212442.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Some really twisted minds there. Have a great week.",
                                                            "author": "agjrpsl",
                                                            "id": "f4k3mdu",
                                                            "parent_id": "t1_f4k2xan",
                                                            "score": 4,
                                                            "created_utc": 1571634165.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                                                            "author": "brownandsweet",
                                                            "id": "f4llonp",
                                                            "parent_id": "t1_f4k2xan",
                                                            "score": 4,
                                                            "created_utc": 1571668618.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "No wonder it is so difficult to find a true SD.",
                                                            "author": "socharmer",
                                                            "id": "f4mxt9d",
                                                            "parent_id": "t1_f4k2xan",
                                                            "score": 4,
                                                            "created_utc": 1571683577.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
                                            "author": "captainIsBack4u",
                                            "id": "f4mk9ji",
                                            "parent_id": "t1_f4k22ir",
                                            "score": 2,
                                            "created_utc": 1571679373.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I would but I'm on mobile. It was from today like around 12 noon.",
                                            "author": "agjrpsl",
                                            "id": "f4k27e5",
                                            "parent_id": "t1_f4k22ir",
                                            "score": 1,
                                            "created_utc": 1571632727.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Do guys really lie about their penis size?  Seems like something that's going to be proven false pretty easily in a sexual relationship. \n\nThen again, I have a big penis, so it's never occurred to me to lie about it. 🤷‍♂️",
                            "author": null,
                            "id": "f4mfd85",
                            "parent_id": "t1_f4jh1ix",
                            "score": 1,
                            "created_utc": 1571677676.0,
                            "replies": [
                                {
                                    "body": "They never lie objectively - like they don't say \"I have a 10 inch dick\" when they're really a 5.5. They lie and say things like \"girls are always afraid it's too big\" and then whip out the 5.5. Or my favorite is the combo of lying AND trying to get out of wearing a condom - \"I can't wear those, I can only wear magnums\" as you're looking at their perfectly average size dick. \n\nIt's happened to me more times than I can count. My first SD use the mangum line - I never saw his dick to verify if it was accurate or not, but I doubted it based on the small tent he pitched.Mostly it's been vanilla guys though - always makes me roll my eyes.",
                                    "author": "MASugarBaby",
                                    "id": "f4miqgu",
                                    "parent_id": "t1_f4mfd85",
                                    "score": 5,
                                    "created_utc": 1571678845.0,
                                    "replies": [
                                        {
                                            "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
                                            "author": null,
                                            "id": "f4nfvfs",
                                            "parent_id": "t1_f4miqgu",
                                            "score": 0,
                                            "created_utc": 1571689023.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Totally, I have had a partner that was the best sex I've ever had. And he's a great and successful person, super nice and engaging. But idk we haven't had that click that i crave, and the amazing sex isn't enough to have me hounding him or trying to get back in his sheets.",
                            "author": "kimchi_Queen",
                            "id": "f5i6ujp",
                            "parent_id": "t1_f4jh1ix",
                            "score": 1,
                            "created_utc": 1572211530.0,
                            "replies": []
                        },
                        {
                            "body": "I love when you start your messages \"In my experience\". When It really should say \"Im my limited expererience, here is what I have noticed.\" \n\nInstead, you come off like an authority on SR, and SD, when you've previously admitted you've only had 2 \"platonic\" relationships and only 1 intimate SR.\n\nIt's kind of hard to make blanket statements about SD sexual skills or dick size when you've only supposedly slept with 1 out of 3 of your SD.",
                            "author": "ruphun",
                            "id": "f4kmmhf",
                            "parent_id": "t1_f4jh1ix",
                            "score": -10,
                            "created_utc": 1571654505.0,
                            "replies": [
                                {
                                    "body": "First of all: What does that have to do with her comment? Her comment is about men in dating apps. No where did she specifically say it was related to sugar dating. Just dating apps. Try again. \n\nSecond of all: what is the magical number we SBs are supposed to have to have enough experience without you bitching about us being \"pros\" or \"not SBs\". Is it 6? Because I wouldn't qualify. \n\nThird-party of all: she didn't even say anything inflammatory so I'm not sure why you're attacking her? Unless you felt personally attacked by the small size/self certified sex God comment, in which case, L O L.\n\nGod I wish your ban was permanent. Usually you're just annoying but now you're being a dick for no reason. You don't get to decide who is an SB and who isn't. So stop trying.",
                                    "author": "2catsandacomputer",
                                    "id": "f4miiuw",
                                    "parent_id": "t1_f4kmmhf",
                                    "score": 7,
                                    "created_utc": 1571678776.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think at the numbers of 0 my allowance will have 😂😂😂\n\nIf I’m feeling sarcastic I will play a bit and say « do you throw money in the bed or Chanel bags? »",
                    "author": "Lilipuss25",
                    "id": "f4jgysy",
                    "parent_id": "t1_f4jgdpz",
                    "score": 3,
                    "created_utc": 1571619362.0,
                    "replies": []
                },
                {
                    "body": "I take it with a grain of salt. Show don’t tell.\n\nBut I’m really good at reading people. I can usually pick the freaks/perverts/sex gods out of the crowd. I’m rarely surprised when I go to bed with someone anymore",
                    "author": "sweetnessalive",
                    "id": "f4kr47i",
                    "parent_id": "t1_f4jgdpz",
                    "score": 3,
                    "created_utc": 1571656510.0,
                    "replies": []
                },
                {
                    "body": "In the club during a private dance, I always ask guys what they love to do in bed. Every. Single. Person would say, \"I love going down on a girl. I love making a girl come and feel good, I'm unique in this I know.\nYeah ok dude, you just want to feed your already massively inflated ego and feel like your unusual in that you get off by feeling like you're so good that you can get a woman off. Ugh! No joke! Every single guy says the same thing!! \nSometimes ill even let them maybe show me their oral skills on my thigh or something, and 98% of the time they're just awful and going all over the place and they're so gross at it. Use articulated varying motions of your tongue and different pressure. Most just shove their face and tongue into it like they're a starving man that just got offered some tacos or ice cream.",
                    "author": "kimchi_Queen",
                    "id": "f5i6j42",
                    "parent_id": "t1_f4jgdpz",
                    "score": 3,
                    "created_utc": 1572211409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you do have to request no matter what.\n\nbut, the request to view private photos message is the ONLY message a guy without a premium account can send. he can also view and favorite, and hope a SB takes note of one of those two.",
            "author": "joc13",
            "id": "f4kkghh",
            "parent_id": "t1_f4kb3v3",
            "score": 6,
            "created_utc": 1571653173.0,
            "replies": []
        },
        {
            "body": "Rather than offering my email, I always say, “We can continue this conversation on WhatsApp, Kik or Telegram.” But email? No, I never offer it.",
            "author": "gcatgc",
            "id": "f4k63sw",
            "parent_id": "t1_f4k2idx",
            "score": 7,
            "created_utc": 1571636943.0,
            "replies": [
                {
                    "body": "Telegrammmmmm.😂",
                    "author": null,
                    "id": "f4k6p6r",
                    "parent_id": "t1_f4k63sw",
                    "score": 6,
                    "created_utc": 1571637656.0,
                    "replies": []
                },
                {
                    "body": "Yeah, I don't offer email either. I also offer WhatsApp or Kik. I didn't mean it was EXACTLY what I say, just more or less the same spirit.",
                    "author": "Sanctemagne",
                    "id": "f4kbdrb",
                    "parent_id": "t1_f4k63sw",
                    "score": 1,
                    "created_utc": 1571643973.0,
                    "replies": []
                },
                {
                    "body": "Gotta get on Signal homie.",
                    "author": null,
                    "id": "f4r9xn0",
                    "parent_id": "t1_f4k63sw",
                    "score": 1,
                    "created_utc": 1571764803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I wouldn't be brand new that day, so at least there's that, haha.",
            "author": "Sanctemagne",
            "id": "f4kbcl5",
            "parent_id": "t1_f4k1vht",
            "score": 2,
            "created_utc": 1571643922.0,
            "replies": []
        },
        {
            "body": "Oh, well I didn't think I was one in a million until this post told me I was, haha. Seriously though, might need to change my style then.",
            "author": "Sanctemagne",
            "id": "f4nxfr5",
            "parent_id": "t1_f4n4ukl",
            "score": 1,
            "created_utc": 1571694020.0,
            "replies": []
        },
        {
            "body": "\"None of them are preferred\" you say. The chicks just won't admit the message with CUM in capital letters works every time!",
            "author": "highfructoseSD",
            "id": "f4pl15p",
            "parent_id": "t1_f4k275s",
            "score": 5,
            "created_utc": 1571736558.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f4l2jvo",
            "parent_id": "t1_f4k275s",
            "score": 0,
            "created_utc": 1571661376.0,
            "replies": [
                {
                    "body": "Really? Providing an email address/phone number/kik profile in the first message is an absolute red flag that this guy is either a scammer or too cheap to buy a membership.",
                    "author": "MidwestSB",
                    "id": "f4me2ul",
                    "parent_id": "t1_f4l2jvo",
                    "score": 2,
                    "created_utc": 1571677229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I honestly have no idea. Lol. It’s irrelevant to me, I’m in Boston and I have no need or desire to travel for an arrangement.",
            "author": "MASugarBaby",
            "id": "f4jh94v",
            "parent_id": "t1_f4jgig0",
            "score": 3,
            "created_utc": 1571619515.0,
            "replies": []
        },
        {
            "body": "Spot on. I've lived in Manhattan several years of my life. \n\nSaying I have a Greenwich/West Village 2Br apt has had a greater effect on my romantic relations than my wallet has ever had. I'd rather be caught cross dressing than with a NJ address.",
            "author": "KeyToGramercy",
            "id": "f4kcrg4",
            "parent_id": "t1_f4jgig0",
            "score": 5,
            "created_utc": 1571646105.0,
            "replies": []
        },
        {
            "body": "Second this, absolutely shocking",
            "author": null,
            "id": "f4jxdyd",
            "parent_id": "t1_f4jsq2l",
            "score": 4,
            "created_utc": 1571628410.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f4jj2iq",
            "parent_id": "t1_f4jgdpz",
            "score": 89,
            "created_utc": 1571620474.0,
            "replies": [
                {
                    "body": "HAHAH!!! Omg read my comment above, I totally agree with you!! Hahahahahahaha ❤️",
                    "author": "kimchi_Queen",
                    "id": "f5i6lpn",
                    "parent_id": "t1_f4jj2iq",
                    "score": 1,
                    "created_utc": 1572211440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue. Guys that actually have something to brag about don’t brag. It’s just like anyone who calls themselves and “alpha” is probably an insecure jackass. \n\nIn sugar it’s even more laughable. The audience of women who is giving the feedback is far form unbiased. How better to keep a guy enthralled with you than to flatter him and tell him how his old ass rocked your world. \n\nFinally, it’s sugar. Even if the guy is Casanova, I really don’t care. It could be a nice bonus, but ultimately good sex is not that important.",
            "author": "MASugarBaby",
            "id": "f4jh1ix",
            "parent_id": "t1_f4jgdpz",
            "score": 45,
            "created_utc": 1571619401.0,
            "replies": [
                {
                    "body": "If he says he’s an alpha, he’s a beta 💁🏼‍♀️",
                    "author": null,
                    "id": "f4k2edq",
                    "parent_id": "t1_f4jh1ix",
                    "score": 9,
                    "created_utc": 1571632918.0,
                    "replies": []
                },
                {
                    "body": ">In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue.\n\nSo I shouldn't mention that from start to finish you wouldn't have shed a single droplet of sweat, nor felt anything special, besides a ~~slight~~ tiny tickle?",
                    "author": "TA_SD_EU",
                    "id": "f4k010r",
                    "parent_id": "t1_f4jh1ix",
                    "score": 7,
                    "created_utc": 1571630663.0,
                    "replies": []
                },
                {
                    "body": "Over at r/asktrp today they were bashing the SDs and SBs from seeking and this sub. Some those guys are messed up.",
                    "author": "agjrpsl",
                    "id": "f4jlsio",
                    "parent_id": "t1_f4jh1ix",
                    "score": 5,
                    "created_utc": 1571621877.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f4jvblx",
                            "parent_id": "t1_f4jlsio",
                            "score": 15,
                            "created_utc": 1571626969.0,
                            "replies": [
                                {
                                    "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
                                    "author": "willfromvb",
                                    "id": "f4kllxh",
                                    "parent_id": "t1_f4jvblx",
                                    "score": 7,
                                    "created_utc": 1571653893.0,
                                    "replies": []
                                },
                                {
                                    "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
                                    "author": "agjrpsl",
                                    "id": "f4jvqqp",
                                    "parent_id": "t1_f4jvblx",
                                    "score": 3,
                                    "created_utc": 1571627201.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Please link the thread",
                            "author": "Gremlin_baby",
                            "id": "f4k22ir",
                            "parent_id": "t1_f4jlsio",
                            "score": 1,
                            "created_utc": 1571632595.0,
                            "replies": [
                                {
                                    "body": "The post starts with \" I recently signed up as a sugar daddy\".",
                                    "author": "agjrpsl",
                                    "id": "f4k2bx8",
                                    "parent_id": "t1_f4k22ir",
                                    "score": 3,
                                    "created_utc": 1571632851.0,
                                    "replies": [
                                        {
                                            "body": ":( I read it and now I feel sick",
                                            "author": "Gremlin_baby",
                                            "id": "f4k2xan",
                                            "parent_id": "t1_f4k2bx8",
                                            "score": 9,
                                            "created_utc": 1571633445.0,
                                            "replies": [
                                                {
                                                    "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                                                    "author": "MidwestSB",
                                                    "id": "f4k6q74",
                                                    "parent_id": "t1_f4k2xan",
                                                    "score": 8,
                                                    "created_utc": 1571637692.0,
                                                    "replies": [
                                                        {
                                                            "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                                            "author": "2catsandacomputer",
                                                            "id": "f4n81pw",
                                                            "parent_id": "t1_f4k6q74",
                                                            "score": 6,
                                                            "created_utc": 1571686718.0,
                                                            "replies": [
                                                                {
                                                                    "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                                                    "author": "MidwestSB",
                                                                    "id": "f4nezyu",
                                                                    "parent_id": "t1_f4n81pw",
                                                                    "score": 3,
                                                                    "created_utc": 1571688771.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                                                    "author": "RealEarthAngel",
                                                                    "id": "f5xomb9",
                                                                    "parent_id": "t1_f4n81pw",
                                                                    "score": 2,
                                                                    "created_utc": 1572543939.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                                            "author": "kimchi_Queen",
                                                            "id": "f5ia5fv",
                                                            "parent_id": "t1_f4k6q74",
                                                            "score": 3,
                                                            "created_utc": 1572212442.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Some really twisted minds there. Have a great week.",
                                                    "author": "agjrpsl",
                                                    "id": "f4k3mdu",
                                                    "parent_id": "t1_f4k2xan",
                                                    "score": 4,
                                                    "created_utc": 1571634165.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                                                    "author": "brownandsweet",
                                                    "id": "f4llonp",
                                                    "parent_id": "t1_f4k2xan",
                                                    "score": 4,
                                                    "created_utc": 1571668618.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "No wonder it is so difficult to find a true SD.",
                                                    "author": "socharmer",
                                                    "id": "f4mxt9d",
                                                    "parent_id": "t1_f4k2xan",
                                                    "score": 4,
                                                    "created_utc": 1571683577.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
                                    "author": "captainIsBack4u",
                                    "id": "f4mk9ji",
                                    "parent_id": "t1_f4k22ir",
                                    "score": 2,
                                    "created_utc": 1571679373.0,
                                    "replies": []
                                },
                                {
                                    "body": "I would but I'm on mobile. It was from today like around 12 noon.",
                                    "author": "agjrpsl",
                                    "id": "f4k27e5",
                                    "parent_id": "t1_f4k22ir",
                                    "score": 1,
                                    "created_utc": 1571632727.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Do guys really lie about their penis size?  Seems like something that's going to be proven false pretty easily in a sexual relationship. \n\nThen again, I have a big penis, so it's never occurred to me to lie about it. 🤷‍♂️",
                    "author": null,
                    "id": "f4mfd85",
                    "parent_id": "t1_f4jh1ix",
                    "score": 1,
                    "created_utc": 1571677676.0,
                    "replies": [
                        {
                            "body": "They never lie objectively - like they don't say \"I have a 10 inch dick\" when they're really a 5.5. They lie and say things like \"girls are always afraid it's too big\" and then whip out the 5.5. Or my favorite is the combo of lying AND trying to get out of wearing a condom - \"I can't wear those, I can only wear magnums\" as you're looking at their perfectly average size dick. \n\nIt's happened to me more times than I can count. My first SD use the mangum line - I never saw his dick to verify if it was accurate or not, but I doubted it based on the small tent he pitched.Mostly it's been vanilla guys though - always makes me roll my eyes.",
                            "author": "MASugarBaby",
                            "id": "f4miqgu",
                            "parent_id": "t1_f4mfd85",
                            "score": 5,
                            "created_utc": 1571678845.0,
                            "replies": [
                                {
                                    "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
                                    "author": null,
                                    "id": "f4nfvfs",
                                    "parent_id": "t1_f4miqgu",
                                    "score": 0,
                                    "created_utc": 1571689023.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Totally, I have had a partner that was the best sex I've ever had. And he's a great and successful person, super nice and engaging. But idk we haven't had that click that i crave, and the amazing sex isn't enough to have me hounding him or trying to get back in his sheets.",
                    "author": "kimchi_Queen",
                    "id": "f5i6ujp",
                    "parent_id": "t1_f4jh1ix",
                    "score": 1,
                    "created_utc": 1572211530.0,
                    "replies": []
                },
                {
                    "body": "I love when you start your messages \"In my experience\". When It really should say \"Im my limited expererience, here is what I have noticed.\" \n\nInstead, you come off like an authority on SR, and SD, when you've previously admitted you've only had 2 \"platonic\" relationships and only 1 intimate SR.\n\nIt's kind of hard to make blanket statements about SD sexual skills or dick size when you've only supposedly slept with 1 out of 3 of your SD.",
                    "author": "ruphun",
                    "id": "f4kmmhf",
                    "parent_id": "t1_f4jh1ix",
                    "score": -10,
                    "created_utc": 1571654505.0,
                    "replies": [
                        {
                            "body": "First of all: What does that have to do with her comment? Her comment is about men in dating apps. No where did she specifically say it was related to sugar dating. Just dating apps. Try again. \n\nSecond of all: what is the magical number we SBs are supposed to have to have enough experience without you bitching about us being \"pros\" or \"not SBs\". Is it 6? Because I wouldn't qualify. \n\nThird-party of all: she didn't even say anything inflammatory so I'm not sure why you're attacking her? Unless you felt personally attacked by the small size/self certified sex God comment, in which case, L O L.\n\nGod I wish your ban was permanent. Usually you're just annoying but now you're being a dick for no reason. You don't get to decide who is an SB and who isn't. So stop trying.",
                            "author": "2catsandacomputer",
                            "id": "f4miiuw",
                            "parent_id": "t1_f4kmmhf",
                            "score": 7,
                            "created_utc": 1571678776.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think at the numbers of 0 my allowance will have 😂😂😂\n\nIf I’m feeling sarcastic I will play a bit and say « do you throw money in the bed or Chanel bags? »",
            "author": "Lilipuss25",
            "id": "f4jgysy",
            "parent_id": "t1_f4jgdpz",
            "score": 3,
            "created_utc": 1571619362.0,
            "replies": []
        },
        {
            "body": "I take it with a grain of salt. Show don’t tell.\n\nBut I’m really good at reading people. I can usually pick the freaks/perverts/sex gods out of the crowd. I’m rarely surprised when I go to bed with someone anymore",
            "author": "sweetnessalive",
            "id": "f4kr47i",
            "parent_id": "t1_f4jgdpz",
            "score": 3,
            "created_utc": 1571656510.0,
            "replies": []
        },
        {
            "body": "In the club during a private dance, I always ask guys what they love to do in bed. Every. Single. Person would say, \"I love going down on a girl. I love making a girl come and feel good, I'm unique in this I know.\nYeah ok dude, you just want to feed your already massively inflated ego and feel like your unusual in that you get off by feeling like you're so good that you can get a woman off. Ugh! No joke! Every single guy says the same thing!! \nSometimes ill even let them maybe show me their oral skills on my thigh or something, and 98% of the time they're just awful and going all over the place and they're so gross at it. Use articulated varying motions of your tongue and different pressure. Most just shove their face and tongue into it like they're a starving man that just got offered some tacos or ice cream.",
            "author": "kimchi_Queen",
            "id": "f5i6j42",
            "parent_id": "t1_f4jgdpz",
            "score": 3,
            "created_utc": 1572211409.0,
            "replies": []
        },
        {
            "body": "Telegrammmmmm.😂",
            "author": null,
            "id": "f4k6p6r",
            "parent_id": "t1_f4k63sw",
            "score": 6,
            "created_utc": 1571637656.0,
            "replies": []
        },
        {
            "body": "Yeah, I don't offer email either. I also offer WhatsApp or Kik. I didn't mean it was EXACTLY what I say, just more or less the same spirit.",
            "author": "Sanctemagne",
            "id": "f4kbdrb",
            "parent_id": "t1_f4k63sw",
            "score": 1,
            "created_utc": 1571643973.0,
            "replies": []
        },
        {
            "body": "Gotta get on Signal homie.",
            "author": null,
            "id": "f4r9xn0",
            "parent_id": "t1_f4k63sw",
            "score": 1,
            "created_utc": 1571764803.0,
            "replies": []
        },
        {
            "body": "Really? Providing an email address/phone number/kik profile in the first message is an absolute red flag that this guy is either a scammer or too cheap to buy a membership.",
            "author": "MidwestSB",
            "id": "f4me2ul",
            "parent_id": "t1_f4l2jvo",
            "score": 2,
            "created_utc": 1571677229.0,
            "replies": []
        },
        {
            "body": "HAHAH!!! Omg read my comment above, I totally agree with you!! Hahahahahahaha ❤️",
            "author": "kimchi_Queen",
            "id": "f5i6lpn",
            "parent_id": "t1_f4jj2iq",
            "score": 1,
            "created_utc": 1572211440.0,
            "replies": []
        },
        {
            "body": "If he says he’s an alpha, he’s a beta 💁🏼‍♀️",
            "author": null,
            "id": "f4k2edq",
            "parent_id": "t1_f4jh1ix",
            "score": 9,
            "created_utc": 1571632918.0,
            "replies": []
        },
        {
            "body": ">In my experience anything that a guy says about his own sexual skills or dick size in the context of any type of dating app and/or general flirting is flatly untrue.\n\nSo I shouldn't mention that from start to finish you wouldn't have shed a single droplet of sweat, nor felt anything special, besides a ~~slight~~ tiny tickle?",
            "author": "TA_SD_EU",
            "id": "f4k010r",
            "parent_id": "t1_f4jh1ix",
            "score": 7,
            "created_utc": 1571630663.0,
            "replies": []
        },
        {
            "body": "Over at r/asktrp today they were bashing the SDs and SBs from seeking and this sub. Some those guys are messed up.",
            "author": "agjrpsl",
            "id": "f4jlsio",
            "parent_id": "t1_f4jh1ix",
            "score": 5,
            "created_utc": 1571621877.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f4jvblx",
                    "parent_id": "t1_f4jlsio",
                    "score": 15,
                    "created_utc": 1571626969.0,
                    "replies": [
                        {
                            "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
                            "author": "willfromvb",
                            "id": "f4kllxh",
                            "parent_id": "t1_f4jvblx",
                            "score": 7,
                            "created_utc": 1571653893.0,
                            "replies": []
                        },
                        {
                            "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
                            "author": "agjrpsl",
                            "id": "f4jvqqp",
                            "parent_id": "t1_f4jvblx",
                            "score": 3,
                            "created_utc": 1571627201.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Please link the thread",
                    "author": "Gremlin_baby",
                    "id": "f4k22ir",
                    "parent_id": "t1_f4jlsio",
                    "score": 1,
                    "created_utc": 1571632595.0,
                    "replies": [
                        {
                            "body": "The post starts with \" I recently signed up as a sugar daddy\".",
                            "author": "agjrpsl",
                            "id": "f4k2bx8",
                            "parent_id": "t1_f4k22ir",
                            "score": 3,
                            "created_utc": 1571632851.0,
                            "replies": [
                                {
                                    "body": ":( I read it and now I feel sick",
                                    "author": "Gremlin_baby",
                                    "id": "f4k2xan",
                                    "parent_id": "t1_f4k2bx8",
                                    "score": 9,
                                    "created_utc": 1571633445.0,
                                    "replies": [
                                        {
                                            "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                                            "author": "MidwestSB",
                                            "id": "f4k6q74",
                                            "parent_id": "t1_f4k2xan",
                                            "score": 8,
                                            "created_utc": 1571637692.0,
                                            "replies": [
                                                {
                                                    "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                                    "author": "2catsandacomputer",
                                                    "id": "f4n81pw",
                                                    "parent_id": "t1_f4k6q74",
                                                    "score": 6,
                                                    "created_utc": 1571686718.0,
                                                    "replies": [
                                                        {
                                                            "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                                            "author": "MidwestSB",
                                                            "id": "f4nezyu",
                                                            "parent_id": "t1_f4n81pw",
                                                            "score": 3,
                                                            "created_utc": 1571688771.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                                            "author": "RealEarthAngel",
                                                            "id": "f5xomb9",
                                                            "parent_id": "t1_f4n81pw",
                                                            "score": 2,
                                                            "created_utc": 1572543939.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                                    "author": "kimchi_Queen",
                                                    "id": "f5ia5fv",
                                                    "parent_id": "t1_f4k6q74",
                                                    "score": 3,
                                                    "created_utc": 1572212442.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Some really twisted minds there. Have a great week.",
                                            "author": "agjrpsl",
                                            "id": "f4k3mdu",
                                            "parent_id": "t1_f4k2xan",
                                            "score": 4,
                                            "created_utc": 1571634165.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                                            "author": "brownandsweet",
                                            "id": "f4llonp",
                                            "parent_id": "t1_f4k2xan",
                                            "score": 4,
                                            "created_utc": 1571668618.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "No wonder it is so difficult to find a true SD.",
                                            "author": "socharmer",
                                            "id": "f4mxt9d",
                                            "parent_id": "t1_f4k2xan",
                                            "score": 4,
                                            "created_utc": 1571683577.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
                            "author": "captainIsBack4u",
                            "id": "f4mk9ji",
                            "parent_id": "t1_f4k22ir",
                            "score": 2,
                            "created_utc": 1571679373.0,
                            "replies": []
                        },
                        {
                            "body": "I would but I'm on mobile. It was from today like around 12 noon.",
                            "author": "agjrpsl",
                            "id": "f4k27e5",
                            "parent_id": "t1_f4k22ir",
                            "score": 1,
                            "created_utc": 1571632727.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do guys really lie about their penis size?  Seems like something that's going to be proven false pretty easily in a sexual relationship. \n\nThen again, I have a big penis, so it's never occurred to me to lie about it. 🤷‍♂️",
            "author": null,
            "id": "f4mfd85",
            "parent_id": "t1_f4jh1ix",
            "score": 1,
            "created_utc": 1571677676.0,
            "replies": [
                {
                    "body": "They never lie objectively - like they don't say \"I have a 10 inch dick\" when they're really a 5.5. They lie and say things like \"girls are always afraid it's too big\" and then whip out the 5.5. Or my favorite is the combo of lying AND trying to get out of wearing a condom - \"I can't wear those, I can only wear magnums\" as you're looking at their perfectly average size dick. \n\nIt's happened to me more times than I can count. My first SD use the mangum line - I never saw his dick to verify if it was accurate or not, but I doubted it based on the small tent he pitched.Mostly it's been vanilla guys though - always makes me roll my eyes.",
                    "author": "MASugarBaby",
                    "id": "f4miqgu",
                    "parent_id": "t1_f4mfd85",
                    "score": 5,
                    "created_utc": 1571678845.0,
                    "replies": [
                        {
                            "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
                            "author": null,
                            "id": "f4nfvfs",
                            "parent_id": "t1_f4miqgu",
                            "score": 0,
                            "created_utc": 1571689023.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally, I have had a partner that was the best sex I've ever had. And he's a great and successful person, super nice and engaging. But idk we haven't had that click that i crave, and the amazing sex isn't enough to have me hounding him or trying to get back in his sheets.",
            "author": "kimchi_Queen",
            "id": "f5i6ujp",
            "parent_id": "t1_f4jh1ix",
            "score": 1,
            "created_utc": 1572211530.0,
            "replies": []
        },
        {
            "body": "I love when you start your messages \"In my experience\". When It really should say \"Im my limited expererience, here is what I have noticed.\" \n\nInstead, you come off like an authority on SR, and SD, when you've previously admitted you've only had 2 \"platonic\" relationships and only 1 intimate SR.\n\nIt's kind of hard to make blanket statements about SD sexual skills or dick size when you've only supposedly slept with 1 out of 3 of your SD.",
            "author": "ruphun",
            "id": "f4kmmhf",
            "parent_id": "t1_f4jh1ix",
            "score": -10,
            "created_utc": 1571654505.0,
            "replies": [
                {
                    "body": "First of all: What does that have to do with her comment? Her comment is about men in dating apps. No where did she specifically say it was related to sugar dating. Just dating apps. Try again. \n\nSecond of all: what is the magical number we SBs are supposed to have to have enough experience without you bitching about us being \"pros\" or \"not SBs\". Is it 6? Because I wouldn't qualify. \n\nThird-party of all: she didn't even say anything inflammatory so I'm not sure why you're attacking her? Unless you felt personally attacked by the small size/self certified sex God comment, in which case, L O L.\n\nGod I wish your ban was permanent. Usually you're just annoying but now you're being a dick for no reason. You don't get to decide who is an SB and who isn't. So stop trying.",
                    "author": "2catsandacomputer",
                    "id": "f4miiuw",
                    "parent_id": "t1_f4kmmhf",
                    "score": 7,
                    "created_utc": 1571678776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f4jvblx",
            "parent_id": "t1_f4jlsio",
            "score": 15,
            "created_utc": 1571626969.0,
            "replies": [
                {
                    "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
                    "author": "willfromvb",
                    "id": "f4kllxh",
                    "parent_id": "t1_f4jvblx",
                    "score": 7,
                    "created_utc": 1571653893.0,
                    "replies": []
                },
                {
                    "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
                    "author": "agjrpsl",
                    "id": "f4jvqqp",
                    "parent_id": "t1_f4jvblx",
                    "score": 3,
                    "created_utc": 1571627201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please link the thread",
            "author": "Gremlin_baby",
            "id": "f4k22ir",
            "parent_id": "t1_f4jlsio",
            "score": 1,
            "created_utc": 1571632595.0,
            "replies": [
                {
                    "body": "The post starts with \" I recently signed up as a sugar daddy\".",
                    "author": "agjrpsl",
                    "id": "f4k2bx8",
                    "parent_id": "t1_f4k22ir",
                    "score": 3,
                    "created_utc": 1571632851.0,
                    "replies": [
                        {
                            "body": ":( I read it and now I feel sick",
                            "author": "Gremlin_baby",
                            "id": "f4k2xan",
                            "parent_id": "t1_f4k2bx8",
                            "score": 9,
                            "created_utc": 1571633445.0,
                            "replies": [
                                {
                                    "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                                    "author": "MidwestSB",
                                    "id": "f4k6q74",
                                    "parent_id": "t1_f4k2xan",
                                    "score": 8,
                                    "created_utc": 1571637692.0,
                                    "replies": [
                                        {
                                            "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                            "author": "2catsandacomputer",
                                            "id": "f4n81pw",
                                            "parent_id": "t1_f4k6q74",
                                            "score": 6,
                                            "created_utc": 1571686718.0,
                                            "replies": [
                                                {
                                                    "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                                    "author": "MidwestSB",
                                                    "id": "f4nezyu",
                                                    "parent_id": "t1_f4n81pw",
                                                    "score": 3,
                                                    "created_utc": 1571688771.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                                    "author": "RealEarthAngel",
                                                    "id": "f5xomb9",
                                                    "parent_id": "t1_f4n81pw",
                                                    "score": 2,
                                                    "created_utc": 1572543939.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                            "author": "kimchi_Queen",
                                            "id": "f5ia5fv",
                                            "parent_id": "t1_f4k6q74",
                                            "score": 3,
                                            "created_utc": 1572212442.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Some really twisted minds there. Have a great week.",
                                    "author": "agjrpsl",
                                    "id": "f4k3mdu",
                                    "parent_id": "t1_f4k2xan",
                                    "score": 4,
                                    "created_utc": 1571634165.0,
                                    "replies": []
                                },
                                {
                                    "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                                    "author": "brownandsweet",
                                    "id": "f4llonp",
                                    "parent_id": "t1_f4k2xan",
                                    "score": 4,
                                    "created_utc": 1571668618.0,
                                    "replies": []
                                },
                                {
                                    "body": "No wonder it is so difficult to find a true SD.",
                                    "author": "socharmer",
                                    "id": "f4mxt9d",
                                    "parent_id": "t1_f4k2xan",
                                    "score": 4,
                                    "created_utc": 1571683577.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
                    "author": "captainIsBack4u",
                    "id": "f4mk9ji",
                    "parent_id": "t1_f4k22ir",
                    "score": 2,
                    "created_utc": 1571679373.0,
                    "replies": []
                },
                {
                    "body": "I would but I'm on mobile. It was from today like around 12 noon.",
                    "author": "agjrpsl",
                    "id": "f4k27e5",
                    "parent_id": "t1_f4k22ir",
                    "score": 1,
                    "created_utc": 1571632727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They never lie objectively - like they don't say \"I have a 10 inch dick\" when they're really a 5.5. They lie and say things like \"girls are always afraid it's too big\" and then whip out the 5.5. Or my favorite is the combo of lying AND trying to get out of wearing a condom - \"I can't wear those, I can only wear magnums\" as you're looking at their perfectly average size dick. \n\nIt's happened to me more times than I can count. My first SD use the mangum line - I never saw his dick to verify if it was accurate or not, but I doubted it based on the small tent he pitched.Mostly it's been vanilla guys though - always makes me roll my eyes.",
            "author": "MASugarBaby",
            "id": "f4miqgu",
            "parent_id": "t1_f4mfd85",
            "score": 5,
            "created_utc": 1571678845.0,
            "replies": [
                {
                    "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
                    "author": null,
                    "id": "f4nfvfs",
                    "parent_id": "t1_f4miqgu",
                    "score": 0,
                    "created_utc": 1571689023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First of all: What does that have to do with her comment? Her comment is about men in dating apps. No where did she specifically say it was related to sugar dating. Just dating apps. Try again. \n\nSecond of all: what is the magical number we SBs are supposed to have to have enough experience without you bitching about us being \"pros\" or \"not SBs\". Is it 6? Because I wouldn't qualify. \n\nThird-party of all: she didn't even say anything inflammatory so I'm not sure why you're attacking her? Unless you felt personally attacked by the small size/self certified sex God comment, in which case, L O L.\n\nGod I wish your ban was permanent. Usually you're just annoying but now you're being a dick for no reason. You don't get to decide who is an SB and who isn't. So stop trying.",
            "author": "2catsandacomputer",
            "id": "f4miiuw",
            "parent_id": "t1_f4kmmhf",
            "score": 7,
            "created_utc": 1571678776.0,
            "replies": []
        },
        {
            "body": "The scary part is that that Sub has more members than this Sub and 6X as many members online!  I thought this type of thinking was more fringe!!",
            "author": "willfromvb",
            "id": "f4kllxh",
            "parent_id": "t1_f4jvblx",
            "score": 7,
            "created_utc": 1571653893.0,
            "replies": []
        },
        {
            "body": "haha true. they are full of themselves lol. a lot of issues with those boys.",
            "author": "agjrpsl",
            "id": "f4jvqqp",
            "parent_id": "t1_f4jvblx",
            "score": 3,
            "created_utc": 1571627201.0,
            "replies": []
        },
        {
            "body": "The post starts with \" I recently signed up as a sugar daddy\".",
            "author": "agjrpsl",
            "id": "f4k2bx8",
            "parent_id": "t1_f4k22ir",
            "score": 3,
            "created_utc": 1571632851.0,
            "replies": [
                {
                    "body": ":( I read it and now I feel sick",
                    "author": "Gremlin_baby",
                    "id": "f4k2xan",
                    "parent_id": "t1_f4k2bx8",
                    "score": 9,
                    "created_utc": 1571633445.0,
                    "replies": [
                        {
                            "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                            "author": "MidwestSB",
                            "id": "f4k6q74",
                            "parent_id": "t1_f4k2xan",
                            "score": 8,
                            "created_utc": 1571637692.0,
                            "replies": [
                                {
                                    "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                                    "author": "2catsandacomputer",
                                    "id": "f4n81pw",
                                    "parent_id": "t1_f4k6q74",
                                    "score": 6,
                                    "created_utc": 1571686718.0,
                                    "replies": [
                                        {
                                            "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                            "author": "MidwestSB",
                                            "id": "f4nezyu",
                                            "parent_id": "t1_f4n81pw",
                                            "score": 3,
                                            "created_utc": 1571688771.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                            "author": "RealEarthAngel",
                                            "id": "f5xomb9",
                                            "parent_id": "t1_f4n81pw",
                                            "score": 2,
                                            "created_utc": 1572543939.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                                    "author": "kimchi_Queen",
                                    "id": "f5ia5fv",
                                    "parent_id": "t1_f4k6q74",
                                    "score": 3,
                                    "created_utc": 1572212442.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Some really twisted minds there. Have a great week.",
                            "author": "agjrpsl",
                            "id": "f4k3mdu",
                            "parent_id": "t1_f4k2xan",
                            "score": 4,
                            "created_utc": 1571634165.0,
                            "replies": []
                        },
                        {
                            "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                            "author": "brownandsweet",
                            "id": "f4llonp",
                            "parent_id": "t1_f4k2xan",
                            "score": 4,
                            "created_utc": 1571668618.0,
                            "replies": []
                        },
                        {
                            "body": "No wonder it is so difficult to find a true SD.",
                            "author": "socharmer",
                            "id": "f4mxt9d",
                            "parent_id": "t1_f4k2xan",
                            "score": 4,
                            "created_utc": 1571683577.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "https://old.reddit.com/r/asktrp/comments/dki8t1/i_recently_signed_up_as_a_sugar_daddy_i_learnt/\n\nJust wow! This was some read!",
            "author": "captainIsBack4u",
            "id": "f4mk9ji",
            "parent_id": "t1_f4k22ir",
            "score": 2,
            "created_utc": 1571679373.0,
            "replies": []
        },
        {
            "body": "I would but I'm on mobile. It was from today like around 12 noon.",
            "author": "agjrpsl",
            "id": "f4k27e5",
            "parent_id": "t1_f4k22ir",
            "score": 1,
            "created_utc": 1571632727.0,
            "replies": []
        },
        {
            "body": "Your anecdotes were a source of much amusement for me just now, cheers.  Although you have my condolences for pursuing romantic affiliations with folks who exaggerate their endowments, to disappointing effect.\n\nAlso fyi, as someone with a 99th percentile penis, unless they're literally hung like a horse, they can wear any condom you got (although some are preferable to others).  In case that's ever relevant to you lol.",
            "author": null,
            "id": "f4nfvfs",
            "parent_id": "t1_f4miqgu",
            "score": 0,
            "created_utc": 1571689023.0,
            "replies": []
        },
        {
            "body": ":( I read it and now I feel sick",
            "author": "Gremlin_baby",
            "id": "f4k2xan",
            "parent_id": "t1_f4k2bx8",
            "score": 9,
            "created_utc": 1571633445.0,
            "replies": [
                {
                    "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
                    "author": "MidwestSB",
                    "id": "f4k6q74",
                    "parent_id": "t1_f4k2xan",
                    "score": 8,
                    "created_utc": 1571637692.0,
                    "replies": [
                        {
                            "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                            "author": "2catsandacomputer",
                            "id": "f4n81pw",
                            "parent_id": "t1_f4k6q74",
                            "score": 6,
                            "created_utc": 1571686718.0,
                            "replies": [
                                {
                                    "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                                    "author": "MidwestSB",
                                    "id": "f4nezyu",
                                    "parent_id": "t1_f4n81pw",
                                    "score": 3,
                                    "created_utc": 1571688771.0,
                                    "replies": []
                                },
                                {
                                    "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                                    "author": "RealEarthAngel",
                                    "id": "f5xomb9",
                                    "parent_id": "t1_f4n81pw",
                                    "score": 2,
                                    "created_utc": 1572543939.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                            "author": "kimchi_Queen",
                            "id": "f5ia5fv",
                            "parent_id": "t1_f4k6q74",
                            "score": 3,
                            "created_utc": 1572212442.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Some really twisted minds there. Have a great week.",
                    "author": "agjrpsl",
                    "id": "f4k3mdu",
                    "parent_id": "t1_f4k2xan",
                    "score": 4,
                    "created_utc": 1571634165.0,
                    "replies": []
                },
                {
                    "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
                    "author": "brownandsweet",
                    "id": "f4llonp",
                    "parent_id": "t1_f4k2xan",
                    "score": 4,
                    "created_utc": 1571668618.0,
                    "replies": []
                },
                {
                    "body": "No wonder it is so difficult to find a true SD.",
                    "author": "socharmer",
                    "id": "f4mxt9d",
                    "parent_id": "t1_f4k2xan",
                    "score": 4,
                    "created_utc": 1571683577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I read some too and just felt absolutely triggered. Seems like a cesspool over there. Just keep telling myself that karma is a bitch. The ones bragging about breaking down women's self confidence and making them feel cheap and like crap.. trying to deprogram our feminist sides?  These are emotional manipulators and predators. Mental terrorists.  So glad we seem to have some mature SDs here who follow the campsite principle and value these precious relationships.",
            "author": "MidwestSB",
            "id": "f4k6q74",
            "parent_id": "t1_f4k2xan",
            "score": 8,
            "created_utc": 1571637692.0,
            "replies": [
                {
                    "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
                    "author": "2catsandacomputer",
                    "id": "f4n81pw",
                    "parent_id": "t1_f4k6q74",
                    "score": 6,
                    "created_utc": 1571686718.0,
                    "replies": [
                        {
                            "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                            "author": "MidwestSB",
                            "id": "f4nezyu",
                            "parent_id": "t1_f4n81pw",
                            "score": 3,
                            "created_utc": 1571688771.0,
                            "replies": []
                        },
                        {
                            "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                            "author": "RealEarthAngel",
                            "id": "f5xomb9",
                            "parent_id": "t1_f4n81pw",
                            "score": 2,
                            "created_utc": 1572543939.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
                    "author": "kimchi_Queen",
                    "id": "f5ia5fv",
                    "parent_id": "t1_f4k6q74",
                    "score": 3,
                    "created_utc": 1572212442.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some really twisted minds there. Have a great week.",
            "author": "agjrpsl",
            "id": "f4k3mdu",
            "parent_id": "t1_f4k2xan",
            "score": 4,
            "created_utc": 1571634165.0,
            "replies": []
        },
        {
            "body": "Someone claimed they slept with 140 women in NYC without ever spoiling or helping financially",
            "author": "brownandsweet",
            "id": "f4llonp",
            "parent_id": "t1_f4k2xan",
            "score": 4,
            "created_utc": 1571668618.0,
            "replies": []
        },
        {
            "body": "No wonder it is so difficult to find a true SD.",
            "author": "socharmer",
            "id": "f4mxt9d",
            "parent_id": "t1_f4k2xan",
            "score": 4,
            "created_utc": 1571683577.0,
            "replies": []
        },
        {
            "body": "I read it and laughed. \n\nThe mods reply was something like \"women look for opportunity and men look for romance” when the OPs opening line referred to SA as a loophole to prostitution. I don't know what is more opportunistic than paying for sex because you don't want a relationship, or how that's romance, so I straight up laughed. The mental gymnastics are super entertaining over there. \n\nI also gave platinum to a guy for absolutely roasting the dude. He is probably not a good poster, but he said something like \"you brag about how much money you make but look for a discount when it comes to where you put your dick\" and I am honestly just going to copy and paste that whenever a Splenda low balls me because it's such a work of art.",
            "author": "2catsandacomputer",
            "id": "f4n81pw",
            "parent_id": "t1_f4k6q74",
            "score": 6,
            "created_utc": 1571686718.0,
            "replies": [
                {
                    "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
                    "author": "MidwestSB",
                    "id": "f4nezyu",
                    "parent_id": "t1_f4n81pw",
                    "score": 3,
                    "created_utc": 1571688771.0,
                    "replies": []
                },
                {
                    "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
                    "author": "RealEarthAngel",
                    "id": "f5xomb9",
                    "parent_id": "t1_f4n81pw",
                    "score": 2,
                    "created_utc": 1572543939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They're just fantasizing anyways. I really doubt they're making any of the shit happen as they say. It's so easy to fabricate online. There are predators out there who can sense easy prey, don't get me wrong. But some of the comments I read, yeah, like no way dude are you so good at breaking women down that you get all of your SA to put out for free and for just your \"mentorship\". Your bitterness is so strong that I can taste it and you're not getting many, if any hits.",
            "author": "kimchi_Queen",
            "id": "f5ia5fv",
            "parent_id": "t1_f4k6q74",
            "score": 3,
            "created_utc": 1572212442.0,
            "replies": []
        },
        {
            "body": "OMG! That is hilarious.  Definitely a quote worth keeping!!!",
            "author": "MidwestSB",
            "id": "f4nezyu",
            "parent_id": "t1_f4n81pw",
            "score": 3,
            "created_utc": 1571688771.0,
            "replies": []
        },
        {
            "body": "The guys on that sub are so mislead and so very confused.\nI do love that quote, tho!",
            "author": "RealEarthAngel",
            "id": "f5xomb9",
            "parent_id": "t1_f4n81pw",
            "score": 2,
            "created_utc": 1572543939.0,
            "replies": []
        }
    ]
}