{
    "title": "SB's-- Beware!",
    "post_id": "i9105p",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i9105p/sbs_beware/",
    "author": "ImaginaryBullfrog5",
    "body": "I want to share an experience I had with a pot SD in hopes that other sb's will see early warning signs of potential harm and end the relationship before it materializes into more. \n\nI met a very wealthy SD; the guy is definitely legit. We will call him Tom.  Tom and I met for lunch and before out M&G, he did not make any of our conversation sexual.  At our M&G, we got to know each other and as we were doing so, he was also very open sexually about what he likes/wants, very confident and made the conversation easy and normal.  He was classy about it. He seemed very open and adventurous and I actually really liked that about him.  I thought he could \"lead the way\" in helping me explore myself and sexuality more.  He didn't want exclusivity and told me it would turn him on to share my intimate time with other men with him.  I was all about it.  \n\nFirst intimate date was great. Sex was fun and he even suggested we stop because he wanted to cuddle and talk. He shared very intimate details about his life with me.. I really felt like we bonded. I honestly couldn't wait to see him again. \n\nSecond intimate date.. This is where things take a turn. While we are at dinner, we start talking about some sexual experiences I've had with women and how we might consider doing threesomes.   We go back to his place and start getting naughty. While we are in bed, he goes down on me and I was neatly trimmed, but have a small amount of hair.  He proceeds to tell me that he likes a bare kitty (OK.. No problem).. \"like a 14 year old girl\" 😧.  That's the first 🚩.. We continue and he likes to talk, so he tells me to describe the type of woman I would pick up for us to have play time with.  (Earlier, we had kind of discussed how it would be hot to find a woman who was inexperienced with women and how I could show her how to please and be pleased/teach her/show her the ropes/blah blah blah.) So I start to describe this woman and we agree she should be young. So I say she's 20 and he says \"no, younger.\" 🚩🤔 so I say (uncomfortably/telling him what he wants to hear), \"OK.. 18\". He doesn't say anything else at that point and we continue.  Deep down, I'm preeeeetty sure he was hoping I'd join him on his trip down pedo road and fantasize about having sex with a CHILD.  Ew.  \n\nOne last red flag.  Initially, we had agreed we didn't want to use condoms. But, before our second date, I had asked him that we start using condoms if we were going to be having other partners. I even brought my own. After we had got inside, I realized I had forgotten them in my car. I told him this and he said that he had some.  He went to go grab them and a toy and he came back with the toy and no condom.  So he didn't honor my request to use protection. \n\nFor all of these reasons, I have decided to tell him I'm no longer interested in continuing a relationship with him.  \n\nI just want to warn the women out there that these are the early warning signs of something bad..  Tom is very wealthy and if our relationship were to continue, I could see so many benefits and potential spoiling.  He is very charming and makes me feel like I can trust him. This is how some men do it.. They reel you in slowly.. Build trust and a connection.. And before you know it, you're in some deep shit and making bad decisions/being put in an uncomfortable situation.  I mean.. He just made some little comments here and there that could be brushed off because they don't seem so bad at the time/insignificant or.. he's wealthy or..  you've got a good connection or.. he's normal/great otherwise. \n\nSome men pump and dump or assault or take advantage of women forthright.  Some men play the long game and are very subtle.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i9105p/sbs_beware/",
    "score": 129,
    "upvote_ratio": 0.94,
    "created_utc": 1597329338.0,
    "num_comments": 53,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I wouldn’t have sex sex without a condom on the first or second date. Or at all really. Not in an arrangement",
            "author": "throwawayFA93",
            "id": "g1cpuei",
            "parent_id": "t3_i9105p",
            "score": 27,
            "created_utc": 1597342148.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1cd2z6",
            "parent_id": "t3_i9105p",
            "score": 47,
            "created_utc": 1597336593.0,
            "replies": [
                {
                    "body": "I have the reverse situation where the young woman I’m seeing pushes the age play. Know guys are predators but not sure what the name is for women who do the same.",
                    "author": "SpendItRight",
                    "id": "g1d2w2s",
                    "parent_id": "t1_g1cd2z6",
                    "score": 4,
                    "created_utc": 1597348015.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g1dewlm",
                            "parent_id": "t1_g1d2w2s",
                            "score": 2,
                            "created_utc": 1597353634.0,
                            "replies": [
                                {
                                    "body": "Older man and she plays the younger girl.",
                                    "author": "SpendItRight",
                                    "id": "g1fsaue",
                                    "parent_id": "t1_g1dewlm",
                                    "score": 3,
                                    "created_utc": 1597410869.0,
                                    "replies": [
                                        {
                                            "body": "tell us more!",
                                            "author": "poofymon",
                                            "id": "g1fxeas",
                                            "parent_id": "t1_g1fsaue",
                                            "score": 2,
                                            "created_utc": 1597413744.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When you said this. .....\n\n\n“Tom is very wealthy and if our relationship were to continue, I could see so many benefits and potential spoiling.  He is very charming and makes me feel like I can trust him. This is how some men do it.. They reel you in slowly.. Build trust and a connection.. And before you know it, you're in some deep shit and making bad decisions.....” \n\nIt made me think of Ghislaine Maxwell, Jeffrey Epstein’s partner in crime.  I am not saying she is victim here nor am I defending her in ANY WAY. But I imagined her decades ago being exactly where you were a few days ago. There was probably a MOMENT very early on  when she could have said fuck you and walked away like OP. Instead, she let herself be enticed by his wealth and went all-in.\n\nEDIT : I should’ve read all the comments first. Apparently I’m not the only one who thought this.",
            "author": "SouthernGentSD",
            "id": "g1d5ip6",
            "parent_id": "t3_i9105p",
            "score": 22,
            "created_utc": 1597349245.0,
            "replies": []
        },
        {
            "body": "Sounds like Jeffrey Epstein.",
            "author": "macaroonqueen",
            "id": "g1bynme",
            "parent_id": "t3_i9105p",
            "score": 35,
            "created_utc": 1597329896.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g1bzgfx",
                    "parent_id": "t1_g1bynme",
                    "score": 37,
                    "created_utc": 1597330284.0,
                    "replies": [
                        {
                            "body": "Reminded me of this, as well.  Considered putting a reference to them in my post.",
                            "author": "ImaginaryBullfrog5",
                            "id": "g1bzxcg",
                            "parent_id": "t1_g1bzgfx",
                            "score": 18,
                            "created_utc": 1597330521.0,
                            "replies": []
                        },
                        {
                            "body": "Or even like one of his other random victims who he used to help lure other victims in. His spiderweb technique.",
                            "author": "BigBearSD",
                            "id": "g1c0mnl",
                            "parent_id": "t1_g1bzgfx",
                            "score": 7,
                            "created_utc": 1597330868.0,
                            "replies": []
                        },
                        {
                            "body": ">  Don't be his Ghislaine\n\nExcellent point.",
                            "author": "Sugarbeggar",
                            "id": "g1dxivw",
                            "parent_id": "t1_g1bzgfx",
                            "score": 3,
                            "created_utc": 1597362838.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, either Epstein or Jared from Subway who openly admitted to a female friend that “middle school girls are hot”. If these guys could just keep it above the legal limit, it just shows the depth of their depravity.",
                    "author": "LucidDion",
                    "id": "g1c1y79",
                    "parent_id": "t1_g1bynme",
                    "score": 6,
                    "created_utc": 1597331502.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I will say in my time in the bowl sexy talk verging on pedophilia has been extremely common... not sure if it's an older men thing or a wealthy men thing. Its exacerbated by the porn industry and its obsessions with \"teens\".",
            "author": "Meowohmeow20",
            "id": "g1c322t",
            "parent_id": "t3_i9105p",
            "score": 49,
            "created_utc": 1597332018.0,
            "replies": [
                {
                    "body": "One guy who is super weird once told me he had a fantasy about being with his daughter when she was a teenager and wanted to role play that scenario. WTF",
                    "author": "Bbygirlxxxx",
                    "id": "g1cv0r5",
                    "parent_id": "t1_g1c322t",
                    "score": 25,
                    "created_utc": 1597344487.0,
                    "replies": [
                        {
                            "body": "it unfortunately is very common for both sexes. Daddy daughter play and mommy son play as well as the occasional sister brother thing. It's not just porn pushing it. Incest taboo has been around forever.",
                            "author": "Grimouire",
                            "id": "g1dwhrs",
                            "parent_id": "t1_g1cv0r5",
                            "score": 3,
                            "created_utc": 1597362295.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Its exacerbated by the porn industry and its obsessions with \"teens\"\n\nI don't think this is true, you can see in Pornhub (biggest porn site) that \"MILF\" is a more popular search term and has more content than \"teen\".\n\nSame with pornstars, the most popular ones like Lana Rhoades and Riley Reid are over 25.",
                    "author": null,
                    "id": "g1dw7tz",
                    "parent_id": "t1_g1c322t",
                    "score": 4,
                    "created_utc": 1597362149.0,
                    "replies": [
                        {
                            "body": "No, in porn,  \"teen\" is the all time most popular category, MILF is not even close. Look at the most popular stars, they all started out as \"teens\"",
                            "author": "Wildebot34",
                            "id": "g1gzr75",
                            "parent_id": "t1_g1dw7tz",
                            "score": 1,
                            "created_utc": 1597431094.0,
                            "replies": [
                                {
                                    "body": "Here, stats from Pornhub say otherwise:\n\nhttps://www.pornhub.com/insights/2019-year-in-review\n\n>Look at the most popular stars, they all started out as \"teens\"\n\nYes, but they didn't reach the top of popularity until being around 25. Otherwise the most popular pornstars today would be 18-20 don't you think?\n\nThe data doesn't support your views.",
                                    "author": null,
                                    "id": "g1h4kcq",
                                    "parent_id": "t1_g1gzr75",
                                    "score": 1,
                                    "created_utc": 1597433247.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This makes me sad. I hope it is a very very small percentage of the population. As I have aged over the years, I have only gotten milf-ier.",
                    "author": "throwawaysdbos",
                    "id": "g1dagqr",
                    "parent_id": "t1_g1c322t",
                    "score": 6,
                    "created_utc": 1597351568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1culz1",
            "parent_id": "t3_i9105p",
            "score": 17,
            "created_utc": 1597344298.0,
            "replies": [
                {
                    "body": "I’ve been with older guys who have told me they like a little hair otherwise it would feel like they were having sex with a child. So, I wasn’t expecting someone his age to tell me he preferred hairless.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1cwycp",
                    "parent_id": "t1_g1culz1",
                    "score": 6,
                    "created_utc": 1597345356.0,
                    "replies": [
                        {
                            "body": "Being a guy not a SD, take with a grain of salt. My wife and i have been approached by far to many men and a suprising number of ladies that like pedo style age play in their custom videos.\n\nMy sons have brought over female friends from school to hang out with the family over dinner and many times I end up with a 13-14 year old girl trying to get handsy with me on the sly, or puts their number in my pocket asking me to hit them up. Thankfully my wife intercedes and deals with it but that is still creepy.",
                            "author": "Grimouire",
                            "id": "g1dxrjx",
                            "parent_id": "t1_g1cwycp",
                            "score": 1,
                            "created_utc": 1597362966.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He sounds very familiar. Interesting.\n\nI’m glad you saw the red flags and not driven by his success/status. Other women would have proceeded full steam ahead and found themselves in a prickly pickle that he wouldn’t have helped them out of.",
            "author": null,
            "id": "g1c7x2l",
            "parent_id": "t3_i9105p",
            "score": 9,
            "created_utc": 1597334273.0,
            "replies": []
        },
        {
            "body": "He is a predator- sounds like a Jeffrey Epstein wannabe and he was 'grooming' you to be his Ghisline Maxwell to his Jeffrey. What a manipulating creep....he needs to be blacklisted, honestly and reported to the website (if you found him online). Plus, manipulating with condoms, oh my gosh...",
            "author": null,
            "id": "g1d85da",
            "parent_id": "t3_i9105p",
            "score": 10,
            "created_utc": 1597350480.0,
            "replies": []
        },
        {
            "body": "Sounds very reminiscent of Jeffrey Epstein. Good thing you ran!",
            "author": "BigBearSD",
            "id": "g1bzs63",
            "parent_id": "t3_i9105p",
            "score": 17,
            "created_utc": 1597330450.0,
            "replies": [
                {
                    "body": "My thoughts exactly. He is looking for his \"Ghislaine Maxwell\".",
                    "author": "willfromvb",
                    "id": "g1c2645",
                    "parent_id": "t1_g1bzs63",
                    "score": 11,
                    "created_utc": 1597331609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I stopped reading at 14yr old girl.... fuck that guy.",
            "author": "LifeIsShortImNot",
            "id": "g1d5w0p",
            "parent_id": "t3_i9105p",
            "score": 5,
            "created_utc": 1597349421.0,
            "replies": []
        },
        {
            "body": "Does he have his own island?",
            "author": "UnearthlyDinosaur",
            "id": "g1c1fz9",
            "parent_id": "t3_i9105p",
            "score": 6,
            "created_utc": 1597331255.0,
            "replies": [
                {
                    "body": "He has his own plane.  Maybe he has an island too 🤷🏻‍♀️",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1c6yu5",
                    "parent_id": "t1_g1c1fz9",
                    "score": 5,
                    "created_utc": 1597333850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like to think of SLF as sex positive and myself as sex positive.\n\nThat said, anything even hinting at or implying a sexual desire toward sex with children is just about the worst thing I can imagine.\n\nI'm glad you walked away from a potentially very awful situation.",
            "author": "marker3000",
            "id": "g1ckc9h",
            "parent_id": "t3_i9105p",
            "score": 10,
            "created_utc": 1597339750.0,
            "replies": []
        },
        {
            "body": "The first SD I ever had was similar. We were intimate once, and that was enough.\n\nHe continuously talked about wanting my “teen mouth on Daddy”.. note, I’m in my mid-20s. And, it seemed pretty clear he also wasn’t imagining I was “18”.\n\nSadly, this doesn’t sound uncommon.",
            "author": "unesucrebebe",
            "id": "g1cr19h",
            "parent_id": "t3_i9105p",
            "score": 4,
            "created_utc": 1597342696.0,
            "replies": [
                {
                    "body": "I'm (unfortunately) coming to find out that it may be more common than I'd like to imagine.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1cs62a",
                    "parent_id": "t1_g1cr19h",
                    "score": 3,
                    "created_utc": 1597343195.0,
                    "replies": [
                        {
                            "body": "What if it’s the woman pushing the age play? Seeing someone very into “daddy” talk which is not something I do but going with it. Now it seems she’s moving the conversations slowly towards age 14-15 when she’s in her early 20s.",
                            "author": "SpendItRight",
                            "id": "g1d3bj8",
                            "parent_id": "t1_g1cs62a",
                            "score": -1,
                            "created_utc": 1597348215.0,
                            "replies": [
                                {
                                    "body": "Just a reminder that many sexual assault victims role play their abuse (especially true if child victims) in their healthy relationships. It *can* be a healthy way of reliving the trauma on their own terms - which is gaining power back. However, all of this should be done with knowledge, consent, and communication with all parties involved.",
                                    "author": "GulfCoastFlamingo",
                                    "id": "g1dyxmj",
                                    "parent_id": "t1_g1d3bj8",
                                    "score": 2,
                                    "created_utc": 1597363594.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good thing you saw the warning signs and got out when you did. Sounds like he was a total psychopath.",
            "author": "sdthrowaway006",
            "id": "g1cyi23",
            "parent_id": "t3_i9105p",
            "score": 4,
            "created_utc": 1597346055.0,
            "replies": []
        },
        {
            "body": "he was hoping I'd join him on his trip down pedo road and fantasize about having sex with a CHILD.\n\nHow did that work out for Jeffrey Epstein and Ghislaine Maxwell?",
            "author": "GSSD",
            "id": "g1c3zp6",
            "parent_id": "t3_i9105p",
            "score": 7,
            "created_utc": 1597332437.0,
            "replies": [
                {
                    "body": "\"How did that work out ...\" Both would likely be in better condition today if they'd ONLY fantasized (maybe a bit cynical, but true).",
                    "author": "eniak56kaine",
                    "id": "g1d1r6h",
                    "parent_id": "t1_g1c3zp6",
                    "score": 6,
                    "created_utc": 1597347508.0,
                    "replies": []
                },
                {
                    "body": "Still in limbo...we shall see",
                    "author": null,
                    "id": "g1c4nou",
                    "parent_id": "t1_g1c3zp6",
                    "score": 3,
                    "created_utc": 1597332749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good call getting out of this arrangement, he's not worth it. From the sound of things it would just continue to escalate.",
            "author": "mraspencer",
            "id": "g1c1on3",
            "parent_id": "t3_i9105p",
            "score": 3,
            "created_utc": 1597331369.0,
            "replies": [
                {
                    "body": "My thoughts exactly. I hope other young women would realize this too!",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1c717m",
                    "parent_id": "t1_g1c1on3",
                    "score": 5,
                    "created_utc": 1597333878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s fucking nasty. You dodged a bullet",
            "author": "wndrlnds",
            "id": "g1dbqs7",
            "parent_id": "t3_i9105p",
            "score": 4,
            "created_utc": 1597352160.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1c8pw4",
            "parent_id": "t3_i9105p",
            "score": 2,
            "created_utc": 1597334650.0,
            "replies": [
                {
                    "body": "Absolutely. It pains me to read some of the horror stories some women have been through. I hope this will reach those who are sometimes blinded the $$.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1c9ksu",
                    "parent_id": "t1_g1c8pw4",
                    "score": 4,
                    "created_utc": 1597335045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pls report him.",
            "author": "foggymaria",
            "id": "g1dejxf",
            "parent_id": "t3_i9105p",
            "score": 4,
            "created_utc": 1597353469.0,
            "replies": []
        },
        {
            "body": "Epstein didn't kill himself. \n\n\n\nI'm just joking, but really truly I'm very proud of you. Suggestions: Report him on wherever you met him, like SA or whatever else. Send pics of any pedophilic messages or predatory too if you think so. Maybe anonymous tip to some service to keep their eye out? Idk if that's police or something else for that. Sounds to me he probably has actually tried some shit for his desires, probably definitely has downloaded that... Type... Of porn... And maybe even had \"experience\" with his... Desires... And definitely will try to get someone else to be an accomplice again like you. And maybe she agrees to it, maybe because she got groomed. And then they both get in trouble for dumb shit and she gets in deep shit too. If it's just a fantasy with no intention of acting on, or downloading pornography of, then it should be no biggie obviously. But the service you report him can investigate whether he is a danger or a benign fetishist. I also worry about him using his power or wealth to further any general harassment, harassment of interns/subordinates (also happened to me. Workplace sexual harassment of young women is unfortunately real and unsettlingly common), coersion, statutory rape, etc. \n\nIt's fully your choice what you do, but thank you for posting this and keeping the community aware of this actively. Fuck me uuuppp with those ethics and morals. Love this respect for your fellow (wo)man. \n\n\nSeriously though, I have been that uncomfortable woman, too, similar to you, but of course not the same. Not doing comparative suffering here. However, I'm less than five feet tall, usually around 100 pounds, with a high pitched voice, and a young face. When I was eighteen and nineteen on the site years ago, I had several men similar to this be actively pedophilic toward me, asking me to play uncomfortably young, asking about girls technically over the age of consent in my state but still under 18 to join in sex, focusing on an idea of a lack sexual experience that he can \"teach\" me about (which was always wrong, their \"predictions\" about what I want and what I haven't done. I rocketed into this world as a confident freak and been surfing that wave ever since. 🤷), and making comments like a weird compliment along the same vein as your exchange about the \"bare kitty\" thing or emphasizing that I'm a \"teenager\".\n\n\nAlso, I've noticed, as a side note here, that men with that inclination (if not full fetish) tended (obviously NOT always and not ONLY this way, but yeah, more often than your average bear) to call pussies \"kitties\" most of the time as well as call me \"baby girl\", \"little girl\", etc. Idk man, I've only heard that language from boomers, but NOT all of them being from that kind of weird place; I think some of the NON... Uh... poor-intentioned like this... men think it's a sexy thing women want to hear. Idk, I always hated it. Maybe other women like it, I have no idea though.\n\n\nThose are firm lines with me now; banning that language from any relationship at all: Not a girl, but a woman. Not a kitty, but a bomb-ass crotch cave. Lol, you know how it be. 🤗",
            "author": "AtlantaPeachFuzz",
            "id": "g1dtjn0",
            "parent_id": "t3_i9105p",
            "score": 3,
            "created_utc": 1597360761.0,
            "replies": []
        },
        {
            "body": "This. Shit. Right. Here. I'm so happy you got out of what was a potentially dangerous and toxic SR. Been there, done that. It's the worst. I hope you find someone amazing soon!",
            "author": "shesanewman",
            "id": "g1dcefq",
            "parent_id": "t3_i9105p",
            "score": 1,
            "created_utc": 1597352464.0,
            "replies": [
                {
                    "body": "Good news is.. I did meet someone else who is absolutely amazing and I’m really looking forward to our SR!",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1di2tc",
                    "parent_id": "t1_g1dcefq",
                    "score": 1,
                    "created_utc": 1597355134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like he wants you to be his Ghislaine Maxwell",
            "author": "geekxp",
            "id": "g1drfx7",
            "parent_id": "t3_i9105p",
            "score": 1,
            "created_utc": 1597359707.0,
            "replies": []
        },
        {
            "body": "Good for you following all the signs and running away! Make a comment under his phone number on the Mr. Number app. If you don’t already use it, please check it out and get an account. I cannot tell you how many phonies and splendas i have found out about from other sb’s just by looking in the comments section on this app when i type ina POT’s phone number and look them up !",
            "author": "SheBreathesFire",
            "id": "g1dzxoh",
            "parent_id": "t3_i9105p",
            "score": 1,
            "created_utc": 1597364146.0,
            "replies": []
        },
        {
            "body": "I'm turned off by a totally bare Kitty for this exact reason. It just feels like they are way too young to be having sex with an adult. I don't even like the term sugar daddy as it implies and incestuous relationship.",
            "author": "rjjr1963",
            "id": "g1fq4vd",
            "parent_id": "t3_i9105p",
            "score": 1,
            "created_utc": 1597409520.0,
            "replies": [
                {
                    "body": "Thank you! \n\nWhen I was younger, I preferred being bare.  Now, I prefer to have a little hair. Why? Because I am a grown WOMAN! I appreciate having a partner who feels the same way.  I get what you’re saying about the term SD/SB. Maybe “sugar partner” would be a better term.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1fy7mz",
                    "parent_id": "t1_g1fq4vd",
                    "score": 2,
                    "created_utc": 1597414165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gah ! So disgusting how these men use their power. check the house for hard drives on the way out. Thanks for sharing this ! 💞",
            "author": "BeyonceGhibli",
            "id": "g1czkou",
            "parent_id": "t3_i9105p",
            "score": 1,
            "created_utc": 1597346534.0,
            "replies": []
        },
        {
            "body": "I'm glad you recognized these things and removed yourself from a situation that made you uncomfortable. What you describe, though, is not unique to men. Devious and manipulative behavior occurs in all people regardless of their sex / gender.\n\nThis story is a great reminder to all of us to be careful with people who we are allowing into our lives, especially those we've just met.",
            "author": "thedudeisnotinlvm",
            "id": "g1byttn",
            "parent_id": "t3_i9105p",
            "score": -1,
            "created_utc": 1597329978.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing your experience. It feels important to note: \"  This is how some men do it\" can we agree that this is how some manipulative people do it? as opposed to assigning gender? \n\nAs a female an aspiring SB I appreciate your warning and sharing the signs. That is very helpful. So, this is not meant as shut down. It's just these are behaviors or anybody that is manipulative and it feels wrong to say this how some \"men\" do it. \n\nIs there somebody else (that gets what I'm trying to say) reading these comments that can help me epitomize this better?",
            "author": "writingsubthings",
            "id": "g1d6ad7",
            "parent_id": "t3_i9105p",
            "score": -3,
            "created_utc": 1597349606.0,
            "replies": [
                {
                    "body": "I do get what you’re saying; and I agree, it is very fair to say it that way.  \n\nMy choice of words come from my own, personal experience.  I enter into these kinds of relationships with men. If I had experience with manipulative women as well, I probably would have stated it as so.  Or if I were speaking in general terms and didn’t have a specific story I was relating to, I could have changed my wording to include both genders.  That’s why I said “some men” instead of just “men”. Because I didn’t want to blame a whole gender. Now, because I say “some men” does not mean I’m specifically excluding some women, as well.  Again, my choice of words stem from my personal experience, is all.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1d7qqj",
                    "parent_id": "t1_g1d6ad7",
                    "score": 5,
                    "created_utc": 1597350286.0,
                    "replies": [
                        {
                            "body": "Totally! That makes sense. It just felt important to acknowledge is all. Thanks for elucidating further :)",
                            "author": "writingsubthings",
                            "id": "g1d8940",
                            "parent_id": "t1_g1d7qqj",
                            "score": 2,
                            "created_utc": 1597350528.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so sick, it also made me feel like I was watching that movie with the guy and his girlfriend and what they did to her little sister. Glad you got out in time!",
            "author": "box_pandoras",
            "id": "g1d3ahr",
            "parent_id": "t3_i9105p",
            "score": 0,
            "created_utc": 1597348202.0,
            "replies": []
        },
        {
            "body": "I have the reverse situation where the young woman I’m seeing pushes the age play. Know guys are predators but not sure what the name is for women who do the same.",
            "author": "SpendItRight",
            "id": "g1d2w2s",
            "parent_id": "t1_g1cd2z6",
            "score": 4,
            "created_utc": 1597348015.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g1dewlm",
                    "parent_id": "t1_g1d2w2s",
                    "score": 2,
                    "created_utc": 1597353634.0,
                    "replies": [
                        {
                            "body": "Older man and she plays the younger girl.",
                            "author": "SpendItRight",
                            "id": "g1fsaue",
                            "parent_id": "t1_g1dewlm",
                            "score": 3,
                            "created_utc": 1597410869.0,
                            "replies": [
                                {
                                    "body": "tell us more!",
                                    "author": "poofymon",
                                    "id": "g1fxeas",
                                    "parent_id": "t1_g1fsaue",
                                    "score": 2,
                                    "created_utc": 1597413744.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1bzgfx",
            "parent_id": "t1_g1bynme",
            "score": 37,
            "created_utc": 1597330284.0,
            "replies": [
                {
                    "body": "Reminded me of this, as well.  Considered putting a reference to them in my post.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g1bzxcg",
                    "parent_id": "t1_g1bzgfx",
                    "score": 18,
                    "created_utc": 1597330521.0,
                    "replies": []
                },
                {
                    "body": "Or even like one of his other random victims who he used to help lure other victims in. His spiderweb technique.",
                    "author": "BigBearSD",
                    "id": "g1c0mnl",
                    "parent_id": "t1_g1bzgfx",
                    "score": 7,
                    "created_utc": 1597330868.0,
                    "replies": []
                },
                {
                    "body": ">  Don't be his Ghislaine\n\nExcellent point.",
                    "author": "Sugarbeggar",
                    "id": "g1dxivw",
                    "parent_id": "t1_g1bzgfx",
                    "score": 3,
                    "created_utc": 1597362838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, either Epstein or Jared from Subway who openly admitted to a female friend that “middle school girls are hot”. If these guys could just keep it above the legal limit, it just shows the depth of their depravity.",
            "author": "LucidDion",
            "id": "g1c1y79",
            "parent_id": "t1_g1bynme",
            "score": 6,
            "created_utc": 1597331502.0,
            "replies": []
        },
        {
            "body": "One guy who is super weird once told me he had a fantasy about being with his daughter when she was a teenager and wanted to role play that scenario. WTF",
            "author": "Bbygirlxxxx",
            "id": "g1cv0r5",
            "parent_id": "t1_g1c322t",
            "score": 25,
            "created_utc": 1597344487.0,
            "replies": [
                {
                    "body": "it unfortunately is very common for both sexes. Daddy daughter play and mommy son play as well as the occasional sister brother thing. It's not just porn pushing it. Incest taboo has been around forever.",
                    "author": "Grimouire",
                    "id": "g1dwhrs",
                    "parent_id": "t1_g1cv0r5",
                    "score": 3,
                    "created_utc": 1597362295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Its exacerbated by the porn industry and its obsessions with \"teens\"\n\nI don't think this is true, you can see in Pornhub (biggest porn site) that \"MILF\" is a more popular search term and has more content than \"teen\".\n\nSame with pornstars, the most popular ones like Lana Rhoades and Riley Reid are over 25.",
            "author": null,
            "id": "g1dw7tz",
            "parent_id": "t1_g1c322t",
            "score": 4,
            "created_utc": 1597362149.0,
            "replies": [
                {
                    "body": "No, in porn,  \"teen\" is the all time most popular category, MILF is not even close. Look at the most popular stars, they all started out as \"teens\"",
                    "author": "Wildebot34",
                    "id": "g1gzr75",
                    "parent_id": "t1_g1dw7tz",
                    "score": 1,
                    "created_utc": 1597431094.0,
                    "replies": [
                        {
                            "body": "Here, stats from Pornhub say otherwise:\n\nhttps://www.pornhub.com/insights/2019-year-in-review\n\n>Look at the most popular stars, they all started out as \"teens\"\n\nYes, but they didn't reach the top of popularity until being around 25. Otherwise the most popular pornstars today would be 18-20 don't you think?\n\nThe data doesn't support your views.",
                            "author": null,
                            "id": "g1h4kcq",
                            "parent_id": "t1_g1gzr75",
                            "score": 1,
                            "created_utc": 1597433247.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This makes me sad. I hope it is a very very small percentage of the population. As I have aged over the years, I have only gotten milf-ier.",
            "author": "throwawaysdbos",
            "id": "g1dagqr",
            "parent_id": "t1_g1c322t",
            "score": 6,
            "created_utc": 1597351568.0,
            "replies": []
        },
        {
            "body": "I’ve been with older guys who have told me they like a little hair otherwise it would feel like they were having sex with a child. So, I wasn’t expecting someone his age to tell me he preferred hairless.",
            "author": "ImaginaryBullfrog5",
            "id": "g1cwycp",
            "parent_id": "t1_g1culz1",
            "score": 6,
            "created_utc": 1597345356.0,
            "replies": [
                {
                    "body": "Being a guy not a SD, take with a grain of salt. My wife and i have been approached by far to many men and a suprising number of ladies that like pedo style age play in their custom videos.\n\nMy sons have brought over female friends from school to hang out with the family over dinner and many times I end up with a 13-14 year old girl trying to get handsy with me on the sly, or puts their number in my pocket asking me to hit them up. Thankfully my wife intercedes and deals with it but that is still creepy.",
                    "author": "Grimouire",
                    "id": "g1dxrjx",
                    "parent_id": "t1_g1cwycp",
                    "score": 1,
                    "created_utc": 1597362966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My thoughts exactly. He is looking for his \"Ghislaine Maxwell\".",
            "author": "willfromvb",
            "id": "g1c2645",
            "parent_id": "t1_g1bzs63",
            "score": 11,
            "created_utc": 1597331609.0,
            "replies": []
        },
        {
            "body": "He has his own plane.  Maybe he has an island too 🤷🏻‍♀️",
            "author": "ImaginaryBullfrog5",
            "id": "g1c6yu5",
            "parent_id": "t1_g1c1fz9",
            "score": 5,
            "created_utc": 1597333850.0,
            "replies": []
        },
        {
            "body": "I'm (unfortunately) coming to find out that it may be more common than I'd like to imagine.",
            "author": "ImaginaryBullfrog5",
            "id": "g1cs62a",
            "parent_id": "t1_g1cr19h",
            "score": 3,
            "created_utc": 1597343195.0,
            "replies": [
                {
                    "body": "What if it’s the woman pushing the age play? Seeing someone very into “daddy” talk which is not something I do but going with it. Now it seems she’s moving the conversations slowly towards age 14-15 when she’s in her early 20s.",
                    "author": "SpendItRight",
                    "id": "g1d3bj8",
                    "parent_id": "t1_g1cs62a",
                    "score": -1,
                    "created_utc": 1597348215.0,
                    "replies": [
                        {
                            "body": "Just a reminder that many sexual assault victims role play their abuse (especially true if child victims) in their healthy relationships. It *can* be a healthy way of reliving the trauma on their own terms - which is gaining power back. However, all of this should be done with knowledge, consent, and communication with all parties involved.",
                            "author": "GulfCoastFlamingo",
                            "id": "g1dyxmj",
                            "parent_id": "t1_g1d3bj8",
                            "score": 2,
                            "created_utc": 1597363594.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"How did that work out ...\" Both would likely be in better condition today if they'd ONLY fantasized (maybe a bit cynical, but true).",
            "author": "eniak56kaine",
            "id": "g1d1r6h",
            "parent_id": "t1_g1c3zp6",
            "score": 6,
            "created_utc": 1597347508.0,
            "replies": []
        },
        {
            "body": "Still in limbo...we shall see",
            "author": null,
            "id": "g1c4nou",
            "parent_id": "t1_g1c3zp6",
            "score": 3,
            "created_utc": 1597332749.0,
            "replies": []
        },
        {
            "body": "My thoughts exactly. I hope other young women would realize this too!",
            "author": "ImaginaryBullfrog5",
            "id": "g1c717m",
            "parent_id": "t1_g1c1on3",
            "score": 5,
            "created_utc": 1597333878.0,
            "replies": []
        },
        {
            "body": "Absolutely. It pains me to read some of the horror stories some women have been through. I hope this will reach those who are sometimes blinded the $$.",
            "author": "ImaginaryBullfrog5",
            "id": "g1c9ksu",
            "parent_id": "t1_g1c8pw4",
            "score": 4,
            "created_utc": 1597335045.0,
            "replies": []
        },
        {
            "body": "Good news is.. I did meet someone else who is absolutely amazing and I’m really looking forward to our SR!",
            "author": "ImaginaryBullfrog5",
            "id": "g1di2tc",
            "parent_id": "t1_g1dcefq",
            "score": 1,
            "created_utc": 1597355134.0,
            "replies": []
        },
        {
            "body": "Thank you! \n\nWhen I was younger, I preferred being bare.  Now, I prefer to have a little hair. Why? Because I am a grown WOMAN! I appreciate having a partner who feels the same way.  I get what you’re saying about the term SD/SB. Maybe “sugar partner” would be a better term.",
            "author": "ImaginaryBullfrog5",
            "id": "g1fy7mz",
            "parent_id": "t1_g1fq4vd",
            "score": 2,
            "created_utc": 1597414165.0,
            "replies": []
        },
        {
            "body": "I do get what you’re saying; and I agree, it is very fair to say it that way.  \n\nMy choice of words come from my own, personal experience.  I enter into these kinds of relationships with men. If I had experience with manipulative women as well, I probably would have stated it as so.  Or if I were speaking in general terms and didn’t have a specific story I was relating to, I could have changed my wording to include both genders.  That’s why I said “some men” instead of just “men”. Because I didn’t want to blame a whole gender. Now, because I say “some men” does not mean I’m specifically excluding some women, as well.  Again, my choice of words stem from my personal experience, is all.",
            "author": "ImaginaryBullfrog5",
            "id": "g1d7qqj",
            "parent_id": "t1_g1d6ad7",
            "score": 5,
            "created_utc": 1597350286.0,
            "replies": [
                {
                    "body": "Totally! That makes sense. It just felt important to acknowledge is all. Thanks for elucidating further :)",
                    "author": "writingsubthings",
                    "id": "g1d8940",
                    "parent_id": "t1_g1d7qqj",
                    "score": 2,
                    "created_utc": 1597350528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g1dewlm",
            "parent_id": "t1_g1d2w2s",
            "score": 2,
            "created_utc": 1597353634.0,
            "replies": [
                {
                    "body": "Older man and she plays the younger girl.",
                    "author": "SpendItRight",
                    "id": "g1fsaue",
                    "parent_id": "t1_g1dewlm",
                    "score": 3,
                    "created_utc": 1597410869.0,
                    "replies": [
                        {
                            "body": "tell us more!",
                            "author": "poofymon",
                            "id": "g1fxeas",
                            "parent_id": "t1_g1fsaue",
                            "score": 2,
                            "created_utc": 1597413744.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reminded me of this, as well.  Considered putting a reference to them in my post.",
            "author": "ImaginaryBullfrog5",
            "id": "g1bzxcg",
            "parent_id": "t1_g1bzgfx",
            "score": 18,
            "created_utc": 1597330521.0,
            "replies": []
        },
        {
            "body": "Or even like one of his other random victims who he used to help lure other victims in. His spiderweb technique.",
            "author": "BigBearSD",
            "id": "g1c0mnl",
            "parent_id": "t1_g1bzgfx",
            "score": 7,
            "created_utc": 1597330868.0,
            "replies": []
        },
        {
            "body": ">  Don't be his Ghislaine\n\nExcellent point.",
            "author": "Sugarbeggar",
            "id": "g1dxivw",
            "parent_id": "t1_g1bzgfx",
            "score": 3,
            "created_utc": 1597362838.0,
            "replies": []
        },
        {
            "body": "it unfortunately is very common for both sexes. Daddy daughter play and mommy son play as well as the occasional sister brother thing. It's not just porn pushing it. Incest taboo has been around forever.",
            "author": "Grimouire",
            "id": "g1dwhrs",
            "parent_id": "t1_g1cv0r5",
            "score": 3,
            "created_utc": 1597362295.0,
            "replies": []
        },
        {
            "body": "No, in porn,  \"teen\" is the all time most popular category, MILF is not even close. Look at the most popular stars, they all started out as \"teens\"",
            "author": "Wildebot34",
            "id": "g1gzr75",
            "parent_id": "t1_g1dw7tz",
            "score": 1,
            "created_utc": 1597431094.0,
            "replies": [
                {
                    "body": "Here, stats from Pornhub say otherwise:\n\nhttps://www.pornhub.com/insights/2019-year-in-review\n\n>Look at the most popular stars, they all started out as \"teens\"\n\nYes, but they didn't reach the top of popularity until being around 25. Otherwise the most popular pornstars today would be 18-20 don't you think?\n\nThe data doesn't support your views.",
                    "author": null,
                    "id": "g1h4kcq",
                    "parent_id": "t1_g1gzr75",
                    "score": 1,
                    "created_utc": 1597433247.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being a guy not a SD, take with a grain of salt. My wife and i have been approached by far to many men and a suprising number of ladies that like pedo style age play in their custom videos.\n\nMy sons have brought over female friends from school to hang out with the family over dinner and many times I end up with a 13-14 year old girl trying to get handsy with me on the sly, or puts their number in my pocket asking me to hit them up. Thankfully my wife intercedes and deals with it but that is still creepy.",
            "author": "Grimouire",
            "id": "g1dxrjx",
            "parent_id": "t1_g1cwycp",
            "score": 1,
            "created_utc": 1597362966.0,
            "replies": []
        },
        {
            "body": "What if it’s the woman pushing the age play? Seeing someone very into “daddy” talk which is not something I do but going with it. Now it seems she’s moving the conversations slowly towards age 14-15 when she’s in her early 20s.",
            "author": "SpendItRight",
            "id": "g1d3bj8",
            "parent_id": "t1_g1cs62a",
            "score": -1,
            "created_utc": 1597348215.0,
            "replies": [
                {
                    "body": "Just a reminder that many sexual assault victims role play their abuse (especially true if child victims) in their healthy relationships. It *can* be a healthy way of reliving the trauma on their own terms - which is gaining power back. However, all of this should be done with knowledge, consent, and communication with all parties involved.",
                    "author": "GulfCoastFlamingo",
                    "id": "g1dyxmj",
                    "parent_id": "t1_g1d3bj8",
                    "score": 2,
                    "created_utc": 1597363594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally! That makes sense. It just felt important to acknowledge is all. Thanks for elucidating further :)",
            "author": "writingsubthings",
            "id": "g1d8940",
            "parent_id": "t1_g1d7qqj",
            "score": 2,
            "created_utc": 1597350528.0,
            "replies": []
        },
        {
            "body": "Older man and she plays the younger girl.",
            "author": "SpendItRight",
            "id": "g1fsaue",
            "parent_id": "t1_g1dewlm",
            "score": 3,
            "created_utc": 1597410869.0,
            "replies": [
                {
                    "body": "tell us more!",
                    "author": "poofymon",
                    "id": "g1fxeas",
                    "parent_id": "t1_g1fsaue",
                    "score": 2,
                    "created_utc": 1597413744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here, stats from Pornhub say otherwise:\n\nhttps://www.pornhub.com/insights/2019-year-in-review\n\n>Look at the most popular stars, they all started out as \"teens\"\n\nYes, but they didn't reach the top of popularity until being around 25. Otherwise the most popular pornstars today would be 18-20 don't you think?\n\nThe data doesn't support your views.",
            "author": null,
            "id": "g1h4kcq",
            "parent_id": "t1_g1gzr75",
            "score": 1,
            "created_utc": 1597433247.0,
            "replies": []
        },
        {
            "body": "Just a reminder that many sexual assault victims role play their abuse (especially true if child victims) in their healthy relationships. It *can* be a healthy way of reliving the trauma on their own terms - which is gaining power back. However, all of this should be done with knowledge, consent, and communication with all parties involved.",
            "author": "GulfCoastFlamingo",
            "id": "g1dyxmj",
            "parent_id": "t1_g1d3bj8",
            "score": 2,
            "created_utc": 1597363594.0,
            "replies": []
        },
        {
            "body": "tell us more!",
            "author": "poofymon",
            "id": "g1fxeas",
            "parent_id": "t1_g1fsaue",
            "score": 2,
            "created_utc": 1597413744.0,
            "replies": []
        }
    ]
}