{
    "title": "Demystifying the Science and Mythology of Hair Care",
    "post_id": "9sj8w9",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/9sj8w9/demystifying_the_science_and_mythology_of_hair/",
    "author": "tPRoC",
    "body": "Over the years, I've grown increasingly frustrated by the hair care advice I've come across. Things never seem to work the way they're supposed to, and people seem to exclusively rely on anecdotes and personal experiences when giving their recommendations, often repeating things they read in a beauty mag or blog where the main goal is often to sell hair product or push dogma.\n\nSo I've done some digging, to learn a little bit about the real chemistry and science behind your hair care products, to dispel some myths and get to the truth of what's going on with your hair.\n\nSources:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4387693/\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4458934/\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/19467087\n\n#What is hair?\n\n>*Hair is an integrated system with a peculiar chemical and physical behavior. It is a complex structure of several morphological components that act as a unit. The hair shaft of mammals is divided into three main regions: Cuticle, cortex and medulla. The medulla is present in corser hair like grey hair, thick hair and beard hair, and it is absent in fine hair of children. There is more medulla in the coarser hair of Asians than Caucasians. The medulla may be involved in the splitting of hairs since it provides an area of weakness as a pathway for the propagation of cracks along the axis of the fiber.*\n\n>*The cuticle is a chemically resistant region and consists of flap overlapping scales (keratinocytes) like shingles on the roof. The shape and orientation of the cuticle cells are responsible for the differential friction effect in hair. The cuticle is generally formed by 6–8 scales thick for Asians, slightly less in Caucasians and even less in African hair. A thinner cuticle layer makes African hair more prone to breakage.*\n\n[Image](https://cdn.shopify.com/s/files/1/1083/7638/files/Hair-Anatomy-e1421050694589.png?v=1505924657)\n\n\n#Why do we shampoo? Is it necessary?\n\nOver time, your hair will develop a build up of dirt and other pollutants (eg: campfire smoke, minerals from hard water) as well as sebum, sweat and dead/peeled skin.\n\nPrior to the 1930's we simply used bar soap to wash our hair. The issue with this is that it would often leave a residue/soap scum on the scalp and hair, which is uncomfortable and aesthetically unpleasing. Shampoo was the answer.\n\nIn recent years, you may have heard that you don't need to shampoo, and that it causes your hair to produce more oils. This is untrue- there is no evidence to support the claim that using shampoo stimulates production of sebum on the scalp, including shampoos that contain sulfates and silicons.\n\nMost proponents of no-poo substitute shampoo with an alternative such as ACV or a specially formulated conditioner that effectively serves the same purpose.\n\n#How does shampoo work?\n\nThe main active ingredient in shampoo is a type of molecule called a surfacant. This is typically a sulfate, with the most common being Sodium Laureth Sulfate and Sodium Lauryl Sulfate. You may have heard that all sulfates do is \"create suds\" and damage your hair, this is incorrect.\n\n>*Residues are nonsoluble fats (sebum) that do not dissolve with water. In order to be removed from the hair shaft, surfactants present a hydrophobic molecular portion, and another hydrophilic. The former will chemically bond with the fat, while the latter will bond with the water. The surfactants are generally composed of a chain of fatty hydrocarbons (tail) and a polar head. The polar extremity is capable of giving this portion of the molecule hydrophilic traits that allow it to dissolve in water and wash away the residues.* \n\nWhat this basically means is that one end of the surfacant will attract water, and the other will repel it and attract sebum, allowing it to be washed out of the hair along with the shampoo.\n\nSurfacants can be classified into four groups: Anionic, cationic, amphoteric and nonionic.\n\n[Here's a classifications chart of common surfacants.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4387693/bin/IJT-7-2-g001.jpg) \n\n* **Anionic detergents:** Among the most popular surfactants, they are named for their negatively charged hydrophilic polar group. Derived from fatty alcohols, they are very good at removing sebum from the scalp and hair. However, the excessively cleaned hair is harsh, rough, dull with frizz and prone to tangling. Among them, different classes of detergents are available with certain selective properties.\n 1. **Lauryl sulfates:** Popular primary cleansers, they work well in both hard and soft water, produce rich foam, and are easily rinsed. They are excellent cleansers, commonly used in shampoos for oily hair. As the hair becomes harsh and rough, careful selection of a secondary detergent and possible use of a conditioning agent is always required as part of the shampoo formulation. Examples of this class include: Sodium lauryl sulfate, triethanolamine lauryl sulfate, and ammonium lauryl sulfate\n 2. **Laureth sulfates:** These are another class of excellent detergents with good cleansing ability and foaming property which are useful for normal-to-dry hair. Examples of this chemical class are: Sodium laureth sulfate, triethanolamine laureth sulfate, and ammonium laureth sulfate\n 3. **Sarcosines:** They are generally secondary detergents, as they do not remove sebum well from the hair to justify as primary cleansers. They are listed as the second or third on ingredient list of detergents. Excellent conditioners are used in conditioning shampoos and dry hair shampoos. Examples are: Lauryl sarcosine and sodium lauryl sarcosinate\n 4. **Sulfosuccinates:** These are strong detergents commonly used as a secondary surfactant in oily hair shampoos. Examples are disodium oleaminesulfosuccinate and sodium dioctylsulfosuccinate.\n\n* **Cationic Detergents:** In contrast to anionic detergents they have a positively charged polar group. They are poor cleansers and do not lather well and are not compatible with anionic detergents, limiting their utility. However, they are excellent at imparting softness and manageability to chemically damaged hair and so are primarily used as daily shampoo for damaged hair such as in case of permanently dyed or chemically bleached hair. Examples are: Long-chain amino esters, ammonioesters, cetyltrimethylammonium chloride.\n\n* **Amphoteric Detergents:** Having both positively and negatively charged polar group, they behave differently at lower pH (as cationic detergent) and at higher pH (as anionic detergent). Subgroups include the betaines, sultaines, and imidazolinium derivatives. They are used in baby shampoo and for those with fine and damaged hair because they don’t cause stinging in the eyes in children, foam well and leave hair in manageable state. Examples are: Cocamidopropyl betaine and sodium lauraminopropionate.\n\n* **Nonionic Detergents:** They have no polar group and are among the mildest of all cleansers and aid to improve the antistatic qualities of a shampoo. They can be combined with ionic detergent as a secondary cleanser. Examples are: Polyoxyethylene fatty alcohols, polyoxyethylene sorbitol esters and alkanolamides.\n\nAll shampoos contain some variation or combination of these substances to wash your hair. Some sulfate-free shampoos may contain none, but this means that they are basically not effectively cleansing your hair. (most sulfate free shampoos will simply use a surfacant that doesn't contain the word \"sulfate\", though)\n\nHigh end shampoos from salons contain these same ingredients, with the main difference being perhaps nicer smells and a much stronger concentration that requires dilution in water before use.\n\n#####How often should I shampoo?\n\nYou probably do not need to shampoo every day, and you do not need to go weeks without shampooing. Shampoo your hair when it is oily or dirty. Experiment with different shampoos and take a look at the active chemicals that are doing the heavy lifting. \n\n#The benefit of conditioner\n\nModern shampoos are extremely effective. Unfortunately, heavily cleansed hair is not desirable to most, as it is harsh, hard to manage, prone to tangling, and looks dull.\n\nThe solution to this is a conditioner, which are sometimes included in the shampoo itself. \n\nA conditioner is any substance which is intended to enhance feel, appearance, fullness, lubricity, shine, and general manageability of hair. \n\n>*Conditioner molecules contain cationic surfactant which gives a positive electric charge to the conditioner. The negative charge of the hair is attracted to the positively charged conditioner molecules, which results in conditioner getting deposited on the hair, especially on areas where there is degree of weathering. This is true for damaged hair as they are even more negatively charged. Thus, conditioners reduce the static electricity. They also flatten the cuticle scales over the hair shaft, reducing the friction between hair fibers, increasing the reflectance of light which improves shine and color. The smooth feel resulting from conditioner use gives easier combing and detangling in both wet and dry conditions. Conditioners temporarily seal split ends and mend trichoptilosis.*\n\nConditioners will contain a wide variety of ingredients:\n\n* **Cationic surfactants:** Cetyltrimethylammonium chloride, behentrimonium or propyltrimonium, stearamidopropyl dimethylamine. They are considered the backbone of a conditioner\nPolymers: Mono and polypeptides like hydrolyzed proteins (amino acids), polypeptides derived from collagen and polyvinylpyrrolidone (PVP)\n\n* **Bodying agents and thickeners:** Fatty alcohols (e.g. cetyl alcohol and stearyl alcohol), waxes (e.g. carnauba wax and paraffin wax), or gums (e.g. guar gum) and salt (sodium chloride)\n\n* **Emollients/oily compounds:** These include natural or synthetic oils, but also esters and waxes. Natural oils used in conditioners are, for example, jojoba oil, olive oil, or grape seed oil. The most frequently used synthetic oils are silicone (e.g. dimethicone, dimethiconol, amodimethicone and cyclomethicone) which are even superior to natural oils in terms of film formation, shine and luster. Asian countries have large hair diameters, therefore a higher concentration of silicone is used as compared to that for Caucasian hair (3-5% vs 0.5%)[1]\n\n* **Auxiliary emulsifiers:** Ethoxylated fatty alcohols (e.g. polysorbate-80 or ceteareth-20) which are non-ionic agents seem to be particularly effective at providing emulsion stability if it cannot be acheived by catiionic agents alone in a conditioner.\n\nThe big bogeyman you may notice is silicons. It is not bad for your hair, and not all silicons are equal. If you use a good shampoo with a good surfacant, build-up is not a concern and you likely don't need to worry too much about this. The backlash against silicons cropped up when people decided to eschew sulfates in their shampoo. Many people quickly realized that without proper cleansing, some silicons would build up in the hair over time.\n\nLike all things related to hair care, the key is balance. A fairly comprehensive resource for different types of silicons and how they behave is [this post](https://www.reddit.com/r/HaircareScience/comments/1woutk/all_about_silicones/) on /r/HairCareScience*, keep this in mind when deciding on which hair product to purchase for your hair.\n\n*while /r/HairCareScience has some good information on it and the moderators know their stuff, be wary of basically every comment from the users, as most of them are simply giving others anecdotal advice and spreading bogeymen.\n\n#How to wash and condition your hair.\n\nThe way you apply these products to your hair is undervalued, and doing it properly may have more benefit than you might suspect.\n\nShampoo should be applied starting from the front and working your way to the back. Applying it directly to the top of the head will create friction and cause tangling. \n\nOnce the shampoo has been rinsed from your hair, it's recommended to gently towel dry your hair before applying the conditioner. Conditioner should be applied on the length of the hair, avoiding the scalp.\n\nLeaving conditioner in your hair is not necessary, once the product has been spread over the surface of your hair it has done its job and may be rinsed out completely.\n\nAfterwards the hair may be gently towel dried. \n\n(If your hair is curly, there may be extra steps such as applying a leave-in product while hair is still wet. Using such products on straight thin hair may result in it looking oily and dull.)\n\n#TL;DR?\n\n* Wash your hair when it's dirty/oily. \n\n* There is no evidence to support the claim that sulfates stimulate the sebaceous glands to produce more oil than normal.\n\n* Sulfates are not bad for your hair, but may cause it to look dry and become hard to manage. \n\n* Use conditioner or use a less effective surfacant to combat the above problem.\n\n* Silicons are not bad for your hair, most good shampoos will prevent any build up from happening.\n\n* The key to good hair care is not going \"no poo\" or \"sulfate/silicon free\", it's finding the right balance of chemicals to wash your hair and keep it looking good. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "url": "https://www.reddit.com/r/malehairadvice/comments/9sj8w9/demystifying_the_science_and_mythology_of_hair/",
    "score": 288,
    "upvote_ratio": 0.99,
    "created_utc": 1540861524.0,
    "num_comments": 22,
    "links": [
        [
            "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4387693/",
            "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4458934/",
            "https://www.ncbi.nlm.nih.gov/pubmed/19467087",
            "https://cdn.shopify.com/s/files/1/1083/7638/files/Hair-Anatomy-e1421050694589.png?v=1505924657",
            "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4387693/bin/IJT-7-2-g001.jpg",
            "https://www.reddit.com/r/HaircareScience/comments/1woutk/all_about_silicones/",
            "/r/HairCareScience",
            "/r/HairCareScience"
        ]
    ],
    "comments": [
        {
            "body": "That's a lot of really good information, very good for hair knowledge. Thanks my dude",
            "author": "Urndy",
            "id": "e8pm1pv",
            "parent_id": "t3_9sj8w9",
            "score": 25,
            "created_utc": 1540878568.0,
            "replies": []
        },
        {
            "body": "this is great info hope it gets more visibility. thanks bro!",
            "author": null,
            "id": "e8poesh",
            "parent_id": "t3_9sj8w9",
            "score": 6,
            "created_utc": 1540883086.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e8pz9cu",
            "parent_id": "t3_9sj8w9",
            "score": 5,
            "created_utc": 1540902902.0,
            "replies": [
                {
                    "body": "See a dermatologist ",
                    "author": "GrampaStaxx",
                    "id": "e8qdvfd",
                    "parent_id": "t1_e8pz9cu",
                    "score": 3,
                    "created_utc": 1540916029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can we add this to the FAQ?",
            "author": "Mrminecrafthimself",
            "id": "e8q20z6",
            "parent_id": "t3_9sj8w9",
            "score": 5,
            "created_utc": 1540905875.0,
            "replies": []
        },
        {
            "body": "Good info in here. Just a friendly heads up that you are using the word silicon instead of silicone. Similar words, but completely different things. ",
            "author": "bandholz",
            "id": "e8pt672",
            "parent_id": "t3_9sj8w9",
            "score": 3,
            "created_utc": 1540893462.0,
            "replies": []
        },
        {
            "body": "Excellent information! Thanks for sharing. I know this is a men's sub, but I'm hopeless when it comes to hair care as a female. Gotta go everywhere for info!",
            "author": null,
            "id": "e8pu9cf",
            "parent_id": "t3_9sj8w9",
            "score": 2,
            "created_utc": 1540895622.0,
            "replies": [
                {
                    "body": "Keep in mind that if you have longer hair, the natural oils from the scalp cannot easily travel to the ends of the hair. This is where a lot of these “myths” come from. Focus your attention on the scalp and base of the hair and work your way out as necessary.",
                    "author": "GrampaStaxx",
                    "id": "e8qed2x",
                    "parent_id": "t1_e8pu9cf",
                    "score": 1,
                    "created_utc": 1540916416.0,
                    "replies": [
                        {
                            "body": "Oh I know. Doesn't help that my hair is wavy/curly, so it's even harder to get the oil down my strands.  I think I actually need silicones to help tame my hair, and it goes against everything curly girl/guy method",
                            "author": null,
                            "id": "e8qemum",
                            "parent_id": "t1_e8qed2x",
                            "score": 1,
                            "created_utc": 1540916630.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">There is no evidence to support the claim that sulfates stimulate the sebaceous glands to produce more oil than normal.\n\nI would like to add some more information about this, because that part of your post can be interpreted wrongly, as in \"it doesn't matter how much you wash your hair with shampoo, it wont affect the rate at which your hair gets greasy anyways\". I believe your statement to be true that sulfates themselves wont stimulate the sebaceous glands to produce more oil. However, washing your hair too often will substantially raise the rate at which your scalp produces oil and thus the rate at which your hair gets greasy. There are two main reasons for this. The first reason is that when you wash your hair and scalp, you'll also inevitably stimulate the skin in that area, creating friction which results in more blood flow that will make the sebaceous glands \"work better\". The second reason is that by washing your hair you'll also remove the oil from your scalp. Leaving your skin in a dry condition. Dry skin will make your sebaceous glands work overtime to fix exactly that problem, as their main function is to lubricate and waterproof your skin. \n\nTldr: Don't wash your hair too often, it will get your hair greasy fast. It can also cause dandruff in the long term by overstimulating the sebaceous glands.\n\nSource: Studied hairdressing and am a barber. ",
            "author": "Marscake",
            "id": "e8qygq0",
            "parent_id": "t3_9sj8w9",
            "score": 2,
            "created_utc": 1540932258.0,
            "replies": [
                {
                    "body": "Can you provide a real scientific source for your claims? Being a hairdresser / barber is not sufficient.\n\nIf not then I'm going to suggest people ignore this post and consider it just an anecdote, because as far as I can tell there's no science to back this claim up. \n\nIn fact, [this article from ncbi](https://www.ncbi.nlm.nih.gov/pubmed/19467087) suggests that your claim is just straight up incorrect, that the periods one goes between washing has no effect on how much oil the scalp produces.\n\n",
                    "author": "tPRoC",
                    "id": "e8qzc29",
                    "parent_id": "t1_e8qygq0",
                    "score": 2,
                    "created_utc": 1540932957.0,
                    "replies": [
                        {
                            "body": "There actually is a feedback mechanism that regulates sebum production by the sebaceous glands. See:\nhttps://link.springer.com/article/10.1007%2FBF00560397\n\nI'm giving this advice as a hairdresser, not as a scientist or doctor so do with it as you like people: \n\nKeep in mind that washing your hair too often using detergents will eventually irritate your scalp. The skin on your head won't appreciate it, you'll possibly have problems with sebum regulation, skin flaking, redness and itchiness. Every person is different so you'll have to see what works best for you in terms of hair washing intervals. Washing with shampoo every 2 to 3 or 4 days is recommended. Daily washing of your hair with shampoo will cause more harm than good in most cases. If you need to wash your hair daily for whatever reason it's recommended to clean with only water every other day. In fact over washing your hair with shampoo is not only bad for your scalp but also for your hair. \n\n\nYou don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!",
                            "author": "Marscake",
                            "id": "e8rcrfp",
                            "parent_id": "t1_e8qzc29",
                            "score": 2,
                            "created_utc": 1540944602.0,
                            "replies": [
                                {
                                    "body": ">You don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!\n\nI did this, and I also did nopoo for 2 years. I don't recommend either one, but those are just anecdotes, which goes against the whole point of this thread in the first place.\n\nGenerally speaking, people should wash their hair when it's dirty/oily. For most people this is every few days. And if you work a job like construction, you should probably be washing every day...\n\n",
                                    "author": "tPRoC",
                                    "id": "e8rdm8z",
                                    "parent_id": "t1_e8rcrfp",
                                    "score": 2,
                                    "created_utc": 1540945373.0,
                                    "replies": [
                                        {
                                            "body": ">I did this, and I also did nopoo for 2 years. I don't recommend either one,\n\n>Generally speaking, people should wash their hair when it's dirty/oily.\n\nTotally agree with you there.",
                                            "author": "Marscake",
                                            "id": "e8re62l",
                                            "parent_id": "t1_e8rdm8z",
                                            "score": 3,
                                            "created_utc": 1540945871.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e8pna2s",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1540880848.0,
            "replies": [
                {
                    "body": "It could just be hairline maturation.  When I was like 17/18 I lost a little hair and my hairline moved back quite a bit, especially around my temples. But now im 21 and it hasn't changed at all, maybe even some hair has come back. Its common for this to happen to guys around this age, I noticed it in a lot of my friends too. ",
                    "author": "FeignedSerbian",
                    "id": "e8q50go",
                    "parent_id": "t1_e8pna2s",
                    "score": 1,
                    "created_utc": 1540908654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post, thank you!",
            "author": "Tsobe_RK",
            "id": "e8pspog",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1540892486.0,
            "replies": []
        },
        {
            "body": "Man this is good advice, but I’m absolutely tired of flakes coming off my hair every time I brush my hair. I’ve tried every shampoo and nothing solves it.",
            "author": "sidhantsv",
            "id": "e8q55ax",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1540908775.0,
            "replies": []
        },
        {
            "body": "I wonder what kinds of leave-in products make sense? It's hard to understand effectively how these work especially for those of us with long (greater than a foot) of hair..",
            "author": "aliljet",
            "id": "e8qaxwu",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1540913686.0,
            "replies": []
        },
        {
            "body": "People often recommend on here rinsing hair with just water. That’s great and all but it makes my scalp super itchy and makes my hair look dirty and greasy. I’ll continue shampooing every day thanks ",
            "author": "SuperPoop",
            "id": "e8qgoz7",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1540918244.0,
            "replies": []
        },
        {
            "body": "Well i have the Problem that i have rly dry scalp. i have dandruff instantly after showering. i tried many shampoos. i tried tea tree oil, baby shampoo and many anti dandruff shampoos. nothing rly helps. i cant wear black things because everyone would see the flakes immediately.",
            "author": "DarkFite",
            "id": "e8qjb71",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1540920388.0,
            "replies": []
        },
        {
            "body": "What is a good conditioner that smells manly? I can find men's 2 in 1 everywhere. But what I'm looking for is a conditioner or something that will help tame frizz, promote moisture, but not oily, and not smell like girls soaps. ",
            "author": "fidgetiegurl09",
            "id": "ed5z4yw",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1546539976.0,
            "replies": []
        },
        {
            "body": "nice blog and its quite useful in [specially formulated hair conditioner](http://curatiohealthcare.com/portfolio/triflow/). thanks for sharing your information.",
            "author": "varanika",
            "id": "ei9k0z7",
            "parent_id": "t3_9sj8w9",
            "score": 1,
            "created_utc": 1552294096.0,
            "replies": []
        },
        {
            "body": "See a dermatologist ",
            "author": "GrampaStaxx",
            "id": "e8qdvfd",
            "parent_id": "t1_e8pz9cu",
            "score": 3,
            "created_utc": 1540916029.0,
            "replies": []
        },
        {
            "body": "Keep in mind that if you have longer hair, the natural oils from the scalp cannot easily travel to the ends of the hair. This is where a lot of these “myths” come from. Focus your attention on the scalp and base of the hair and work your way out as necessary.",
            "author": "GrampaStaxx",
            "id": "e8qed2x",
            "parent_id": "t1_e8pu9cf",
            "score": 1,
            "created_utc": 1540916416.0,
            "replies": [
                {
                    "body": "Oh I know. Doesn't help that my hair is wavy/curly, so it's even harder to get the oil down my strands.  I think I actually need silicones to help tame my hair, and it goes against everything curly girl/guy method",
                    "author": null,
                    "id": "e8qemum",
                    "parent_id": "t1_e8qed2x",
                    "score": 1,
                    "created_utc": 1540916630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you provide a real scientific source for your claims? Being a hairdresser / barber is not sufficient.\n\nIf not then I'm going to suggest people ignore this post and consider it just an anecdote, because as far as I can tell there's no science to back this claim up. \n\nIn fact, [this article from ncbi](https://www.ncbi.nlm.nih.gov/pubmed/19467087) suggests that your claim is just straight up incorrect, that the periods one goes between washing has no effect on how much oil the scalp produces.\n\n",
            "author": "tPRoC",
            "id": "e8qzc29",
            "parent_id": "t1_e8qygq0",
            "score": 2,
            "created_utc": 1540932957.0,
            "replies": [
                {
                    "body": "There actually is a feedback mechanism that regulates sebum production by the sebaceous glands. See:\nhttps://link.springer.com/article/10.1007%2FBF00560397\n\nI'm giving this advice as a hairdresser, not as a scientist or doctor so do with it as you like people: \n\nKeep in mind that washing your hair too often using detergents will eventually irritate your scalp. The skin on your head won't appreciate it, you'll possibly have problems with sebum regulation, skin flaking, redness and itchiness. Every person is different so you'll have to see what works best for you in terms of hair washing intervals. Washing with shampoo every 2 to 3 or 4 days is recommended. Daily washing of your hair with shampoo will cause more harm than good in most cases. If you need to wash your hair daily for whatever reason it's recommended to clean with only water every other day. In fact over washing your hair with shampoo is not only bad for your scalp but also for your hair. \n\n\nYou don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!",
                    "author": "Marscake",
                    "id": "e8rcrfp",
                    "parent_id": "t1_e8qzc29",
                    "score": 2,
                    "created_utc": 1540944602.0,
                    "replies": [
                        {
                            "body": ">You don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!\n\nI did this, and I also did nopoo for 2 years. I don't recommend either one, but those are just anecdotes, which goes against the whole point of this thread in the first place.\n\nGenerally speaking, people should wash their hair when it's dirty/oily. For most people this is every few days. And if you work a job like construction, you should probably be washing every day...\n\n",
                            "author": "tPRoC",
                            "id": "e8rdm8z",
                            "parent_id": "t1_e8rcrfp",
                            "score": 2,
                            "created_utc": 1540945373.0,
                            "replies": [
                                {
                                    "body": ">I did this, and I also did nopoo for 2 years. I don't recommend either one,\n\n>Generally speaking, people should wash their hair when it's dirty/oily.\n\nTotally agree with you there.",
                                    "author": "Marscake",
                                    "id": "e8re62l",
                                    "parent_id": "t1_e8rdm8z",
                                    "score": 3,
                                    "created_utc": 1540945871.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It could just be hairline maturation.  When I was like 17/18 I lost a little hair and my hairline moved back quite a bit, especially around my temples. But now im 21 and it hasn't changed at all, maybe even some hair has come back. Its common for this to happen to guys around this age, I noticed it in a lot of my friends too. ",
            "author": "FeignedSerbian",
            "id": "e8q50go",
            "parent_id": "t1_e8pna2s",
            "score": 1,
            "created_utc": 1540908654.0,
            "replies": []
        },
        {
            "body": "Oh I know. Doesn't help that my hair is wavy/curly, so it's even harder to get the oil down my strands.  I think I actually need silicones to help tame my hair, and it goes against everything curly girl/guy method",
            "author": null,
            "id": "e8qemum",
            "parent_id": "t1_e8qed2x",
            "score": 1,
            "created_utc": 1540916630.0,
            "replies": []
        },
        {
            "body": "There actually is a feedback mechanism that regulates sebum production by the sebaceous glands. See:\nhttps://link.springer.com/article/10.1007%2FBF00560397\n\nI'm giving this advice as a hairdresser, not as a scientist or doctor so do with it as you like people: \n\nKeep in mind that washing your hair too often using detergents will eventually irritate your scalp. The skin on your head won't appreciate it, you'll possibly have problems with sebum regulation, skin flaking, redness and itchiness. Every person is different so you'll have to see what works best for you in terms of hair washing intervals. Washing with shampoo every 2 to 3 or 4 days is recommended. Daily washing of your hair with shampoo will cause more harm than good in most cases. If you need to wash your hair daily for whatever reason it's recommended to clean with only water every other day. In fact over washing your hair with shampoo is not only bad for your scalp but also for your hair. \n\n\nYou don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!",
            "author": "Marscake",
            "id": "e8rcrfp",
            "parent_id": "t1_e8qzc29",
            "score": 2,
            "created_utc": 1540944602.0,
            "replies": [
                {
                    "body": ">You don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!\n\nI did this, and I also did nopoo for 2 years. I don't recommend either one, but those are just anecdotes, which goes against the whole point of this thread in the first place.\n\nGenerally speaking, people should wash their hair when it's dirty/oily. For most people this is every few days. And if you work a job like construction, you should probably be washing every day...\n\n",
                    "author": "tPRoC",
                    "id": "e8rdm8z",
                    "parent_id": "t1_e8rcrfp",
                    "score": 2,
                    "created_utc": 1540945373.0,
                    "replies": [
                        {
                            "body": ">I did this, and I also did nopoo for 2 years. I don't recommend either one,\n\n>Generally speaking, people should wash their hair when it's dirty/oily.\n\nTotally agree with you there.",
                            "author": "Marscake",
                            "id": "e8re62l",
                            "parent_id": "t1_e8rdm8z",
                            "score": 3,
                            "created_utc": 1540945871.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">You don't have to believe me, try and see for yourself, shampoo your hair every day and see what happens!\n\nI did this, and I also did nopoo for 2 years. I don't recommend either one, but those are just anecdotes, which goes against the whole point of this thread in the first place.\n\nGenerally speaking, people should wash their hair when it's dirty/oily. For most people this is every few days. And if you work a job like construction, you should probably be washing every day...\n\n",
            "author": "tPRoC",
            "id": "e8rdm8z",
            "parent_id": "t1_e8rcrfp",
            "score": 2,
            "created_utc": 1540945373.0,
            "replies": [
                {
                    "body": ">I did this, and I also did nopoo for 2 years. I don't recommend either one,\n\n>Generally speaking, people should wash their hair when it's dirty/oily.\n\nTotally agree with you there.",
                    "author": "Marscake",
                    "id": "e8re62l",
                    "parent_id": "t1_e8rdm8z",
                    "score": 3,
                    "created_utc": 1540945871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I did this, and I also did nopoo for 2 years. I don't recommend either one,\n\n>Generally speaking, people should wash their hair when it's dirty/oily.\n\nTotally agree with you there.",
            "author": "Marscake",
            "id": "e8re62l",
            "parent_id": "t1_e8rdm8z",
            "score": 3,
            "created_utc": 1540945871.0,
            "replies": []
        }
    ]
}