{
    "title": "It’s not just the financial help…",
    "post_id": "t76p77",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t76p77/its_not_just_the_financial_help/",
    "author": "Cuddly_Koala_Bear",
    "body": "I had an interview this week for my dream co-op job, and I absolutely crushed it thanks to my SD! \n\nAll my past interviews were in the restaurant industry where I was basically just looked up and down and asked what my availability was. So last week, after I arranged my first interview in the field I’m studying, I realized I hadn’t yet experienced a true interview. \n\nMy SD spent over an hour giving tips and coaching me, and they were so helpful despite us being in completely different fields. \n\nI received the offer for the position this morning!\nI’ll definitely be showing my SD gratitude for his help next time I see him 😉",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t76p77/its_not_just_the_financial_help/",
    "score": 100,
    "upvote_ratio": 0.95,
    "created_utc": 1646476084.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "hzgivsq",
            "parent_id": "t3_t76p77",
            "score": 31,
            "created_utc": 1646493225.0,
            "replies": [
                {
                    "body": "I’m actually going to take you up on this.",
                    "author": "Dazzleshamazzle",
                    "id": "hzivybq",
                    "parent_id": "t1_hzgivsq",
                    "score": 3,
                    "created_utc": 1646531345.0,
                    "replies": [
                        {
                            "body": "I just wanted to follow up on my above comment to encourage you girls to take up any SD’s offer to give some advice. I spoke to PlayfulMentor for a bit and it was so great just hashing out what I’d like to do next. Surprisingly the most helpful part was getting asked questions I hadn’t really thought about but that I do need to nail down to move forward. So even if you’re not sure exactly what you want to do (maybe tech, maybe you’re still figuring out your interests or if you should go back to school, etc.), take the opportunity to chat with someone who’s established and at a point in their career where we likely all hope to be one day.",
                            "author": "Dazzleshamazzle",
                            "id": "hzxknp2",
                            "parent_id": "t1_hzivybq",
                            "score": 3,
                            "created_utc": 1646799169.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm going to tag in here. Over the course of my career, I have interviewed literally thousands of job candidates. The last company I founded now has 35,000 employees. I personally interviewed the first 500. \n\nAt many companies, there are 2 \"screens\" you need to get through. One is a \"skills screen.\" We are trying to find out do you have the right skills to do the job? These could be very specific skills, like a programming language, carpentry, plumbing, etc.\n\nThe other is a \"behavioral screen.\" We are trying to figure out do you have the right personality, the right mindset for the job. For instance, the job might require a very high degree of teamwork.  We need to figure out if you can actually work effectively in a team. You may have amazing skills, but if you can't work in a team, then your skills don't matter. \n\nThe most common approach to the \"behavioral screen\" is to do somthing called a behavioral interview. In a behavioral interview, we tende to ask questions that start with \"Tell me about a time when...\" We are trying to understand past behavior, because while it is imperfect, it is the best indicator we have of future performance. Here is a typical example of a BI question on teamwork: \"Share an example of how you were able to motivate a coworker, your peers or your team.\"\n\nThere is a great deal of informaton on behavioral interviewing on-online. Here is a link to get you started from Indeed.\n\n[https://www.indeed.com/career-advice/interviewing/most-common-behavioral-interview-questions-and-answers](https://www.indeed.com/career-advice/interviewing/most-common-behavioral-interview-questions-and-answers)\n\nTo bring this full circle, at my last company, we STARTED with a behavioral screen. Why? I can teach you skills like how to use Excel. It is WAY harder to teach you new behaviors. If you didn't come to the company with the right behaviors, no level of right skills mattered.",
                    "author": "Wandering_SD",
                    "id": "hzklcc9",
                    "parent_id": "t1_hzgivsq",
                    "score": 3,
                    "created_utc": 1646571847.0,
                    "replies": []
                },
                {
                    "body": "Thanks for the solid advice!! It is very insightful and you got me considering many things I did not recognize as advantageous. As a Latina wanting to further myself in the tech industry it’s a bit difficult figuring next moves so I definitely appreciate you taking the time to correspond with me 🥲",
                    "author": null,
                    "id": "hzx2yhf",
                    "parent_id": "t1_hzgivsq",
                    "score": 2,
                    "created_utc": 1646790880.0,
                    "replies": []
                },
                {
                    "body": "hi! no help needed as of yet but i would LOVE to befriend some stem babies, esp ones in tech!! i am an aspiring UX/UI designer after learning python and javascript (also html and css) and currently learning swift to be able to be a UX engineer as well, along with creating my own apps. if any other babies out there looking to build a lil network, i would not be mad about it!",
                    "author": "smthingwturquoise",
                    "id": "i1oamu9",
                    "parent_id": "t1_hzgivsq",
                    "score": 1,
                    "created_utc": 1647964420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This, by the way, is a classic example of this elusive “mentoring” that so many people get confused about.",
            "author": "sdwizard74",
            "id": "hzgss5o",
            "parent_id": "t3_t76p77",
            "score": 17,
            "created_utc": 1646497609.0,
            "replies": [
                {
                    "body": "Yes!! A genuine relationship with some razzle dazzle.",
                    "author": "Electronic-Bunch7721",
                    "id": "hzh031s",
                    "parent_id": "t1_hzgss5o",
                    "score": 7,
                    "created_utc": 1646500686.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awww! This is so sweet! 🥰 Congratulations!!",
            "author": null,
            "id": "hzftxfv",
            "parent_id": "t3_t76p77",
            "score": 10,
            "created_utc": 1646477734.0,
            "replies": []
        },
        {
            "body": "curious, what are the tips?",
            "author": "ChefZestyclose7678",
            "id": "hzfuihk",
            "parent_id": "t3_t76p77",
            "score": 5,
            "created_utc": 1646478208.0,
            "replies": [
                {
                    "body": "If you want some interviewing tips you can DM me! I was a hiring manager for many years and now I work in talent acquisition. I help people often with their resumes and interviewing and would be happy to!",
                    "author": "Cdnsugarr",
                    "id": "hzghsnq",
                    "parent_id": "t1_hzfuihk",
                    "score": 14,
                    "created_utc": 1646492713.0,
                    "replies": [
                        {
                            "body": "Very cool!!!",
                            "author": "Pitkin_SD",
                            "id": "hzgqowr",
                            "parent_id": "t1_hzghsnq",
                            "score": 2,
                            "created_utc": 1646496715.0,
                            "replies": [
                                {
                                    "body": "I really enjoy it! \n\nPlus, I’ve had someone send me a resume that both their professor and a career guide at their Uni said was good and it was incredibly bad. Not getting any call backs and didn’t know why, thinking they had a decent resume and it was one of the worst I’ve seen. 🤦‍♀️",
                                    "author": "Cdnsugarr",
                                    "id": "hzgtvmg",
                                    "parent_id": "t1_hzgqowr",
                                    "score": 4,
                                    "created_utc": 1646498072.0,
                                    "replies": [
                                        {
                                            "body": "I agree that most resumes are terrible. And most of the people who try to help applicants craft better resumes have no idea what they are doing - in part because they have never actually hired anyone themselves.",
                                            "author": "Wandering_SD",
                                            "id": "hzkjv34",
                                            "parent_id": "t1_hzgtvmg",
                                            "score": 2,
                                            "created_utc": 1646570868.0,
                                            "replies": [
                                                {
                                                    "body": "You are absolutely correct! \n\nHowever, one time I had someone on Reddit show me a resume that both their Prof and Career counsellor at their uni looked at and approved. It bad spelling errors, awful formatting, and even has a sentence that didn’t finish. Fully missing half the words and nobody caught it 🤦‍♀️\n\nThey almost didn’t show me because they couldn’t believe it could be bad if someone approved it, and they assumed something else was the issue\n\nThese were just common sense mistakes. So disappointing! You don’t need to be a hiring manager to know it was a mess lol",
                                                    "author": "Cdnsugarr",
                                                    "id": "hzluta7",
                                                    "parent_id": "t1_hzkjv34",
                                                    "score": 2,
                                                    "created_utc": 1646592547.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It was just the tip…",
                    "author": "Twilight-310",
                    "id": "hzgbndk",
                    "parent_id": "t1_hzfuihk",
                    "score": 7,
                    "created_utc": 1646489643.0,
                    "replies": [
                        {
                            "body": "*Ba-DOMP-tssss!*",
                            "author": "Chill_SD1974",
                            "id": "hzi8d6q",
                            "parent_id": "t1_hzgbndk",
                            "score": 2,
                            "created_utc": 1646520149.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There are general tips  and \nalso potentially critical personal,  industry, company and individual tips.   A great SD should be able to help with the first two or three and in some cases all 4",
                    "author": "pinotandsugar",
                    "id": "hzib66w",
                    "parent_id": "t1_hzfuihk",
                    "score": 1,
                    "created_utc": 1646521461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The SBs who are trying to grow are my favorite because it gives us something we can celebrate together.\n\nSBs that just want money & don’t have a career (not getting into SW debate here) just turn me off.\n\nMy best SB used my LinkedIn hacks to go from 50 > 1,000 views, 0 > 50 recruiter contacts & landed her dream job. She is in a much better place than when we met.\n\nNow when we hang out (once a month I’m not her main SR) we just talk shop in bed. It’s hot AF.",
            "author": "notnoteworthyatall",
            "id": "hzi0g66",
            "parent_id": "t3_t76p77",
            "score": 12,
            "created_utc": 1646516551.0,
            "replies": [
                {
                    "body": "*“Tell me again how hard that meeting was!”*\n\nI love this.",
                    "author": "Chill_SD1974",
                    "id": "hzi82t2",
                    "parent_id": "t1_hzi0g66",
                    "score": 3,
                    "created_utc": 1646520013.0,
                    "replies": []
                },
                {
                    "body": "This is what I look for in a SR!",
                    "author": "sub-sugarbabe",
                    "id": "hzirqul",
                    "parent_id": "t1_hzi0g66",
                    "score": 2,
                    "created_utc": 1646529304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is exactly what a sugar relationship is about for me - being a positive influence in her life. There is nothing more satisfying then seeing someone you care about grow and prosper.\nI'm a CTO and have helped several people, not only SBs with interviews but also guidance on how to get started, and succeed, in the technology field. If anyone wants some info, feel free to reach out (and no, I don't expect anything out of it - helping someone is a reward by itself). Well done to both of you, and congratulations!\n\nEdit: reading the rest of the thread I see I'm not the only techie that made this offer! Elated to see that, as I thought, the tech field is genuinely helpful to newbies and SDs care about helping young women succeed, even if they are not in a relationship. SLF rocks!",
            "author": "SpartanInBritain",
            "id": "hzjw9rf",
            "parent_id": "t3_t76p77",
            "score": 3,
            "created_utc": 1646552098.0,
            "replies": []
        },
        {
            "body": "Good for you👍",
            "author": "Realistic_Scratch912",
            "id": "hzgpcyw",
            "parent_id": "t3_t76p77",
            "score": 2,
            "created_utc": 1646496141.0,
            "replies": []
        },
        {
            "body": "YAASSS !!!",
            "author": "Chill_SD1974",
            "id": "hzi7tn4",
            "parent_id": "t3_t76p77",
            "score": 2,
            "created_utc": 1646519894.0,
            "replies": []
        },
        {
            "body": "He is going to be as excited as you are.",
            "author": "LotBuilder",
            "id": "hzjn2ul",
            "parent_id": "t3_t76p77",
            "score": 2,
            "created_utc": 1646545807.0,
            "replies": []
        },
        {
            "body": "Love hearing stories like this.\n\nI wish it was easier to filter out the strippers, scammers, \"oh my god rent is due,\" and \"of course I'm not attracted to my SD\" types and find more people I can actually help.",
            "author": "quietgrey1",
            "id": "hzgv29x",
            "parent_id": "t3_t76p77",
            "score": 5,
            "created_utc": 1646498573.0,
            "replies": []
        },
        {
            "body": "I just hope more SBs spend time with their SD receiving real mentoring than only desiring $$$ and nothing else.",
            "author": "MKTekke",
            "id": "hzj8gjy",
            "parent_id": "t3_t76p77",
            "score": 2,
            "created_utc": 1646537672.0,
            "replies": []
        },
        {
            "body": "Congratulations, looks like your SD is doing his job.\n\n>I’ll definitely be showing my SD gratitude for his help\n\nNot being nosy but how will you do that? Asking  for a friend and he would like to know in detail!",
            "author": "chemistryromance",
            "id": "hzfspqd",
            "parent_id": "t3_t76p77",
            "score": 1,
            "created_utc": 1646476757.0,
            "replies": [
                {
                    "body": "Perv! 😜",
                    "author": "Cuddly_Koala_Bear",
                    "id": "hzfvbg9",
                    "parent_id": "t1_hzfspqd",
                    "score": 7,
                    "created_utc": 1646478873.0,
                    "replies": [
                        {
                            "body": "Sorry, that is what my hot therapist said. I am working on it.",
                            "author": "chemistryromance",
                            "id": "hzfywcg",
                            "parent_id": "t1_hzfvbg9",
                            "score": 4,
                            "created_utc": 1646481713.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Someone’s going to get anal 😂",
                    "author": "blk-tye",
                    "id": "hzg4dyf",
                    "parent_id": "t1_hzfspqd",
                    "score": 1,
                    "created_utc": 1646485499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "so happy for you!! i wish everyone has SRs like this one.",
            "author": "ThrowawayforSLF",
            "id": "hzjm65r",
            "parent_id": "t3_t76p77",
            "score": 1,
            "created_utc": 1646545246.0,
            "replies": []
        },
        {
            "body": "I think a good SR can provide so many helpful intangible things like this. If the SB is open to it, it’s really more value than most money can provide (though both are best. :)",
            "author": "garret6758",
            "id": "hzjvjyx",
            "parent_id": "t3_t76p77",
            "score": 1,
            "created_utc": 1646551555.0,
            "replies": []
        },
        {
            "body": "So glad that he did this for you.",
            "author": "Wandering_SD",
            "id": "hzkk6t1",
            "parent_id": "t3_t76p77",
            "score": 1,
            "created_utc": 1646571083.0,
            "replies": []
        },
        {
            "body": "That's awesome - congratulations!",
            "author": "roscoe7585",
            "id": "hzknicg",
            "parent_id": "t3_t76p77",
            "score": 1,
            "created_utc": 1646573216.0,
            "replies": []
        },
        {
            "body": "I’m actually going to take you up on this.",
            "author": "Dazzleshamazzle",
            "id": "hzivybq",
            "parent_id": "t1_hzgivsq",
            "score": 3,
            "created_utc": 1646531345.0,
            "replies": [
                {
                    "body": "I just wanted to follow up on my above comment to encourage you girls to take up any SD’s offer to give some advice. I spoke to PlayfulMentor for a bit and it was so great just hashing out what I’d like to do next. Surprisingly the most helpful part was getting asked questions I hadn’t really thought about but that I do need to nail down to move forward. So even if you’re not sure exactly what you want to do (maybe tech, maybe you’re still figuring out your interests or if you should go back to school, etc.), take the opportunity to chat with someone who’s established and at a point in their career where we likely all hope to be one day.",
                    "author": "Dazzleshamazzle",
                    "id": "hzxknp2",
                    "parent_id": "t1_hzivybq",
                    "score": 3,
                    "created_utc": 1646799169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm going to tag in here. Over the course of my career, I have interviewed literally thousands of job candidates. The last company I founded now has 35,000 employees. I personally interviewed the first 500. \n\nAt many companies, there are 2 \"screens\" you need to get through. One is a \"skills screen.\" We are trying to find out do you have the right skills to do the job? These could be very specific skills, like a programming language, carpentry, plumbing, etc.\n\nThe other is a \"behavioral screen.\" We are trying to figure out do you have the right personality, the right mindset for the job. For instance, the job might require a very high degree of teamwork.  We need to figure out if you can actually work effectively in a team. You may have amazing skills, but if you can't work in a team, then your skills don't matter. \n\nThe most common approach to the \"behavioral screen\" is to do somthing called a behavioral interview. In a behavioral interview, we tende to ask questions that start with \"Tell me about a time when...\" We are trying to understand past behavior, because while it is imperfect, it is the best indicator we have of future performance. Here is a typical example of a BI question on teamwork: \"Share an example of how you were able to motivate a coworker, your peers or your team.\"\n\nThere is a great deal of informaton on behavioral interviewing on-online. Here is a link to get you started from Indeed.\n\n[https://www.indeed.com/career-advice/interviewing/most-common-behavioral-interview-questions-and-answers](https://www.indeed.com/career-advice/interviewing/most-common-behavioral-interview-questions-and-answers)\n\nTo bring this full circle, at my last company, we STARTED with a behavioral screen. Why? I can teach you skills like how to use Excel. It is WAY harder to teach you new behaviors. If you didn't come to the company with the right behaviors, no level of right skills mattered.",
            "author": "Wandering_SD",
            "id": "hzklcc9",
            "parent_id": "t1_hzgivsq",
            "score": 3,
            "created_utc": 1646571847.0,
            "replies": []
        },
        {
            "body": "Thanks for the solid advice!! It is very insightful and you got me considering many things I did not recognize as advantageous. As a Latina wanting to further myself in the tech industry it’s a bit difficult figuring next moves so I definitely appreciate you taking the time to correspond with me 🥲",
            "author": null,
            "id": "hzx2yhf",
            "parent_id": "t1_hzgivsq",
            "score": 2,
            "created_utc": 1646790880.0,
            "replies": []
        },
        {
            "body": "hi! no help needed as of yet but i would LOVE to befriend some stem babies, esp ones in tech!! i am an aspiring UX/UI designer after learning python and javascript (also html and css) and currently learning swift to be able to be a UX engineer as well, along with creating my own apps. if any other babies out there looking to build a lil network, i would not be mad about it!",
            "author": "smthingwturquoise",
            "id": "i1oamu9",
            "parent_id": "t1_hzgivsq",
            "score": 1,
            "created_utc": 1647964420.0,
            "replies": []
        },
        {
            "body": "Yes!! A genuine relationship with some razzle dazzle.",
            "author": "Electronic-Bunch7721",
            "id": "hzh031s",
            "parent_id": "t1_hzgss5o",
            "score": 7,
            "created_utc": 1646500686.0,
            "replies": []
        },
        {
            "body": "If you want some interviewing tips you can DM me! I was a hiring manager for many years and now I work in talent acquisition. I help people often with their resumes and interviewing and would be happy to!",
            "author": "Cdnsugarr",
            "id": "hzghsnq",
            "parent_id": "t1_hzfuihk",
            "score": 14,
            "created_utc": 1646492713.0,
            "replies": [
                {
                    "body": "Very cool!!!",
                    "author": "Pitkin_SD",
                    "id": "hzgqowr",
                    "parent_id": "t1_hzghsnq",
                    "score": 2,
                    "created_utc": 1646496715.0,
                    "replies": [
                        {
                            "body": "I really enjoy it! \n\nPlus, I’ve had someone send me a resume that both their professor and a career guide at their Uni said was good and it was incredibly bad. Not getting any call backs and didn’t know why, thinking they had a decent resume and it was one of the worst I’ve seen. 🤦‍♀️",
                            "author": "Cdnsugarr",
                            "id": "hzgtvmg",
                            "parent_id": "t1_hzgqowr",
                            "score": 4,
                            "created_utc": 1646498072.0,
                            "replies": [
                                {
                                    "body": "I agree that most resumes are terrible. And most of the people who try to help applicants craft better resumes have no idea what they are doing - in part because they have never actually hired anyone themselves.",
                                    "author": "Wandering_SD",
                                    "id": "hzkjv34",
                                    "parent_id": "t1_hzgtvmg",
                                    "score": 2,
                                    "created_utc": 1646570868.0,
                                    "replies": [
                                        {
                                            "body": "You are absolutely correct! \n\nHowever, one time I had someone on Reddit show me a resume that both their Prof and Career counsellor at their uni looked at and approved. It bad spelling errors, awful formatting, and even has a sentence that didn’t finish. Fully missing half the words and nobody caught it 🤦‍♀️\n\nThey almost didn’t show me because they couldn’t believe it could be bad if someone approved it, and they assumed something else was the issue\n\nThese were just common sense mistakes. So disappointing! You don’t need to be a hiring manager to know it was a mess lol",
                                            "author": "Cdnsugarr",
                                            "id": "hzluta7",
                                            "parent_id": "t1_hzkjv34",
                                            "score": 2,
                                            "created_utc": 1646592547.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was just the tip…",
            "author": "Twilight-310",
            "id": "hzgbndk",
            "parent_id": "t1_hzfuihk",
            "score": 7,
            "created_utc": 1646489643.0,
            "replies": [
                {
                    "body": "*Ba-DOMP-tssss!*",
                    "author": "Chill_SD1974",
                    "id": "hzi8d6q",
                    "parent_id": "t1_hzgbndk",
                    "score": 2,
                    "created_utc": 1646520149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are general tips  and \nalso potentially critical personal,  industry, company and individual tips.   A great SD should be able to help with the first two or three and in some cases all 4",
            "author": "pinotandsugar",
            "id": "hzib66w",
            "parent_id": "t1_hzfuihk",
            "score": 1,
            "created_utc": 1646521461.0,
            "replies": []
        },
        {
            "body": "*“Tell me again how hard that meeting was!”*\n\nI love this.",
            "author": "Chill_SD1974",
            "id": "hzi82t2",
            "parent_id": "t1_hzi0g66",
            "score": 3,
            "created_utc": 1646520013.0,
            "replies": []
        },
        {
            "body": "This is what I look for in a SR!",
            "author": "sub-sugarbabe",
            "id": "hzirqul",
            "parent_id": "t1_hzi0g66",
            "score": 2,
            "created_utc": 1646529304.0,
            "replies": []
        },
        {
            "body": "Perv! 😜",
            "author": "Cuddly_Koala_Bear",
            "id": "hzfvbg9",
            "parent_id": "t1_hzfspqd",
            "score": 7,
            "created_utc": 1646478873.0,
            "replies": [
                {
                    "body": "Sorry, that is what my hot therapist said. I am working on it.",
                    "author": "chemistryromance",
                    "id": "hzfywcg",
                    "parent_id": "t1_hzfvbg9",
                    "score": 4,
                    "created_utc": 1646481713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone’s going to get anal 😂",
            "author": "blk-tye",
            "id": "hzg4dyf",
            "parent_id": "t1_hzfspqd",
            "score": 1,
            "created_utc": 1646485499.0,
            "replies": []
        },
        {
            "body": "I just wanted to follow up on my above comment to encourage you girls to take up any SD’s offer to give some advice. I spoke to PlayfulMentor for a bit and it was so great just hashing out what I’d like to do next. Surprisingly the most helpful part was getting asked questions I hadn’t really thought about but that I do need to nail down to move forward. So even if you’re not sure exactly what you want to do (maybe tech, maybe you’re still figuring out your interests or if you should go back to school, etc.), take the opportunity to chat with someone who’s established and at a point in their career where we likely all hope to be one day.",
            "author": "Dazzleshamazzle",
            "id": "hzxknp2",
            "parent_id": "t1_hzivybq",
            "score": 3,
            "created_utc": 1646799169.0,
            "replies": []
        },
        {
            "body": "Very cool!!!",
            "author": "Pitkin_SD",
            "id": "hzgqowr",
            "parent_id": "t1_hzghsnq",
            "score": 2,
            "created_utc": 1646496715.0,
            "replies": [
                {
                    "body": "I really enjoy it! \n\nPlus, I’ve had someone send me a resume that both their professor and a career guide at their Uni said was good and it was incredibly bad. Not getting any call backs and didn’t know why, thinking they had a decent resume and it was one of the worst I’ve seen. 🤦‍♀️",
                    "author": "Cdnsugarr",
                    "id": "hzgtvmg",
                    "parent_id": "t1_hzgqowr",
                    "score": 4,
                    "created_utc": 1646498072.0,
                    "replies": [
                        {
                            "body": "I agree that most resumes are terrible. And most of the people who try to help applicants craft better resumes have no idea what they are doing - in part because they have never actually hired anyone themselves.",
                            "author": "Wandering_SD",
                            "id": "hzkjv34",
                            "parent_id": "t1_hzgtvmg",
                            "score": 2,
                            "created_utc": 1646570868.0,
                            "replies": [
                                {
                                    "body": "You are absolutely correct! \n\nHowever, one time I had someone on Reddit show me a resume that both their Prof and Career counsellor at their uni looked at and approved. It bad spelling errors, awful formatting, and even has a sentence that didn’t finish. Fully missing half the words and nobody caught it 🤦‍♀️\n\nThey almost didn’t show me because they couldn’t believe it could be bad if someone approved it, and they assumed something else was the issue\n\nThese were just common sense mistakes. So disappointing! You don’t need to be a hiring manager to know it was a mess lol",
                                    "author": "Cdnsugarr",
                                    "id": "hzluta7",
                                    "parent_id": "t1_hzkjv34",
                                    "score": 2,
                                    "created_utc": 1646592547.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "*Ba-DOMP-tssss!*",
            "author": "Chill_SD1974",
            "id": "hzi8d6q",
            "parent_id": "t1_hzgbndk",
            "score": 2,
            "created_utc": 1646520149.0,
            "replies": []
        },
        {
            "body": "Sorry, that is what my hot therapist said. I am working on it.",
            "author": "chemistryromance",
            "id": "hzfywcg",
            "parent_id": "t1_hzfvbg9",
            "score": 4,
            "created_utc": 1646481713.0,
            "replies": []
        },
        {
            "body": "I really enjoy it! \n\nPlus, I’ve had someone send me a resume that both their professor and a career guide at their Uni said was good and it was incredibly bad. Not getting any call backs and didn’t know why, thinking they had a decent resume and it was one of the worst I’ve seen. 🤦‍♀️",
            "author": "Cdnsugarr",
            "id": "hzgtvmg",
            "parent_id": "t1_hzgqowr",
            "score": 4,
            "created_utc": 1646498072.0,
            "replies": [
                {
                    "body": "I agree that most resumes are terrible. And most of the people who try to help applicants craft better resumes have no idea what they are doing - in part because they have never actually hired anyone themselves.",
                    "author": "Wandering_SD",
                    "id": "hzkjv34",
                    "parent_id": "t1_hzgtvmg",
                    "score": 2,
                    "created_utc": 1646570868.0,
                    "replies": [
                        {
                            "body": "You are absolutely correct! \n\nHowever, one time I had someone on Reddit show me a resume that both their Prof and Career counsellor at their uni looked at and approved. It bad spelling errors, awful formatting, and even has a sentence that didn’t finish. Fully missing half the words and nobody caught it 🤦‍♀️\n\nThey almost didn’t show me because they couldn’t believe it could be bad if someone approved it, and they assumed something else was the issue\n\nThese were just common sense mistakes. So disappointing! You don’t need to be a hiring manager to know it was a mess lol",
                            "author": "Cdnsugarr",
                            "id": "hzluta7",
                            "parent_id": "t1_hzkjv34",
                            "score": 2,
                            "created_utc": 1646592547.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree that most resumes are terrible. And most of the people who try to help applicants craft better resumes have no idea what they are doing - in part because they have never actually hired anyone themselves.",
            "author": "Wandering_SD",
            "id": "hzkjv34",
            "parent_id": "t1_hzgtvmg",
            "score": 2,
            "created_utc": 1646570868.0,
            "replies": [
                {
                    "body": "You are absolutely correct! \n\nHowever, one time I had someone on Reddit show me a resume that both their Prof and Career counsellor at their uni looked at and approved. It bad spelling errors, awful formatting, and even has a sentence that didn’t finish. Fully missing half the words and nobody caught it 🤦‍♀️\n\nThey almost didn’t show me because they couldn’t believe it could be bad if someone approved it, and they assumed something else was the issue\n\nThese were just common sense mistakes. So disappointing! You don’t need to be a hiring manager to know it was a mess lol",
                    "author": "Cdnsugarr",
                    "id": "hzluta7",
                    "parent_id": "t1_hzkjv34",
                    "score": 2,
                    "created_utc": 1646592547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are absolutely correct! \n\nHowever, one time I had someone on Reddit show me a resume that both their Prof and Career counsellor at their uni looked at and approved. It bad spelling errors, awful formatting, and even has a sentence that didn’t finish. Fully missing half the words and nobody caught it 🤦‍♀️\n\nThey almost didn’t show me because they couldn’t believe it could be bad if someone approved it, and they assumed something else was the issue\n\nThese were just common sense mistakes. So disappointing! You don’t need to be a hiring manager to know it was a mess lol",
            "author": "Cdnsugarr",
            "id": "hzluta7",
            "parent_id": "t1_hzkjv34",
            "score": 2,
            "created_utc": 1646592547.0,
            "replies": []
        }
    ]
}