{
    "title": "WannabeSBwithoutsugar",
    "post_id": "hglrvw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hglrvw/wannabesbwithoutsugar/",
    "author": "Pollydolly75",
    "body": "\nJust a kind reminder. \n\nSB, do NOT expect your POT to send you money before you haven’t even met him yet. \nNO they won’t venmo you some cash just because you are dropping some hints and you have xyz problems. Don’t be desperate and have some dignity please. \nOf course we all need some sugar to sparkle our lives and make it a bit better but please keep it mind that it’s a win win situation so don’t beg or expect to get something when you don’t even give. \n\nlastly, don’t enter the bowl if you are desperate or have an emergency. Sugaring isn’t the immediate solution to problems. \n\nThank you for reading",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hglrvw/wannabesbwithoutsugar/",
    "score": 117,
    "upvote_ratio": 0.87,
    "created_utc": 1593226562.0,
    "num_comments": 46,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I couldn’t agree more.\n\nSo many of the newbies on SA only signed up because they believed the lies going around that it’s easy money for a few dirty pictures, or a sweet elderly man who just wants someone to talk to, or a divorced silver fox who has no baggage and wants arm candy to take to all his very important work galas, and for their third date he takes her on his private jet to Paris and asks her to marry him and after she says yes, he reveals that he’s actually the prince of a small country just south of France and she’s going to be the most beautiful princess they’ve ever had and he’s ordering ever statue be resculpted in her image... You know, those kinds of things must happen because Becky said so on her channel and she has over 800 followers. 😒\n\nNone of them expect to do anything more than sit there and look pretty and get handed cash for every time she says “daddy.” And they all end up here with the “what am I doing wrong, I’ve been on SA for a whole week, I have rent to pay tomorrow!!” Grow some emotional intelligence or fly away little bird. 😂\n\nEdits: the word Android was changed to the originally intended “and for,” a beginning quotation mark was added in the last paragraph, and the name Cindy was changed to Becky for posterity, lol.",
            "author": "lasswithaleash",
            "id": "fw4zqce",
            "parent_id": "t3_hglrvw",
            "score": 55,
            "created_utc": 1593233313.0,
            "replies": [
                {
                    "body": "I AM DEAD 😂😂😂 \nThey will all be posting « it’s been 3 days and I still don’t have a Chanel bag. I don’t understand ?! »  or « Daddy and I have been together for 10 days now yay!! How can I renegotiate my allowance? »",
                    "author": "Pollydolly75",
                    "id": "fw5btgp",
                    "parent_id": "t1_fw4zqce",
                    "score": 24,
                    "created_utc": 1593244028.0,
                    "replies": []
                },
                {
                    "body": "We should put this text in one of the stickied q&a things... sums it up so beautifully",
                    "author": "sdwizard74",
                    "id": "fw5azfi",
                    "parent_id": "t1_fw4zqce",
                    "score": 6,
                    "created_utc": 1593243206.0,
                    "replies": [
                        {
                            "body": "Feel free! There are a couple tiny edits that need to be made, but I’d be honored if anyone wants to use it here. 🥰",
                            "author": "lasswithaleash",
                            "id": "fw5fwgd",
                            "parent_id": "t1_fw5azfi",
                            "score": 1,
                            "created_utc": 1593248151.0,
                            "replies": []
                        },
                        {
                            "body": "Oof, and I’ve noticed a couple small edits upon rereading it that I’d like to make before it’s borrowed...",
                            "author": "lasswithaleash",
                            "id": "fw5g1a8",
                            "parent_id": "t1_fw5azfi",
                            "score": 1,
                            "created_utc": 1593248289.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Maaaaan, you really ruined the Prince of Monaco's chances at finding an SB...now nobody is ever going to believe him! 😂😂",
                    "author": "roscoe7585",
                    "id": "fw6finu",
                    "parent_id": "t1_fw4zqce",
                    "score": 3,
                    "created_utc": 1593275021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do approve of this message!!!!",
            "author": "YourBadDecision",
            "id": "fw4ru77",
            "parent_id": "t3_hglrvw",
            "score": 13,
            "created_utc": 1593227670.0,
            "replies": [
                {
                    "body": "Thank you, you made a great decision!!!😊",
                    "author": "Pollydolly75",
                    "id": "fw5budn",
                    "parent_id": "t1_fw4ru77",
                    "score": 2,
                    "created_utc": 1593244054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is there a way I can double my upvote on this?",
            "author": "wndrlnds",
            "id": "fw4v6vr",
            "parent_id": "t3_hglrvw",
            "score": 11,
            "created_utc": 1593229980.0,
            "replies": [
                {
                    "body": "I just did it for you. You are welcome.",
                    "author": "Red_Baron_17",
                    "id": "fw4yf6f",
                    "parent_id": "t1_fw4v6vr",
                    "score": 6,
                    "created_utc": 1593232326.0,
                    "replies": [
                        {
                            "body": "Gave another vote.  So true.",
                            "author": "craa141",
                            "id": "fw4yi82",
                            "parent_id": "t1_fw4yf6f",
                            "score": 5,
                            "created_utc": 1593232390.0,
                            "replies": [
                                {
                                    "body": "One more.",
                                    "author": "BinghamtonSD",
                                    "id": "fw56a7w",
                                    "parent_id": "t1_fw4yi82",
                                    "score": 5,
                                    "created_utc": 1593238748.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ehhh yeah i used to think this too, as my post history might suggest. But there are exceptions. If someone specifically asks me to show up with my toes done, if I’m driving anywhere over 15 minutes I’m either asking for an uber or gas money on the chance I’ll get flaked on, ect... side note I’ve noticed a double standard when it comes to girls asking for $ before meeting= automatic scammer but guys asking for sexy pics before = kinda rude. just saying",
            "author": null,
            "id": "fw56ood",
            "parent_id": "t3_hglrvw",
            "score": 23,
            "created_utc": 1593239115.0,
            "replies": [
                {
                    "body": "\nAgree, if they have expectations from your side and ask something specifically, or like you said UBER/gas yes I would ask them to contribute to that. Because I know it’s purposely for our meet ! But no if I am engaging with a POT just to have some quick cash without knowing if we would even meet or not. \n\nAnd double agree, we should also make a post for guys thinking that we want to share them a portfolio of nude prior meeting, and that’s not ok. Turn off to me actually",
                    "author": "Pollydolly75",
                    "id": "fw5blo8",
                    "parent_id": "t1_fw56ood",
                    "score": 10,
                    "created_utc": 1593243812.0,
                    "replies": []
                },
                {
                    "body": ">guys asking for sexy pics before = kinda rude. just saying\n\nthere is double standard. A real genuine SD would not do that until he's in a SR.",
                    "author": "ruphun",
                    "id": "fw5p084",
                    "parent_id": "t1_fw56ood",
                    "score": 10,
                    "created_utc": 1593257460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They want the reward with no work and they make it hard for women like me who truly enjoy being a Sugar GF",
            "author": "justaggie",
            "id": "fw6c8lr",
            "parent_id": "t3_hglrvw",
            "score": 5,
            "created_utc": 1593273234.0,
            "replies": []
        },
        {
            "body": "Thats such a huge turn off for me tbh.  Two scenarios that come to mind is the guilt trippy stuff like, not actually asking for money but complaining like “I’m so broke and my phone bill is past due”. 😒.\n\nThe second is the “hints”. “Omg i love this purse (links to store)”.  That’s perfectly ok in an established relationship but if we’ve been talking a few days and havent even met. What am i gonna do with that?",
            "author": "slf2020",
            "id": "fw65yd6",
            "parent_id": "t3_hglrvw",
            "score": 3,
            "created_utc": 1593269677.0,
            "replies": [
                {
                    "body": "> if we’ve been talking a few days and havent even met. What am i gonna do with that?\n\nI love those messages as they tell me what I am dealing with  and that it is time to look elsewhere.",
                    "author": "pinotandsugar",
                    "id": "fw6tt5z",
                    "parent_id": "t1_fw65yd6",
                    "score": 1,
                    "created_utc": 1593282626.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "DO NOT ENTER THE BOWL IF YOU ARE DESPERATE🗣🗣🗣Say it again for the people in the back",
            "author": "nikkylo",
            "id": "fw6bmlf",
            "parent_id": "t3_hglrvw",
            "score": 3,
            "created_utc": 1593272900.0,
            "replies": [
                {
                    "body": "Haha \n\nHey, something is wrong with the  IM.  Try again...",
                    "author": "BGDDDY1",
                    "id": "fwflzjo",
                    "parent_id": "t1_fw6bmlf",
                    "score": 1,
                    "created_utc": 1593482735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pick meeee",
            "author": "sugarsenior2",
            "id": "fw6fe35",
            "parent_id": "t3_hglrvw",
            "score": 3,
            "created_utc": 1593274951.0,
            "replies": [
                {
                    "body": "exactly lmfao",
                    "author": "_redchief_",
                    "id": "fw7ekgi",
                    "parent_id": "t1_fw6fe35",
                    "score": 3,
                    "created_utc": 1593293610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honest to goodness conversation that I received yesterday....\n\nSB: Yo\n\nMe: Hello?\n\nSB: Cashapp me\n\nFor some strange reason, I don’t think she’s focused on developing a LTR....",
            "author": "TheRockateer75",
            "id": "fw5f9xi",
            "parent_id": "t3_hglrvw",
            "score": 5,
            "created_utc": 1593247516.0,
            "replies": [
                {
                    "body": "😂😂😂straight to the point !!!",
                    "author": "Pollydolly75",
                    "id": "fw5h69u",
                    "parent_id": "t1_fw5f9xi",
                    "score": 2,
                    "created_utc": 1593249472.0,
                    "replies": []
                },
                {
                    "body": "LTR   of course    she's yours as long as you keep sending cash and don't do something crass like ask for a meeting. ........",
                    "author": "pinotandsugar",
                    "id": "fw6ty8q",
                    "parent_id": "t1_fw5f9xi",
                    "score": 1,
                    "created_utc": 1593282703.0,
                    "replies": []
                },
                {
                    "body": "they're not even interested in focusing on a STR. They dont even put in any effort to butter you up or talk sweet to you, or make any promises. It's just give me some f\\*Cking $$ you pathetic loser..!",
                    "author": "ruphun",
                    "id": "fw5orr4",
                    "parent_id": "t1_fw5f9xi",
                    "score": 0,
                    "created_utc": 1593257237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Finally someone understands",
            "author": "jusospoiled",
            "id": "fw5ynil",
            "parent_id": "t3_hglrvw",
            "score": 2,
            "created_utc": 1593265113.0,
            "replies": []
        },
        {
            "body": "Wow. I thought it was just me.\n\nThe number of people on SA that go from ZERO to \"omg I'm getting evicted tomorrow can you help?\" after 5 messages are exhausting.",
            "author": "notnoteworthyatall",
            "id": "htmqcms",
            "parent_id": "t3_hglrvw",
            "score": 2,
            "created_utc": 1642789858.0,
            "replies": [
                {
                    "body": "I never failed to be amazed by people’s audacity 🥰",
                    "author": "Pollydolly75",
                    "id": "htmql20",
                    "parent_id": "t1_htmqcms",
                    "score": 1,
                    "created_utc": 1642789944.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Every situation is different and there’s no rulebook for arrangements.\nIf you’ve had video dates, you ARE giving him your time and attention (and depending on the type of video date, probably attention of an intimate nature as well).  Those types of interactions are always worth some cash. Some SDs are very understanding of the times we live in, and still appreciate and desire human connection, even if it isn’t in person. And they’re patient enough to wait for the in-person stuff💗",
            "author": "RealEarthAngel",
            "id": "fw50i40",
            "parent_id": "t3_hglrvw",
            "score": 5,
            "created_utc": 1593233916.0,
            "replies": [
                {
                    "body": "Sure it’s possible but not likely. I don’t have a problem with girls asking to video. I just politely turn them down and go on. Maybe someone out there likes that?",
                    "author": "highjinx411",
                    "id": "fw51m80",
                    "parent_id": "t1_fw50i40",
                    "score": 5,
                    "created_utc": 1593234801.0,
                    "replies": [
                        {
                            "body": "Actually, it is often the men who realize that with corona, video is all they’re comfortable with ...and it is at their request that these situations begin.",
                            "author": "RealEarthAngel",
                            "id": "fw6iny7",
                            "parent_id": "t1_fw51m80",
                            "score": 0,
                            "created_utc": 1593276683.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This!  Time, attention, emotional validation...the list can go on and on, there is soo much to be compensated for beyond a cash for sex trade.",
                    "author": "sugarsenior2",
                    "id": "fw6fjl3",
                    "parent_id": "t1_fw50i40",
                    "score": 3,
                    "created_utc": 1593275035.0,
                    "replies": []
                },
                {
                    "body": "I agree that every situation is different, although I am talking here more about the « SB » who want to take without giving anything really in return. Not even a video. But expect of course daddy to give just because he feels pity for her. Those « Sb »  don’t seem to seek the human connection but more the ATM situation. \nBut thank you for your comment I understand your point and actually agree with it 💕",
                    "author": "Pollydolly75",
                    "id": "fw5b8kh",
                    "parent_id": "t1_fw50i40",
                    "score": 2,
                    "created_utc": 1593243457.0,
                    "replies": []
                },
                {
                    "body": "right, but this is the exception not the rule.\n\nWe have a plethora of online SB that all think SD are some kind of pathetic losers that need to pay for someone to talk to via text or phone.",
                    "author": "ruphun",
                    "id": "fw5ovc6",
                    "parent_id": "t1_fw50i40",
                    "score": 1,
                    "created_utc": 1593257331.0,
                    "replies": []
                },
                {
                    "body": "> Those types of interactions are always worth some cash.\n\nWas it JC Fields that said there is a sucker born every minute....\n\nPersonal take is that most everything up to the launch date is the equivalent of discussions on forming a joint venture/ interview for a top level position (cowgirl forever) .   \n\nChances are the SD's time is worth a significant multiple of the SBs at that time in her life.  Respecting that  as you also expect to be respected as an intelligent special woman is a great way to launch a relationship.",
                    "author": "pinotandsugar",
                    "id": "fw6uq6t",
                    "parent_id": "t1_fw50i40",
                    "score": 1,
                    "created_utc": 1593283122.0,
                    "replies": [
                        {
                            "body": "There are no suckers in any of what I describe. I don’t believe anyone’s time is more valuable than mine, and vice versa... and in addition, if what I am being pursued for is my time, that makes my time even more valuable. And if a lady is spending time with a man doing a lot of intimate video chats, she shouldn’t do them for free. There should be some sort of compensation for her time, as that is her commodity.",
                            "author": "RealEarthAngel",
                            "id": "fw6vfrl",
                            "parent_id": "t1_fw6uq6t",
                            "score": 1,
                            "created_utc": 1593283508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This.\n\nI've had POTs say, even before a M&G, \"Oh I just talked to a guy on SA who agreed  to XXXX/month before we even met.\"  Me: \"Well...have you met him yet?\" POT: \"Ummm...no.\"  Well alrighty then lol.\n\nI feel a lot of it has to do with how the POT asks.  Yes, those who say \"I need XXX for a M&G\" get nexted.  If we're getting along well before a M&G and a POT says \"Hey, could you maybe help me out with some money for gas? It's kinda far for me.\"  Which sometimes it legitimately was, then after the M&G I'd give them a little something (ie - an amount that would cover a tank of gas without issue.  Heck, one legitimately asked if she could follow me to a gas station after the M&G so I could fill up her car).  Or, I would e-gift them an uber/lyft gift card if they really seemed sincere (only once did a POT not show up when I did that pre-M&G).\n\nBut yes, the illusion of \"You too can get an LV bag in under a week just by sending pics\" is not what the arrangement is about.  There are plenty of other sites for those who wish to do that (not that there's anything wrong with that :) )",
            "author": "Patrucio71",
            "id": "fw6tdsb",
            "parent_id": "t3_hglrvw",
            "score": 1,
            "created_utc": 1593282398.0,
            "replies": []
        },
        {
            "body": "They aren’t sugar babies they are cam girls and escorts. And escorts is being generous.",
            "author": "babylina",
            "id": "fw4vydh",
            "parent_id": "t3_hglrvw",
            "score": -8,
            "created_utc": 1593230519.0,
            "replies": [
                {
                    "body": "Cam girls and escorts provide a service in exchange for money. The girls OP are talking about just want free money. I think you’re missing the point.",
                    "author": null,
                    "id": "fw5crzv",
                    "parent_id": "t1_fw4vydh",
                    "score": 14,
                    "created_utc": 1593244993.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love it when I stumble into a post from the exclusive representative of millions of people, who's mandated to speak on their behalf.\n\n&#x200B;\n\n>before you haven’t even met him yet.\n\nAnd where do you find tautology as well-hewn as this?  That's right.  Nowhere.",
            "author": null,
            "id": "fw4yhpp",
            "parent_id": "t3_hglrvw",
            "score": -12,
            "created_utc": 1593232378.0,
            "replies": [
                {
                    "body": "First, she never claimed to be speaking for anyone, but it seems from these comments that at least a few of the SDs here approve of the advice she’s given. \n\nSecond, it seems pretty obvious what she meant by that sentence but if you can’t see it, she either started with “if you haven’t even met him yet,” and changed to “before you’ve even met him” (or vice-versa) and had a little hiccup in the middle.\n\nWhy don’t you come down off that high horse because you “stumble into” an action you start doing by chance, whereas when it is something you find unexpectedly you “stumble across/upon” that thing, Mr. Well-Hewn Tautology.",
                    "author": "lasswithaleash",
                    "id": "fw54y58",
                    "parent_id": "t1_fw4yhpp",
                    "score": 7,
                    "created_utc": 1593237569.0,
                    "replies": [
                        {
                            "body": "Thank you 😘",
                            "author": "Pollydolly75",
                            "id": "fw59sds",
                            "parent_id": "t1_fw54y58",
                            "score": 4,
                            "created_utc": 1593242032.0,
                            "replies": []
                        },
                        {
                            "body": "You appear to know for whom she speaks.\nYou even seem adamant about her gender (and mine).\nThanks for breaking down for me the way they mucked up the grammar, syntax etc.  Moreover, it's nice of you to absolve them.\nSo… You think you know rules, and you apply them selectively.  Got it.",
                            "author": null,
                            "id": "fw5bhli",
                            "parent_id": "t1_fw54y58",
                            "score": -6,
                            "created_utc": 1593243702.0,
                            "replies": [
                                {
                                    "body": "When someone is giving advice, it is their own opinion. They are not ever speaking for someone else by giving their own suggestions.\n\nAs far as the rest, before I choose all my buzzwords for a comment, I read other comments and try to find more information that relates to my initial opinion of a post and either include that knowledge in my comment or revise my opinion based on new information before actually commenting.\n\nIn regard to the gender of the OP here, I used the context of her post, and I read her flair. I made a logical assumption based on those things. I would happily apologize and change the pronouns in my post if I had been wrong, but as she has thanked me for the comment, we can both assume I was correct.\n\nIn regard to your gender, I saw the “tony” in your username and formed an initial opinion, then went to your profile to seek information to support or negate that opinion. What I found were a bunch of comments on the OKCupid sub, mostly body-shaming with misogynistic undertones, and which suggest that you have very little experience in SRs, and made me wonder if that’s contributing to your patronizing and defensive responses. All the same, if you are a non-binary person, in spite of the negative views you seem to have about women, particularly women who are overweight such as myself, I would offer you the same sincere apology and change any pronouns to the ones you prefer. Please let me know if I was wrong.",
                                    "author": "lasswithaleash",
                                    "id": "fw5dqro",
                                    "parent_id": "t1_fw5bhli",
                                    "score": 5,
                                    "created_utc": 1593245970.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I love it when I stumble into a comment from someone who doesn’t agree with the post so will find anything to criticize.  \n\nTony my dear, bear with me because English is my third language and I wrote this post at 5am. \n\nI am happy if you can correct me though, but only if it’s written more constructively. THANK U, NEXT",
                    "author": "Pollydolly75",
                    "id": "fw5aspw",
                    "parent_id": "t1_fw4yhpp",
                    "score": 1,
                    "created_utc": 1593243025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I AM DEAD 😂😂😂 \nThey will all be posting « it’s been 3 days and I still don’t have a Chanel bag. I don’t understand ?! »  or « Daddy and I have been together for 10 days now yay!! How can I renegotiate my allowance? »",
            "author": "Pollydolly75",
            "id": "fw5btgp",
            "parent_id": "t1_fw4zqce",
            "score": 24,
            "created_utc": 1593244028.0,
            "replies": []
        },
        {
            "body": "We should put this text in one of the stickied q&a things... sums it up so beautifully",
            "author": "sdwizard74",
            "id": "fw5azfi",
            "parent_id": "t1_fw4zqce",
            "score": 6,
            "created_utc": 1593243206.0,
            "replies": [
                {
                    "body": "Feel free! There are a couple tiny edits that need to be made, but I’d be honored if anyone wants to use it here. 🥰",
                    "author": "lasswithaleash",
                    "id": "fw5fwgd",
                    "parent_id": "t1_fw5azfi",
                    "score": 1,
                    "created_utc": 1593248151.0,
                    "replies": []
                },
                {
                    "body": "Oof, and I’ve noticed a couple small edits upon rereading it that I’d like to make before it’s borrowed...",
                    "author": "lasswithaleash",
                    "id": "fw5g1a8",
                    "parent_id": "t1_fw5azfi",
                    "score": 1,
                    "created_utc": 1593248289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maaaaan, you really ruined the Prince of Monaco's chances at finding an SB...now nobody is ever going to believe him! 😂😂",
            "author": "roscoe7585",
            "id": "fw6finu",
            "parent_id": "t1_fw4zqce",
            "score": 3,
            "created_utc": 1593275021.0,
            "replies": []
        },
        {
            "body": "Thank you, you made a great decision!!!😊",
            "author": "Pollydolly75",
            "id": "fw5budn",
            "parent_id": "t1_fw4ru77",
            "score": 2,
            "created_utc": 1593244054.0,
            "replies": []
        },
        {
            "body": "I just did it for you. You are welcome.",
            "author": "Red_Baron_17",
            "id": "fw4yf6f",
            "parent_id": "t1_fw4v6vr",
            "score": 6,
            "created_utc": 1593232326.0,
            "replies": [
                {
                    "body": "Gave another vote.  So true.",
                    "author": "craa141",
                    "id": "fw4yi82",
                    "parent_id": "t1_fw4yf6f",
                    "score": 5,
                    "created_utc": 1593232390.0,
                    "replies": [
                        {
                            "body": "One more.",
                            "author": "BinghamtonSD",
                            "id": "fw56a7w",
                            "parent_id": "t1_fw4yi82",
                            "score": 5,
                            "created_utc": 1593238748.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\nAgree, if they have expectations from your side and ask something specifically, or like you said UBER/gas yes I would ask them to contribute to that. Because I know it’s purposely for our meet ! But no if I am engaging with a POT just to have some quick cash without knowing if we would even meet or not. \n\nAnd double agree, we should also make a post for guys thinking that we want to share them a portfolio of nude prior meeting, and that’s not ok. Turn off to me actually",
            "author": "Pollydolly75",
            "id": "fw5blo8",
            "parent_id": "t1_fw56ood",
            "score": 10,
            "created_utc": 1593243812.0,
            "replies": []
        },
        {
            "body": ">guys asking for sexy pics before = kinda rude. just saying\n\nthere is double standard. A real genuine SD would not do that until he's in a SR.",
            "author": "ruphun",
            "id": "fw5p084",
            "parent_id": "t1_fw56ood",
            "score": 10,
            "created_utc": 1593257460.0,
            "replies": []
        },
        {
            "body": "> if we’ve been talking a few days and havent even met. What am i gonna do with that?\n\nI love those messages as they tell me what I am dealing with  and that it is time to look elsewhere.",
            "author": "pinotandsugar",
            "id": "fw6tt5z",
            "parent_id": "t1_fw65yd6",
            "score": 1,
            "created_utc": 1593282626.0,
            "replies": []
        },
        {
            "body": "Haha \n\nHey, something is wrong with the  IM.  Try again...",
            "author": "BGDDDY1",
            "id": "fwflzjo",
            "parent_id": "t1_fw6bmlf",
            "score": 1,
            "created_utc": 1593482735.0,
            "replies": []
        },
        {
            "body": "exactly lmfao",
            "author": "_redchief_",
            "id": "fw7ekgi",
            "parent_id": "t1_fw6fe35",
            "score": 3,
            "created_utc": 1593293610.0,
            "replies": []
        },
        {
            "body": "😂😂😂straight to the point !!!",
            "author": "Pollydolly75",
            "id": "fw5h69u",
            "parent_id": "t1_fw5f9xi",
            "score": 2,
            "created_utc": 1593249472.0,
            "replies": []
        },
        {
            "body": "LTR   of course    she's yours as long as you keep sending cash and don't do something crass like ask for a meeting. ........",
            "author": "pinotandsugar",
            "id": "fw6ty8q",
            "parent_id": "t1_fw5f9xi",
            "score": 1,
            "created_utc": 1593282703.0,
            "replies": []
        },
        {
            "body": "they're not even interested in focusing on a STR. They dont even put in any effort to butter you up or talk sweet to you, or make any promises. It's just give me some f\\*Cking $$ you pathetic loser..!",
            "author": "ruphun",
            "id": "fw5orr4",
            "parent_id": "t1_fw5f9xi",
            "score": 0,
            "created_utc": 1593257237.0,
            "replies": []
        },
        {
            "body": "I never failed to be amazed by people’s audacity 🥰",
            "author": "Pollydolly75",
            "id": "htmql20",
            "parent_id": "t1_htmqcms",
            "score": 1,
            "created_utc": 1642789944.0,
            "replies": []
        },
        {
            "body": "Sure it’s possible but not likely. I don’t have a problem with girls asking to video. I just politely turn them down and go on. Maybe someone out there likes that?",
            "author": "highjinx411",
            "id": "fw51m80",
            "parent_id": "t1_fw50i40",
            "score": 5,
            "created_utc": 1593234801.0,
            "replies": [
                {
                    "body": "Actually, it is often the men who realize that with corona, video is all they’re comfortable with ...and it is at their request that these situations begin.",
                    "author": "RealEarthAngel",
                    "id": "fw6iny7",
                    "parent_id": "t1_fw51m80",
                    "score": 0,
                    "created_utc": 1593276683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This!  Time, attention, emotional validation...the list can go on and on, there is soo much to be compensated for beyond a cash for sex trade.",
            "author": "sugarsenior2",
            "id": "fw6fjl3",
            "parent_id": "t1_fw50i40",
            "score": 3,
            "created_utc": 1593275035.0,
            "replies": []
        },
        {
            "body": "I agree that every situation is different, although I am talking here more about the « SB » who want to take without giving anything really in return. Not even a video. But expect of course daddy to give just because he feels pity for her. Those « Sb »  don’t seem to seek the human connection but more the ATM situation. \nBut thank you for your comment I understand your point and actually agree with it 💕",
            "author": "Pollydolly75",
            "id": "fw5b8kh",
            "parent_id": "t1_fw50i40",
            "score": 2,
            "created_utc": 1593243457.0,
            "replies": []
        },
        {
            "body": "right, but this is the exception not the rule.\n\nWe have a plethora of online SB that all think SD are some kind of pathetic losers that need to pay for someone to talk to via text or phone.",
            "author": "ruphun",
            "id": "fw5ovc6",
            "parent_id": "t1_fw50i40",
            "score": 1,
            "created_utc": 1593257331.0,
            "replies": []
        },
        {
            "body": "> Those types of interactions are always worth some cash.\n\nWas it JC Fields that said there is a sucker born every minute....\n\nPersonal take is that most everything up to the launch date is the equivalent of discussions on forming a joint venture/ interview for a top level position (cowgirl forever) .   \n\nChances are the SD's time is worth a significant multiple of the SBs at that time in her life.  Respecting that  as you also expect to be respected as an intelligent special woman is a great way to launch a relationship.",
            "author": "pinotandsugar",
            "id": "fw6uq6t",
            "parent_id": "t1_fw50i40",
            "score": 1,
            "created_utc": 1593283122.0,
            "replies": [
                {
                    "body": "There are no suckers in any of what I describe. I don’t believe anyone’s time is more valuable than mine, and vice versa... and in addition, if what I am being pursued for is my time, that makes my time even more valuable. And if a lady is spending time with a man doing a lot of intimate video chats, she shouldn’t do them for free. There should be some sort of compensation for her time, as that is her commodity.",
                    "author": "RealEarthAngel",
                    "id": "fw6vfrl",
                    "parent_id": "t1_fw6uq6t",
                    "score": 1,
                    "created_utc": 1593283508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cam girls and escorts provide a service in exchange for money. The girls OP are talking about just want free money. I think you’re missing the point.",
            "author": null,
            "id": "fw5crzv",
            "parent_id": "t1_fw4vydh",
            "score": 14,
            "created_utc": 1593244993.0,
            "replies": []
        },
        {
            "body": "First, she never claimed to be speaking for anyone, but it seems from these comments that at least a few of the SDs here approve of the advice she’s given. \n\nSecond, it seems pretty obvious what she meant by that sentence but if you can’t see it, she either started with “if you haven’t even met him yet,” and changed to “before you’ve even met him” (or vice-versa) and had a little hiccup in the middle.\n\nWhy don’t you come down off that high horse because you “stumble into” an action you start doing by chance, whereas when it is something you find unexpectedly you “stumble across/upon” that thing, Mr. Well-Hewn Tautology.",
            "author": "lasswithaleash",
            "id": "fw54y58",
            "parent_id": "t1_fw4yhpp",
            "score": 7,
            "created_utc": 1593237569.0,
            "replies": [
                {
                    "body": "Thank you 😘",
                    "author": "Pollydolly75",
                    "id": "fw59sds",
                    "parent_id": "t1_fw54y58",
                    "score": 4,
                    "created_utc": 1593242032.0,
                    "replies": []
                },
                {
                    "body": "You appear to know for whom she speaks.\nYou even seem adamant about her gender (and mine).\nThanks for breaking down for me the way they mucked up the grammar, syntax etc.  Moreover, it's nice of you to absolve them.\nSo… You think you know rules, and you apply them selectively.  Got it.",
                    "author": null,
                    "id": "fw5bhli",
                    "parent_id": "t1_fw54y58",
                    "score": -6,
                    "created_utc": 1593243702.0,
                    "replies": [
                        {
                            "body": "When someone is giving advice, it is their own opinion. They are not ever speaking for someone else by giving their own suggestions.\n\nAs far as the rest, before I choose all my buzzwords for a comment, I read other comments and try to find more information that relates to my initial opinion of a post and either include that knowledge in my comment or revise my opinion based on new information before actually commenting.\n\nIn regard to the gender of the OP here, I used the context of her post, and I read her flair. I made a logical assumption based on those things. I would happily apologize and change the pronouns in my post if I had been wrong, but as she has thanked me for the comment, we can both assume I was correct.\n\nIn regard to your gender, I saw the “tony” in your username and formed an initial opinion, then went to your profile to seek information to support or negate that opinion. What I found were a bunch of comments on the OKCupid sub, mostly body-shaming with misogynistic undertones, and which suggest that you have very little experience in SRs, and made me wonder if that’s contributing to your patronizing and defensive responses. All the same, if you are a non-binary person, in spite of the negative views you seem to have about women, particularly women who are overweight such as myself, I would offer you the same sincere apology and change any pronouns to the ones you prefer. Please let me know if I was wrong.",
                            "author": "lasswithaleash",
                            "id": "fw5dqro",
                            "parent_id": "t1_fw5bhli",
                            "score": 5,
                            "created_utc": 1593245970.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love it when I stumble into a comment from someone who doesn’t agree with the post so will find anything to criticize.  \n\nTony my dear, bear with me because English is my third language and I wrote this post at 5am. \n\nI am happy if you can correct me though, but only if it’s written more constructively. THANK U, NEXT",
            "author": "Pollydolly75",
            "id": "fw5aspw",
            "parent_id": "t1_fw4yhpp",
            "score": 1,
            "created_utc": 1593243025.0,
            "replies": []
        },
        {
            "body": "Feel free! There are a couple tiny edits that need to be made, but I’d be honored if anyone wants to use it here. 🥰",
            "author": "lasswithaleash",
            "id": "fw5fwgd",
            "parent_id": "t1_fw5azfi",
            "score": 1,
            "created_utc": 1593248151.0,
            "replies": []
        },
        {
            "body": "Oof, and I’ve noticed a couple small edits upon rereading it that I’d like to make before it’s borrowed...",
            "author": "lasswithaleash",
            "id": "fw5g1a8",
            "parent_id": "t1_fw5azfi",
            "score": 1,
            "created_utc": 1593248289.0,
            "replies": []
        },
        {
            "body": "Gave another vote.  So true.",
            "author": "craa141",
            "id": "fw4yi82",
            "parent_id": "t1_fw4yf6f",
            "score": 5,
            "created_utc": 1593232390.0,
            "replies": [
                {
                    "body": "One more.",
                    "author": "BinghamtonSD",
                    "id": "fw56a7w",
                    "parent_id": "t1_fw4yi82",
                    "score": 5,
                    "created_utc": 1593238748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually, it is often the men who realize that with corona, video is all they’re comfortable with ...and it is at their request that these situations begin.",
            "author": "RealEarthAngel",
            "id": "fw6iny7",
            "parent_id": "t1_fw51m80",
            "score": 0,
            "created_utc": 1593276683.0,
            "replies": []
        },
        {
            "body": "There are no suckers in any of what I describe. I don’t believe anyone’s time is more valuable than mine, and vice versa... and in addition, if what I am being pursued for is my time, that makes my time even more valuable. And if a lady is spending time with a man doing a lot of intimate video chats, she shouldn’t do them for free. There should be some sort of compensation for her time, as that is her commodity.",
            "author": "RealEarthAngel",
            "id": "fw6vfrl",
            "parent_id": "t1_fw6uq6t",
            "score": 1,
            "created_utc": 1593283508.0,
            "replies": []
        },
        {
            "body": "Thank you 😘",
            "author": "Pollydolly75",
            "id": "fw59sds",
            "parent_id": "t1_fw54y58",
            "score": 4,
            "created_utc": 1593242032.0,
            "replies": []
        },
        {
            "body": "You appear to know for whom she speaks.\nYou even seem adamant about her gender (and mine).\nThanks for breaking down for me the way they mucked up the grammar, syntax etc.  Moreover, it's nice of you to absolve them.\nSo… You think you know rules, and you apply them selectively.  Got it.",
            "author": null,
            "id": "fw5bhli",
            "parent_id": "t1_fw54y58",
            "score": -6,
            "created_utc": 1593243702.0,
            "replies": [
                {
                    "body": "When someone is giving advice, it is their own opinion. They are not ever speaking for someone else by giving their own suggestions.\n\nAs far as the rest, before I choose all my buzzwords for a comment, I read other comments and try to find more information that relates to my initial opinion of a post and either include that knowledge in my comment or revise my opinion based on new information before actually commenting.\n\nIn regard to the gender of the OP here, I used the context of her post, and I read her flair. I made a logical assumption based on those things. I would happily apologize and change the pronouns in my post if I had been wrong, but as she has thanked me for the comment, we can both assume I was correct.\n\nIn regard to your gender, I saw the “tony” in your username and formed an initial opinion, then went to your profile to seek information to support or negate that opinion. What I found were a bunch of comments on the OKCupid sub, mostly body-shaming with misogynistic undertones, and which suggest that you have very little experience in SRs, and made me wonder if that’s contributing to your patronizing and defensive responses. All the same, if you are a non-binary person, in spite of the negative views you seem to have about women, particularly women who are overweight such as myself, I would offer you the same sincere apology and change any pronouns to the ones you prefer. Please let me know if I was wrong.",
                    "author": "lasswithaleash",
                    "id": "fw5dqro",
                    "parent_id": "t1_fw5bhli",
                    "score": 5,
                    "created_utc": 1593245970.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One more.",
            "author": "BinghamtonSD",
            "id": "fw56a7w",
            "parent_id": "t1_fw4yi82",
            "score": 5,
            "created_utc": 1593238748.0,
            "replies": []
        },
        {
            "body": "When someone is giving advice, it is their own opinion. They are not ever speaking for someone else by giving their own suggestions.\n\nAs far as the rest, before I choose all my buzzwords for a comment, I read other comments and try to find more information that relates to my initial opinion of a post and either include that knowledge in my comment or revise my opinion based on new information before actually commenting.\n\nIn regard to the gender of the OP here, I used the context of her post, and I read her flair. I made a logical assumption based on those things. I would happily apologize and change the pronouns in my post if I had been wrong, but as she has thanked me for the comment, we can both assume I was correct.\n\nIn regard to your gender, I saw the “tony” in your username and formed an initial opinion, then went to your profile to seek information to support or negate that opinion. What I found were a bunch of comments on the OKCupid sub, mostly body-shaming with misogynistic undertones, and which suggest that you have very little experience in SRs, and made me wonder if that’s contributing to your patronizing and defensive responses. All the same, if you are a non-binary person, in spite of the negative views you seem to have about women, particularly women who are overweight such as myself, I would offer you the same sincere apology and change any pronouns to the ones you prefer. Please let me know if I was wrong.",
            "author": "lasswithaleash",
            "id": "fw5dqro",
            "parent_id": "t1_fw5bhli",
            "score": 5,
            "created_utc": 1593245970.0,
            "replies": []
        }
    ]
}