{
    "title": "“It’s weird: If you don’t want to have sex with them, guys don’t wanna talk to you”",
    "post_id": "i506cr",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i506cr/its_weird_if_you_dont_want_to_have_sex_with_them/",
    "author": "PotGoblin",
    "body": "That is literally a message I got on SA after an SB I spoke to said she didn’t want to ever have sex. I stopped replying to her messages, but she messaged “it’s weird, If you don’t want to have sex with them, guys don’t want to talk to you”.\n\nYES! That is exactly right. You are not even a little interesting to me if you do not plan on having sex with me one day. Conversations with you will not be interesting. I want nothing to do with you. I’m no longer interested in talking to you even if it were free—you’re just a stranger. You’re offering me nothing I want. I can easily talk with male friends for free and these friends make better company anyway.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i506cr/its_weird_if_you_dont_want_to_have_sex_with_them/",
    "score": 123,
    "upvote_ratio": 0.81,
    "created_utc": 1596747733.0,
    "num_comments": 107,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I almost got upset at you for sounding like a dick but then I realized if a guy on SA ever told me he wasn’t interested in spoiling/giving an allowance, I’d feel the exact same way. You’re spitting straight facts, dude. I swear, so many people need to go back on Tinder and stop polluting the bowl.",
            "author": "wild_sensasian",
            "id": "g0lwy75",
            "parent_id": "t3_i506cr",
            "score": 210,
            "created_utc": 1596749138.0,
            "replies": [
                {
                    "body": "Exactly, reverse the conversation: A SD contacts you and says I want to have sex with you but I’m not giving you an allowance. How much more time are you going to waste on him?",
                    "author": "Ryan111778",
                    "id": "g0m56bn",
                    "parent_id": "t1_g0lwy75",
                    "score": 52,
                    "created_utc": 1596753378.0,
                    "replies": [
                        {
                            "body": "POT SB: dude, I got broke mofos lining up for days to hit this! I have no time to waste with you.",
                            "author": "EastTexas_SD",
                            "id": "g0mbcej",
                            "parent_id": "t1_g0m56bn",
                            "score": 22,
                            "created_utc": 1596756695.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seriously!! I'm sick of all the Tik Tok girls flooding SA and hiding us real SBs",
                    "author": null,
                    "id": "g0m17pc",
                    "parent_id": "t1_g0lwy75",
                    "score": 34,
                    "created_utc": 1596751281.0,
                    "replies": [
                        {
                            "body": "We are sick of it too, trust me.",
                            "author": null,
                            "id": "g0mh253",
                            "parent_id": "t1_g0m17pc",
                            "score": 18,
                            "created_utc": 1596759965.0,
                            "replies": []
                        },
                        {
                            "body": "Gosh, this. I jumped back into the bowl a couple weeks ago. I feel like I haven’t had the best luck in general, but now it seems even more polluted than when I was in it a year ago. I’m cute & fun & attentive & thoroughly know how to enjoy a good sexy time, but it seems like SD’s have way more fakes to wade thru before they can get to us genuine girls.\n\n(Also I’m in California & the bowl is allegedly super competitive here anyway 🙄)",
                            "author": "PheenixFly",
                            "id": "g0mi2h6",
                            "parent_id": "t1_g0m17pc",
                            "score": 14,
                            "created_utc": 1596760520.0,
                            "replies": [
                                {
                                    "body": "Too many people are working from home and on SA for amusement. \n\n Perhaps not to different from a club that has just the right atmosphere to attract interesting, intelligent young men and women who seem to be pretty compatible.  Soon word gets out and the far ends of the curve arrive in hoards thinking this is a free ride .",
                                    "author": "pinotandsugar",
                                    "id": "g0oh429",
                                    "parent_id": "t1_g0mi2h6",
                                    "score": 4,
                                    "created_utc": 1596808760.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "BINGO. Mutually beneficial.",
                    "author": null,
                    "id": "g0m4tmx",
                    "parent_id": "t1_g0lwy75",
                    "score": 14,
                    "created_utc": 1596753203.0,
                    "replies": []
                },
                {
                    "body": "Same!  I was simultaneously upset for both reasons... am I a snowflake?? 😅",
                    "author": "_Fortuna_",
                    "id": "g0m9zfu",
                    "parent_id": "t1_g0lwy75",
                    "score": 8,
                    "created_utc": 1596755924.0,
                    "replies": []
                },
                {
                    "body": "Ummm duh.  And I’m a chick!!!",
                    "author": "Workoutbrat22",
                    "id": "g0ms5re",
                    "parent_id": "t1_g0lwy75",
                    "score": 4,
                    "created_utc": 1596766447.0,
                    "replies": []
                },
                {
                    "body": "How many SB’s have experienced this? I have had a couple of guys eventually admit they were looking for something vanilla and I just roll my eyes, thank them for wasting my time and next him.",
                    "author": "Vixxen887",
                    "id": "g0njlqb",
                    "parent_id": "t1_g0lwy75",
                    "score": 3,
                    "created_utc": 1596786017.0,
                    "replies": []
                },
                {
                    "body": "> people need to go back on Tinder and stop polluting the bowl.\n\nNo truer words were ever spoken. Too many people are either gaming the system or ignorant about what the system is in sugarland.",
                    "author": "GSSD",
                    "id": "g0obxel",
                    "parent_id": "t1_g0lwy75",
                    "score": 3,
                    "created_utc": 1596806443.0,
                    "replies": []
                },
                {
                    "body": "Yeah I was talking with someone, and after over 100 messages and we had “sexted” one night, I asked about him buying something for me on my wishlist. And he’s like “oh, right, I keep forgetting this is pay to play.” 😒It was mid-Covid lockdown and I was trying to do be safer, and I was open to meeting in the future. But yea. Idk why he thought a 26 year old would be interested in a 50/60 year old who’s married and not that good looking? At least I figured it out before meeting 🤷‍♀️",
                    "author": null,
                    "id": "g0p154i",
                    "parent_id": "t1_g0lwy75",
                    "score": 4,
                    "created_utc": 1596817475.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0mclv3",
            "parent_id": "t3_i506cr",
            "score": 39,
            "created_utc": 1596757421.0,
            "replies": [
                {
                    "body": "That is not only a reasonable reply but it also gets the point across without being a jerk about it.",
                    "author": null,
                    "id": "g0mhzhv",
                    "parent_id": "t1_g0mclv3",
                    "score": 21,
                    "created_utc": 1596760475.0,
                    "replies": []
                },
                {
                    "body": "> I am still waiting\n\nGreat response to her. We should all adopt that verbiage.",
                    "author": "GSSD",
                    "id": "g0oc59w",
                    "parent_id": "t1_g0mclv3",
                    "score": 7,
                    "created_utc": 1596806540.0,
                    "replies": []
                },
                {
                    "body": "I used to say the same.  Eventually one girl said \"f\\*ck it, why not\".",
                    "author": "MarakTheSD",
                    "id": "g0qayeh",
                    "parent_id": "t1_g0mclv3",
                    "score": 3,
                    "created_utc": 1596839416.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g0qcwsy",
                            "parent_id": "t1_g0qayeh",
                            "score": 1,
                            "created_utc": 1596840431.0,
                            "replies": [
                                {
                                    "body": "Nah, I invited her to go rock climbing and got left on read.",
                                    "author": "MarakTheSD",
                                    "id": "g0qfkyg",
                                    "parent_id": "t1_g0qcwsy",
                                    "score": 3,
                                    "created_utc": 1596841866.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I can easily talk with male friends for free and these friends make better company anyway. \n\nWell yeah ... but for me that's not even the alternative. As a successful professional in my early 50's ... in non COVID times ... I have no issues setting up the following sorts of activities:\n\n1. Dinner with a female platonic friend ... pulling a good wine out of my cellar\n2. Mentoring activities - male or female for a good dinner or other activity within the company, my alumni networks, or other situations \n3. An attractive, younger but still platonic female friend for a day of wine tasting, lunch and a drive in the fun car \n4. Treating a friend to a ballgame, the symphony, or other excuse to get dressed up and have fun \n\nIn short ... all the activities of a sugar relationship minus the sex without the allowance component and hosting complications. Heck, for those married SD's you layer in none of the risk associated with sugar relationships either.",
            "author": "sfwinefan",
            "id": "g0lza96",
            "parent_id": "t3_i506cr",
            "score": 25,
            "created_utc": 1596750297.0,
            "replies": [
                {
                    "body": "So you are saying that you are one of the Unicorn Platonic Daddies?",
                    "author": "GSSD",
                    "id": "g0ociqe",
                    "parent_id": "t1_g0lza96",
                    "score": 3,
                    "created_utc": 1596806718.0,
                    "replies": [
                        {
                            "body": "ROTFL\n\nHardly, I want the connection and intimacy. The four examples I gave are all the reason ways I can get out with an attractive younger woman that do not entail intimacy. Given all of those are simple, easy options, there literally is no upside to a sugar relationship without the intimacy.",
                            "author": "sfwinefan",
                            "id": "g0omskj",
                            "parent_id": "t1_g0ociqe",
                            "score": 3,
                            "created_utc": 1596811285.0,
                            "replies": [
                                {
                                    "body": "> no upside to a sugar relationship without the intimacy.\n\nAmen to that",
                                    "author": "GSSD",
                                    "id": "g0oq4v3",
                                    "parent_id": "t1_g0omskj",
                                    "score": 3,
                                    "created_utc": 1596812635.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks captain obvious.\n\nAlthough perhaps it bears repeating given the bullshit on SA lately.\n\nIt's not dating if there's no pathway for sex.\n\nIf I want to unwind, I do that with my friends. If I need emotional support, I pay a professional therapist. If I want to get laid, I start swiping indiscriminately on Tinder for a week and regret it afterwards. Or I could make an appointment with an escort and regret it afterwards (nothing against escorts, it's just that I leave them feeling like I'm chipping away at my soul). If I want a serious relationship (which I do), I stay active on regular dating apps.\n\nBut if I want a \"fun\" and \"low baggage\" sexual relationship with a woman who I find really attractive and \"out of my league\", I go to SA.\n\nThere's this misinformation about the existence of lonely old guys who merely want to be graced by the presence of young women and are willing to pay for it. I don't understand how anyone with a modicum of critical thinking skills thinks that this is prevalent enough that they can realistically find it.",
            "author": "sdthrowaway006",
            "id": "g0lx5k7",
            "parent_id": "t3_i506cr",
            "score": 52,
            "created_utc": 1596749237.0,
            "replies": [
                {
                    "body": "Pathway to sex.  Sounds very G7 conference.",
                    "author": "nemo69_1999",
                    "id": "g0mmpmq",
                    "parent_id": "t1_g0lx5k7",
                    "score": 7,
                    "created_utc": 1596763165.0,
                    "replies": []
                },
                {
                    "body": "They do exist because her friend told her about SA and, to quote, \"she just chats and has a laugh with them and they help her with stuff\".",
                    "author": "god_sized_cock",
                    "id": "g0m6lm5",
                    "parent_id": "t1_g0lx5k7",
                    "score": 15,
                    "created_utc": 1596754094.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0lxz36",
                    "parent_id": "t1_g0lx5k7",
                    "score": 10,
                    "created_utc": 1596749641.0,
                    "replies": [
                        {
                            "body": "Not every rich old man can tolerate Viagra.",
                            "author": "Sugarbeggar",
                            "id": "g0mgnvj",
                            "parent_id": "t1_g0lxz36",
                            "score": 7,
                            "created_utc": 1596759751.0,
                            "replies": []
                        },
                        {
                            "body": "Not for long they don't. :)",
                            "author": "duckydee543",
                            "id": "g0m0x7t",
                            "parent_id": "t1_g0lxz36",
                            "score": 7,
                            "created_utc": 1596751130.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "normally, I would be like wow that's a d*ck move but like it's a sugar website, sex is literally the expectation in most every sugar relationship. honestly she probably went there after seeing those tiktoks that say all you have to do is talk to them for a bit and they'll give out free money 🙄",
            "author": "s_w_e_e_t__s_a_r_a_h",
            "id": "g0m8k06",
            "parent_id": "t3_i506cr",
            "score": 15,
            "created_utc": 1596755107.0,
            "replies": [
                {
                    "body": "normally, I would be like wow that's a d*ck move but like it's a sugar website, sex is literally the expectation in ***every*** sugar relationship. honestly she probably went there after seeing those tiktoks that say all you have to do is talk to them for a bit and they'll give out free money 🙄\n\nFIFY",
                    "author": "EastTexas_SD",
                    "id": "g0mbzax",
                    "parent_id": "t1_g0m8k06",
                    "score": 0,
                    "created_utc": 1596757055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mostly right on point, but\n\n> Conversations with you will not be interesting. I want nothing to do with you. I’m no longer interested in talking to you even if it were free\n\nis not always true. I have talked to some POT SBs that I was quite happy to continue chatting with for free, and in some cases we did. Of course, free chatting is not what most SBs are looking for, either!",
            "author": "SkepticalChallenge",
            "id": "g0nrnui",
            "parent_id": "t3_i506cr",
            "score": 7,
            "created_utc": 1596794088.0,
            "replies": []
        },
        {
            "body": "I can have lunch or dinner with very attractive and intelligent interns in their 20s any time. I just can’t take them to the hotel room afterwards. Key difference.",
            "author": "sdwizard74",
            "id": "g0m05m7",
            "parent_id": "t3_i506cr",
            "score": 29,
            "created_utc": 1596750739.0,
            "replies": [
                {
                    "body": "Key difference. Hell you can probably get someone to pick up the tab if it’s an intern.",
                    "author": "Wallytrollman95",
                    "id": "g0mhjbp",
                    "parent_id": "t1_g0m05m7",
                    "score": 1,
                    "created_utc": 1596760228.0,
                    "replies": []
                },
                {
                    "body": "Couldn't you though, if the situation was right?",
                    "author": "mrjimmyjsz",
                    "id": "g0men4a",
                    "parent_id": "t1_g0m05m7",
                    "score": -2,
                    "created_utc": 1596758610.0,
                    "replies": [
                        {
                            "body": "Nah I think that’s messy lol",
                            "author": "angiemama801",
                            "id": "g0mgafh",
                            "parent_id": "t1_g0men4a",
                            "score": 6,
                            "created_utc": 1596759546.0,
                            "replies": []
                        },
                        {
                            "body": "There’s a difference between “could” (theoretically I could of course and “could” (if I wanted to keep my well paid job I could never ever do it, even the off chance of that news spreading is just too dangerous).",
                            "author": "sdwizard74",
                            "id": "g0nvgbb",
                            "parent_id": "t1_g0men4a",
                            "score": 2,
                            "created_utc": 1596797790.0,
                            "replies": []
                        },
                        {
                            "body": "You quite possibly could.  I suppose it depends a lot on your situation and more than a little luck.  The nice thing about SA is that you get to have your pick instead of just hoping to meet an attractive young woman that is into older men.  It's also nice if you just want something casual.",
                            "author": null,
                            "id": "g0mhhqj",
                            "parent_id": "t1_g0men4a",
                            "score": 2,
                            "created_utc": 1596760205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve said this before, I’ll gladly share pictures of my money for pictures of your feet.",
            "author": "seekingtoronto",
            "id": "g0mahu3",
            "parent_id": "t3_i506cr",
            "score": 20,
            "created_utc": 1596756215.0,
            "replies": [
                {
                    "body": "I am totally stealing that line.  Not the feet part because people with foot fetishes are weird but the next time a girl asks me for money for nudes I will offer to send her a picture of my money.",
                    "author": null,
                    "id": "g0mhtqy",
                    "parent_id": "t1_g0mahu3",
                    "score": 8,
                    "created_utc": 1596760389.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't mind spending time getting to kown you but I expect we will eventually be intimate. I as lready have children I dont need more.",
            "author": "AFSMSgt",
            "id": "g0lyuym",
            "parent_id": "t3_i506cr",
            "score": 10,
            "created_utc": 1596750085.0,
            "replies": []
        },
        {
            "body": "Relationships include sex. Would these women be confused if they told a man they'd never have sex with him... only to have him answer that he would never marry her?\n\nIt seems obvious to me.\n\nDo they really think, 'Hey, marry me, we'll never have sex' would work as a pickup line?",
            "author": "ICanOnlyGetSoElect",
            "id": "g0lz3ve",
            "parent_id": "t3_i506cr",
            "score": 12,
            "created_utc": 1596750209.0,
            "replies": [
                {
                    "body": "I think your point would be better received along the lines of:\n\nIf a woman told a man she's dating that she's not interested in ever having sex with him, would she be surprised if he dumped her.\n\nThen again, this statement isn't so far off what OP described to begin with.",
                    "author": "sdthrowaway006",
                    "id": "g0mbz75",
                    "parent_id": "t1_g0lz3ve",
                    "score": 3,
                    "created_utc": 1596757053.0,
                    "replies": [
                        {
                            "body": "Part of it is that SBs are effectively trying to talk SDs into a relationship with them. (The gender ratios on SA force that). So it really is a woman approaching a guy with 'want to never have sex?'\n\nShe wouldnt try it with any other relationship type.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g0mcol6",
                            "parent_id": "t1_g0mbz75",
                            "score": 2,
                            "created_utc": 1596757464.0,
                            "replies": [
                                {
                                    "body": "> Part of it is that SBs are effectively trying to talk SDs into a relationship with them.\n\nI have mixed feelings on this one. I think that after you remove all of the bad players on both sides, the ratio is still at least 5:1 \"real\" SBs to \"real\" SDs. But when you factor in how picky we are (at least how picky I am) and our sugar budgets, our advantage slips. Usually I have a handful of \"high priority\" POTs that I'm willing to chase a fair amount. Certainly if it's all one-sided, I move on to the next one. But early on, I'm definitely the one pursuing them more. I just know that down the line, they're going to have to put more effort into the SR to keep me from straying.",
                                    "author": "sdthrowaway006",
                                    "id": "g0mfdoy",
                                    "parent_id": "t1_g0mcol6",
                                    "score": 2,
                                    "created_utc": 1596759045.0,
                                    "replies": [
                                        {
                                            "body": "The thing is, this 'platonic only' girl OP is talking about is 100% one of the 'not real' SBs. But if she's counting herself and others like her as a SB the ratio doesnt improve in her favor at all.\n\nUs being picky doesnt change the ratio at all, its still the same number of SBs. The platonic SBs arent interesting to us, but they're still trying and there. And its still 1 real SD for ever ten scammers/johns. So really even if you go with the 1:5 is signed up as a SD, we're 2% of the total amount of users.\n\nAssuming you go with one SB in the end, thats still only the top ~2% of SBs getting a SD. Not that its actually that dire. Any SB who legitimately tries and doesnt push platonic BS and who's in shape etc has much better odds, but its still very very competitive for them.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "g0mghal",
                                            "parent_id": "t1_g0mfdoy",
                                            "score": 2,
                                            "created_utc": 1596759651.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well that’s what pretty much happens when you get married.",
                    "author": "Pondguy4you",
                    "id": "g0mexxw",
                    "parent_id": "t1_g0lz3ve",
                    "score": 3,
                    "created_utc": 1596758787.0,
                    "replies": [
                        {
                            "body": "Yeah but its still not the sales pitch.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g0mf0i8",
                            "parent_id": "t1_g0mexxw",
                            "score": 3,
                            "created_utc": 1596758829.0,
                            "replies": [
                                {
                                    "body": "That's why they call it the bait and switch.  Marriage is a scam.",
                                    "author": null,
                                    "id": "g0mi3ir",
                                    "parent_id": "t1_g0mf0i8",
                                    "score": 3,
                                    "created_utc": 1596760536.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, I'm never getting married 😂\n\nBut seriously, they'd never try selling us platonic marriages right?",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "g0mieot",
                                            "parent_id": "t1_g0mi3ir",
                                            "score": 4,
                                            "created_utc": 1596760707.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is what I’m thinking. I’d never vanilla date a man I wasn’t possibly going to sleep with...",
                    "author": "GulfCoastFlamingo",
                    "id": "g0mnarp",
                    "parent_id": "t1_g0lz3ve",
                    "score": 3,
                    "created_utc": 1596763523.0,
                    "replies": []
                },
                {
                    "body": "I read this post twice but it doesn’t make any sense.",
                    "author": "ATX-SD",
                    "id": "g0m59c3",
                    "parent_id": "t1_g0lz3ve",
                    "score": 1,
                    "created_utc": 1596753419.0,
                    "replies": [
                        {
                            "body": "Imagine a girl told you: Hey want to marry me? We'll never fuck!\n\nHow would that go?",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g0m5yp9",
                            "parent_id": "t1_g0m59c3",
                            "score": 3,
                            "created_utc": 1596753771.0,
                            "replies": [
                                {
                                    "body": "I doubt anyone would ever ask that?!?\n\nSounds like you got your panties in a wad over something hypothetical",
                                    "author": "ATX-SD",
                                    "id": "g0mgl3z",
                                    "parent_id": "t1_g0m5yp9",
                                    "score": 0,
                                    "created_utc": 1596759709.0,
                                    "replies": [
                                        {
                                            "body": "Its not actually hypothetical. Thousands of SBs ask just that every day.\n\n'Want to have a relationship where you support me and we wont have sex.' Its the same thing.\n\nMy post seemed like nonsense to you because they're asking a question thats nonsense.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "g0mh1ea",
                                            "parent_id": "t1_g0mgl3z",
                                            "score": 3,
                                            "created_utc": 1596759953.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But those sb's always want a lot of things. When I used to tell them that ain't gonna work, they always have a standard reply - \"oh i am not an escort. You should go to different sites for it\". My cut and pasta - \"True. Cuz you are nothing but a beggar. How about you go to gofundme\". Of course I will be blocked immediately 😂😂😂😂😂😂",
            "author": "nthcoming",
            "id": "g0mpm6s",
            "parent_id": "t3_i506cr",
            "score": 5,
            "created_utc": 1596764926.0,
            "replies": []
        },
        {
            "body": "I agree except I guarantee conversations with me would be better than your guy friends with or without sex 😜",
            "author": null,
            "id": "g0mdu43",
            "parent_id": "t3_i506cr",
            "score": 6,
            "created_utc": 1596758141.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0mi41j",
                    "parent_id": "t1_g0mdu43",
                    "score": 3,
                    "created_utc": 1596760544.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g0mm442",
                            "parent_id": "t1_g0mi41j",
                            "score": 5,
                            "created_utc": 1596762803.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g0mm8ec",
                                    "parent_id": "t1_g0mm442",
                                    "score": -1,
                                    "created_utc": 1596762875.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The opposite in fact 🖤",
                            "author": null,
                            "id": "g0mipfp",
                            "parent_id": "t1_g0mi41j",
                            "score": 0,
                            "created_utc": 1596760867.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "LOL.  This made my evening.",
            "author": "Eauboy2015",
            "id": "g0mca5d",
            "parent_id": "t3_i506cr",
            "score": 2,
            "created_utc": 1596757231.0,
            "replies": []
        },
        {
            "body": "Haha great handle",
            "author": "Wildebot34",
            "id": "g0mjg3g",
            "parent_id": "t3_i506cr",
            "score": 2,
            "created_utc": 1596761260.0,
            "replies": []
        },
        {
            "body": "Come on... why do you think sugaring is about?",
            "author": "PokerFace94",
            "id": "g0soltr",
            "parent_id": "t3_i506cr",
            "score": 2,
            "created_utc": 1596900666.0,
            "replies": []
        },
        {
            "body": "I understand where the OP is coming from but I have a different take on the issue.  I have a number of valuable relationships with beautiful young women who I've never had sex with and never paid a penny to.  I'm not hurting SA one little bit.  Everyone one of these  young ladies was a POT but for whatever reason it didn't work out.",
            "author": "rjjr1963",
            "id": "g0m7nsw",
            "parent_id": "t3_i506cr",
            "score": 5,
            "created_utc": 1596754623.0,
            "replies": [
                {
                    "body": "Yes it’s possible to value a connection with another human without fucking them, I don’t know how OP hasn’t gotten at least a few drinks thrown on him in his life",
                    "author": "veganon1016",
                    "id": "g0mgzxy",
                    "parent_id": "t1_g0m7nsw",
                    "score": 6,
                    "created_utc": 1596759932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I totally feel you on this! My boyfriend and I often peruse SA for girls to look at profiles when we are bored lol. Several times we found profiles with females that straight stated they were not here to have sex and we laughed our asses off. Like girl what website do you think you were on like you really think somebody’s about to give you $1000 a month and not expect sex what the fuck planet are you living on\n\nAnd the thing is they sound so sure of themselves that it makes one think someone they know had that experience and told them to do it",
            "author": "Savageheart84",
            "id": "g0neo0b",
            "parent_id": "t3_i506cr",
            "score": 3,
            "created_utc": 1596781589.0,
            "replies": []
        },
        {
            "body": "Here's my thing on that, as an SB (f20) I'm totally open to having sex, but when a guy comes out and says yeah I definitely want sex after the first date, it kinda lessons the relationship for me. I start feeling like all you are doing is paying for sex and not for the pleasure of my company. But I do agree with you. Sugar involves intimacy, and if you're not willing to give that then you shouldn't be on the sites.",
            "author": "atxhidden",
            "id": "g0po1nv",
            "parent_id": "t3_i506cr",
            "score": 2,
            "created_utc": 1596828219.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0wnr98",
                    "parent_id": "t1_g0po1nv",
                    "score": 0,
                    "created_utc": 1596992431.0,
                    "replies": [
                        {
                            "body": "After the meet and greet . If the allowance starts after sex go hire a prostitute. It puts pressure on the girl to put out to someone she barely knows.",
                            "author": "atxhidden",
                            "id": "g1225zq",
                            "parent_id": "t1_g0wnr98",
                            "score": 1,
                            "created_utc": 1597109399.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just want sex and young naive SBs are cheaper than sex workers. \n\nLol, only joking. I want an emotional connection with a beautiful young woman. Young for me is 28 - 33.",
            "author": null,
            "id": "g0m3er5",
            "parent_id": "t3_i506cr",
            "score": 2,
            "created_utc": 1596752445.0,
            "replies": []
        },
        {
            "body": "I know I’ll get flamed for this comment but It’s not limited to SBs: A friend of mine used to say that guys would never pay attention to women if they didn’t have a p-\nAnd that’s true for many guys I know and many airheads I’ve met.",
            "author": "sanfran4fun",
            "id": "g0mb0eq",
            "parent_id": "t3_i506cr",
            "score": 2,
            "created_utc": 1596756507.0,
            "replies": []
        },
        {
            "body": "Exactly. I’d just re-direct them to onlyfans",
            "author": "Nicaddicted",
            "id": "g0mcj3m",
            "parent_id": "t3_i506cr",
            "score": 1,
            "created_utc": 1596757375.0,
            "replies": []
        },
        {
            "body": "I quite literally have a friend like this. They found out they could sell pics and conversations. They have no intentions of ever entering a sexual relationship, as they do not swing that way, but they are also pulling really good SDs who are offering them top line support and sending them money when they like. It makes me feel so shitty for the SD and pot SBs they could be meeting. Once she found out I was a SB, she then keeps trying to ask for help. I'm like \"bitch go away\".",
            "author": "Theneedtogtfo909",
            "id": "g0migdq",
            "parent_id": "t3_i506cr",
            "score": 1,
            "created_utc": 1596760733.0,
            "replies": []
        },
        {
            "body": "I have sooo many female friends I don’t want to have sex with. For sooo many reasons. I hate Harry met Sally. I go onto SA to find women who want to have sex. Good sex, with older men who like sex.",
            "author": "freshmath111",
            "id": "g0oeji4",
            "parent_id": "t3_i506cr",
            "score": 1,
            "created_utc": 1596807639.0,
            "replies": []
        },
        {
            "body": "That SB should put \"will never have sex with you\" in her Tinder and Hinge profiles and see what happens.",
            "author": "emptyoverflow",
            "id": "g0qhh5l",
            "parent_id": "t3_i506cr",
            "score": 1,
            "created_utc": 1596842891.0,
            "replies": []
        },
        {
            "body": "Preach brother. upvoting you.",
            "author": "Magnolia1008",
            "id": "g0mcbo6",
            "parent_id": "t3_i506cr",
            "score": 0,
            "created_utc": 1596757255.0,
            "replies": []
        },
        {
            "body": "The hard truth of it is that aside from sex, men and women really don't get along very well.  I think that goes both ways.  If we didn't have hormones driving us together I think we would be perfectly happy avoiding each other for the most part.\n\nThis is actually why I prefer sugaring over a vanilla relationship.  We can both get what we want out of the relationship without feeling pressured to spend too much time together.\n\nAnd yeah, I am not going to go online to meet a woman just to have a platonic relationship with.  I have my guy friends for that.  I sure as hell am not going to give her an allowance for the pleasure.",
            "author": null,
            "id": "g0mgikb",
            "parent_id": "t3_i506cr",
            "score": -3,
            "created_utc": 1596759671.0,
            "replies": [
                {
                    "body": "Are you living in the 50?! Men and women can’t be friends?? I have men and women evenly mixed in my friend group because every individual has something different and unique to offer...regardless of gender. Get your head out of your dick smh",
                    "author": "DevynDior",
                    "id": "g0mlqqu",
                    "parent_id": "t1_g0mgikb",
                    "score": 10,
                    "created_utc": 1596762581.0,
                    "replies": []
                },
                {
                    "body": "I agree with this. I've never seen a guy+girl friendship where at least one of them wasn't expecting, hoping, or wanting more, and I do mean NEVER... even if they kept it to themselves. I've seen it so much that now I think anyone who believes otherwise is just naive or a liar.\n\nIn fact, I have challenged it with a few women (as most often in my experience it's the girls who believe they are just friends) - \"offer them a BJ and see what happens.......\"",
                    "author": "peoplesmeeple",
                    "id": "g0vesc7",
                    "parent_id": "t1_g0mgikb",
                    "score": 0,
                    "created_utc": 1596958653.0,
                    "replies": [
                        {
                            "body": "Only time it has ever happened to me is when it is the wife/girlfriend of a friend.  In which case I am only tolerating her for my friends sake or I at the very least find her attractive even if I don't intend to do anything about it.",
                            "author": null,
                            "id": "g0xatjp",
                            "parent_id": "t1_g0vesc7",
                            "score": 0,
                            "created_utc": 1597004376.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not every sugar relationship involves sex. But nice job telling on yourself. You are exactly the type of person that I avoid at all costs. You should put a few 🚩🚩🚩in your SA bio.",
            "author": null,
            "id": "g0no1bl",
            "parent_id": "t3_i506cr",
            "score": -4,
            "created_utc": 1596790394.0,
            "replies": [
                {
                    "body": "What you're saying is the exception, not the rule, and frankly it's not a welcome perspective in this forum.",
                    "author": "_Fortuna_",
                    "id": "g0qbwes",
                    "parent_id": "t1_g0no1bl",
                    "score": 0,
                    "created_utc": 1596839904.0,
                    "replies": []
                },
                {
                    "body": "The majority are. What world are you living in? That’s almost like saying not every sugar relationship involves dates or money.",
                    "author": "PotGoblin",
                    "id": "g0nv3ho",
                    "parent_id": "t1_g0no1bl",
                    "score": -1,
                    "created_utc": 1596797456.0,
                    "replies": [
                        {
                            "body": "How would you know? There are a vast array of sugar relationships that don’t involve any sex whatsoever. Ever heard of financial domination? Obviously the core of sugar relationships is... the sugar. So yes they all involve money. But they absolutely do not all involve sex.",
                            "author": null,
                            "id": "g0o2rtz",
                            "parent_id": "t1_g0nv3ho",
                            "score": 1,
                            "created_utc": 1596802121.0,
                            "replies": [
                                {
                                    "body": "> vast array\n\nI'd like to see the data on that sweeping statement. I'd go with a few at best.",
                                    "author": "GSSD",
                                    "id": "g0oie3q",
                                    "parent_id": "t1_g0o2rtz",
                                    "score": 2,
                                    "created_utc": 1596809319.0,
                                    "replies": [
                                        {
                                            "body": "You clearly don’t have much experience in the sugaring world.",
                                            "author": null,
                                            "id": "g0om9iz",
                                            "parent_id": "t1_g0oie3q",
                                            "score": 0,
                                            "created_utc": 1596811045.0,
                                            "replies": [
                                                {
                                                    "body": "> don’t have much experience \n\n(snort) I was sugaring when you were born I'd guess",
                                                    "author": "GSSD",
                                                    "id": "g0oqbl3",
                                                    "parent_id": "t1_g0om9iz",
                                                    "score": 2,
                                                    "created_utc": 1596812706.0,
                                                    "replies": [
                                                        {
                                                            "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
                                                            "author": null,
                                                            "id": "g0piirw",
                                                            "parent_id": "t1_g0oqbl3",
                                                            "score": 2,
                                                            "created_utc": 1596825591.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Lmao. \n\nYour username will continue to check out. Good luck on your journey to find a sugar friend who pays for you to exist. You",
                                    "author": "PotGoblin",
                                    "id": "g0pn2f0",
                                    "parent_id": "t1_g0o2rtz",
                                    "score": 1,
                                    "created_utc": 1596827760.0,
                                    "replies": [
                                        {
                                            "body": "Yeah cause my username automatically means I must have no money in real life. Lmao what?? I absolutely have found many people who are more than willing to pay me to exist. I’ve never had a problem with that in fact. Your comment about not being remotely interested in a woman who won’t have sex with you is beyond disgusting. Like I said, you’re exactly the type of SD that I avoid and warn SBs about.",
                                            "author": null,
                                            "id": "g0poqry",
                                            "parent_id": "t1_g0pn2f0",
                                            "score": 2,
                                            "created_utc": 1596828550.0,
                                            "replies": [
                                                {
                                                    "body": "Sureee. Yeah, sure thing Broke Brooker\n\nAnd likewise, you are the “SB” I warn SDs about. The worst possible kind. \n\nYou know what’s even more pathetic—feeling good about the prospect of getting paid to just exist. Lmao",
                                                    "author": "PotGoblin",
                                                    "id": "g0qrue8",
                                                    "parent_id": "t1_g0poqry",
                                                    "score": 0,
                                                    "created_utc": 1596848641.0,
                                                    "replies": [
                                                        {
                                                            "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
                                                            "author": null,
                                                            "id": "g0tkjto",
                                                            "parent_id": "t1_g0qrue8",
                                                            "score": 2,
                                                            "created_utc": 1596917319.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                                                                    "author": "PotGoblin",
                                                                    "id": "g0v2ml6",
                                                                    "parent_id": "t1_g0tkjto",
                                                                    "score": 0,
                                                                    "created_utc": 1596948403.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                                                                            "author": null,
                                                                            "id": "g0vv9s7",
                                                                            "parent_id": "t1_g0v2ml6",
                                                                            "score": 2,
                                                                            "created_utc": 1596975167.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                                                                    "author": "PotGoblin",
                                                                                    "id": "g0x62in",
                                                                                    "parent_id": "t1_g0vv9s7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1597001886.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                                                                            "author": null,
                                                                                            "id": "g0x6hcf",
                                                                                            "parent_id": "t1_g0x62in",
                                                                                            "score": 1,
                                                                                            "created_utc": 1597002101.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                                                                    "author": "PotGoblin",
                                                                                                    "id": "g0x73c3",
                                                                                                    "parent_id": "t1_g0x6hcf",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1597002422.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                                                                            "author": null,
                                                                                                            "id": "g0x7mu8",
                                                                                                            "parent_id": "t1_g0x73c3",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1597002704.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                                                                    "author": "PotGoblin",
                                                                                                                    "id": "g0x8nws",
                                                                                                                    "parent_id": "t1_g0x7mu8",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1597003240.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                                                                            "author": null,
                                                                                                                            "id": "g0x95zk",
                                                                                                                            "parent_id": "t1_g0x8nws",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1597003503.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "🙄 Believe me the feeling is mutual.",
                                                                                                                                    "author": "PotGoblin",
                                                                                                                                    "id": "g0xykx2",
                                                                                                                                    "parent_id": "t1_g0x95zk",
                                                                                                                                    "score": 0,
                                                                                                                                    "created_utc": 1597017280.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you ask her why she didn't want to have sex?\n\nIf she said it's because she's entitled, I'd buy her some new shoes. \n\nDon't know why women rant sooooooo much about Salt Daddies when they themselves don't wanna offer up any sugar. Hypocrisy at its finest.",
            "author": "UnearthlyDinosaur",
            "id": "g0m8623",
            "parent_id": "t3_i506cr",
            "score": -1,
            "created_utc": 1596754887.0,
            "replies": [
                {
                    "body": "The SBs ranting about salt daddies are not the same people who are wanting sexless arrangements.  Stop.",
                    "author": "_Fortuna_",
                    "id": "g0maezy",
                    "parent_id": "t1_g0m8623",
                    "score": 10,
                    "created_utc": 1596756171.0,
                    "replies": [
                        {
                            "body": "Some of them are. I’ve seen them come on here before",
                            "author": null,
                            "id": "g0mk0p8",
                            "parent_id": "t1_g0maezy",
                            "score": 0,
                            "created_utc": 1596761573.0,
                            "replies": [
                                {
                                    "body": "Oh I bet they got ripped to shreds",
                                    "author": "_Fortuna_",
                                    "id": "g0mk54b",
                                    "parent_id": "t1_g0mk0p8",
                                    "score": 2,
                                    "created_utc": 1596761643.0,
                                    "replies": [
                                        {
                                            "body": "Pretty much.  They honestly believed that they could have a sexless arrangement and couldn’t understand why they’re only attracting salt and johns LOL 🤯",
                                            "author": null,
                                            "id": "g0mkanj",
                                            "parent_id": "t1_g0mk54b",
                                            "score": 2,
                                            "created_utc": 1596761729.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've found it to be just the opposite. If you talk to her, she automatically thinks you must want to fuck her.  (a LOT of undesirables out there prematurely creaming their pants).",
            "author": "threelegrace",
            "id": "g0oyl3h",
            "parent_id": "t3_i506cr",
            "score": 0,
            "created_utc": 1596816305.0,
            "replies": []
        },
        {
            "body": "I personally think that if you are in that having sex with them is honestly close to prostitution and I’m not down for that",
            "author": "panicalwayd",
            "id": "g0mby6l",
            "parent_id": "t3_i506cr",
            "score": -7,
            "created_utc": 1596757037.0,
            "replies": [
                {
                    "body": "Translation please..? 🤔",
                    "author": null,
                    "id": "g0mk39w",
                    "parent_id": "t1_g0mby6l",
                    "score": 1,
                    "created_utc": 1596761612.0,
                    "replies": [
                        {
                            "body": "Like if you have just an arrangement with your sugar daddy then it’s not really a SD/SB thing and if you just give you an allowance if you have sex with them then it’s more prostitution than a arrangement if you are actually legitimately dating your sugar daddy and he gives you your allowance for more than just sex that’s completely different but you don’t always have to have sex with them",
                            "author": "panicalwayd",
                            "id": "g0wjx1m",
                            "parent_id": "t1_g0mk39w",
                            "score": 0,
                            "created_utc": 1596990391.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ummm, if wanting to pay for sex is such a dealbreaker, that’s called prostitution...",
            "author": "codyfernfan",
            "id": "g0n5k4y",
            "parent_id": "t3_i506cr",
            "score": -4,
            "created_utc": 1596774696.0,
            "replies": [
                {
                    "body": "guys don't pay for the sex.\n\nthey financially support a woman they are in a sexual relationship with.\n\nthe distinction is subtle, but it's there.",
                    "author": "joc13",
                    "id": "g0p5f7v",
                    "parent_id": "t1_g0n5k4y",
                    "score": 1,
                    "created_utc": 1596819534.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0wocqn",
                    "parent_id": "t1_g0n5k4y",
                    "score": 1,
                    "created_utc": 1596992744.0,
                    "replies": [
                        {
                            "body": "Nah not too many young girls are in the business of free sex with old men",
                            "author": "codyfernfan",
                            "id": "g0wwle5",
                            "parent_id": "t1_g0wocqn",
                            "score": 1,
                            "created_utc": 1596997022.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly, reverse the conversation: A SD contacts you and says I want to have sex with you but I’m not giving you an allowance. How much more time are you going to waste on him?",
            "author": "Ryan111778",
            "id": "g0m56bn",
            "parent_id": "t1_g0lwy75",
            "score": 52,
            "created_utc": 1596753378.0,
            "replies": [
                {
                    "body": "POT SB: dude, I got broke mofos lining up for days to hit this! I have no time to waste with you.",
                    "author": "EastTexas_SD",
                    "id": "g0mbcej",
                    "parent_id": "t1_g0m56bn",
                    "score": 22,
                    "created_utc": 1596756695.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seriously!! I'm sick of all the Tik Tok girls flooding SA and hiding us real SBs",
            "author": null,
            "id": "g0m17pc",
            "parent_id": "t1_g0lwy75",
            "score": 34,
            "created_utc": 1596751281.0,
            "replies": [
                {
                    "body": "We are sick of it too, trust me.",
                    "author": null,
                    "id": "g0mh253",
                    "parent_id": "t1_g0m17pc",
                    "score": 18,
                    "created_utc": 1596759965.0,
                    "replies": []
                },
                {
                    "body": "Gosh, this. I jumped back into the bowl a couple weeks ago. I feel like I haven’t had the best luck in general, but now it seems even more polluted than when I was in it a year ago. I’m cute & fun & attentive & thoroughly know how to enjoy a good sexy time, but it seems like SD’s have way more fakes to wade thru before they can get to us genuine girls.\n\n(Also I’m in California & the bowl is allegedly super competitive here anyway 🙄)",
                    "author": "PheenixFly",
                    "id": "g0mi2h6",
                    "parent_id": "t1_g0m17pc",
                    "score": 14,
                    "created_utc": 1596760520.0,
                    "replies": [
                        {
                            "body": "Too many people are working from home and on SA for amusement. \n\n Perhaps not to different from a club that has just the right atmosphere to attract interesting, intelligent young men and women who seem to be pretty compatible.  Soon word gets out and the far ends of the curve arrive in hoards thinking this is a free ride .",
                            "author": "pinotandsugar",
                            "id": "g0oh429",
                            "parent_id": "t1_g0mi2h6",
                            "score": 4,
                            "created_utc": 1596808760.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "BINGO. Mutually beneficial.",
            "author": null,
            "id": "g0m4tmx",
            "parent_id": "t1_g0lwy75",
            "score": 14,
            "created_utc": 1596753203.0,
            "replies": []
        },
        {
            "body": "Same!  I was simultaneously upset for both reasons... am I a snowflake?? 😅",
            "author": "_Fortuna_",
            "id": "g0m9zfu",
            "parent_id": "t1_g0lwy75",
            "score": 8,
            "created_utc": 1596755924.0,
            "replies": []
        },
        {
            "body": "Ummm duh.  And I’m a chick!!!",
            "author": "Workoutbrat22",
            "id": "g0ms5re",
            "parent_id": "t1_g0lwy75",
            "score": 4,
            "created_utc": 1596766447.0,
            "replies": []
        },
        {
            "body": "How many SB’s have experienced this? I have had a couple of guys eventually admit they were looking for something vanilla and I just roll my eyes, thank them for wasting my time and next him.",
            "author": "Vixxen887",
            "id": "g0njlqb",
            "parent_id": "t1_g0lwy75",
            "score": 3,
            "created_utc": 1596786017.0,
            "replies": []
        },
        {
            "body": "> people need to go back on Tinder and stop polluting the bowl.\n\nNo truer words were ever spoken. Too many people are either gaming the system or ignorant about what the system is in sugarland.",
            "author": "GSSD",
            "id": "g0obxel",
            "parent_id": "t1_g0lwy75",
            "score": 3,
            "created_utc": 1596806443.0,
            "replies": []
        },
        {
            "body": "Yeah I was talking with someone, and after over 100 messages and we had “sexted” one night, I asked about him buying something for me on my wishlist. And he’s like “oh, right, I keep forgetting this is pay to play.” 😒It was mid-Covid lockdown and I was trying to do be safer, and I was open to meeting in the future. But yea. Idk why he thought a 26 year old would be interested in a 50/60 year old who’s married and not that good looking? At least I figured it out before meeting 🤷‍♀️",
            "author": null,
            "id": "g0p154i",
            "parent_id": "t1_g0lwy75",
            "score": 4,
            "created_utc": 1596817475.0,
            "replies": []
        },
        {
            "body": "That is not only a reasonable reply but it also gets the point across without being a jerk about it.",
            "author": null,
            "id": "g0mhzhv",
            "parent_id": "t1_g0mclv3",
            "score": 21,
            "created_utc": 1596760475.0,
            "replies": []
        },
        {
            "body": "> I am still waiting\n\nGreat response to her. We should all adopt that verbiage.",
            "author": "GSSD",
            "id": "g0oc59w",
            "parent_id": "t1_g0mclv3",
            "score": 7,
            "created_utc": 1596806540.0,
            "replies": []
        },
        {
            "body": "I used to say the same.  Eventually one girl said \"f\\*ck it, why not\".",
            "author": "MarakTheSD",
            "id": "g0qayeh",
            "parent_id": "t1_g0mclv3",
            "score": 3,
            "created_utc": 1596839416.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0qcwsy",
                    "parent_id": "t1_g0qayeh",
                    "score": 1,
                    "created_utc": 1596840431.0,
                    "replies": [
                        {
                            "body": "Nah, I invited her to go rock climbing and got left on read.",
                            "author": "MarakTheSD",
                            "id": "g0qfkyg",
                            "parent_id": "t1_g0qcwsy",
                            "score": 3,
                            "created_utc": 1596841866.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So you are saying that you are one of the Unicorn Platonic Daddies?",
            "author": "GSSD",
            "id": "g0ociqe",
            "parent_id": "t1_g0lza96",
            "score": 3,
            "created_utc": 1596806718.0,
            "replies": [
                {
                    "body": "ROTFL\n\nHardly, I want the connection and intimacy. The four examples I gave are all the reason ways I can get out with an attractive younger woman that do not entail intimacy. Given all of those are simple, easy options, there literally is no upside to a sugar relationship without the intimacy.",
                    "author": "sfwinefan",
                    "id": "g0omskj",
                    "parent_id": "t1_g0ociqe",
                    "score": 3,
                    "created_utc": 1596811285.0,
                    "replies": [
                        {
                            "body": "> no upside to a sugar relationship without the intimacy.\n\nAmen to that",
                            "author": "GSSD",
                            "id": "g0oq4v3",
                            "parent_id": "t1_g0omskj",
                            "score": 3,
                            "created_utc": 1596812635.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pathway to sex.  Sounds very G7 conference.",
            "author": "nemo69_1999",
            "id": "g0mmpmq",
            "parent_id": "t1_g0lx5k7",
            "score": 7,
            "created_utc": 1596763165.0,
            "replies": []
        },
        {
            "body": "They do exist because her friend told her about SA and, to quote, \"she just chats and has a laugh with them and they help her with stuff\".",
            "author": "god_sized_cock",
            "id": "g0m6lm5",
            "parent_id": "t1_g0lx5k7",
            "score": 15,
            "created_utc": 1596754094.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0lxz36",
            "parent_id": "t1_g0lx5k7",
            "score": 10,
            "created_utc": 1596749641.0,
            "replies": [
                {
                    "body": "Not every rich old man can tolerate Viagra.",
                    "author": "Sugarbeggar",
                    "id": "g0mgnvj",
                    "parent_id": "t1_g0lxz36",
                    "score": 7,
                    "created_utc": 1596759751.0,
                    "replies": []
                },
                {
                    "body": "Not for long they don't. :)",
                    "author": "duckydee543",
                    "id": "g0m0x7t",
                    "parent_id": "t1_g0lxz36",
                    "score": 7,
                    "created_utc": 1596751130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "normally, I would be like wow that's a d*ck move but like it's a sugar website, sex is literally the expectation in ***every*** sugar relationship. honestly she probably went there after seeing those tiktoks that say all you have to do is talk to them for a bit and they'll give out free money 🙄\n\nFIFY",
            "author": "EastTexas_SD",
            "id": "g0mbzax",
            "parent_id": "t1_g0m8k06",
            "score": 0,
            "created_utc": 1596757055.0,
            "replies": []
        },
        {
            "body": "Key difference. Hell you can probably get someone to pick up the tab if it’s an intern.",
            "author": "Wallytrollman95",
            "id": "g0mhjbp",
            "parent_id": "t1_g0m05m7",
            "score": 1,
            "created_utc": 1596760228.0,
            "replies": []
        },
        {
            "body": "Couldn't you though, if the situation was right?",
            "author": "mrjimmyjsz",
            "id": "g0men4a",
            "parent_id": "t1_g0m05m7",
            "score": -2,
            "created_utc": 1596758610.0,
            "replies": [
                {
                    "body": "Nah I think that’s messy lol",
                    "author": "angiemama801",
                    "id": "g0mgafh",
                    "parent_id": "t1_g0men4a",
                    "score": 6,
                    "created_utc": 1596759546.0,
                    "replies": []
                },
                {
                    "body": "There’s a difference between “could” (theoretically I could of course and “could” (if I wanted to keep my well paid job I could never ever do it, even the off chance of that news spreading is just too dangerous).",
                    "author": "sdwizard74",
                    "id": "g0nvgbb",
                    "parent_id": "t1_g0men4a",
                    "score": 2,
                    "created_utc": 1596797790.0,
                    "replies": []
                },
                {
                    "body": "You quite possibly could.  I suppose it depends a lot on your situation and more than a little luck.  The nice thing about SA is that you get to have your pick instead of just hoping to meet an attractive young woman that is into older men.  It's also nice if you just want something casual.",
                    "author": null,
                    "id": "g0mhhqj",
                    "parent_id": "t1_g0men4a",
                    "score": 2,
                    "created_utc": 1596760205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am totally stealing that line.  Not the feet part because people with foot fetishes are weird but the next time a girl asks me for money for nudes I will offer to send her a picture of my money.",
            "author": null,
            "id": "g0mhtqy",
            "parent_id": "t1_g0mahu3",
            "score": 8,
            "created_utc": 1596760389.0,
            "replies": []
        },
        {
            "body": "I think your point would be better received along the lines of:\n\nIf a woman told a man she's dating that she's not interested in ever having sex with him, would she be surprised if he dumped her.\n\nThen again, this statement isn't so far off what OP described to begin with.",
            "author": "sdthrowaway006",
            "id": "g0mbz75",
            "parent_id": "t1_g0lz3ve",
            "score": 3,
            "created_utc": 1596757053.0,
            "replies": [
                {
                    "body": "Part of it is that SBs are effectively trying to talk SDs into a relationship with them. (The gender ratios on SA force that). So it really is a woman approaching a guy with 'want to never have sex?'\n\nShe wouldnt try it with any other relationship type.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g0mcol6",
                    "parent_id": "t1_g0mbz75",
                    "score": 2,
                    "created_utc": 1596757464.0,
                    "replies": [
                        {
                            "body": "> Part of it is that SBs are effectively trying to talk SDs into a relationship with them.\n\nI have mixed feelings on this one. I think that after you remove all of the bad players on both sides, the ratio is still at least 5:1 \"real\" SBs to \"real\" SDs. But when you factor in how picky we are (at least how picky I am) and our sugar budgets, our advantage slips. Usually I have a handful of \"high priority\" POTs that I'm willing to chase a fair amount. Certainly if it's all one-sided, I move on to the next one. But early on, I'm definitely the one pursuing them more. I just know that down the line, they're going to have to put more effort into the SR to keep me from straying.",
                            "author": "sdthrowaway006",
                            "id": "g0mfdoy",
                            "parent_id": "t1_g0mcol6",
                            "score": 2,
                            "created_utc": 1596759045.0,
                            "replies": [
                                {
                                    "body": "The thing is, this 'platonic only' girl OP is talking about is 100% one of the 'not real' SBs. But if she's counting herself and others like her as a SB the ratio doesnt improve in her favor at all.\n\nUs being picky doesnt change the ratio at all, its still the same number of SBs. The platonic SBs arent interesting to us, but they're still trying and there. And its still 1 real SD for ever ten scammers/johns. So really even if you go with the 1:5 is signed up as a SD, we're 2% of the total amount of users.\n\nAssuming you go with one SB in the end, thats still only the top ~2% of SBs getting a SD. Not that its actually that dire. Any SB who legitimately tries and doesnt push platonic BS and who's in shape etc has much better odds, but its still very very competitive for them.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "g0mghal",
                                    "parent_id": "t1_g0mfdoy",
                                    "score": 2,
                                    "created_utc": 1596759651.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well that’s what pretty much happens when you get married.",
            "author": "Pondguy4you",
            "id": "g0mexxw",
            "parent_id": "t1_g0lz3ve",
            "score": 3,
            "created_utc": 1596758787.0,
            "replies": [
                {
                    "body": "Yeah but its still not the sales pitch.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g0mf0i8",
                    "parent_id": "t1_g0mexxw",
                    "score": 3,
                    "created_utc": 1596758829.0,
                    "replies": [
                        {
                            "body": "That's why they call it the bait and switch.  Marriage is a scam.",
                            "author": null,
                            "id": "g0mi3ir",
                            "parent_id": "t1_g0mf0i8",
                            "score": 3,
                            "created_utc": 1596760536.0,
                            "replies": [
                                {
                                    "body": "Yeah, I'm never getting married 😂\n\nBut seriously, they'd never try selling us platonic marriages right?",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "g0mieot",
                                    "parent_id": "t1_g0mi3ir",
                                    "score": 4,
                                    "created_utc": 1596760707.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is what I’m thinking. I’d never vanilla date a man I wasn’t possibly going to sleep with...",
            "author": "GulfCoastFlamingo",
            "id": "g0mnarp",
            "parent_id": "t1_g0lz3ve",
            "score": 3,
            "created_utc": 1596763523.0,
            "replies": []
        },
        {
            "body": "I read this post twice but it doesn’t make any sense.",
            "author": "ATX-SD",
            "id": "g0m59c3",
            "parent_id": "t1_g0lz3ve",
            "score": 1,
            "created_utc": 1596753419.0,
            "replies": [
                {
                    "body": "Imagine a girl told you: Hey want to marry me? We'll never fuck!\n\nHow would that go?",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g0m5yp9",
                    "parent_id": "t1_g0m59c3",
                    "score": 3,
                    "created_utc": 1596753771.0,
                    "replies": [
                        {
                            "body": "I doubt anyone would ever ask that?!?\n\nSounds like you got your panties in a wad over something hypothetical",
                            "author": "ATX-SD",
                            "id": "g0mgl3z",
                            "parent_id": "t1_g0m5yp9",
                            "score": 0,
                            "created_utc": 1596759709.0,
                            "replies": [
                                {
                                    "body": "Its not actually hypothetical. Thousands of SBs ask just that every day.\n\n'Want to have a relationship where you support me and we wont have sex.' Its the same thing.\n\nMy post seemed like nonsense to you because they're asking a question thats nonsense.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "g0mh1ea",
                                    "parent_id": "t1_g0mgl3z",
                                    "score": 3,
                                    "created_utc": 1596759953.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0mi41j",
            "parent_id": "t1_g0mdu43",
            "score": 3,
            "created_utc": 1596760544.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0mm442",
                    "parent_id": "t1_g0mi41j",
                    "score": 5,
                    "created_utc": 1596762803.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g0mm8ec",
                            "parent_id": "t1_g0mm442",
                            "score": -1,
                            "created_utc": 1596762875.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The opposite in fact 🖤",
                    "author": null,
                    "id": "g0mipfp",
                    "parent_id": "t1_g0mi41j",
                    "score": 0,
                    "created_utc": 1596760867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes it’s possible to value a connection with another human without fucking them, I don’t know how OP hasn’t gotten at least a few drinks thrown on him in his life",
            "author": "veganon1016",
            "id": "g0mgzxy",
            "parent_id": "t1_g0m7nsw",
            "score": 6,
            "created_utc": 1596759932.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0wnr98",
            "parent_id": "t1_g0po1nv",
            "score": 0,
            "created_utc": 1596992431.0,
            "replies": [
                {
                    "body": "After the meet and greet . If the allowance starts after sex go hire a prostitute. It puts pressure on the girl to put out to someone she barely knows.",
                    "author": "atxhidden",
                    "id": "g1225zq",
                    "parent_id": "t1_g0wnr98",
                    "score": 1,
                    "created_utc": 1597109399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you living in the 50?! Men and women can’t be friends?? I have men and women evenly mixed in my friend group because every individual has something different and unique to offer...regardless of gender. Get your head out of your dick smh",
            "author": "DevynDior",
            "id": "g0mlqqu",
            "parent_id": "t1_g0mgikb",
            "score": 10,
            "created_utc": 1596762581.0,
            "replies": []
        },
        {
            "body": "I agree with this. I've never seen a guy+girl friendship where at least one of them wasn't expecting, hoping, or wanting more, and I do mean NEVER... even if they kept it to themselves. I've seen it so much that now I think anyone who believes otherwise is just naive or a liar.\n\nIn fact, I have challenged it with a few women (as most often in my experience it's the girls who believe they are just friends) - \"offer them a BJ and see what happens.......\"",
            "author": "peoplesmeeple",
            "id": "g0vesc7",
            "parent_id": "t1_g0mgikb",
            "score": 0,
            "created_utc": 1596958653.0,
            "replies": [
                {
                    "body": "Only time it has ever happened to me is when it is the wife/girlfriend of a friend.  In which case I am only tolerating her for my friends sake or I at the very least find her attractive even if I don't intend to do anything about it.",
                    "author": null,
                    "id": "g0xatjp",
                    "parent_id": "t1_g0vesc7",
                    "score": 0,
                    "created_utc": 1597004376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What you're saying is the exception, not the rule, and frankly it's not a welcome perspective in this forum.",
            "author": "_Fortuna_",
            "id": "g0qbwes",
            "parent_id": "t1_g0no1bl",
            "score": 0,
            "created_utc": 1596839904.0,
            "replies": []
        },
        {
            "body": "The majority are. What world are you living in? That’s almost like saying not every sugar relationship involves dates or money.",
            "author": "PotGoblin",
            "id": "g0nv3ho",
            "parent_id": "t1_g0no1bl",
            "score": -1,
            "created_utc": 1596797456.0,
            "replies": [
                {
                    "body": "How would you know? There are a vast array of sugar relationships that don’t involve any sex whatsoever. Ever heard of financial domination? Obviously the core of sugar relationships is... the sugar. So yes they all involve money. But they absolutely do not all involve sex.",
                    "author": null,
                    "id": "g0o2rtz",
                    "parent_id": "t1_g0nv3ho",
                    "score": 1,
                    "created_utc": 1596802121.0,
                    "replies": [
                        {
                            "body": "> vast array\n\nI'd like to see the data on that sweeping statement. I'd go with a few at best.",
                            "author": "GSSD",
                            "id": "g0oie3q",
                            "parent_id": "t1_g0o2rtz",
                            "score": 2,
                            "created_utc": 1596809319.0,
                            "replies": [
                                {
                                    "body": "You clearly don’t have much experience in the sugaring world.",
                                    "author": null,
                                    "id": "g0om9iz",
                                    "parent_id": "t1_g0oie3q",
                                    "score": 0,
                                    "created_utc": 1596811045.0,
                                    "replies": [
                                        {
                                            "body": "> don’t have much experience \n\n(snort) I was sugaring when you were born I'd guess",
                                            "author": "GSSD",
                                            "id": "g0oqbl3",
                                            "parent_id": "t1_g0om9iz",
                                            "score": 2,
                                            "created_utc": 1596812706.0,
                                            "replies": [
                                                {
                                                    "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
                                                    "author": null,
                                                    "id": "g0piirw",
                                                    "parent_id": "t1_g0oqbl3",
                                                    "score": 2,
                                                    "created_utc": 1596825591.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Lmao. \n\nYour username will continue to check out. Good luck on your journey to find a sugar friend who pays for you to exist. You",
                            "author": "PotGoblin",
                            "id": "g0pn2f0",
                            "parent_id": "t1_g0o2rtz",
                            "score": 1,
                            "created_utc": 1596827760.0,
                            "replies": [
                                {
                                    "body": "Yeah cause my username automatically means I must have no money in real life. Lmao what?? I absolutely have found many people who are more than willing to pay me to exist. I’ve never had a problem with that in fact. Your comment about not being remotely interested in a woman who won’t have sex with you is beyond disgusting. Like I said, you’re exactly the type of SD that I avoid and warn SBs about.",
                                    "author": null,
                                    "id": "g0poqry",
                                    "parent_id": "t1_g0pn2f0",
                                    "score": 2,
                                    "created_utc": 1596828550.0,
                                    "replies": [
                                        {
                                            "body": "Sureee. Yeah, sure thing Broke Brooker\n\nAnd likewise, you are the “SB” I warn SDs about. The worst possible kind. \n\nYou know what’s even more pathetic—feeling good about the prospect of getting paid to just exist. Lmao",
                                            "author": "PotGoblin",
                                            "id": "g0qrue8",
                                            "parent_id": "t1_g0poqry",
                                            "score": 0,
                                            "created_utc": 1596848641.0,
                                            "replies": [
                                                {
                                                    "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
                                                    "author": null,
                                                    "id": "g0tkjto",
                                                    "parent_id": "t1_g0qrue8",
                                                    "score": 2,
                                                    "created_utc": 1596917319.0,
                                                    "replies": [
                                                        {
                                                            "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                                                            "author": "PotGoblin",
                                                            "id": "g0v2ml6",
                                                            "parent_id": "t1_g0tkjto",
                                                            "score": 0,
                                                            "created_utc": 1596948403.0,
                                                            "replies": [
                                                                {
                                                                    "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                                                                    "author": null,
                                                                    "id": "g0vv9s7",
                                                                    "parent_id": "t1_g0v2ml6",
                                                                    "score": 2,
                                                                    "created_utc": 1596975167.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                                                            "author": "PotGoblin",
                                                                            "id": "g0x62in",
                                                                            "parent_id": "t1_g0vv9s7",
                                                                            "score": 1,
                                                                            "created_utc": 1597001886.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                                                                    "author": null,
                                                                                    "id": "g0x6hcf",
                                                                                    "parent_id": "t1_g0x62in",
                                                                                    "score": 1,
                                                                                    "created_utc": 1597002101.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                                                            "author": "PotGoblin",
                                                                                            "id": "g0x73c3",
                                                                                            "parent_id": "t1_g0x6hcf",
                                                                                            "score": 0,
                                                                                            "created_utc": 1597002422.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                                                                    "author": null,
                                                                                                    "id": "g0x7mu8",
                                                                                                    "parent_id": "t1_g0x73c3",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1597002704.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                                                            "author": "PotGoblin",
                                                                                                            "id": "g0x8nws",
                                                                                                            "parent_id": "t1_g0x7mu8",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1597003240.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                                                                    "author": null,
                                                                                                                    "id": "g0x95zk",
                                                                                                                    "parent_id": "t1_g0x8nws",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1597003503.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "🙄 Believe me the feeling is mutual.",
                                                                                                                            "author": "PotGoblin",
                                                                                                                            "id": "g0xykx2",
                                                                                                                            "parent_id": "t1_g0x95zk",
                                                                                                                            "score": 0,
                                                                                                                            "created_utc": 1597017280.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The SBs ranting about salt daddies are not the same people who are wanting sexless arrangements.  Stop.",
            "author": "_Fortuna_",
            "id": "g0maezy",
            "parent_id": "t1_g0m8623",
            "score": 10,
            "created_utc": 1596756171.0,
            "replies": [
                {
                    "body": "Some of them are. I’ve seen them come on here before",
                    "author": null,
                    "id": "g0mk0p8",
                    "parent_id": "t1_g0maezy",
                    "score": 0,
                    "created_utc": 1596761573.0,
                    "replies": [
                        {
                            "body": "Oh I bet they got ripped to shreds",
                            "author": "_Fortuna_",
                            "id": "g0mk54b",
                            "parent_id": "t1_g0mk0p8",
                            "score": 2,
                            "created_utc": 1596761643.0,
                            "replies": [
                                {
                                    "body": "Pretty much.  They honestly believed that they could have a sexless arrangement and couldn’t understand why they’re only attracting salt and johns LOL 🤯",
                                    "author": null,
                                    "id": "g0mkanj",
                                    "parent_id": "t1_g0mk54b",
                                    "score": 2,
                                    "created_utc": 1596761729.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Translation please..? 🤔",
            "author": null,
            "id": "g0mk39w",
            "parent_id": "t1_g0mby6l",
            "score": 1,
            "created_utc": 1596761612.0,
            "replies": [
                {
                    "body": "Like if you have just an arrangement with your sugar daddy then it’s not really a SD/SB thing and if you just give you an allowance if you have sex with them then it’s more prostitution than a arrangement if you are actually legitimately dating your sugar daddy and he gives you your allowance for more than just sex that’s completely different but you don’t always have to have sex with them",
                    "author": "panicalwayd",
                    "id": "g0wjx1m",
                    "parent_id": "t1_g0mk39w",
                    "score": 0,
                    "created_utc": 1596990391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "guys don't pay for the sex.\n\nthey financially support a woman they are in a sexual relationship with.\n\nthe distinction is subtle, but it's there.",
            "author": "joc13",
            "id": "g0p5f7v",
            "parent_id": "t1_g0n5k4y",
            "score": 1,
            "created_utc": 1596819534.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0wocqn",
            "parent_id": "t1_g0n5k4y",
            "score": 1,
            "created_utc": 1596992744.0,
            "replies": [
                {
                    "body": "Nah not too many young girls are in the business of free sex with old men",
                    "author": "codyfernfan",
                    "id": "g0wwle5",
                    "parent_id": "t1_g0wocqn",
                    "score": 1,
                    "created_utc": 1596997022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "POT SB: dude, I got broke mofos lining up for days to hit this! I have no time to waste with you.",
            "author": "EastTexas_SD",
            "id": "g0mbcej",
            "parent_id": "t1_g0m56bn",
            "score": 22,
            "created_utc": 1596756695.0,
            "replies": []
        },
        {
            "body": "We are sick of it too, trust me.",
            "author": null,
            "id": "g0mh253",
            "parent_id": "t1_g0m17pc",
            "score": 18,
            "created_utc": 1596759965.0,
            "replies": []
        },
        {
            "body": "Gosh, this. I jumped back into the bowl a couple weeks ago. I feel like I haven’t had the best luck in general, but now it seems even more polluted than when I was in it a year ago. I’m cute & fun & attentive & thoroughly know how to enjoy a good sexy time, but it seems like SD’s have way more fakes to wade thru before they can get to us genuine girls.\n\n(Also I’m in California & the bowl is allegedly super competitive here anyway 🙄)",
            "author": "PheenixFly",
            "id": "g0mi2h6",
            "parent_id": "t1_g0m17pc",
            "score": 14,
            "created_utc": 1596760520.0,
            "replies": [
                {
                    "body": "Too many people are working from home and on SA for amusement. \n\n Perhaps not to different from a club that has just the right atmosphere to attract interesting, intelligent young men and women who seem to be pretty compatible.  Soon word gets out and the far ends of the curve arrive in hoards thinking this is a free ride .",
                    "author": "pinotandsugar",
                    "id": "g0oh429",
                    "parent_id": "t1_g0mi2h6",
                    "score": 4,
                    "created_utc": 1596808760.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0qcwsy",
            "parent_id": "t1_g0qayeh",
            "score": 1,
            "created_utc": 1596840431.0,
            "replies": [
                {
                    "body": "Nah, I invited her to go rock climbing and got left on read.",
                    "author": "MarakTheSD",
                    "id": "g0qfkyg",
                    "parent_id": "t1_g0qcwsy",
                    "score": 3,
                    "created_utc": 1596841866.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ROTFL\n\nHardly, I want the connection and intimacy. The four examples I gave are all the reason ways I can get out with an attractive younger woman that do not entail intimacy. Given all of those are simple, easy options, there literally is no upside to a sugar relationship without the intimacy.",
            "author": "sfwinefan",
            "id": "g0omskj",
            "parent_id": "t1_g0ociqe",
            "score": 3,
            "created_utc": 1596811285.0,
            "replies": [
                {
                    "body": "> no upside to a sugar relationship without the intimacy.\n\nAmen to that",
                    "author": "GSSD",
                    "id": "g0oq4v3",
                    "parent_id": "t1_g0omskj",
                    "score": 3,
                    "created_utc": 1596812635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not every rich old man can tolerate Viagra.",
            "author": "Sugarbeggar",
            "id": "g0mgnvj",
            "parent_id": "t1_g0lxz36",
            "score": 7,
            "created_utc": 1596759751.0,
            "replies": []
        },
        {
            "body": "Not for long they don't. :)",
            "author": "duckydee543",
            "id": "g0m0x7t",
            "parent_id": "t1_g0lxz36",
            "score": 7,
            "created_utc": 1596751130.0,
            "replies": []
        },
        {
            "body": "Nah I think that’s messy lol",
            "author": "angiemama801",
            "id": "g0mgafh",
            "parent_id": "t1_g0men4a",
            "score": 6,
            "created_utc": 1596759546.0,
            "replies": []
        },
        {
            "body": "There’s a difference between “could” (theoretically I could of course and “could” (if I wanted to keep my well paid job I could never ever do it, even the off chance of that news spreading is just too dangerous).",
            "author": "sdwizard74",
            "id": "g0nvgbb",
            "parent_id": "t1_g0men4a",
            "score": 2,
            "created_utc": 1596797790.0,
            "replies": []
        },
        {
            "body": "You quite possibly could.  I suppose it depends a lot on your situation and more than a little luck.  The nice thing about SA is that you get to have your pick instead of just hoping to meet an attractive young woman that is into older men.  It's also nice if you just want something casual.",
            "author": null,
            "id": "g0mhhqj",
            "parent_id": "t1_g0men4a",
            "score": 2,
            "created_utc": 1596760205.0,
            "replies": []
        },
        {
            "body": "Part of it is that SBs are effectively trying to talk SDs into a relationship with them. (The gender ratios on SA force that). So it really is a woman approaching a guy with 'want to never have sex?'\n\nShe wouldnt try it with any other relationship type.",
            "author": "ICanOnlyGetSoElect",
            "id": "g0mcol6",
            "parent_id": "t1_g0mbz75",
            "score": 2,
            "created_utc": 1596757464.0,
            "replies": [
                {
                    "body": "> Part of it is that SBs are effectively trying to talk SDs into a relationship with them.\n\nI have mixed feelings on this one. I think that after you remove all of the bad players on both sides, the ratio is still at least 5:1 \"real\" SBs to \"real\" SDs. But when you factor in how picky we are (at least how picky I am) and our sugar budgets, our advantage slips. Usually I have a handful of \"high priority\" POTs that I'm willing to chase a fair amount. Certainly if it's all one-sided, I move on to the next one. But early on, I'm definitely the one pursuing them more. I just know that down the line, they're going to have to put more effort into the SR to keep me from straying.",
                    "author": "sdthrowaway006",
                    "id": "g0mfdoy",
                    "parent_id": "t1_g0mcol6",
                    "score": 2,
                    "created_utc": 1596759045.0,
                    "replies": [
                        {
                            "body": "The thing is, this 'platonic only' girl OP is talking about is 100% one of the 'not real' SBs. But if she's counting herself and others like her as a SB the ratio doesnt improve in her favor at all.\n\nUs being picky doesnt change the ratio at all, its still the same number of SBs. The platonic SBs arent interesting to us, but they're still trying and there. And its still 1 real SD for ever ten scammers/johns. So really even if you go with the 1:5 is signed up as a SD, we're 2% of the total amount of users.\n\nAssuming you go with one SB in the end, thats still only the top ~2% of SBs getting a SD. Not that its actually that dire. Any SB who legitimately tries and doesnt push platonic BS and who's in shape etc has much better odds, but its still very very competitive for them.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g0mghal",
                            "parent_id": "t1_g0mfdoy",
                            "score": 2,
                            "created_utc": 1596759651.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah but its still not the sales pitch.",
            "author": "ICanOnlyGetSoElect",
            "id": "g0mf0i8",
            "parent_id": "t1_g0mexxw",
            "score": 3,
            "created_utc": 1596758829.0,
            "replies": [
                {
                    "body": "That's why they call it the bait and switch.  Marriage is a scam.",
                    "author": null,
                    "id": "g0mi3ir",
                    "parent_id": "t1_g0mf0i8",
                    "score": 3,
                    "created_utc": 1596760536.0,
                    "replies": [
                        {
                            "body": "Yeah, I'm never getting married 😂\n\nBut seriously, they'd never try selling us platonic marriages right?",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g0mieot",
                            "parent_id": "t1_g0mi3ir",
                            "score": 4,
                            "created_utc": 1596760707.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine a girl told you: Hey want to marry me? We'll never fuck!\n\nHow would that go?",
            "author": "ICanOnlyGetSoElect",
            "id": "g0m5yp9",
            "parent_id": "t1_g0m59c3",
            "score": 3,
            "created_utc": 1596753771.0,
            "replies": [
                {
                    "body": "I doubt anyone would ever ask that?!?\n\nSounds like you got your panties in a wad over something hypothetical",
                    "author": "ATX-SD",
                    "id": "g0mgl3z",
                    "parent_id": "t1_g0m5yp9",
                    "score": 0,
                    "created_utc": 1596759709.0,
                    "replies": [
                        {
                            "body": "Its not actually hypothetical. Thousands of SBs ask just that every day.\n\n'Want to have a relationship where you support me and we wont have sex.' Its the same thing.\n\nMy post seemed like nonsense to you because they're asking a question thats nonsense.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g0mh1ea",
                            "parent_id": "t1_g0mgl3z",
                            "score": 3,
                            "created_utc": 1596759953.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0mm442",
            "parent_id": "t1_g0mi41j",
            "score": 5,
            "created_utc": 1596762803.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0mm8ec",
                    "parent_id": "t1_g0mm442",
                    "score": -1,
                    "created_utc": 1596762875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The opposite in fact 🖤",
            "author": null,
            "id": "g0mipfp",
            "parent_id": "t1_g0mi41j",
            "score": 0,
            "created_utc": 1596760867.0,
            "replies": []
        },
        {
            "body": "After the meet and greet . If the allowance starts after sex go hire a prostitute. It puts pressure on the girl to put out to someone she barely knows.",
            "author": "atxhidden",
            "id": "g1225zq",
            "parent_id": "t1_g0wnr98",
            "score": 1,
            "created_utc": 1597109399.0,
            "replies": []
        },
        {
            "body": "Only time it has ever happened to me is when it is the wife/girlfriend of a friend.  In which case I am only tolerating her for my friends sake or I at the very least find her attractive even if I don't intend to do anything about it.",
            "author": null,
            "id": "g0xatjp",
            "parent_id": "t1_g0vesc7",
            "score": 0,
            "created_utc": 1597004376.0,
            "replies": []
        },
        {
            "body": "How would you know? There are a vast array of sugar relationships that don’t involve any sex whatsoever. Ever heard of financial domination? Obviously the core of sugar relationships is... the sugar. So yes they all involve money. But they absolutely do not all involve sex.",
            "author": null,
            "id": "g0o2rtz",
            "parent_id": "t1_g0nv3ho",
            "score": 1,
            "created_utc": 1596802121.0,
            "replies": [
                {
                    "body": "> vast array\n\nI'd like to see the data on that sweeping statement. I'd go with a few at best.",
                    "author": "GSSD",
                    "id": "g0oie3q",
                    "parent_id": "t1_g0o2rtz",
                    "score": 2,
                    "created_utc": 1596809319.0,
                    "replies": [
                        {
                            "body": "You clearly don’t have much experience in the sugaring world.",
                            "author": null,
                            "id": "g0om9iz",
                            "parent_id": "t1_g0oie3q",
                            "score": 0,
                            "created_utc": 1596811045.0,
                            "replies": [
                                {
                                    "body": "> don’t have much experience \n\n(snort) I was sugaring when you were born I'd guess",
                                    "author": "GSSD",
                                    "id": "g0oqbl3",
                                    "parent_id": "t1_g0om9iz",
                                    "score": 2,
                                    "created_utc": 1596812706.0,
                                    "replies": [
                                        {
                                            "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
                                            "author": null,
                                            "id": "g0piirw",
                                            "parent_id": "t1_g0oqbl3",
                                            "score": 2,
                                            "created_utc": 1596825591.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lmao. \n\nYour username will continue to check out. Good luck on your journey to find a sugar friend who pays for you to exist. You",
                    "author": "PotGoblin",
                    "id": "g0pn2f0",
                    "parent_id": "t1_g0o2rtz",
                    "score": 1,
                    "created_utc": 1596827760.0,
                    "replies": [
                        {
                            "body": "Yeah cause my username automatically means I must have no money in real life. Lmao what?? I absolutely have found many people who are more than willing to pay me to exist. I’ve never had a problem with that in fact. Your comment about not being remotely interested in a woman who won’t have sex with you is beyond disgusting. Like I said, you’re exactly the type of SD that I avoid and warn SBs about.",
                            "author": null,
                            "id": "g0poqry",
                            "parent_id": "t1_g0pn2f0",
                            "score": 2,
                            "created_utc": 1596828550.0,
                            "replies": [
                                {
                                    "body": "Sureee. Yeah, sure thing Broke Brooker\n\nAnd likewise, you are the “SB” I warn SDs about. The worst possible kind. \n\nYou know what’s even more pathetic—feeling good about the prospect of getting paid to just exist. Lmao",
                                    "author": "PotGoblin",
                                    "id": "g0qrue8",
                                    "parent_id": "t1_g0poqry",
                                    "score": 0,
                                    "created_utc": 1596848641.0,
                                    "replies": [
                                        {
                                            "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
                                            "author": null,
                                            "id": "g0tkjto",
                                            "parent_id": "t1_g0qrue8",
                                            "score": 2,
                                            "created_utc": 1596917319.0,
                                            "replies": [
                                                {
                                                    "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                                                    "author": "PotGoblin",
                                                    "id": "g0v2ml6",
                                                    "parent_id": "t1_g0tkjto",
                                                    "score": 0,
                                                    "created_utc": 1596948403.0,
                                                    "replies": [
                                                        {
                                                            "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                                                            "author": null,
                                                            "id": "g0vv9s7",
                                                            "parent_id": "t1_g0v2ml6",
                                                            "score": 2,
                                                            "created_utc": 1596975167.0,
                                                            "replies": [
                                                                {
                                                                    "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                                                    "author": "PotGoblin",
                                                                    "id": "g0x62in",
                                                                    "parent_id": "t1_g0vv9s7",
                                                                    "score": 1,
                                                                    "created_utc": 1597001886.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                                                            "author": null,
                                                                            "id": "g0x6hcf",
                                                                            "parent_id": "t1_g0x62in",
                                                                            "score": 1,
                                                                            "created_utc": 1597002101.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                                                    "author": "PotGoblin",
                                                                                    "id": "g0x73c3",
                                                                                    "parent_id": "t1_g0x6hcf",
                                                                                    "score": 0,
                                                                                    "created_utc": 1597002422.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                                                            "author": null,
                                                                                            "id": "g0x7mu8",
                                                                                            "parent_id": "t1_g0x73c3",
                                                                                            "score": 1,
                                                                                            "created_utc": 1597002704.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                                                    "author": "PotGoblin",
                                                                                                    "id": "g0x8nws",
                                                                                                    "parent_id": "t1_g0x7mu8",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1597003240.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                                                            "author": null,
                                                                                                            "id": "g0x95zk",
                                                                                                            "parent_id": "t1_g0x8nws",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1597003503.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "🙄 Believe me the feeling is mutual.",
                                                                                                                    "author": "PotGoblin",
                                                                                                                    "id": "g0xykx2",
                                                                                                                    "parent_id": "t1_g0x95zk",
                                                                                                                    "score": 0,
                                                                                                                    "created_utc": 1597017280.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some of them are. I’ve seen them come on here before",
            "author": null,
            "id": "g0mk0p8",
            "parent_id": "t1_g0maezy",
            "score": 0,
            "created_utc": 1596761573.0,
            "replies": [
                {
                    "body": "Oh I bet they got ripped to shreds",
                    "author": "_Fortuna_",
                    "id": "g0mk54b",
                    "parent_id": "t1_g0mk0p8",
                    "score": 2,
                    "created_utc": 1596761643.0,
                    "replies": [
                        {
                            "body": "Pretty much.  They honestly believed that they could have a sexless arrangement and couldn’t understand why they’re only attracting salt and johns LOL 🤯",
                            "author": null,
                            "id": "g0mkanj",
                            "parent_id": "t1_g0mk54b",
                            "score": 2,
                            "created_utc": 1596761729.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like if you have just an arrangement with your sugar daddy then it’s not really a SD/SB thing and if you just give you an allowance if you have sex with them then it’s more prostitution than a arrangement if you are actually legitimately dating your sugar daddy and he gives you your allowance for more than just sex that’s completely different but you don’t always have to have sex with them",
            "author": "panicalwayd",
            "id": "g0wjx1m",
            "parent_id": "t1_g0mk39w",
            "score": 0,
            "created_utc": 1596990391.0,
            "replies": []
        },
        {
            "body": "Nah not too many young girls are in the business of free sex with old men",
            "author": "codyfernfan",
            "id": "g0wwle5",
            "parent_id": "t1_g0wocqn",
            "score": 1,
            "created_utc": 1596997022.0,
            "replies": []
        },
        {
            "body": "Too many people are working from home and on SA for amusement. \n\n Perhaps not to different from a club that has just the right atmosphere to attract interesting, intelligent young men and women who seem to be pretty compatible.  Soon word gets out and the far ends of the curve arrive in hoards thinking this is a free ride .",
            "author": "pinotandsugar",
            "id": "g0oh429",
            "parent_id": "t1_g0mi2h6",
            "score": 4,
            "created_utc": 1596808760.0,
            "replies": []
        },
        {
            "body": "Nah, I invited her to go rock climbing and got left on read.",
            "author": "MarakTheSD",
            "id": "g0qfkyg",
            "parent_id": "t1_g0qcwsy",
            "score": 3,
            "created_utc": 1596841866.0,
            "replies": []
        },
        {
            "body": "> no upside to a sugar relationship without the intimacy.\n\nAmen to that",
            "author": "GSSD",
            "id": "g0oq4v3",
            "parent_id": "t1_g0omskj",
            "score": 3,
            "created_utc": 1596812635.0,
            "replies": []
        },
        {
            "body": "> Part of it is that SBs are effectively trying to talk SDs into a relationship with them.\n\nI have mixed feelings on this one. I think that after you remove all of the bad players on both sides, the ratio is still at least 5:1 \"real\" SBs to \"real\" SDs. But when you factor in how picky we are (at least how picky I am) and our sugar budgets, our advantage slips. Usually I have a handful of \"high priority\" POTs that I'm willing to chase a fair amount. Certainly if it's all one-sided, I move on to the next one. But early on, I'm definitely the one pursuing them more. I just know that down the line, they're going to have to put more effort into the SR to keep me from straying.",
            "author": "sdthrowaway006",
            "id": "g0mfdoy",
            "parent_id": "t1_g0mcol6",
            "score": 2,
            "created_utc": 1596759045.0,
            "replies": [
                {
                    "body": "The thing is, this 'platonic only' girl OP is talking about is 100% one of the 'not real' SBs. But if she's counting herself and others like her as a SB the ratio doesnt improve in her favor at all.\n\nUs being picky doesnt change the ratio at all, its still the same number of SBs. The platonic SBs arent interesting to us, but they're still trying and there. And its still 1 real SD for ever ten scammers/johns. So really even if you go with the 1:5 is signed up as a SD, we're 2% of the total amount of users.\n\nAssuming you go with one SB in the end, thats still only the top ~2% of SBs getting a SD. Not that its actually that dire. Any SB who legitimately tries and doesnt push platonic BS and who's in shape etc has much better odds, but its still very very competitive for them.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g0mghal",
                    "parent_id": "t1_g0mfdoy",
                    "score": 2,
                    "created_utc": 1596759651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's why they call it the bait and switch.  Marriage is a scam.",
            "author": null,
            "id": "g0mi3ir",
            "parent_id": "t1_g0mf0i8",
            "score": 3,
            "created_utc": 1596760536.0,
            "replies": [
                {
                    "body": "Yeah, I'm never getting married 😂\n\nBut seriously, they'd never try selling us platonic marriages right?",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g0mieot",
                    "parent_id": "t1_g0mi3ir",
                    "score": 4,
                    "created_utc": 1596760707.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I doubt anyone would ever ask that?!?\n\nSounds like you got your panties in a wad over something hypothetical",
            "author": "ATX-SD",
            "id": "g0mgl3z",
            "parent_id": "t1_g0m5yp9",
            "score": 0,
            "created_utc": 1596759709.0,
            "replies": [
                {
                    "body": "Its not actually hypothetical. Thousands of SBs ask just that every day.\n\n'Want to have a relationship where you support me and we wont have sex.' Its the same thing.\n\nMy post seemed like nonsense to you because they're asking a question thats nonsense.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g0mh1ea",
                    "parent_id": "t1_g0mgl3z",
                    "score": 3,
                    "created_utc": 1596759953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0mm8ec",
            "parent_id": "t1_g0mm442",
            "score": -1,
            "created_utc": 1596762875.0,
            "replies": []
        },
        {
            "body": "> vast array\n\nI'd like to see the data on that sweeping statement. I'd go with a few at best.",
            "author": "GSSD",
            "id": "g0oie3q",
            "parent_id": "t1_g0o2rtz",
            "score": 2,
            "created_utc": 1596809319.0,
            "replies": [
                {
                    "body": "You clearly don’t have much experience in the sugaring world.",
                    "author": null,
                    "id": "g0om9iz",
                    "parent_id": "t1_g0oie3q",
                    "score": 0,
                    "created_utc": 1596811045.0,
                    "replies": [
                        {
                            "body": "> don’t have much experience \n\n(snort) I was sugaring when you were born I'd guess",
                            "author": "GSSD",
                            "id": "g0oqbl3",
                            "parent_id": "t1_g0om9iz",
                            "score": 2,
                            "created_utc": 1596812706.0,
                            "replies": [
                                {
                                    "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
                                    "author": null,
                                    "id": "g0piirw",
                                    "parent_id": "t1_g0oqbl3",
                                    "score": 2,
                                    "created_utc": 1596825591.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao. \n\nYour username will continue to check out. Good luck on your journey to find a sugar friend who pays for you to exist. You",
            "author": "PotGoblin",
            "id": "g0pn2f0",
            "parent_id": "t1_g0o2rtz",
            "score": 1,
            "created_utc": 1596827760.0,
            "replies": [
                {
                    "body": "Yeah cause my username automatically means I must have no money in real life. Lmao what?? I absolutely have found many people who are more than willing to pay me to exist. I’ve never had a problem with that in fact. Your comment about not being remotely interested in a woman who won’t have sex with you is beyond disgusting. Like I said, you’re exactly the type of SD that I avoid and warn SBs about.",
                    "author": null,
                    "id": "g0poqry",
                    "parent_id": "t1_g0pn2f0",
                    "score": 2,
                    "created_utc": 1596828550.0,
                    "replies": [
                        {
                            "body": "Sureee. Yeah, sure thing Broke Brooker\n\nAnd likewise, you are the “SB” I warn SDs about. The worst possible kind. \n\nYou know what’s even more pathetic—feeling good about the prospect of getting paid to just exist. Lmao",
                            "author": "PotGoblin",
                            "id": "g0qrue8",
                            "parent_id": "t1_g0poqry",
                            "score": 0,
                            "created_utc": 1596848641.0,
                            "replies": [
                                {
                                    "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
                                    "author": null,
                                    "id": "g0tkjto",
                                    "parent_id": "t1_g0qrue8",
                                    "score": 2,
                                    "created_utc": 1596917319.0,
                                    "replies": [
                                        {
                                            "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                                            "author": "PotGoblin",
                                            "id": "g0v2ml6",
                                            "parent_id": "t1_g0tkjto",
                                            "score": 0,
                                            "created_utc": 1596948403.0,
                                            "replies": [
                                                {
                                                    "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                                                    "author": null,
                                                    "id": "g0vv9s7",
                                                    "parent_id": "t1_g0v2ml6",
                                                    "score": 2,
                                                    "created_utc": 1596975167.0,
                                                    "replies": [
                                                        {
                                                            "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                                            "author": "PotGoblin",
                                                            "id": "g0x62in",
                                                            "parent_id": "t1_g0vv9s7",
                                                            "score": 1,
                                                            "created_utc": 1597001886.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                                                    "author": null,
                                                                    "id": "g0x6hcf",
                                                                    "parent_id": "t1_g0x62in",
                                                                    "score": 1,
                                                                    "created_utc": 1597002101.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                                            "author": "PotGoblin",
                                                                            "id": "g0x73c3",
                                                                            "parent_id": "t1_g0x6hcf",
                                                                            "score": 0,
                                                                            "created_utc": 1597002422.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                                                    "author": null,
                                                                                    "id": "g0x7mu8",
                                                                                    "parent_id": "t1_g0x73c3",
                                                                                    "score": 1,
                                                                                    "created_utc": 1597002704.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                                            "author": "PotGoblin",
                                                                                            "id": "g0x8nws",
                                                                                            "parent_id": "t1_g0x7mu8",
                                                                                            "score": 1,
                                                                                            "created_utc": 1597003240.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                                                    "author": null,
                                                                                                    "id": "g0x95zk",
                                                                                                    "parent_id": "t1_g0x8nws",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1597003503.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "🙄 Believe me the feeling is mutual.",
                                                                                                            "author": "PotGoblin",
                                                                                                            "id": "g0xykx2",
                                                                                                            "parent_id": "t1_g0x95zk",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1597017280.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I bet they got ripped to shreds",
            "author": "_Fortuna_",
            "id": "g0mk54b",
            "parent_id": "t1_g0mk0p8",
            "score": 2,
            "created_utc": 1596761643.0,
            "replies": [
                {
                    "body": "Pretty much.  They honestly believed that they could have a sexless arrangement and couldn’t understand why they’re only attracting salt and johns LOL 🤯",
                    "author": null,
                    "id": "g0mkanj",
                    "parent_id": "t1_g0mk54b",
                    "score": 2,
                    "created_utc": 1596761729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The thing is, this 'platonic only' girl OP is talking about is 100% one of the 'not real' SBs. But if she's counting herself and others like her as a SB the ratio doesnt improve in her favor at all.\n\nUs being picky doesnt change the ratio at all, its still the same number of SBs. The platonic SBs arent interesting to us, but they're still trying and there. And its still 1 real SD for ever ten scammers/johns. So really even if you go with the 1:5 is signed up as a SD, we're 2% of the total amount of users.\n\nAssuming you go with one SB in the end, thats still only the top ~2% of SBs getting a SD. Not that its actually that dire. Any SB who legitimately tries and doesnt push platonic BS and who's in shape etc has much better odds, but its still very very competitive for them.",
            "author": "ICanOnlyGetSoElect",
            "id": "g0mghal",
            "parent_id": "t1_g0mfdoy",
            "score": 2,
            "created_utc": 1596759651.0,
            "replies": []
        },
        {
            "body": "Yeah, I'm never getting married 😂\n\nBut seriously, they'd never try selling us platonic marriages right?",
            "author": "ICanOnlyGetSoElect",
            "id": "g0mieot",
            "parent_id": "t1_g0mi3ir",
            "score": 4,
            "created_utc": 1596760707.0,
            "replies": []
        },
        {
            "body": "Its not actually hypothetical. Thousands of SBs ask just that every day.\n\n'Want to have a relationship where you support me and we wont have sex.' Its the same thing.\n\nMy post seemed like nonsense to you because they're asking a question thats nonsense.",
            "author": "ICanOnlyGetSoElect",
            "id": "g0mh1ea",
            "parent_id": "t1_g0mgl3z",
            "score": 3,
            "created_utc": 1596759953.0,
            "replies": []
        },
        {
            "body": "You clearly don’t have much experience in the sugaring world.",
            "author": null,
            "id": "g0om9iz",
            "parent_id": "t1_g0oie3q",
            "score": 0,
            "created_utc": 1596811045.0,
            "replies": [
                {
                    "body": "> don’t have much experience \n\n(snort) I was sugaring when you were born I'd guess",
                    "author": "GSSD",
                    "id": "g0oqbl3",
                    "parent_id": "t1_g0om9iz",
                    "score": 2,
                    "created_utc": 1596812706.0,
                    "replies": [
                        {
                            "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
                            "author": null,
                            "id": "g0piirw",
                            "parent_id": "t1_g0oqbl3",
                            "score": 2,
                            "created_utc": 1596825591.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah cause my username automatically means I must have no money in real life. Lmao what?? I absolutely have found many people who are more than willing to pay me to exist. I’ve never had a problem with that in fact. Your comment about not being remotely interested in a woman who won’t have sex with you is beyond disgusting. Like I said, you’re exactly the type of SD that I avoid and warn SBs about.",
            "author": null,
            "id": "g0poqry",
            "parent_id": "t1_g0pn2f0",
            "score": 2,
            "created_utc": 1596828550.0,
            "replies": [
                {
                    "body": "Sureee. Yeah, sure thing Broke Brooker\n\nAnd likewise, you are the “SB” I warn SDs about. The worst possible kind. \n\nYou know what’s even more pathetic—feeling good about the prospect of getting paid to just exist. Lmao",
                    "author": "PotGoblin",
                    "id": "g0qrue8",
                    "parent_id": "t1_g0poqry",
                    "score": 0,
                    "created_utc": 1596848641.0,
                    "replies": [
                        {
                            "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
                            "author": null,
                            "id": "g0tkjto",
                            "parent_id": "t1_g0qrue8",
                            "score": 2,
                            "created_utc": 1596917319.0,
                            "replies": [
                                {
                                    "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                                    "author": "PotGoblin",
                                    "id": "g0v2ml6",
                                    "parent_id": "t1_g0tkjto",
                                    "score": 0,
                                    "created_utc": 1596948403.0,
                                    "replies": [
                                        {
                                            "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                                            "author": null,
                                            "id": "g0vv9s7",
                                            "parent_id": "t1_g0v2ml6",
                                            "score": 2,
                                            "created_utc": 1596975167.0,
                                            "replies": [
                                                {
                                                    "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                                    "author": "PotGoblin",
                                                    "id": "g0x62in",
                                                    "parent_id": "t1_g0vv9s7",
                                                    "score": 1,
                                                    "created_utc": 1597001886.0,
                                                    "replies": [
                                                        {
                                                            "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                                            "author": null,
                                                            "id": "g0x6hcf",
                                                            "parent_id": "t1_g0x62in",
                                                            "score": 1,
                                                            "created_utc": 1597002101.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                                    "author": "PotGoblin",
                                                                    "id": "g0x73c3",
                                                                    "parent_id": "t1_g0x6hcf",
                                                                    "score": 0,
                                                                    "created_utc": 1597002422.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                                            "author": null,
                                                                            "id": "g0x7mu8",
                                                                            "parent_id": "t1_g0x73c3",
                                                                            "score": 1,
                                                                            "created_utc": 1597002704.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                                    "author": "PotGoblin",
                                                                                    "id": "g0x8nws",
                                                                                    "parent_id": "t1_g0x7mu8",
                                                                                    "score": 1,
                                                                                    "created_utc": 1597003240.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                                            "author": null,
                                                                                            "id": "g0x95zk",
                                                                                            "parent_id": "t1_g0x8nws",
                                                                                            "score": 1,
                                                                                            "created_utc": 1597003503.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "🙄 Believe me the feeling is mutual.",
                                                                                                    "author": "PotGoblin",
                                                                                                    "id": "g0xykx2",
                                                                                                    "parent_id": "t1_g0x95zk",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1597017280.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pretty much.  They honestly believed that they could have a sexless arrangement and couldn’t understand why they’re only attracting salt and johns LOL 🤯",
            "author": null,
            "id": "g0mkanj",
            "parent_id": "t1_g0mk54b",
            "score": 2,
            "created_utc": 1596761729.0,
            "replies": []
        },
        {
            "body": "> don’t have much experience \n\n(snort) I was sugaring when you were born I'd guess",
            "author": "GSSD",
            "id": "g0oqbl3",
            "parent_id": "t1_g0om9iz",
            "score": 2,
            "created_utc": 1596812706.0,
            "replies": [
                {
                    "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
                    "author": null,
                    "id": "g0piirw",
                    "parent_id": "t1_g0oqbl3",
                    "score": 2,
                    "created_utc": 1596825591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sureee. Yeah, sure thing Broke Brooker\n\nAnd likewise, you are the “SB” I warn SDs about. The worst possible kind. \n\nYou know what’s even more pathetic—feeling good about the prospect of getting paid to just exist. Lmao",
            "author": "PotGoblin",
            "id": "g0qrue8",
            "parent_id": "t1_g0poqry",
            "score": 0,
            "created_utc": 1596848641.0,
            "replies": [
                {
                    "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
                    "author": null,
                    "id": "g0tkjto",
                    "parent_id": "t1_g0qrue8",
                    "score": 2,
                    "created_utc": 1596917319.0,
                    "replies": [
                        {
                            "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                            "author": "PotGoblin",
                            "id": "g0v2ml6",
                            "parent_id": "t1_g0tkjto",
                            "score": 0,
                            "created_utc": 1596948403.0,
                            "replies": [
                                {
                                    "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                                    "author": null,
                                    "id": "g0vv9s7",
                                    "parent_id": "t1_g0v2ml6",
                                    "score": 2,
                                    "created_utc": 1596975167.0,
                                    "replies": [
                                        {
                                            "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                            "author": "PotGoblin",
                                            "id": "g0x62in",
                                            "parent_id": "t1_g0vv9s7",
                                            "score": 1,
                                            "created_utc": 1597001886.0,
                                            "replies": [
                                                {
                                                    "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                                    "author": null,
                                                    "id": "g0x6hcf",
                                                    "parent_id": "t1_g0x62in",
                                                    "score": 1,
                                                    "created_utc": 1597002101.0,
                                                    "replies": [
                                                        {
                                                            "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                            "author": "PotGoblin",
                                                            "id": "g0x73c3",
                                                            "parent_id": "t1_g0x6hcf",
                                                            "score": 0,
                                                            "created_utc": 1597002422.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                                    "author": null,
                                                                    "id": "g0x7mu8",
                                                                    "parent_id": "t1_g0x73c3",
                                                                    "score": 1,
                                                                    "created_utc": 1597002704.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                            "author": "PotGoblin",
                                                                            "id": "g0x8nws",
                                                                            "parent_id": "t1_g0x7mu8",
                                                                            "score": 1,
                                                                            "created_utc": 1597003240.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                                    "author": null,
                                                                                    "id": "g0x95zk",
                                                                                    "parent_id": "t1_g0x8nws",
                                                                                    "score": 1,
                                                                                    "created_utc": 1597003503.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "🙄 Believe me the feeling is mutual.",
                                                                                            "author": "PotGoblin",
                                                                                            "id": "g0xykx2",
                                                                                            "parent_id": "t1_g0x95zk",
                                                                                            "score": 0,
                                                                                            "created_utc": 1597017280.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Age doesn’t equal experience. You can be old as fuck and still be inexperienced.",
            "author": null,
            "id": "g0piirw",
            "parent_id": "t1_g0oqbl3",
            "score": 2,
            "created_utc": 1596825591.0,
            "replies": []
        },
        {
            "body": "Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. You have no idea what kind of SB I am because I, unlike you, have the good sense not to post my inner ramblings for all to see. And furthermore, I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.",
            "author": null,
            "id": "g0tkjto",
            "parent_id": "t1_g0qrue8",
            "score": 2,
            "created_utc": 1596917319.0,
            "replies": [
                {
                    "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
                    "author": "PotGoblin",
                    "id": "g0v2ml6",
                    "parent_id": "t1_g0tkjto",
                    "score": 0,
                    "created_utc": 1596948403.0,
                    "replies": [
                        {
                            "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                            "author": null,
                            "id": "g0vv9s7",
                            "parent_id": "t1_g0v2ml6",
                            "score": 2,
                            "created_utc": 1596975167.0,
                            "replies": [
                                {
                                    "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                                    "author": "PotGoblin",
                                    "id": "g0x62in",
                                    "parent_id": "t1_g0vv9s7",
                                    "score": 1,
                                    "created_utc": 1597001886.0,
                                    "replies": [
                                        {
                                            "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                            "author": null,
                                            "id": "g0x6hcf",
                                            "parent_id": "t1_g0x62in",
                                            "score": 1,
                                            "created_utc": 1597002101.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                                    "author": "PotGoblin",
                                                    "id": "g0x73c3",
                                                    "parent_id": "t1_g0x6hcf",
                                                    "score": 0,
                                                    "created_utc": 1597002422.0,
                                                    "replies": [
                                                        {
                                                            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                            "author": null,
                                                            "id": "g0x7mu8",
                                                            "parent_id": "t1_g0x73c3",
                                                            "score": 1,
                                                            "created_utc": 1597002704.0,
                                                            "replies": [
                                                                {
                                                                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                                    "author": "PotGoblin",
                                                                    "id": "g0x8nws",
                                                                    "parent_id": "t1_g0x7mu8",
                                                                    "score": 1,
                                                                    "created_utc": 1597003240.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                            "author": null,
                                                                            "id": "g0x95zk",
                                                                            "parent_id": "t1_g0x8nws",
                                                                            "score": 1,
                                                                            "created_utc": 1597003503.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "🙄 Believe me the feeling is mutual.",
                                                                                    "author": "PotGoblin",
                                                                                    "id": "g0xykx2",
                                                                                    "parent_id": "t1_g0x95zk",
                                                                                    "score": 0,
                                                                                    "created_utc": 1597017280.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Give me a break, you’re just pissed, jealous and bitter cause no one would ever EVER do that for you. \n\nOr I’m tired of BSers like you showing up on SA. Leave the dam site and go back\nto Tinder and stop wasting our time.\n\n>You have no idea what kind of SB I am \n\nYes, I know exactly what kind of “SB” you are: a worthless SB—similar to a an “SD” that offers $0. \n\n> I can’t imagine ever valuing people so little that I would ever say that someone is “not even a little interesting to me if you don’t eventually plan on having sex with me.” ...\n\n0 value in you as an SB. 0. \n\nDo you value SDs who are not willing to pay for anything at all? Not a cent. Are you interested in talking to them? Are those men interesting to you enough to make them your SD? So how in the fucking world do you think you even have as much of an atom’s weight of value to me?\n\n> Yikes. I mean, you’re the one that has to look at yourself in the mirror every day so whatever floats your boat. But you’re straight up trash imo.\n\n🥱",
            "author": "PotGoblin",
            "id": "g0v2ml6",
            "parent_id": "t1_g0tkjto",
            "score": 0,
            "created_utc": 1596948403.0,
            "replies": [
                {
                    "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
                    "author": null,
                    "id": "g0vv9s7",
                    "parent_id": "t1_g0v2ml6",
                    "score": 2,
                    "created_utc": 1596975167.0,
                    "replies": [
                        {
                            "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                            "author": "PotGoblin",
                            "id": "g0x62in",
                            "parent_id": "t1_g0vv9s7",
                            "score": 1,
                            "created_utc": 1597001886.0,
                            "replies": [
                                {
                                    "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                                    "author": null,
                                    "id": "g0x6hcf",
                                    "parent_id": "t1_g0x62in",
                                    "score": 1,
                                    "created_utc": 1597002101.0,
                                    "replies": [
                                        {
                                            "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                            "author": "PotGoblin",
                                            "id": "g0x73c3",
                                            "parent_id": "t1_g0x6hcf",
                                            "score": 0,
                                            "created_utc": 1597002422.0,
                                            "replies": [
                                                {
                                                    "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                                    "author": null,
                                                    "id": "g0x7mu8",
                                                    "parent_id": "t1_g0x73c3",
                                                    "score": 1,
                                                    "created_utc": 1597002704.0,
                                                    "replies": [
                                                        {
                                                            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                            "author": "PotGoblin",
                                                            "id": "g0x8nws",
                                                            "parent_id": "t1_g0x7mu8",
                                                            "score": 1,
                                                            "created_utc": 1597003240.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                                    "author": null,
                                                                    "id": "g0x95zk",
                                                                    "parent_id": "t1_g0x8nws",
                                                                    "score": 1,
                                                                    "created_utc": 1597003503.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "🙄 Believe me the feeling is mutual.",
                                                                            "author": "PotGoblin",
                                                                            "id": "g0xykx2",
                                                                            "parent_id": "t1_g0x95zk",
                                                                            "score": 0,
                                                                            "created_utc": 1597017280.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂😂😂Lmao damn I pushed some buttons didn’t I? You’re just a bitter nasty old man who’s mad about getting called out on his bullshit.",
            "author": null,
            "id": "g0vv9s7",
            "parent_id": "t1_g0v2ml6",
            "score": 2,
            "created_utc": 1596975167.0,
            "replies": [
                {
                    "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
                    "author": "PotGoblin",
                    "id": "g0x62in",
                    "parent_id": "t1_g0vv9s7",
                    "score": 1,
                    "created_utc": 1597001886.0,
                    "replies": [
                        {
                            "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                            "author": null,
                            "id": "g0x6hcf",
                            "parent_id": "t1_g0x62in",
                            "score": 1,
                            "created_utc": 1597002101.0,
                            "replies": [
                                {
                                    "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                                    "author": "PotGoblin",
                                    "id": "g0x73c3",
                                    "parent_id": "t1_g0x6hcf",
                                    "score": 0,
                                    "created_utc": 1597002422.0,
                                    "replies": [
                                        {
                                            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                            "author": null,
                                            "id": "g0x7mu8",
                                            "parent_id": "t1_g0x73c3",
                                            "score": 1,
                                            "created_utc": 1597002704.0,
                                            "replies": [
                                                {
                                                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                                    "author": "PotGoblin",
                                                    "id": "g0x8nws",
                                                    "parent_id": "t1_g0x7mu8",
                                                    "score": 1,
                                                    "created_utc": 1597003240.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                            "author": null,
                                                            "id": "g0x95zk",
                                                            "parent_id": "t1_g0x8nws",
                                                            "score": 1,
                                                            "created_utc": 1597003503.0,
                                                            "replies": [
                                                                {
                                                                    "body": "🙄 Believe me the feeling is mutual.",
                                                                    "author": "PotGoblin",
                                                                    "id": "g0xykx2",
                                                                    "parent_id": "t1_g0x95zk",
                                                                    "score": 0,
                                                                    "created_utc": 1597017280.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤔 “Psychological projection is a defense mechanism in which the human ego defends itself against unconscious impulses or qualities (both positive and negative) by denying their existence in themselves while attributing them to others.”\n\nLet them read our posts and see who got triggered. See who is making the insults and desperate claims. Who do you think is more insecure—-an SD with money with a pool of SBs offerings sex but you have to work for them to find—-or a worthless broke SB who doesn’t offer the most important thing for SDs—-A salt SB. Worthless waste of time and space. A gross nuisance. \n\nYou realize you’re the minority opinion and you find yourself threatened by this post because it goes against what you value in a sugar relationship (being an absolutely worthless SB, the worst possible kind, akin to an SD that offers no money)and you are threatened that you are in the minority opinion, you hate that this opinion is being propagated, you are upset that most SDs want sex, and through your desperation and anxiety, you find yourself using psychological defense mechanisms and ad hominems. You’ve reached a whole new level of insecurity. And it shows 😂😂😂",
            "author": "PotGoblin",
            "id": "g0x62in",
            "parent_id": "t1_g0vv9s7",
            "score": 1,
            "created_utc": 1597001886.0,
            "replies": [
                {
                    "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
                    "author": null,
                    "id": "g0x6hcf",
                    "parent_id": "t1_g0x62in",
                    "score": 1,
                    "created_utc": 1597002101.0,
                    "replies": [
                        {
                            "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                            "author": "PotGoblin",
                            "id": "g0x73c3",
                            "parent_id": "t1_g0x6hcf",
                            "score": 0,
                            "created_utc": 1597002422.0,
                            "replies": [
                                {
                                    "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                                    "author": null,
                                    "id": "g0x7mu8",
                                    "parent_id": "t1_g0x73c3",
                                    "score": 1,
                                    "created_utc": 1597002704.0,
                                    "replies": [
                                        {
                                            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                            "author": "PotGoblin",
                                            "id": "g0x8nws",
                                            "parent_id": "t1_g0x7mu8",
                                            "score": 1,
                                            "created_utc": 1597003240.0,
                                            "replies": [
                                                {
                                                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                                    "author": null,
                                                    "id": "g0x95zk",
                                                    "parent_id": "t1_g0x8nws",
                                                    "score": 1,
                                                    "created_utc": 1597003503.0,
                                                    "replies": [
                                                        {
                                                            "body": "🙄 Believe me the feeling is mutual.",
                                                            "author": "PotGoblin",
                                                            "id": "g0xykx2",
                                                            "parent_id": "t1_g0x95zk",
                                                            "score": 0,
                                                            "created_utc": 1597017280.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The thing that makes me laugh hysterically is that you actually spent time writing this. Talk about “projection”!! What I hate is men who see women as objects and think they have no value if they aren’t willing to have sex with them. There’s a reason you have to pay for sex.",
            "author": null,
            "id": "g0x6hcf",
            "parent_id": "t1_g0x62in",
            "score": 1,
            "created_utc": 1597002101.0,
            "replies": [
                {
                    "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
                    "author": "PotGoblin",
                    "id": "g0x73c3",
                    "parent_id": "t1_g0x6hcf",
                    "score": 0,
                    "created_utc": 1597002422.0,
                    "replies": [
                        {
                            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                            "author": null,
                            "id": "g0x7mu8",
                            "parent_id": "t1_g0x73c3",
                            "score": 1,
                            "created_utc": 1597002704.0,
                            "replies": [
                                {
                                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                                    "author": "PotGoblin",
                                    "id": "g0x8nws",
                                    "parent_id": "t1_g0x7mu8",
                                    "score": 1,
                                    "created_utc": 1597003240.0,
                                    "replies": [
                                        {
                                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                            "author": null,
                                            "id": "g0x95zk",
                                            "parent_id": "t1_g0x8nws",
                                            "score": 1,
                                            "created_utc": 1597003503.0,
                                            "replies": [
                                                {
                                                    "body": "🙄 Believe me the feeling is mutual.",
                                                    "author": "PotGoblin",
                                                    "id": "g0xykx2",
                                                    "parent_id": "t1_g0x95zk",
                                                    "score": 0,
                                                    "created_utc": 1597017280.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly, you fail to address the issue. Appeal to more ad hominem. Fallacy upon fallacy. Just desperation and insecurity. \n\nYou know what I hate—entitled females who think they’re worth so much to even suggest they should get paid just to exist. Who pollute SA and distract from real SBs who are actually valueable and deserve the money they are offered.  The existence of your kind is a major nuisance. \n\nGood luck finding that sugar friend, lmao",
            "author": "PotGoblin",
            "id": "g0x73c3",
            "parent_id": "t1_g0x6hcf",
            "score": 0,
            "created_utc": 1597002422.0,
            "replies": [
                {
                    "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
                    "author": null,
                    "id": "g0x7mu8",
                    "parent_id": "t1_g0x73c3",
                    "score": 1,
                    "created_utc": 1597002704.0,
                    "replies": [
                        {
                            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                            "author": "PotGoblin",
                            "id": "g0x8nws",
                            "parent_id": "t1_g0x7mu8",
                            "score": 1,
                            "created_utc": 1597003240.0,
                            "replies": [
                                {
                                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                                    "author": null,
                                    "id": "g0x95zk",
                                    "parent_id": "t1_g0x8nws",
                                    "score": 1,
                                    "created_utc": 1597003503.0,
                                    "replies": [
                                        {
                                            "body": "🙄 Believe me the feeling is mutual.",
                                            "author": "PotGoblin",
                                            "id": "g0xykx2",
                                            "parent_id": "t1_g0x95zk",
                                            "score": 0,
                                            "created_utc": 1597017280.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Desperate about what dude?? You’re just a hateful rambling old man on the internet. And based on some of your posts, you seem totally clueless about how to please a woman, thus confirming my assertion that there is a quite tangible reason you ended up paying for sex. Not that there is anything wrong with sex work, I fully support sex workers. But you are a particular breed of nasty that I just cannot stand. I’m not going to engage with any of the bullshit you typed because it’s not worth my time. You’re the entitled one here.",
            "author": null,
            "id": "g0x7mu8",
            "parent_id": "t1_g0x73c3",
            "score": 1,
            "created_utc": 1597002704.0,
            "replies": [
                {
                    "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
                    "author": "PotGoblin",
                    "id": "g0x8nws",
                    "parent_id": "t1_g0x7mu8",
                    "score": 1,
                    "created_utc": 1597003240.0,
                    "replies": [
                        {
                            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                            "author": null,
                            "id": "g0x95zk",
                            "parent_id": "t1_g0x8nws",
                            "score": 1,
                            "created_utc": 1597003503.0,
                            "replies": [
                                {
                                    "body": "🙄 Believe me the feeling is mutual.",
                                    "author": "PotGoblin",
                                    "id": "g0xykx2",
                                    "parent_id": "t1_g0x95zk",
                                    "score": 0,
                                    "created_utc": 1597017280.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "(1) Desperate about relieving your insecurity through fallacies and ad hominem. \n\n(2) I’m paying for SBs because I have $$ and I love helping SBs in need, I love seeing them happy and appreciative of me, I love going on shopping sprees and see what they buy, I can get way more attractive girls (9s-10s) than I can for free and I like the power dynamic of sugar relationships. You see, I’m offering something of value, unlike the likes of you 🤢\n\n(3) How old do you think I am, lol.",
            "author": "PotGoblin",
            "id": "g0x8nws",
            "parent_id": "t1_g0x7mu8",
            "score": 1,
            "created_utc": 1597003240.0,
            "replies": [
                {
                    "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
                    "author": null,
                    "id": "g0x95zk",
                    "parent_id": "t1_g0x8nws",
                    "score": 1,
                    "created_utc": 1597003503.0,
                    "replies": [
                        {
                            "body": "🙄 Believe me the feeling is mutual.",
                            "author": "PotGoblin",
                            "id": "g0xykx2",
                            "parent_id": "t1_g0x95zk",
                            "score": 0,
                            "created_utc": 1597017280.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re so pathetic 😂\nI’ve seen your posts... I truly feel sorry for anyone who has ever had sex with you. The fact that you classify women by numbers speaks volumes about you. Keep lying to yourself.",
            "author": null,
            "id": "g0x95zk",
            "parent_id": "t1_g0x8nws",
            "score": 1,
            "created_utc": 1597003503.0,
            "replies": [
                {
                    "body": "🙄 Believe me the feeling is mutual.",
                    "author": "PotGoblin",
                    "id": "g0xykx2",
                    "parent_id": "t1_g0x95zk",
                    "score": 0,
                    "created_utc": 1597017280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🙄 Believe me the feeling is mutual.",
            "author": "PotGoblin",
            "id": "g0xykx2",
            "parent_id": "t1_g0x95zk",
            "score": 0,
            "created_utc": 1597017280.0,
            "replies": []
        }
    ]
}