{
    "title": "The Ultimate Lazy Guide to Having Better Hair (hell yeah man)",
    "post_id": "dein0m",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/dein0m/the_ultimate_lazy_guide_to_having_better_hair/",
    "author": "MindfulBullshit",
    "body": "**Introduction (stop using 2 in 1 or 3 in 1 shit)**\n\nI've been putting off writing this because of the stigma that \"knowing\" or caring about your hair is \"gay\", I had to deal with this stigma as I tried to grow out my hair when I was 14. I don't think this is right and any male should be able to care about his hair without being having to worry about stigma. Everyone wants to have good hair; hair is a source of confidence for many men.\n\nDisclaimer: I'm not a professional, I'm just a normal guy who's done a lot of research because I was sick of having bad hair days.\n\nNatural hair and promoting your natural genetic tendencies is what I'm aiming to promote with this guide. [See this picture of me aged 14 vs aged 21.](https://i.imgur.com/RI4ejCj.jpg)\n\n&#x200B;\n\n**Basics (boring information stuff)**\n\nEven though hair cells are dead, your hair should be treated like a living organism. Certain things can be more damaging then beneficial; this means damaged hair will take time to repair.\n\nThe purpose of shampoo is to remove oil and dirt that is in your hair. Conditioner's purpose is to put back some oils to make it soft and managable for combing and styling. However, naturally your scalp produces oils that naturally condition your hair. These oils also become striped when you use certain shampoos ^(psst it's sulphates). Certain shampoos can be more damaging than others (as I will explain later).\n\nIf you shampoo too often your scalp will produce more oils in an attempt to restore equilibrium (balance). This means if you shampoo daily and stop suddenly, you will experience a rebound effect where your scalp is producing too much oil. The result can be oily hair, dandruff or an itchy scalp. In this case, it may be worth while to slowly reduce the amount of shampoo you use over a longer period of time. It's kinda like a drug in which you will experience withdrawals, you can go cold turkey and deal with an itchy scalp and dandruff for awhile or you can reduce your usage over time.\n\nConditioning hair seals in moisture and is normally used if your hair is too dry. This is why most brands recommend you use their conditioning product if you use their shampoo product.\n\n1. You can use a shampoo and conditioner\n2. You can use shampoo and not use conditioner (use as needed e.g. when you feel your hair is too dirty or too much build up)\n3. You can use conditioner and not use shampoo (called co-washing)\n4. You can use no shampoo at all (no shampoo relies on your scalp to reach that eventual balance, however this doesn't work for everyone)\n\nI use a combination, I shampoo when needed and I condition when needed. This is entirely up to you and **overall it can be all boiled down to**:\n\n* Use shampoo if your hair is too oily (build up)\n* Use conditioner if your hair is too dry\n\n&#x200B;\n\n**Temperature**\n\nThe temperature of the water while you shower can dry out your skin, including your scalp. This can worsen dandruff and dry out your hair (loss of those oils my dude). Thus cold showers are actually better for your hair and skin, but who's going to do that? If you still want a warm shower, just adjust the temperature until it's as cold as you can manage. Just avoid hot and steamy (although relaxing) showers. If you do turn up that heat, just don't get your hair wet, I'm fucking serious.\n\nScientific reasoning is:\n\n1. hot = more energy\n2. more energy evaporates more stuff\n3. therefore dryness and itchy hell\n\n&#x200B;\n\n**Shampoo and Conditioner Products (it's all a scam)**\n\nOkay so most shampoo and conditioner products are a scam. They use the same chemicals.  L’Oreal, Aveeno, Garnier, Herbal Essences, Pantene, Dove, Head and Shoulders...ect. all use the same shit. Most shampoos use  **Sodium Lauryl Sulfate/Sodium Laureth Sulfate (Sulfates)** while most conditioners use **silicones (ingredients ending with “-cone”)**.\n\n* Sulphates are bad because they strip natural oils, causing your scalp to become itchy and dry.\n* Silicones are bad because most silicone chemicals are not water soluable. This means that they build up in your hair.\n\nSulphate products are designed so that they can remove silicones from your hair. They are strong chemicals in that regard, thus this is why they are effective at treating dandruff. However it is in your best interest to not be held back by these hair drugs and you should only use every so often, with the goal of no usage *evennnntually.*\n\n* If you are making the switch from Sulphates/Silicones, you should do a reset wash by using a ***sulphate product that has no silicones***.\n\nYou will need to go to a pharmacy or a supermarket and look at products' ingredients list. Yes, this is where the effort comes in. Generally natural products will advertise that they are sulphate or silicone free. This will vary from location, country and region. It really just depends what you can find or order online. I will refer you to this [ultimate guide from /r/curlyhair](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.exb4a3d58zp), it has some suggestions but I just used the the first natural product I could find.\n\nGood products will cost more money, although if you use less (as I'm suggesting) you will only need to buy hair care products every 3-6 months.\n\n&#x200B;\n\n**Hair Styling Products**\n\nThis is getting fucking long so you get dot points now.\n\n* Your natural oils act as product, style while your hair is wet and let it naturally dry.\n* Look for water soluable products\n* If you use a hair dryer; a hair diffuser is an option to reduce further frizz (it's like naturally drying it but quicker)\n* Becareful of non-water soluable products as they might not be easily removed from your hair (only sulphate products may be able to remove them)\n* Touch your hair less as this produces more oils\n* Consider that different hair products are tailored to different hair types (curly, dry, damaged, voluming... ect)\n\n&#x200B;\n\nI don't know if this is general knowledge, so if it is... My bad lol. I didn't know most of this until recently. If there is anything to add comment it below. This guide will help any hair and promote a natural healthy style but it's more important the longer your hair is.\n\n**EDIT:** Another tip is not to go crazy on your hair with a towel when it's wet, but rather to pat dry it, as this can damage it.",
    "url": "https://www.reddit.com/r/malehairadvice/comments/dein0m/the_ultimate_lazy_guide_to_having_better_hair/",
    "score": 912,
    "upvote_ratio": 0.99,
    "created_utc": 1570450688.0,
    "num_comments": 54,
    "links": [
        [
            "https://i.imgur.com/RI4ejCj.jpg",
            "https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.exb4a3d58zp"
        ]
    ],
    "comments": [
        {
            "body": "Lol I see you with the \"Curly Girl Method\" but phrasing it all so differently 😂\n\nBut boys, listen to the man. I spent two years growing out my hair because I was always told that I had beautiful hair. I spent another two years putting it in a bun because I couldnt consistently style it effectively. Now that I've gone to this method (along with using mousse and hair gel) I wear my hair down and proudly wayyy more often.",
            "author": "Sherbert93",
            "id": "f2vlpqa",
            "parent_id": "t3_dein0m",
            "score": 116,
            "created_utc": 1570454329.0,
            "replies": [
                {
                    "body": "Yeah honestly I got a lot of my information from /r/curlyhair but I see little information on proper hair care here. I kinda just wanted to package it all into one post instead of just sending people to another subreddit (is that lazy or just giving credit?).",
                    "author": "MindfulBullshit",
                    "id": "f2vmxmg",
                    "parent_id": "t1_f2vlpqa",
                    "score": 40,
                    "created_utc": 1570454788.0,
                    "replies": [
                        {
                            "body": "I think some guys need to hear it from a guy. I think you're good 👍",
                            "author": "Sherbert93",
                            "id": "f2vo1dr",
                            "parent_id": "t1_f2vmxmg",
                            "score": 19,
                            "created_utc": 1570455200.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was noticing that as well lol.\n\nAll we need is the plop.",
                    "author": "arhombus",
                    "id": "f2vz64e",
                    "parent_id": "t1_f2vlpqa",
                    "score": 5,
                    "created_utc": 1570459267.0,
                    "replies": []
                },
                {
                    "body": "I'm currently in the same predicament. I (m) have about shoulder blade length wavy hair but when it dries i look like a crazy person. I used to be able to wear it down all the time but lately (partially because of work, mostly because of laziness) I have to wear it up everyday n I've considered just cutting it. I've had long hair for like 12 years tho so that's a tough decision lol. What kind of mousse do you use? I've been using argon oil and that helps but only so much",
                    "author": "hyperchickenwing",
                    "id": "f2wakp1",
                    "parent_id": "t1_f2vlpqa",
                    "score": 2,
                    "created_utc": 1570463409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My hair looks pretty good wet but as soon as it dries it turns into a puff ball, I usually wear a beanie to shape it, any way to prevent that? My hair is Uber thick",
            "author": "Superplant79",
            "id": "f2vjceg",
            "parent_id": "t3_dein0m",
            "score": 69,
            "created_utc": 1570453426.0,
            "replies": [
                {
                    "body": "Thicker hair needs more oils to reduce that puffyness. Using shampoo and conditoner that doesn't have sulphates or silicones is a good long term solution. In the short term, argan oil/moroccan oil will give it some more weight so it doesn't poof out.",
                    "author": "MindfulBullshit",
                    "id": "f2vk2z0",
                    "parent_id": "t1_f2vjceg",
                    "score": 39,
                    "created_utc": 1570453712.0,
                    "replies": [
                        {
                            "body": "I do use oils to help but it ends up making my hair too oily before my hair gets to what I want I have this anti frizz stuff for when I used to blow dry and straighten my hair I am gonna just put it in and see what it does\n\nA lot of stuff hasn’t worked well yet I can pm you some videos because pictures aren’t gonna do it justice",
                            "author": "Superplant79",
                            "id": "f2zaf00",
                            "parent_id": "t1_f2vk2z0",
                            "score": 3,
                            "created_utc": 1570512133.0,
                            "replies": [
                                {
                                    "body": "Yeah pm me man. I had a similar issue because I have thick dense hair that is naturally wavy/curly. \n\nIt depends how often you shampoo. As for me personally, only natural oils really helped combat that frizz.\n\nOh also blow drying and straightening hair will damage it. This will contribute to frizz and it boofing out",
                                    "author": "MindfulBullshit",
                                    "id": "f2zi5zt",
                                    "parent_id": "t1_f2zaf00",
                                    "score": 6,
                                    "created_utc": 1570523221.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f2w2zsa",
                    "parent_id": "t1_f2vjceg",
                    "score": 3,
                    "created_utc": 1570460666.0,
                    "replies": [
                        {
                            "body": "Air dry has kept my curls the best but sometimes I wear a beanie for work and that turns it flat",
                            "author": "Superplant79",
                            "id": "f2za7w8",
                            "parent_id": "t1_f2w2zsa",
                            "score": 1,
                            "created_utc": 1570511907.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You can also just use conditioner & not shampoo everyday. I have thick hair also & only shampoo \\~1x per week, but condition multiple times. This keeps oils in your hair to prevent the puffiness.",
                    "author": "OklaJosha",
                    "id": "f2vst52",
                    "parent_id": "t1_f2vjceg",
                    "score": 9,
                    "created_utc": 1570456949.0,
                    "replies": [
                        {
                            "body": "What if you use hair product such as wax, can conditioner clean out the wax in my hair or do i have to use shampoo?",
                            "author": "ahhWoLF",
                            "id": "f2yd8cv",
                            "parent_id": "t1_f2vst52",
                            "score": 3,
                            "created_utc": 1570489482.0,
                            "replies": [
                                {
                                    "body": "No, the conditioner won't clean out the wax. I've moved away from most products because of that. However, water-based products will rinse out.\n\nHonestly, the only thing I really put in my hair now, which is rare, is a little non-comedogenic body lotion like Cerave or Cetaphil.",
                                    "author": "OklaJosha",
                                    "id": "f2zwqo6",
                                    "parent_id": "t1_f2yd8cv",
                                    "score": 2,
                                    "created_utc": 1570540729.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Mousse or use an oil-based pomade",
                    "author": "305-til-i-786",
                    "id": "f2wnvth",
                    "parent_id": "t1_f2vjceg",
                    "score": 3,
                    "created_utc": 1570468018.0,
                    "replies": []
                },
                {
                    "body": "gel, mousse, pomade, clay. \n\nthis happens to everyone.",
                    "author": "untraiined",
                    "id": "f2yvgnd",
                    "parent_id": "t1_f2vjceg",
                    "score": 1,
                    "created_utc": 1570499386.0,
                    "replies": [
                        {
                            "body": "Nah my hair is different I’ve tried all but clay but my hair for the most part goes back into an immovable object only sometimes it’s “alright”",
                            "author": "Superplant79",
                            "id": "f2za9xz",
                            "parent_id": "t1_f2yvgnd",
                            "score": 1,
                            "created_utc": 1570511973.0,
                            "replies": [
                                {
                                    "body": "then go stronger? gel and mousse?",
                                    "author": "untraiined",
                                    "id": "f2zbfxj",
                                    "parent_id": "t1_f2za9xz",
                                    "score": 1,
                                    "created_utc": 1570513362.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gay or not, I couldn't care less. Every man should care about their hair. These tips are amazing so thank you so much for compiling this.",
            "author": "jdayellow",
            "id": "f2xe5mf",
            "parent_id": "t3_dein0m",
            "score": 14,
            "created_utc": 1570477255.0,
            "replies": []
        },
        {
            "body": "Recommendations for water-based styler?\nI'm using the Deva Curl' Gel, it's fine but doesn't give much control.\n\nI tried Quicksand too, but this one is very dry.",
            "author": "quite_wrong",
            "id": "f2vyagb",
            "parent_id": "t3_dein0m",
            "score": 5,
            "created_utc": 1570458958.0,
            "replies": [
                {
                    "body": "I use [Uppercut Deluxe](https://uppercutdeluxe.com/us/), they have different strengths to suit your hair type.",
                    "author": "MindfulBullshit",
                    "id": "f2w0j7r",
                    "parent_id": "t1_f2vyagb",
                    "score": 6,
                    "created_utc": 1570459745.0,
                    "replies": []
                },
                {
                    "body": "Suavecito Pomade",
                    "author": "305-til-i-786",
                    "id": "f2wnyyv",
                    "parent_id": "t1_f2vyagb",
                    "score": 3,
                    "created_utc": 1570468048.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have super straight fine hair (but lots of it) would these tips still apply for me? And what would be a good shampoo/conditioner for me",
            "author": "MoonManny",
            "id": "f2wy8dt",
            "parent_id": "t3_dein0m",
            "score": 6,
            "created_utc": 1570471597.0,
            "replies": [
                {
                    "body": "Yes these will. These tips will help promote healthy hair for all hair types. For fine hair, look for sulfate and silicone free shampoo/conditioner that is volumizing.",
                    "author": "MindfulBullshit",
                    "id": "f2x28mf",
                    "parent_id": "t1_f2wy8dt",
                    "score": 4,
                    "created_utc": 1570472943.0,
                    "replies": [
                        {
                            "body": "Thanks",
                            "author": "MoonManny",
                            "id": "f2x8o47",
                            "parent_id": "t1_f2x28mf",
                            "score": 3,
                            "created_utc": 1570474940.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Any comment on sulfates vs sulfonates? I've read that they're pretty much the same thing, but are used so companies can say \"no sulfates\" on bottles",
            "author": "KyonyuuSeijin",
            "id": "f2xg5pe",
            "parent_id": "t3_dein0m",
            "score": 6,
            "created_utc": 1570478036.0,
            "replies": []
        },
        {
            "body": "I was actually looking for something exactly like this, I never do anything with my hair. Thank you:)",
            "author": "sonofasammich",
            "id": "f2wgvle",
            "parent_id": "t3_dein0m",
            "score": 4,
            "created_utc": 1570465650.0,
            "replies": []
        },
        {
            "body": "My hair are not straight, they're wavyv from the roots and a fucking mess at the tips especially after a month of  haircut. They frizz out so much, they curl back words towards the top. This makes a mess to style especially if they're long but i look better in medium length so i try my best.\n\nBut the sad part is I can never properly grow it out even though i would love to.",
            "author": "UPNova",
            "id": "f2wq481",
            "parent_id": "t3_dein0m",
            "score": 6,
            "created_utc": 1570468809.0,
            "replies": [
                {
                    "body": "You 100% can grow it out. Your hair just needs to be taken care of. \n\nDoes your shampoo have Sodium Lauryl Sulfate or Sodium Laureth Sulfate in it? Does your conditoner have silicones in it? \n\nFrizz is due to damage to your hair. Hot showers can damage your hair in this way. Argan oil soaked near the tip can help repair. Make sure you know if there is sulfates or silicones in your shampoo or conditioner, these really do damage your hair. If you do this and treat it good. Within a couple months your hair will rebound naturally.\n\nIf you have any questions I'm happy to help. I understand the frustration of not knowing what to do with my hair. I've always loved the idea me with long hair, I plan on growing it out fully.",
                    "author": "MindfulBullshit",
                    "id": "f2wycpk",
                    "parent_id": "t1_f2wq481",
                    "score": 6,
                    "created_utc": 1570471636.0,
                    "replies": [
                        {
                            "body": "I try to limit the harm by using the one with laureth because sulfate free stuff are pretty expensive in my country so kinda hard taking care on a budget",
                            "author": "UPNova",
                            "id": "f2x3q2p",
                            "parent_id": "t1_f2wycpk",
                            "score": 2,
                            "created_utc": 1570473425.0,
                            "replies": [
                                {
                                    "body": "There are natural alternatives you can try, I wouldn't give up hope. You can try a baking soda shampoo wash followed by an apple cider vinegar hair rinse.  I've heard success with using coconut oil as a conditioner or using egg yolk as a shampoo. \n\nLook into these 4 methods, before you give up!",
                                    "author": "MindfulBullshit",
                                    "id": "f2x60ii",
                                    "parent_id": "t1_f2x3q2p",
                                    "score": 2,
                                    "created_utc": 1570474169.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good stuff my dude! As someone who has gone through many phases of experimentation, I can totally vouch for what you’ve written here. I have naturally wavy/curly hair but I wasn’t aware of that until recently. Usually it turned into frizz after I washed it. This was due to me using shampoo every single day.\n\nAll I do now is use a scalp brush to get rid of any sort of build up, then I co-wash it, I use the brush again to spread the conditioner, and my hair is finally looking better. I blot my hair with a tshirt to get the excess water out and occasionally use the Umberto Giannini No More Frizz to help settle it down. This also helps the curls stay after I curl them with my fingers. After that, I just let it air dry. And if not, I use a hair dryer from far away, so the curls don’t get disrupted.",
            "author": "Roof_rat",
            "id": "f2wpdaz",
            "parent_id": "t3_dein0m",
            "score": 3,
            "created_utc": 1570468536.0,
            "replies": [
                {
                    "body": "Do you find that the difference between drying with a t-shirt and drying with a towel is noticeable? I’ve heard this as advice before, but have never actually tried it (mostly because I never remember to bring a tee into the washroom with me)",
                    "author": "feisty_weatherman",
                    "id": "f2yqqo3",
                    "parent_id": "t1_f2wpdaz",
                    "score": 2,
                    "created_utc": 1570496161.0,
                    "replies": [
                        {
                            "body": "I do, as long as I use it to blot my hair and squeeze out the excess water, it’s noticeable because it retains my waves. It just takes a few tries getting used to it and understanding that you shouldn’t aim to completely dry your hair while doing it. I used to rub my head with a towel before and that did was ruin my hair shape and turn it frizzy.",
                            "author": "Roof_rat",
                            "id": "f2zalj5",
                            "parent_id": "t1_f2yqqo3",
                            "score": 2,
                            "created_utc": 1570512345.0,
                            "replies": [
                                {
                                    "body": "Alright! I think maybe I’ll just take the tees in my donation box and move them to the linen closet so that I have some dedicated hair-drying ones\n\nThanks for the tips!!",
                                    "author": "feisty_weatherman",
                                    "id": "f2zwkdo",
                                    "parent_id": "t1_f2zalj5",
                                    "score": 2,
                                    "created_utc": 1570540589.0,
                                    "replies": [
                                        {
                                            "body": "Yup! Take one and just hang it in the bathroom, so it's there when you need it. It sucks to run around the house with wet hair!",
                                            "author": "Roof_rat",
                                            "id": "f30659s",
                                            "parent_id": "t1_f2zwkdo",
                                            "score": 2,
                                            "created_utc": 1570547287.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So I've started growing my hair out long for the first time and I have a couple questions:\n\nHow do I know when I should shampoo? I work out every morning and shower right after, but I also do jiu-jitsu a couple times a week which involves a lot of rolling around, getting squished and lots of sweat. I kinda just shampoo twice a week, but idk the how to tell if my hair is getting gross from buildup in-between.\n\nShould I brush, and if so how often? My hair is kinda wavy to slightly curly, fine and pretty thick. Right now I'm just kinda pushing it back. I've been told by a couple people that I should try to go for the Jon Snow look.\n\nWhat's the best way to restyle it after it's been messed up? I said before, it's kinda thick. It'll tend to stay in whatever weird way it dried. Most of the time, it stays good, but sometimes I'll have some clump of it stick up on top of my head and I can't get it back down easily. Would a sea-salt spray be good for that, I hear people mention those a lot.\n\nI don't really systematically take pictures of my hair, sometimes just take a selfie if I have a day I feel like I'm looking good. [But here's an album of such shots over the past two months.](http://imgur.com/gallery/kxK8CmH) I know they're not really close ups of my hair so it might not be that useful lol, but figured I'd include them.\n\nI've been using American Crew shampoo and conditioner, the conditioner daily and the shampoo twice a week. I checked and the shampoo does have sulfates so I'll have to look for another one. I'm not sure anything listed in the conditioner was a silicone, but I might look for something else anyways.",
            "author": "Waltonruler5",
            "id": "f2wr2cq",
            "parent_id": "t3_dein0m",
            "score": 3,
            "created_utc": 1570469149.0,
            "replies": [
                {
                    "body": "I shampoo when my hair feels gross. For me this means shampooing once every 1-3 weeks. I just wash it and forget about it, until my hair feels gross again.\n\nI use my fingers to style my hair. It's up to you, but harsher brushes can irritate your scalp if you brush your scalp too much. This is causes it to produce more oil. Honestly, it's just preference.\n\nThe Conditioner doesn't have silicones, so I'd take time to find a new shampoo that doesn't have sulfates or silicones. You should see any improvement.  Sodium Lauryl Sulfate or Sodium Laureth Sulfate are my enemy!!! The shit makes me reek of BO if I use a brand of soap of this stuff for my armpits, it's honestly toxic. Once you find one, use the gentler shampoo more regularly and treat the sulfate stuff as stronger stuff.\n\nI say to keep the sulfate shampoo because you may want to experiment with both shampoos, this will get you an idea on what you want to do next.",
                    "author": "MindfulBullshit",
                    "id": "f2x1les",
                    "parent_id": "t1_f2wr2cq",
                    "score": 6,
                    "created_utc": 1570472727.0,
                    "replies": [
                        {
                            "body": "Thanks! Really appreciate the advice!",
                            "author": "Waltonruler5",
                            "id": "f2x4p3x",
                            "parent_id": "t1_f2x1les",
                            "score": 3,
                            "created_utc": 1570473738.0,
                            "replies": []
                        },
                        {
                            "body": "Just to confirm, would you aim to avoid silicones in conditioner like Dimethicone or Amodimethicone?",
                            "author": "lecoeurvivant",
                            "id": "jgm3470",
                            "parent_id": "t1_f2x1les",
                            "score": 1,
                            "created_utc": 1681740838.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Do you use any product for styling? I’m assuming you let your hair air dry too?",
                    "author": "HeatB719",
                    "id": "f2z4qhe",
                    "parent_id": "t1_f2wr2cq",
                    "score": 2,
                    "created_utc": 1570506428.0,
                    "replies": [
                        {
                            "body": "No styling product, and yep, air dryed.",
                            "author": "Waltonruler5",
                            "id": "f2z5e8n",
                            "parent_id": "t1_f2z4qhe",
                            "score": 1,
                            "created_utc": 1570507025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What an excellent post. I won't have to send people to r/curlyhair any more!",
            "author": "Sleambean",
            "id": "f2xecca",
            "parent_id": "t3_dein0m",
            "score": 3,
            "created_utc": 1570477346.0,
            "replies": []
        },
        {
            "body": "Thanks for putting this all together for everyone.  \nPeople always look at me crazy when I tell them I only wash my hair like twice a week and that they should stop shampooing their hair everyday. It's hard to go against what is ingrained in people's heads from such an early age.",
            "author": "kapouwy",
            "id": "f2y1kab",
            "parent_id": "t3_dein0m",
            "score": 2,
            "created_utc": 1570485066.0,
            "replies": []
        },
        {
            "body": "I haven’t used anything to wash my hair in the past year and no problems, just water",
            "author": "Student654323",
            "id": "f2ykgj4",
            "parent_id": "t3_dein0m",
            "score": 2,
            "created_utc": 1570493006.0,
            "replies": []
        },
        {
            "body": "Thank you, very cool!",
            "author": "Tjamajama",
            "id": "f2vlxzc",
            "parent_id": "t3_dein0m",
            "score": 3,
            "created_utc": 1570454417.0,
            "replies": []
        },
        {
            "body": "> (stop using 2 in 1 or 3 in 1 shit)\n\nDisagree. This stuff is a phenomenal way to clean your ass crack.",
            "author": "osm0sis",
            "id": "f2zektt",
            "parent_id": "t3_dein0m",
            "score": 1,
            "created_utc": 1570517605.0,
            "replies": [
                {
                    "body": "I guess any bodywash can do it. Why only 2 in 1 or 3 in 1?",
                    "author": "Albema8",
                    "id": "f2zqfkz",
                    "parent_id": "t1_f2zektt",
                    "score": 2,
                    "created_utc": 1570535005.0,
                    "replies": [
                        {
                            "body": "Cleans the skin and leaves the hair softer than soap, which ultimately leads to happier and cleaner ass crack throughout the day.",
                            "author": "osm0sis",
                            "id": "f31rf1x",
                            "parent_id": "t1_f2zqfkz",
                            "score": 1,
                            "created_utc": 1570582767.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let's see how this works out for me :3",
            "author": "Athyriel",
            "id": "f2zj5h3",
            "parent_id": "t3_dein0m",
            "score": 1,
            "created_utc": 1570524880.0,
            "replies": []
        },
        {
            "body": "You don't have any idea about what's laziness 😅",
            "author": "itcantbealreadytaken",
            "id": "f30c0a9",
            "parent_id": "t3_dein0m",
            "score": 1,
            "created_utc": 1570551050.0,
            "replies": [
                {
                    "body": "Thought someone would pick up on that lol. I say lazy because once you know what you're doing. You shampoo and do your thing and sit back for a few weeks and forget about it.",
                    "author": "MindfulBullshit",
                    "id": "f3281fd",
                    "parent_id": "t1_f30c0a9",
                    "score": 2,
                    "created_utc": 1570596828.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Legend.",
            "author": "itsdems",
            "id": "ik1clhk",
            "parent_id": "t3_dein0m",
            "score": 1,
            "created_utc": 1660333521.0,
            "replies": []
        },
        {
            "body": "Just to confirm, so I understand, would you aim to avoid silicones in conditioner like Dimethicone or Amodimethicone?",
            "author": "lecoeurvivant",
            "id": "jgm382h",
            "parent_id": "t3_dein0m",
            "score": 1,
            "created_utc": 1681740886.0,
            "replies": []
        },
        {
            "body": "Yeah honestly I got a lot of my information from /r/curlyhair but I see little information on proper hair care here. I kinda just wanted to package it all into one post instead of just sending people to another subreddit (is that lazy or just giving credit?).",
            "author": "MindfulBullshit",
            "id": "f2vmxmg",
            "parent_id": "t1_f2vlpqa",
            "score": 40,
            "created_utc": 1570454788.0,
            "replies": [
                {
                    "body": "I think some guys need to hear it from a guy. I think you're good 👍",
                    "author": "Sherbert93",
                    "id": "f2vo1dr",
                    "parent_id": "t1_f2vmxmg",
                    "score": 19,
                    "created_utc": 1570455200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was noticing that as well lol.\n\nAll we need is the plop.",
            "author": "arhombus",
            "id": "f2vz64e",
            "parent_id": "t1_f2vlpqa",
            "score": 5,
            "created_utc": 1570459267.0,
            "replies": []
        },
        {
            "body": "I'm currently in the same predicament. I (m) have about shoulder blade length wavy hair but when it dries i look like a crazy person. I used to be able to wear it down all the time but lately (partially because of work, mostly because of laziness) I have to wear it up everyday n I've considered just cutting it. I've had long hair for like 12 years tho so that's a tough decision lol. What kind of mousse do you use? I've been using argon oil and that helps but only so much",
            "author": "hyperchickenwing",
            "id": "f2wakp1",
            "parent_id": "t1_f2vlpqa",
            "score": 2,
            "created_utc": 1570463409.0,
            "replies": []
        },
        {
            "body": "Thicker hair needs more oils to reduce that puffyness. Using shampoo and conditoner that doesn't have sulphates or silicones is a good long term solution. In the short term, argan oil/moroccan oil will give it some more weight so it doesn't poof out.",
            "author": "MindfulBullshit",
            "id": "f2vk2z0",
            "parent_id": "t1_f2vjceg",
            "score": 39,
            "created_utc": 1570453712.0,
            "replies": [
                {
                    "body": "I do use oils to help but it ends up making my hair too oily before my hair gets to what I want I have this anti frizz stuff for when I used to blow dry and straighten my hair I am gonna just put it in and see what it does\n\nA lot of stuff hasn’t worked well yet I can pm you some videos because pictures aren’t gonna do it justice",
                    "author": "Superplant79",
                    "id": "f2zaf00",
                    "parent_id": "t1_f2vk2z0",
                    "score": 3,
                    "created_utc": 1570512133.0,
                    "replies": [
                        {
                            "body": "Yeah pm me man. I had a similar issue because I have thick dense hair that is naturally wavy/curly. \n\nIt depends how often you shampoo. As for me personally, only natural oils really helped combat that frizz.\n\nOh also blow drying and straightening hair will damage it. This will contribute to frizz and it boofing out",
                            "author": "MindfulBullshit",
                            "id": "f2zi5zt",
                            "parent_id": "t1_f2zaf00",
                            "score": 6,
                            "created_utc": 1570523221.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2w2zsa",
            "parent_id": "t1_f2vjceg",
            "score": 3,
            "created_utc": 1570460666.0,
            "replies": [
                {
                    "body": "Air dry has kept my curls the best but sometimes I wear a beanie for work and that turns it flat",
                    "author": "Superplant79",
                    "id": "f2za7w8",
                    "parent_id": "t1_f2w2zsa",
                    "score": 1,
                    "created_utc": 1570511907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can also just use conditioner & not shampoo everyday. I have thick hair also & only shampoo \\~1x per week, but condition multiple times. This keeps oils in your hair to prevent the puffiness.",
            "author": "OklaJosha",
            "id": "f2vst52",
            "parent_id": "t1_f2vjceg",
            "score": 9,
            "created_utc": 1570456949.0,
            "replies": [
                {
                    "body": "What if you use hair product such as wax, can conditioner clean out the wax in my hair or do i have to use shampoo?",
                    "author": "ahhWoLF",
                    "id": "f2yd8cv",
                    "parent_id": "t1_f2vst52",
                    "score": 3,
                    "created_utc": 1570489482.0,
                    "replies": [
                        {
                            "body": "No, the conditioner won't clean out the wax. I've moved away from most products because of that. However, water-based products will rinse out.\n\nHonestly, the only thing I really put in my hair now, which is rare, is a little non-comedogenic body lotion like Cerave or Cetaphil.",
                            "author": "OklaJosha",
                            "id": "f2zwqo6",
                            "parent_id": "t1_f2yd8cv",
                            "score": 2,
                            "created_utc": 1570540729.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mousse or use an oil-based pomade",
            "author": "305-til-i-786",
            "id": "f2wnvth",
            "parent_id": "t1_f2vjceg",
            "score": 3,
            "created_utc": 1570468018.0,
            "replies": []
        },
        {
            "body": "gel, mousse, pomade, clay. \n\nthis happens to everyone.",
            "author": "untraiined",
            "id": "f2yvgnd",
            "parent_id": "t1_f2vjceg",
            "score": 1,
            "created_utc": 1570499386.0,
            "replies": [
                {
                    "body": "Nah my hair is different I’ve tried all but clay but my hair for the most part goes back into an immovable object only sometimes it’s “alright”",
                    "author": "Superplant79",
                    "id": "f2za9xz",
                    "parent_id": "t1_f2yvgnd",
                    "score": 1,
                    "created_utc": 1570511973.0,
                    "replies": [
                        {
                            "body": "then go stronger? gel and mousse?",
                            "author": "untraiined",
                            "id": "f2zbfxj",
                            "parent_id": "t1_f2za9xz",
                            "score": 1,
                            "created_utc": 1570513362.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I use [Uppercut Deluxe](https://uppercutdeluxe.com/us/), they have different strengths to suit your hair type.",
            "author": "MindfulBullshit",
            "id": "f2w0j7r",
            "parent_id": "t1_f2vyagb",
            "score": 6,
            "created_utc": 1570459745.0,
            "replies": []
        },
        {
            "body": "Suavecito Pomade",
            "author": "305-til-i-786",
            "id": "f2wnyyv",
            "parent_id": "t1_f2vyagb",
            "score": 3,
            "created_utc": 1570468048.0,
            "replies": []
        },
        {
            "body": "Yes these will. These tips will help promote healthy hair for all hair types. For fine hair, look for sulfate and silicone free shampoo/conditioner that is volumizing.",
            "author": "MindfulBullshit",
            "id": "f2x28mf",
            "parent_id": "t1_f2wy8dt",
            "score": 4,
            "created_utc": 1570472943.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": "MoonManny",
                    "id": "f2x8o47",
                    "parent_id": "t1_f2x28mf",
                    "score": 3,
                    "created_utc": 1570474940.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You 100% can grow it out. Your hair just needs to be taken care of. \n\nDoes your shampoo have Sodium Lauryl Sulfate or Sodium Laureth Sulfate in it? Does your conditoner have silicones in it? \n\nFrizz is due to damage to your hair. Hot showers can damage your hair in this way. Argan oil soaked near the tip can help repair. Make sure you know if there is sulfates or silicones in your shampoo or conditioner, these really do damage your hair. If you do this and treat it good. Within a couple months your hair will rebound naturally.\n\nIf you have any questions I'm happy to help. I understand the frustration of not knowing what to do with my hair. I've always loved the idea me with long hair, I plan on growing it out fully.",
            "author": "MindfulBullshit",
            "id": "f2wycpk",
            "parent_id": "t1_f2wq481",
            "score": 6,
            "created_utc": 1570471636.0,
            "replies": [
                {
                    "body": "I try to limit the harm by using the one with laureth because sulfate free stuff are pretty expensive in my country so kinda hard taking care on a budget",
                    "author": "UPNova",
                    "id": "f2x3q2p",
                    "parent_id": "t1_f2wycpk",
                    "score": 2,
                    "created_utc": 1570473425.0,
                    "replies": [
                        {
                            "body": "There are natural alternatives you can try, I wouldn't give up hope. You can try a baking soda shampoo wash followed by an apple cider vinegar hair rinse.  I've heard success with using coconut oil as a conditioner or using egg yolk as a shampoo. \n\nLook into these 4 methods, before you give up!",
                            "author": "MindfulBullshit",
                            "id": "f2x60ii",
                            "parent_id": "t1_f2x3q2p",
                            "score": 2,
                            "created_utc": 1570474169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you find that the difference between drying with a t-shirt and drying with a towel is noticeable? I’ve heard this as advice before, but have never actually tried it (mostly because I never remember to bring a tee into the washroom with me)",
            "author": "feisty_weatherman",
            "id": "f2yqqo3",
            "parent_id": "t1_f2wpdaz",
            "score": 2,
            "created_utc": 1570496161.0,
            "replies": [
                {
                    "body": "I do, as long as I use it to blot my hair and squeeze out the excess water, it’s noticeable because it retains my waves. It just takes a few tries getting used to it and understanding that you shouldn’t aim to completely dry your hair while doing it. I used to rub my head with a towel before and that did was ruin my hair shape and turn it frizzy.",
                    "author": "Roof_rat",
                    "id": "f2zalj5",
                    "parent_id": "t1_f2yqqo3",
                    "score": 2,
                    "created_utc": 1570512345.0,
                    "replies": [
                        {
                            "body": "Alright! I think maybe I’ll just take the tees in my donation box and move them to the linen closet so that I have some dedicated hair-drying ones\n\nThanks for the tips!!",
                            "author": "feisty_weatherman",
                            "id": "f2zwkdo",
                            "parent_id": "t1_f2zalj5",
                            "score": 2,
                            "created_utc": 1570540589.0,
                            "replies": [
                                {
                                    "body": "Yup! Take one and just hang it in the bathroom, so it's there when you need it. It sucks to run around the house with wet hair!",
                                    "author": "Roof_rat",
                                    "id": "f30659s",
                                    "parent_id": "t1_f2zwkdo",
                                    "score": 2,
                                    "created_utc": 1570547287.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I shampoo when my hair feels gross. For me this means shampooing once every 1-3 weeks. I just wash it and forget about it, until my hair feels gross again.\n\nI use my fingers to style my hair. It's up to you, but harsher brushes can irritate your scalp if you brush your scalp too much. This is causes it to produce more oil. Honestly, it's just preference.\n\nThe Conditioner doesn't have silicones, so I'd take time to find a new shampoo that doesn't have sulfates or silicones. You should see any improvement.  Sodium Lauryl Sulfate or Sodium Laureth Sulfate are my enemy!!! The shit makes me reek of BO if I use a brand of soap of this stuff for my armpits, it's honestly toxic. Once you find one, use the gentler shampoo more regularly and treat the sulfate stuff as stronger stuff.\n\nI say to keep the sulfate shampoo because you may want to experiment with both shampoos, this will get you an idea on what you want to do next.",
            "author": "MindfulBullshit",
            "id": "f2x1les",
            "parent_id": "t1_f2wr2cq",
            "score": 6,
            "created_utc": 1570472727.0,
            "replies": [
                {
                    "body": "Thanks! Really appreciate the advice!",
                    "author": "Waltonruler5",
                    "id": "f2x4p3x",
                    "parent_id": "t1_f2x1les",
                    "score": 3,
                    "created_utc": 1570473738.0,
                    "replies": []
                },
                {
                    "body": "Just to confirm, would you aim to avoid silicones in conditioner like Dimethicone or Amodimethicone?",
                    "author": "lecoeurvivant",
                    "id": "jgm3470",
                    "parent_id": "t1_f2x1les",
                    "score": 1,
                    "created_utc": 1681740838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you use any product for styling? I’m assuming you let your hair air dry too?",
            "author": "HeatB719",
            "id": "f2z4qhe",
            "parent_id": "t1_f2wr2cq",
            "score": 2,
            "created_utc": 1570506428.0,
            "replies": [
                {
                    "body": "No styling product, and yep, air dryed.",
                    "author": "Waltonruler5",
                    "id": "f2z5e8n",
                    "parent_id": "t1_f2z4qhe",
                    "score": 1,
                    "created_utc": 1570507025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess any bodywash can do it. Why only 2 in 1 or 3 in 1?",
            "author": "Albema8",
            "id": "f2zqfkz",
            "parent_id": "t1_f2zektt",
            "score": 2,
            "created_utc": 1570535005.0,
            "replies": [
                {
                    "body": "Cleans the skin and leaves the hair softer than soap, which ultimately leads to happier and cleaner ass crack throughout the day.",
                    "author": "osm0sis",
                    "id": "f31rf1x",
                    "parent_id": "t1_f2zqfkz",
                    "score": 1,
                    "created_utc": 1570582767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thought someone would pick up on that lol. I say lazy because once you know what you're doing. You shampoo and do your thing and sit back for a few weeks and forget about it.",
            "author": "MindfulBullshit",
            "id": "f3281fd",
            "parent_id": "t1_f30c0a9",
            "score": 2,
            "created_utc": 1570596828.0,
            "replies": []
        },
        {
            "body": "I think some guys need to hear it from a guy. I think you're good 👍",
            "author": "Sherbert93",
            "id": "f2vo1dr",
            "parent_id": "t1_f2vmxmg",
            "score": 19,
            "created_utc": 1570455200.0,
            "replies": []
        },
        {
            "body": "I do use oils to help but it ends up making my hair too oily before my hair gets to what I want I have this anti frizz stuff for when I used to blow dry and straighten my hair I am gonna just put it in and see what it does\n\nA lot of stuff hasn’t worked well yet I can pm you some videos because pictures aren’t gonna do it justice",
            "author": "Superplant79",
            "id": "f2zaf00",
            "parent_id": "t1_f2vk2z0",
            "score": 3,
            "created_utc": 1570512133.0,
            "replies": [
                {
                    "body": "Yeah pm me man. I had a similar issue because I have thick dense hair that is naturally wavy/curly. \n\nIt depends how often you shampoo. As for me personally, only natural oils really helped combat that frizz.\n\nOh also blow drying and straightening hair will damage it. This will contribute to frizz and it boofing out",
                    "author": "MindfulBullshit",
                    "id": "f2zi5zt",
                    "parent_id": "t1_f2zaf00",
                    "score": 6,
                    "created_utc": 1570523221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Air dry has kept my curls the best but sometimes I wear a beanie for work and that turns it flat",
            "author": "Superplant79",
            "id": "f2za7w8",
            "parent_id": "t1_f2w2zsa",
            "score": 1,
            "created_utc": 1570511907.0,
            "replies": []
        },
        {
            "body": "What if you use hair product such as wax, can conditioner clean out the wax in my hair or do i have to use shampoo?",
            "author": "ahhWoLF",
            "id": "f2yd8cv",
            "parent_id": "t1_f2vst52",
            "score": 3,
            "created_utc": 1570489482.0,
            "replies": [
                {
                    "body": "No, the conditioner won't clean out the wax. I've moved away from most products because of that. However, water-based products will rinse out.\n\nHonestly, the only thing I really put in my hair now, which is rare, is a little non-comedogenic body lotion like Cerave or Cetaphil.",
                    "author": "OklaJosha",
                    "id": "f2zwqo6",
                    "parent_id": "t1_f2yd8cv",
                    "score": 2,
                    "created_utc": 1570540729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah my hair is different I’ve tried all but clay but my hair for the most part goes back into an immovable object only sometimes it’s “alright”",
            "author": "Superplant79",
            "id": "f2za9xz",
            "parent_id": "t1_f2yvgnd",
            "score": 1,
            "created_utc": 1570511973.0,
            "replies": [
                {
                    "body": "then go stronger? gel and mousse?",
                    "author": "untraiined",
                    "id": "f2zbfxj",
                    "parent_id": "t1_f2za9xz",
                    "score": 1,
                    "created_utc": 1570513362.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks",
            "author": "MoonManny",
            "id": "f2x8o47",
            "parent_id": "t1_f2x28mf",
            "score": 3,
            "created_utc": 1570474940.0,
            "replies": []
        },
        {
            "body": "I try to limit the harm by using the one with laureth because sulfate free stuff are pretty expensive in my country so kinda hard taking care on a budget",
            "author": "UPNova",
            "id": "f2x3q2p",
            "parent_id": "t1_f2wycpk",
            "score": 2,
            "created_utc": 1570473425.0,
            "replies": [
                {
                    "body": "There are natural alternatives you can try, I wouldn't give up hope. You can try a baking soda shampoo wash followed by an apple cider vinegar hair rinse.  I've heard success with using coconut oil as a conditioner or using egg yolk as a shampoo. \n\nLook into these 4 methods, before you give up!",
                    "author": "MindfulBullshit",
                    "id": "f2x60ii",
                    "parent_id": "t1_f2x3q2p",
                    "score": 2,
                    "created_utc": 1570474169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do, as long as I use it to blot my hair and squeeze out the excess water, it’s noticeable because it retains my waves. It just takes a few tries getting used to it and understanding that you shouldn’t aim to completely dry your hair while doing it. I used to rub my head with a towel before and that did was ruin my hair shape and turn it frizzy.",
            "author": "Roof_rat",
            "id": "f2zalj5",
            "parent_id": "t1_f2yqqo3",
            "score": 2,
            "created_utc": 1570512345.0,
            "replies": [
                {
                    "body": "Alright! I think maybe I’ll just take the tees in my donation box and move them to the linen closet so that I have some dedicated hair-drying ones\n\nThanks for the tips!!",
                    "author": "feisty_weatherman",
                    "id": "f2zwkdo",
                    "parent_id": "t1_f2zalj5",
                    "score": 2,
                    "created_utc": 1570540589.0,
                    "replies": [
                        {
                            "body": "Yup! Take one and just hang it in the bathroom, so it's there when you need it. It sucks to run around the house with wet hair!",
                            "author": "Roof_rat",
                            "id": "f30659s",
                            "parent_id": "t1_f2zwkdo",
                            "score": 2,
                            "created_utc": 1570547287.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks! Really appreciate the advice!",
            "author": "Waltonruler5",
            "id": "f2x4p3x",
            "parent_id": "t1_f2x1les",
            "score": 3,
            "created_utc": 1570473738.0,
            "replies": []
        },
        {
            "body": "Just to confirm, would you aim to avoid silicones in conditioner like Dimethicone or Amodimethicone?",
            "author": "lecoeurvivant",
            "id": "jgm3470",
            "parent_id": "t1_f2x1les",
            "score": 1,
            "created_utc": 1681740838.0,
            "replies": []
        },
        {
            "body": "No styling product, and yep, air dryed.",
            "author": "Waltonruler5",
            "id": "f2z5e8n",
            "parent_id": "t1_f2z4qhe",
            "score": 1,
            "created_utc": 1570507025.0,
            "replies": []
        },
        {
            "body": "Cleans the skin and leaves the hair softer than soap, which ultimately leads to happier and cleaner ass crack throughout the day.",
            "author": "osm0sis",
            "id": "f31rf1x",
            "parent_id": "t1_f2zqfkz",
            "score": 1,
            "created_utc": 1570582767.0,
            "replies": []
        },
        {
            "body": "Yeah pm me man. I had a similar issue because I have thick dense hair that is naturally wavy/curly. \n\nIt depends how often you shampoo. As for me personally, only natural oils really helped combat that frizz.\n\nOh also blow drying and straightening hair will damage it. This will contribute to frizz and it boofing out",
            "author": "MindfulBullshit",
            "id": "f2zi5zt",
            "parent_id": "t1_f2zaf00",
            "score": 6,
            "created_utc": 1570523221.0,
            "replies": []
        },
        {
            "body": "No, the conditioner won't clean out the wax. I've moved away from most products because of that. However, water-based products will rinse out.\n\nHonestly, the only thing I really put in my hair now, which is rare, is a little non-comedogenic body lotion like Cerave or Cetaphil.",
            "author": "OklaJosha",
            "id": "f2zwqo6",
            "parent_id": "t1_f2yd8cv",
            "score": 2,
            "created_utc": 1570540729.0,
            "replies": []
        },
        {
            "body": "then go stronger? gel and mousse?",
            "author": "untraiined",
            "id": "f2zbfxj",
            "parent_id": "t1_f2za9xz",
            "score": 1,
            "created_utc": 1570513362.0,
            "replies": []
        },
        {
            "body": "There are natural alternatives you can try, I wouldn't give up hope. You can try a baking soda shampoo wash followed by an apple cider vinegar hair rinse.  I've heard success with using coconut oil as a conditioner or using egg yolk as a shampoo. \n\nLook into these 4 methods, before you give up!",
            "author": "MindfulBullshit",
            "id": "f2x60ii",
            "parent_id": "t1_f2x3q2p",
            "score": 2,
            "created_utc": 1570474169.0,
            "replies": []
        },
        {
            "body": "Alright! I think maybe I’ll just take the tees in my donation box and move them to the linen closet so that I have some dedicated hair-drying ones\n\nThanks for the tips!!",
            "author": "feisty_weatherman",
            "id": "f2zwkdo",
            "parent_id": "t1_f2zalj5",
            "score": 2,
            "created_utc": 1570540589.0,
            "replies": [
                {
                    "body": "Yup! Take one and just hang it in the bathroom, so it's there when you need it. It sucks to run around the house with wet hair!",
                    "author": "Roof_rat",
                    "id": "f30659s",
                    "parent_id": "t1_f2zwkdo",
                    "score": 2,
                    "created_utc": 1570547287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup! Take one and just hang it in the bathroom, so it's there when you need it. It sucks to run around the house with wet hair!",
            "author": "Roof_rat",
            "id": "f30659s",
            "parent_id": "t1_f2zwkdo",
            "score": 2,
            "created_utc": 1570547287.0,
            "replies": []
        }
    ]
}