{
    "title": "Yes, It's A Scam and This is how It Works",
    "post_id": "au8gs5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/au8gs5/yes_its_a_scam_and_this_is_how_it_works/",
    "author": "LaSirene23",
    "body": "If you receive a suspicious message from someone you've never met offering to send you large sums of money please proceed with caution.\n\nThe message might've been sent by an individual attempting advance-fee fraud, also called the “419 scam.”\n\n**What to look out for**\n\nIn combination, the following characteristics may indicate that you're dealing with a scammer:\n\n**Does he/she:**\n\n* Use odd phrases, or strange formatting in the conversation? \n\n* Offer to send you more money than you are asking for? This is known as an overpayment scam and is described under How the Scam Appears below. \n\n* Say they are a traveling businessperson, an oceanographer, out of the country, want to start providing for you before you meet or away at sea? \n\n* Insist you reply via a personal email address, off of SA or whatever site they originally contacted you on? A SD/SM who immediately insists on communicating off of site may be questionable. \n\n* Seem to not have read or looked at your profile, based on their vague questions? \n\n* Insist on sending you a check, your bank login information, your credit card login information, or offers you their bank account information to pay off debt, etc.\n\n* Asks you to send some of the money to someone else. An employee, charity, etc before the money has cleared. \n\n* Asks you to purchase gift cards and give him/her the code on the back before the money has cleared. \n\n* Wants to put you on his/her payroll. \n\n**How the scam appears**\n\nThe scammer will attempt to convince you to accept a fake payment for more than the allowance amount you initially agreed to/was offered by him/her. If they are successful, the scammer will get the money/or gift card value. In nearly every case, the con artist will not be caught.\n\n**Here's an example of how the scam can play out:**\n\nYou get the attention of a 419 scammer. They offer you an allowance amount with no request to meet up, excuse why they can't now, or an online arrangement. They tell you an allowance amount that is too good to be true, $1,000 a week but then sends you $1,800. They want you to send the extra money to someone else via Western Union, Money Gram, etc, because they can't right now(even though they just sent some to you). Or they want you to purchase itune, amazon, google play gift cards and send them the number on the back.\n\nYou deposit the $1,800 into your bank and then spend $800 doing the favors for the scammer. Or pay off your credit card with the info they gave you and used the card to make gift card purchases for the scammer. The scammer counts on you doing this before the check officially clears your bank account. This window between deposit and processing is known as “float time” and can last seven days, ten days, or even longer if the payment is international. During this time the money can be transferred, but it has not been verified by your bank as real. \n\nOnce the payment is processed, your bank will determine that it is fake. They will take the entire $1,800 back from you. Since you will have already spent the $800 for the scammer, you must repay the bank $800 of your own money. If you have spent any of the $1,000 you thought you earned, you will also need to replace that. In the case of the credit card you will owe the full balance you thought was payed off plus any purchases you made on behalf of the scammer. \n  \n\n**Why does this scam work?**\n\nThese scammers typically create multiple accounts on dating and social media sites and send the same message  to many different people with little or no personalization. The scammer's messages are meant to trigger greed and over ride common sense.\n\nThe scammer’s payment is a forgery. It is not real!  Your bank may allow you to deposit it, or your credit card might say payment received but the payment will not clear. Your bank will hold you responsible for the entire amount.\n\nIn the case of a PayPal payment, the scammer will either send a fake PayPal confirmation email or pay with a fraudulent payment source. Whether you return the “overpayment” via PayPal or a wire transfer service such as Western Union or Money Gram, you will still be held responsible for all of the money involved.\n\nRemember: Money sent back to the scammer is money which is lost forever.\n\n**What you should do**\n\n* Do not respond to the messages. Don't engage these scammers for any reason. Responding will encourage the scammers and cause you to receive further scam messages.\n\n* Report the account messaging you if that is an option. \n\n* If you've already given out your personal login information contact your bank immediately and let them know you believe your account may be compromised. Follow their security protocols for securing your account. \n\n* If you've already sent money or gift cards, still contact your bank but you're pretty much screwed. You'll owe the money spent even if it was an empty account created especially for this purpose. And you may have your accounts shutdown for fraudulent activities or owe additional fees.\n\n**Other scams:**\n\n\n* He asks you anything about your bank account -- the account number so that he can do a transfer, the bank, or the username/password\n\n* He wants you to pick up a vanilla card or any sort of reloadable visa card or gift card\n\n* He wants to put you on the payroll or otherwise pay you through his business\n\n* He wants to send you a check or picture of a check to deposit\n\n* He wants to send you a payment but wants you to send back some of it in the form of a gift card or any other way, or to send some on to a different account\n\n* He wants you to install \"blockchain\"\n\n* He can only do mobile deposit (he'll have some story as to why -- venmo has given him trouble, he's gotten ripped off through paypal, etc)\n\n* He can only send allowance through some obscure mechanism -- bitcoin, blockchain, discovery account, etc. The mechanism itself will change, it's the fact that he's picked one this one mechanism that is not cash, that you need to look for\n\n* He wants your login info for any currency transfer app or mechanism\n\n* He has not met you yet, or gotten any value from the relationship at all, but he wants to transfer large sums to you or pay off your credit cards or loans\n\n* He gives you his credit card or bank account # and tells you to use them or transfer money out of them\n\n* He's looking for platonic, but wants to send large sums to you\n\n* He wants to use you as his personal assistant, he'll send money to you, and your job will be to pass that money on to others\n\n* He'll start sending you a large allowance, but you need to send him a little money first to verify you are real and establish trust (any \"prove you are real\" \"prove you are serious\" obligation is a scam)\n\n* You need to pay money, for any reason whatsoever, in order to collect your allowance\n\n* He sends you pics of documents that would completely compromise him and his security (e.g., his DL, his Passport) in advance\n\n* He pretends to try to use an app to send money, then shows you screenshots of how it failed, in order to manipulate you into using his transfer method of choice (usually credit or gift card, or pic of check)\n\n* He's going to pay you an allowance but allowance won't start until the middle or end of the month (he's going to collect his month of free sex and then ghost)\n\n* You're a male SB and an SM who you have never met wants to send you money\n\n\n**Could be a scam:**\n\n* It's the very beginning of an arrangement and he wants to use venmo, cashapp, or paypal instead of cash, to send you allowance (this is not a red flag if sending a smaller symbolic gift). Despite popular belief, all three of those are reversible. Cash is best at the beginning.\n\n* Man claiming to be an SD randomly approaches you on Instagram (nearly all instagram stories end up being scams). SD emphasizes he wants some combination of loyalty, trust, honesty: very common reverse psychology ploy, before the scam starts, and a common element of the scammer script.\n\n* She wants you to venmo money before the M&G (to pay for gas, or her nails, etc) or due to a sudden crisis (e.g., flat tire)\n\n* She wants you to send her money before you've met, and/or as a condition of meeting, to \"prove you're serious\"\n\n* She has a crisis (family emergency, a bill to pay) and needs you to send her money, before you've ever met\n\n* She requires you give her the full allowance or PPM at the beginning of the date (e.g., when she gets to the restaurant) rather than when you get to the room\n\n\nThe rules change once you're in an established arrangement and have earned trust. The rules are slightly different in non-US countries also, where some forms of bank transfer are safer... but still, it makes little sense not to start with cash, which is safe.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/au8gs5/yes_its_a_scam_and_this_is_how_it_works/",
    "score": 359,
    "upvote_ratio": 1.0,
    "created_utc": 1551018804.0,
    "num_comments": 113,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "eh6d0iw",
            "parent_id": "t3_au8gs5",
            "score": 76,
            "created_utc": 1551020655.0,
            "replies": [
                {
                    "body": "Has anyone gotten the : “I’m in business meetings all day and really want to meet you. I’m going to email you a check so you can make a copy and scan in to deposit in your bank account “ I reported his cheesy ass ",
                    "author": "rhea2449770",
                    "id": "ei1feli",
                    "parent_id": "t1_eh6d0iw",
                    "score": 24,
                    "created_utc": 1552008874.0,
                    "replies": [
                        {
                            "body": ">check\n\nWhat is the danger in this if I wait until after the check clears? I deposited a check from my mobile banking phone app this way from a sugar momma a few days ago. The funds are in my account now. Am I in danger? She sent over a scanned copy.",
                            "author": "reciphered",
                            "id": "eraqma7",
                            "parent_id": "t1_ei1feli",
                            "score": 2,
                            "created_utc": 1560650543.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> Is there a way\n\nYes I agree!\n\n/u/LaSirene23 can we add a link to this post to the content that our wonderful bot posts?",
                    "author": "girlz_are_42",
                    "id": "eh6dw71",
                    "parent_id": "t1_eh6d0iw",
                    "score": 2,
                    "created_utc": 1551021408.0,
                    "replies": [
                        {
                            "body": "Will discuss it with our Bot expert",
                            "author": "LaSirene23",
                            "id": "eh6g57v",
                            "parent_id": "t1_eh6dw71",
                            "score": 3,
                            "created_utc": 1551023278.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted about a scam. \n\nIt is a scam if:\n\n* Someone wants your bank account information\n\n* Someone wants your bank log in information\n\n* Someone wants to send you a check to cash\n\n* Someone wants you to buy gift cards to send back to them\n\n* Someone wants to give you lots of money without ever meeting\n\nAlso please see [previous questions about scams.](https://www.reddit.com/r/sugarlifestyleforum/search?q=scam&sort=new&restrict_sr=on) \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "eh6awz0",
            "parent_id": "t3_au8gs5",
            "score": 32,
            "created_utc": 1551018804.0,
            "replies": [
                {
                    "body": "Really great advice!",
                    "author": "craftyUrbanite82",
                    "id": "eie9rgh",
                    "parent_id": "t1_eh6awz0",
                    "score": 2,
                    "created_utc": 1552438019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always see a lot of negativity towards people that either fall for these scams or even don't immediately recognize that it is a scam and it really bothers me.\n\nYou see the same scams over and over because they work so more people fall for this shit than you'd think. They rely on basic human traits that we all possess. Greed (not necessarily positive, but most people do possess it), desperation, fear, and trust being the most common. How many people don't realize a check \"clearing\" does not actually mean the money has cleared? I've taken informal polls in person and almost no one realizes that.\n\nI'm not talking about being annoyed by people not searching before asking a question. That is justified annoyance. I am talking about criticizing someone for \"not knowing better\". \n\nSo if you're reading this and one of the people that look down on those that fall for scams, I hope it at least gives you pause and starts to change your mind. I figure since this is a sticky my little rant fit. Anyway, rant over!",
            "author": "sexviewer",
            "id": "eh6utjg",
            "parent_id": "t3_au8gs5",
            "score": 29,
            "created_utc": 1551034093.0,
            "replies": [
                {
                    "body": ">I always see a lot of negativity towards people that either fall for these scams or even don't immediately recognize that it is a scam and it really bothers me.\n\nI agree.  I've noticed some of the mocking and condescension and I think it's really rubbing salt in the wounds of the unlucky women who have fallen victim to this.  It's even more disappointing that they're treated this way when they were hoping for financial help and instead have been taken advantage of.",
                    "author": null,
                    "id": "eh905e5",
                    "parent_id": "t1_eh6utjg",
                    "score": 6,
                    "created_utc": 1551109343.0,
                    "replies": [
                        {
                            "body": "I agree. I wonder how many of those people have been in a very rough financial spot. Like, unable to pay your bills tough. I feel fortunate that I had to go through that now that I'm on the other side. This applies to both SB and SD too. Never struggling to the point of desperation is not a SD exclusive trait after all.\n\nAlternatively it could be the attitude of \"well, I did it so anyone can\" which is slightly better, but still a very narrow view that assumes their situation and opportunities were similar enough to be comparable. ",
                            "author": "sexviewer",
                            "id": "eh98m0n",
                            "parent_id": "t1_eh905e5",
                            "score": 4,
                            "created_utc": 1551115395.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Scammers actually make their scams more obvious to filter out the smart people who will waste their time and catch on later. So the scam messages and things are tuned to appeal to people who are dumb enough to fall for it initially and keep falling for it. I agree it is still not polite to be mean to people who fall for them. \n\nCitation: a Microsoft research paper on this topic. ",
                    "author": "tra24602",
                    "id": "eh7djda",
                    "parent_id": "t1_eh6utjg",
                    "score": 7,
                    "created_utc": 1551047052.0,
                    "replies": [
                        {
                            "body": "Some are like that you're right, but there are still plenty that do not use that filtering technique and try to make the scam as convincing as possible. I have seen bright and not naive people fall for scams before and have seen samples people have posted that are very convincing.\n\nHere is one example: https://mypolice.qld.gov.au/blog/2017/11/13/new-email-scam-using-fake-paypal-website/\n\nVs\n\nwww.liverpoolecho.co.uk/news/liverpool-news/customers-warned-over-new-paypal-13183145.amp\n\nAs you can see one is filled with errors and the other appears to be more legit. They also will tend to use the obvious errors in the first step only and make everything after you're talking to them look more real. So the first contact may be riddled with errors, but all the \"evidence\" they later send to you is meant to look very real.",
                            "author": "sexviewer",
                            "id": "eh7fdnk",
                            "parent_id": "t1_eh7djda",
                            "score": 2,
                            "created_utc": 1551048357.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you for this comment. I’m a newbie at this whole thing. And I considered myself a very smart girl. Yet here I am, with negative almost 2 grand in my bank account. I literally had $7 to my name when I tried to find a sugar daddy. And now I can’t even make a phone payment. I feel like the stupidest person in the world right now.",
                    "author": "fireyswanjello25",
                    "id": "izukpx4",
                    "parent_id": "t1_eh6utjg",
                    "score": 2,
                    "created_utc": 1670801078.0,
                    "replies": []
                },
                {
                    "body": "What is a good Method to receive payment? \nSorry I’m randomly replying to you",
                    "author": "realhero123",
                    "id": "eno0a36",
                    "parent_id": "t1_eh6utjg",
                    "score": 1,
                    "created_utc": 1557953315.0,
                    "replies": [
                        {
                            "body": "You don't have to apologize at all! The best way is paper cash. There are some other secure methods that can't be reversed, but they are more complex and easier to fake.\n\nFor example: western union. If someone wanted to pay via western union, how confident are you that you will understand the process and detect red flags? Unless you use it regularly the answer should be \"not very\". Wire transfers are also secure, but anyone offering that is 99% of the time a scammer (they need your bank info).\n\nSo, really your only option is cash. Cashapp and venmo can be reversed. Paypal is ridiculously easy to reverse.",
                            "author": "sexviewer",
                            "id": "enofgf0",
                            "parent_id": "t1_eno0a36",
                            "score": 1,
                            "created_utc": 1557958634.0,
                            "replies": [
                                {
                                    "body": "How do sugar mommies or daddies actually pay, from their own savings or like from a company.\n\nSo the best way is for them to meet you with cash each week?\n\nAlso would a prepaid card work?",
                                    "author": "realhero123",
                                    "id": "enoioas",
                                    "parent_id": "t1_enofgf0",
                                    "score": 1,
                                    "created_utc": 1557959800.0,
                                    "replies": [
                                        {
                                            "body": "I withdraw cash from my checking account. I can't speak for how married SD do it. If anyone offers to out you on the payroll, do not agree. Prepaid cards can work, but you could also get scammed easier and cash is just as easy for the sd anyway so they have no reason not to use cash.",
                                            "author": "sexviewer",
                                            "id": "enolzwr",
                                            "parent_id": "t1_enoioas",
                                            "score": 2,
                                            "created_utc": 1557961021.0,
                                            "replies": [
                                                {
                                                    "body": "Ok thanks for the advice I’ll make it clear I want my payment in cash",
                                                    "author": "realhero123",
                                                    "id": "enon7tk",
                                                    "parent_id": "t1_enolzwr",
                                                    "score": 1,
                                                    "created_utc": 1557961489.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I have another question, you pay each time you meet, not a “weekly allowance”, right?\n\nAlso do you know the average amount of payment in NY? For sugar babies(men and woman)?\n\nThanks",
                                                    "author": "realhero123",
                                                    "id": "entobgn",
                                                    "parent_id": "t1_enolzwr",
                                                    "score": 1,
                                                    "created_utc": 1558045196.0,
                                                    "replies": [
                                                        {
                                                            "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
                                                            "author": "sexviewer",
                                                            "id": "entwkc9",
                                                            "parent_id": "t1_entobgn",
                                                            "score": 1,
                                                            "created_utc": 1558048714.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Can cashapp be reversed? Is that true?",
                                    "author": "kandiikittenx",
                                    "id": "exg4ip8",
                                    "parent_id": "t1_enofgf0",
                                    "score": 1,
                                    "created_utc": 1566255301.0,
                                    "replies": [
                                        {
                                            "body": "Not easily, but yes it can. Why not just do cash? It's by far the safest and once you establish trust you can move to digital payments instead.",
                                            "author": "sexviewer",
                                            "id": "exg7ek8",
                                            "parent_id": "t1_exg4ip8",
                                            "score": 1,
                                            "created_utc": 1566257137.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not in the whole SD/SM thing, but I 've always wondered what happens if you spend the (non-existent) check money and then close the account before the account goes negative, and I don't know where to ask.",
                    "author": "Pic889",
                    "id": "es1gx68",
                    "parent_id": "t1_eh6utjg",
                    "score": 1,
                    "created_utc": 1561496550.0,
                    "replies": [
                        {
                            "body": "Either they will not allow you to close it with pending checks still out there or they will and then come after you to give them the money you owe. If you do not pay them back they will sell your debt into collections. At that point it is no different than any other debt that was sold to a collection agency.",
                            "author": "sexviewer",
                            "id": "es1sq4b",
                            "parent_id": "t1_es1gx68",
                            "score": 1,
                            "created_utc": 1561504784.0,
                            "replies": [
                                {
                                    "body": "\"What happens if I commit fraud?\"",
                                    "author": "ulyssesjack",
                                    "id": "ii6pehu",
                                    "parent_id": "t1_es1sq4b",
                                    "score": 1,
                                    "created_utc": 1659133057.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Its not about technology and how bank accounts work. It's about common sense:\n\n\\-Why would you ever do something online with money with someone you have never met. Cash should be exchanged in person.\n\n\\-Why would you send money to someone who is supposed to be sending you money. Is that part not a little suspicious?\n\n\\-Why would you jump through hoops with someone you have never met?\n\n\\-Can you not tell that their speech style is very robotic, non-personalized, non-responsive, and insincere?",
                    "author": "DoomAndSouls",
                    "id": "er006zu",
                    "parent_id": "t1_eh6utjg",
                    "score": 1,
                    "created_utc": 1560408724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I keep getting \"I can no longer use the cash apps\" with some story about being scammed previously and therefore the bank won't allow it. Possibly believable, until 5 guys within a day say the same thing. Super frustrating, because I'm pretty desperate right now :(",
            "author": "GoddessMaygin",
            "id": "ehq4ko2",
            "parent_id": "t3_au8gs5",
            "score": 11,
            "created_utc": 1551649855.0,
            "replies": []
        },
        {
            "body": "> ⁣I’m looking for a sugar baby to spoil and take care of this is my number XXXXXXXXXX text me \n\nDoes anyone really would like a Sugar Daddy that has no clue about punctuation?\n\nScam.\n\n&#x200B;",
            "author": "Wolpar",
            "id": "ej2thbx",
            "parent_id": "t3_au8gs5",
            "score": 10,
            "created_utc": 1553209397.0,
            "replies": []
        },
        {
            "body": "It's a shame ,last year I got real SD's trying to make arrangements, this year all I got was spam accounts. :((( ",
            "author": "Amunn_Rahh",
            "id": "eimcgm1",
            "parent_id": "t3_au8gs5",
            "score": 6,
            "created_utc": 1552686563.0,
            "replies": []
        },
        {
            "body": "I’m so glad this has been posted! I’ve recently almost been scammed twice and I I wish that I had seen this earlier so I didn’t spend so much time researching, lol.",
            "author": "ineedanothershot",
            "id": "eh7x2db",
            "parent_id": "t3_au8gs5",
            "score": 5,
            "created_utc": 1551063177.0,
            "replies": []
        },
        {
            "body": "Thank you for writing about this. I encountered a woman online who told me she would give me $400 every 4 days and all I had to do was talk to her and buy Sephora gift cards. She had me make a First Tech Federal Credit Union account so that I could trust her since its an empty account. Shes been asking for my login info for the past few hours now and I'm not giving it, because all my private information is still there. Thank you, I have now noticed that it is in fact, a scam.",
            "author": "POACB",
            "id": "ek7gxb7",
            "parent_id": "t3_au8gs5",
            "score": 5,
            "created_utc": 1554500113.0,
            "replies": [
                {
                    "body": "You're welcome :-) Glad you found this helpful. ",
                    "author": "LaSirene23",
                    "id": "ek7tfvu",
                    "parent_id": "t1_ek7gxb7",
                    "score": 2,
                    "created_utc": 1554510043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How on Earth are people under the age of 60 still falling for this in 2019?\n",
            "author": null,
            "id": "eh6k4i6",
            "parent_id": "t3_au8gs5",
            "score": 11,
            "created_utc": 1551026210.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eh6l1h9",
                    "parent_id": "t1_eh6k4i6",
                    "score": 8,
                    "created_utc": 1551026894.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eh7a6ui",
                            "parent_id": "t1_eh6l1h9",
                            "score": 16,
                            "created_utc": 1551044692.0,
                            "replies": [
                                {
                                    "body": "Perfect comment. Well off people will never know the kind of desperation that drives people to fall for something like this. A lot of people view sugaring as a desperate move too actually. And in some cases it definitely is.",
                                    "author": "Cookie_Duchess",
                                    "id": "eh7eyr7",
                                    "parent_id": "t1_eh7a6ui",
                                    "score": 11,
                                    "created_utc": 1551048067.0,
                                    "replies": []
                                },
                                {
                                    "body": "The presumption here is that people who are well-off have never struggled...or the idea that the well off dont fall for these scams either. \nNaivity is not bound by class, race, sex etc...",
                                    "author": "A_Good_Decision",
                                    "id": "eh81rxp",
                                    "parent_id": "t1_eh7a6ui",
                                    "score": 2,
                                    "created_utc": 1551067246.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well then they deserve to get duped for being dense.",
                            "author": null,
                            "id": "eh6l618",
                            "parent_id": "t1_eh6l1h9",
                            "score": 0,
                            "created_utc": 1551026988.0,
                            "replies": [
                                {
                                    "body": "Seriously? This is exactly the attitude of a scammer or con artist.",
                                    "author": null,
                                    "id": "eh904yl",
                                    "parent_id": "t1_eh6l618",
                                    "score": 6,
                                    "created_utc": 1551109333.0,
                                    "replies": [
                                        {
                                            "body": "No because I know it's wrong and wouldn't ever do something like that. Just because one *can* do something doesn't mean they should or will. ",
                                            "author": null,
                                            "id": "eh90gg3",
                                            "parent_id": "t1_eh904yl",
                                            "score": 2,
                                            "created_utc": 1551109571.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All this. \nJust like when a scammer told me to send the extra money to \"motherless baby home\"",
            "author": "the-guild-banaynay",
            "id": "eh7qqtv",
            "parent_id": "t3_au8gs5",
            "score": 3,
            "created_utc": 1551057828.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ejczdvp",
            "parent_id": "t3_au8gs5",
            "score": 3,
            "created_utc": 1553541625.0,
            "replies": [
                {
                    "body": "I’ve just experienced something similar, and that’s why I came to this forum to read around.\n\nMine was a little different - he gave account information for me to pay off a credit card, which should clear tomorrow - and simply asked that I show a screenshot. So I figured I would do it, as this was his offering to build trust before I travel out of state to see him. Once I did that he said that he wants to know trust goes both ways, and for me to get 3 $100 Amazon gift cards in the morning once it’s clear, and then pay that $300 off.\n\n(Edit: I told him I wasn’t comfortable about the gift cards because of scammers, and he said he’s sorry for pressuring me and I don’t have to do it. If this payment is reversed, there’s no way I’m going to be on the hook for going *over* my credit limit!)\n\nNow I’m terrified I fucked up by making the payment though I have proof via text that it’s something else. This is my first encounter with sugaring online, which is discouraging.",
                    "author": "issitohbi",
                    "id": "em6j4za",
                    "parent_id": "t1_ejczdvp",
                    "score": 1,
                    "created_utc": 1556666841.0,
                    "replies": [
                        {
                            "body": "this happened to my friend, bank will reverse charge probably... just be ready for that",
                            "author": "buckeyebil1",
                            "id": "em8o5iy",
                            "parent_id": "t1_em6j4za",
                            "score": 2,
                            "created_utc": 1556731130.0,
                            "replies": [
                                {
                                    "body": "If they reverse it, that’s fine. I just hope it won’t be reported as fraud to my card company, as through some reading I’ve heard they’ll shut them out. I’m so sad because this is work I want to get into but I have no real guidance; to know that I’ve screwed up so badly. Ah.\n\nDid they close your friend’s account?",
                                    "author": "issitohbi",
                                    "id": "em8pun8",
                                    "parent_id": "t1_em8o5iy",
                                    "score": 1,
                                    "created_utc": 1556732060.0,
                                    "replies": [
                                        {
                                            "body": "they didnt shut my friends account...i suppose its possible, but probably not if you just do it once",
                                            "author": "buckeyebil1",
                                            "id": "em9gmk3",
                                            "parent_id": "t1_em8pun8",
                                            "score": 1,
                                            "created_utc": 1556747138.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm worried I'm getting into the same scam. My Sugar Momma gave me her account info to pay off my credit card, which did clear yesterday. Now she wants me to buy her 5 $200 gift cards so that she can reward her employees with them for finishing a big construction project. She says she can't do it herself b/c she doesn't trust bank cards, or \"apps,\" and can't make it to the store. Is it possible for her bank to reverse the paying off of my credit card? Is that reversible?",
                            "author": "reciphered",
                            "id": "eramoes",
                            "parent_id": "t1_em6j4za",
                            "score": 1,
                            "created_utc": 1560647896.0,
                            "replies": [
                                {
                                    "body": "It might not even be her account. So a few weeks after mine cleared, the bank of whoever it belonged to bounced it as an unauthorized charge. My card was fine, I just had to pay the balance as I would have, but they did an audit and last week closed my account for fraud because I didn’t have authorization to use that account - because it was removed by the bank as unauthorized. I’m sorry to hear you were scammed as well :(",
                                    "author": "issitohbi",
                                    "id": "eramur8",
                                    "parent_id": "t1_eramoes",
                                    "score": 1,
                                    "created_utc": 1560648010.0,
                                    "replies": [
                                        {
                                            "body": "Oh no, that's terrifying! Did the accidental fraud hurt your credit score? Did you get to keep the funds in your account when they closed it? Were you able to open a new account. I hadn't even considered that she might be using someone else's account to scam me. This has been my first encounter with sugaring and it's starting to feel like I need an education in finance just to sugar!",
                                            "author": "reciphered",
                                            "id": "eranjfr",
                                            "parent_id": "t1_eramur8",
                                            "score": 2,
                                            "created_utc": 1560648471.0,
                                            "replies": [
                                                {
                                                    "body": "It wasn’t my first experience with sugaring or my first that started online, but it was definitely new to me to be scammed like this! Don’t feel bad or discouraged. Answering your questions:\n\n- I had $570 of a $1,000 balance available, I now have $0 available and am paying off the amount I had used plus the bounced payment fee\n\n- I have accounts with two other major credit companies and two stores, so I don’t plan to open another account right now because that will show me as seeking too actively\n\n- The app for that specific card would report my credit score, it was last 680. (I’m new to credit building so this was very high for me!) I’m not sure if there’s variation across different methods of checking the score, but my other major credit card reports through someone else. My score as shown by that company is now 630. Because I just set up the credit check though, I don’t know if it was higher or a variation thing. My mom and partner who have authorization to use my card(s) don’t have a drop in score, though. I was told authorizing them would bind the credit scores.\n\nWhat’s funny is that I went to school for Accounting, yet here I am. Ironic.\n\nEdit: listed 650 instead of 630",
                                                    "author": "issitohbi",
                                                    "id": "erasne1",
                                                    "parent_id": "t1_eranjfr",
                                                    "score": 1,
                                                    "created_utc": 1560651973.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
                                                            "author": "reciphered",
                                                            "id": "eray0qs",
                                                            "parent_id": "t1_erasne1",
                                                            "score": 1,
                                                            "created_utc": 1560655729.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great explanation! I would also include a note about how just because they give you access to a bank account doesn't mean that *they* are the owner of said bank account. I see posts here sometimes like \"well he isn't sending me money, he gave me his bank details.\" \n\nWhy do you think that's his????? Why would someone with money find a random person on the internet to buy them gift cards? Truly wealthy people have EAs for a reason. ",
            "author": "2catsandacomputer",
            "id": "eh6g7du",
            "parent_id": "t3_au8gs5",
            "score": 6,
            "created_utc": 1551023326.0,
            "replies": [
                {
                    "body": "> Insist on sending you a check, your bank login information, your credit card login information, **or offers you their bank account information to pay off debt,** etc.\n\nThanks!  I included that. Do you think it should have a separate bullet point? \n",
                    "author": "LaSirene23",
                    "id": "eh6iqh1",
                    "parent_id": "t1_eh6g7du",
                    "score": 1,
                    "created_utc": 1551025196.0,
                    "replies": [
                        {
                            "body": "Ooh, I missed it. \n\nProbably not. Newbies won't read it anyway :( ",
                            "author": "2catsandacomputer",
                            "id": "eh6m2gs",
                            "parent_id": "t1_eh6iqh1",
                            "score": 4,
                            "created_utc": 1551027670.0,
                            "replies": []
                        },
                        {
                            "body": "100%!",
                            "author": "craftyUrbanite82",
                            "id": "eie8je4",
                            "parent_id": "t1_eh6iqh1",
                            "score": 1,
                            "created_utc": 1552437171.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And here is [how you deal with 419 scammers](https://www.419eater.com/scamtracker/index.php?typeofscam=Auction%2FClassifieds+Scam&cluster=20&submit=Set+Filter)",
            "author": "imjgaltstill",
            "id": "eh6pofn",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1551030359.0,
            "replies": []
        },
        {
            "body": "What about accepting in bitcoin only 🤔?",
            "author": "LillyXcX",
            "id": "ehsrp35",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1551738234.0,
            "replies": [
                {
                    "body": "Had someone offer this! Said they would prefer PayPal or similar, but that their account had been involved in a scam and was shut down even though it wasn’t them.",
                    "author": "issitohbi",
                    "id": "em6k5c5",
                    "parent_id": "t1_ehsrp35",
                    "score": 1,
                    "created_utc": 1556667477.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've just gotten back into the lifestyle and on SA and I can't tell you how many girls on there, somehow, realize I'm OK to ask for advice. So many new girls and I tell them most of what you just said here.",
            "author": "peoplesmeeple",
            "id": "ejjtplg",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1553746160.0,
            "replies": []
        },
        {
            "body": "I’m loving his forum btw so I’m brand new to this lifestyle signed up on a SD/SM site maybe a week ago now and I’ve been getting messages like this and other similar ones like it I’m speaking with this one but he’s on and off reading and replying he seemed out of interest after he randomly asked me how are my credit card bills ? I replied it’s actually good I only had one credit card my whole life and it’s paid off .. then he just stopped relying I tried starting another convo but he keeps leaving me hanging and then other messages on the site I’m in I get are very similar to this when I message them on the site just different number or contact they’re just not wanting to just talk on the site itself for some reason.  Pleas let me know if you know these are scams thanks in advance . \n\nUPDATE!! I tried uploading an image to show you guys the message I’m talking about but it looks like I can’t upload it and I can just post links ?",
            "author": null,
            "id": "ekki4rm",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1554923087.0,
            "replies": []
        },
        {
            "body": "Today I had a gentleman give me his info and tell me to use it to pay off my credit card debt. I did it and now I'm super paranoid.",
            "author": "Manawisp",
            "id": "emsqrdj",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1557284845.0,
            "replies": []
        },
        {
            "body": "Thanks for sharing this. I was very gullible at the start and fell for it. PayPal was actually amazing at getting my stolen money back, my bank just closed my account as fraud. \n\nThat sucked, got a new bank and avoiding these jerk scammers... until they figure something else out huh?",
            "author": "Inekkink",
            "id": "eomx5cl",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1558697934.0,
            "replies": []
        },
        {
            "body": "Why would a rich guy do anything until he meets you. Makes absolutely no sense. No free lunches folks.",
            "author": "dialecticwizard",
            "id": "etexk5f",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1562751743.0,
            "replies": []
        },
        {
            "body": "Nearly fell for this. A \"SM\" from SA wanted me to buy a prepaid debit card so she could put it on her payroll.  \n\nShe says she works in pharmaceuticals in Florida, going through a divorce, didn't send a photo. I feel like those are all cookie cutter things to say and sort of red flags. What got me was that she texted like a normal person and not like the usual scammers who can barely format English sentences.  \n\nWell, I did buy the card but didn't share any of the info. It's non-refundable so I guess I'm taking a loss on the cost of the card and the $20 starting deposit. It's still better than being scammed. I'll just keep looking...",
            "author": "thecasualvikingx",
            "id": "ewg5h4y",
            "parent_id": "t3_au8gs5",
            "score": 2,
            "created_utc": 1565374320.0,
            "replies": []
        },
        {
            "body": "My brother got scammed in this exact way when he was nineteen by someone on SA. Some real shit.\n\nThis guy was pretty slick, too. He told my brother he needed to pay a certain amount to make it look like payroll and hide it from his wife, and would just have him transfer back the extra to a different account his wife couldn’t see. He still shouldn’t have fallen for it, but the scammer was definitely more sly about it than other ones that I’ve seen. \n\nedit: details",
            "author": null,
            "id": "eh7lv4s",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1551053586.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehhkuhm",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1551374954.0,
            "replies": [
                {
                    "body": "Its definitely a scam.  The account the check is written from is not his or it doesn't exist.  Either way the funds may temporarily go through but they will eventually get taken back out. This can take up to 30 days though. ",
                    "author": "texassugarbabe",
                    "id": "ehk7fak",
                    "parent_id": "t1_ehhkuhm",
                    "score": 3,
                    "created_utc": 1551455691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hits an old nerve,there it's away.hisskk\nMy nerve lol lost.             Beu.i.       Yu7uo",
            "author": "jlee507",
            "id": "ejh54au",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1553662784.0,
            "replies": []
        },
        {
            "body": "asking for a friend, she was offered 700 /week, and he gave his account info to pay 3k to a cc bill.  Mentioned 1500/ week to be assistant and buy $25 itunes card for client. I know it seems super shady, but is I just  dont understand how sending 3k from a stolen account is worth a $25 gift card, why wouldnt they just buy the gift cards using the stolen account(s)?",
            "author": "buckeyebil1",
            "id": "ekgtyef",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1554816876.0,
            "replies": []
        },
        {
            "body": "Hey I actually came here because I wasnt sure who to ask but the SM I've been talking to for a few days now just randomly asked me for $50 even though she and I still haven't discussed the allowance she mentioned she wants to give me. She seems to be a nurse but the way she speaks is really rigid and awkward for someone who claims they're from Asheville NC. Can someone either tell me I'm being paranoid or help me figure out this scam? I already work 2 jobs I literally cant afford to be screwed over.",
            "author": "Mopsydoll",
            "id": "el509hw",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1555537959.0,
            "replies": [
                {
                    "body": "Why would an SM need money from you? The whole point of a sugar relationship is that the the SM or SD gives you money and gifts for your company because they are well off and successful. If this an online arrangement then it's it's definitely a scam.",
                    "author": "LaSirene23",
                    "id": "el7uh2a",
                    "parent_id": "t1_el509hw",
                    "score": 5,
                    "created_utc": 1555621477.0,
                    "replies": [
                        {
                            "body": "Yeah I did some more checking around the subreddit and went back to ask her some really direct questions like \"What days of the week do you work? What are your hours? When do you want to meet up?\" She keeps giving me vague answers. I'm gonna block her.",
                            "author": "Mopsydoll",
                            "id": "el7vsnz",
                            "parent_id": "t1_el7uh2a",
                            "score": 1,
                            "created_utc": 1555622391.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah and I read this while my dumbass gave info but I didnt do anything with it. I called my bank and asked them to dispute it and now the guy is threatening me that he's going to the police. But he's trying to text me saying that he's the police.",
            "author": null,
            "id": "elvunll",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1556330555.0,
            "replies": []
        },
        {
            "body": "thanks",
            "author": "anowa7",
            "id": "emscv0s",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1557274839.0,
            "replies": []
        },
        {
            "body": "Just got hooked by a scammer. Took like 3 days to pop the “can you do something for me?” Thank god I came to reddit before I fell for it. I wish there was a way to scam them back? But I’m sure it isn’t possible.",
            "author": "bonestuart",
            "id": "ensfcy1",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1558028113.0,
            "replies": []
        },
        {
            "body": "I had a SD offer me 1500 a week and 300 now in exchange I delete my sa account. He hasn't asked for anything but screen shots of the deactivation. The only thing that is making this seem like a scam is the amount and not doing a m&g first. I know not to give my account information, and I only accept things through cash or venmo (maybe not anymore since I just found its reversible).",
            "author": "cozmicdork",
            "id": "eoe1d0p",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1558485912.0,
            "replies": []
        },
        {
            "body": "The only thing about this that honestly cracks me up is that if my SD \"overpaid\" me - he didn't. He paid me more to stay discreet. No fuckin' way I'm going to give the difference back to him in the form of anything other than upholding our agreement!!! Thanks for the bonus, baby!",
            "author": null,
            "id": "eptbk4c",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1559486645.0,
            "replies": []
        },
        {
            "body": "I had a woman ask for a $50 Ernest fee the other day.",
            "author": "abatnamedtwitch",
            "id": "eq1o2fg",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1559714523.0,
            "replies": []
        },
        {
            "body": "Can I just go and cash the check at Walmart & ditch the scammers?",
            "author": "serena2131",
            "id": "eq4is9y",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1559777805.0,
            "replies": []
        },
        {
            "body": "Good thing I found this.\n\nI thought I might have fallen into the sugar baby role when three men on a dating app asked if I wanted to be their sugar baby. One seemed rude and weird so I stopped that right away. Another seemed ok but doesn't talk much (wanted quickly go to another chat place. Which at some point i thought rightfully so because the chat system did seem weird so now I'm going to research that.) The third I thought was the best. We chatted a bit. But he also quickly wanted to go to Kik. He says he's in Australia at the moment but is actually from the United States. He asked me my age but that was already on the dating app the he found me ob. He also was talking money right away (allowance of first $500 twice a week to every 4 days I think) and when I first looked up about the money it seemed average.\n\nLuckily I am to uncomfortable getting money from people I dont know. And I also was doing research about being a sugar baby because I didn't know much from it.\n\nAlso my profile in the app didn't have any revealing info about me. that includes there being zero pictures",
            "author": "dont_know_sir",
            "id": "eq51ho6",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1559790877.0,
            "replies": [
                {
                    "body": "So I thought to ask in the Kik chat why you would be interested in my when all he had was my skin color, height, and weight. Haven't gotten a reply yet but a little bit latter another profile looking for a sugar baby who has his ethnicity as native American..... He is quite white. So I asked him how much native American he is.\n\nI did some looking at his profile. It says he is 5 foot 6 inches in height. On the Kik chat he says he is 6 foot 3 inches. *Sarcastic* hummm....\n\nI also took screen shots for proof",
                    "author": "dont_know_sir",
                    "id": "eq5654f",
                    "parent_id": "t1_eq51ho6",
                    "score": 1,
                    "created_utc": 1559793620.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So everytime I try to connect with a SD, they ask for banking information which I read on the site not to provide that information to anyone and it is consider a scam? How do you know if the person is real or not? What information should you ask for?",
            "author": "brina707",
            "id": "ergkxrp",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1560844485.0,
            "replies": [
                {
                    "body": "A real SD will not ask for your banking details, will not give you his, and highly unlikely he will send you anything before actually meeting you. A real SD will want to meet you in person for a meet and greet. \n\nIn this lifestyle discretion and trust are high on the list of priority so it's highly unlikely that a SD will transfer cash to a stranger so there's a paper trail linking them to you.",
                    "author": "LaSirene23",
                    "id": "erh1dz5",
                    "parent_id": "t1_ergkxrp",
                    "score": 1,
                    "created_utc": 1560864563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I haven't spent any of the cash yet, it hasn't become available yet.  I am going to take out that cash immediately and see what happens?  Also i  don't understand, if the check becomes available, and is no longer pending, then how can it be fake?  Could I take all of the money out once its available and then close my account?  At this point I dont care about the SD I just wanna make sure I don't get scammed.",
            "author": "CommieDann",
            "id": "erqkcta",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1561145415.0,
            "replies": []
        },
        {
            "body": "A common tactic of these scammers is they will “love bomb” you with really creepy, fake, lame platitudes and always mention they “already feel such a strong connection, you’re really special. give me your bank information so I can send you some money right now! let’s not waste any time!” 🙄",
            "author": "yehet420",
            "id": "et5gszd",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1562473607.0,
            "replies": []
        },
        {
            "body": "I wish I seen this, before it.was to late:(",
            "author": "maremil2",
            "id": "etln4cq",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1562940767.0,
            "replies": []
        },
        {
            "body": "Yes I've gotten these kinds of people on Seeking and other SD sites, I know they're fake. They also put their phone number in their first message and then when you go to check their profile, it's been deleted that quick.",
            "author": "kasage00",
            "id": "etv86gu",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1563228692.0,
            "replies": []
        },
        {
            "body": "Really wish I would have seen this sooner lmao I had this happen to me with the very first person who contacted me.  I felt so stupid, and my friends were telling me to run with the money, but I felt like that was dishonest and I couldn't bring myself to steal from someone.  Now ….. I realize I should have just not been so nice.  \n\n\\*\\*\\* I was planning if I took the money to just let it sit in savings, gave $20 to a homeless man, and was gonna spend $20 on gas.",
            "author": "KayL0718",
            "id": "evkgl7q",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1564581174.0,
            "replies": []
        },
        {
            "body": "Thanks for the info, I was already planning on cash to venmo but wow! At least now I know to close a chat early and not waste my time if I see these.",
            "author": "snailpacegoals",
            "id": "ewff59z",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1565359348.0,
            "replies": []
        },
        {
            "body": "It seems like all I find are scammers or ghosts on SA. Isn't there a legit SD somewhere out there?",
            "author": null,
            "id": "ewntiph",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1565590043.0,
            "replies": []
        },
        {
            "body": "Hi!! I think this is happening to me right now because he sent me a very large check that I deposited and now he’s asking me to spend it on game cards to “prove” my loyalty to him. That’s all he did tho he never asked for any bank info. I’m obviously not gonna do anything further but I’m scared because there’s almost 2k sitting in my bank account right now. HOW DO I GET RID OF IT?? PLEASE reply as soon as possible!",
            "author": "navigate_",
            "id": "exftp2f",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1566248148.0,
            "replies": []
        },
        {
            "body": "Thank you for posting this, I was just about to post something about google play cards. As you said, the amount it too good to be true and the man is pushy. Definitely a scam but wanted to know how common it was",
            "author": "eavery",
            "id": "exl1qp2",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1566404082.0,
            "replies": []
        },
        {
            "body": "I see you may have posted about a scam. \n\nIt is a scam if:\n\n* Someone wants your bank account information\n\n* Someone wants your bank log in information\n\n* Someone wants to send you a check to cash\n\n* Someone wants you to buy gift cards to send back to them\n\n* Someone wants to give you lots of money without ever meeting\n\nAlso please see [previous questions about scams.](https://www.reddit.com/r/sugarlifestyleforum/search?q=scam&sort=new&restrict_sr=on) \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "f9418sy",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1575074327.0,
            "replies": []
        },
        {
            "body": "I’ve had an older gentleman message me that wanted to do an online arrangement except he wanted to do it through cheques. I told him I only accept PayPal and then he said this isn’t gonna work. \nClearly he was a scammer. He didn’t even bother with conversation, straight to sending me money. This was on Instagram too, not even SA. ",
            "author": "babe__ruthless",
            "id": "eh6l74o",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1551027010.0,
            "replies": [
                {
                    "body": "What's even safer is to have one email just accept egift cards like from Amazon. That way they can't get your name.",
                    "author": "queenpompadour",
                    "id": "eh79owh",
                    "parent_id": "t1_eh6l74o",
                    "score": 2,
                    "created_utc": 1551044353.0,
                    "replies": [
                        {
                            "body": "I’ve got a separate pay pal that doesn’t have my name attached. But good tip for others. ",
                            "author": "babe__ruthless",
                            "id": "eh7gf94",
                            "parent_id": "t1_eh79owh",
                            "score": 2,
                            "created_utc": 1551049102.0,
                            "replies": [
                                {
                                    "body": "Just be super careful out there. PayPal is getting pretty bad. ",
                                    "author": "queenpompadour",
                                    "id": "eh7gq11",
                                    "parent_id": "t1_eh7gf94",
                                    "score": 1,
                                    "created_utc": 1551049331.0,
                                    "replies": [
                                        {
                                            "body": "Yup, PayPal if far from the safest way to get money. Also they will ban an account at the slightest whiff of it being for any type of sex work.",
                                            "author": "sexviewer",
                                            "id": "eh80w22",
                                            "parent_id": "t1_eh7gq11",
                                            "score": 3,
                                            "created_utc": 1551066459.0,
                                            "replies": [
                                                {
                                                    "body": "Is Venmo or CashApp safe to get money? ",
                                                    "author": "A13MS2013",
                                                    "id": "eij8aca",
                                                    "parent_id": "t1_eh80w22",
                                                    "score": 1,
                                                    "created_utc": 1552592315.0,
                                                    "replies": [
                                                        {
                                                            "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
                                                            "author": "sexviewer",
                                                            "id": "eijd24m",
                                                            "parent_id": "t1_eij8aca",
                                                            "score": 3,
                                                            "created_utc": 1552595169.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish my local SB read this so she doesn't waste time with those scammers and go for this guy-Jakcoll- the real deal , lol",
            "author": "Jakcoll",
            "id": "eh6nqdx",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1551028926.0,
            "replies": [
                {
                    "body": "Hopefully she opens her eyes to what's in front of her",
                    "author": "kcweekly",
                    "id": "erl5qch",
                    "parent_id": "t1_eh6nqdx",
                    "score": 1,
                    "created_utc": 1560978937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am currently amidst dealing with a SM...I'm skeptical...she keeps asking for my username and password to my mobile banking account...yay or nay...in my skepticism she even offered to pay my credit card balances...help I'm at odds...",
            "author": "Draconianlordz",
            "id": "etfvcs1",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1562778353.0,
            "replies": [
                {
                    "body": "I hope this was sarcasm. If it wasn't, I hope you didn't give her any of your bank details. \n\nRule #1 of dealing with strangers: NEVER give them your bank info. They do not need your bank info, unless they're trying to drain your account or worse. If it comes down to it, just ask for cash only. Otherwise if you want someone to send money directly into your account, use PayPal or Venmo.",
                    "author": "HarmonicWalrus",
                    "id": "eu9temh",
                    "parent_id": "t1_etfvcs1",
                    "score": 2,
                    "created_utc": 1563590268.0,
                    "replies": [
                        {
                            "body": "I was aware...I know what's needed for a wire transfer...yet I almost caved when she mentioned monitoring how I spent...as a single father it just wasn't feasible...though tempting as she may have been...solid decline...such a chance I would most definitely never take...you know legacy & all...",
                            "author": "Draconianlordz",
                            "id": "eua0jo2",
                            "parent_id": "t1_eu9temh",
                            "score": 1,
                            "created_utc": 1563596667.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where is our wonderful bot?? Did it have too much whiskey last night?\n\nEdit: great post\n\nMost scams can be found online. For instance search for:  “FTC iTunes card scam”\n\nOne of the top results\n\nhttps://www.consumer.ftc.gov/blog/2018/05/asked-pay-gift-card-dont\n\nInformation is power. Use the internet people!",
            "author": "girlz_are_42",
            "id": "eh6dbpd",
            "parent_id": "t3_au8gs5",
            "score": 0,
            "created_utc": 1551020921.0,
            "replies": []
        },
        {
            "body": "So a scammer is willing to send me money via cashapp. I'm using a throwaway cashapp not tied to my bank account. Would it be possible to just take the money and run? Effectively scamming the scammer?",
            "author": "PM_ME__CUTE_SELFIES",
            "id": "hrkaps2",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1641512800.0,
            "replies": []
        },
        {
            "body": "I kept getting spammed with messages out of the blue about people looking for a sugar daddy on Telegram, and I just delete those because it’s the same templated message each time.",
            "author": "Jlnhlfan",
            "id": "i7uy0cz",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1652054315.0,
            "replies": []
        },
        {
            "body": "Is it a scam if she says she will hook up with you for $50 RN and RM, what does that mean?",
            "author": "Unfair_Mastodon_9088",
            "id": "icwbfr2",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1655602456.0,
            "replies": []
        },
        {
            "body": "What’s the problem with them giving you their bank numbers?? I don’t understand how they can scam you if they are paying off your debt.",
            "author": "Sb_sherbert",
            "id": "if0hw4f",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1657067276.0,
            "replies": [
                {
                    "body": ">I don’t understand\n\nYou seem to not understand a lot of things that you could very easily read and understand if you wanted to. Please consider doing so or you will be scammed. This stuff is very very simple if you read; if not you will get scammed.",
                    "author": "NoLimitLexa",
                    "id": "if0iwv8",
                    "parent_id": "t1_if0hw4f",
                    "score": 1,
                    "created_utc": 1657067756.0,
                    "replies": [
                        {
                            "body": "Okay, I need you to take three steps back. I have been reading it and I was just asking for elaboration. There is no need to get nasty about it, as I am just trying to learn.",
                            "author": "Sb_sherbert",
                            "id": "if0j65i",
                            "parent_id": "t1_if0iwv8",
                            "score": 1,
                            "created_utc": 1657067877.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The amount of these scammers on TikTok is unbelievable.",
            "author": "SecretlyFierce",
            "id": "ijnsx23",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1660094839.0,
            "replies": []
        },
        {
            "body": "I just joined. I'm a SD and have been scammed a few times. By trial and error, I've learned most of the things in the thread. This reinforces what I've learned and much more. Thank you for this post.",
            "author": "Master_Application23",
            "id": "inc7f5b",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1662485359.0,
            "replies": []
        },
        {
            "body": "Thank god I came to Reddit, just getting into this lifestyle and now I’m understanding that online SD are to good to be true",
            "author": "karma1803",
            "id": "j5n45kj",
            "parent_id": "t3_au8gs5",
            "score": 1,
            "created_utc": 1674533565.0,
            "replies": []
        },
        {
            "body": "Has anyone gotten the : “I’m in business meetings all day and really want to meet you. I’m going to email you a check so you can make a copy and scan in to deposit in your bank account “ I reported his cheesy ass ",
            "author": "rhea2449770",
            "id": "ei1feli",
            "parent_id": "t1_eh6d0iw",
            "score": 24,
            "created_utc": 1552008874.0,
            "replies": [
                {
                    "body": ">check\n\nWhat is the danger in this if I wait until after the check clears? I deposited a check from my mobile banking phone app this way from a sugar momma a few days ago. The funds are in my account now. Am I in danger? She sent over a scanned copy.",
                    "author": "reciphered",
                    "id": "eraqma7",
                    "parent_id": "t1_ei1feli",
                    "score": 2,
                    "created_utc": 1560650543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Is there a way\n\nYes I agree!\n\n/u/LaSirene23 can we add a link to this post to the content that our wonderful bot posts?",
            "author": "girlz_are_42",
            "id": "eh6dw71",
            "parent_id": "t1_eh6d0iw",
            "score": 2,
            "created_utc": 1551021408.0,
            "replies": [
                {
                    "body": "Will discuss it with our Bot expert",
                    "author": "LaSirene23",
                    "id": "eh6g57v",
                    "parent_id": "t1_eh6dw71",
                    "score": 3,
                    "created_utc": 1551023278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Really great advice!",
            "author": "craftyUrbanite82",
            "id": "eie9rgh",
            "parent_id": "t1_eh6awz0",
            "score": 2,
            "created_utc": 1552438019.0,
            "replies": []
        },
        {
            "body": ">I always see a lot of negativity towards people that either fall for these scams or even don't immediately recognize that it is a scam and it really bothers me.\n\nI agree.  I've noticed some of the mocking and condescension and I think it's really rubbing salt in the wounds of the unlucky women who have fallen victim to this.  It's even more disappointing that they're treated this way when they were hoping for financial help and instead have been taken advantage of.",
            "author": null,
            "id": "eh905e5",
            "parent_id": "t1_eh6utjg",
            "score": 6,
            "created_utc": 1551109343.0,
            "replies": [
                {
                    "body": "I agree. I wonder how many of those people have been in a very rough financial spot. Like, unable to pay your bills tough. I feel fortunate that I had to go through that now that I'm on the other side. This applies to both SB and SD too. Never struggling to the point of desperation is not a SD exclusive trait after all.\n\nAlternatively it could be the attitude of \"well, I did it so anyone can\" which is slightly better, but still a very narrow view that assumes their situation and opportunities were similar enough to be comparable. ",
                    "author": "sexviewer",
                    "id": "eh98m0n",
                    "parent_id": "t1_eh905e5",
                    "score": 4,
                    "created_utc": 1551115395.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Scammers actually make their scams more obvious to filter out the smart people who will waste their time and catch on later. So the scam messages and things are tuned to appeal to people who are dumb enough to fall for it initially and keep falling for it. I agree it is still not polite to be mean to people who fall for them. \n\nCitation: a Microsoft research paper on this topic. ",
            "author": "tra24602",
            "id": "eh7djda",
            "parent_id": "t1_eh6utjg",
            "score": 7,
            "created_utc": 1551047052.0,
            "replies": [
                {
                    "body": "Some are like that you're right, but there are still plenty that do not use that filtering technique and try to make the scam as convincing as possible. I have seen bright and not naive people fall for scams before and have seen samples people have posted that are very convincing.\n\nHere is one example: https://mypolice.qld.gov.au/blog/2017/11/13/new-email-scam-using-fake-paypal-website/\n\nVs\n\nwww.liverpoolecho.co.uk/news/liverpool-news/customers-warned-over-new-paypal-13183145.amp\n\nAs you can see one is filled with errors and the other appears to be more legit. They also will tend to use the obvious errors in the first step only and make everything after you're talking to them look more real. So the first contact may be riddled with errors, but all the \"evidence\" they later send to you is meant to look very real.",
                    "author": "sexviewer",
                    "id": "eh7fdnk",
                    "parent_id": "t1_eh7djda",
                    "score": 2,
                    "created_utc": 1551048357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this comment. I’m a newbie at this whole thing. And I considered myself a very smart girl. Yet here I am, with negative almost 2 grand in my bank account. I literally had $7 to my name when I tried to find a sugar daddy. And now I can’t even make a phone payment. I feel like the stupidest person in the world right now.",
            "author": "fireyswanjello25",
            "id": "izukpx4",
            "parent_id": "t1_eh6utjg",
            "score": 2,
            "created_utc": 1670801078.0,
            "replies": []
        },
        {
            "body": "What is a good Method to receive payment? \nSorry I’m randomly replying to you",
            "author": "realhero123",
            "id": "eno0a36",
            "parent_id": "t1_eh6utjg",
            "score": 1,
            "created_utc": 1557953315.0,
            "replies": [
                {
                    "body": "You don't have to apologize at all! The best way is paper cash. There are some other secure methods that can't be reversed, but they are more complex and easier to fake.\n\nFor example: western union. If someone wanted to pay via western union, how confident are you that you will understand the process and detect red flags? Unless you use it regularly the answer should be \"not very\". Wire transfers are also secure, but anyone offering that is 99% of the time a scammer (they need your bank info).\n\nSo, really your only option is cash. Cashapp and venmo can be reversed. Paypal is ridiculously easy to reverse.",
                    "author": "sexviewer",
                    "id": "enofgf0",
                    "parent_id": "t1_eno0a36",
                    "score": 1,
                    "created_utc": 1557958634.0,
                    "replies": [
                        {
                            "body": "How do sugar mommies or daddies actually pay, from their own savings or like from a company.\n\nSo the best way is for them to meet you with cash each week?\n\nAlso would a prepaid card work?",
                            "author": "realhero123",
                            "id": "enoioas",
                            "parent_id": "t1_enofgf0",
                            "score": 1,
                            "created_utc": 1557959800.0,
                            "replies": [
                                {
                                    "body": "I withdraw cash from my checking account. I can't speak for how married SD do it. If anyone offers to out you on the payroll, do not agree. Prepaid cards can work, but you could also get scammed easier and cash is just as easy for the sd anyway so they have no reason not to use cash.",
                                    "author": "sexviewer",
                                    "id": "enolzwr",
                                    "parent_id": "t1_enoioas",
                                    "score": 2,
                                    "created_utc": 1557961021.0,
                                    "replies": [
                                        {
                                            "body": "Ok thanks for the advice I’ll make it clear I want my payment in cash",
                                            "author": "realhero123",
                                            "id": "enon7tk",
                                            "parent_id": "t1_enolzwr",
                                            "score": 1,
                                            "created_utc": 1557961489.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I have another question, you pay each time you meet, not a “weekly allowance”, right?\n\nAlso do you know the average amount of payment in NY? For sugar babies(men and woman)?\n\nThanks",
                                            "author": "realhero123",
                                            "id": "entobgn",
                                            "parent_id": "t1_enolzwr",
                                            "score": 1,
                                            "created_utc": 1558045196.0,
                                            "replies": [
                                                {
                                                    "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
                                                    "author": "sexviewer",
                                                    "id": "entwkc9",
                                                    "parent_id": "t1_entobgn",
                                                    "score": 1,
                                                    "created_utc": 1558048714.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Can cashapp be reversed? Is that true?",
                            "author": "kandiikittenx",
                            "id": "exg4ip8",
                            "parent_id": "t1_enofgf0",
                            "score": 1,
                            "created_utc": 1566255301.0,
                            "replies": [
                                {
                                    "body": "Not easily, but yes it can. Why not just do cash? It's by far the safest and once you establish trust you can move to digital payments instead.",
                                    "author": "sexviewer",
                                    "id": "exg7ek8",
                                    "parent_id": "t1_exg4ip8",
                                    "score": 1,
                                    "created_utc": 1566257137.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not in the whole SD/SM thing, but I 've always wondered what happens if you spend the (non-existent) check money and then close the account before the account goes negative, and I don't know where to ask.",
            "author": "Pic889",
            "id": "es1gx68",
            "parent_id": "t1_eh6utjg",
            "score": 1,
            "created_utc": 1561496550.0,
            "replies": [
                {
                    "body": "Either they will not allow you to close it with pending checks still out there or they will and then come after you to give them the money you owe. If you do not pay them back they will sell your debt into collections. At that point it is no different than any other debt that was sold to a collection agency.",
                    "author": "sexviewer",
                    "id": "es1sq4b",
                    "parent_id": "t1_es1gx68",
                    "score": 1,
                    "created_utc": 1561504784.0,
                    "replies": [
                        {
                            "body": "\"What happens if I commit fraud?\"",
                            "author": "ulyssesjack",
                            "id": "ii6pehu",
                            "parent_id": "t1_es1sq4b",
                            "score": 1,
                            "created_utc": 1659133057.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its not about technology and how bank accounts work. It's about common sense:\n\n\\-Why would you ever do something online with money with someone you have never met. Cash should be exchanged in person.\n\n\\-Why would you send money to someone who is supposed to be sending you money. Is that part not a little suspicious?\n\n\\-Why would you jump through hoops with someone you have never met?\n\n\\-Can you not tell that their speech style is very robotic, non-personalized, non-responsive, and insincere?",
            "author": "DoomAndSouls",
            "id": "er006zu",
            "parent_id": "t1_eh6utjg",
            "score": 1,
            "created_utc": 1560408724.0,
            "replies": []
        },
        {
            "body": "You're welcome :-) Glad you found this helpful. ",
            "author": "LaSirene23",
            "id": "ek7tfvu",
            "parent_id": "t1_ek7gxb7",
            "score": 2,
            "created_utc": 1554510043.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eh6l1h9",
            "parent_id": "t1_eh6k4i6",
            "score": 8,
            "created_utc": 1551026894.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eh7a6ui",
                    "parent_id": "t1_eh6l1h9",
                    "score": 16,
                    "created_utc": 1551044692.0,
                    "replies": [
                        {
                            "body": "Perfect comment. Well off people will never know the kind of desperation that drives people to fall for something like this. A lot of people view sugaring as a desperate move too actually. And in some cases it definitely is.",
                            "author": "Cookie_Duchess",
                            "id": "eh7eyr7",
                            "parent_id": "t1_eh7a6ui",
                            "score": 11,
                            "created_utc": 1551048067.0,
                            "replies": []
                        },
                        {
                            "body": "The presumption here is that people who are well-off have never struggled...or the idea that the well off dont fall for these scams either. \nNaivity is not bound by class, race, sex etc...",
                            "author": "A_Good_Decision",
                            "id": "eh81rxp",
                            "parent_id": "t1_eh7a6ui",
                            "score": 2,
                            "created_utc": 1551067246.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well then they deserve to get duped for being dense.",
                    "author": null,
                    "id": "eh6l618",
                    "parent_id": "t1_eh6l1h9",
                    "score": 0,
                    "created_utc": 1551026988.0,
                    "replies": [
                        {
                            "body": "Seriously? This is exactly the attitude of a scammer or con artist.",
                            "author": null,
                            "id": "eh904yl",
                            "parent_id": "t1_eh6l618",
                            "score": 6,
                            "created_utc": 1551109333.0,
                            "replies": [
                                {
                                    "body": "No because I know it's wrong and wouldn't ever do something like that. Just because one *can* do something doesn't mean they should or will. ",
                                    "author": null,
                                    "id": "eh90gg3",
                                    "parent_id": "t1_eh904yl",
                                    "score": 2,
                                    "created_utc": 1551109571.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve just experienced something similar, and that’s why I came to this forum to read around.\n\nMine was a little different - he gave account information for me to pay off a credit card, which should clear tomorrow - and simply asked that I show a screenshot. So I figured I would do it, as this was his offering to build trust before I travel out of state to see him. Once I did that he said that he wants to know trust goes both ways, and for me to get 3 $100 Amazon gift cards in the morning once it’s clear, and then pay that $300 off.\n\n(Edit: I told him I wasn’t comfortable about the gift cards because of scammers, and he said he’s sorry for pressuring me and I don’t have to do it. If this payment is reversed, there’s no way I’m going to be on the hook for going *over* my credit limit!)\n\nNow I’m terrified I fucked up by making the payment though I have proof via text that it’s something else. This is my first encounter with sugaring online, which is discouraging.",
            "author": "issitohbi",
            "id": "em6j4za",
            "parent_id": "t1_ejczdvp",
            "score": 1,
            "created_utc": 1556666841.0,
            "replies": [
                {
                    "body": "this happened to my friend, bank will reverse charge probably... just be ready for that",
                    "author": "buckeyebil1",
                    "id": "em8o5iy",
                    "parent_id": "t1_em6j4za",
                    "score": 2,
                    "created_utc": 1556731130.0,
                    "replies": [
                        {
                            "body": "If they reverse it, that’s fine. I just hope it won’t be reported as fraud to my card company, as through some reading I’ve heard they’ll shut them out. I’m so sad because this is work I want to get into but I have no real guidance; to know that I’ve screwed up so badly. Ah.\n\nDid they close your friend’s account?",
                            "author": "issitohbi",
                            "id": "em8pun8",
                            "parent_id": "t1_em8o5iy",
                            "score": 1,
                            "created_utc": 1556732060.0,
                            "replies": [
                                {
                                    "body": "they didnt shut my friends account...i suppose its possible, but probably not if you just do it once",
                                    "author": "buckeyebil1",
                                    "id": "em9gmk3",
                                    "parent_id": "t1_em8pun8",
                                    "score": 1,
                                    "created_utc": 1556747138.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm worried I'm getting into the same scam. My Sugar Momma gave me her account info to pay off my credit card, which did clear yesterday. Now she wants me to buy her 5 $200 gift cards so that she can reward her employees with them for finishing a big construction project. She says she can't do it herself b/c she doesn't trust bank cards, or \"apps,\" and can't make it to the store. Is it possible for her bank to reverse the paying off of my credit card? Is that reversible?",
                    "author": "reciphered",
                    "id": "eramoes",
                    "parent_id": "t1_em6j4za",
                    "score": 1,
                    "created_utc": 1560647896.0,
                    "replies": [
                        {
                            "body": "It might not even be her account. So a few weeks after mine cleared, the bank of whoever it belonged to bounced it as an unauthorized charge. My card was fine, I just had to pay the balance as I would have, but they did an audit and last week closed my account for fraud because I didn’t have authorization to use that account - because it was removed by the bank as unauthorized. I’m sorry to hear you were scammed as well :(",
                            "author": "issitohbi",
                            "id": "eramur8",
                            "parent_id": "t1_eramoes",
                            "score": 1,
                            "created_utc": 1560648010.0,
                            "replies": [
                                {
                                    "body": "Oh no, that's terrifying! Did the accidental fraud hurt your credit score? Did you get to keep the funds in your account when they closed it? Were you able to open a new account. I hadn't even considered that she might be using someone else's account to scam me. This has been my first encounter with sugaring and it's starting to feel like I need an education in finance just to sugar!",
                                    "author": "reciphered",
                                    "id": "eranjfr",
                                    "parent_id": "t1_eramur8",
                                    "score": 2,
                                    "created_utc": 1560648471.0,
                                    "replies": [
                                        {
                                            "body": "It wasn’t my first experience with sugaring or my first that started online, but it was definitely new to me to be scammed like this! Don’t feel bad or discouraged. Answering your questions:\n\n- I had $570 of a $1,000 balance available, I now have $0 available and am paying off the amount I had used plus the bounced payment fee\n\n- I have accounts with two other major credit companies and two stores, so I don’t plan to open another account right now because that will show me as seeking too actively\n\n- The app for that specific card would report my credit score, it was last 680. (I’m new to credit building so this was very high for me!) I’m not sure if there’s variation across different methods of checking the score, but my other major credit card reports through someone else. My score as shown by that company is now 630. Because I just set up the credit check though, I don’t know if it was higher or a variation thing. My mom and partner who have authorization to use my card(s) don’t have a drop in score, though. I was told authorizing them would bind the credit scores.\n\nWhat’s funny is that I went to school for Accounting, yet here I am. Ironic.\n\nEdit: listed 650 instead of 630",
                                            "author": "issitohbi",
                                            "id": "erasne1",
                                            "parent_id": "t1_eranjfr",
                                            "score": 1,
                                            "created_utc": 1560651973.0,
                                            "replies": [
                                                {
                                                    "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
                                                    "author": "reciphered",
                                                    "id": "eray0qs",
                                                    "parent_id": "t1_erasne1",
                                                    "score": 1,
                                                    "created_utc": 1560655729.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Insist on sending you a check, your bank login information, your credit card login information, **or offers you their bank account information to pay off debt,** etc.\n\nThanks!  I included that. Do you think it should have a separate bullet point? \n",
            "author": "LaSirene23",
            "id": "eh6iqh1",
            "parent_id": "t1_eh6g7du",
            "score": 1,
            "created_utc": 1551025196.0,
            "replies": [
                {
                    "body": "Ooh, I missed it. \n\nProbably not. Newbies won't read it anyway :( ",
                    "author": "2catsandacomputer",
                    "id": "eh6m2gs",
                    "parent_id": "t1_eh6iqh1",
                    "score": 4,
                    "created_utc": 1551027670.0,
                    "replies": []
                },
                {
                    "body": "100%!",
                    "author": "craftyUrbanite82",
                    "id": "eie8je4",
                    "parent_id": "t1_eh6iqh1",
                    "score": 1,
                    "created_utc": 1552437171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Had someone offer this! Said they would prefer PayPal or similar, but that their account had been involved in a scam and was shut down even though it wasn’t them.",
            "author": "issitohbi",
            "id": "em6k5c5",
            "parent_id": "t1_ehsrp35",
            "score": 1,
            "created_utc": 1556667477.0,
            "replies": []
        },
        {
            "body": "Its definitely a scam.  The account the check is written from is not his or it doesn't exist.  Either way the funds may temporarily go through but they will eventually get taken back out. This can take up to 30 days though. ",
            "author": "texassugarbabe",
            "id": "ehk7fak",
            "parent_id": "t1_ehhkuhm",
            "score": 3,
            "created_utc": 1551455691.0,
            "replies": []
        },
        {
            "body": "Why would an SM need money from you? The whole point of a sugar relationship is that the the SM or SD gives you money and gifts for your company because they are well off and successful. If this an online arrangement then it's it's definitely a scam.",
            "author": "LaSirene23",
            "id": "el7uh2a",
            "parent_id": "t1_el509hw",
            "score": 5,
            "created_utc": 1555621477.0,
            "replies": [
                {
                    "body": "Yeah I did some more checking around the subreddit and went back to ask her some really direct questions like \"What days of the week do you work? What are your hours? When do you want to meet up?\" She keeps giving me vague answers. I'm gonna block her.",
                    "author": "Mopsydoll",
                    "id": "el7vsnz",
                    "parent_id": "t1_el7uh2a",
                    "score": 1,
                    "created_utc": 1555622391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So I thought to ask in the Kik chat why you would be interested in my when all he had was my skin color, height, and weight. Haven't gotten a reply yet but a little bit latter another profile looking for a sugar baby who has his ethnicity as native American..... He is quite white. So I asked him how much native American he is.\n\nI did some looking at his profile. It says he is 5 foot 6 inches in height. On the Kik chat he says he is 6 foot 3 inches. *Sarcastic* hummm....\n\nI also took screen shots for proof",
            "author": "dont_know_sir",
            "id": "eq5654f",
            "parent_id": "t1_eq51ho6",
            "score": 1,
            "created_utc": 1559793620.0,
            "replies": []
        },
        {
            "body": "A real SD will not ask for your banking details, will not give you his, and highly unlikely he will send you anything before actually meeting you. A real SD will want to meet you in person for a meet and greet. \n\nIn this lifestyle discretion and trust are high on the list of priority so it's highly unlikely that a SD will transfer cash to a stranger so there's a paper trail linking them to you.",
            "author": "LaSirene23",
            "id": "erh1dz5",
            "parent_id": "t1_ergkxrp",
            "score": 1,
            "created_utc": 1560864563.0,
            "replies": []
        },
        {
            "body": "What's even safer is to have one email just accept egift cards like from Amazon. That way they can't get your name.",
            "author": "queenpompadour",
            "id": "eh79owh",
            "parent_id": "t1_eh6l74o",
            "score": 2,
            "created_utc": 1551044353.0,
            "replies": [
                {
                    "body": "I’ve got a separate pay pal that doesn’t have my name attached. But good tip for others. ",
                    "author": "babe__ruthless",
                    "id": "eh7gf94",
                    "parent_id": "t1_eh79owh",
                    "score": 2,
                    "created_utc": 1551049102.0,
                    "replies": [
                        {
                            "body": "Just be super careful out there. PayPal is getting pretty bad. ",
                            "author": "queenpompadour",
                            "id": "eh7gq11",
                            "parent_id": "t1_eh7gf94",
                            "score": 1,
                            "created_utc": 1551049331.0,
                            "replies": [
                                {
                                    "body": "Yup, PayPal if far from the safest way to get money. Also they will ban an account at the slightest whiff of it being for any type of sex work.",
                                    "author": "sexviewer",
                                    "id": "eh80w22",
                                    "parent_id": "t1_eh7gq11",
                                    "score": 3,
                                    "created_utc": 1551066459.0,
                                    "replies": [
                                        {
                                            "body": "Is Venmo or CashApp safe to get money? ",
                                            "author": "A13MS2013",
                                            "id": "eij8aca",
                                            "parent_id": "t1_eh80w22",
                                            "score": 1,
                                            "created_utc": 1552592315.0,
                                            "replies": [
                                                {
                                                    "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
                                                    "author": "sexviewer",
                                                    "id": "eijd24m",
                                                    "parent_id": "t1_eij8aca",
                                                    "score": 3,
                                                    "created_utc": 1552595169.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hopefully she opens her eyes to what's in front of her",
            "author": "kcweekly",
            "id": "erl5qch",
            "parent_id": "t1_eh6nqdx",
            "score": 1,
            "created_utc": 1560978937.0,
            "replies": []
        },
        {
            "body": "I hope this was sarcasm. If it wasn't, I hope you didn't give her any of your bank details. \n\nRule #1 of dealing with strangers: NEVER give them your bank info. They do not need your bank info, unless they're trying to drain your account or worse. If it comes down to it, just ask for cash only. Otherwise if you want someone to send money directly into your account, use PayPal or Venmo.",
            "author": "HarmonicWalrus",
            "id": "eu9temh",
            "parent_id": "t1_etfvcs1",
            "score": 2,
            "created_utc": 1563590268.0,
            "replies": [
                {
                    "body": "I was aware...I know what's needed for a wire transfer...yet I almost caved when she mentioned monitoring how I spent...as a single father it just wasn't feasible...though tempting as she may have been...solid decline...such a chance I would most definitely never take...you know legacy & all...",
                    "author": "Draconianlordz",
                    "id": "eua0jo2",
                    "parent_id": "t1_eu9temh",
                    "score": 1,
                    "created_utc": 1563596667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I don’t understand\n\nYou seem to not understand a lot of things that you could very easily read and understand if you wanted to. Please consider doing so or you will be scammed. This stuff is very very simple if you read; if not you will get scammed.",
            "author": "NoLimitLexa",
            "id": "if0iwv8",
            "parent_id": "t1_if0hw4f",
            "score": 1,
            "created_utc": 1657067756.0,
            "replies": [
                {
                    "body": "Okay, I need you to take three steps back. I have been reading it and I was just asking for elaboration. There is no need to get nasty about it, as I am just trying to learn.",
                    "author": "Sb_sherbert",
                    "id": "if0j65i",
                    "parent_id": "t1_if0iwv8",
                    "score": 1,
                    "created_utc": 1657067877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">check\n\nWhat is the danger in this if I wait until after the check clears? I deposited a check from my mobile banking phone app this way from a sugar momma a few days ago. The funds are in my account now. Am I in danger? She sent over a scanned copy.",
            "author": "reciphered",
            "id": "eraqma7",
            "parent_id": "t1_ei1feli",
            "score": 2,
            "created_utc": 1560650543.0,
            "replies": []
        },
        {
            "body": "Will discuss it with our Bot expert",
            "author": "LaSirene23",
            "id": "eh6g57v",
            "parent_id": "t1_eh6dw71",
            "score": 3,
            "created_utc": 1551023278.0,
            "replies": []
        },
        {
            "body": "I agree. I wonder how many of those people have been in a very rough financial spot. Like, unable to pay your bills tough. I feel fortunate that I had to go through that now that I'm on the other side. This applies to both SB and SD too. Never struggling to the point of desperation is not a SD exclusive trait after all.\n\nAlternatively it could be the attitude of \"well, I did it so anyone can\" which is slightly better, but still a very narrow view that assumes their situation and opportunities were similar enough to be comparable. ",
            "author": "sexviewer",
            "id": "eh98m0n",
            "parent_id": "t1_eh905e5",
            "score": 4,
            "created_utc": 1551115395.0,
            "replies": []
        },
        {
            "body": "Some are like that you're right, but there are still plenty that do not use that filtering technique and try to make the scam as convincing as possible. I have seen bright and not naive people fall for scams before and have seen samples people have posted that are very convincing.\n\nHere is one example: https://mypolice.qld.gov.au/blog/2017/11/13/new-email-scam-using-fake-paypal-website/\n\nVs\n\nwww.liverpoolecho.co.uk/news/liverpool-news/customers-warned-over-new-paypal-13183145.amp\n\nAs you can see one is filled with errors and the other appears to be more legit. They also will tend to use the obvious errors in the first step only and make everything after you're talking to them look more real. So the first contact may be riddled with errors, but all the \"evidence\" they later send to you is meant to look very real.",
            "author": "sexviewer",
            "id": "eh7fdnk",
            "parent_id": "t1_eh7djda",
            "score": 2,
            "created_utc": 1551048357.0,
            "replies": []
        },
        {
            "body": "You don't have to apologize at all! The best way is paper cash. There are some other secure methods that can't be reversed, but they are more complex and easier to fake.\n\nFor example: western union. If someone wanted to pay via western union, how confident are you that you will understand the process and detect red flags? Unless you use it regularly the answer should be \"not very\". Wire transfers are also secure, but anyone offering that is 99% of the time a scammer (they need your bank info).\n\nSo, really your only option is cash. Cashapp and venmo can be reversed. Paypal is ridiculously easy to reverse.",
            "author": "sexviewer",
            "id": "enofgf0",
            "parent_id": "t1_eno0a36",
            "score": 1,
            "created_utc": 1557958634.0,
            "replies": [
                {
                    "body": "How do sugar mommies or daddies actually pay, from their own savings or like from a company.\n\nSo the best way is for them to meet you with cash each week?\n\nAlso would a prepaid card work?",
                    "author": "realhero123",
                    "id": "enoioas",
                    "parent_id": "t1_enofgf0",
                    "score": 1,
                    "created_utc": 1557959800.0,
                    "replies": [
                        {
                            "body": "I withdraw cash from my checking account. I can't speak for how married SD do it. If anyone offers to out you on the payroll, do not agree. Prepaid cards can work, but you could also get scammed easier and cash is just as easy for the sd anyway so they have no reason not to use cash.",
                            "author": "sexviewer",
                            "id": "enolzwr",
                            "parent_id": "t1_enoioas",
                            "score": 2,
                            "created_utc": 1557961021.0,
                            "replies": [
                                {
                                    "body": "Ok thanks for the advice I’ll make it clear I want my payment in cash",
                                    "author": "realhero123",
                                    "id": "enon7tk",
                                    "parent_id": "t1_enolzwr",
                                    "score": 1,
                                    "created_utc": 1557961489.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have another question, you pay each time you meet, not a “weekly allowance”, right?\n\nAlso do you know the average amount of payment in NY? For sugar babies(men and woman)?\n\nThanks",
                                    "author": "realhero123",
                                    "id": "entobgn",
                                    "parent_id": "t1_enolzwr",
                                    "score": 1,
                                    "created_utc": 1558045196.0,
                                    "replies": [
                                        {
                                            "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
                                            "author": "sexviewer",
                                            "id": "entwkc9",
                                            "parent_id": "t1_entobgn",
                                            "score": 1,
                                            "created_utc": 1558048714.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Can cashapp be reversed? Is that true?",
                    "author": "kandiikittenx",
                    "id": "exg4ip8",
                    "parent_id": "t1_enofgf0",
                    "score": 1,
                    "created_utc": 1566255301.0,
                    "replies": [
                        {
                            "body": "Not easily, but yes it can. Why not just do cash? It's by far the safest and once you establish trust you can move to digital payments instead.",
                            "author": "sexviewer",
                            "id": "exg7ek8",
                            "parent_id": "t1_exg4ip8",
                            "score": 1,
                            "created_utc": 1566257137.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Either they will not allow you to close it with pending checks still out there or they will and then come after you to give them the money you owe. If you do not pay them back they will sell your debt into collections. At that point it is no different than any other debt that was sold to a collection agency.",
            "author": "sexviewer",
            "id": "es1sq4b",
            "parent_id": "t1_es1gx68",
            "score": 1,
            "created_utc": 1561504784.0,
            "replies": [
                {
                    "body": "\"What happens if I commit fraud?\"",
                    "author": "ulyssesjack",
                    "id": "ii6pehu",
                    "parent_id": "t1_es1sq4b",
                    "score": 1,
                    "created_utc": 1659133057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eh7a6ui",
            "parent_id": "t1_eh6l1h9",
            "score": 16,
            "created_utc": 1551044692.0,
            "replies": [
                {
                    "body": "Perfect comment. Well off people will never know the kind of desperation that drives people to fall for something like this. A lot of people view sugaring as a desperate move too actually. And in some cases it definitely is.",
                    "author": "Cookie_Duchess",
                    "id": "eh7eyr7",
                    "parent_id": "t1_eh7a6ui",
                    "score": 11,
                    "created_utc": 1551048067.0,
                    "replies": []
                },
                {
                    "body": "The presumption here is that people who are well-off have never struggled...or the idea that the well off dont fall for these scams either. \nNaivity is not bound by class, race, sex etc...",
                    "author": "A_Good_Decision",
                    "id": "eh81rxp",
                    "parent_id": "t1_eh7a6ui",
                    "score": 2,
                    "created_utc": 1551067246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well then they deserve to get duped for being dense.",
            "author": null,
            "id": "eh6l618",
            "parent_id": "t1_eh6l1h9",
            "score": 0,
            "created_utc": 1551026988.0,
            "replies": [
                {
                    "body": "Seriously? This is exactly the attitude of a scammer or con artist.",
                    "author": null,
                    "id": "eh904yl",
                    "parent_id": "t1_eh6l618",
                    "score": 6,
                    "created_utc": 1551109333.0,
                    "replies": [
                        {
                            "body": "No because I know it's wrong and wouldn't ever do something like that. Just because one *can* do something doesn't mean they should or will. ",
                            "author": null,
                            "id": "eh90gg3",
                            "parent_id": "t1_eh904yl",
                            "score": 2,
                            "created_utc": 1551109571.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "this happened to my friend, bank will reverse charge probably... just be ready for that",
            "author": "buckeyebil1",
            "id": "em8o5iy",
            "parent_id": "t1_em6j4za",
            "score": 2,
            "created_utc": 1556731130.0,
            "replies": [
                {
                    "body": "If they reverse it, that’s fine. I just hope it won’t be reported as fraud to my card company, as through some reading I’ve heard they’ll shut them out. I’m so sad because this is work I want to get into but I have no real guidance; to know that I’ve screwed up so badly. Ah.\n\nDid they close your friend’s account?",
                    "author": "issitohbi",
                    "id": "em8pun8",
                    "parent_id": "t1_em8o5iy",
                    "score": 1,
                    "created_utc": 1556732060.0,
                    "replies": [
                        {
                            "body": "they didnt shut my friends account...i suppose its possible, but probably not if you just do it once",
                            "author": "buckeyebil1",
                            "id": "em9gmk3",
                            "parent_id": "t1_em8pun8",
                            "score": 1,
                            "created_utc": 1556747138.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm worried I'm getting into the same scam. My Sugar Momma gave me her account info to pay off my credit card, which did clear yesterday. Now she wants me to buy her 5 $200 gift cards so that she can reward her employees with them for finishing a big construction project. She says she can't do it herself b/c she doesn't trust bank cards, or \"apps,\" and can't make it to the store. Is it possible for her bank to reverse the paying off of my credit card? Is that reversible?",
            "author": "reciphered",
            "id": "eramoes",
            "parent_id": "t1_em6j4za",
            "score": 1,
            "created_utc": 1560647896.0,
            "replies": [
                {
                    "body": "It might not even be her account. So a few weeks after mine cleared, the bank of whoever it belonged to bounced it as an unauthorized charge. My card was fine, I just had to pay the balance as I would have, but they did an audit and last week closed my account for fraud because I didn’t have authorization to use that account - because it was removed by the bank as unauthorized. I’m sorry to hear you were scammed as well :(",
                    "author": "issitohbi",
                    "id": "eramur8",
                    "parent_id": "t1_eramoes",
                    "score": 1,
                    "created_utc": 1560648010.0,
                    "replies": [
                        {
                            "body": "Oh no, that's terrifying! Did the accidental fraud hurt your credit score? Did you get to keep the funds in your account when they closed it? Were you able to open a new account. I hadn't even considered that she might be using someone else's account to scam me. This has been my first encounter with sugaring and it's starting to feel like I need an education in finance just to sugar!",
                            "author": "reciphered",
                            "id": "eranjfr",
                            "parent_id": "t1_eramur8",
                            "score": 2,
                            "created_utc": 1560648471.0,
                            "replies": [
                                {
                                    "body": "It wasn’t my first experience with sugaring or my first that started online, but it was definitely new to me to be scammed like this! Don’t feel bad or discouraged. Answering your questions:\n\n- I had $570 of a $1,000 balance available, I now have $0 available and am paying off the amount I had used plus the bounced payment fee\n\n- I have accounts with two other major credit companies and two stores, so I don’t plan to open another account right now because that will show me as seeking too actively\n\n- The app for that specific card would report my credit score, it was last 680. (I’m new to credit building so this was very high for me!) I’m not sure if there’s variation across different methods of checking the score, but my other major credit card reports through someone else. My score as shown by that company is now 630. Because I just set up the credit check though, I don’t know if it was higher or a variation thing. My mom and partner who have authorization to use my card(s) don’t have a drop in score, though. I was told authorizing them would bind the credit scores.\n\nWhat’s funny is that I went to school for Accounting, yet here I am. Ironic.\n\nEdit: listed 650 instead of 630",
                                    "author": "issitohbi",
                                    "id": "erasne1",
                                    "parent_id": "t1_eranjfr",
                                    "score": 1,
                                    "created_utc": 1560651973.0,
                                    "replies": [
                                        {
                                            "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
                                            "author": "reciphered",
                                            "id": "eray0qs",
                                            "parent_id": "t1_erasne1",
                                            "score": 1,
                                            "created_utc": 1560655729.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ooh, I missed it. \n\nProbably not. Newbies won't read it anyway :( ",
            "author": "2catsandacomputer",
            "id": "eh6m2gs",
            "parent_id": "t1_eh6iqh1",
            "score": 4,
            "created_utc": 1551027670.0,
            "replies": []
        },
        {
            "body": "100%!",
            "author": "craftyUrbanite82",
            "id": "eie8je4",
            "parent_id": "t1_eh6iqh1",
            "score": 1,
            "created_utc": 1552437171.0,
            "replies": []
        },
        {
            "body": "Yeah I did some more checking around the subreddit and went back to ask her some really direct questions like \"What days of the week do you work? What are your hours? When do you want to meet up?\" She keeps giving me vague answers. I'm gonna block her.",
            "author": "Mopsydoll",
            "id": "el7vsnz",
            "parent_id": "t1_el7uh2a",
            "score": 1,
            "created_utc": 1555622391.0,
            "replies": []
        },
        {
            "body": "I’ve got a separate pay pal that doesn’t have my name attached. But good tip for others. ",
            "author": "babe__ruthless",
            "id": "eh7gf94",
            "parent_id": "t1_eh79owh",
            "score": 2,
            "created_utc": 1551049102.0,
            "replies": [
                {
                    "body": "Just be super careful out there. PayPal is getting pretty bad. ",
                    "author": "queenpompadour",
                    "id": "eh7gq11",
                    "parent_id": "t1_eh7gf94",
                    "score": 1,
                    "created_utc": 1551049331.0,
                    "replies": [
                        {
                            "body": "Yup, PayPal if far from the safest way to get money. Also they will ban an account at the slightest whiff of it being for any type of sex work.",
                            "author": "sexviewer",
                            "id": "eh80w22",
                            "parent_id": "t1_eh7gq11",
                            "score": 3,
                            "created_utc": 1551066459.0,
                            "replies": [
                                {
                                    "body": "Is Venmo or CashApp safe to get money? ",
                                    "author": "A13MS2013",
                                    "id": "eij8aca",
                                    "parent_id": "t1_eh80w22",
                                    "score": 1,
                                    "created_utc": 1552592315.0,
                                    "replies": [
                                        {
                                            "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
                                            "author": "sexviewer",
                                            "id": "eijd24m",
                                            "parent_id": "t1_eij8aca",
                                            "score": 3,
                                            "created_utc": 1552595169.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was aware...I know what's needed for a wire transfer...yet I almost caved when she mentioned monitoring how I spent...as a single father it just wasn't feasible...though tempting as she may have been...solid decline...such a chance I would most definitely never take...you know legacy & all...",
            "author": "Draconianlordz",
            "id": "eua0jo2",
            "parent_id": "t1_eu9temh",
            "score": 1,
            "created_utc": 1563596667.0,
            "replies": []
        },
        {
            "body": "Okay, I need you to take three steps back. I have been reading it and I was just asking for elaboration. There is no need to get nasty about it, as I am just trying to learn.",
            "author": "Sb_sherbert",
            "id": "if0j65i",
            "parent_id": "t1_if0iwv8",
            "score": 1,
            "created_utc": 1657067877.0,
            "replies": []
        },
        {
            "body": "How do sugar mommies or daddies actually pay, from their own savings or like from a company.\n\nSo the best way is for them to meet you with cash each week?\n\nAlso would a prepaid card work?",
            "author": "realhero123",
            "id": "enoioas",
            "parent_id": "t1_enofgf0",
            "score": 1,
            "created_utc": 1557959800.0,
            "replies": [
                {
                    "body": "I withdraw cash from my checking account. I can't speak for how married SD do it. If anyone offers to out you on the payroll, do not agree. Prepaid cards can work, but you could also get scammed easier and cash is just as easy for the sd anyway so they have no reason not to use cash.",
                    "author": "sexviewer",
                    "id": "enolzwr",
                    "parent_id": "t1_enoioas",
                    "score": 2,
                    "created_utc": 1557961021.0,
                    "replies": [
                        {
                            "body": "Ok thanks for the advice I’ll make it clear I want my payment in cash",
                            "author": "realhero123",
                            "id": "enon7tk",
                            "parent_id": "t1_enolzwr",
                            "score": 1,
                            "created_utc": 1557961489.0,
                            "replies": []
                        },
                        {
                            "body": "I have another question, you pay each time you meet, not a “weekly allowance”, right?\n\nAlso do you know the average amount of payment in NY? For sugar babies(men and woman)?\n\nThanks",
                            "author": "realhero123",
                            "id": "entobgn",
                            "parent_id": "t1_enolzwr",
                            "score": 1,
                            "created_utc": 1558045196.0,
                            "replies": [
                                {
                                    "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
                                    "author": "sexviewer",
                                    "id": "entwkc9",
                                    "parent_id": "t1_entobgn",
                                    "score": 1,
                                    "created_utc": 1558048714.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can cashapp be reversed? Is that true?",
            "author": "kandiikittenx",
            "id": "exg4ip8",
            "parent_id": "t1_enofgf0",
            "score": 1,
            "created_utc": 1566255301.0,
            "replies": [
                {
                    "body": "Not easily, but yes it can. Why not just do cash? It's by far the safest and once you establish trust you can move to digital payments instead.",
                    "author": "sexviewer",
                    "id": "exg7ek8",
                    "parent_id": "t1_exg4ip8",
                    "score": 1,
                    "created_utc": 1566257137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"What happens if I commit fraud?\"",
            "author": "ulyssesjack",
            "id": "ii6pehu",
            "parent_id": "t1_es1sq4b",
            "score": 1,
            "created_utc": 1659133057.0,
            "replies": []
        },
        {
            "body": "Perfect comment. Well off people will never know the kind of desperation that drives people to fall for something like this. A lot of people view sugaring as a desperate move too actually. And in some cases it definitely is.",
            "author": "Cookie_Duchess",
            "id": "eh7eyr7",
            "parent_id": "t1_eh7a6ui",
            "score": 11,
            "created_utc": 1551048067.0,
            "replies": []
        },
        {
            "body": "The presumption here is that people who are well-off have never struggled...or the idea that the well off dont fall for these scams either. \nNaivity is not bound by class, race, sex etc...",
            "author": "A_Good_Decision",
            "id": "eh81rxp",
            "parent_id": "t1_eh7a6ui",
            "score": 2,
            "created_utc": 1551067246.0,
            "replies": []
        },
        {
            "body": "Seriously? This is exactly the attitude of a scammer or con artist.",
            "author": null,
            "id": "eh904yl",
            "parent_id": "t1_eh6l618",
            "score": 6,
            "created_utc": 1551109333.0,
            "replies": [
                {
                    "body": "No because I know it's wrong and wouldn't ever do something like that. Just because one *can* do something doesn't mean they should or will. ",
                    "author": null,
                    "id": "eh90gg3",
                    "parent_id": "t1_eh904yl",
                    "score": 2,
                    "created_utc": 1551109571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they reverse it, that’s fine. I just hope it won’t be reported as fraud to my card company, as through some reading I’ve heard they’ll shut them out. I’m so sad because this is work I want to get into but I have no real guidance; to know that I’ve screwed up so badly. Ah.\n\nDid they close your friend’s account?",
            "author": "issitohbi",
            "id": "em8pun8",
            "parent_id": "t1_em8o5iy",
            "score": 1,
            "created_utc": 1556732060.0,
            "replies": [
                {
                    "body": "they didnt shut my friends account...i suppose its possible, but probably not if you just do it once",
                    "author": "buckeyebil1",
                    "id": "em9gmk3",
                    "parent_id": "t1_em8pun8",
                    "score": 1,
                    "created_utc": 1556747138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It might not even be her account. So a few weeks after mine cleared, the bank of whoever it belonged to bounced it as an unauthorized charge. My card was fine, I just had to pay the balance as I would have, but they did an audit and last week closed my account for fraud because I didn’t have authorization to use that account - because it was removed by the bank as unauthorized. I’m sorry to hear you were scammed as well :(",
            "author": "issitohbi",
            "id": "eramur8",
            "parent_id": "t1_eramoes",
            "score": 1,
            "created_utc": 1560648010.0,
            "replies": [
                {
                    "body": "Oh no, that's terrifying! Did the accidental fraud hurt your credit score? Did you get to keep the funds in your account when they closed it? Were you able to open a new account. I hadn't even considered that she might be using someone else's account to scam me. This has been my first encounter with sugaring and it's starting to feel like I need an education in finance just to sugar!",
                    "author": "reciphered",
                    "id": "eranjfr",
                    "parent_id": "t1_eramur8",
                    "score": 2,
                    "created_utc": 1560648471.0,
                    "replies": [
                        {
                            "body": "It wasn’t my first experience with sugaring or my first that started online, but it was definitely new to me to be scammed like this! Don’t feel bad or discouraged. Answering your questions:\n\n- I had $570 of a $1,000 balance available, I now have $0 available and am paying off the amount I had used plus the bounced payment fee\n\n- I have accounts with two other major credit companies and two stores, so I don’t plan to open another account right now because that will show me as seeking too actively\n\n- The app for that specific card would report my credit score, it was last 680. (I’m new to credit building so this was very high for me!) I’m not sure if there’s variation across different methods of checking the score, but my other major credit card reports through someone else. My score as shown by that company is now 630. Because I just set up the credit check though, I don’t know if it was higher or a variation thing. My mom and partner who have authorization to use my card(s) don’t have a drop in score, though. I was told authorizing them would bind the credit scores.\n\nWhat’s funny is that I went to school for Accounting, yet here I am. Ironic.\n\nEdit: listed 650 instead of 630",
                            "author": "issitohbi",
                            "id": "erasne1",
                            "parent_id": "t1_eranjfr",
                            "score": 1,
                            "created_utc": 1560651973.0,
                            "replies": [
                                {
                                    "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
                                    "author": "reciphered",
                                    "id": "eray0qs",
                                    "parent_id": "t1_erasne1",
                                    "score": 1,
                                    "created_utc": 1560655729.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just be super careful out there. PayPal is getting pretty bad. ",
            "author": "queenpompadour",
            "id": "eh7gq11",
            "parent_id": "t1_eh7gf94",
            "score": 1,
            "created_utc": 1551049331.0,
            "replies": [
                {
                    "body": "Yup, PayPal if far from the safest way to get money. Also they will ban an account at the slightest whiff of it being for any type of sex work.",
                    "author": "sexviewer",
                    "id": "eh80w22",
                    "parent_id": "t1_eh7gq11",
                    "score": 3,
                    "created_utc": 1551066459.0,
                    "replies": [
                        {
                            "body": "Is Venmo or CashApp safe to get money? ",
                            "author": "A13MS2013",
                            "id": "eij8aca",
                            "parent_id": "t1_eh80w22",
                            "score": 1,
                            "created_utc": 1552592315.0,
                            "replies": [
                                {
                                    "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
                                    "author": "sexviewer",
                                    "id": "eijd24m",
                                    "parent_id": "t1_eij8aca",
                                    "score": 3,
                                    "created_utc": 1552595169.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I withdraw cash from my checking account. I can't speak for how married SD do it. If anyone offers to out you on the payroll, do not agree. Prepaid cards can work, but you could also get scammed easier and cash is just as easy for the sd anyway so they have no reason not to use cash.",
            "author": "sexviewer",
            "id": "enolzwr",
            "parent_id": "t1_enoioas",
            "score": 2,
            "created_utc": 1557961021.0,
            "replies": [
                {
                    "body": "Ok thanks for the advice I’ll make it clear I want my payment in cash",
                    "author": "realhero123",
                    "id": "enon7tk",
                    "parent_id": "t1_enolzwr",
                    "score": 1,
                    "created_utc": 1557961489.0,
                    "replies": []
                },
                {
                    "body": "I have another question, you pay each time you meet, not a “weekly allowance”, right?\n\nAlso do you know the average amount of payment in NY? For sugar babies(men and woman)?\n\nThanks",
                    "author": "realhero123",
                    "id": "entobgn",
                    "parent_id": "t1_enolzwr",
                    "score": 1,
                    "created_utc": 1558045196.0,
                    "replies": [
                        {
                            "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
                            "author": "sexviewer",
                            "id": "entwkc9",
                            "parent_id": "t1_entobgn",
                            "score": 1,
                            "created_utc": 1558048714.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not easily, but yes it can. Why not just do cash? It's by far the safest and once you establish trust you can move to digital payments instead.",
            "author": "sexviewer",
            "id": "exg7ek8",
            "parent_id": "t1_exg4ip8",
            "score": 1,
            "created_utc": 1566257137.0,
            "replies": []
        },
        {
            "body": "No because I know it's wrong and wouldn't ever do something like that. Just because one *can* do something doesn't mean they should or will. ",
            "author": null,
            "id": "eh90gg3",
            "parent_id": "t1_eh904yl",
            "score": 2,
            "created_utc": 1551109571.0,
            "replies": []
        },
        {
            "body": "they didnt shut my friends account...i suppose its possible, but probably not if you just do it once",
            "author": "buckeyebil1",
            "id": "em9gmk3",
            "parent_id": "t1_em8pun8",
            "score": 1,
            "created_utc": 1556747138.0,
            "replies": []
        },
        {
            "body": "Oh no, that's terrifying! Did the accidental fraud hurt your credit score? Did you get to keep the funds in your account when they closed it? Were you able to open a new account. I hadn't even considered that she might be using someone else's account to scam me. This has been my first encounter with sugaring and it's starting to feel like I need an education in finance just to sugar!",
            "author": "reciphered",
            "id": "eranjfr",
            "parent_id": "t1_eramur8",
            "score": 2,
            "created_utc": 1560648471.0,
            "replies": [
                {
                    "body": "It wasn’t my first experience with sugaring or my first that started online, but it was definitely new to me to be scammed like this! Don’t feel bad or discouraged. Answering your questions:\n\n- I had $570 of a $1,000 balance available, I now have $0 available and am paying off the amount I had used plus the bounced payment fee\n\n- I have accounts with two other major credit companies and two stores, so I don’t plan to open another account right now because that will show me as seeking too actively\n\n- The app for that specific card would report my credit score, it was last 680. (I’m new to credit building so this was very high for me!) I’m not sure if there’s variation across different methods of checking the score, but my other major credit card reports through someone else. My score as shown by that company is now 630. Because I just set up the credit check though, I don’t know if it was higher or a variation thing. My mom and partner who have authorization to use my card(s) don’t have a drop in score, though. I was told authorizing them would bind the credit scores.\n\nWhat’s funny is that I went to school for Accounting, yet here I am. Ironic.\n\nEdit: listed 650 instead of 630",
                    "author": "issitohbi",
                    "id": "erasne1",
                    "parent_id": "t1_eranjfr",
                    "score": 1,
                    "created_utc": 1560651973.0,
                    "replies": [
                        {
                            "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
                            "author": "reciphered",
                            "id": "eray0qs",
                            "parent_id": "t1_erasne1",
                            "score": 1,
                            "created_utc": 1560655729.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, PayPal if far from the safest way to get money. Also they will ban an account at the slightest whiff of it being for any type of sex work.",
            "author": "sexviewer",
            "id": "eh80w22",
            "parent_id": "t1_eh7gq11",
            "score": 3,
            "created_utc": 1551066459.0,
            "replies": [
                {
                    "body": "Is Venmo or CashApp safe to get money? ",
                    "author": "A13MS2013",
                    "id": "eij8aca",
                    "parent_id": "t1_eh80w22",
                    "score": 1,
                    "created_utc": 1552592315.0,
                    "replies": [
                        {
                            "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
                            "author": "sexviewer",
                            "id": "eijd24m",
                            "parent_id": "t1_eij8aca",
                            "score": 3,
                            "created_utc": 1552595169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok thanks for the advice I’ll make it clear I want my payment in cash",
            "author": "realhero123",
            "id": "enon7tk",
            "parent_id": "t1_enolzwr",
            "score": 1,
            "created_utc": 1557961489.0,
            "replies": []
        },
        {
            "body": "I have another question, you pay each time you meet, not a “weekly allowance”, right?\n\nAlso do you know the average amount of payment in NY? For sugar babies(men and woman)?\n\nThanks",
            "author": "realhero123",
            "id": "entobgn",
            "parent_id": "t1_enolzwr",
            "score": 1,
            "created_utc": 1558045196.0,
            "replies": [
                {
                    "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
                    "author": "sexviewer",
                    "id": "entwkc9",
                    "parent_id": "t1_entobgn",
                    "score": 1,
                    "created_utc": 1558048714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It wasn’t my first experience with sugaring or my first that started online, but it was definitely new to me to be scammed like this! Don’t feel bad or discouraged. Answering your questions:\n\n- I had $570 of a $1,000 balance available, I now have $0 available and am paying off the amount I had used plus the bounced payment fee\n\n- I have accounts with two other major credit companies and two stores, so I don’t plan to open another account right now because that will show me as seeking too actively\n\n- The app for that specific card would report my credit score, it was last 680. (I’m new to credit building so this was very high for me!) I’m not sure if there’s variation across different methods of checking the score, but my other major credit card reports through someone else. My score as shown by that company is now 630. Because I just set up the credit check though, I don’t know if it was higher or a variation thing. My mom and partner who have authorization to use my card(s) don’t have a drop in score, though. I was told authorizing them would bind the credit scores.\n\nWhat’s funny is that I went to school for Accounting, yet here I am. Ironic.\n\nEdit: listed 650 instead of 630",
            "author": "issitohbi",
            "id": "erasne1",
            "parent_id": "t1_eranjfr",
            "score": 1,
            "created_utc": 1560651973.0,
            "replies": [
                {
                    "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
                    "author": "reciphered",
                    "id": "eray0qs",
                    "parent_id": "t1_erasne1",
                    "score": 1,
                    "created_utc": 1560655729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is Venmo or CashApp safe to get money? ",
            "author": "A13MS2013",
            "id": "eij8aca",
            "parent_id": "t1_eh80w22",
            "score": 1,
            "created_utc": 1552592315.0,
            "replies": [
                {
                    "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
                    "author": "sexviewer",
                    "id": "eijd24m",
                    "parent_id": "t1_eij8aca",
                    "score": 3,
                    "created_utc": 1552595169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do pay each meet, but since I meet once a week ideally, I am comfortable calling it a weekly allowance (and I have done that) so long as we meet at least once. Since I won't suggest meeting more to take advantage it works out well.\n\nI cannot tell you the average allowance for female SB unfortunately. Check the allowance master thread in the sidebar for that. Do note that it is likely to lean high since people are unlikely to self report low  allowance. Male SB will likely get no allowance if they are straight.",
            "author": "sexviewer",
            "id": "entwkc9",
            "parent_id": "t1_entobgn",
            "score": 1,
            "created_utc": 1558048714.0,
            "replies": []
        },
        {
            "body": "Wow, even you - an accountant is overwhelmed by the financial knowledge out there. I realized that even if the account information I've received is genuinely hers; I don't know how to go about legally using it to pay off my credit card. Do you? Surely there must be some sort of paperwork that must be done. \n\nI never knew these payments where reversible until this post. Have you figured out any safe ways to digitally receive sugar?\n\nedit: If you've read this far and are in a similar scenario, it's a scam. Definitely call your bank ASAP.\nThe check will appear to go through but then a week and some days later you'll learn it's bounced. inspect the check very closely/ You'll probably notice a few warning signs like that the bank is not located anywhere near where the SD claims to be located or is from an organization that has enough oversight such that this would never realistically happen.\nThe funds you received will be rescinded. The account sending you the funds is likely compromised & the legitimate account owner is likely owed a warning. In hindsight the level of absurdity the increasingly desperate scam reached is kinda amusing. They had a fake FBI agent text me from another account after I wised up but they accidentally got their fake names mixed up",
            "author": "reciphered",
            "id": "eray0qs",
            "parent_id": "t1_erasne1",
            "score": 1,
            "created_utc": 1560655729.0,
            "replies": []
        },
        {
            "body": "Safer than paypal, but not safe. The person has to jump through more hoops to reverse the charges, but it can be done. Use cash only.",
            "author": "sexviewer",
            "id": "eijd24m",
            "parent_id": "t1_eij8aca",
            "score": 3,
            "created_utc": 1552595169.0,
            "replies": []
        }
    ]
}