{
    "title": "TW: Abortion & Roe v Wade",
    "post_id": "vjqkiw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vjqkiw/tw_abortion_roe_v_wade/",
    "author": "SatansBirthdayCake",
    "body": "I’m gonna get blasted for this probably, but idgaf. \n\nGround rules: if you don’t have anything nice to say, don’t say anything at all. SDs, this affects you too and you should be ashamed if you think forcing a woman to carry a pregnancy she doesn’t want is appropriate. \n\nTo all the SBs who are [grieving the loss of your rights today](https://www.wsj.com/livecoverage/supreme-court-decision-roe-v-wade-6-24-2022), please know that I’m here for you and sending you a virtual hug if you want one. We’re in this together and you deserve to have autonomy over your life and your body. \n\nIt’s an important issue in the bowl since this is something that happens (and we’ve seen it happen). \n\nI know some of you are gonna say “well it doesn’t affect you if you still have access or can travel” and that’s still a shit take.\n\nLove you all and sending you good vibes to stay safe and that your birth control never fails. SDs step up that pull out game while it’s wrapped up and make that appt to get snipped. Don’t put your SB at unnecessary risk. \n\nMy DMs are open if anyone wants to talk or needs support.\n\nEdit to add: thank you all for supporting others and the awards. Please make sure you donate to your local communities and organize. Give the people who can make a difference your support. Your wallets really have the power here. \n\nFor those of you celebrating or saying that this isn’t that bad: marital privacy is on the chopping block now (looking at you married SDs). So are interracial marriages and relationships. So is sodomy (anal). You’ve been warned. Your GOP doesn’t care about you or your kids.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vjqkiw/tw_abortion_roe_v_wade/",
    "score": 272,
    "upvote_ratio": 0.87,
    "created_utc": 1656083194.0,
    "num_comments": 175,
    "links": [
        [
            "https://www.wsj.com/livecoverage/supreme-court-decision-roe-v-wade-6-24-2022"
        ]
    ],
    "comments": [
        {
            "body": "Okay everyone hope you guys have gotten the need to discuss this topic out of your system on the 2 threads that were created today. I am shutting it down. All that need to be said have been said and letting this conversation go on further will yield nothing positive. \n\nUnless there is a particular clause in this new ruling that specifically mention sugar dating, SDs or SBs this conversation will not be allowed on SLF. **Do not create any more threads**",
            "author": "LaSirene23",
            "id": "idmppln",
            "parent_id": "t3_vjqkiw",
            "score": 1,
            "created_utc": 1656117217.0,
            "replies": []
        },
        {
            "body": "Women should know to never ever talk to the police.   If you have a miscarriage, do not answer questions and ask for a lawyer.     Give your doctor as little information as possible.   Don't mention drug use or any behavior that might have caused a miscarriage.  Even before this hideous decision, the backward religious shit hole states were charging women with murder.   Now its only going to get worse.    Don't talk to the police and I am sorry this happened.",
            "author": "catfarts99",
            "id": "idkufud",
            "parent_id": "t3_vjqkiw",
            "score": 74,
            "created_utc": 1656089120.0,
            "replies": [
                {
                    "body": "What you are describing has already happened in California, of all places. 😞",
                    "author": "Chill_SD1974",
                    "id": "idkx3n0",
                    "parent_id": "t1_idkufud",
                    "score": 9,
                    "created_utc": 1656090108.0,
                    "replies": []
                },
                {
                    "body": "Wait, what?! Why would a woman be speaking to the police due to a miscarriage and then need a lawyer? I won’t lie; I have intentionally stopped paying attention to the news and I have been on an Instagram and Facebook hiatus for a little over a year now. This was all for my well-being and I obviously am still aware of some of the bigger issues going on like overturning Roe v Wade. But I’m genuinely scared and confused about your advice about how to handle a miscarriage; are we now living the real life version of The Handmaids Tale?!",
                    "author": "PinkFancyCrane",
                    "id": "idm160t",
                    "parent_id": "t1_idkufud",
                    "score": 8,
                    "created_utc": 1656106047.0,
                    "replies": [
                        {
                            "body": "Yes. Miscarriages will be investigated to see if it was intentionally caused and women will be made criminals for it who can’t vote. That’s the point.",
                            "author": "SatansBirthdayCake",
                            "id": "idm40nv",
                            "parent_id": "t1_idm160t",
                            "score": 22,
                            "created_utc": 1656107262.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "With the Miranda Rights struck down as well, we all need to stick to our lawyers and civil rights. Don’t speak to cops. Ever. No matter what they say. They will make up anything to get you to speak.",
                    "author": "acrowmion",
                    "id": "idmf19b",
                    "parent_id": "t1_idkufud",
                    "score": 5,
                    "created_utc": 1656112131.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I’ve already cried today about this 🙃\n\nANYWAY…..\nHere are some resources I found: \n\n[Steps on what to do next & access to medical abortion pills](https://www.threeforfreedom.com)\n\n[Article that says when states are going to ban abortions](https://www.forbes.com/sites/alisondurkee/2022/06/24/roe-v-wade-overturned-heres-when-states-will-start-banning-abortion---and-which-already-have/amp/)\n\n[Really simple website where you can choose your state to see their abortion laws](https://www.politico.com/news/2022/06/24/abortion-laws-by-state-roe-v-wade-00037695)\n\nAlso, this affects people who are trying to get pregnant and then run into complications, like a miscarriage. Make sure you save up 500 to 800 for the procedure alone, plus any travel expenses in case your state is banned or there are unavailable appointments.",
            "author": "Sweetcheeks864",
            "id": "idkpeo3",
            "parent_id": "t3_vjqkiw",
            "score": 73,
            "created_utc": 1656087256.0,
            "replies": [
                {
                    "body": "Thank you very much. Idk how to feel right now. This will change many lives. \n\nLadies you can also order birth control from pharmacies in Canada that will ship it to your home…they will try to tear down access to birth control next.\n\nWomen interested in attending a protest check here for protests all over!: https://www.womensmarch.com/",
                    "author": null,
                    "id": "idl1lpa",
                    "parent_id": "t1_idkpeo3",
                    "score": 20,
                    "created_utc": 1656091814.0,
                    "replies": [
                        {
                            "body": "Misoprostol is used to treat ulcers in horses and available at the same veterinarian places you buy your ivermectin.",
                            "author": "aajniojnoihnoi",
                            "id": "idmmo8t",
                            "parent_id": "t1_idl1lpa",
                            "score": 10,
                            "created_utc": 1656115743.0,
                            "replies": [
                                {
                                    "body": "Thanks for the information. I don’t need an abortion but people like you willing to help are appreciated.",
                                    "author": null,
                                    "id": "idmo7rw",
                                    "parent_id": "t1_idmmo8t",
                                    "score": 5,
                                    "created_utc": 1656116486.0,
                                    "replies": [
                                        {
                                            "body": "Advice on DIY abortion techniques:\n\nhttps://archive.org/details/FTVDIYA",
                                            "author": "aajniojnoihnoi",
                                            "id": "idmoqk7",
                                            "parent_id": "t1_idmo7rw",
                                            "score": 4,
                                            "created_utc": 1656116740.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah I feel a lot of things too, but mostly sadness and heart ache. \n\nI hate it here and it just adds to the list of wanting to move to Australia even more",
                            "author": "Sweetcheeks864",
                            "id": "idl461i",
                            "parent_id": "t1_idl1lpa",
                            "score": 5,
                            "created_utc": 1656092797.0,
                            "replies": [
                                {
                                    "body": "I feel the same on wanting to leave the US now. Gonna go outside & do something to stop thinking about this. \n\nI have to get long term birth control now & deal with the side effects on my body. I’m scared & angry for women…but it’s nice outside & I’ll find a protest to attend in the future. \n\nHugs",
                                    "author": null,
                                    "id": "idl98z1",
                                    "parent_id": "t1_idl461i",
                                    "score": 6,
                                    "created_utc": 1656094776.0,
                                    "replies": [
                                        {
                                            "body": "A female condom is an option too, if you want minimal side effects! \n\nEnjoy your day outside 🙂",
                                            "author": "Sweetcheeks864",
                                            "id": "idlgiau",
                                            "parent_id": "t1_idl98z1",
                                            "score": 2,
                                            "created_utc": 1656097647.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks. There’s protests happening this weekend & things. I still don’t feel a lot better about this. Going to 1 now. Here’s a link of protests all over if interested: https://www.womensmarch.com/",
                                                    "author": null,
                                                    "id": "idlsrrp",
                                                    "parent_id": "t1_idlgiau",
                                                    "score": 4,
                                                    "created_utc": 1656102574.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.forbes.com/sites/alisondurkee/2022/06/24/roe-v-wade-overturned-heres-when-states-will-start-banning-abortion---and-which-already-have/](https://www.forbes.com/sites/alisondurkee/2022/06/24/roe-v-wade-overturned-heres-when-states-will-start-banning-abortion---and-which-already-have/)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                    "author": "AmputatorBot",
                    "id": "idkpg2y",
                    "parent_id": "t1_idkpeo3",
                    "score": 0,
                    "created_utc": 1656087271.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Abortion is now banned **with no exceptions for rape or incest** in Alabama, Arkansas, Kentucky, Louisiana, Missouri, South Dakota, Tennessee, and Texas.\n\nFucking barbaric.",
            "author": "ExpertPerformance",
            "id": "idl9nva",
            "parent_id": "t3_vjqkiw",
            "score": 46,
            "created_utc": 1656094937.0,
            "replies": [
                {
                    "body": "It's cool(\\*) that applies to 10 year old girls, who can and do get pregnant from rape or incest.\n\n(\\* spoiler: it isn't cool)",
                    "author": "highfructoseSD",
                    "id": "idlgv1v",
                    "parent_id": "t1_idl9nva",
                    "score": 20,
                    "created_utc": 1656097790.0,
                    "replies": []
                },
                {
                    "body": "Blue states should be very restrictive about providing services to women from these states when they come to civilization for abortions. At a minimum, proof that the woman and erstwhile father did not vote Republican 2016 - present",
                    "author": "throwawayaccount0327",
                    "id": "idlaq0f",
                    "parent_id": "t1_idl9nva",
                    "score": -7,
                    "created_utc": 1656095355.0,
                    "replies": [
                        {
                            "body": "Nah we don’t play that game here. We don’t restrict access to a woman in need. No matter your background, political leanings, heritage, etc. we absolutely DO NOT discriminate or refuse to help a woman in need. \n\nIf we do, we’re no better than the monsters who made this decision for us today.",
                            "author": "SatansBirthdayCake",
                            "id": "idlb417",
                            "parent_id": "t1_idlaq0f",
                            "score": 33,
                            "created_utc": 1656095510.0,
                            "replies": [
                                {
                                    "body": "Ijs, in the Handmaid's Tale Ofglen leads a woman to her death for being a bitch to her fellow woman. \n\nI'm tired of the \"take the high road\" politics. We've been doing that since the 90s and now we're here, at overturning something that is literally deletes autonomy. Saying \"states rights\" is being ignorant, we fought a fucking civil war over this ffs 🙄 Democrats have been playing fair, it isn't working. \n\nGloves fucking off or get ye behind me. Losing your rights isn't a \"turn the other cheek\" moment. It isn't a \"forgive thy neighbor\" moment. Go with grace in everywhere else in life, but not this fight and not right now.",
                                    "author": "2catsandacomputer",
                                    "id": "idmgtne",
                                    "parent_id": "t1_idlb417",
                                    "score": 4,
                                    "created_utc": 1656112957.0,
                                    "replies": []
                                },
                                {
                                    "body": "And failing to fight evil with evil is a prescription for losing when you walk through the shadow of the valley of death. \n\nI can be my best self when not staring down the barrel of a 6-3 revanchist SCOTUS. Until then, all bets are off.",
                                    "author": "throwawayaccount0327",
                                    "id": "idlbt7k",
                                    "parent_id": "t1_idlb417",
                                    "score": 1,
                                    "created_utc": 1656095790.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As I pointed out in the Rant/Rave thread, Thomas, in his concurring opinion, outright states that the cases granting the rights to birth control, same sex marriage, and the right to engage in whatever kind of sexual activity you want in the privacy of your own home were \"wrongly decided.\" His concurrence *literally* tells the states to challenge these laws as well so the court can \"correct the error.\"  \n\nhttps://twitter.com/kyledcheney/status/1540338505242525698\n\nAnyone who thinks this case doesn't affect them just isn't paying attention.",
            "author": "Y_4Z44",
            "id": "idkfb14",
            "parent_id": "t3_vjqkiw",
            "score": 61,
            "created_utc": 1656083449.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkrd7t",
                    "parent_id": "t1_idkfb14",
                    "score": 26,
                    "created_utc": 1656087982.0,
                    "replies": [
                        {
                            "body": "I wouldn’t be surprised if Thomas, completely devoid of any self awareness or irony, penned an overruling of Loving.",
                            "author": "j19104",
                            "id": "idkzeo5",
                            "parent_id": "t1_idkrd7t",
                            "score": 10,
                            "created_utc": 1656090985.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So this Court says it’s up to the states in Roe, but NY’s gun law is too restrictive just show’s they are zealous activists and not neutral.  They deserve the scorn that is coming.",
                    "author": "nametken",
                    "id": "idlia30",
                    "parent_id": "t1_idkfb14",
                    "score": 5,
                    "created_utc": 1656098360.0,
                    "replies": [
                        {
                            "body": "Its up to congress to put abortion in the constitution. Hopefully they do that by wednesday",
                            "author": "NotARussianBot1984",
                            "id": "idmjbh3",
                            "parent_id": "t1_idlia30",
                            "score": 0,
                            "created_utc": 1656114136.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "From Europe I grieve with you today! Hugs and kisses for everyone that wants/needs them!",
            "author": "noLeatherPlease",
            "id": "idks5re",
            "parent_id": "t3_vjqkiw",
            "score": 21,
            "created_utc": 1656088278.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkss5k",
                    "parent_id": "t1_idks5re",
                    "score": 8,
                    "created_utc": 1656088508.0,
                    "replies": [
                        {
                            "body": "Yeah, I agree there, some more countries as well unfortunately :(",
                            "author": "noLeatherPlease",
                            "id": "idktjge",
                            "parent_id": "t1_idkss5k",
                            "score": 4,
                            "created_utc": 1656088789.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The women most affected are those who can ill afford to take time off work and travel.\n\nIf you are thinking of terminating your pregnancy and need to travel out of State there is a subreddit called the Auntie Network where you can get some information as well as logistical help and emotional support from other women.\n\nIf you are in a position to help another lady (maybe you have a spare room for  someone from out of State or maybe you can accompany her to her appointment or stay with her afterward) consider joining the network.\n\n[https://www.reddit.com/r/auntienetwork/](https://www.reddit.com/r/auntienetwork/)",
            "author": "LightOLove",
            "id": "idkmoiw",
            "parent_id": "t3_vjqkiw",
            "score": 42,
            "created_utc": 1656086231.0,
            "replies": [
                {
                    "body": "Just only sleep with men that can afford to pay you to take time off work.",
                    "author": "NotARussianBot1984",
                    "id": "idmjj45",
                    "parent_id": "t1_idkmoiw",
                    "score": -6,
                    "created_utc": 1656114238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pro Birth NOT Pro Life",
            "author": "SD1070",
            "id": "idkn9fz",
            "parent_id": "t3_vjqkiw",
            "score": 50,
            "created_utc": 1656086447.0,
            "replies": [
                {
                    "body": "Pro *forced*-birth.",
                    "author": "Y_4Z44",
                    "id": "idknhom",
                    "parent_id": "t1_idkn9fz",
                    "score": 52,
                    "created_utc": 1656086533.0,
                    "replies": [
                        {
                            "body": "State mandated pregnancy",
                            "author": "SD1070",
                            "id": "idknt4f",
                            "parent_id": "t1_idknhom",
                            "score": 19,
                            "created_utc": 1656086653.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "FORCED birth",
                    "author": "climbitdontcarryit",
                    "id": "idks422",
                    "parent_id": "t1_idkn9fz",
                    "score": 17,
                    "created_utc": 1656088260.0,
                    "replies": []
                },
                {
                    "body": "Pro Subjugation of Women",
                    "author": "ExpertPerformance",
                    "id": "idkyxfu",
                    "parent_id": "t1_idkn9fz",
                    "score": 8,
                    "created_utc": 1656090801.0,
                    "replies": []
                },
                {
                    "body": "Pro slavery",
                    "author": "NotARussianBot1984",
                    "id": "idmjdfb",
                    "parent_id": "t1_idkn9fz",
                    "score": 2,
                    "created_utc": 1656114162.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pretty sure I'm done sugaring (or any type of dating), until I either leave Georgia, or get a vasectomy at this point.\n\nWhy the fuck do people in 2022 still believe  that \"religious leaders\" speak for a a Pretend Man in the Sky, that was created to explain why the Sun rises, and every other unexplained phenomena?\n\n(Note:  I'm not challenging whether there is a greater power or not;  but rather organized religion has anything to do with it.  Answer:  They do not).",
            "author": "SDstartingOut",
            "id": "idky82b",
            "parent_id": "t3_vjqkiw",
            "score": 31,
            "created_utc": 1656090531.0,
            "replies": [
                {
                    "body": "So many reasons for a vasectomy…",
                    "author": "jacknjilled",
                    "id": "idmlv9t",
                    "parent_id": "t1_idky82b",
                    "score": 3,
                    "created_utc": 1656115360.0,
                    "replies": []
                },
                {
                    "body": "Hail Satan.",
                    "author": "aajniojnoihnoi",
                    "id": "idmmrc0",
                    "parent_id": "t1_idky82b",
                    "score": 4,
                    "created_utc": 1656115785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Making an appointment to get my IUD now 🥴",
            "author": "cherryribs",
            "id": "idlf2et",
            "parent_id": "t3_vjqkiw",
            "score": 14,
            "created_utc": 1656097074.0,
            "replies": [
                {
                    "body": "Godspeed 🙏",
                    "author": "SatansBirthdayCake",
                    "id": "idlp9rg",
                    "parent_id": "t1_idlf2et",
                    "score": 6,
                    "created_utc": 1656101165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What's sad and unbelievable is that you  know there are still gonna be guys wanting and asking for bare 😵‍💫😒🤦🏾‍♀️",
            "author": "Zia19",
            "id": "idlvzwa",
            "parent_id": "t3_vjqkiw",
            "score": 12,
            "created_utc": 1656103887.0,
            "replies": []
        },
        {
            "body": "Fucking gutted by the acts of these backwards-ass halfwits. My heart goes out to every girl or woman impacted by this; my votes, as always, go out to overturn this latest decision, and my contributions go to those fighting to bring medical alternatives to those that need them",
            "author": "Toojew4u",
            "id": "idkrxet",
            "parent_id": "t3_vjqkiw",
            "score": 12,
            "created_utc": 1656088192.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for all the women of this country and on this forum. I and every man on this forum supports you and your right to guide your own lives. Any man who who doesn't should gtfo.",
            "author": "Sfclover",
            "id": "idlpj8t",
            "parent_id": "t3_vjqkiw",
            "score": 10,
            "created_utc": 1656101271.0,
            "replies": []
        },
        {
            "body": "It's a sad day when guns have more constitutional protection than women. This targets the poor and minority the most. \n\nThat being said...we took care of each other before Roe and will do so after Roe. Unjust laws are meant to be broken.",
            "author": "LadyMorgan2018",
            "id": "idkmwaz",
            "parent_id": "t3_vjqkiw",
            "score": 37,
            "created_utc": 1656086311.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkrt3m",
                    "parent_id": "t1_idkmwaz",
                    "score": 5,
                    "created_utc": 1656088146.0,
                    "replies": [
                        {
                            "body": "If by civil disobedience you mean assist with helping women get the care they have the human right to have...then yes. Between medicinal abortions, contraception via mail,  and abortion tourism ..women will get what they need. \n\nWe take care of our own. No one else will.",
                            "author": "LadyMorgan2018",
                            "id": "idkupkk",
                            "parent_id": "t1_idkrt3m",
                            "score": 7,
                            "created_utc": 1656089221.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "idkvmtx",
                                    "parent_id": "t1_idkupkk",
                                    "score": 2,
                                    "created_utc": 1656089566.0,
                                    "replies": [
                                        {
                                            "body": "Clinics are going up in women-friendly states to meet the demand. The abortion underground will not likely set up brick and mortar clinics. If you haven't seen \"The Janes,\" I recommend it. Yes, they were active pre-Roe, but it will happen again. Only this time, funding and support from places like NAF exists.",
                                            "author": "LadyMorgan2018",
                                            "id": "idkw9yt",
                                            "parent_id": "t1_idkvmtx",
                                            "score": 5,
                                            "created_utc": 1656089804.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "idkx3lf",
                                                    "parent_id": "t1_idkw9yt",
                                                    "score": 1,
                                                    "created_utc": 1656090107.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
                                                            "author": "LadyMorgan2018",
                                                            "id": "idkydtb",
                                                            "parent_id": "t1_idkx3lf",
                                                            "score": 3,
                                                            "created_utc": 1656090592.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "👏🏼👏🏼",
                    "author": "c0rnstarr",
                    "id": "idknmdt",
                    "parent_id": "t1_idkmwaz",
                    "score": 6,
                    "created_utc": 1656086582.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkq8dy",
                    "parent_id": "t1_idkmwaz",
                    "score": -3,
                    "created_utc": 1656087565.0,
                    "replies": [
                        {
                            "body": "I only mention guns, because it is that this recent SCOTUS has seen the most right wing activism we've had in decades. Voting rights, abortion rights, and the separation of church and state have been repealed, while gun right protection has been expanded. Unfortunately, it's a young court, so we are faced with more removal of rights. It will not be long before gay marriage is repealed and then....who knows?",
                            "author": "LadyMorgan2018",
                            "id": "idkvdy0",
                            "parent_id": "t1_idkq8dy",
                            "score": 3,
                            "created_utc": 1656089474.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "idkvvuo",
                                    "parent_id": "t1_idkvdy0",
                                    "score": 1,
                                    "created_utc": 1656089660.0,
                                    "replies": [
                                        {
                                            "body": "I will take this from my personal history with ACT UP in the 90s...\n\nACT UP! FIGHT BACK! ✊️",
                                            "author": "LadyMorgan2018",
                                            "id": "idkwi1b",
                                            "parent_id": "t1_idkvvuo",
                                            "score": 4,
                                            "created_utc": 1656089887.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> Gun rights or lack thereof also target poor and minority.\n\nHow so?",
                            "author": "whatever-tata",
                            "id": "idlcd9q",
                            "parent_id": "t1_idkq8dy",
                            "score": 1,
                            "created_utc": 1656096011.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thankful to live in a liberal state. Should any of you lovely people ever need help getting here for an abortion, DM me.",
            "author": null,
            "id": "idlfpdp",
            "parent_id": "t3_vjqkiw",
            "score": 9,
            "created_utc": 1656097328.0,
            "replies": [
                {
                    "body": "Liberal state as well.\n\n&#x200B;\n\nWelcome to host and care for any woman in need, DM as well.",
                    "author": "AubrynnSky",
                    "id": "idmdr0u",
                    "parent_id": "t1_idlfpdp",
                    "score": 7,
                    "created_utc": 1656111548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was absolutely disgusted to hear they overturned Roe v Wade today. I fear the long term repercussions of this harkening back to the days of women inflicting self harm to abort a child or having to go-to less than equipped facilities or traveling long distances to have a procedure that should be their RIGHT. This is one of the few times I'm proud to be in the state I'm in because of their very progressive views on reproductive rights and they e planned for this day back in 2017 and 2019. To all the women in this forum, you have my outrage and my sympathies. As an SD, I will always support my SB in any way she would like because that is her choice, her right and my responsibility.",
            "author": "manninc2000",
            "id": "idlp0g6",
            "parent_id": "t3_vjqkiw",
            "score": 9,
            "created_utc": 1656101061.0,
            "replies": [
                {
                    "body": "Can I dream that women’s reproductive rights will be codified in the Constitution in an updated version of the Equal Rights Amendment?",
                    "author": "ExpertPerformance",
                    "id": "idlyh9t",
                    "parent_id": "t1_idlp0g6",
                    "score": 3,
                    "created_utc": 1656104911.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Women interested in attending a protest check here for protests all over!: https://www.womensmarch.com/\n\n1 of those justices had a mistress he FORCED TO GET AN ABORTION! They’re hypocrites. Many politicians behind these changes are adulterers behind closed doors yet pushing evangelical, right wing Republican messages into law. \n\nTheir decision statement: “The Constitution does not confer a right to abortion; Roe and Casey are overruled; and the authority to regulate abortion is returned to the people and their elected representatives,”\n\n……so the constitution didn’t confer the right for black people to not be slaves either plus other amendments & laws passed since it was written. BS argument. \n\nThey want to return the choice to state representatives with many being republican boot lickers backed by a majority republican congress, a republican majority Supreme Court….they are coming after birth control & other women’s rights next. \n\nRight now! States like Louisiana, Kentucky, etc are triggering laws banning abortion into effect. Many other states are enacting laws that ban abortion after 6 weeks…the time by which a woman would even know she’s pregnant. \n\nThe TRUTH imo is they need more workers. More bodies to fill unskilled & low paying jobs or even future military ranks. Some even mention the Great Replacement Theory as a factor in why some bumfuck older, white men want to tear down abortion rights & soon birth control.\n\nTheir generation & backwards thinking that’s resistant to inherent free will & control of one’s body and destiny needs to end. They are setting the stage for mass protest & social unrest. I plan to protest too. \n\nSomething needs to change/rip the power & sway that Trumpism (another hypocrite who’s paid women to get abortions!) and republicans have on this country. Violence will follow if they keep this up. They do not practice what they preach. Integrity is not real to these people. Some may only understand loss.",
            "author": null,
            "id": "idkqbfq",
            "parent_id": "t3_vjqkiw",
            "score": 26,
            "created_utc": 1656087596.0,
            "replies": [
                {
                    "body": "> They’re hypocrites.\n\nThat's all that needs to be said.\n\nMany of these justices lied during their confirmation hearings.  \n\nHypocrisy of Organized religion is the most boundless in my experience.",
                    "author": "SDstartingOut",
                    "id": "idkyho8",
                    "parent_id": "t1_idkqbfq",
                    "score": 15,
                    "created_utc": 1656090633.0,
                    "replies": []
                },
                {
                    "body": "Trump appointed justices are his minions. This is just a flex by the Supreme Court. They don’t really pay attention to what is right and what is wrong they just want to be popular with neocons",
                    "author": "UnearthlyDinosaur",
                    "id": "idkvu1h",
                    "parent_id": "t1_idkqbfq",
                    "score": 7,
                    "created_utc": 1656089641.0,
                    "replies": [
                        {
                            "body": "> Trump appointed justices are his minions. This is just a flex by the Supreme Court. They don’t really pay attention to what is right and what is wrong they just want to be popular with neocons\n\nYou have this in reverse.\n\nThe Christian Conservatives made a deal with the Devil (Trump).  They supported him - someone completely devoid of any ethics, or morals - that would be considered \"good\" by society - with the promise that he would stack the court.  \n\nHe did.\n\nIf they were his minions - he'd still be President.\n\nYou can read plenty of articles out there - by conservatives effectively admitting it.  Roe v. Wade is their payoff, for supporting this shitty ass dude.",
                            "author": "SDstartingOut",
                            "id": "idkyrio",
                            "parent_id": "t1_idkvu1h",
                            "score": 14,
                            "created_utc": 1656090739.0,
                            "replies": [
                                {
                                    "body": "They ignored everything about him.\n\nThe affairs with porn stars, “grab her by the pussy”, lies he told easily disproven with facts, how he scammed many people out of money with Trump University, etc….he & his family were even convicted of misusing charity funds & banned from operating charities in New York. \n\nNot to mention him collecting millions of donations from his supporters to fund his meritless reelection claims that failed in every single court case (67 total I’ve read).\n\nHe is a danger because the evangelicals, right wing Christian, republicans, & moderate to extreme racists see a champion of their desires in him.\n\nRecently I’ve been going to the gun range…call me crazy but I FEEL for the 1st time in my life the need to get armed!",
                                    "author": null,
                                    "id": "idl0np0",
                                    "parent_id": "t1_idkyrio",
                                    "score": 9,
                                    "created_utc": 1656091453.0,
                                    "replies": []
                                },
                                {
                                    "body": "Word",
                                    "author": "UnearthlyDinosaur",
                                    "id": "idkz5ge",
                                    "parent_id": "t1_idkyrio",
                                    "score": 4,
                                    "created_utc": 1656090887.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Trump has hurt this country for decades by making the Supreme Court a republican majority.\n\nIn the court’s official ruling today, “Justice Clarence Thomas said the court should reconsider rulings that protect access to contraception, same-sex relationships, and same-sex marriage.”\n\nhttps://www.businessinsider.com/justice-thomas-said-the-court-should-reconsider-rulings-on-same-sex-marriage-2022-6\n\nThey are going to attempt to revert human rights, allow criminalization of gay people by state representatives passing homophobic laws, & send this country into madness. Do they REALLY think human beings are going to allow them to take us back to the past?…someone important will be killed by an opposing radical. Mark my words.",
                            "author": null,
                            "id": "idkxhm8",
                            "parent_id": "t1_idkvu1h",
                            "score": 8,
                            "created_utc": 1656090255.0,
                            "replies": [
                                {
                                    "body": "Clarence Thomas didn't mention interracial marriage though, which stems from the same set of due process rights he targeted, because he's married to a white woman. Republicans always draw the line at things that personally affect them when they're fucking the rest of us over.",
                                    "author": "Questiner",
                                    "id": "idlg2pg",
                                    "parent_id": "t1_idkxhm8",
                                    "score": 6,
                                    "created_utc": 1656097475.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yup gay marriage will be over soon",
                                    "author": "UnearthlyDinosaur",
                                    "id": "idl1m4b",
                                    "parent_id": "t1_idkxhm8",
                                    "score": 2,
                                    "created_utc": 1656091818.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Zero Republicans deserve to get laid until Roe is reinstated. This is insanity.",
            "author": "roscoe7585",
            "id": "idkzhf8",
            "parent_id": "t3_vjqkiw",
            "score": 25,
            "created_utc": 1656091014.0,
            "replies": [
                {
                    "body": "They don’t deserve to sleep with both eyes closed",
                    "author": "SatansBirthdayCake",
                    "id": "idkztw1",
                    "parent_id": "t1_idkzhf8",
                    "score": 20,
                    "created_utc": 1656091144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is what corporate-minority rule looks like: Where corporations own lawmakers elected by a minority of voters based on their belief system, and these lawmakers appoint judges who favor corporations and that belief system.\n\nOne perpetuates the other.",
            "author": "BusddhistDSM",
            "id": "idkucv9",
            "parent_id": "t3_vjqkiw",
            "score": 8,
            "created_utc": 1656089090.0,
            "replies": []
        },
        {
            "body": "This is why I've been saying for over 20 years that the left needs to enshrine abortion rights in law. RvW was a horrible ruling from the beginning. There was no legitimate interpretation of the law that would reach that ruling legitimately. Abortion rights have wide support in America and could have, at many points, been passed into law. However, the left has relied on the fact that the courts leaned left for 50 years to push progressive policy through laws dictated from the bench. It doesn't work that way. \n\nHopefully this will function as a wake up call and the left will finally start doing the compromising they need to push for legitimate change. It's slower, harder, but it is far more lasting. Now that the courts are far to the right, get ready for most of the social progress made over the last century to be undone.",
            "author": "AShatteredKing",
            "id": "idl56nn",
            "parent_id": "t3_vjqkiw",
            "score": 8,
            "created_utc": 1656093190.0,
            "replies": [
                {
                    "body": "Agreed that it should be enshrined, but what “compromising” are you referring to? Not much to compromise in the logical idea that a [potentially-]pregnant woman gets to decide if, when, and how long they are pregnant.",
                    "author": "SDinMD",
                    "id": "idmjn5b",
                    "parent_id": "t1_idl56nn",
                    "score": 3,
                    "created_utc": 1656114291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Birth control is next.   BC that prevents a fertilized egg from implanting   like the pill and IUD will be banned next.",
            "author": "catfarts99",
            "id": "idkup3l",
            "parent_id": "t3_vjqkiw",
            "score": 14,
            "created_utc": 1656089217.0,
            "replies": [
                {
                    "body": "Agreed",
                    "author": "AubrynnSky",
                    "id": "idmdbue",
                    "parent_id": "t1_idkup3l",
                    "score": 3,
                    "created_utc": 1656111355.0,
                    "replies": []
                },
                {
                    "body": "🙄",
                    "author": "UseTheForceRey",
                    "id": "idmlxdx",
                    "parent_id": "t1_idkup3l",
                    "score": -1,
                    "created_utc": 1656115388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the US, 1 in 7 children lived in poverty in 2019. It's going up to 1 in 5 in 2022. These kids are going to starve. Their future bleak. Nobody cares.\n\nWomen trying to protect their mind and well being. \"Burn the witches!\" Once she gives birth and struggling in poverty, \"It's the mother responsibility! We have better things to do than helping the children.\"\n\nIf people would give half the support for th se stupid laws to help children in poverty then the world would have been a different place. They are trying to cut the school lunch budget. Many kids rely on this one meal for their survival and now they are going to go hungry.\n\nBut no. They want pro-life. They don't care what happens to the life they brought.",
            "author": "Orange_Overlord",
            "id": "idl0ex7",
            "parent_id": "t3_vjqkiw",
            "score": 12,
            "created_utc": 1656091361.0,
            "replies": []
        },
        {
            "body": "Hugs from Sweden :( I’m thankful that it’s free, available and completely anonymous here.",
            "author": null,
            "id": "idmeo8a",
            "parent_id": "t3_vjqkiw",
            "score": 7,
            "created_utc": 1656111965.0,
            "replies": []
        },
        {
            "body": "Split states.   \n\n\nAnd the haves vs the have nots. Women of means will still have access to more options. Poor women and women who can travel easily will suffer.  \n\n\nThe unintended consequences of the decision are just starting.  Imagine new layers of legislation to support and protect kids born. And daycare/special needs care that's going to grow.",
            "author": "southernslick",
            "id": "idkoe0t",
            "parent_id": "t3_vjqkiw",
            "score": 15,
            "created_utc": 1656086874.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkrhis",
                    "parent_id": "t1_idkoe0t",
                    "score": 8,
                    "created_utc": 1656088027.0,
                    "replies": [
                        {
                            "body": "An expansion wouldn’t help- they can’t even keep up with the demand now. Inflation has made that demand worse and worse, and now add this in? It will be exactly like waiting for a housing voucher.",
                            "author": "loveoonthebrain",
                            "id": "idmdaux",
                            "parent_id": "t1_idkrhis",
                            "score": 3,
                            "created_utc": 1656111343.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Its not poor women its poor women who sleep with poor men.",
                    "author": "NotARussianBot1984",
                    "id": "idmjt8j",
                    "parent_id": "t1_idkoe0t",
                    "score": 1,
                    "created_utc": 1656114372.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m British and I feel totally gutted by this and all the women and children it’s going to affect. \nI don’t think any woman has ever an abortion as the easy way out, many women desperately want to keep those babies but circumstances don’t allow it. Many women continue to think about what that child would’ve been like for the rest of their lives. \nI’m truly sorry and I wish there was something we could do across the pond.",
            "author": "cccamilla775",
            "id": "idkz3j4",
            "parent_id": "t3_vjqkiw",
            "score": 11,
            "created_utc": 1656090867.0,
            "replies": []
        },
        {
            "body": "Ending same-sex relationships great!\n\nI’ll let my SDs know at the m&g that we can expect to be Outlaw Dating. 🦹‍♀️💕🦹‍♂️ \n\nRedoing my wishlist to include a miniature rock hammer and a big-ass Rita Hayworth poster!",
            "author": "LaylaSB",
            "id": "idln8v4",
            "parent_id": "t3_vjqkiw",
            "score": 5,
            "created_utc": 1656100351.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkfihl",
            "parent_id": "t3_vjqkiw",
            "score": 19,
            "created_utc": 1656083528.0,
            "replies": [
                {
                    "body": "Yeah this isn’t the end. It’s just the beginning",
                    "author": "SatansBirthdayCake",
                    "id": "idkfqra",
                    "parent_id": "t1_idkfihl",
                    "score": 10,
                    "created_utc": 1656083616.0,
                    "replies": []
                },
                {
                    "body": "And none of the other Justices are supporting anything Thomas wrote, so to say \"those motherfuckers aren't nearly done\" is a stretch to say the least.",
                    "author": "mraspencer",
                    "id": "idknuiy",
                    "parent_id": "t1_idkfihl",
                    "score": -9,
                    "created_utc": 1656086668.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idks9jt",
                            "parent_id": "t1_idknuiy",
                            "score": 4,
                            "created_utc": 1656088318.0,
                            "replies": [
                                {
                                    "body": ">  He needs to take the time machine back 15 years to see what was being said about the \"protection of marriage\".\n\nHe's been on the court for 31 years. He was there.",
                                    "author": "Y_4Z44",
                                    "id": "idkt61z",
                                    "parent_id": "t1_idks9jt",
                                    "score": 1,
                                    "created_utc": 1656088650.0,
                                    "replies": []
                                },
                                {
                                    "body": "You may be correct, but as I said elsewhere, the rest of the Justices, all of them, have already come out and said they do not support Thomas' assertions. \n\nCould be them just saying what people want to hear right now and things change down the road, but at the moment, that's the facts we have.",
                                    "author": "mraspencer",
                                    "id": "idkw2xp",
                                    "parent_id": "t1_idks9jt",
                                    "score": -2,
                                    "created_utc": 1656089732.0,
                                    "replies": [
                                        {
                                            "body": "The other justices say a lot of things.  Including, for Alito, Kavanaugh and Barrett during their confirmation hearings, that Roe was settled law.  They are lying.  Don't be a child.",
                                            "author": "Zubaz_Enthusiast",
                                            "id": "idlk0j8",
                                            "parent_id": "t1_idkw2xp",
                                            "score": 4,
                                            "created_utc": 1656099051.0,
                                            "replies": [
                                                {
                                                    "body": "Yay more name calling",
                                                    "author": "mraspencer",
                                                    "id": "idllnxl",
                                                    "parent_id": "t1_idlk0j8",
                                                    "score": -1,
                                                    "created_utc": 1656099719.0,
                                                    "replies": [
                                                        {
                                                            "body": "Play stupid games, win stupid prizes.",
                                                            "author": "Zubaz_Enthusiast",
                                                            "id": "idllsfh",
                                                            "parent_id": "t1_idllnxl",
                                                            "score": 2,
                                                            "created_utc": 1656099769.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkrgqk",
                            "parent_id": "t1_idknuiy",
                            "score": 4,
                            "created_utc": 1656088019.0,
                            "replies": [
                                {
                                    "body": "He also posited in an earlier thread that the court wouldn't overturn Roe v. Wade, so...this guy isn't exactly the brightest bulb in the box.",
                                    "author": "Y_4Z44",
                                    "id": "idks0ts",
                                    "parent_id": "t1_idkrgqk",
                                    "score": 5,
                                    "created_utc": 1656088227.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "idkspnf",
                                            "parent_id": "t1_idks0ts",
                                            "score": 2,
                                            "created_utc": 1656088481.0,
                                            "replies": [
                                                {
                                                    "body": "you are hilarious",
                                                    "author": "mraspencer",
                                                    "id": "idkvhdu",
                                                    "parent_id": "t1_idkspnf",
                                                    "score": -2,
                                                    "created_utc": 1656089510.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It's ok to be wrong now and then, you should try it once. You might be surprised you have a humble side.\n\nWait...no you don't. Nevermind, continue on the path you're on.",
                                            "author": "mraspencer",
                                            "id": "idkvm3x",
                                            "parent_id": "t1_idks0ts",
                                            "score": -1,
                                            "created_utc": 1656089559.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "idkofae",
                    "parent_id": "t1_idkfihl",
                    "score": -9,
                    "created_utc": 1656086887.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkrlz9",
                            "parent_id": "t1_idkofae",
                            "score": 3,
                            "created_utc": 1656088073.0,
                            "replies": [
                                {
                                    "body": "He’s troll. Don’t feed em",
                                    "author": "SatansBirthdayCake",
                                    "id": "idkrtol",
                                    "parent_id": "t1_idkrlz9",
                                    "score": 3,
                                    "created_utc": 1656088152.0,
                                    "replies": [
                                        {
                                            "body": "I'm a troll? How?",
                                            "author": "Academic_Use_1719",
                                            "id": "idl06ld",
                                            "parent_id": "t1_idkrtol",
                                            "score": -2,
                                            "created_utc": 1656091276.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Handmaiden’s Tale next. As a father to teenage daughter, I’m in shock that they’ve passed this. At the same time, I do believe half the country and 30pct of women in the country support this for reasons I just don’t understand.",
            "author": "Hfdadmanager",
            "id": "idkpjub",
            "parent_id": "t3_vjqkiw",
            "score": 14,
            "created_utc": 1656087310.0,
            "replies": [
                {
                    "body": "Religious nuts.",
                    "author": "Lar5031",
                    "id": "idkyhva",
                    "parent_id": "t1_idkpjub",
                    "score": 5,
                    "created_utc": 1656090635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "PSA: if you use period tracking apps, stop. Don't use them anymore. \n\nAlso those SDs that love unprotected sex are going to get really pissed off when they find out how Roe v Wade affects access to birth control. \n\nAs am I, an sb who more taked birth control for the hormonal issues of not wanting to be in excruciating pain",
            "author": "Charming-Eye-1309",
            "id": "idmkkac",
            "parent_id": "t3_vjqkiw",
            "score": 9,
            "created_utc": 1656114729.0,
            "replies": []
        },
        {
            "body": "I feel for my friends in the US that continue to see their rights and freedoms eroded day after day with decisions such as this.",
            "author": "Significant-Fun-2146",
            "id": "idkkubw",
            "parent_id": "t3_vjqkiw",
            "score": 13,
            "created_utc": 1656085534.0,
            "replies": [
                {
                    "body": "Learn how the United States and its law making works before commenting.",
                    "author": null,
                    "id": "idkngt2",
                    "parent_id": "t1_idkkubw",
                    "score": -13,
                    "created_utc": 1656086523.0,
                    "replies": [
                        {
                            "body": "I know how the law making works. I studied American history and political science as my major in university. \n\nAnd it's your type of comment that is the problem. \n\nGuess what? I have the freedom to comment and say what I want.\n\nIt's people like you who want to curb others just because their opinions, beliefs and values differ from yours. That's the problem.",
                            "author": "Significant-Fun-2146",
                            "id": "idkozut",
                            "parent_id": "t1_idkngt2",
                            "score": 6,
                            "created_utc": 1656087101.0,
                            "replies": [
                                {
                                    "body": "You are absolutely free to comment. And obviously if you know, supposedly, how the process works - when done properly, then my comment doesnt much apply to needing a response from you.\n\nI have zero interest in curbing/curving/carving others into my beliefs.  But facts are facts.",
                                    "author": null,
                                    "id": "idkpmuq",
                                    "parent_id": "t1_idkozut",
                                    "score": -7,
                                    "created_utc": 1656087341.0,
                                    "replies": [
                                        {
                                            "body": "PS: im sure you had a blast when the 2nd amendment verdict was issued!",
                                            "author": null,
                                            "id": "idkpsah",
                                            "parent_id": "t1_idkpmuq",
                                            "score": -3,
                                            "created_utc": 1656087398.0,
                                            "replies": [
                                                {
                                                    "body": "You know you can edit your post right? You don't have to comment on your own post to add a comment that has nothing to do with our original discussion lol.\n\nBedsides, this isn't the place to discuss the 2nd amendment decision anyway. Unless your carrying a gun to all your sugar dates. :)",
                                                    "author": "Significant-Fun-2146",
                                                    "id": "idkwcwt",
                                                    "parent_id": "t1_idkpsah",
                                                    "score": 3,
                                                    "created_utc": 1656089834.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I support significant’s commenting and reject you trying to police their input. Shutting people down is toxic for healthy discussion. If you actually believe someone’s missing something, then bring the information to the discussion!",
                            "author": "lumpsel",
                            "id": "idkrynr",
                            "parent_id": "t1_idkngt2",
                            "score": 2,
                            "created_utc": 1656088205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkfecu",
            "parent_id": "t3_vjqkiw",
            "score": 3,
            "created_utc": 1656083485.0,
            "replies": [
                {
                    "body": "Sending you all the love ❤️",
                    "author": "SatansBirthdayCake",
                    "id": "idkflps",
                    "parent_id": "t1_idkfecu",
                    "score": 1,
                    "created_utc": 1656083563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m extremely fortunate to work for a company that ensures their employees get the care that they need.  Our family planning coverage is designed to support the employee’s choice; from contraception and abortion coverage to pregnancy and family-building support through fertility, surrogacy and adoption benefits.  And they cover travel expenses to these services if they are not available close to home, including abortion and trans healthcare.\n\nIf you are in a position to make decision about healthcare coverage for your employees, please look into these options.",
            "author": "minkncookies",
            "id": "idmavhc",
            "parent_id": "t3_vjqkiw",
            "score": 3,
            "created_utc": 1656110256.0,
            "replies": []
        },
        {
            "body": "Hugs and love all around everyone!!!!!",
            "author": "Layla_Fox2",
            "id": "idmbb3c",
            "parent_id": "t3_vjqkiw",
            "score": 3,
            "created_utc": 1656110448.0,
            "replies": []
        },
        {
            "body": "Quote: \"Just heard from my wife that gynecological cancer doctors in Wisconsin are being told that pregnant women can no longer be treated for their \\[gynecological\\] cancers\"\n\nsource: [https://twitter.com/pastordan/status/1540374995444137985](https://twitter.com/pastordan/status/1540374995444137985)\n\n&#x200B;\n\nBanning gynecological cancer treatments for pregnant women is an obvious consequence of banning abortion, because the treatments for this type of cancer endanger the life of the fetus.",
            "author": "highfructoseSD",
            "id": "idmo8ce",
            "parent_id": "t3_vjqkiw",
            "score": 4,
            "created_utc": 1656116493.0,
            "replies": []
        },
        {
            "body": "Thomas said he'd like to go after same-sex marraige, why not also go after mixed-race marraige? \n\n&#x200B;\n\nPlease do not get confused, I'll all for both same-sex and mixed-race marraige, just wondering where his limits are.",
            "author": "Norma_Guy_2618",
            "id": "idlcjq5",
            "parent_id": "t3_vjqkiw",
            "score": 5,
            "created_utc": 1656096080.0,
            "replies": [
                {
                    "body": "He'll outlaw miscegenation as long as he can grandfather himself in.",
                    "author": "Dizzy_Share3155",
                    "id": "idlsxyx",
                    "parent_id": "t1_idlcjq5",
                    "score": 5,
                    "created_utc": 1656102645.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're two different countries. Let the red states have this ruling, put a gun in every teacher's hand, obliterate the tax code, convert all schools to private, eliminate medicaid and the ACA, toss out evolution from high schools and replace it with creationism. The blue states will be the opposite, and let the free market decide where people want to live.",
            "author": "whatever-tata",
            "id": "idksgny",
            "parent_id": "t3_vjqkiw",
            "score": 3,
            "created_utc": 1656088391.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idktyhx",
                    "parent_id": "t1_idksgny",
                    "score": 8,
                    "created_utc": 1656088941.0,
                    "replies": [
                        {
                            "body": "I sugar because federal & state taxes kill my pay. \n\nI dreamed & worked hard to make over XXXk just to watch a lot of it ripped away. \n\nCost of living & taxes keeps going up! Nothing is ever enough for the government and ignorant republican-led states who trash blue states yet rely on their tax money. \n\nIf I work to earn more, they’ll take more. What’s the point of working hard & having dreams anymore. \n\nMore babies born to poor mothers means more taxes…because wealthy people don’t pay taxes. They hide $ & professionally avoid taxes. It will be ppl like me trying to get ahead in this world with the government’s foot on our necks.",
                            "author": null,
                            "id": "idl44z7",
                            "parent_id": "t1_idktyhx",
                            "score": 5,
                            "created_utc": 1656092785.0,
                            "replies": [
                                {
                                    "body": "Any women trying to locate protests in your city check here!:\n\nhttps://www.womensmarch.com/",
                                    "author": null,
                                    "id": "idlmpmc",
                                    "parent_id": "t1_idl44z7",
                                    "score": 3,
                                    "created_utc": 1656100137.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "No, that's not allowed under the deal, it's personal responsibility all the way. No handouts, no freeloading, no subsidies.",
                            "author": "whatever-tata",
                            "id": "idkv04f",
                            "parent_id": "t1_idktyhx",
                            "score": 3,
                            "created_utc": 1656089330.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> ou're two different countries. Let the red states have this ruling,\n\nWhat you don't understand is that most states are not North Dakota.  They are both red & blue.\n\nI live in Georgia - outside of Atlanta.  It's pretty heavily Democratic area, and a large part of Georgia's economy.\n\nBut it's a red state...",
                    "author": "SDstartingOut",
                    "id": "idkz7t3",
                    "parent_id": "t1_idksgny",
                    "score": 4,
                    "created_utc": 1656090912.0,
                    "replies": [
                        {
                            "body": "Everyone knows that. My post is obviously not a serious nor realistic possibility, it's just crazy that in 2022 you still have 50% of your country voting for these red state ideals, like this ruling.",
                            "author": "whatever-tata",
                            "id": "idl8h4c",
                            "parent_id": "t1_idkz7t3",
                            "score": 1,
                            "created_utc": 1656094469.0,
                            "replies": [
                                {
                                    "body": "> Everyone knows that.\n\nBelieve it or not - that's untrue.  Especially people outside of the US.  They don't realize how divided it is.",
                                    "author": "SDstartingOut",
                                    "id": "idlbsfb",
                                    "parent_id": "t1_idl8h4c",
                                    "score": 2,
                                    "created_utc": 1656095781.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In Europe, we’re once again laughing at you guys.",
            "author": "Rylakb",
            "id": "idleqds",
            "parent_id": "t3_vjqkiw",
            "score": 4,
            "created_utc": 1656096940.0,
            "replies": [
                {
                    "body": "It’s not funny anymore",
                    "author": "SatansBirthdayCake",
                    "id": "idll5sn",
                    "parent_id": "t1_idleqds",
                    "score": 8,
                    "created_utc": 1656099516.0,
                    "replies": [
                        {
                            "body": "Just a case of perspective then.",
                            "author": "Rylakb",
                            "id": "idlrooz",
                            "parent_id": "t1_idll5sn",
                            "score": -2,
                            "created_utc": 1656102135.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's actually scary, not funny at all. Many people will suffer b/c of this. Its not even going to stop abortion,  it'll just make it unsafe for those getting it. ...back to coat hangars and back allies 🥺",
                    "author": "Zia19",
                    "id": "idlwenv",
                    "parent_id": "t1_idleqds",
                    "score": 5,
                    "created_utc": 1656104057.0,
                    "replies": []
                },
                {
                    "body": "> In Europe, we’re once again laughing at you guys.\n\nUnless you are in Poland.\n\nOr Malta.\n\nOr Liechtenstein.  \n\nI'd throw Vatican city in there, but since guys can't get other males pregnant, I guess it doesn't count.",
                    "author": "SDstartingOut",
                    "id": "idmny3u",
                    "parent_id": "t1_idleqds",
                    "score": 3,
                    "created_utc": 1656116359.0,
                    "replies": []
                },
                {
                    "body": "A substantial number of abortions performed in the USA would be illegal in Europe",
                    "author": "huizeng",
                    "id": "idlwtah",
                    "parent_id": "t1_idleqds",
                    "score": 0,
                    "created_utc": 1656104223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is such a difficult issue.\n\nThose women who were bragging about having 20 abortions were wrong.\n\nPeople who say it should be outlawed all the time are wrong.\n\nI fall somewhere in the giant gap between those two.",
            "author": "GlucoseGuardians",
            "id": "idl0jnl",
            "parent_id": "t3_vjqkiw",
            "score": -4,
            "created_utc": 1656091411.0,
            "replies": []
        },
        {
            "body": "Roe V Wade being overturned does not automatically ban abortion.  It just turns the issue back over to the states.  Roe V Wade never should have been heard by the supreme court to begin with.  It is not a constitutional issue, and the argument for it being one was always extremely weak to begin with.  The supreme court deciding an issue that should belong to an elected legislator was a serious overreach of the federal government and that is why it is being overturned.",
            "author": "RTManson",
            "id": "idkkqz6",
            "parent_id": "t3_vjqkiw",
            "score": -21,
            "created_utc": 1656085498.0,
            "replies": [
                {
                    "body": "Wrong. It DOES automatically ban abortion in many states.\n\nAlabama, Arizona, Arkansas, Michigan, Mississippi, Oklahoma, Texas, West Virginia, and Wisconsin already had banned abortions prior to Roe being overturned and this ruling allows those bans to stand.\n\nIdaho, Kentucky, Louisiana, Missouri, North Dakota, South Dakota, Tennessee, Utah, and Wyoming each have trigger laws that banned abortions as soon as Roe was overturned.\n\nGeorgia, Iowa, Ohio, and South Carolina have extreme limits on abortion and are likely to push for full bans now.\n\nAnd soon Florida, Indiana, Nebraska, and Montana will push for full bans as they have the political climate to do so.",
                    "author": "ExpertPerformance",
                    "id": "idko96c",
                    "parent_id": "t1_idkkqz6",
                    "score": 20,
                    "created_utc": 1656086822.0,
                    "replies": [
                        {
                            "body": "So… if you sugar date in any of…\n\nDallas, Houston, Miami, Atlanta, Phoenix, Detroit, Minneapolis, Tampa, St. Louis, Charlotte, Orlando, San Antonio, Cincinnati, Austin, Kansas City, Columbus, Indianapolis, Cleveland, Nashville, Jacksonville, Milwaukee, Oklahoma City, Memphis, Louisville, Salt Lake City, New Orleans, Birmingham, Grand Rapids, Tucson, Tulsa, Omaha, Greenville, Knoxville, McAllen, Baton Rouge, El Paso, Sarasota, Columbia, Dayton, Boise…\n\nyou might want to keep emergency funds on hand if you find you unexpectedly have a certain need to travel to a 21st century state that supports women’s reproductive rights.",
                            "author": "ExpertPerformance",
                            "id": "idkyjbu",
                            "parent_id": "t1_idko96c",
                            "score": 9,
                            "created_utc": 1656090650.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkmuxn",
                    "parent_id": "t1_idkkqz6",
                    "score": 13,
                    "created_utc": 1656086298.0,
                    "replies": [
                        {
                            "body": "Does anyone really believe in a \"person's right to decide what to do with their body\"? Universal restrictions on drug use and prostitution seem to indicate not really...",
                            "author": "huizeng",
                            "id": "idkt01l",
                            "parent_id": "t1_idkmuxn",
                            "score": 1,
                            "created_utc": 1656088588.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Have you seen some of the officials that are elected in some of these states? There are real nut cases in office—ones that do not care about women’s bodily autonomy.",
                    "author": "zara_io",
                    "id": "idkl76c",
                    "parent_id": "t1_idkkqz6",
                    "score": 11,
                    "created_utc": 1656085670.0,
                    "replies": [
                        {
                            "body": "So vote!  I hold my state politicians accountable.  Hold your states politicians equally accountable.",
                            "author": null,
                            "id": "idknp0k",
                            "parent_id": "t1_idkl76c",
                            "score": -5,
                            "created_utc": 1656086609.0,
                            "replies": [
                                {
                                    "body": "I do vote, so thank you for that. I’m also not talking about where I live. I’m certain there are people like me that live in said states that also vote, but these people get voted in by other nut cases who also don’t care about women’s rights. Can’t hold said politicians accountable if they’re already in office and getting re-elected by the same majority.",
                                    "author": "zara_io",
                                    "id": "idkuiyu",
                                    "parent_id": "t1_idknp0k",
                                    "score": 5,
                                    "created_utc": 1656089153.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "In a lot of states, it does. Roe v Wade is the reason why Sugar is safer for women and why we have the privacy to date who we’d like. Your right to privacy is also at risk because of this.\n\nThis has so many more implications than just Abortion. Seeing it as *just abortion* is incredibly ignorant. \n\nIn the opinion, Justice Thomas calls for the opinions on contraceptives to be reconsidered as well. You’re at risk of losing access to the women you love to spend time with because they will drop out of the bowl. Without access to contraceptives, you’re more at risk for a pregnancy that you helped create and being responsible for that child. If you’d like the have a black SB, that’s now at risk too. None of these are explicitly protected under the 14A, but that’s how we got these things in the first place. \n\nNow do you get it?",
                    "author": "SatansBirthdayCake",
                    "id": "idkn1tx",
                    "parent_id": "t1_idkkqz6",
                    "score": 8,
                    "created_utc": 1656086369.0,
                    "replies": []
                },
                {
                    "body": "Why have a bill of rights at all?  Why emancipate the slaves?  States rights, right?",
                    "author": "sparky_SD16",
                    "id": "idkmntg",
                    "parent_id": "t1_idkkqz6",
                    "score": 8,
                    "created_utc": 1656086224.0,
                    "replies": []
                },
                {
                    "body": "> Roe V Wade being overturned does not automatically ban abortion\n\nExcept in the states that have a trigger law.\n\n> Twenty-two states had laws or constitutional amendments that were already in place which could be quickly used to try to ban abortion.",
                    "author": "SDstartingOut",
                    "id": "idkzclg",
                    "parent_id": "t1_idkkqz6",
                    "score": 2,
                    "created_utc": 1656090963.0,
                    "replies": [
                        {
                            "body": "The difference is that when it's left up to elected officials the people get a say based on who they vote for as opposed to the federal government simply legislating from the bench, something they are not supposed to do. \n\nThose states have those laws on the books because that is what the majority of people in those states want.",
                            "author": "RTManson",
                            "id": "idls4qx",
                            "parent_id": "t1_idkzclg",
                            "score": 3,
                            "created_utc": 1656102314.0,
                            "replies": [
                                {
                                    "body": "Tell me more about your fantasy that the political system of a state like Georgia is based on \"what the majority of people \\[or majority of eligible voters\\] want\".",
                                    "author": "highfructoseSD",
                                    "id": "idmpn7d",
                                    "parent_id": "t1_idls4qx",
                                    "score": 2,
                                    "created_utc": 1656117185.0,
                                    "replies": []
                                },
                                {
                                    "body": "100% factually incorrect.\n\nI live in Georgia.  Georgia has a law on the books, effectively outlawing abortion.\n\nYet - most people in Georgia do NOT support over turning Roe v. Wade.\n\n> Most Georgians oppose overturning Roe v. Wade but are more open to placing some restrictions on abortion, according to recent polling",
                                    "author": "SDstartingOut",
                                    "id": "idlydpj",
                                    "parent_id": "t1_idls4qx",
                                    "score": 1,
                                    "created_utc": 1656104869.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Heres what the issue is.  Period.\n\nFew are taught how laws and law making work nowadays.  You don't get 9 Supreme Court Justices to make laws.  You have 9 Supreme Court Justices to protect you and the Constitution from crooked politicians.\n\nYou now go to your State Senators (2 in your State) and say HEY: make a common sense law to protect my rights.\n\nI am pro-choice, 100%.  But I am also anti-abortion.  Respect my opinion, and I respect your right.  Just because I feel it is wrong doesn't mean I will reach out to my Senator to say otherwise.  Keywords: mutual respect. \n And hold the people you vote for accountable.",
            "author": null,
            "id": "idknbbb",
            "parent_id": "t3_vjqkiw",
            "score": -9,
            "created_utc": 1656086466.0,
            "replies": []
        },
        {
            "body": "abortions are not gone. this decision doesn't make them illegal. it is allowing each state to decide for themselves how they want to handle abortions. some states will outlaw them, yes. some will say no abortions after a certain amount of time. and some state will allow abortions up to the point of birth",
            "author": "davitech73",
            "id": "idktjwy",
            "parent_id": "t3_vjqkiw",
            "score": -9,
            "created_utc": 1656088794.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkukim",
                    "parent_id": "t1_idktjwy",
                    "score": 8,
                    "created_utc": 1656089169.0,
                    "replies": [
                        {
                            "body": "i don't assume everyone knows this. i've heard a lot of talk about this decision since the leak a while back. a lot of people do not know what this means. maybe the people in this sub are more informed than average though",
                            "author": "davitech73",
                            "id": "idkwd3d",
                            "parent_id": "t1_idkukim",
                            "score": -3,
                            "created_utc": 1656089836.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkp40w",
            "parent_id": "t3_vjqkiw",
            "score": 0,
            "created_utc": 1656087144.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkrl2i",
                    "parent_id": "t1_idkp40w",
                    "score": 3,
                    "created_utc": 1656088063.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idks8tm",
                            "parent_id": "t1_idkrl2i",
                            "score": 1,
                            "created_utc": 1656088310.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow this place is an ideological cesspool!",
            "author": "DonnyJacobs",
            "id": "idmbrsl",
            "parent_id": "t3_vjqkiw",
            "score": -2,
            "created_utc": 1656110654.0,
            "replies": []
        },
        {
            "body": "I'm just wondering why all these women have time to complain about this? Be a man. Suck it up and go!",
            "author": "sandmanthick",
            "id": "idl1yau",
            "parent_id": "t3_vjqkiw",
            "score": -8,
            "created_utc": 1656091945.0,
            "replies": []
        },
        {
            "body": "there is no loss effectively unless you live in a trigger law state...\n\nand if you think you've lost a right, be angry at the Dem party (particularly Obama who had lots of chances) who never saw legislating and reinforcing Roe/Casey as a priority.",
            "author": "anonred1618",
            "id": "idmosia",
            "parent_id": "t3_vjqkiw",
            "score": -5,
            "created_utc": 1656116767.0,
            "replies": []
        },
        {
            "body": "Can we keep politics out of this sub?",
            "author": "gaxxzz",
            "id": "idkqz4j",
            "parent_id": "t3_vjqkiw",
            "score": -18,
            "created_utc": 1656087837.0,
            "replies": [
                {
                    "body": "No. This decision affects the bowl A LOT",
                    "author": "SatansBirthdayCake",
                    "id": "idkrjxv",
                    "parent_id": "t1_idkqz4j",
                    "score": 21,
                    "created_utc": 1656088052.0,
                    "replies": [
                        {
                            "body": "How's this discussion going to help anything?",
                            "author": "gaxxzz",
                            "id": "idkw5wr",
                            "parent_id": "t1_idkrjxv",
                            "score": -9,
                            "created_utc": 1656089762.0,
                            "replies": [
                                {
                                    "body": "Move the goalpost. \n\nYou act like relationships that involve sex aren't going to be affected. \n\nStop posting if you honestly don't see how the two are related.",
                                    "author": "2catsandacomputer",
                                    "id": "idmfx8a",
                                    "parent_id": "t1_idkw5wr",
                                    "score": 2,
                                    "created_utc": 1656112542.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Can we keep laws off of my uterus?",
                    "author": "Lar5031",
                    "id": "idkyeuu",
                    "parent_id": "t1_idkqz4j",
                    "score": 15,
                    "created_utc": 1656090603.0,
                    "replies": []
                },
                {
                    "body": "Sure.  If you are part of the minority that actually supports this decision, how about you just leave the thread alone, and ignore it?",
                    "author": "SDstartingOut",
                    "id": "idkzin4",
                    "parent_id": "t1_idkqz4j",
                    "score": 6,
                    "created_utc": 1656091027.0,
                    "replies": []
                },
                {
                    "body": "Sure. Just as soon as you agree to keep your dick out of a pussy.\n\nAgreed?",
                    "author": "ExpertPerformance",
                    "id": "idm3wb4",
                    "parent_id": "t1_idkqz4j",
                    "score": 5,
                    "created_utc": 1656107209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't have a strong opinion either way but I think it's worth being said that a woman's right to choose shouldn't enslave a man in child support. That gives them too much power they are making a choice for 3 people not just themselves. If they have the right to terminate pregnancies at will then men shouldn't have to foot the bill if they choose to keep the kid. You all may think that affects just you but I had a gf who got an abortion with my child when I was young and she did tell me til afterwards. Fast forward 15 years and I haven't had a kid with anyone else and am pretty lonely/depressed. The decision doesn't only affect you but everyone else involved. And if you look at it in a black and white kind of way is murdering a baby for your own personal preferences right or wrong? I think we all know the answer to that.",
            "author": "NhLakeGuy",
            "id": "idl0apw",
            "parent_id": "t3_vjqkiw",
            "score": -9,
            "created_utc": 1656091319.0,
            "replies": []
        },
        {
            "body": "Just move to liberal states. You can keep getting all the abortions you want to their. OR Be on birth control.",
            "author": "tom26461",
            "id": "idm4mxe",
            "parent_id": "t3_vjqkiw",
            "score": -9,
            "created_utc": 1656107527.0,
            "replies": []
        },
        {
            "body": "It all depends on your state now, instead of the federal gov't to regulate rules for abortions.  Vote better people into your state congress and get them regulated.",
            "author": "MrRhoarke",
            "id": "idl3ysu",
            "parent_id": "t3_vjqkiw",
            "score": -3,
            "created_utc": 1656092719.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idkirrs",
            "parent_id": "t3_vjqkiw",
            "score": -13,
            "created_utc": 1656084755.0,
            "replies": [
                {
                    "body": "And at the basic your argument holds no water - because take away NY money and CA money (progressive states)  from the federal tit and most regressive states would not have a pot to piss in. \n\nForget the major fact that you are advocating for repression. Not freedom.\n\nAnd you are welcome to move to the Middle East that aligns more with your views. Silly retort right?",
                    "author": "thereadinessisall",
                    "id": "idkkaft",
                    "parent_id": "t1_idkirrs",
                    "score": 12,
                    "created_utc": 1656085323.0,
                    "replies": [
                        {
                            "body": "As someone who came from Middle East, please keep your filth with yourself. We have enough crazy of our own.",
                            "author": null,
                            "id": "idkmj2k",
                            "parent_id": "t1_idkkaft",
                            "score": 0,
                            "created_utc": 1656086174.0,
                            "replies": [
                                {
                                    "body": "Hahaha - not wanting to send more to you over there - maybe collectively we can buy a big island for them all to live on.",
                                    "author": "thereadinessisall",
                                    "id": "idkmw39",
                                    "parent_id": "t1_idkmj2k",
                                    "score": 4,
                                    "created_utc": 1656086309.0,
                                    "replies": [
                                        {
                                            "body": "Epstein Island??",
                                            "author": null,
                                            "id": "idknass",
                                            "parent_id": "t1_idkmw39",
                                            "score": 2,
                                            "created_utc": 1656086461.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkma08",
                            "parent_id": "t1_idkkaft",
                            "score": -5,
                            "created_utc": 1656086079.0,
                            "replies": [
                                {
                                    "body": "Will of some people - trump LOST the popular vote —— TWICE.",
                                    "author": "thereadinessisall",
                                    "id": "idkmnbu",
                                    "parent_id": "t1_idkma08",
                                    "score": 6,
                                    "created_utc": 1656086218.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t know how anything you said justify not giving women freedom on their own body. All it does it make women scared and remove freedom what we all in this community desire so much.",
                    "author": "IllustriousCake8030",
                    "id": "idkkjdj",
                    "parent_id": "t1_idkirrs",
                    "score": 10,
                    "created_utc": 1656085417.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "idklwfj",
                            "parent_id": "t1_idkkjdj",
                            "score": -3,
                            "created_utc": 1656085937.0,
                            "replies": [
                                {
                                    "body": "Reported.",
                                    "author": "MrBuzzard",
                                    "id": "idkmt1t",
                                    "parent_id": "t1_idklwfj",
                                    "score": 2,
                                    "created_utc": 1656086278.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "idko4y0",
                                            "parent_id": "t1_idkmt1t",
                                            "score": 0,
                                            "created_utc": 1656086778.0,
                                            "replies": [
                                                {
                                                    "body": "Reported again.  This is a sex positive sub.  Not a place for knuckle dragging, busybodies like you thinking they have a right to tell others how to live their life.",
                                                    "author": "MrBuzzard",
                                                    "id": "idkyg8k",
                                                    "parent_id": "t1_idko4y0",
                                                    "score": 2,
                                                    "created_utc": 1656090617.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Forced birth isn’t a cultural freedom. It’s oppression.",
                    "author": "SatansBirthdayCake",
                    "id": "idkjucm",
                    "parent_id": "t1_idkirrs",
                    "score": 10,
                    "created_utc": 1656085159.0,
                    "replies": [
                        {
                            "body": "This guy showed up in SLF specifically to argue about abortion. He's a troll, so don't waste too much time with it.",
                            "author": "Y_4Z44",
                            "id": "idklq11",
                            "parent_id": "t1_idkjucm",
                            "score": 7,
                            "created_utc": 1656085870.0,
                            "replies": [
                                {
                                    "body": "Ya, just figured that out.  Won’t be feeding this particular troll any longer.",
                                    "author": "MrBuzzard",
                                    "id": "idkmaqm",
                                    "parent_id": "t1_idklq11",
                                    "score": 3,
                                    "created_utc": 1656086087.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "“End of the country”?!  Get serious!  This post is a shining example of the extremism and blatant stupidity that is so prevalent today.",
                    "author": "MrBuzzard",
                    "id": "idkknv8",
                    "parent_id": "t1_idkirrs",
                    "score": 2,
                    "created_utc": 1656085464.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "idklcxl",
                            "parent_id": "t1_idkknv8",
                            "score": -9,
                            "created_utc": 1656085731.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "idkoaib",
                                    "parent_id": "t1_idklcxl",
                                    "score": 2,
                                    "created_utc": 1656086837.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "idkpg4l",
                                            "parent_id": "t1_idkoaib",
                                            "score": -2,
                                            "created_utc": 1656087271.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkmk6s",
            "parent_id": "t3_vjqkiw",
            "score": -13,
            "created_utc": 1656086185.0,
            "replies": [
                {
                    "body": "This is a joke , right?\n\nIt’s not funny.",
                    "author": "daddoms",
                    "id": "idkzkhk",
                    "parent_id": "t1_idkmk6s",
                    "score": 5,
                    "created_utc": 1656091046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, in the name of speaking my mind, even though it goes again the popular opinion here on reddit. I think its a good thing and im very happy",
            "author": "CanOfWoody",
            "id": "idko3ug",
            "parent_id": "t3_vjqkiw",
            "score": -23,
            "created_utc": 1656086766.0,
            "replies": [
                {
                    "body": "Lol- tell me you try to trap women without telling me you try to trap women",
                    "author": "DonutWhole9717",
                    "id": "idkpl8t",
                    "parent_id": "t1_idko3ug",
                    "score": 19,
                    "created_utc": 1656087325.0,
                    "replies": []
                },
                {
                    "body": "I hope you like being responsible for a child you create and force on others too.",
                    "author": "SatansBirthdayCake",
                    "id": "idkot3s",
                    "parent_id": "t1_idko3ug",
                    "score": 15,
                    "created_utc": 1656087031.0,
                    "replies": []
                },
                {
                    "body": "Let's see how happy you are when your taxes are raised to provide financial assistance for those families or when one of your SBs get pregnant and can't terminate her pregnancy.\n\nGuys like you are the first ones to be up in arms against welfare and social programs and are often the kind of people who look down on single mothers.",
                    "author": "LightOLove",
                    "id": "idksq2a",
                    "parent_id": "t1_idko3ug",
                    "score": 8,
                    "created_utc": 1656088486.0,
                    "replies": [
                        {
                            "body": ">Let's see how happy you are when your taxes are raised to provide financial assistance for those families or when one of your SBs get pregnant and can't terminate her pregnancy.\n\nI am okay with both of these things. I support the nordic style social safety nets.",
                            "author": "CanOfWoody",
                            "id": "idkt605",
                            "parent_id": "t1_idksq2a",
                            "score": -6,
                            "created_utc": 1656088650.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "idkpyfs",
                    "parent_id": "t1_idko3ug",
                    "score": -9,
                    "created_utc": 1656087462.0,
                    "replies": [
                        {
                            "body": "Another one of those accounts who's never posted in here before showing up to voice his opinion. How quaint.",
                            "author": "Y_4Z44",
                            "id": "idksh1w",
                            "parent_id": "t1_idkpyfs",
                            "score": 6,
                            "created_utc": 1656088395.0,
                            "replies": [
                                {
                                    "body": "Jesus loves you ❤️",
                                    "author": "crackedpacks4life",
                                    "id": "idkw9h2",
                                    "parent_id": "t1_idksh1w",
                                    "score": -3,
                                    "created_utc": 1656089799.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkumui",
            "parent_id": "t3_vjqkiw",
            "score": -8,
            "created_utc": 1656089193.0,
            "replies": [
                {
                    "body": "Behave…",
                    "author": "MsFabulous157",
                    "id": "idky5pk",
                    "parent_id": "t1_idkumui",
                    "score": 3,
                    "created_utc": 1656090507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What you are describing has already happened in California, of all places. 😞",
            "author": "Chill_SD1974",
            "id": "idkx3n0",
            "parent_id": "t1_idkufud",
            "score": 9,
            "created_utc": 1656090108.0,
            "replies": []
        },
        {
            "body": "Wait, what?! Why would a woman be speaking to the police due to a miscarriage and then need a lawyer? I won’t lie; I have intentionally stopped paying attention to the news and I have been on an Instagram and Facebook hiatus for a little over a year now. This was all for my well-being and I obviously am still aware of some of the bigger issues going on like overturning Roe v Wade. But I’m genuinely scared and confused about your advice about how to handle a miscarriage; are we now living the real life version of The Handmaids Tale?!",
            "author": "PinkFancyCrane",
            "id": "idm160t",
            "parent_id": "t1_idkufud",
            "score": 8,
            "created_utc": 1656106047.0,
            "replies": [
                {
                    "body": "Yes. Miscarriages will be investigated to see if it was intentionally caused and women will be made criminals for it who can’t vote. That’s the point.",
                    "author": "SatansBirthdayCake",
                    "id": "idm40nv",
                    "parent_id": "t1_idm160t",
                    "score": 22,
                    "created_utc": 1656107262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "With the Miranda Rights struck down as well, we all need to stick to our lawyers and civil rights. Don’t speak to cops. Ever. No matter what they say. They will make up anything to get you to speak.",
            "author": "acrowmion",
            "id": "idmf19b",
            "parent_id": "t1_idkufud",
            "score": 5,
            "created_utc": 1656112131.0,
            "replies": []
        },
        {
            "body": "Thank you very much. Idk how to feel right now. This will change many lives. \n\nLadies you can also order birth control from pharmacies in Canada that will ship it to your home…they will try to tear down access to birth control next.\n\nWomen interested in attending a protest check here for protests all over!: https://www.womensmarch.com/",
            "author": null,
            "id": "idl1lpa",
            "parent_id": "t1_idkpeo3",
            "score": 20,
            "created_utc": 1656091814.0,
            "replies": [
                {
                    "body": "Misoprostol is used to treat ulcers in horses and available at the same veterinarian places you buy your ivermectin.",
                    "author": "aajniojnoihnoi",
                    "id": "idmmo8t",
                    "parent_id": "t1_idl1lpa",
                    "score": 10,
                    "created_utc": 1656115743.0,
                    "replies": [
                        {
                            "body": "Thanks for the information. I don’t need an abortion but people like you willing to help are appreciated.",
                            "author": null,
                            "id": "idmo7rw",
                            "parent_id": "t1_idmmo8t",
                            "score": 5,
                            "created_utc": 1656116486.0,
                            "replies": [
                                {
                                    "body": "Advice on DIY abortion techniques:\n\nhttps://archive.org/details/FTVDIYA",
                                    "author": "aajniojnoihnoi",
                                    "id": "idmoqk7",
                                    "parent_id": "t1_idmo7rw",
                                    "score": 4,
                                    "created_utc": 1656116740.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah I feel a lot of things too, but mostly sadness and heart ache. \n\nI hate it here and it just adds to the list of wanting to move to Australia even more",
                    "author": "Sweetcheeks864",
                    "id": "idl461i",
                    "parent_id": "t1_idl1lpa",
                    "score": 5,
                    "created_utc": 1656092797.0,
                    "replies": [
                        {
                            "body": "I feel the same on wanting to leave the US now. Gonna go outside & do something to stop thinking about this. \n\nI have to get long term birth control now & deal with the side effects on my body. I’m scared & angry for women…but it’s nice outside & I’ll find a protest to attend in the future. \n\nHugs",
                            "author": null,
                            "id": "idl98z1",
                            "parent_id": "t1_idl461i",
                            "score": 6,
                            "created_utc": 1656094776.0,
                            "replies": [
                                {
                                    "body": "A female condom is an option too, if you want minimal side effects! \n\nEnjoy your day outside 🙂",
                                    "author": "Sweetcheeks864",
                                    "id": "idlgiau",
                                    "parent_id": "t1_idl98z1",
                                    "score": 2,
                                    "created_utc": 1656097647.0,
                                    "replies": [
                                        {
                                            "body": "Thanks. There’s protests happening this weekend & things. I still don’t feel a lot better about this. Going to 1 now. Here’s a link of protests all over if interested: https://www.womensmarch.com/",
                                            "author": null,
                                            "id": "idlsrrp",
                                            "parent_id": "t1_idlgiau",
                                            "score": 4,
                                            "created_utc": 1656102574.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.forbes.com/sites/alisondurkee/2022/06/24/roe-v-wade-overturned-heres-when-states-will-start-banning-abortion---and-which-already-have/](https://www.forbes.com/sites/alisondurkee/2022/06/24/roe-v-wade-overturned-heres-when-states-will-start-banning-abortion---and-which-already-have/)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
            "author": "AmputatorBot",
            "id": "idkpg2y",
            "parent_id": "t1_idkpeo3",
            "score": 0,
            "created_utc": 1656087271.0,
            "replies": []
        },
        {
            "body": "It's cool(\\*) that applies to 10 year old girls, who can and do get pregnant from rape or incest.\n\n(\\* spoiler: it isn't cool)",
            "author": "highfructoseSD",
            "id": "idlgv1v",
            "parent_id": "t1_idl9nva",
            "score": 20,
            "created_utc": 1656097790.0,
            "replies": []
        },
        {
            "body": "Blue states should be very restrictive about providing services to women from these states when they come to civilization for abortions. At a minimum, proof that the woman and erstwhile father did not vote Republican 2016 - present",
            "author": "throwawayaccount0327",
            "id": "idlaq0f",
            "parent_id": "t1_idl9nva",
            "score": -7,
            "created_utc": 1656095355.0,
            "replies": [
                {
                    "body": "Nah we don’t play that game here. We don’t restrict access to a woman in need. No matter your background, political leanings, heritage, etc. we absolutely DO NOT discriminate or refuse to help a woman in need. \n\nIf we do, we’re no better than the monsters who made this decision for us today.",
                    "author": "SatansBirthdayCake",
                    "id": "idlb417",
                    "parent_id": "t1_idlaq0f",
                    "score": 33,
                    "created_utc": 1656095510.0,
                    "replies": [
                        {
                            "body": "Ijs, in the Handmaid's Tale Ofglen leads a woman to her death for being a bitch to her fellow woman. \n\nI'm tired of the \"take the high road\" politics. We've been doing that since the 90s and now we're here, at overturning something that is literally deletes autonomy. Saying \"states rights\" is being ignorant, we fought a fucking civil war over this ffs 🙄 Democrats have been playing fair, it isn't working. \n\nGloves fucking off or get ye behind me. Losing your rights isn't a \"turn the other cheek\" moment. It isn't a \"forgive thy neighbor\" moment. Go with grace in everywhere else in life, but not this fight and not right now.",
                            "author": "2catsandacomputer",
                            "id": "idmgtne",
                            "parent_id": "t1_idlb417",
                            "score": 4,
                            "created_utc": 1656112957.0,
                            "replies": []
                        },
                        {
                            "body": "And failing to fight evil with evil is a prescription for losing when you walk through the shadow of the valley of death. \n\nI can be my best self when not staring down the barrel of a 6-3 revanchist SCOTUS. Until then, all bets are off.",
                            "author": "throwawayaccount0327",
                            "id": "idlbt7k",
                            "parent_id": "t1_idlb417",
                            "score": 1,
                            "created_utc": 1656095790.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkrd7t",
            "parent_id": "t1_idkfb14",
            "score": 26,
            "created_utc": 1656087982.0,
            "replies": [
                {
                    "body": "I wouldn’t be surprised if Thomas, completely devoid of any self awareness or irony, penned an overruling of Loving.",
                    "author": "j19104",
                    "id": "idkzeo5",
                    "parent_id": "t1_idkrd7t",
                    "score": 10,
                    "created_utc": 1656090985.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So this Court says it’s up to the states in Roe, but NY’s gun law is too restrictive just show’s they are zealous activists and not neutral.  They deserve the scorn that is coming.",
            "author": "nametken",
            "id": "idlia30",
            "parent_id": "t1_idkfb14",
            "score": 5,
            "created_utc": 1656098360.0,
            "replies": [
                {
                    "body": "Its up to congress to put abortion in the constitution. Hopefully they do that by wednesday",
                    "author": "NotARussianBot1984",
                    "id": "idmjbh3",
                    "parent_id": "t1_idlia30",
                    "score": 0,
                    "created_utc": 1656114136.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkss5k",
            "parent_id": "t1_idks5re",
            "score": 8,
            "created_utc": 1656088508.0,
            "replies": [
                {
                    "body": "Yeah, I agree there, some more countries as well unfortunately :(",
                    "author": "noLeatherPlease",
                    "id": "idktjge",
                    "parent_id": "t1_idkss5k",
                    "score": 4,
                    "created_utc": 1656088789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just only sleep with men that can afford to pay you to take time off work.",
            "author": "NotARussianBot1984",
            "id": "idmjj45",
            "parent_id": "t1_idkmoiw",
            "score": -6,
            "created_utc": 1656114238.0,
            "replies": []
        },
        {
            "body": "Pro *forced*-birth.",
            "author": "Y_4Z44",
            "id": "idknhom",
            "parent_id": "t1_idkn9fz",
            "score": 52,
            "created_utc": 1656086533.0,
            "replies": [
                {
                    "body": "State mandated pregnancy",
                    "author": "SD1070",
                    "id": "idknt4f",
                    "parent_id": "t1_idknhom",
                    "score": 19,
                    "created_utc": 1656086653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "FORCED birth",
            "author": "climbitdontcarryit",
            "id": "idks422",
            "parent_id": "t1_idkn9fz",
            "score": 17,
            "created_utc": 1656088260.0,
            "replies": []
        },
        {
            "body": "Pro Subjugation of Women",
            "author": "ExpertPerformance",
            "id": "idkyxfu",
            "parent_id": "t1_idkn9fz",
            "score": 8,
            "created_utc": 1656090801.0,
            "replies": []
        },
        {
            "body": "Pro slavery",
            "author": "NotARussianBot1984",
            "id": "idmjdfb",
            "parent_id": "t1_idkn9fz",
            "score": 2,
            "created_utc": 1656114162.0,
            "replies": []
        },
        {
            "body": "So many reasons for a vasectomy…",
            "author": "jacknjilled",
            "id": "idmlv9t",
            "parent_id": "t1_idky82b",
            "score": 3,
            "created_utc": 1656115360.0,
            "replies": []
        },
        {
            "body": "Hail Satan.",
            "author": "aajniojnoihnoi",
            "id": "idmmrc0",
            "parent_id": "t1_idky82b",
            "score": 4,
            "created_utc": 1656115785.0,
            "replies": []
        },
        {
            "body": "Godspeed 🙏",
            "author": "SatansBirthdayCake",
            "id": "idlp9rg",
            "parent_id": "t1_idlf2et",
            "score": 6,
            "created_utc": 1656101165.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkrt3m",
            "parent_id": "t1_idkmwaz",
            "score": 5,
            "created_utc": 1656088146.0,
            "replies": [
                {
                    "body": "If by civil disobedience you mean assist with helping women get the care they have the human right to have...then yes. Between medicinal abortions, contraception via mail,  and abortion tourism ..women will get what they need. \n\nWe take care of our own. No one else will.",
                    "author": "LadyMorgan2018",
                    "id": "idkupkk",
                    "parent_id": "t1_idkrt3m",
                    "score": 7,
                    "created_utc": 1656089221.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkvmtx",
                            "parent_id": "t1_idkupkk",
                            "score": 2,
                            "created_utc": 1656089566.0,
                            "replies": [
                                {
                                    "body": "Clinics are going up in women-friendly states to meet the demand. The abortion underground will not likely set up brick and mortar clinics. If you haven't seen \"The Janes,\" I recommend it. Yes, they were active pre-Roe, but it will happen again. Only this time, funding and support from places like NAF exists.",
                                    "author": "LadyMorgan2018",
                                    "id": "idkw9yt",
                                    "parent_id": "t1_idkvmtx",
                                    "score": 5,
                                    "created_utc": 1656089804.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "idkx3lf",
                                            "parent_id": "t1_idkw9yt",
                                            "score": 1,
                                            "created_utc": 1656090107.0,
                                            "replies": [
                                                {
                                                    "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
                                                    "author": "LadyMorgan2018",
                                                    "id": "idkydtb",
                                                    "parent_id": "t1_idkx3lf",
                                                    "score": 3,
                                                    "created_utc": 1656090592.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "👏🏼👏🏼",
            "author": "c0rnstarr",
            "id": "idknmdt",
            "parent_id": "t1_idkmwaz",
            "score": 6,
            "created_utc": 1656086582.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkq8dy",
            "parent_id": "t1_idkmwaz",
            "score": -3,
            "created_utc": 1656087565.0,
            "replies": [
                {
                    "body": "I only mention guns, because it is that this recent SCOTUS has seen the most right wing activism we've had in decades. Voting rights, abortion rights, and the separation of church and state have been repealed, while gun right protection has been expanded. Unfortunately, it's a young court, so we are faced with more removal of rights. It will not be long before gay marriage is repealed and then....who knows?",
                    "author": "LadyMorgan2018",
                    "id": "idkvdy0",
                    "parent_id": "t1_idkq8dy",
                    "score": 3,
                    "created_utc": 1656089474.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkvvuo",
                            "parent_id": "t1_idkvdy0",
                            "score": 1,
                            "created_utc": 1656089660.0,
                            "replies": [
                                {
                                    "body": "I will take this from my personal history with ACT UP in the 90s...\n\nACT UP! FIGHT BACK! ✊️",
                                    "author": "LadyMorgan2018",
                                    "id": "idkwi1b",
                                    "parent_id": "t1_idkvvuo",
                                    "score": 4,
                                    "created_utc": 1656089887.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Gun rights or lack thereof also target poor and minority.\n\nHow so?",
                    "author": "whatever-tata",
                    "id": "idlcd9q",
                    "parent_id": "t1_idkq8dy",
                    "score": 1,
                    "created_utc": 1656096011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Liberal state as well.\n\n&#x200B;\n\nWelcome to host and care for any woman in need, DM as well.",
            "author": "AubrynnSky",
            "id": "idmdr0u",
            "parent_id": "t1_idlfpdp",
            "score": 7,
            "created_utc": 1656111548.0,
            "replies": []
        },
        {
            "body": "Can I dream that women’s reproductive rights will be codified in the Constitution in an updated version of the Equal Rights Amendment?",
            "author": "ExpertPerformance",
            "id": "idlyh9t",
            "parent_id": "t1_idlp0g6",
            "score": 3,
            "created_utc": 1656104911.0,
            "replies": []
        },
        {
            "body": "> They’re hypocrites.\n\nThat's all that needs to be said.\n\nMany of these justices lied during their confirmation hearings.  \n\nHypocrisy of Organized religion is the most boundless in my experience.",
            "author": "SDstartingOut",
            "id": "idkyho8",
            "parent_id": "t1_idkqbfq",
            "score": 15,
            "created_utc": 1656090633.0,
            "replies": []
        },
        {
            "body": "Trump appointed justices are his minions. This is just a flex by the Supreme Court. They don’t really pay attention to what is right and what is wrong they just want to be popular with neocons",
            "author": "UnearthlyDinosaur",
            "id": "idkvu1h",
            "parent_id": "t1_idkqbfq",
            "score": 7,
            "created_utc": 1656089641.0,
            "replies": [
                {
                    "body": "> Trump appointed justices are his minions. This is just a flex by the Supreme Court. They don’t really pay attention to what is right and what is wrong they just want to be popular with neocons\n\nYou have this in reverse.\n\nThe Christian Conservatives made a deal with the Devil (Trump).  They supported him - someone completely devoid of any ethics, or morals - that would be considered \"good\" by society - with the promise that he would stack the court.  \n\nHe did.\n\nIf they were his minions - he'd still be President.\n\nYou can read plenty of articles out there - by conservatives effectively admitting it.  Roe v. Wade is their payoff, for supporting this shitty ass dude.",
                    "author": "SDstartingOut",
                    "id": "idkyrio",
                    "parent_id": "t1_idkvu1h",
                    "score": 14,
                    "created_utc": 1656090739.0,
                    "replies": [
                        {
                            "body": "They ignored everything about him.\n\nThe affairs with porn stars, “grab her by the pussy”, lies he told easily disproven with facts, how he scammed many people out of money with Trump University, etc….he & his family were even convicted of misusing charity funds & banned from operating charities in New York. \n\nNot to mention him collecting millions of donations from his supporters to fund his meritless reelection claims that failed in every single court case (67 total I’ve read).\n\nHe is a danger because the evangelicals, right wing Christian, republicans, & moderate to extreme racists see a champion of their desires in him.\n\nRecently I’ve been going to the gun range…call me crazy but I FEEL for the 1st time in my life the need to get armed!",
                            "author": null,
                            "id": "idl0np0",
                            "parent_id": "t1_idkyrio",
                            "score": 9,
                            "created_utc": 1656091453.0,
                            "replies": []
                        },
                        {
                            "body": "Word",
                            "author": "UnearthlyDinosaur",
                            "id": "idkz5ge",
                            "parent_id": "t1_idkyrio",
                            "score": 4,
                            "created_utc": 1656090887.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Trump has hurt this country for decades by making the Supreme Court a republican majority.\n\nIn the court’s official ruling today, “Justice Clarence Thomas said the court should reconsider rulings that protect access to contraception, same-sex relationships, and same-sex marriage.”\n\nhttps://www.businessinsider.com/justice-thomas-said-the-court-should-reconsider-rulings-on-same-sex-marriage-2022-6\n\nThey are going to attempt to revert human rights, allow criminalization of gay people by state representatives passing homophobic laws, & send this country into madness. Do they REALLY think human beings are going to allow them to take us back to the past?…someone important will be killed by an opposing radical. Mark my words.",
                    "author": null,
                    "id": "idkxhm8",
                    "parent_id": "t1_idkvu1h",
                    "score": 8,
                    "created_utc": 1656090255.0,
                    "replies": [
                        {
                            "body": "Clarence Thomas didn't mention interracial marriage though, which stems from the same set of due process rights he targeted, because he's married to a white woman. Republicans always draw the line at things that personally affect them when they're fucking the rest of us over.",
                            "author": "Questiner",
                            "id": "idlg2pg",
                            "parent_id": "t1_idkxhm8",
                            "score": 6,
                            "created_utc": 1656097475.0,
                            "replies": []
                        },
                        {
                            "body": "Yup gay marriage will be over soon",
                            "author": "UnearthlyDinosaur",
                            "id": "idl1m4b",
                            "parent_id": "t1_idkxhm8",
                            "score": 2,
                            "created_utc": 1656091818.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They don’t deserve to sleep with both eyes closed",
            "author": "SatansBirthdayCake",
            "id": "idkztw1",
            "parent_id": "t1_idkzhf8",
            "score": 20,
            "created_utc": 1656091144.0,
            "replies": []
        },
        {
            "body": "Agreed that it should be enshrined, but what “compromising” are you referring to? Not much to compromise in the logical idea that a [potentially-]pregnant woman gets to decide if, when, and how long they are pregnant.",
            "author": "SDinMD",
            "id": "idmjn5b",
            "parent_id": "t1_idl56nn",
            "score": 3,
            "created_utc": 1656114291.0,
            "replies": []
        },
        {
            "body": "Agreed",
            "author": "AubrynnSky",
            "id": "idmdbue",
            "parent_id": "t1_idkup3l",
            "score": 3,
            "created_utc": 1656111355.0,
            "replies": []
        },
        {
            "body": "🙄",
            "author": "UseTheForceRey",
            "id": "idmlxdx",
            "parent_id": "t1_idkup3l",
            "score": -1,
            "created_utc": 1656115388.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkrhis",
            "parent_id": "t1_idkoe0t",
            "score": 8,
            "created_utc": 1656088027.0,
            "replies": [
                {
                    "body": "An expansion wouldn’t help- they can’t even keep up with the demand now. Inflation has made that demand worse and worse, and now add this in? It will be exactly like waiting for a housing voucher.",
                    "author": "loveoonthebrain",
                    "id": "idmdaux",
                    "parent_id": "t1_idkrhis",
                    "score": 3,
                    "created_utc": 1656111343.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its not poor women its poor women who sleep with poor men.",
            "author": "NotARussianBot1984",
            "id": "idmjt8j",
            "parent_id": "t1_idkoe0t",
            "score": 1,
            "created_utc": 1656114372.0,
            "replies": []
        },
        {
            "body": "Yeah this isn’t the end. It’s just the beginning",
            "author": "SatansBirthdayCake",
            "id": "idkfqra",
            "parent_id": "t1_idkfihl",
            "score": 10,
            "created_utc": 1656083616.0,
            "replies": []
        },
        {
            "body": "And none of the other Justices are supporting anything Thomas wrote, so to say \"those motherfuckers aren't nearly done\" is a stretch to say the least.",
            "author": "mraspencer",
            "id": "idknuiy",
            "parent_id": "t1_idkfihl",
            "score": -9,
            "created_utc": 1656086668.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idks9jt",
                    "parent_id": "t1_idknuiy",
                    "score": 4,
                    "created_utc": 1656088318.0,
                    "replies": [
                        {
                            "body": ">  He needs to take the time machine back 15 years to see what was being said about the \"protection of marriage\".\n\nHe's been on the court for 31 years. He was there.",
                            "author": "Y_4Z44",
                            "id": "idkt61z",
                            "parent_id": "t1_idks9jt",
                            "score": 1,
                            "created_utc": 1656088650.0,
                            "replies": []
                        },
                        {
                            "body": "You may be correct, but as I said elsewhere, the rest of the Justices, all of them, have already come out and said they do not support Thomas' assertions. \n\nCould be them just saying what people want to hear right now and things change down the road, but at the moment, that's the facts we have.",
                            "author": "mraspencer",
                            "id": "idkw2xp",
                            "parent_id": "t1_idks9jt",
                            "score": -2,
                            "created_utc": 1656089732.0,
                            "replies": [
                                {
                                    "body": "The other justices say a lot of things.  Including, for Alito, Kavanaugh and Barrett during their confirmation hearings, that Roe was settled law.  They are lying.  Don't be a child.",
                                    "author": "Zubaz_Enthusiast",
                                    "id": "idlk0j8",
                                    "parent_id": "t1_idkw2xp",
                                    "score": 4,
                                    "created_utc": 1656099051.0,
                                    "replies": [
                                        {
                                            "body": "Yay more name calling",
                                            "author": "mraspencer",
                                            "id": "idllnxl",
                                            "parent_id": "t1_idlk0j8",
                                            "score": -1,
                                            "created_utc": 1656099719.0,
                                            "replies": [
                                                {
                                                    "body": "Play stupid games, win stupid prizes.",
                                                    "author": "Zubaz_Enthusiast",
                                                    "id": "idllsfh",
                                                    "parent_id": "t1_idllnxl",
                                                    "score": 2,
                                                    "created_utc": 1656099769.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkrgqk",
                    "parent_id": "t1_idknuiy",
                    "score": 4,
                    "created_utc": 1656088019.0,
                    "replies": [
                        {
                            "body": "He also posited in an earlier thread that the court wouldn't overturn Roe v. Wade, so...this guy isn't exactly the brightest bulb in the box.",
                            "author": "Y_4Z44",
                            "id": "idks0ts",
                            "parent_id": "t1_idkrgqk",
                            "score": 5,
                            "created_utc": 1656088227.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "idkspnf",
                                    "parent_id": "t1_idks0ts",
                                    "score": 2,
                                    "created_utc": 1656088481.0,
                                    "replies": [
                                        {
                                            "body": "you are hilarious",
                                            "author": "mraspencer",
                                            "id": "idkvhdu",
                                            "parent_id": "t1_idkspnf",
                                            "score": -2,
                                            "created_utc": 1656089510.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It's ok to be wrong now and then, you should try it once. You might be surprised you have a humble side.\n\nWait...no you don't. Nevermind, continue on the path you're on.",
                                    "author": "mraspencer",
                                    "id": "idkvm3x",
                                    "parent_id": "t1_idks0ts",
                                    "score": -1,
                                    "created_utc": 1656089559.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idkofae",
            "parent_id": "t1_idkfihl",
            "score": -9,
            "created_utc": 1656086887.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkrlz9",
                    "parent_id": "t1_idkofae",
                    "score": 3,
                    "created_utc": 1656088073.0,
                    "replies": [
                        {
                            "body": "He’s troll. Don’t feed em",
                            "author": "SatansBirthdayCake",
                            "id": "idkrtol",
                            "parent_id": "t1_idkrlz9",
                            "score": 3,
                            "created_utc": 1656088152.0,
                            "replies": [
                                {
                                    "body": "I'm a troll? How?",
                                    "author": "Academic_Use_1719",
                                    "id": "idl06ld",
                                    "parent_id": "t1_idkrtol",
                                    "score": -2,
                                    "created_utc": 1656091276.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Religious nuts.",
            "author": "Lar5031",
            "id": "idkyhva",
            "parent_id": "t1_idkpjub",
            "score": 5,
            "created_utc": 1656090635.0,
            "replies": []
        },
        {
            "body": "Learn how the United States and its law making works before commenting.",
            "author": null,
            "id": "idkngt2",
            "parent_id": "t1_idkkubw",
            "score": -13,
            "created_utc": 1656086523.0,
            "replies": [
                {
                    "body": "I know how the law making works. I studied American history and political science as my major in university. \n\nAnd it's your type of comment that is the problem. \n\nGuess what? I have the freedom to comment and say what I want.\n\nIt's people like you who want to curb others just because their opinions, beliefs and values differ from yours. That's the problem.",
                    "author": "Significant-Fun-2146",
                    "id": "idkozut",
                    "parent_id": "t1_idkngt2",
                    "score": 6,
                    "created_utc": 1656087101.0,
                    "replies": [
                        {
                            "body": "You are absolutely free to comment. And obviously if you know, supposedly, how the process works - when done properly, then my comment doesnt much apply to needing a response from you.\n\nI have zero interest in curbing/curving/carving others into my beliefs.  But facts are facts.",
                            "author": null,
                            "id": "idkpmuq",
                            "parent_id": "t1_idkozut",
                            "score": -7,
                            "created_utc": 1656087341.0,
                            "replies": [
                                {
                                    "body": "PS: im sure you had a blast when the 2nd amendment verdict was issued!",
                                    "author": null,
                                    "id": "idkpsah",
                                    "parent_id": "t1_idkpmuq",
                                    "score": -3,
                                    "created_utc": 1656087398.0,
                                    "replies": [
                                        {
                                            "body": "You know you can edit your post right? You don't have to comment on your own post to add a comment that has nothing to do with our original discussion lol.\n\nBedsides, this isn't the place to discuss the 2nd amendment decision anyway. Unless your carrying a gun to all your sugar dates. :)",
                                            "author": "Significant-Fun-2146",
                                            "id": "idkwcwt",
                                            "parent_id": "t1_idkpsah",
                                            "score": 3,
                                            "created_utc": 1656089834.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I support significant’s commenting and reject you trying to police their input. Shutting people down is toxic for healthy discussion. If you actually believe someone’s missing something, then bring the information to the discussion!",
                    "author": "lumpsel",
                    "id": "idkrynr",
                    "parent_id": "t1_idkngt2",
                    "score": 2,
                    "created_utc": 1656088205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sending you all the love ❤️",
            "author": "SatansBirthdayCake",
            "id": "idkflps",
            "parent_id": "t1_idkfecu",
            "score": 1,
            "created_utc": 1656083563.0,
            "replies": []
        },
        {
            "body": "He'll outlaw miscegenation as long as he can grandfather himself in.",
            "author": "Dizzy_Share3155",
            "id": "idlsxyx",
            "parent_id": "t1_idlcjq5",
            "score": 5,
            "created_utc": 1656102645.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idktyhx",
            "parent_id": "t1_idksgny",
            "score": 8,
            "created_utc": 1656088941.0,
            "replies": [
                {
                    "body": "I sugar because federal & state taxes kill my pay. \n\nI dreamed & worked hard to make over XXXk just to watch a lot of it ripped away. \n\nCost of living & taxes keeps going up! Nothing is ever enough for the government and ignorant republican-led states who trash blue states yet rely on their tax money. \n\nIf I work to earn more, they’ll take more. What’s the point of working hard & having dreams anymore. \n\nMore babies born to poor mothers means more taxes…because wealthy people don’t pay taxes. They hide $ & professionally avoid taxes. It will be ppl like me trying to get ahead in this world with the government’s foot on our necks.",
                    "author": null,
                    "id": "idl44z7",
                    "parent_id": "t1_idktyhx",
                    "score": 5,
                    "created_utc": 1656092785.0,
                    "replies": [
                        {
                            "body": "Any women trying to locate protests in your city check here!:\n\nhttps://www.womensmarch.com/",
                            "author": null,
                            "id": "idlmpmc",
                            "parent_id": "t1_idl44z7",
                            "score": 3,
                            "created_utc": 1656100137.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No, that's not allowed under the deal, it's personal responsibility all the way. No handouts, no freeloading, no subsidies.",
                    "author": "whatever-tata",
                    "id": "idkv04f",
                    "parent_id": "t1_idktyhx",
                    "score": 3,
                    "created_utc": 1656089330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> ou're two different countries. Let the red states have this ruling,\n\nWhat you don't understand is that most states are not North Dakota.  They are both red & blue.\n\nI live in Georgia - outside of Atlanta.  It's pretty heavily Democratic area, and a large part of Georgia's economy.\n\nBut it's a red state...",
            "author": "SDstartingOut",
            "id": "idkz7t3",
            "parent_id": "t1_idksgny",
            "score": 4,
            "created_utc": 1656090912.0,
            "replies": [
                {
                    "body": "Everyone knows that. My post is obviously not a serious nor realistic possibility, it's just crazy that in 2022 you still have 50% of your country voting for these red state ideals, like this ruling.",
                    "author": "whatever-tata",
                    "id": "idl8h4c",
                    "parent_id": "t1_idkz7t3",
                    "score": 1,
                    "created_utc": 1656094469.0,
                    "replies": [
                        {
                            "body": "> Everyone knows that.\n\nBelieve it or not - that's untrue.  Especially people outside of the US.  They don't realize how divided it is.",
                            "author": "SDstartingOut",
                            "id": "idlbsfb",
                            "parent_id": "t1_idl8h4c",
                            "score": 2,
                            "created_utc": 1656095781.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not funny anymore",
            "author": "SatansBirthdayCake",
            "id": "idll5sn",
            "parent_id": "t1_idleqds",
            "score": 8,
            "created_utc": 1656099516.0,
            "replies": [
                {
                    "body": "Just a case of perspective then.",
                    "author": "Rylakb",
                    "id": "idlrooz",
                    "parent_id": "t1_idll5sn",
                    "score": -2,
                    "created_utc": 1656102135.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's actually scary, not funny at all. Many people will suffer b/c of this. Its not even going to stop abortion,  it'll just make it unsafe for those getting it. ...back to coat hangars and back allies 🥺",
            "author": "Zia19",
            "id": "idlwenv",
            "parent_id": "t1_idleqds",
            "score": 5,
            "created_utc": 1656104057.0,
            "replies": []
        },
        {
            "body": "> In Europe, we’re once again laughing at you guys.\n\nUnless you are in Poland.\n\nOr Malta.\n\nOr Liechtenstein.  \n\nI'd throw Vatican city in there, but since guys can't get other males pregnant, I guess it doesn't count.",
            "author": "SDstartingOut",
            "id": "idmny3u",
            "parent_id": "t1_idleqds",
            "score": 3,
            "created_utc": 1656116359.0,
            "replies": []
        },
        {
            "body": "A substantial number of abortions performed in the USA would be illegal in Europe",
            "author": "huizeng",
            "id": "idlwtah",
            "parent_id": "t1_idleqds",
            "score": 0,
            "created_utc": 1656104223.0,
            "replies": []
        },
        {
            "body": "Wrong. It DOES automatically ban abortion in many states.\n\nAlabama, Arizona, Arkansas, Michigan, Mississippi, Oklahoma, Texas, West Virginia, and Wisconsin already had banned abortions prior to Roe being overturned and this ruling allows those bans to stand.\n\nIdaho, Kentucky, Louisiana, Missouri, North Dakota, South Dakota, Tennessee, Utah, and Wyoming each have trigger laws that banned abortions as soon as Roe was overturned.\n\nGeorgia, Iowa, Ohio, and South Carolina have extreme limits on abortion and are likely to push for full bans now.\n\nAnd soon Florida, Indiana, Nebraska, and Montana will push for full bans as they have the political climate to do so.",
            "author": "ExpertPerformance",
            "id": "idko96c",
            "parent_id": "t1_idkkqz6",
            "score": 20,
            "created_utc": 1656086822.0,
            "replies": [
                {
                    "body": "So… if you sugar date in any of…\n\nDallas, Houston, Miami, Atlanta, Phoenix, Detroit, Minneapolis, Tampa, St. Louis, Charlotte, Orlando, San Antonio, Cincinnati, Austin, Kansas City, Columbus, Indianapolis, Cleveland, Nashville, Jacksonville, Milwaukee, Oklahoma City, Memphis, Louisville, Salt Lake City, New Orleans, Birmingham, Grand Rapids, Tucson, Tulsa, Omaha, Greenville, Knoxville, McAllen, Baton Rouge, El Paso, Sarasota, Columbia, Dayton, Boise…\n\nyou might want to keep emergency funds on hand if you find you unexpectedly have a certain need to travel to a 21st century state that supports women’s reproductive rights.",
                    "author": "ExpertPerformance",
                    "id": "idkyjbu",
                    "parent_id": "t1_idko96c",
                    "score": 9,
                    "created_utc": 1656090650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkmuxn",
            "parent_id": "t1_idkkqz6",
            "score": 13,
            "created_utc": 1656086298.0,
            "replies": [
                {
                    "body": "Does anyone really believe in a \"person's right to decide what to do with their body\"? Universal restrictions on drug use and prostitution seem to indicate not really...",
                    "author": "huizeng",
                    "id": "idkt01l",
                    "parent_id": "t1_idkmuxn",
                    "score": 1,
                    "created_utc": 1656088588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have you seen some of the officials that are elected in some of these states? There are real nut cases in office—ones that do not care about women’s bodily autonomy.",
            "author": "zara_io",
            "id": "idkl76c",
            "parent_id": "t1_idkkqz6",
            "score": 11,
            "created_utc": 1656085670.0,
            "replies": [
                {
                    "body": "So vote!  I hold my state politicians accountable.  Hold your states politicians equally accountable.",
                    "author": null,
                    "id": "idknp0k",
                    "parent_id": "t1_idkl76c",
                    "score": -5,
                    "created_utc": 1656086609.0,
                    "replies": [
                        {
                            "body": "I do vote, so thank you for that. I’m also not talking about where I live. I’m certain there are people like me that live in said states that also vote, but these people get voted in by other nut cases who also don’t care about women’s rights. Can’t hold said politicians accountable if they’re already in office and getting re-elected by the same majority.",
                            "author": "zara_io",
                            "id": "idkuiyu",
                            "parent_id": "t1_idknp0k",
                            "score": 5,
                            "created_utc": 1656089153.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In a lot of states, it does. Roe v Wade is the reason why Sugar is safer for women and why we have the privacy to date who we’d like. Your right to privacy is also at risk because of this.\n\nThis has so many more implications than just Abortion. Seeing it as *just abortion* is incredibly ignorant. \n\nIn the opinion, Justice Thomas calls for the opinions on contraceptives to be reconsidered as well. You’re at risk of losing access to the women you love to spend time with because they will drop out of the bowl. Without access to contraceptives, you’re more at risk for a pregnancy that you helped create and being responsible for that child. If you’d like the have a black SB, that’s now at risk too. None of these are explicitly protected under the 14A, but that’s how we got these things in the first place. \n\nNow do you get it?",
            "author": "SatansBirthdayCake",
            "id": "idkn1tx",
            "parent_id": "t1_idkkqz6",
            "score": 8,
            "created_utc": 1656086369.0,
            "replies": []
        },
        {
            "body": "Why have a bill of rights at all?  Why emancipate the slaves?  States rights, right?",
            "author": "sparky_SD16",
            "id": "idkmntg",
            "parent_id": "t1_idkkqz6",
            "score": 8,
            "created_utc": 1656086224.0,
            "replies": []
        },
        {
            "body": "> Roe V Wade being overturned does not automatically ban abortion\n\nExcept in the states that have a trigger law.\n\n> Twenty-two states had laws or constitutional amendments that were already in place which could be quickly used to try to ban abortion.",
            "author": "SDstartingOut",
            "id": "idkzclg",
            "parent_id": "t1_idkkqz6",
            "score": 2,
            "created_utc": 1656090963.0,
            "replies": [
                {
                    "body": "The difference is that when it's left up to elected officials the people get a say based on who they vote for as opposed to the federal government simply legislating from the bench, something they are not supposed to do. \n\nThose states have those laws on the books because that is what the majority of people in those states want.",
                    "author": "RTManson",
                    "id": "idls4qx",
                    "parent_id": "t1_idkzclg",
                    "score": 3,
                    "created_utc": 1656102314.0,
                    "replies": [
                        {
                            "body": "Tell me more about your fantasy that the political system of a state like Georgia is based on \"what the majority of people \\[or majority of eligible voters\\] want\".",
                            "author": "highfructoseSD",
                            "id": "idmpn7d",
                            "parent_id": "t1_idls4qx",
                            "score": 2,
                            "created_utc": 1656117185.0,
                            "replies": []
                        },
                        {
                            "body": "100% factually incorrect.\n\nI live in Georgia.  Georgia has a law on the books, effectively outlawing abortion.\n\nYet - most people in Georgia do NOT support over turning Roe v. Wade.\n\n> Most Georgians oppose overturning Roe v. Wade but are more open to placing some restrictions on abortion, according to recent polling",
                            "author": "SDstartingOut",
                            "id": "idlydpj",
                            "parent_id": "t1_idls4qx",
                            "score": 1,
                            "created_utc": 1656104869.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkukim",
            "parent_id": "t1_idktjwy",
            "score": 8,
            "created_utc": 1656089169.0,
            "replies": [
                {
                    "body": "i don't assume everyone knows this. i've heard a lot of talk about this decision since the leak a while back. a lot of people do not know what this means. maybe the people in this sub are more informed than average though",
                    "author": "davitech73",
                    "id": "idkwd3d",
                    "parent_id": "t1_idkukim",
                    "score": -3,
                    "created_utc": 1656089836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkrl2i",
            "parent_id": "t1_idkp40w",
            "score": 3,
            "created_utc": 1656088063.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idks8tm",
                    "parent_id": "t1_idkrl2i",
                    "score": 1,
                    "created_utc": 1656088310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No. This decision affects the bowl A LOT",
            "author": "SatansBirthdayCake",
            "id": "idkrjxv",
            "parent_id": "t1_idkqz4j",
            "score": 21,
            "created_utc": 1656088052.0,
            "replies": [
                {
                    "body": "How's this discussion going to help anything?",
                    "author": "gaxxzz",
                    "id": "idkw5wr",
                    "parent_id": "t1_idkrjxv",
                    "score": -9,
                    "created_utc": 1656089762.0,
                    "replies": [
                        {
                            "body": "Move the goalpost. \n\nYou act like relationships that involve sex aren't going to be affected. \n\nStop posting if you honestly don't see how the two are related.",
                            "author": "2catsandacomputer",
                            "id": "idmfx8a",
                            "parent_id": "t1_idkw5wr",
                            "score": 2,
                            "created_utc": 1656112542.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can we keep laws off of my uterus?",
            "author": "Lar5031",
            "id": "idkyeuu",
            "parent_id": "t1_idkqz4j",
            "score": 15,
            "created_utc": 1656090603.0,
            "replies": []
        },
        {
            "body": "Sure.  If you are part of the minority that actually supports this decision, how about you just leave the thread alone, and ignore it?",
            "author": "SDstartingOut",
            "id": "idkzin4",
            "parent_id": "t1_idkqz4j",
            "score": 6,
            "created_utc": 1656091027.0,
            "replies": []
        },
        {
            "body": "Sure. Just as soon as you agree to keep your dick out of a pussy.\n\nAgreed?",
            "author": "ExpertPerformance",
            "id": "idm3wb4",
            "parent_id": "t1_idkqz4j",
            "score": 5,
            "created_utc": 1656107209.0,
            "replies": []
        },
        {
            "body": "And at the basic your argument holds no water - because take away NY money and CA money (progressive states)  from the federal tit and most regressive states would not have a pot to piss in. \n\nForget the major fact that you are advocating for repression. Not freedom.\n\nAnd you are welcome to move to the Middle East that aligns more with your views. Silly retort right?",
            "author": "thereadinessisall",
            "id": "idkkaft",
            "parent_id": "t1_idkirrs",
            "score": 12,
            "created_utc": 1656085323.0,
            "replies": [
                {
                    "body": "As someone who came from Middle East, please keep your filth with yourself. We have enough crazy of our own.",
                    "author": null,
                    "id": "idkmj2k",
                    "parent_id": "t1_idkkaft",
                    "score": 0,
                    "created_utc": 1656086174.0,
                    "replies": [
                        {
                            "body": "Hahaha - not wanting to send more to you over there - maybe collectively we can buy a big island for them all to live on.",
                            "author": "thereadinessisall",
                            "id": "idkmw39",
                            "parent_id": "t1_idkmj2k",
                            "score": 4,
                            "created_utc": 1656086309.0,
                            "replies": [
                                {
                                    "body": "Epstein Island??",
                                    "author": null,
                                    "id": "idknass",
                                    "parent_id": "t1_idkmw39",
                                    "score": 2,
                                    "created_utc": 1656086461.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkma08",
                    "parent_id": "t1_idkkaft",
                    "score": -5,
                    "created_utc": 1656086079.0,
                    "replies": [
                        {
                            "body": "Will of some people - trump LOST the popular vote —— TWICE.",
                            "author": "thereadinessisall",
                            "id": "idkmnbu",
                            "parent_id": "t1_idkma08",
                            "score": 6,
                            "created_utc": 1656086218.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know how anything you said justify not giving women freedom on their own body. All it does it make women scared and remove freedom what we all in this community desire so much.",
            "author": "IllustriousCake8030",
            "id": "idkkjdj",
            "parent_id": "t1_idkirrs",
            "score": 10,
            "created_utc": 1656085417.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "idklwfj",
                    "parent_id": "t1_idkkjdj",
                    "score": -3,
                    "created_utc": 1656085937.0,
                    "replies": [
                        {
                            "body": "Reported.",
                            "author": "MrBuzzard",
                            "id": "idkmt1t",
                            "parent_id": "t1_idklwfj",
                            "score": 2,
                            "created_utc": 1656086278.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "idko4y0",
                                    "parent_id": "t1_idkmt1t",
                                    "score": 0,
                                    "created_utc": 1656086778.0,
                                    "replies": [
                                        {
                                            "body": "Reported again.  This is a sex positive sub.  Not a place for knuckle dragging, busybodies like you thinking they have a right to tell others how to live their life.",
                                            "author": "MrBuzzard",
                                            "id": "idkyg8k",
                                            "parent_id": "t1_idko4y0",
                                            "score": 2,
                                            "created_utc": 1656090617.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Forced birth isn’t a cultural freedom. It’s oppression.",
            "author": "SatansBirthdayCake",
            "id": "idkjucm",
            "parent_id": "t1_idkirrs",
            "score": 10,
            "created_utc": 1656085159.0,
            "replies": [
                {
                    "body": "This guy showed up in SLF specifically to argue about abortion. He's a troll, so don't waste too much time with it.",
                    "author": "Y_4Z44",
                    "id": "idklq11",
                    "parent_id": "t1_idkjucm",
                    "score": 7,
                    "created_utc": 1656085870.0,
                    "replies": [
                        {
                            "body": "Ya, just figured that out.  Won’t be feeding this particular troll any longer.",
                            "author": "MrBuzzard",
                            "id": "idkmaqm",
                            "parent_id": "t1_idklq11",
                            "score": 3,
                            "created_utc": 1656086087.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“End of the country”?!  Get serious!  This post is a shining example of the extremism and blatant stupidity that is so prevalent today.",
            "author": "MrBuzzard",
            "id": "idkknv8",
            "parent_id": "t1_idkirrs",
            "score": 2,
            "created_utc": 1656085464.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "idklcxl",
                    "parent_id": "t1_idkknv8",
                    "score": -9,
                    "created_utc": 1656085731.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkoaib",
                            "parent_id": "t1_idklcxl",
                            "score": 2,
                            "created_utc": 1656086837.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "idkpg4l",
                                    "parent_id": "t1_idkoaib",
                                    "score": -2,
                                    "created_utc": 1656087271.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a joke , right?\n\nIt’s not funny.",
            "author": "daddoms",
            "id": "idkzkhk",
            "parent_id": "t1_idkmk6s",
            "score": 5,
            "created_utc": 1656091046.0,
            "replies": []
        },
        {
            "body": "Lol- tell me you try to trap women without telling me you try to trap women",
            "author": "DonutWhole9717",
            "id": "idkpl8t",
            "parent_id": "t1_idko3ug",
            "score": 19,
            "created_utc": 1656087325.0,
            "replies": []
        },
        {
            "body": "I hope you like being responsible for a child you create and force on others too.",
            "author": "SatansBirthdayCake",
            "id": "idkot3s",
            "parent_id": "t1_idko3ug",
            "score": 15,
            "created_utc": 1656087031.0,
            "replies": []
        },
        {
            "body": "Let's see how happy you are when your taxes are raised to provide financial assistance for those families or when one of your SBs get pregnant and can't terminate her pregnancy.\n\nGuys like you are the first ones to be up in arms against welfare and social programs and are often the kind of people who look down on single mothers.",
            "author": "LightOLove",
            "id": "idksq2a",
            "parent_id": "t1_idko3ug",
            "score": 8,
            "created_utc": 1656088486.0,
            "replies": [
                {
                    "body": ">Let's see how happy you are when your taxes are raised to provide financial assistance for those families or when one of your SBs get pregnant and can't terminate her pregnancy.\n\nI am okay with both of these things. I support the nordic style social safety nets.",
                    "author": "CanOfWoody",
                    "id": "idkt605",
                    "parent_id": "t1_idksq2a",
                    "score": -6,
                    "created_utc": 1656088650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idkpyfs",
            "parent_id": "t1_idko3ug",
            "score": -9,
            "created_utc": 1656087462.0,
            "replies": [
                {
                    "body": "Another one of those accounts who's never posted in here before showing up to voice his opinion. How quaint.",
                    "author": "Y_4Z44",
                    "id": "idksh1w",
                    "parent_id": "t1_idkpyfs",
                    "score": 6,
                    "created_utc": 1656088395.0,
                    "replies": [
                        {
                            "body": "Jesus loves you ❤️",
                            "author": "crackedpacks4life",
                            "id": "idkw9h2",
                            "parent_id": "t1_idksh1w",
                            "score": -3,
                            "created_utc": 1656089799.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Behave…",
            "author": "MsFabulous157",
            "id": "idky5pk",
            "parent_id": "t1_idkumui",
            "score": 3,
            "created_utc": 1656090507.0,
            "replies": []
        },
        {
            "body": "Yes. Miscarriages will be investigated to see if it was intentionally caused and women will be made criminals for it who can’t vote. That’s the point.",
            "author": "SatansBirthdayCake",
            "id": "idm40nv",
            "parent_id": "t1_idm160t",
            "score": 22,
            "created_utc": 1656107262.0,
            "replies": []
        },
        {
            "body": "Misoprostol is used to treat ulcers in horses and available at the same veterinarian places you buy your ivermectin.",
            "author": "aajniojnoihnoi",
            "id": "idmmo8t",
            "parent_id": "t1_idl1lpa",
            "score": 10,
            "created_utc": 1656115743.0,
            "replies": [
                {
                    "body": "Thanks for the information. I don’t need an abortion but people like you willing to help are appreciated.",
                    "author": null,
                    "id": "idmo7rw",
                    "parent_id": "t1_idmmo8t",
                    "score": 5,
                    "created_utc": 1656116486.0,
                    "replies": [
                        {
                            "body": "Advice on DIY abortion techniques:\n\nhttps://archive.org/details/FTVDIYA",
                            "author": "aajniojnoihnoi",
                            "id": "idmoqk7",
                            "parent_id": "t1_idmo7rw",
                            "score": 4,
                            "created_utc": 1656116740.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I feel a lot of things too, but mostly sadness and heart ache. \n\nI hate it here and it just adds to the list of wanting to move to Australia even more",
            "author": "Sweetcheeks864",
            "id": "idl461i",
            "parent_id": "t1_idl1lpa",
            "score": 5,
            "created_utc": 1656092797.0,
            "replies": [
                {
                    "body": "I feel the same on wanting to leave the US now. Gonna go outside & do something to stop thinking about this. \n\nI have to get long term birth control now & deal with the side effects on my body. I’m scared & angry for women…but it’s nice outside & I’ll find a protest to attend in the future. \n\nHugs",
                    "author": null,
                    "id": "idl98z1",
                    "parent_id": "t1_idl461i",
                    "score": 6,
                    "created_utc": 1656094776.0,
                    "replies": [
                        {
                            "body": "A female condom is an option too, if you want minimal side effects! \n\nEnjoy your day outside 🙂",
                            "author": "Sweetcheeks864",
                            "id": "idlgiau",
                            "parent_id": "t1_idl98z1",
                            "score": 2,
                            "created_utc": 1656097647.0,
                            "replies": [
                                {
                                    "body": "Thanks. There’s protests happening this weekend & things. I still don’t feel a lot better about this. Going to 1 now. Here’s a link of protests all over if interested: https://www.womensmarch.com/",
                                    "author": null,
                                    "id": "idlsrrp",
                                    "parent_id": "t1_idlgiau",
                                    "score": 4,
                                    "created_utc": 1656102574.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah we don’t play that game here. We don’t restrict access to a woman in need. No matter your background, political leanings, heritage, etc. we absolutely DO NOT discriminate or refuse to help a woman in need. \n\nIf we do, we’re no better than the monsters who made this decision for us today.",
            "author": "SatansBirthdayCake",
            "id": "idlb417",
            "parent_id": "t1_idlaq0f",
            "score": 33,
            "created_utc": 1656095510.0,
            "replies": [
                {
                    "body": "Ijs, in the Handmaid's Tale Ofglen leads a woman to her death for being a bitch to her fellow woman. \n\nI'm tired of the \"take the high road\" politics. We've been doing that since the 90s and now we're here, at overturning something that is literally deletes autonomy. Saying \"states rights\" is being ignorant, we fought a fucking civil war over this ffs 🙄 Democrats have been playing fair, it isn't working. \n\nGloves fucking off or get ye behind me. Losing your rights isn't a \"turn the other cheek\" moment. It isn't a \"forgive thy neighbor\" moment. Go with grace in everywhere else in life, but not this fight and not right now.",
                    "author": "2catsandacomputer",
                    "id": "idmgtne",
                    "parent_id": "t1_idlb417",
                    "score": 4,
                    "created_utc": 1656112957.0,
                    "replies": []
                },
                {
                    "body": "And failing to fight evil with evil is a prescription for losing when you walk through the shadow of the valley of death. \n\nI can be my best self when not staring down the barrel of a 6-3 revanchist SCOTUS. Until then, all bets are off.",
                    "author": "throwawayaccount0327",
                    "id": "idlbt7k",
                    "parent_id": "t1_idlb417",
                    "score": 1,
                    "created_utc": 1656095790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t be surprised if Thomas, completely devoid of any self awareness or irony, penned an overruling of Loving.",
            "author": "j19104",
            "id": "idkzeo5",
            "parent_id": "t1_idkrd7t",
            "score": 10,
            "created_utc": 1656090985.0,
            "replies": []
        },
        {
            "body": "Its up to congress to put abortion in the constitution. Hopefully they do that by wednesday",
            "author": "NotARussianBot1984",
            "id": "idmjbh3",
            "parent_id": "t1_idlia30",
            "score": 0,
            "created_utc": 1656114136.0,
            "replies": []
        },
        {
            "body": "Yeah, I agree there, some more countries as well unfortunately :(",
            "author": "noLeatherPlease",
            "id": "idktjge",
            "parent_id": "t1_idkss5k",
            "score": 4,
            "created_utc": 1656088789.0,
            "replies": []
        },
        {
            "body": "State mandated pregnancy",
            "author": "SD1070",
            "id": "idknt4f",
            "parent_id": "t1_idknhom",
            "score": 19,
            "created_utc": 1656086653.0,
            "replies": []
        },
        {
            "body": "If by civil disobedience you mean assist with helping women get the care they have the human right to have...then yes. Between medicinal abortions, contraception via mail,  and abortion tourism ..women will get what they need. \n\nWe take care of our own. No one else will.",
            "author": "LadyMorgan2018",
            "id": "idkupkk",
            "parent_id": "t1_idkrt3m",
            "score": 7,
            "created_utc": 1656089221.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkvmtx",
                    "parent_id": "t1_idkupkk",
                    "score": 2,
                    "created_utc": 1656089566.0,
                    "replies": [
                        {
                            "body": "Clinics are going up in women-friendly states to meet the demand. The abortion underground will not likely set up brick and mortar clinics. If you haven't seen \"The Janes,\" I recommend it. Yes, they were active pre-Roe, but it will happen again. Only this time, funding and support from places like NAF exists.",
                            "author": "LadyMorgan2018",
                            "id": "idkw9yt",
                            "parent_id": "t1_idkvmtx",
                            "score": 5,
                            "created_utc": 1656089804.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "idkx3lf",
                                    "parent_id": "t1_idkw9yt",
                                    "score": 1,
                                    "created_utc": 1656090107.0,
                                    "replies": [
                                        {
                                            "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
                                            "author": "LadyMorgan2018",
                                            "id": "idkydtb",
                                            "parent_id": "t1_idkx3lf",
                                            "score": 3,
                                            "created_utc": 1656090592.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I only mention guns, because it is that this recent SCOTUS has seen the most right wing activism we've had in decades. Voting rights, abortion rights, and the separation of church and state have been repealed, while gun right protection has been expanded. Unfortunately, it's a young court, so we are faced with more removal of rights. It will not be long before gay marriage is repealed and then....who knows?",
            "author": "LadyMorgan2018",
            "id": "idkvdy0",
            "parent_id": "t1_idkq8dy",
            "score": 3,
            "created_utc": 1656089474.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkvvuo",
                    "parent_id": "t1_idkvdy0",
                    "score": 1,
                    "created_utc": 1656089660.0,
                    "replies": [
                        {
                            "body": "I will take this from my personal history with ACT UP in the 90s...\n\nACT UP! FIGHT BACK! ✊️",
                            "author": "LadyMorgan2018",
                            "id": "idkwi1b",
                            "parent_id": "t1_idkvvuo",
                            "score": 4,
                            "created_utc": 1656089887.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Gun rights or lack thereof also target poor and minority.\n\nHow so?",
            "author": "whatever-tata",
            "id": "idlcd9q",
            "parent_id": "t1_idkq8dy",
            "score": 1,
            "created_utc": 1656096011.0,
            "replies": []
        },
        {
            "body": "> Trump appointed justices are his minions. This is just a flex by the Supreme Court. They don’t really pay attention to what is right and what is wrong they just want to be popular with neocons\n\nYou have this in reverse.\n\nThe Christian Conservatives made a deal with the Devil (Trump).  They supported him - someone completely devoid of any ethics, or morals - that would be considered \"good\" by society - with the promise that he would stack the court.  \n\nHe did.\n\nIf they were his minions - he'd still be President.\n\nYou can read plenty of articles out there - by conservatives effectively admitting it.  Roe v. Wade is their payoff, for supporting this shitty ass dude.",
            "author": "SDstartingOut",
            "id": "idkyrio",
            "parent_id": "t1_idkvu1h",
            "score": 14,
            "created_utc": 1656090739.0,
            "replies": [
                {
                    "body": "They ignored everything about him.\n\nThe affairs with porn stars, “grab her by the pussy”, lies he told easily disproven with facts, how he scammed many people out of money with Trump University, etc….he & his family were even convicted of misusing charity funds & banned from operating charities in New York. \n\nNot to mention him collecting millions of donations from his supporters to fund his meritless reelection claims that failed in every single court case (67 total I’ve read).\n\nHe is a danger because the evangelicals, right wing Christian, republicans, & moderate to extreme racists see a champion of their desires in him.\n\nRecently I’ve been going to the gun range…call me crazy but I FEEL for the 1st time in my life the need to get armed!",
                    "author": null,
                    "id": "idl0np0",
                    "parent_id": "t1_idkyrio",
                    "score": 9,
                    "created_utc": 1656091453.0,
                    "replies": []
                },
                {
                    "body": "Word",
                    "author": "UnearthlyDinosaur",
                    "id": "idkz5ge",
                    "parent_id": "t1_idkyrio",
                    "score": 4,
                    "created_utc": 1656090887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Trump has hurt this country for decades by making the Supreme Court a republican majority.\n\nIn the court’s official ruling today, “Justice Clarence Thomas said the court should reconsider rulings that protect access to contraception, same-sex relationships, and same-sex marriage.”\n\nhttps://www.businessinsider.com/justice-thomas-said-the-court-should-reconsider-rulings-on-same-sex-marriage-2022-6\n\nThey are going to attempt to revert human rights, allow criminalization of gay people by state representatives passing homophobic laws, & send this country into madness. Do they REALLY think human beings are going to allow them to take us back to the past?…someone important will be killed by an opposing radical. Mark my words.",
            "author": null,
            "id": "idkxhm8",
            "parent_id": "t1_idkvu1h",
            "score": 8,
            "created_utc": 1656090255.0,
            "replies": [
                {
                    "body": "Clarence Thomas didn't mention interracial marriage though, which stems from the same set of due process rights he targeted, because he's married to a white woman. Republicans always draw the line at things that personally affect them when they're fucking the rest of us over.",
                    "author": "Questiner",
                    "id": "idlg2pg",
                    "parent_id": "t1_idkxhm8",
                    "score": 6,
                    "created_utc": 1656097475.0,
                    "replies": []
                },
                {
                    "body": "Yup gay marriage will be over soon",
                    "author": "UnearthlyDinosaur",
                    "id": "idl1m4b",
                    "parent_id": "t1_idkxhm8",
                    "score": 2,
                    "created_utc": 1656091818.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An expansion wouldn’t help- they can’t even keep up with the demand now. Inflation has made that demand worse and worse, and now add this in? It will be exactly like waiting for a housing voucher.",
            "author": "loveoonthebrain",
            "id": "idmdaux",
            "parent_id": "t1_idkrhis",
            "score": 3,
            "created_utc": 1656111343.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idks9jt",
            "parent_id": "t1_idknuiy",
            "score": 4,
            "created_utc": 1656088318.0,
            "replies": [
                {
                    "body": ">  He needs to take the time machine back 15 years to see what was being said about the \"protection of marriage\".\n\nHe's been on the court for 31 years. He was there.",
                    "author": "Y_4Z44",
                    "id": "idkt61z",
                    "parent_id": "t1_idks9jt",
                    "score": 1,
                    "created_utc": 1656088650.0,
                    "replies": []
                },
                {
                    "body": "You may be correct, but as I said elsewhere, the rest of the Justices, all of them, have already come out and said they do not support Thomas' assertions. \n\nCould be them just saying what people want to hear right now and things change down the road, but at the moment, that's the facts we have.",
                    "author": "mraspencer",
                    "id": "idkw2xp",
                    "parent_id": "t1_idks9jt",
                    "score": -2,
                    "created_utc": 1656089732.0,
                    "replies": [
                        {
                            "body": "The other justices say a lot of things.  Including, for Alito, Kavanaugh and Barrett during their confirmation hearings, that Roe was settled law.  They are lying.  Don't be a child.",
                            "author": "Zubaz_Enthusiast",
                            "id": "idlk0j8",
                            "parent_id": "t1_idkw2xp",
                            "score": 4,
                            "created_utc": 1656099051.0,
                            "replies": [
                                {
                                    "body": "Yay more name calling",
                                    "author": "mraspencer",
                                    "id": "idllnxl",
                                    "parent_id": "t1_idlk0j8",
                                    "score": -1,
                                    "created_utc": 1656099719.0,
                                    "replies": [
                                        {
                                            "body": "Play stupid games, win stupid prizes.",
                                            "author": "Zubaz_Enthusiast",
                                            "id": "idllsfh",
                                            "parent_id": "t1_idllnxl",
                                            "score": 2,
                                            "created_utc": 1656099769.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkrgqk",
            "parent_id": "t1_idknuiy",
            "score": 4,
            "created_utc": 1656088019.0,
            "replies": [
                {
                    "body": "He also posited in an earlier thread that the court wouldn't overturn Roe v. Wade, so...this guy isn't exactly the brightest bulb in the box.",
                    "author": "Y_4Z44",
                    "id": "idks0ts",
                    "parent_id": "t1_idkrgqk",
                    "score": 5,
                    "created_utc": 1656088227.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkspnf",
                            "parent_id": "t1_idks0ts",
                            "score": 2,
                            "created_utc": 1656088481.0,
                            "replies": [
                                {
                                    "body": "you are hilarious",
                                    "author": "mraspencer",
                                    "id": "idkvhdu",
                                    "parent_id": "t1_idkspnf",
                                    "score": -2,
                                    "created_utc": 1656089510.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's ok to be wrong now and then, you should try it once. You might be surprised you have a humble side.\n\nWait...no you don't. Nevermind, continue on the path you're on.",
                            "author": "mraspencer",
                            "id": "idkvm3x",
                            "parent_id": "t1_idks0ts",
                            "score": -1,
                            "created_utc": 1656089559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkrlz9",
            "parent_id": "t1_idkofae",
            "score": 3,
            "created_utc": 1656088073.0,
            "replies": [
                {
                    "body": "He’s troll. Don’t feed em",
                    "author": "SatansBirthdayCake",
                    "id": "idkrtol",
                    "parent_id": "t1_idkrlz9",
                    "score": 3,
                    "created_utc": 1656088152.0,
                    "replies": [
                        {
                            "body": "I'm a troll? How?",
                            "author": "Academic_Use_1719",
                            "id": "idl06ld",
                            "parent_id": "t1_idkrtol",
                            "score": -2,
                            "created_utc": 1656091276.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know how the law making works. I studied American history and political science as my major in university. \n\nAnd it's your type of comment that is the problem. \n\nGuess what? I have the freedom to comment and say what I want.\n\nIt's people like you who want to curb others just because their opinions, beliefs and values differ from yours. That's the problem.",
            "author": "Significant-Fun-2146",
            "id": "idkozut",
            "parent_id": "t1_idkngt2",
            "score": 6,
            "created_utc": 1656087101.0,
            "replies": [
                {
                    "body": "You are absolutely free to comment. And obviously if you know, supposedly, how the process works - when done properly, then my comment doesnt much apply to needing a response from you.\n\nI have zero interest in curbing/curving/carving others into my beliefs.  But facts are facts.",
                    "author": null,
                    "id": "idkpmuq",
                    "parent_id": "t1_idkozut",
                    "score": -7,
                    "created_utc": 1656087341.0,
                    "replies": [
                        {
                            "body": "PS: im sure you had a blast when the 2nd amendment verdict was issued!",
                            "author": null,
                            "id": "idkpsah",
                            "parent_id": "t1_idkpmuq",
                            "score": -3,
                            "created_utc": 1656087398.0,
                            "replies": [
                                {
                                    "body": "You know you can edit your post right? You don't have to comment on your own post to add a comment that has nothing to do with our original discussion lol.\n\nBedsides, this isn't the place to discuss the 2nd amendment decision anyway. Unless your carrying a gun to all your sugar dates. :)",
                                    "author": "Significant-Fun-2146",
                                    "id": "idkwcwt",
                                    "parent_id": "t1_idkpsah",
                                    "score": 3,
                                    "created_utc": 1656089834.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I support significant’s commenting and reject you trying to police their input. Shutting people down is toxic for healthy discussion. If you actually believe someone’s missing something, then bring the information to the discussion!",
            "author": "lumpsel",
            "id": "idkrynr",
            "parent_id": "t1_idkngt2",
            "score": 2,
            "created_utc": 1656088205.0,
            "replies": []
        },
        {
            "body": "I sugar because federal & state taxes kill my pay. \n\nI dreamed & worked hard to make over XXXk just to watch a lot of it ripped away. \n\nCost of living & taxes keeps going up! Nothing is ever enough for the government and ignorant republican-led states who trash blue states yet rely on their tax money. \n\nIf I work to earn more, they’ll take more. What’s the point of working hard & having dreams anymore. \n\nMore babies born to poor mothers means more taxes…because wealthy people don’t pay taxes. They hide $ & professionally avoid taxes. It will be ppl like me trying to get ahead in this world with the government’s foot on our necks.",
            "author": null,
            "id": "idl44z7",
            "parent_id": "t1_idktyhx",
            "score": 5,
            "created_utc": 1656092785.0,
            "replies": [
                {
                    "body": "Any women trying to locate protests in your city check here!:\n\nhttps://www.womensmarch.com/",
                    "author": null,
                    "id": "idlmpmc",
                    "parent_id": "t1_idl44z7",
                    "score": 3,
                    "created_utc": 1656100137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, that's not allowed under the deal, it's personal responsibility all the way. No handouts, no freeloading, no subsidies.",
            "author": "whatever-tata",
            "id": "idkv04f",
            "parent_id": "t1_idktyhx",
            "score": 3,
            "created_utc": 1656089330.0,
            "replies": []
        },
        {
            "body": "Everyone knows that. My post is obviously not a serious nor realistic possibility, it's just crazy that in 2022 you still have 50% of your country voting for these red state ideals, like this ruling.",
            "author": "whatever-tata",
            "id": "idl8h4c",
            "parent_id": "t1_idkz7t3",
            "score": 1,
            "created_utc": 1656094469.0,
            "replies": [
                {
                    "body": "> Everyone knows that.\n\nBelieve it or not - that's untrue.  Especially people outside of the US.  They don't realize how divided it is.",
                    "author": "SDstartingOut",
                    "id": "idlbsfb",
                    "parent_id": "t1_idl8h4c",
                    "score": 2,
                    "created_utc": 1656095781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just a case of perspective then.",
            "author": "Rylakb",
            "id": "idlrooz",
            "parent_id": "t1_idll5sn",
            "score": -2,
            "created_utc": 1656102135.0,
            "replies": []
        },
        {
            "body": "So… if you sugar date in any of…\n\nDallas, Houston, Miami, Atlanta, Phoenix, Detroit, Minneapolis, Tampa, St. Louis, Charlotte, Orlando, San Antonio, Cincinnati, Austin, Kansas City, Columbus, Indianapolis, Cleveland, Nashville, Jacksonville, Milwaukee, Oklahoma City, Memphis, Louisville, Salt Lake City, New Orleans, Birmingham, Grand Rapids, Tucson, Tulsa, Omaha, Greenville, Knoxville, McAllen, Baton Rouge, El Paso, Sarasota, Columbia, Dayton, Boise…\n\nyou might want to keep emergency funds on hand if you find you unexpectedly have a certain need to travel to a 21st century state that supports women’s reproductive rights.",
            "author": "ExpertPerformance",
            "id": "idkyjbu",
            "parent_id": "t1_idko96c",
            "score": 9,
            "created_utc": 1656090650.0,
            "replies": []
        },
        {
            "body": "Does anyone really believe in a \"person's right to decide what to do with their body\"? Universal restrictions on drug use and prostitution seem to indicate not really...",
            "author": "huizeng",
            "id": "idkt01l",
            "parent_id": "t1_idkmuxn",
            "score": 1,
            "created_utc": 1656088588.0,
            "replies": []
        },
        {
            "body": "So vote!  I hold my state politicians accountable.  Hold your states politicians equally accountable.",
            "author": null,
            "id": "idknp0k",
            "parent_id": "t1_idkl76c",
            "score": -5,
            "created_utc": 1656086609.0,
            "replies": [
                {
                    "body": "I do vote, so thank you for that. I’m also not talking about where I live. I’m certain there are people like me that live in said states that also vote, but these people get voted in by other nut cases who also don’t care about women’s rights. Can’t hold said politicians accountable if they’re already in office and getting re-elected by the same majority.",
                    "author": "zara_io",
                    "id": "idkuiyu",
                    "parent_id": "t1_idknp0k",
                    "score": 5,
                    "created_utc": 1656089153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The difference is that when it's left up to elected officials the people get a say based on who they vote for as opposed to the federal government simply legislating from the bench, something they are not supposed to do. \n\nThose states have those laws on the books because that is what the majority of people in those states want.",
            "author": "RTManson",
            "id": "idls4qx",
            "parent_id": "t1_idkzclg",
            "score": 3,
            "created_utc": 1656102314.0,
            "replies": [
                {
                    "body": "Tell me more about your fantasy that the political system of a state like Georgia is based on \"what the majority of people \\[or majority of eligible voters\\] want\".",
                    "author": "highfructoseSD",
                    "id": "idmpn7d",
                    "parent_id": "t1_idls4qx",
                    "score": 2,
                    "created_utc": 1656117185.0,
                    "replies": []
                },
                {
                    "body": "100% factually incorrect.\n\nI live in Georgia.  Georgia has a law on the books, effectively outlawing abortion.\n\nYet - most people in Georgia do NOT support over turning Roe v. Wade.\n\n> Most Georgians oppose overturning Roe v. Wade but are more open to placing some restrictions on abortion, according to recent polling",
                    "author": "SDstartingOut",
                    "id": "idlydpj",
                    "parent_id": "t1_idls4qx",
                    "score": 1,
                    "created_utc": 1656104869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i don't assume everyone knows this. i've heard a lot of talk about this decision since the leak a while back. a lot of people do not know what this means. maybe the people in this sub are more informed than average though",
            "author": "davitech73",
            "id": "idkwd3d",
            "parent_id": "t1_idkukim",
            "score": -3,
            "created_utc": 1656089836.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idks8tm",
            "parent_id": "t1_idkrl2i",
            "score": 1,
            "created_utc": 1656088310.0,
            "replies": []
        },
        {
            "body": "How's this discussion going to help anything?",
            "author": "gaxxzz",
            "id": "idkw5wr",
            "parent_id": "t1_idkrjxv",
            "score": -9,
            "created_utc": 1656089762.0,
            "replies": [
                {
                    "body": "Move the goalpost. \n\nYou act like relationships that involve sex aren't going to be affected. \n\nStop posting if you honestly don't see how the two are related.",
                    "author": "2catsandacomputer",
                    "id": "idmfx8a",
                    "parent_id": "t1_idkw5wr",
                    "score": 2,
                    "created_utc": 1656112542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As someone who came from Middle East, please keep your filth with yourself. We have enough crazy of our own.",
            "author": null,
            "id": "idkmj2k",
            "parent_id": "t1_idkkaft",
            "score": 0,
            "created_utc": 1656086174.0,
            "replies": [
                {
                    "body": "Hahaha - not wanting to send more to you over there - maybe collectively we can buy a big island for them all to live on.",
                    "author": "thereadinessisall",
                    "id": "idkmw39",
                    "parent_id": "t1_idkmj2k",
                    "score": 4,
                    "created_utc": 1656086309.0,
                    "replies": [
                        {
                            "body": "Epstein Island??",
                            "author": null,
                            "id": "idknass",
                            "parent_id": "t1_idkmw39",
                            "score": 2,
                            "created_utc": 1656086461.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkma08",
            "parent_id": "t1_idkkaft",
            "score": -5,
            "created_utc": 1656086079.0,
            "replies": [
                {
                    "body": "Will of some people - trump LOST the popular vote —— TWICE.",
                    "author": "thereadinessisall",
                    "id": "idkmnbu",
                    "parent_id": "t1_idkma08",
                    "score": 6,
                    "created_utc": 1656086218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idklwfj",
            "parent_id": "t1_idkkjdj",
            "score": -3,
            "created_utc": 1656085937.0,
            "replies": [
                {
                    "body": "Reported.",
                    "author": "MrBuzzard",
                    "id": "idkmt1t",
                    "parent_id": "t1_idklwfj",
                    "score": 2,
                    "created_utc": 1656086278.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "idko4y0",
                            "parent_id": "t1_idkmt1t",
                            "score": 0,
                            "created_utc": 1656086778.0,
                            "replies": [
                                {
                                    "body": "Reported again.  This is a sex positive sub.  Not a place for knuckle dragging, busybodies like you thinking they have a right to tell others how to live their life.",
                                    "author": "MrBuzzard",
                                    "id": "idkyg8k",
                                    "parent_id": "t1_idko4y0",
                                    "score": 2,
                                    "created_utc": 1656090617.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This guy showed up in SLF specifically to argue about abortion. He's a troll, so don't waste too much time with it.",
            "author": "Y_4Z44",
            "id": "idklq11",
            "parent_id": "t1_idkjucm",
            "score": 7,
            "created_utc": 1656085870.0,
            "replies": [
                {
                    "body": "Ya, just figured that out.  Won’t be feeding this particular troll any longer.",
                    "author": "MrBuzzard",
                    "id": "idkmaqm",
                    "parent_id": "t1_idklq11",
                    "score": 3,
                    "created_utc": 1656086087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idklcxl",
            "parent_id": "t1_idkknv8",
            "score": -9,
            "created_utc": 1656085731.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkoaib",
                    "parent_id": "t1_idklcxl",
                    "score": 2,
                    "created_utc": 1656086837.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkpg4l",
                            "parent_id": "t1_idkoaib",
                            "score": -2,
                            "created_utc": 1656087271.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Let's see how happy you are when your taxes are raised to provide financial assistance for those families or when one of your SBs get pregnant and can't terminate her pregnancy.\n\nI am okay with both of these things. I support the nordic style social safety nets.",
            "author": "CanOfWoody",
            "id": "idkt605",
            "parent_id": "t1_idksq2a",
            "score": -6,
            "created_utc": 1656088650.0,
            "replies": []
        },
        {
            "body": "Another one of those accounts who's never posted in here before showing up to voice his opinion. How quaint.",
            "author": "Y_4Z44",
            "id": "idksh1w",
            "parent_id": "t1_idkpyfs",
            "score": 6,
            "created_utc": 1656088395.0,
            "replies": [
                {
                    "body": "Jesus loves you ❤️",
                    "author": "crackedpacks4life",
                    "id": "idkw9h2",
                    "parent_id": "t1_idksh1w",
                    "score": -3,
                    "created_utc": 1656089799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the information. I don’t need an abortion but people like you willing to help are appreciated.",
            "author": null,
            "id": "idmo7rw",
            "parent_id": "t1_idmmo8t",
            "score": 5,
            "created_utc": 1656116486.0,
            "replies": [
                {
                    "body": "Advice on DIY abortion techniques:\n\nhttps://archive.org/details/FTVDIYA",
                    "author": "aajniojnoihnoi",
                    "id": "idmoqk7",
                    "parent_id": "t1_idmo7rw",
                    "score": 4,
                    "created_utc": 1656116740.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel the same on wanting to leave the US now. Gonna go outside & do something to stop thinking about this. \n\nI have to get long term birth control now & deal with the side effects on my body. I’m scared & angry for women…but it’s nice outside & I’ll find a protest to attend in the future. \n\nHugs",
            "author": null,
            "id": "idl98z1",
            "parent_id": "t1_idl461i",
            "score": 6,
            "created_utc": 1656094776.0,
            "replies": [
                {
                    "body": "A female condom is an option too, if you want minimal side effects! \n\nEnjoy your day outside 🙂",
                    "author": "Sweetcheeks864",
                    "id": "idlgiau",
                    "parent_id": "t1_idl98z1",
                    "score": 2,
                    "created_utc": 1656097647.0,
                    "replies": [
                        {
                            "body": "Thanks. There’s protests happening this weekend & things. I still don’t feel a lot better about this. Going to 1 now. Here’s a link of protests all over if interested: https://www.womensmarch.com/",
                            "author": null,
                            "id": "idlsrrp",
                            "parent_id": "t1_idlgiau",
                            "score": 4,
                            "created_utc": 1656102574.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ijs, in the Handmaid's Tale Ofglen leads a woman to her death for being a bitch to her fellow woman. \n\nI'm tired of the \"take the high road\" politics. We've been doing that since the 90s and now we're here, at overturning something that is literally deletes autonomy. Saying \"states rights\" is being ignorant, we fought a fucking civil war over this ffs 🙄 Democrats have been playing fair, it isn't working. \n\nGloves fucking off or get ye behind me. Losing your rights isn't a \"turn the other cheek\" moment. It isn't a \"forgive thy neighbor\" moment. Go with grace in everywhere else in life, but not this fight and not right now.",
            "author": "2catsandacomputer",
            "id": "idmgtne",
            "parent_id": "t1_idlb417",
            "score": 4,
            "created_utc": 1656112957.0,
            "replies": []
        },
        {
            "body": "And failing to fight evil with evil is a prescription for losing when you walk through the shadow of the valley of death. \n\nI can be my best self when not staring down the barrel of a 6-3 revanchist SCOTUS. Until then, all bets are off.",
            "author": "throwawayaccount0327",
            "id": "idlbt7k",
            "parent_id": "t1_idlb417",
            "score": 1,
            "created_utc": 1656095790.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkvmtx",
            "parent_id": "t1_idkupkk",
            "score": 2,
            "created_utc": 1656089566.0,
            "replies": [
                {
                    "body": "Clinics are going up in women-friendly states to meet the demand. The abortion underground will not likely set up brick and mortar clinics. If you haven't seen \"The Janes,\" I recommend it. Yes, they were active pre-Roe, but it will happen again. Only this time, funding and support from places like NAF exists.",
                    "author": "LadyMorgan2018",
                    "id": "idkw9yt",
                    "parent_id": "t1_idkvmtx",
                    "score": 5,
                    "created_utc": 1656089804.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "idkx3lf",
                            "parent_id": "t1_idkw9yt",
                            "score": 1,
                            "created_utc": 1656090107.0,
                            "replies": [
                                {
                                    "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
                                    "author": "LadyMorgan2018",
                                    "id": "idkydtb",
                                    "parent_id": "t1_idkx3lf",
                                    "score": 3,
                                    "created_utc": 1656090592.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkvvuo",
            "parent_id": "t1_idkvdy0",
            "score": 1,
            "created_utc": 1656089660.0,
            "replies": [
                {
                    "body": "I will take this from my personal history with ACT UP in the 90s...\n\nACT UP! FIGHT BACK! ✊️",
                    "author": "LadyMorgan2018",
                    "id": "idkwi1b",
                    "parent_id": "t1_idkvvuo",
                    "score": 4,
                    "created_utc": 1656089887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They ignored everything about him.\n\nThe affairs with porn stars, “grab her by the pussy”, lies he told easily disproven with facts, how he scammed many people out of money with Trump University, etc….he & his family were even convicted of misusing charity funds & banned from operating charities in New York. \n\nNot to mention him collecting millions of donations from his supporters to fund his meritless reelection claims that failed in every single court case (67 total I’ve read).\n\nHe is a danger because the evangelicals, right wing Christian, republicans, & moderate to extreme racists see a champion of their desires in him.\n\nRecently I’ve been going to the gun range…call me crazy but I FEEL for the 1st time in my life the need to get armed!",
            "author": null,
            "id": "idl0np0",
            "parent_id": "t1_idkyrio",
            "score": 9,
            "created_utc": 1656091453.0,
            "replies": []
        },
        {
            "body": "Word",
            "author": "UnearthlyDinosaur",
            "id": "idkz5ge",
            "parent_id": "t1_idkyrio",
            "score": 4,
            "created_utc": 1656090887.0,
            "replies": []
        },
        {
            "body": "Clarence Thomas didn't mention interracial marriage though, which stems from the same set of due process rights he targeted, because he's married to a white woman. Republicans always draw the line at things that personally affect them when they're fucking the rest of us over.",
            "author": "Questiner",
            "id": "idlg2pg",
            "parent_id": "t1_idkxhm8",
            "score": 6,
            "created_utc": 1656097475.0,
            "replies": []
        },
        {
            "body": "Yup gay marriage will be over soon",
            "author": "UnearthlyDinosaur",
            "id": "idl1m4b",
            "parent_id": "t1_idkxhm8",
            "score": 2,
            "created_utc": 1656091818.0,
            "replies": []
        },
        {
            "body": ">  He needs to take the time machine back 15 years to see what was being said about the \"protection of marriage\".\n\nHe's been on the court for 31 years. He was there.",
            "author": "Y_4Z44",
            "id": "idkt61z",
            "parent_id": "t1_idks9jt",
            "score": 1,
            "created_utc": 1656088650.0,
            "replies": []
        },
        {
            "body": "You may be correct, but as I said elsewhere, the rest of the Justices, all of them, have already come out and said they do not support Thomas' assertions. \n\nCould be them just saying what people want to hear right now and things change down the road, but at the moment, that's the facts we have.",
            "author": "mraspencer",
            "id": "idkw2xp",
            "parent_id": "t1_idks9jt",
            "score": -2,
            "created_utc": 1656089732.0,
            "replies": [
                {
                    "body": "The other justices say a lot of things.  Including, for Alito, Kavanaugh and Barrett during their confirmation hearings, that Roe was settled law.  They are lying.  Don't be a child.",
                    "author": "Zubaz_Enthusiast",
                    "id": "idlk0j8",
                    "parent_id": "t1_idkw2xp",
                    "score": 4,
                    "created_utc": 1656099051.0,
                    "replies": [
                        {
                            "body": "Yay more name calling",
                            "author": "mraspencer",
                            "id": "idllnxl",
                            "parent_id": "t1_idlk0j8",
                            "score": -1,
                            "created_utc": 1656099719.0,
                            "replies": [
                                {
                                    "body": "Play stupid games, win stupid prizes.",
                                    "author": "Zubaz_Enthusiast",
                                    "id": "idllsfh",
                                    "parent_id": "t1_idllnxl",
                                    "score": 2,
                                    "created_utc": 1656099769.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He also posited in an earlier thread that the court wouldn't overturn Roe v. Wade, so...this guy isn't exactly the brightest bulb in the box.",
            "author": "Y_4Z44",
            "id": "idks0ts",
            "parent_id": "t1_idkrgqk",
            "score": 5,
            "created_utc": 1656088227.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkspnf",
                    "parent_id": "t1_idks0ts",
                    "score": 2,
                    "created_utc": 1656088481.0,
                    "replies": [
                        {
                            "body": "you are hilarious",
                            "author": "mraspencer",
                            "id": "idkvhdu",
                            "parent_id": "t1_idkspnf",
                            "score": -2,
                            "created_utc": 1656089510.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's ok to be wrong now and then, you should try it once. You might be surprised you have a humble side.\n\nWait...no you don't. Nevermind, continue on the path you're on.",
                    "author": "mraspencer",
                    "id": "idkvm3x",
                    "parent_id": "t1_idks0ts",
                    "score": -1,
                    "created_utc": 1656089559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s troll. Don’t feed em",
            "author": "SatansBirthdayCake",
            "id": "idkrtol",
            "parent_id": "t1_idkrlz9",
            "score": 3,
            "created_utc": 1656088152.0,
            "replies": [
                {
                    "body": "I'm a troll? How?",
                    "author": "Academic_Use_1719",
                    "id": "idl06ld",
                    "parent_id": "t1_idkrtol",
                    "score": -2,
                    "created_utc": 1656091276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are absolutely free to comment. And obviously if you know, supposedly, how the process works - when done properly, then my comment doesnt much apply to needing a response from you.\n\nI have zero interest in curbing/curving/carving others into my beliefs.  But facts are facts.",
            "author": null,
            "id": "idkpmuq",
            "parent_id": "t1_idkozut",
            "score": -7,
            "created_utc": 1656087341.0,
            "replies": [
                {
                    "body": "PS: im sure you had a blast when the 2nd amendment verdict was issued!",
                    "author": null,
                    "id": "idkpsah",
                    "parent_id": "t1_idkpmuq",
                    "score": -3,
                    "created_utc": 1656087398.0,
                    "replies": [
                        {
                            "body": "You know you can edit your post right? You don't have to comment on your own post to add a comment that has nothing to do with our original discussion lol.\n\nBedsides, this isn't the place to discuss the 2nd amendment decision anyway. Unless your carrying a gun to all your sugar dates. :)",
                            "author": "Significant-Fun-2146",
                            "id": "idkwcwt",
                            "parent_id": "t1_idkpsah",
                            "score": 3,
                            "created_utc": 1656089834.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Any women trying to locate protests in your city check here!:\n\nhttps://www.womensmarch.com/",
            "author": null,
            "id": "idlmpmc",
            "parent_id": "t1_idl44z7",
            "score": 3,
            "created_utc": 1656100137.0,
            "replies": []
        },
        {
            "body": "> Everyone knows that.\n\nBelieve it or not - that's untrue.  Especially people outside of the US.  They don't realize how divided it is.",
            "author": "SDstartingOut",
            "id": "idlbsfb",
            "parent_id": "t1_idl8h4c",
            "score": 2,
            "created_utc": 1656095781.0,
            "replies": []
        },
        {
            "body": "I do vote, so thank you for that. I’m also not talking about where I live. I’m certain there are people like me that live in said states that also vote, but these people get voted in by other nut cases who also don’t care about women’s rights. Can’t hold said politicians accountable if they’re already in office and getting re-elected by the same majority.",
            "author": "zara_io",
            "id": "idkuiyu",
            "parent_id": "t1_idknp0k",
            "score": 5,
            "created_utc": 1656089153.0,
            "replies": []
        },
        {
            "body": "Tell me more about your fantasy that the political system of a state like Georgia is based on \"what the majority of people \\[or majority of eligible voters\\] want\".",
            "author": "highfructoseSD",
            "id": "idmpn7d",
            "parent_id": "t1_idls4qx",
            "score": 2,
            "created_utc": 1656117185.0,
            "replies": []
        },
        {
            "body": "100% factually incorrect.\n\nI live in Georgia.  Georgia has a law on the books, effectively outlawing abortion.\n\nYet - most people in Georgia do NOT support over turning Roe v. Wade.\n\n> Most Georgians oppose overturning Roe v. Wade but are more open to placing some restrictions on abortion, according to recent polling",
            "author": "SDstartingOut",
            "id": "idlydpj",
            "parent_id": "t1_idls4qx",
            "score": 1,
            "created_utc": 1656104869.0,
            "replies": []
        },
        {
            "body": "Move the goalpost. \n\nYou act like relationships that involve sex aren't going to be affected. \n\nStop posting if you honestly don't see how the two are related.",
            "author": "2catsandacomputer",
            "id": "idmfx8a",
            "parent_id": "t1_idkw5wr",
            "score": 2,
            "created_utc": 1656112542.0,
            "replies": []
        },
        {
            "body": "Hahaha - not wanting to send more to you over there - maybe collectively we can buy a big island for them all to live on.",
            "author": "thereadinessisall",
            "id": "idkmw39",
            "parent_id": "t1_idkmj2k",
            "score": 4,
            "created_utc": 1656086309.0,
            "replies": [
                {
                    "body": "Epstein Island??",
                    "author": null,
                    "id": "idknass",
                    "parent_id": "t1_idkmw39",
                    "score": 2,
                    "created_utc": 1656086461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Will of some people - trump LOST the popular vote —— TWICE.",
            "author": "thereadinessisall",
            "id": "idkmnbu",
            "parent_id": "t1_idkma08",
            "score": 6,
            "created_utc": 1656086218.0,
            "replies": []
        },
        {
            "body": "Reported.",
            "author": "MrBuzzard",
            "id": "idkmt1t",
            "parent_id": "t1_idklwfj",
            "score": 2,
            "created_utc": 1656086278.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "idko4y0",
                    "parent_id": "t1_idkmt1t",
                    "score": 0,
                    "created_utc": 1656086778.0,
                    "replies": [
                        {
                            "body": "Reported again.  This is a sex positive sub.  Not a place for knuckle dragging, busybodies like you thinking they have a right to tell others how to live their life.",
                            "author": "MrBuzzard",
                            "id": "idkyg8k",
                            "parent_id": "t1_idko4y0",
                            "score": 2,
                            "created_utc": 1656090617.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ya, just figured that out.  Won’t be feeding this particular troll any longer.",
            "author": "MrBuzzard",
            "id": "idkmaqm",
            "parent_id": "t1_idklq11",
            "score": 3,
            "created_utc": 1656086087.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkoaib",
            "parent_id": "t1_idklcxl",
            "score": 2,
            "created_utc": 1656086837.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkpg4l",
                    "parent_id": "t1_idkoaib",
                    "score": -2,
                    "created_utc": 1656087271.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Jesus loves you ❤️",
            "author": "crackedpacks4life",
            "id": "idkw9h2",
            "parent_id": "t1_idksh1w",
            "score": -3,
            "created_utc": 1656089799.0,
            "replies": []
        },
        {
            "body": "Advice on DIY abortion techniques:\n\nhttps://archive.org/details/FTVDIYA",
            "author": "aajniojnoihnoi",
            "id": "idmoqk7",
            "parent_id": "t1_idmo7rw",
            "score": 4,
            "created_utc": 1656116740.0,
            "replies": []
        },
        {
            "body": "A female condom is an option too, if you want minimal side effects! \n\nEnjoy your day outside 🙂",
            "author": "Sweetcheeks864",
            "id": "idlgiau",
            "parent_id": "t1_idl98z1",
            "score": 2,
            "created_utc": 1656097647.0,
            "replies": [
                {
                    "body": "Thanks. There’s protests happening this weekend & things. I still don’t feel a lot better about this. Going to 1 now. Here’s a link of protests all over if interested: https://www.womensmarch.com/",
                    "author": null,
                    "id": "idlsrrp",
                    "parent_id": "t1_idlgiau",
                    "score": 4,
                    "created_utc": 1656102574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Clinics are going up in women-friendly states to meet the demand. The abortion underground will not likely set up brick and mortar clinics. If you haven't seen \"The Janes,\" I recommend it. Yes, they were active pre-Roe, but it will happen again. Only this time, funding and support from places like NAF exists.",
            "author": "LadyMorgan2018",
            "id": "idkw9yt",
            "parent_id": "t1_idkvmtx",
            "score": 5,
            "created_utc": 1656089804.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "idkx3lf",
                    "parent_id": "t1_idkw9yt",
                    "score": 1,
                    "created_utc": 1656090107.0,
                    "replies": [
                        {
                            "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
                            "author": "LadyMorgan2018",
                            "id": "idkydtb",
                            "parent_id": "t1_idkx3lf",
                            "score": 3,
                            "created_utc": 1656090592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will take this from my personal history with ACT UP in the 90s...\n\nACT UP! FIGHT BACK! ✊️",
            "author": "LadyMorgan2018",
            "id": "idkwi1b",
            "parent_id": "t1_idkvvuo",
            "score": 4,
            "created_utc": 1656089887.0,
            "replies": []
        },
        {
            "body": "The other justices say a lot of things.  Including, for Alito, Kavanaugh and Barrett during their confirmation hearings, that Roe was settled law.  They are lying.  Don't be a child.",
            "author": "Zubaz_Enthusiast",
            "id": "idlk0j8",
            "parent_id": "t1_idkw2xp",
            "score": 4,
            "created_utc": 1656099051.0,
            "replies": [
                {
                    "body": "Yay more name calling",
                    "author": "mraspencer",
                    "id": "idllnxl",
                    "parent_id": "t1_idlk0j8",
                    "score": -1,
                    "created_utc": 1656099719.0,
                    "replies": [
                        {
                            "body": "Play stupid games, win stupid prizes.",
                            "author": "Zubaz_Enthusiast",
                            "id": "idllsfh",
                            "parent_id": "t1_idllnxl",
                            "score": 2,
                            "created_utc": 1656099769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkspnf",
            "parent_id": "t1_idks0ts",
            "score": 2,
            "created_utc": 1656088481.0,
            "replies": [
                {
                    "body": "you are hilarious",
                    "author": "mraspencer",
                    "id": "idkvhdu",
                    "parent_id": "t1_idkspnf",
                    "score": -2,
                    "created_utc": 1656089510.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's ok to be wrong now and then, you should try it once. You might be surprised you have a humble side.\n\nWait...no you don't. Nevermind, continue on the path you're on.",
            "author": "mraspencer",
            "id": "idkvm3x",
            "parent_id": "t1_idks0ts",
            "score": -1,
            "created_utc": 1656089559.0,
            "replies": []
        },
        {
            "body": "I'm a troll? How?",
            "author": "Academic_Use_1719",
            "id": "idl06ld",
            "parent_id": "t1_idkrtol",
            "score": -2,
            "created_utc": 1656091276.0,
            "replies": []
        },
        {
            "body": "PS: im sure you had a blast when the 2nd amendment verdict was issued!",
            "author": null,
            "id": "idkpsah",
            "parent_id": "t1_idkpmuq",
            "score": -3,
            "created_utc": 1656087398.0,
            "replies": [
                {
                    "body": "You know you can edit your post right? You don't have to comment on your own post to add a comment that has nothing to do with our original discussion lol.\n\nBedsides, this isn't the place to discuss the 2nd amendment decision anyway. Unless your carrying a gun to all your sugar dates. :)",
                    "author": "Significant-Fun-2146",
                    "id": "idkwcwt",
                    "parent_id": "t1_idkpsah",
                    "score": 3,
                    "created_utc": 1656089834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Epstein Island??",
            "author": null,
            "id": "idknass",
            "parent_id": "t1_idkmw39",
            "score": 2,
            "created_utc": 1656086461.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "idko4y0",
            "parent_id": "t1_idkmt1t",
            "score": 0,
            "created_utc": 1656086778.0,
            "replies": [
                {
                    "body": "Reported again.  This is a sex positive sub.  Not a place for knuckle dragging, busybodies like you thinking they have a right to tell others how to live their life.",
                    "author": "MrBuzzard",
                    "id": "idkyg8k",
                    "parent_id": "t1_idko4y0",
                    "score": 2,
                    "created_utc": 1656090617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkpg4l",
            "parent_id": "t1_idkoaib",
            "score": -2,
            "created_utc": 1656087271.0,
            "replies": []
        },
        {
            "body": "Thanks. There’s protests happening this weekend & things. I still don’t feel a lot better about this. Going to 1 now. Here’s a link of protests all over if interested: https://www.womensmarch.com/",
            "author": null,
            "id": "idlsrrp",
            "parent_id": "t1_idlgiau",
            "score": 4,
            "created_utc": 1656102574.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "idkx3lf",
            "parent_id": "t1_idkw9yt",
            "score": 1,
            "created_utc": 1656090107.0,
            "replies": [
                {
                    "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
                    "author": "LadyMorgan2018",
                    "id": "idkydtb",
                    "parent_id": "t1_idkx3lf",
                    "score": 3,
                    "created_utc": 1656090592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yay more name calling",
            "author": "mraspencer",
            "id": "idllnxl",
            "parent_id": "t1_idlk0j8",
            "score": -1,
            "created_utc": 1656099719.0,
            "replies": [
                {
                    "body": "Play stupid games, win stupid prizes.",
                    "author": "Zubaz_Enthusiast",
                    "id": "idllsfh",
                    "parent_id": "t1_idllnxl",
                    "score": 2,
                    "created_utc": 1656099769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you are hilarious",
            "author": "mraspencer",
            "id": "idkvhdu",
            "parent_id": "t1_idkspnf",
            "score": -2,
            "created_utc": 1656089510.0,
            "replies": []
        },
        {
            "body": "You know you can edit your post right? You don't have to comment on your own post to add a comment that has nothing to do with our original discussion lol.\n\nBedsides, this isn't the place to discuss the 2nd amendment decision anyway. Unless your carrying a gun to all your sugar dates. :)",
            "author": "Significant-Fun-2146",
            "id": "idkwcwt",
            "parent_id": "t1_idkpsah",
            "score": 3,
            "created_utc": 1656089834.0,
            "replies": []
        },
        {
            "body": "Reported again.  This is a sex positive sub.  Not a place for knuckle dragging, busybodies like you thinking they have a right to tell others how to live their life.",
            "author": "MrBuzzard",
            "id": "idkyg8k",
            "parent_id": "t1_idko4y0",
            "score": 2,
            "created_utc": 1656090617.0,
            "replies": []
        },
        {
            "body": "Yes. I work in reproductive Healthcare and am an activist. The \" work arounds\" are already being done including underground travelling providers. I don't know how necessary it is to have providers throw themselves in the grenade.",
            "author": "LadyMorgan2018",
            "id": "idkydtb",
            "parent_id": "t1_idkx3lf",
            "score": 3,
            "created_utc": 1656090592.0,
            "replies": []
        },
        {
            "body": "Play stupid games, win stupid prizes.",
            "author": "Zubaz_Enthusiast",
            "id": "idllsfh",
            "parent_id": "t1_idllnxl",
            "score": 2,
            "created_utc": 1656099769.0,
            "replies": []
        }
    ]
}