{
    "title": "A lengthy appreciation post for Running Man",
    "post_id": "mgwmme",
    "post_url": "https://www.reddit.com/r/runningman/comments/mgwmme/a_lengthy_appreciation_post_for_running_man/",
    "author": "saseanne",
    "body": "(This is my 4th draft now lol. I don't know why but I can't seem to articulate properly how much I appreciate this show, hopefully this one's my final draft.)\n\nI've been a fan of the show since 2012 when I was in fifth grade and now I am about to finish my first year in college, to be honest I hadn't realized how long I've been a fan until I watched the fan meet episodes.\n\nI still remember how *iconic* the early episodes of Running Man were (specifically, those from 2010-13). JSJ's \"*I swear*\", the nametag eliminations, Yoomes Bond, Running Man and Grasshopper Hunting, Running Man Olympics, the spy missions, their overseas trips, crossing the Han River and so many more.\n\nAt the same time, I also remember the show seemingly running out of steam from 2014 until So Min and Se Chan were added to the show. As someone who's been a fan for so long, the episodes after Gary left and before SM + SC were added were so sad to watch. Those episodes were, in my opinion, the \"low point\" for the show, especially since the show almost got cancelled during that span. By this time, I would watch the show sparingly.\n\nSo Min and Se Chan were such great additions to the show, they literally gave it new life. By 2019, I began to watch the show much more regularly than I did before (especially during the preparation for the Fan Meet episodes), Though the show has improved significantly by this time, I still longed for a \"return\" to the old Running Man. More nametag eliminations, more dramatic final races, etc.\n\nBut with the run that Running Man has been going on since 2018 has being so great, I don't wish for a return to the old episodes anymore. First, obviously the members have been getting older, but second, and much more importantly, their current set-up fits the members so well. Honestly, and I know many would disagree, the stretch of episodes that Running Man has been going on are as good as the ones from 2010-13.\n\nThough they may not be as intense/exciting as the one's from Running Man's early days, they have been the **funniest**. Kwang Soo singing *The Lion Sleeps Tonight* and the mission where Jong Kook and Kwang Soo had to not laugh will never fail to make me laugh.\n\nIn the end, I'm so happy that the members decided to continue the show even though it was so difficult for them to do so back then. I'm so proud and thankful of them for working so hard to make us all laugh for 1.5 hours straight every week. I honestly hope that the show will go until they reach 1000 episodes (okay I'm half kidding here – then again, I do wanna see them do the fan meet dance when JSJ is in his 60s lol).",
    "url": "https://www.reddit.com/r/runningman/comments/mgwmme/a_lengthy_appreciation_post_for_running_man/",
    "score": 217,
    "upvote_ratio": 0.97,
    "created_utc": 1617159505.0,
    "num_comments": 28,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I remember I started watching Running Man in 2011 after graduating high school. I'm almost 30 now and RM is still a part of my weekly routine. \n\nI'm dreading the day this show ends. I probably won't get over it for a very long time.",
            "author": "kbx24",
            "id": "gsvp928",
            "parent_id": "t3_mgwmme",
            "score": 80,
            "created_utc": 1617163600.0,
            "replies": [
                {
                    "body": "This.\n\nOne of the greatest fears people have is losing someone or something.\nAnd it's even worse when it's an eventuality.\n\nI look forward to watching variety shows on the weekends. \nBut a Sunday will come without new episode and that is just heartbreaking.",
                    "author": "Ankur0612",
                    "id": "gsvt0te",
                    "parent_id": "t1_gsvp928",
                    "score": 28,
                    "created_utc": 1617166239.0,
                    "replies": [
                        {
                            "body": "Me too. I get that feeling really bad when other shows / books end and I have a feeling it's going to hit hard when Running Man ends. This show has been a part of my life for so long and has so much meaning to me, it just wont be the same without it.",
                            "author": "korweeaboo",
                            "id": "gsw1wn0",
                            "parent_id": "t1_gsvt0te",
                            "score": 8,
                            "created_utc": 1617172902.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Same. I felt so lost when Family Outing ended and just wanted to watch more. When I heard about Running Man, I’ve been watching since the first episode and through their hardest times when Gary left and when the show almost got cancelled. I’m almost 34 and I can’t believe I’ve been watching this variety show with Jaesuk (FO+RM) almost every week (whenever they have a new episode). I will take it very hard when this show ends.",
                    "author": "nessab000",
                    "id": "gsznf3h",
                    "parent_id": "t1_gsvp928",
                    "score": 3,
                    "created_utc": 1617246335.0,
                    "replies": []
                },
                {
                    "body": "Running Man has became an important part of our lives, as we've grown together with the show and the members. But like any other shows, it's not forever. \n\nThe members has been running every week for more than ten years already. All of them are already hitting their primes, which is not forever. Eventually, they'll either leave the show one by one, or as a whole.\n\nOnce that happen, one thing I hope that the SBS should do is to not abandon the Running Man concept entirely. Which is what they're trying to do by exporting the franchise to other countries, especially in China and the South East Asia. \n\nBut for the Korean Running Man, although for some it's unpopular, I would welcome the idea that they would either add new members that'll gradually take over once that unevitable end would come. But they don't have to do it now, but at some point in the future they should consider that too.\n\nRunning Man is not just a variety show. It is a culture. And that culture is meant to be enjoyed by the next generation too.\n\nLOL! It looks like I've gone too far... HAHAHAHA",
                    "author": "Sw4nSea",
                    "id": "gt007sk",
                    "parent_id": "t1_gsvp928",
                    "score": 2,
                    "created_utc": 1617254850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same here. Started watching Running Man in 2015. I watched it because of SNSD, I became curious and watched the other earlier episodes and got hooked since then.\n\nI do agree that the show hit a low point in 2016, when Gary left the show. But I've got to mention also that the episodes got a little bit bland when Taek PD left the show months prior. \n\nI also do agree that the 2010 - 2013 is the Golden Age of Running Man. Every episode is intense, and it still gives me chills everytime I rewatch them. \n\nDecember 2016, it became apparent that the show will end due to the dispute between the members and the staffs. I stopped watching the show at that point since it became boring. But I've got to admit that there's still a couple of good episodes at that time, but the member's week still breaks my heart.\n\nAt first, I'm a little bit skeptical with the addition of Sechan and Somin. But when I watched that, guess what, SNSD episode, I've became hooked again. It doesn't have the same intensity as the Early 2010s episode, but it still gives you that chills.\n\n2018 - present is like the 2nd Golden Age of Running Man. I'm disappointed at first about the change in format as it became more of a talk show than an actual variety show. But I realized that the members are getting older, and having the same format as before will do more harm than good.\n\nRunning Man get me through my low times. I've watched it when my grades are falling apart, when I'm having family and relationship problems and when I'm going through anxiety and depression. I felt like I am a part of their cast when I am watching them, and it's like a kind of escape or relief for me. \n\nI'll always be thankful to the show, and to the fan community also. Fellow Runners also help me get through the hard times and I've found a lot of friends in the community too.\n\nI'll be always thankful and grateful for Running Man!!!",
            "author": "Sw4nSea",
            "id": "gsvrbre",
            "parent_id": "t3_mgwmme",
            "score": 27,
            "created_utc": 1617164991.0,
            "replies": [
                {
                    "body": "Thanks to Running Man i was introduced to SNSD and now they are my all time favorite group. Me and my sister started watching Running Man in 2017 and the episodes were so fun to watch and we just continued watching their episodes and then we finally watched watched SNSD episode and they were so amazing. We have rewatched all their episodes too many times and running man also introduced us to so many other stars as well.",
                    "author": "annikavinod",
                    "id": "gsvtfqc",
                    "parent_id": "t1_gsvrbre",
                    "score": 6,
                    "created_utc": 1617166554.0,
                    "replies": [
                        {
                            "body": "Running Man 363 is also my all-time favorite episode!!!",
                            "author": "Sw4nSea",
                            "id": "gsvxw8x",
                            "parent_id": "t1_gsvtfqc",
                            "score": 1,
                            "created_utc": 1617170137.0,
                            "replies": [
                                {
                                    "body": "Ya I love that episode  but I love 63 and 64 the best. Even 253, the 2015 one was amazing.",
                                    "author": "annikavinod",
                                    "id": "gsw02f9",
                                    "parent_id": "t1_gsvxw8x",
                                    "score": 3,
                                    "created_utc": 1617171624.0,
                                    "replies": [
                                        {
                                            "body": "Same here. I think the episode where they have picnic together is the best episode with SNSD. The warm feeling seeing how yoona always teases yuri dan kwangsoo.",
                                            "author": "abgbob",
                                            "id": "gsw5y1a",
                                            "parent_id": "t1_gsw02f9",
                                            "score": 3,
                                            "created_utc": 1617176108.0,
                                            "replies": [
                                                {
                                                    "body": "Ya and Jessica's STRESSSS.",
                                                    "author": "annikavinod",
                                                    "id": "gsw7kgx",
                                                    "parent_id": "t1_gsw5y1a",
                                                    "score": 1,
                                                    "created_utc": 1617177728.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yo! Same, I started watching this show because of SNSD.  Ended up loving the show/members.  New and old memebers are forever in my heart for all the laughs they bring into this world",
                    "author": "KennyHuynhlalalala",
                    "id": "gsxdixv",
                    "parent_id": "t1_gsvrbre",
                    "score": 2,
                    "created_utc": 1617206175.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This show is part of me. It makes me feel like I am their friends like knowing them personally for the last 10 years. I still cant get over Gary, how come I can easily move on over them when the show is finished.",
            "author": "shazzchili",
            "id": "gsvx0e5",
            "parent_id": "t3_mgwmme",
            "score": 8,
            "created_utc": 1617169396.0,
            "replies": []
        },
        {
            "body": "Wow. I thought I was the only one who's thinking like this. I agree to everything that you had pointed. I still believe RM's golden era is from 2010-2013; everything went well from ratings to ep mechanics. It was hard to watch RM without Gary and it was even evident to the other casts, those times were the lowest point of the show. I usually rewatch every ep atleast 3 times but I can't bear to watch the Gary's last episode and after those. Especially the member's week, it was torturing me, I only enjoyed Sukjin's week ep. \n\nWas quite not sure about Somin and Sechan at first but it was really a very good decision to add them on the cast, it gave RM a new life. I want to think that we are getting RM's 2nd peak after 2010-2013 era. I really love almost all of Bo Pil's episode, the games are unique but really funny. I'm not quite a fan of Iron Min (this dude gives difficult games) but tried to rewatch his episodes and it was pretty decent but still prefer Bo Pil 😂😂 BUT you can't deny he did saved the show. \n\nSince there are a lot of platforms now to consider, the ratings of the show does not necessarily reflect RM's success now. BUT I hope Bo Pil will manage to bring back an ep that can reach double digit rating, I think it will be a very good compliment for the staffs hard work behind the scenes.",
            "author": "mysssh",
            "id": "gsvnuwq",
            "parent_id": "t3_mgwmme",
            "score": 8,
            "created_utc": 1617162700.0,
            "replies": [
                {
                    "body": "wow if this is not my thoughts!! Iron Min was slightly biased and his games were really confusing as hell haha but Bo Pil PD usually keeps things natural and does his own way. he's not too strict and his chemistry with the cast is crazy. i was also in an RM slump by the start of 2017 cause everything was just so boring and i couldn't stand seeing only 6 members while they tried their best to act like Gary's absence had no effect. from 2018- was like a new show to me! i loved how i could keep up with it and especially now they're modernizing RM. all the .ZIPs from YJS and LKS's gags in their official youtube channel are my go-to after finishing new eps.",
                    "author": "taylorsanatomy13_",
                    "id": "gt3kmdg",
                    "parent_id": "t1_gsvnuwq",
                    "score": 1,
                    "created_utc": 1617328170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was just rewatching the I swear clip. It never gets old.",
            "author": "HolUp23",
            "id": "gsvx907",
            "parent_id": "t3_mgwmme",
            "score": 3,
            "created_utc": 1617169598.0,
            "replies": [
                {
                    "body": "I seriously have watched this clip so many times I have lost count. haha. :D",
                    "author": "Kbdrama",
                    "id": "gszl1cg",
                    "parent_id": "t1_gsvx907",
                    "score": 2,
                    "created_utc": 1617244957.0,
                    "replies": []
                },
                {
                    "body": "true i wangko hyung's getting funnier now that he's older. specially when he's not in RM and in talk shows like MUD, Hangout w/ Yoo and others.",
                    "author": "taylorsanatomy13_",
                    "id": "gt3k43x",
                    "parent_id": "t1_gsvx907",
                    "score": 2,
                    "created_utc": 1617327874.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope the show will not end before yjs retire 🙏",
            "author": "xmodifier",
            "id": "gsw82x9",
            "parent_id": "t3_mgwmme",
            "score": 3,
            "created_utc": 1617178247.0,
            "replies": []
        },
        {
            "body": "I just started watching them for like 2 months now. I can't lie but damn this show is hilarious! Good thing I've discovered this show. Thank you Youtube.",
            "author": "Arpeggios08",
            "id": "gswrqjk",
            "parent_id": "t3_mgwmme",
            "score": 3,
            "created_utc": 1617195350.0,
            "replies": []
        },
        {
            "body": "I watched some clip with idols on yt before diving into full episodes, best turning point in my life.",
            "author": "noctis781023",
            "id": "gsvtmcp",
            "parent_id": "t3_mgwmme",
            "score": 3,
            "created_utc": 1617166693.0,
            "replies": []
        },
        {
            "body": "Totally agree with you, said it better than most of us could have! RM was the only show that helped me feel anything other than dread during my yearly seasonal depression. \n\nI wish there was a way to let the whole team know how much they mean to all of us.",
            "author": "passionfruitbby",
            "id": "gswwyvy",
            "parent_id": "t3_mgwmme",
            "score": 3,
            "created_utc": 1617198292.0,
            "replies": []
        },
        {
            "body": "i hope RM staff or people connected to the production know how much RM impacts and helps our week. i also stopped watching and even skipped Gary's episodes where it was near his departure. but then, Somin and Sechan's episodes right after they came out, the overseas episode felt like a new start. unlike others who couldn't help imagine RM's future without Gary, i imagined the chemistry between the 9012 cast if he stayed or came back. i can imagine Sechan and Gary's chemistry and skits as well as Somin's craziness and Gary not being able to handle it. i swear i never want to see the day RM ends. they'll probably still run for a looooong time considering all the changes Bo Pil PD is making to make the program better in many ways. i feel proud and happy for the members and the staff to create and revamp RM's concept and highlight the important parts unlike game-centered and physical games. let's run for a long time\\~\\~\\~\\~ 9012",
            "author": "taylorsanatomy13_",
            "id": "gt3jvh6",
            "parent_id": "t3_mgwmme",
            "score": 2,
            "created_utc": 1617327735.0,
            "replies": []
        },
        {
            "body": "i watched running man episode 300 bc of bts but when i watched the whole thing i was laughing out loud bc kwangsoo and jaesuk so i decided to watch it starting from epjsode 1. no regrets. it was around 2017! 😂",
            "author": "AnxiousMonitor",
            "id": "gswvq0p",
            "parent_id": "t3_mgwmme",
            "score": 1,
            "created_utc": 1617197622.0,
            "replies": []
        },
        {
            "body": "When Gary left the show became good to watch again. Lets be honest he stepping down led to the revamp which was needed. That low point is the greatest turnaround any show could have.",
            "author": "klnic3ajer",
            "id": "gsx86fr",
            "parent_id": "t3_mgwmme",
            "score": 1,
            "created_utc": 1617203760.0,
            "replies": []
        },
        {
            "body": "I share your same sentiment.  The amount of time I have put into watching and rewatching episodes has probably been well over 1000+ hours.  And I'm not really rewatching \"the good old days\"  I love new episodes as much as the old ones.  The no sound/laughing series has got to be my all time favorite skits.  No matter where the show goes from now on I am forever a fan of the show and the members.  \n\n&#x200B;\n\nSide note: as the members are getting older and weary, I could see the show getting canceled but on a good note this time.  What I would want to see is the last few episodes of running man to be recruitment episodes where the talent finds talent to continue the show into a \"season 2\".  As Somin and Kwang Soo are running man born comedians, I feel this show can give rise to many different personalities and give others a place to shine.",
            "author": "KennyHuynhlalalala",
            "id": "gsxeqg7",
            "parent_id": "t3_mgwmme",
            "score": 1,
            "created_utc": 1617206720.0,
            "replies": []
        },
        {
            "body": "not being oa but ill probrably cry when running man ends.  im glad i got to know this show when i mostly needed it, like it is my stress reliever now that im in college",
            "author": "BabyJunior5800",
            "id": "gsxv3mo",
            "parent_id": "t3_mgwmme",
            "score": 1,
            "created_utc": 1617214071.0,
            "replies": [
                {
                    "body": "lmao that's not oa. my life would probably be ruined when it ends. it's literally the highlight and 'win' of my week.",
                    "author": "taylorsanatomy13_",
                    "id": "gt3kqaq",
                    "parent_id": "t1_gsxv3mo",
                    "score": 2,
                    "created_utc": 1617328233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This.\n\nOne of the greatest fears people have is losing someone or something.\nAnd it's even worse when it's an eventuality.\n\nI look forward to watching variety shows on the weekends. \nBut a Sunday will come without new episode and that is just heartbreaking.",
            "author": "Ankur0612",
            "id": "gsvt0te",
            "parent_id": "t1_gsvp928",
            "score": 28,
            "created_utc": 1617166239.0,
            "replies": [
                {
                    "body": "Me too. I get that feeling really bad when other shows / books end and I have a feeling it's going to hit hard when Running Man ends. This show has been a part of my life for so long and has so much meaning to me, it just wont be the same without it.",
                    "author": "korweeaboo",
                    "id": "gsw1wn0",
                    "parent_id": "t1_gsvt0te",
                    "score": 8,
                    "created_utc": 1617172902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same. I felt so lost when Family Outing ended and just wanted to watch more. When I heard about Running Man, I’ve been watching since the first episode and through their hardest times when Gary left and when the show almost got cancelled. I’m almost 34 and I can’t believe I’ve been watching this variety show with Jaesuk (FO+RM) almost every week (whenever they have a new episode). I will take it very hard when this show ends.",
            "author": "nessab000",
            "id": "gsznf3h",
            "parent_id": "t1_gsvp928",
            "score": 3,
            "created_utc": 1617246335.0,
            "replies": []
        },
        {
            "body": "Running Man has became an important part of our lives, as we've grown together with the show and the members. But like any other shows, it's not forever. \n\nThe members has been running every week for more than ten years already. All of them are already hitting their primes, which is not forever. Eventually, they'll either leave the show one by one, or as a whole.\n\nOnce that happen, one thing I hope that the SBS should do is to not abandon the Running Man concept entirely. Which is what they're trying to do by exporting the franchise to other countries, especially in China and the South East Asia. \n\nBut for the Korean Running Man, although for some it's unpopular, I would welcome the idea that they would either add new members that'll gradually take over once that unevitable end would come. But they don't have to do it now, but at some point in the future they should consider that too.\n\nRunning Man is not just a variety show. It is a culture. And that culture is meant to be enjoyed by the next generation too.\n\nLOL! It looks like I've gone too far... HAHAHAHA",
            "author": "Sw4nSea",
            "id": "gt007sk",
            "parent_id": "t1_gsvp928",
            "score": 2,
            "created_utc": 1617254850.0,
            "replies": []
        },
        {
            "body": "Thanks to Running Man i was introduced to SNSD and now they are my all time favorite group. Me and my sister started watching Running Man in 2017 and the episodes were so fun to watch and we just continued watching their episodes and then we finally watched watched SNSD episode and they were so amazing. We have rewatched all their episodes too many times and running man also introduced us to so many other stars as well.",
            "author": "annikavinod",
            "id": "gsvtfqc",
            "parent_id": "t1_gsvrbre",
            "score": 6,
            "created_utc": 1617166554.0,
            "replies": [
                {
                    "body": "Running Man 363 is also my all-time favorite episode!!!",
                    "author": "Sw4nSea",
                    "id": "gsvxw8x",
                    "parent_id": "t1_gsvtfqc",
                    "score": 1,
                    "created_utc": 1617170137.0,
                    "replies": [
                        {
                            "body": "Ya I love that episode  but I love 63 and 64 the best. Even 253, the 2015 one was amazing.",
                            "author": "annikavinod",
                            "id": "gsw02f9",
                            "parent_id": "t1_gsvxw8x",
                            "score": 3,
                            "created_utc": 1617171624.0,
                            "replies": [
                                {
                                    "body": "Same here. I think the episode where they have picnic together is the best episode with SNSD. The warm feeling seeing how yoona always teases yuri dan kwangsoo.",
                                    "author": "abgbob",
                                    "id": "gsw5y1a",
                                    "parent_id": "t1_gsw02f9",
                                    "score": 3,
                                    "created_utc": 1617176108.0,
                                    "replies": [
                                        {
                                            "body": "Ya and Jessica's STRESSSS.",
                                            "author": "annikavinod",
                                            "id": "gsw7kgx",
                                            "parent_id": "t1_gsw5y1a",
                                            "score": 1,
                                            "created_utc": 1617177728.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yo! Same, I started watching this show because of SNSD.  Ended up loving the show/members.  New and old memebers are forever in my heart for all the laughs they bring into this world",
            "author": "KennyHuynhlalalala",
            "id": "gsxdixv",
            "parent_id": "t1_gsvrbre",
            "score": 2,
            "created_utc": 1617206175.0,
            "replies": []
        },
        {
            "body": "wow if this is not my thoughts!! Iron Min was slightly biased and his games were really confusing as hell haha but Bo Pil PD usually keeps things natural and does his own way. he's not too strict and his chemistry with the cast is crazy. i was also in an RM slump by the start of 2017 cause everything was just so boring and i couldn't stand seeing only 6 members while they tried their best to act like Gary's absence had no effect. from 2018- was like a new show to me! i loved how i could keep up with it and especially now they're modernizing RM. all the .ZIPs from YJS and LKS's gags in their official youtube channel are my go-to after finishing new eps.",
            "author": "taylorsanatomy13_",
            "id": "gt3kmdg",
            "parent_id": "t1_gsvnuwq",
            "score": 1,
            "created_utc": 1617328170.0,
            "replies": []
        },
        {
            "body": "I seriously have watched this clip so many times I have lost count. haha. :D",
            "author": "Kbdrama",
            "id": "gszl1cg",
            "parent_id": "t1_gsvx907",
            "score": 2,
            "created_utc": 1617244957.0,
            "replies": []
        },
        {
            "body": "true i wangko hyung's getting funnier now that he's older. specially when he's not in RM and in talk shows like MUD, Hangout w/ Yoo and others.",
            "author": "taylorsanatomy13_",
            "id": "gt3k43x",
            "parent_id": "t1_gsvx907",
            "score": 2,
            "created_utc": 1617327874.0,
            "replies": []
        },
        {
            "body": "lmao that's not oa. my life would probably be ruined when it ends. it's literally the highlight and 'win' of my week.",
            "author": "taylorsanatomy13_",
            "id": "gt3kqaq",
            "parent_id": "t1_gsxv3mo",
            "score": 2,
            "created_utc": 1617328233.0,
            "replies": []
        },
        {
            "body": "Me too. I get that feeling really bad when other shows / books end and I have a feeling it's going to hit hard when Running Man ends. This show has been a part of my life for so long and has so much meaning to me, it just wont be the same without it.",
            "author": "korweeaboo",
            "id": "gsw1wn0",
            "parent_id": "t1_gsvt0te",
            "score": 8,
            "created_utc": 1617172902.0,
            "replies": []
        },
        {
            "body": "Running Man 363 is also my all-time favorite episode!!!",
            "author": "Sw4nSea",
            "id": "gsvxw8x",
            "parent_id": "t1_gsvtfqc",
            "score": 1,
            "created_utc": 1617170137.0,
            "replies": [
                {
                    "body": "Ya I love that episode  but I love 63 and 64 the best. Even 253, the 2015 one was amazing.",
                    "author": "annikavinod",
                    "id": "gsw02f9",
                    "parent_id": "t1_gsvxw8x",
                    "score": 3,
                    "created_utc": 1617171624.0,
                    "replies": [
                        {
                            "body": "Same here. I think the episode where they have picnic together is the best episode with SNSD. The warm feeling seeing how yoona always teases yuri dan kwangsoo.",
                            "author": "abgbob",
                            "id": "gsw5y1a",
                            "parent_id": "t1_gsw02f9",
                            "score": 3,
                            "created_utc": 1617176108.0,
                            "replies": [
                                {
                                    "body": "Ya and Jessica's STRESSSS.",
                                    "author": "annikavinod",
                                    "id": "gsw7kgx",
                                    "parent_id": "t1_gsw5y1a",
                                    "score": 1,
                                    "created_utc": 1617177728.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ya I love that episode  but I love 63 and 64 the best. Even 253, the 2015 one was amazing.",
            "author": "annikavinod",
            "id": "gsw02f9",
            "parent_id": "t1_gsvxw8x",
            "score": 3,
            "created_utc": 1617171624.0,
            "replies": [
                {
                    "body": "Same here. I think the episode where they have picnic together is the best episode with SNSD. The warm feeling seeing how yoona always teases yuri dan kwangsoo.",
                    "author": "abgbob",
                    "id": "gsw5y1a",
                    "parent_id": "t1_gsw02f9",
                    "score": 3,
                    "created_utc": 1617176108.0,
                    "replies": [
                        {
                            "body": "Ya and Jessica's STRESSSS.",
                            "author": "annikavinod",
                            "id": "gsw7kgx",
                            "parent_id": "t1_gsw5y1a",
                            "score": 1,
                            "created_utc": 1617177728.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same here. I think the episode where they have picnic together is the best episode with SNSD. The warm feeling seeing how yoona always teases yuri dan kwangsoo.",
            "author": "abgbob",
            "id": "gsw5y1a",
            "parent_id": "t1_gsw02f9",
            "score": 3,
            "created_utc": 1617176108.0,
            "replies": [
                {
                    "body": "Ya and Jessica's STRESSSS.",
                    "author": "annikavinod",
                    "id": "gsw7kgx",
                    "parent_id": "t1_gsw5y1a",
                    "score": 1,
                    "created_utc": 1617177728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ya and Jessica's STRESSSS.",
            "author": "annikavinod",
            "id": "gsw7kgx",
            "parent_id": "t1_gsw5y1a",
            "score": 1,
            "created_utc": 1617177728.0,
            "replies": []
        }
    ]
}