{
    "title": "Sugaring isn't for everyone",
    "post_id": "lu5ugm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lu5ugm/sugaring_isnt_for_everyone/",
    "author": "True-Consequence3808",
    "body": "Hi everyone. I am a 24yr old, 5'7\" slim, attractive female.\nI would've never thought finding a real, legit, (wealthy), sugar daddy would've been so hard considering the amount of messages I get a day. To say it is easy work, is a slap in the face.\n\nLet me give you my take on the site we all probably know and my personal experience, Seeking Arrangements.\nI have exchanged a lot of messages and M&G's with POT daddies over the last two years.\n\nOld Photos, No Photos, Refuse to Show Photos.\nFirst of all, about 50% or more don't have a photo. When asked to provide before speaking more in term of arrangement, I have received responses such as; I don't have photos, but I am definitely attractive or It's better to wait till the M&G (...No.) I've even had one tell me it'll be fun not knowing what he looked like wanting me to show up at his house. The very few others have sent photos through text, but most photos used are atleast 10-20yr old I have noticed when meeting.\n\nPhoto Collectors.\nAnother good chunk of the men are solely photo collectors.\nThey will message you acting as if they are interested in an arrangement, lack to discuss details, start requesting photos, then more, and more. How many photos until you are satisfied?! One in particular I actually somehow managed to meet looking back now. We met for a M&G drinks, hit it off, then got a hotel shortly after. Made plans to see each other again but the very next day he started asking for photos.. not once but twice.. It carried on for days until it was pushing the one week mark with no next meetup planned. I had to stop responding. I don't know about you, but taking \"sexy\" photos all day is the last thing I want to be doing with my \"free time\".\n\nSalt Daddies.\nI'm from North Carolina. From my experience about 99% of the men on the site are about as broke as me. I have been asked to have a quicky in an office for lower than I made in two days at Food Lion with strict instructions, I have been asked to have car sex in a parking lot for a little more than the office dude without even met, I have been asked to use my discussed PPM to pay for the hotel, I have been asked to travel AND have sexual relations without any PPM or allowance, he said in return I'd receive a free trip and a back rub.\nOne lesson/tip I have learned is ALWAYS SET YOUR PPM/ALLOWANCE BEFORE MEETING!! I haven't yet met anyone without discussing this prior, but when I was new I had became a victim of the ole (for example): \"I'll do $$$ to $$$ per meet\", but then gifted the far lower end after, and than again after that. Set your amount and stick to it. Their is no reason you should be gave less than discussed. The ONLY two times I did not, I was burned by receiving less. (my fault for trusting them.)\n\nUnrealistic Expectations.\nI work 35hrs a week and live with my mother in a 2 bedroom single wide. I don't have the time of day, privacy, service/signal, or stamina to FaceTime, Snapchat, call, or text... All. Day. Long.\nMy longest SD relationship was with the most clingiest man I have ever met. He was a singer / song writer and truly insane. I wish I could post his name, but I don't want to be sued like he lived to threaten me. I had to get a second phone to avoid being spammed at work. If I had worked over late and not reply he'd curse me, tell me he was going to sue me for what he had gave, told me he had HIV, awful shit. He'd act as if everything was fine the next day. I could write a novel on the experience with him. 🤮\n\nBoundaries.\nI always set boundaries. In my experience that doesn't mean they won't be crossed, but you definitely should too. I am not comfortable with raw sex or anal sex. That's all. I didn't think it was much or would be a problem. The amount of men that expect raw sex is ridiculous. Anal sex and wanting a 3 way with an imaginary girl I'm supposed to find is tied for second. I just can't. What is so appealing about anal sex? You have your own asshole go play with it! If I state I am not comfortable with it why not find somebody else vs crossing my boundaries or repeatedly asking knowing what I already said. If you have such a big need for it to cross a boundary I think the smart and most logical thing to do would be to find a SB willingly that does it.\n\nTime Wasters.\nThe amount of men that are just looking for drinks, dinner, vanilla dating, with sex added is overflowing as well. It should not take weeks to get to the point. It's almost as annoying as the photo collectors or men thinking you're gonna f*** them for pennies, or in my case, nothing.\n\n\nI can't think of anything else to add, I hope I covered everything I can recall. It may just be where I live.\nI'm not sure if I'm being unreasonable, not putting in enough effort, selfish, or if I just don't have the time or energy to accompany these men the way they need to be.. but this is my take on Sugaring and the website it's self. It's not easy.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lu5ugm/sugaring_isnt_for_everyone/",
    "score": 143,
    "upvote_ratio": 0.93,
    "created_utc": 1614486122.0,
    "num_comments": 79,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp4m3fk",
            "parent_id": "t3_lu5ugm",
            "score": 59,
            "created_utc": 1614489948.0,
            "replies": [
                {
                    "body": "I would have to agree completely. Most of the men in my area that actually are looking to meet in person (excluding all time wasters I mentioned above) either want it free, $150 for in the backseat of a car \"because it's quick\", or an on call emotional support system 24/7. It's just not worth it as the time invested for what 99% of the men in my area can afford I'd make more and save more sanity and time at work, and that's the cold hard truth.",
                    "author": "True-Consequence3808",
                    "id": "gpa7b91",
                    "parent_id": "t1_gp4m3fk",
                    "score": 3,
                    "created_utc": 1614590296.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally relate to most of these points and feel your pain! The part that I never expected was the neediness? My experience so far has been with guys who want as much of my time as possible. Like not even sexually and it’s really hard to grapple with. How am I busier with school and work than the guys I’m meeting?? Never thought I’d prefer a married man but at this point 😓",
            "author": "98yyy98",
            "id": "gp52ju6",
            "parent_id": "t3_lu5ugm",
            "score": 34,
            "created_utc": 1614496882.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp6pxnv",
                    "parent_id": "t1_gp52ju6",
                    "score": 12,
                    "created_utc": 1614528773.0,
                    "replies": [
                        {
                            "body": "Yep. I’m not expecting constant texting, but this whole “it might take me 2 days to respond because I’m busy” thing really is a turn off. \n\nNo one is that busy, and frankly in the POT stage if you are that unresponsive I have to guess you aren’t actually serious about a relationship.",
                            "author": "throwawaysugar1980",
                            "id": "gp6s8im",
                            "parent_id": "t1_gp6pxnv",
                            "score": 6,
                            "created_utc": 1614529579.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "100%!!! I thought the exact same thing. I expected the men to be quite busy, boy was I wrong.. I don't mind at all conversation, but from the time my eyes open to close with no breaks and \"Hello?\" \"Are you okay?\" \"Did I lose you?\" \"are you mad at me?\" And the favorite, cursing me if it's dare been past a few hours.\nI remember one day I fell asleep on the couch, I hadn't slept much the previous night and had just got off work. I probably passed out for 2.5hrs-3hrs, I woke up to 11 text messages, 14ish missed calls (some blocked numbers as if I wouldn't know) and 2 emails.\n\nI never considered maybe only trying with the married ones, I bet that does help a ton in the neediness department. 😒",
                    "author": "True-Consequence3808",
                    "id": "gpa7qsn",
                    "parent_id": "t1_gp52ju6",
                    "score": 3,
                    "created_utc": 1614590727.0,
                    "replies": []
                },
                {
                    "body": "I see your point. I struggle with this a bit tho as I divorce an unfaithful man. I couldn’t date someone married and know I would be the one causing this type of pain for another woman. He destroyed our family. We have 2 very young kids and now I’m left to just figure it out.",
                    "author": null,
                    "id": "gp5zc3z",
                    "parent_id": "t1_gp52ju6",
                    "score": 4,
                    "created_utc": 1614515117.0,
                    "replies": [
                        {
                            "body": "Men that want to cheat will always find a girl to participate. If one girl wouldn't the next girl would. I'm sick of the \" oh if she didn't seduce him it wouldn't have happened\" yes it would have it would just be with a different woman unfortunately.",
                            "author": "lbseida",
                            "id": "gp62ibr",
                            "parent_id": "t1_gp5zc3z",
                            "score": 19,
                            "created_utc": 1614517726.0,
                            "replies": [
                                {
                                    "body": "Oh I completely agree. I’ve never been the jealous type, he knows what he has at home and he’s a big boy to make the decision if he wants to lose it. Still sucks though honestly. I just personally wouldn’t want to feel at all responsible for causing another woman this kind of pain. Or knowing I was a part of why her kids ask where dad is.",
                                    "author": null,
                                    "id": "gp62xf8",
                                    "parent_id": "t1_gp62ibr",
                                    "score": 10,
                                    "created_utc": 1614518049.0,
                                    "replies": [
                                        {
                                            "body": "Yea it does i really feel for you and you'll come out on top of this stronger and better. I'm sure it hits a personal note for you and keeping your conscience clear is the best peace of mind.",
                                            "author": "lbseida",
                                            "id": "gp635v2",
                                            "parent_id": "t1_gp62xf8",
                                            "score": 4,
                                            "created_utc": 1614518225.0,
                                            "replies": [
                                                {
                                                    "body": "Not at all trying to insult women who do fool around with married men. That’s on the man, not them. I apologize if it came off that way. Trust me, there’s some married men I know that I would do some dirty things to given the chance 😂",
                                                    "author": null,
                                                    "id": "gp63ft0",
                                                    "parent_id": "t1_gp635v2",
                                                    "score": 7,
                                                    "created_utc": 1614518437.0,
                                                    "replies": [
                                                        {
                                                            "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
                                                            "author": "lbseida",
                                                            "id": "gp63uy6",
                                                            "parent_id": "t1_gp63ft0",
                                                            "score": 5,
                                                            "created_utc": 1614518757.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                                                                    "author": null,
                                                                    "id": "gp640x8",
                                                                    "parent_id": "t1_gp63uy6",
                                                                    "score": 10,
                                                                    "created_utc": 1614518882.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                                                                            "author": "sucRoseToTheOccasion",
                                                                            "id": "gpd79z9",
                                                                            "parent_id": "t1_gp640x8",
                                                                            "score": 1,
                                                                            "created_utc": 1614648549.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "True. In that case you are very correct.",
                                                                                    "author": null,
                                                                                    "id": "gpd7s6s",
                                                                                    "parent_id": "t1_gpd79z9",
                                                                                    "score": 1,
                                                                                    "created_utc": 1614648813.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gp6qmvc",
                            "parent_id": "t1_gp5zc3z",
                            "score": 7,
                            "created_utc": 1614529018.0,
                            "replies": [
                                {
                                    "body": "Props to you. I hope you’re enjoying yourself now 😊",
                                    "author": null,
                                    "id": "gp6r7mu",
                                    "parent_id": "t1_gp6qmvc",
                                    "score": 4,
                                    "created_utc": 1614529213.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gp6ulqj",
                                            "parent_id": "t1_gp6r7mu",
                                            "score": 5,
                                            "created_utc": 1614530412.0,
                                            "replies": [
                                                {
                                                    "body": "Haha thank you. I’m leaving a boring sex life and I’m looking to explore. I’m doing well and don’t need a man, unfortunately some are intimidated by that and eventually it leads to issues. So for now just fun and adventure it is",
                                                    "author": null,
                                                    "id": "gp6wq2k",
                                                    "parent_id": "t1_gp6ulqj",
                                                    "score": 3,
                                                    "created_utc": 1614531370.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gp737u0",
                                                            "parent_id": "t1_gp6wq2k",
                                                            "score": 4,
                                                            "created_utc": 1614534264.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                                                                    "author": null,
                                                                    "id": "gp755ms",
                                                                    "parent_id": "t1_gp737u0",
                                                                    "score": 3,
                                                                    "created_utc": 1614534897.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed! My most recent arrangement basically had me acting as a therapist. He would dump all these vague issues on me (because he was very discrete and shared zero detail) and expected me to be glued to my phone to answer. If I didn't answer him he would worry I didn't like him or would accuse me of ignoring him. And it was really more of an NSA arrangement than a FWB so that was the most bizarre part. I expected more maturity from an MD in his 40s",
                    "author": "clashingtaco",
                    "id": "gp9ze6z",
                    "parent_id": "t1_gp52ju6",
                    "score": 1,
                    "created_utc": 1614582864.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl, I live in North Carolina and can tell you with 100% certainty that while certain areas have more to offer than others, you’ve just got to get better at screening! Figure out who all of these douche canoes are within the first few messages so they don’t get the chance to waste so much of your time! I’m so sorry you’ve run into so many grotesque creatures on there.",
            "author": "FoxyFreckles1989",
            "id": "gp6659q",
            "parent_id": "t3_lu5ugm",
            "score": 6,
            "created_utc": 1614520422.0,
            "replies": []
        },
        {
            "body": "Thanks for sharing this. It gives me some perspective on my \"competition,\" if you can even call it that.",
            "author": "DarthNylus",
            "id": "gp4mq0g",
            "parent_id": "t3_lu5ugm",
            "score": 17,
            "created_utc": 1614490206.0,
            "replies": []
        },
        {
            "body": "I don’t get photo collectors. What’s the point?\n\nI imagine a lot of babies have to deal with guys who are morons and/or cheap. \n\nAs for profile photos, I don’t have any either. I value discretion and quite frankly I don’t think she will jump at meeting me if she saw them anyway. I try to go for the ones who don’t treat SA as tinder. Who want a real sugar relationship. I’m fine with some initial courting , as long as she’s not playing me into paying her for a platonic SR.\n\nMy first dates are always fun. We will go to a nice restaurant for food and drinks, and I never pressure her to stay over. The guys who do - red flag all around. But yes, I think you should set your PPM before meeting. I personally prefer this because I don’t want her to later hit me with a number that’s unreasonable. \n\nAll in all it comes down to compatibility. I’m not compatible with most SB because many of them want a mega hot guy to pay them just for existing. The ones who I am compatible with, we wind up both happy.",
            "author": "UnearthlyDinosaur",
            "id": "gp4icyz",
            "parent_id": "t3_lu5ugm",
            "score": 19,
            "created_utc": 1614488467.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp4l7sm",
                    "parent_id": "t1_gp4icyz",
                    "score": 15,
                    "created_utc": 1614489595.0,
                    "replies": [
                        {
                            "body": "yeah but I do not get it either, why can't they just google?",
                            "author": "StrangerOdd9606",
                            "id": "gp4opha",
                            "parent_id": "t1_gp4l7sm",
                            "score": 6,
                            "created_utc": 1614491000.0,
                            "replies": [
                                {
                                    "body": "Bc they want to get off acting as if  they are rich and tricking girls. Then they show the pictures to their friends to pretend they actually fucked those girls.",
                                    "author": "angelhair12",
                                    "id": "gp4pldd",
                                    "parent_id": "t1_gp4opha",
                                    "score": 18,
                                    "created_utc": 1614491357.0,
                                    "replies": [
                                        {
                                            "body": "you assume they have friends.",
                                            "author": "timrid",
                                            "id": "gp58bv6",
                                            "parent_id": "t1_gp4pldd",
                                            "score": 12,
                                            "created_utc": 1614499433.0,
                                            "replies": [
                                                {
                                                    "body": "Or maybe they show girls on meet and greets to pretend that’s their competition.",
                                                    "author": "angelhair12",
                                                    "id": "gp5aehh",
                                                    "parent_id": "t1_gp58bv6",
                                                    "score": 6,
                                                    "created_utc": 1614500355.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "😂🖤",
                                                    "author": "angelhair12",
                                                    "id": "gp5a82r",
                                                    "parent_id": "t1_gp58bv6",
                                                    "score": 5,
                                                    "created_utc": 1614500279.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I don’t get photo collectors. What’s the point?\n\nI absolutely don't get it either. After starting an arrangement my current SB, I had txted her something like \"we got this far without me requesting a single pic\". Then she sent me 3 in bra/panties. Aside from what was on her profile, those are the only other photos of her I have. I don't have a single nude of her. When searching, I don't ask for \"extra pics\" bc I know literally every SB gets pic requests from 99.9% of the men she is in contact with when searching for a SD.",
                    "author": "bluelunarmonkey",
                    "id": "gp5k178",
                    "parent_id": "t1_gp4icyz",
                    "score": 9,
                    "created_utc": 1614504979.0,
                    "replies": []
                },
                {
                    "body": "I’ve come across men who are interested in certain poses. They tend to be the ones into objectification and get off knowing the pictures they request are taken specifically for them",
                    "author": null,
                    "id": "gp5yrnk",
                    "parent_id": "t1_gp4icyz",
                    "score": 5,
                    "created_utc": 1614514683.0,
                    "replies": []
                },
                {
                    "body": "The photo collectors are SO strange. I had a guy recently mention he had a foot fetish which I'm cool with. But then he sent me all these example pictures and demanded I pose like them so he can see if he likes my feet. I explained that plenty of girls are paid for that kind of service, I could send one simple photo but I'm not about to send him free jerk off fodder. So of course he says \"that's what girls with ugly feet usually say\" and got really nasty towards me. I never even said I had cute feet!",
                    "author": "clashingtaco",
                    "id": "gp9zwkb",
                    "parent_id": "t1_gp4icyz",
                    "score": 3,
                    "created_utc": 1614583305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think your summary is bang on. Sugaring from the SB side is a ton of work. The quality of men of sugaring sites is generally very poor because they’re not actually interested in sugar dating in any real way. \n\nI had one SD that took me hiking in the mountains and expected intimacy because of it. I’ve been hiking hundreds of times, I can drive to the mountains any time I want and I don’t need a chaperone who I have to pretend is god’s gift to humanity. \n\nCouldn’t move in fast enough after this, but it is very typical of the type of thinking that many men have. \n\nThere is a lot of rude remarks from SDs on SLF who see the words “I know/understand my worth,” as a red flag. In this lifestyle, it is imperative to understand your own worth; otherwise if you define your worth by how men in the bowl treat you...more often than not, you would be worthless. There is never any effort made to understand where this type of language comes from. \n\nLike the man I had a very respectful convo with until he asked me to meet up at a local coffee shop for coffee and a bj. When I declined politely, I was chastised for being a whore and a tease...for not wanting to give a stranger a bj for a cup of coffee. If I wasn’t sure of who I am and what my value is than maybe I would believe the type of things men say in the bowl all the time. \n\nWhen I took the time to figure out what I wanted out of the bowl, I also took the time to figure out what I have to offer an SD. I made an inventory of the qualities that I possess that are of value to the type of men I want an SR with. (I won’t list those because they’re of course subjective.) I know I’m beautiful (to some), but so are so many women in the bowl, so I really had to determine where my value lies in this lifestyle. I’m not an SB in her 20s, so I know that my game and my value must be substantial to shine over the youth of younger SBs. I now therefor understand my value, and I only interact with people who are able to appreciate that value. \n\nMy two cents :)\n\nThanks for posting!!!",
            "author": "InnerRadio7",
            "id": "gpcw13s",
            "parent_id": "t3_lu5ugm",
            "score": 5,
            "created_utc": 1614642551.0,
            "replies": []
        },
        {
            "body": "**I don't have the time of day, privacy, service/signal, or stamina to FaceTime, Snapchat, call, or text.**\n\nThis is a guaranteed road to failure in nearly any SR. There are a couple of daddies out there that are interested in no contact, nsa, hookup situations but I think they are very rare. Most SD's are just as interested in the R (Relationship) part of a SR (Sugar Relationship).  Relationships require lots of communication, else it's just sugar.",
            "author": null,
            "id": "gp6c60m",
            "parent_id": "t3_lu5ugm",
            "score": 14,
            "created_utc": 1614523883.0,
            "replies": []
        },
        {
            "body": "Yeah I don’t post photos because I’m easily recognized and because ... I don’t have to... I’ll exchange off site. There are so many other problems with POTs like ... boundaries ... yeah you have to wade through that ... sorry ... but I have to wade through a lot also",
            "author": "daddoms",
            "id": "gp4l26p",
            "parent_id": "t3_lu5ugm",
            "score": 8,
            "created_utc": 1614489531.0,
            "replies": [
                {
                    "body": "Any reason you prefer sharing offsite vs a private picture? In case SA gets hacked?",
                    "author": "new_sd_acct",
                    "id": "gp4mw01",
                    "parent_id": "t1_gp4l26p",
                    "score": 7,
                    "created_utc": 1614490272.0,
                    "replies": [
                        {
                            "body": "Exactly. I’ve got lots of public pictures published everywhere. I always send a published picture that way I have plausible deniability",
                            "author": "daddoms",
                            "id": "gp4n8yh",
                            "parent_id": "t1_gp4mw01",
                            "score": 6,
                            "created_utc": 1614490415.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m not sure about SA but on SDM you can have hidden photos to general users and they are only viewable by people you add to your favorites.",
                    "author": null,
                    "id": "gp4ni62",
                    "parent_id": "t1_gp4l26p",
                    "score": 3,
                    "created_utc": 1614490522.0,
                    "replies": [
                        {
                            "body": "No one will be able to screenshot my face on a website. I work for a very conservative organization. I need plausible deniability. I don’t really need SA except as a convenience and nice search capabilities.",
                            "author": "daddoms",
                            "id": "gp4o7za",
                            "parent_id": "t1_gp4ni62",
                            "score": 8,
                            "created_utc": 1614490809.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "From the other side I’m seeing an insane number of platonic only profiles.  The girls lament the difficulty finding a SD but are unawares its bc paying someone not to even consider kisses is a non starter.",
            "author": "MidwestAmMan",
            "id": "gp5nrmf",
            "parent_id": "t3_lu5ugm",
            "score": 15,
            "created_utc": 1614507367.0,
            "replies": [
                {
                    "body": "Oh boohoo, you keep running across 19 year olds that don't want to have sex with men in their 60s ☹️\n\nDo you even realise how absolutely ridiculous and insulting your comparison is? Finding an SB open to intimacy is a million times easier than finding a genuine SD who is not a psycho. Cry me a river",
                    "author": "QuirkyComplex",
                    "id": "gp5z2tz",
                    "parent_id": "t1_gp5nrmf",
                    "score": -9,
                    "created_utc": 1614514921.0,
                    "replies": [
                        {
                            "body": "This. Is why myself(and two other legit sds I'm friends with will never use the sites). Polarizing and marginalizing to gain what? Totally opposite of what a 'community ' is for. Real Daddys have little challenge finding pots... now finding good ones...lol",
                            "author": "nucple2xplor",
                            "id": "gp6esyc",
                            "parent_id": "t1_gp5z2tz",
                            "score": 5,
                            "created_utc": 1614524977.0,
                            "replies": []
                        },
                        {
                            "body": ">> Oh boohoo, you keep running across 19 year olds that don't want to have sex with men in their 60s ☹️\n\nNice stereotyping\n\n>>Do you even realise how absolutely ridiculous and insulting your comparison is? Finding an SB open to intimacy is a million times easier than finding a genuine SD who is not a psycho. Cry me a river\n\nSame for the SDs. Do you know how many babies hop of the rails into crazy town once they settle in? Blackmail, entrapment, false rape accusations. Painting babies as perpetual martyrs are why they are so often taken advantage of. You need to stop spreading this BS and show that we have backbones. We have risks and they do too. Part of being in the bowl.",
                            "author": "SnooDucks4705",
                            "id": "gp63ug5",
                            "parent_id": "t1_gp5z2tz",
                            "score": 12,
                            "created_utc": 1614518746.0,
                            "replies": []
                        },
                        {
                            "body": "I can’t really claim to know exactly what you go through, but I can tell you I’ve had a terribly hard time finding a legitimate SB.\n\nI don’t think fighting about who has it worse really helps, we both go through shit. It’s kind of like when someone on r/twoxchromosomes points out that men are in fact assaulted too and the sub goes into a meltdown.",
                            "author": "throwawaysugar1980",
                            "id": "gp64a04",
                            "parent_id": "t1_gp5z2tz",
                            "score": 5,
                            "created_utc": 1614519070.0,
                            "replies": [
                                {
                                    "body": ">I’ve had a terribly hard time finding a legitimate SB.\n\nI don't think finding a legitimate SB that you connect with is easy at all. Especially since most are in college so there is always that added risk of flakiness, rinsers, not to mention blackmail/extortion etc.\n\nAnd with the rise of the TikTok babies, these scams are only getting more and more popular thus saturating the bowl with more fake SDs and SBs and making it even more difficult for the genuine ones to find one another.\n\n>I don’t think fighting about who has it worse really helps\n\nYeah, my point was not about who has it better or worse, had he used a different example (such as TSD's unfortunate incident of being robbed at knife point) I would not have left the comment that I did. OP provided multiple scenarios showcasing just how bad the state of sugar is and his response was to cry about young girls not wanting to put out 🙄",
                                    "author": "QuirkyComplex",
                                    "id": "gp6gzle",
                                    "parent_id": "t1_gp64a04",
                                    "score": 1,
                                    "created_utc": 1614525792.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's like you think empathy is a zero sum game. \n\nMost SBs aren't sugaring for survival, that I've come across. They're sugaring for extras in their life or to improve their financial position, primarily. OP doesn't describe a survival situation. So it isn't like the struggle of the SB is inherently more noble than SD's.",
                            "author": "OpenAirMarket901",
                            "id": "gp64jde",
                            "parent_id": "t1_gp5z2tz",
                            "score": 3,
                            "created_utc": 1614519263.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its okay, its just as bad for men. There’s just far more people who use SA not for it’s intended purposes :/",
            "author": "RightTwiceADay1",
            "id": "gp5yxe2",
            "parent_id": "t3_lu5ugm",
            "score": 4,
            "created_utc": 1614514804.0,
            "replies": []
        },
        {
            "body": "Wow, so sorry for your experience with horrible men. My husband and I have done the sugar baby thing, because we love having 3somes. We did an automatic biweekly deposit into our baby’s Venmo account for allowance. I totally agree that don’t do anything without seeing money first! I know you kind of don’t want it to seem transactional, but you have to look out for you!",
            "author": "Natenat04",
            "id": "gp5z1ck",
            "parent_id": "t3_lu5ugm",
            "score": 4,
            "created_utc": 1614514887.0,
            "replies": []
        },
        {
            "body": "I agree with everything you said and I’m sorry you are having a hard time. \n\nOnly advice I have is to be more open to guys who don’t have photos, as long as they claim to be attractive. I have have most of my best sugar relationships based off blind dates, because of privacy. I didn’t even share photos of my full face bc it’s not worth risking anyone in my real life finding out about this. If you really want to know to get a clue about what the non- photo sharing POT looks like ask him which celebrity he resembles to get an idea of him. But, I really would not completely cut these guys out.\n\nI suggest you give one of these no picture POTs a chance before you quit the bowl.",
            "author": "angelhair12",
            "id": "gp4qsaq",
            "parent_id": "t3_lu5ugm",
            "score": 6,
            "created_utc": 1614491841.0,
            "replies": []
        },
        {
            "body": "SD of 7 years in Australia/NZ. \n\nLike any dating/non-dating website, there are illegitimate people on both sides. \n\nIf I start telling you about my bad ones, it would take days. Been lied to, scammed, stalked, blackmailed etc. \n\nI've met some amazing people in my few years, some of them I'm still friends with and would do anything to help them out, even long after we have parted ways. \n\nDon't give up. Like some other people have mentioned, change your tactics, try to learn and filter out. Never been to NC, but I'm sure there are good people around. \n\nJust my two cents worth. :)",
            "author": "maves3",
            "id": "gp526i4",
            "parent_id": "t3_lu5ugm",
            "score": 5,
            "created_utc": 1614496728.0,
            "replies": [
                {
                    "body": "This!  I have met a broad swath of less admirable ladies, and heard many true stories of \"vile men\" and one friend called them.  If you are in my area of NC, and you wanted this, I would happily buy you a drink and swap stories.  I am not currently looking, but that might change in the future.  Maybe take a break for a bit and come back to that web site when you feel it more?",
                    "author": "NCtriadSD",
                    "id": "gp68a0y",
                    "parent_id": "t1_gp526i4",
                    "score": 1,
                    "created_utc": 1614521852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry that the vast majority of guys are simply dicks.  It's a shame that it's so difficult to find a good SR.\n\nThe whole sugar scene is a missed concept.  Sure, there have always been and will always be sugar daddies but they will always be a very small minority of guys.  And being guys, only a minority of them will be good long term material.\n\nBut I think success is all about the expectations and the character of the SB (or SD).  You need to know pretty exactly what you want and how to filter to achieve it.  And you need the character to be naturally suited to your kind of SR.",
            "author": "anonymoustruth_99",
            "id": "gp60af9",
            "parent_id": "t3_lu5ugm",
            "score": 3,
            "created_utc": 1614515905.0,
            "replies": []
        },
        {
            "body": "Sounds accurate to me.  I live in an affluent big-city area.  That undoubtedly makes a BIG difference. The ratio of POT SB's to SD's still is extraordinarily high.  But at least there is a pool of monied men here.  \n\nNo one should think this is \"easy\" for men or women.  Even with the ratio I mentioned above, it was a lot of time invested before I met someone highly compatible. Chats that reveal major flaws, m&g's that do the same, ghosts, no-shows, etc etc.",
            "author": null,
            "id": "gp61ur7",
            "parent_id": "t3_lu5ugm",
            "score": 3,
            "created_utc": 1614517197.0,
            "replies": []
        },
        {
            "body": "Change your primary location to a big city you will get rich and more serious men also when asking for photos always make sure to ask for another photo of them doing a certain hand gesture to make sure it is really them I’m from North Carolina also and left. I moved to Dallas. Nc is not the place for sugaring or sex work as it is dangerous and it is filled with low ballers",
            "author": "Fabulous-Ad-2599",
            "id": "gp6ehol",
            "parent_id": "t3_lu5ugm",
            "score": 3,
            "created_utc": 1614524849.0,
            "replies": []
        },
        {
            "body": "You are having a hard time because of your location.   \nWhen you mention the Carolinas this comes to mind:  \n[https://www.theonion.com/south-carolina-refuses-to-remove-confederate-flag-from-1819577937](https://www.theonion.com/south-carolina-refuses-to-remove-confederate-flag-from-1819577937)  \nThey just can't afford what they want, hence all the crazy requests.  \n\n\nThere are still some things you can do to save time and \"fast forward\" to the point, by following strict rules. you already know the basics:  \n1. \"ALWAYS SET YOUR PPM/ALLOWANCE BEFORE MEETING!\" (quote)   \n2.  Boundaries (quote). mention they are non negotiable.  \n3. Have **public** photos that show your face, and show your figure **very clearly**. then, decline all photo requests no matter what.   \n4. All chats must go to M&G within X messages and Y days. you are not an emo support line.",
            "author": "JeaneyBowl",
            "id": "gp7aea8",
            "parent_id": "t3_lu5ugm",
            "score": 3,
            "created_utc": 1614536522.0,
            "replies": []
        },
        {
            "body": "I totally respect you for not doing raw and anal! I would not do it either!",
            "author": "angelhair12",
            "id": "gp4s8il",
            "parent_id": "t3_lu5ugm",
            "score": 9,
            "created_utc": 1614492442.0,
            "replies": []
        },
        {
            "body": "This makes me so mad on your behalf. Just sucks",
            "author": "NorthEastSD",
            "id": "gp4mh7r",
            "parent_id": "t3_lu5ugm",
            "score": 8,
            "created_utc": 1614490106.0,
            "replies": []
        },
        {
            "body": "Oh gosh. That’s awful. When I was on SA I definitely experienced all the types you mentioned and that was about 2 years ago. \nAnd yes the amount of SDs wanting a threesome and expecting women to have a magical way of finding the third person haha. It came to the point I never shared pictures of me and a friend as they would always ask about my friend and if she’d be up for a threesome. \n\nBut yeah this lifestyle isn’t for everyone. It’s very tiring finding a good arrangement for both SBs and SDs.",
            "author": "Adira5",
            "id": "gp5edx5",
            "parent_id": "t3_lu5ugm",
            "score": 6,
            "created_utc": 1614502152.0,
            "replies": []
        },
        {
            "body": "Wow. Well written. The sites attracts the worst types. The sbs are generally self absorbed hustlers, and the sds are pathetic wannabes. Do you self a favor. Put on a cocktail dress amd go to a nice bar or club. I have way better results there. True, the pool of pots looking for arrangement is a small percentage there, but they are actually real. I cam spot a pot in public with about 80% accuracy. Then I just say hi and see where she's at. I absolutely adore true sbs that are genuinely attracted to older men , and I can't stop myself from spoiling her. But that's because we're friends and share a mutual kink. Not because either of us owe the other because of a pre determined 'arrangement'. Imposed expectations is bullying period. Both ways",
            "author": "nucple2xplor",
            "id": "gp6d10z",
            "parent_id": "t3_lu5ugm",
            "score": 2,
            "created_utc": 1614524245.0,
            "replies": [
                {
                    "body": "You’re a man who has found sugar babies at clubs? Or you’re a sugar baby who found men to support you irl?",
                    "author": "dinasaurrrr",
                    "id": "gp9o24y",
                    "parent_id": "t1_gp6d10z",
                    "score": 1,
                    "created_utc": 1614574141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As someone told me “sugaring isn’t for everyone, but anyone can do it.”",
            "author": "micaconamor33",
            "id": "gp6q8et",
            "parent_id": "t3_lu5ugm",
            "score": 2,
            "created_utc": 1614528880.0,
            "replies": [
                {
                    "body": "In OP’s case, given the “I work 35 hours a week and live at home so I can’t really test” I call bs. \n\nI just think sugaring might not be for her in a case like that.",
                    "author": "throwawaysugar1980",
                    "id": "gp74wap",
                    "parent_id": "t1_gp6q8et",
                    "score": 2,
                    "created_utc": 1614534816.0,
                    "replies": [
                        {
                            "body": "The reason I sugar is for NSA, fun, I like older men and need the support financially. If sugaring is being an emotional support therapist on call 24hrs, 7 days a week for pennies to the dollar, than it's certainly not for me.",
                            "author": "True-Consequence3808",
                            "id": "gpa6ygk",
                            "parent_id": "t1_gp74wap",
                            "score": 2,
                            "created_utc": 1614589939.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It really sucks that you've been having that kind of experience. I think it has everything to do with location. If you're in a city with wealthy men, they'll be less salt/splenda daddies out there.",
            "author": "CryptoAustinSD",
            "id": "gp6r16b",
            "parent_id": "t3_lu5ugm",
            "score": 2,
            "created_utc": 1614529149.0,
            "replies": []
        },
        {
            "body": "As a new SB trying to figure out the bowl, just wanted to say this thread was ridiculously helpful. Thanks community!",
            "author": "naturebugk",
            "id": "gp9lkf9",
            "parent_id": "t3_lu5ugm",
            "score": 2,
            "created_utc": 1614572491.0,
            "replies": []
        },
        {
            "body": "A couple points as someone that is newer.\n\nI’m very hesitant to share photos. I really want to be discreet as possible.\n\nThere are time wasters on both sides. You deal with assholes like you mentioned, we deal with platonic and onlyfan girls constantly.\n\nTo the unrealistic about communications part....texting really shouldn’t be that hard even with working 35 hours a week and living at home. You can still do they discreetly. \n\nReally everything else it seems you just have to weed through until you find the right guy.",
            "author": "throwawaysugar1980",
            "id": "gp4heuu",
            "parent_id": "t3_lu5ugm",
            "score": 3,
            "created_utc": 1614488106.0,
            "replies": []
        },
        {
            "body": "It sounds like you truly had some horrible experiences and while I hate \"blaming the victim\", sometimes you have to look at the common denominator of all the bad experiences...which is you. \n\nNot saying that you necesydid anything wrong, but you know what they say about the definition of insanity is. Doing the same thing over and over and expecting different outcomes. If something didn't work out, you probably should have tried something different or quit. While there are bad apples, I think that most experiences are positive because people tend to learn from their mistakes.\n\nI'm sorry that you went through all this and it's definitely a good warning to those that are perhaps young, impressionable and perhaps easily manipulated to think about what they are getting into.",
            "author": "non_giant_panda",
            "id": "gp4n45d",
            "parent_id": "t3_lu5ugm",
            "score": -4,
            "created_utc": 1614490362.0,
            "replies": []
        },
        {
            "body": "Two years and no success?",
            "author": "new_sd_acct",
            "id": "gp4lrei",
            "parent_id": "t3_lu5ugm",
            "score": 0,
            "created_utc": 1614489815.0,
            "replies": [
                {
                    "body": "Well she says she has no time to deal with communicating with a SD,  are you surprised?",
                    "author": null,
                    "id": "gp6cpu1",
                    "parent_id": "t1_gp4lrei",
                    "score": 2,
                    "created_utc": 1614524117.0,
                    "replies": [
                        {
                            "body": "No, I said I don't have time to text 24/7 while working and having to sleep, let alone meets. When I started setting an alarm every 2.5 hours during the night to make sure he was responded to I realized things were way out of hand. (He had a weird sleeping schedule). Apparently every one else has this problem as well, so it's not just me.",
                            "author": "True-Consequence3808",
                            "id": "gpa6qub",
                            "parent_id": "t1_gp6cpu1",
                            "score": -1,
                            "created_utc": 1614589728.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She says in the fifth sentence.  2 years.",
                    "author": null,
                    "id": "gp4nbrw",
                    "parent_id": "t1_gp4lrei",
                    "score": 1,
                    "created_utc": 1614490446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wait you dated a guy who had the hiv?  You were ok with this?  I’m so confused as to why people stay in such relationships",
            "author": "pussy_impaler337",
            "id": "gpdx9jw",
            "parent_id": "t3_lu5ugm",
            "score": 0,
            "created_utc": 1614663335.0,
            "replies": []
        },
        {
            "body": "Sounds like the bowl might not be.for you.  Wonder why you attract so many idiots.   You make it sound impossible.to find domeone nice which clearly isn't true.\n\nYour messaging and screening is probably letting you down",
            "author": "wb19081908",
            "id": "gp5hjo4",
            "parent_id": "t3_lu5ugm",
            "score": -5,
            "created_utc": 1614503621.0,
            "replies": []
        },
        {
            "body": "🙁 stories like this is why I’m hesitant on finishing an SA profile. The thrill of sugar dating definitely interests me but it seems like a lot of bs to sort through to get there",
            "author": null,
            "id": "gp5z2ea",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614514913.0,
            "replies": []
        },
        {
            "body": "Thanks for posting! It’s good to know different (and real) experiences and red flags for anyone considering. I don’t trust written experiences that sound like affiliate marketing for the websites. I guess it’s just going to take work to find fun and respectful arrangements.",
            "author": "Beveled_Mat",
            "id": "gp64i0f",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614519235.0,
            "replies": []
        },
        {
            "body": "Any chance you are not filtering right and ending with the wrong ones?",
            "author": null,
            "id": "gp6nmqv",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614528000.0,
            "replies": []
        },
        {
            "body": "How do you initially reply or try to get a sd when they message you like hey what’s up beautiful? Idk how to start off the conversation to imply I’m a sb with those intentions",
            "author": "Equivalent-Plate-469",
            "id": "gp7f1gq",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614537961.0,
            "replies": []
        },
        {
            "body": "I guess due to the amount I can offer per month (about a month's apartment here but it seems most women want a lot more than that) I'd be consider salt or splenda.  I probably need a more recent picture - mine are three years old.  As far as intimacy expectations are concerned, most whom I have met recently seem to want to give as little back as possible and still get allowances/ppm.   Last girl I talked to ended up being a rinser.   Gave her some upfront money because she seemed 'real' but we were supposed to meet for dinner last night (after I paid for a caregiver so she could have the evening out) and ghosted me instead.",
            "author": null,
            "id": "gp8mcnp",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614552966.0,
            "replies": []
        },
        {
            "body": "Did your actions ever result in problems in SR?  Or were these problems in the bowl 100% due to the guys only?",
            "author": "RP_Bear9",
            "id": "gpa3pdf",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614586771.0,
            "replies": [
                {
                    "body": "What exactly do you mean so I could better answer?",
                    "author": "True-Consequence3808",
                    "id": "gpa70l7",
                    "parent_id": "t1_gpa3pdf",
                    "score": 1,
                    "created_utc": 1614589998.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I showed up once to meet someone for an agreed upon $400 PPM. \n\nI drove to his place, had a coffee, talked for an hour, and then things moved to the bedroom. We engaged in light foreplay (above the waist and, but he got naked very quickly and I was uncomfortable having sex, and I made an excuse and left.\n\nI never got paid, no follow up, and he was quite rude afterwards. \n\nI had never said I would have sex on the first meeting. \n\nWhat should I have done differently / who was at fault / how do you ensure you get paid?",
            "author": "mediocreethot",
            "id": "gpcz8e1",
            "parent_id": "t3_lu5ugm",
            "score": 1,
            "created_utc": 1614644238.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gpcz8f2",
                    "parent_id": "t1_gpcz8e1",
                    "score": 1,
                    "created_utc": 1614644239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would have to agree completely. Most of the men in my area that actually are looking to meet in person (excluding all time wasters I mentioned above) either want it free, $150 for in the backseat of a car \"because it's quick\", or an on call emotional support system 24/7. It's just not worth it as the time invested for what 99% of the men in my area can afford I'd make more and save more sanity and time at work, and that's the cold hard truth.",
            "author": "True-Consequence3808",
            "id": "gpa7b91",
            "parent_id": "t1_gp4m3fk",
            "score": 3,
            "created_utc": 1614590296.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp6pxnv",
            "parent_id": "t1_gp52ju6",
            "score": 12,
            "created_utc": 1614528773.0,
            "replies": [
                {
                    "body": "Yep. I’m not expecting constant texting, but this whole “it might take me 2 days to respond because I’m busy” thing really is a turn off. \n\nNo one is that busy, and frankly in the POT stage if you are that unresponsive I have to guess you aren’t actually serious about a relationship.",
                    "author": "throwawaysugar1980",
                    "id": "gp6s8im",
                    "parent_id": "t1_gp6pxnv",
                    "score": 6,
                    "created_utc": 1614529579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100%!!! I thought the exact same thing. I expected the men to be quite busy, boy was I wrong.. I don't mind at all conversation, but from the time my eyes open to close with no breaks and \"Hello?\" \"Are you okay?\" \"Did I lose you?\" \"are you mad at me?\" And the favorite, cursing me if it's dare been past a few hours.\nI remember one day I fell asleep on the couch, I hadn't slept much the previous night and had just got off work. I probably passed out for 2.5hrs-3hrs, I woke up to 11 text messages, 14ish missed calls (some blocked numbers as if I wouldn't know) and 2 emails.\n\nI never considered maybe only trying with the married ones, I bet that does help a ton in the neediness department. 😒",
            "author": "True-Consequence3808",
            "id": "gpa7qsn",
            "parent_id": "t1_gp52ju6",
            "score": 3,
            "created_utc": 1614590727.0,
            "replies": []
        },
        {
            "body": "I see your point. I struggle with this a bit tho as I divorce an unfaithful man. I couldn’t date someone married and know I would be the one causing this type of pain for another woman. He destroyed our family. We have 2 very young kids and now I’m left to just figure it out.",
            "author": null,
            "id": "gp5zc3z",
            "parent_id": "t1_gp52ju6",
            "score": 4,
            "created_utc": 1614515117.0,
            "replies": [
                {
                    "body": "Men that want to cheat will always find a girl to participate. If one girl wouldn't the next girl would. I'm sick of the \" oh if she didn't seduce him it wouldn't have happened\" yes it would have it would just be with a different woman unfortunately.",
                    "author": "lbseida",
                    "id": "gp62ibr",
                    "parent_id": "t1_gp5zc3z",
                    "score": 19,
                    "created_utc": 1614517726.0,
                    "replies": [
                        {
                            "body": "Oh I completely agree. I’ve never been the jealous type, he knows what he has at home and he’s a big boy to make the decision if he wants to lose it. Still sucks though honestly. I just personally wouldn’t want to feel at all responsible for causing another woman this kind of pain. Or knowing I was a part of why her kids ask where dad is.",
                            "author": null,
                            "id": "gp62xf8",
                            "parent_id": "t1_gp62ibr",
                            "score": 10,
                            "created_utc": 1614518049.0,
                            "replies": [
                                {
                                    "body": "Yea it does i really feel for you and you'll come out on top of this stronger and better. I'm sure it hits a personal note for you and keeping your conscience clear is the best peace of mind.",
                                    "author": "lbseida",
                                    "id": "gp635v2",
                                    "parent_id": "t1_gp62xf8",
                                    "score": 4,
                                    "created_utc": 1614518225.0,
                                    "replies": [
                                        {
                                            "body": "Not at all trying to insult women who do fool around with married men. That’s on the man, not them. I apologize if it came off that way. Trust me, there’s some married men I know that I would do some dirty things to given the chance 😂",
                                            "author": null,
                                            "id": "gp63ft0",
                                            "parent_id": "t1_gp635v2",
                                            "score": 7,
                                            "created_utc": 1614518437.0,
                                            "replies": [
                                                {
                                                    "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
                                                    "author": "lbseida",
                                                    "id": "gp63uy6",
                                                    "parent_id": "t1_gp63ft0",
                                                    "score": 5,
                                                    "created_utc": 1614518757.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                                                            "author": null,
                                                            "id": "gp640x8",
                                                            "parent_id": "t1_gp63uy6",
                                                            "score": 10,
                                                            "created_utc": 1614518882.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                                                                    "author": "sucRoseToTheOccasion",
                                                                    "id": "gpd79z9",
                                                                    "parent_id": "t1_gp640x8",
                                                                    "score": 1,
                                                                    "created_utc": 1614648549.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "True. In that case you are very correct.",
                                                                            "author": null,
                                                                            "id": "gpd7s6s",
                                                                            "parent_id": "t1_gpd79z9",
                                                                            "score": 1,
                                                                            "created_utc": 1614648813.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp6qmvc",
                    "parent_id": "t1_gp5zc3z",
                    "score": 7,
                    "created_utc": 1614529018.0,
                    "replies": [
                        {
                            "body": "Props to you. I hope you’re enjoying yourself now 😊",
                            "author": null,
                            "id": "gp6r7mu",
                            "parent_id": "t1_gp6qmvc",
                            "score": 4,
                            "created_utc": 1614529213.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gp6ulqj",
                                    "parent_id": "t1_gp6r7mu",
                                    "score": 5,
                                    "created_utc": 1614530412.0,
                                    "replies": [
                                        {
                                            "body": "Haha thank you. I’m leaving a boring sex life and I’m looking to explore. I’m doing well and don’t need a man, unfortunately some are intimidated by that and eventually it leads to issues. So for now just fun and adventure it is",
                                            "author": null,
                                            "id": "gp6wq2k",
                                            "parent_id": "t1_gp6ulqj",
                                            "score": 3,
                                            "created_utc": 1614531370.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gp737u0",
                                                    "parent_id": "t1_gp6wq2k",
                                                    "score": 4,
                                                    "created_utc": 1614534264.0,
                                                    "replies": [
                                                        {
                                                            "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                                                            "author": null,
                                                            "id": "gp755ms",
                                                            "parent_id": "t1_gp737u0",
                                                            "score": 3,
                                                            "created_utc": 1614534897.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed! My most recent arrangement basically had me acting as a therapist. He would dump all these vague issues on me (because he was very discrete and shared zero detail) and expected me to be glued to my phone to answer. If I didn't answer him he would worry I didn't like him or would accuse me of ignoring him. And it was really more of an NSA arrangement than a FWB so that was the most bizarre part. I expected more maturity from an MD in his 40s",
            "author": "clashingtaco",
            "id": "gp9ze6z",
            "parent_id": "t1_gp52ju6",
            "score": 1,
            "created_utc": 1614582864.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp4l7sm",
            "parent_id": "t1_gp4icyz",
            "score": 15,
            "created_utc": 1614489595.0,
            "replies": [
                {
                    "body": "yeah but I do not get it either, why can't they just google?",
                    "author": "StrangerOdd9606",
                    "id": "gp4opha",
                    "parent_id": "t1_gp4l7sm",
                    "score": 6,
                    "created_utc": 1614491000.0,
                    "replies": [
                        {
                            "body": "Bc they want to get off acting as if  they are rich and tricking girls. Then they show the pictures to their friends to pretend they actually fucked those girls.",
                            "author": "angelhair12",
                            "id": "gp4pldd",
                            "parent_id": "t1_gp4opha",
                            "score": 18,
                            "created_utc": 1614491357.0,
                            "replies": [
                                {
                                    "body": "you assume they have friends.",
                                    "author": "timrid",
                                    "id": "gp58bv6",
                                    "parent_id": "t1_gp4pldd",
                                    "score": 12,
                                    "created_utc": 1614499433.0,
                                    "replies": [
                                        {
                                            "body": "Or maybe they show girls on meet and greets to pretend that’s their competition.",
                                            "author": "angelhair12",
                                            "id": "gp5aehh",
                                            "parent_id": "t1_gp58bv6",
                                            "score": 6,
                                            "created_utc": 1614500355.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "😂🖤",
                                            "author": "angelhair12",
                                            "id": "gp5a82r",
                                            "parent_id": "t1_gp58bv6",
                                            "score": 5,
                                            "created_utc": 1614500279.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I don’t get photo collectors. What’s the point?\n\nI absolutely don't get it either. After starting an arrangement my current SB, I had txted her something like \"we got this far without me requesting a single pic\". Then she sent me 3 in bra/panties. Aside from what was on her profile, those are the only other photos of her I have. I don't have a single nude of her. When searching, I don't ask for \"extra pics\" bc I know literally every SB gets pic requests from 99.9% of the men she is in contact with when searching for a SD.",
            "author": "bluelunarmonkey",
            "id": "gp5k178",
            "parent_id": "t1_gp4icyz",
            "score": 9,
            "created_utc": 1614504979.0,
            "replies": []
        },
        {
            "body": "I’ve come across men who are interested in certain poses. They tend to be the ones into objectification and get off knowing the pictures they request are taken specifically for them",
            "author": null,
            "id": "gp5yrnk",
            "parent_id": "t1_gp4icyz",
            "score": 5,
            "created_utc": 1614514683.0,
            "replies": []
        },
        {
            "body": "The photo collectors are SO strange. I had a guy recently mention he had a foot fetish which I'm cool with. But then he sent me all these example pictures and demanded I pose like them so he can see if he likes my feet. I explained that plenty of girls are paid for that kind of service, I could send one simple photo but I'm not about to send him free jerk off fodder. So of course he says \"that's what girls with ugly feet usually say\" and got really nasty towards me. I never even said I had cute feet!",
            "author": "clashingtaco",
            "id": "gp9zwkb",
            "parent_id": "t1_gp4icyz",
            "score": 3,
            "created_utc": 1614583305.0,
            "replies": []
        },
        {
            "body": "Any reason you prefer sharing offsite vs a private picture? In case SA gets hacked?",
            "author": "new_sd_acct",
            "id": "gp4mw01",
            "parent_id": "t1_gp4l26p",
            "score": 7,
            "created_utc": 1614490272.0,
            "replies": [
                {
                    "body": "Exactly. I’ve got lots of public pictures published everywhere. I always send a published picture that way I have plausible deniability",
                    "author": "daddoms",
                    "id": "gp4n8yh",
                    "parent_id": "t1_gp4mw01",
                    "score": 6,
                    "created_utc": 1614490415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not sure about SA but on SDM you can have hidden photos to general users and they are only viewable by people you add to your favorites.",
            "author": null,
            "id": "gp4ni62",
            "parent_id": "t1_gp4l26p",
            "score": 3,
            "created_utc": 1614490522.0,
            "replies": [
                {
                    "body": "No one will be able to screenshot my face on a website. I work for a very conservative organization. I need plausible deniability. I don’t really need SA except as a convenience and nice search capabilities.",
                    "author": "daddoms",
                    "id": "gp4o7za",
                    "parent_id": "t1_gp4ni62",
                    "score": 8,
                    "created_utc": 1614490809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh boohoo, you keep running across 19 year olds that don't want to have sex with men in their 60s ☹️\n\nDo you even realise how absolutely ridiculous and insulting your comparison is? Finding an SB open to intimacy is a million times easier than finding a genuine SD who is not a psycho. Cry me a river",
            "author": "QuirkyComplex",
            "id": "gp5z2tz",
            "parent_id": "t1_gp5nrmf",
            "score": -9,
            "created_utc": 1614514921.0,
            "replies": [
                {
                    "body": "This. Is why myself(and two other legit sds I'm friends with will never use the sites). Polarizing and marginalizing to gain what? Totally opposite of what a 'community ' is for. Real Daddys have little challenge finding pots... now finding good ones...lol",
                    "author": "nucple2xplor",
                    "id": "gp6esyc",
                    "parent_id": "t1_gp5z2tz",
                    "score": 5,
                    "created_utc": 1614524977.0,
                    "replies": []
                },
                {
                    "body": ">> Oh boohoo, you keep running across 19 year olds that don't want to have sex with men in their 60s ☹️\n\nNice stereotyping\n\n>>Do you even realise how absolutely ridiculous and insulting your comparison is? Finding an SB open to intimacy is a million times easier than finding a genuine SD who is not a psycho. Cry me a river\n\nSame for the SDs. Do you know how many babies hop of the rails into crazy town once they settle in? Blackmail, entrapment, false rape accusations. Painting babies as perpetual martyrs are why they are so often taken advantage of. You need to stop spreading this BS and show that we have backbones. We have risks and they do too. Part of being in the bowl.",
                    "author": "SnooDucks4705",
                    "id": "gp63ug5",
                    "parent_id": "t1_gp5z2tz",
                    "score": 12,
                    "created_utc": 1614518746.0,
                    "replies": []
                },
                {
                    "body": "I can’t really claim to know exactly what you go through, but I can tell you I’ve had a terribly hard time finding a legitimate SB.\n\nI don’t think fighting about who has it worse really helps, we both go through shit. It’s kind of like when someone on r/twoxchromosomes points out that men are in fact assaulted too and the sub goes into a meltdown.",
                    "author": "throwawaysugar1980",
                    "id": "gp64a04",
                    "parent_id": "t1_gp5z2tz",
                    "score": 5,
                    "created_utc": 1614519070.0,
                    "replies": [
                        {
                            "body": ">I’ve had a terribly hard time finding a legitimate SB.\n\nI don't think finding a legitimate SB that you connect with is easy at all. Especially since most are in college so there is always that added risk of flakiness, rinsers, not to mention blackmail/extortion etc.\n\nAnd with the rise of the TikTok babies, these scams are only getting more and more popular thus saturating the bowl with more fake SDs and SBs and making it even more difficult for the genuine ones to find one another.\n\n>I don’t think fighting about who has it worse really helps\n\nYeah, my point was not about who has it better or worse, had he used a different example (such as TSD's unfortunate incident of being robbed at knife point) I would not have left the comment that I did. OP provided multiple scenarios showcasing just how bad the state of sugar is and his response was to cry about young girls not wanting to put out 🙄",
                            "author": "QuirkyComplex",
                            "id": "gp6gzle",
                            "parent_id": "t1_gp64a04",
                            "score": 1,
                            "created_utc": 1614525792.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's like you think empathy is a zero sum game. \n\nMost SBs aren't sugaring for survival, that I've come across. They're sugaring for extras in their life or to improve their financial position, primarily. OP doesn't describe a survival situation. So it isn't like the struggle of the SB is inherently more noble than SD's.",
                    "author": "OpenAirMarket901",
                    "id": "gp64jde",
                    "parent_id": "t1_gp5z2tz",
                    "score": 3,
                    "created_utc": 1614519263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This!  I have met a broad swath of less admirable ladies, and heard many true stories of \"vile men\" and one friend called them.  If you are in my area of NC, and you wanted this, I would happily buy you a drink and swap stories.  I am not currently looking, but that might change in the future.  Maybe take a break for a bit and come back to that web site when you feel it more?",
            "author": "NCtriadSD",
            "id": "gp68a0y",
            "parent_id": "t1_gp526i4",
            "score": 1,
            "created_utc": 1614521852.0,
            "replies": []
        },
        {
            "body": "You’re a man who has found sugar babies at clubs? Or you’re a sugar baby who found men to support you irl?",
            "author": "dinasaurrrr",
            "id": "gp9o24y",
            "parent_id": "t1_gp6d10z",
            "score": 1,
            "created_utc": 1614574141.0,
            "replies": []
        },
        {
            "body": "In OP’s case, given the “I work 35 hours a week and live at home so I can’t really test” I call bs. \n\nI just think sugaring might not be for her in a case like that.",
            "author": "throwawaysugar1980",
            "id": "gp74wap",
            "parent_id": "t1_gp6q8et",
            "score": 2,
            "created_utc": 1614534816.0,
            "replies": [
                {
                    "body": "The reason I sugar is for NSA, fun, I like older men and need the support financially. If sugaring is being an emotional support therapist on call 24hrs, 7 days a week for pennies to the dollar, than it's certainly not for me.",
                    "author": "True-Consequence3808",
                    "id": "gpa6ygk",
                    "parent_id": "t1_gp74wap",
                    "score": 2,
                    "created_utc": 1614589939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well she says she has no time to deal with communicating with a SD,  are you surprised?",
            "author": null,
            "id": "gp6cpu1",
            "parent_id": "t1_gp4lrei",
            "score": 2,
            "created_utc": 1614524117.0,
            "replies": [
                {
                    "body": "No, I said I don't have time to text 24/7 while working and having to sleep, let alone meets. When I started setting an alarm every 2.5 hours during the night to make sure he was responded to I realized things were way out of hand. (He had a weird sleeping schedule). Apparently every one else has this problem as well, so it's not just me.",
                    "author": "True-Consequence3808",
                    "id": "gpa6qub",
                    "parent_id": "t1_gp6cpu1",
                    "score": -1,
                    "created_utc": 1614589728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She says in the fifth sentence.  2 years.",
            "author": null,
            "id": "gp4nbrw",
            "parent_id": "t1_gp4lrei",
            "score": 1,
            "created_utc": 1614490446.0,
            "replies": []
        },
        {
            "body": "What exactly do you mean so I could better answer?",
            "author": "True-Consequence3808",
            "id": "gpa70l7",
            "parent_id": "t1_gpa3pdf",
            "score": 1,
            "created_utc": 1614589998.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gpcz8f2",
            "parent_id": "t1_gpcz8e1",
            "score": 1,
            "created_utc": 1614644239.0,
            "replies": []
        },
        {
            "body": "Yep. I’m not expecting constant texting, but this whole “it might take me 2 days to respond because I’m busy” thing really is a turn off. \n\nNo one is that busy, and frankly in the POT stage if you are that unresponsive I have to guess you aren’t actually serious about a relationship.",
            "author": "throwawaysugar1980",
            "id": "gp6s8im",
            "parent_id": "t1_gp6pxnv",
            "score": 6,
            "created_utc": 1614529579.0,
            "replies": []
        },
        {
            "body": "Men that want to cheat will always find a girl to participate. If one girl wouldn't the next girl would. I'm sick of the \" oh if she didn't seduce him it wouldn't have happened\" yes it would have it would just be with a different woman unfortunately.",
            "author": "lbseida",
            "id": "gp62ibr",
            "parent_id": "t1_gp5zc3z",
            "score": 19,
            "created_utc": 1614517726.0,
            "replies": [
                {
                    "body": "Oh I completely agree. I’ve never been the jealous type, he knows what he has at home and he’s a big boy to make the decision if he wants to lose it. Still sucks though honestly. I just personally wouldn’t want to feel at all responsible for causing another woman this kind of pain. Or knowing I was a part of why her kids ask where dad is.",
                    "author": null,
                    "id": "gp62xf8",
                    "parent_id": "t1_gp62ibr",
                    "score": 10,
                    "created_utc": 1614518049.0,
                    "replies": [
                        {
                            "body": "Yea it does i really feel for you and you'll come out on top of this stronger and better. I'm sure it hits a personal note for you and keeping your conscience clear is the best peace of mind.",
                            "author": "lbseida",
                            "id": "gp635v2",
                            "parent_id": "t1_gp62xf8",
                            "score": 4,
                            "created_utc": 1614518225.0,
                            "replies": [
                                {
                                    "body": "Not at all trying to insult women who do fool around with married men. That’s on the man, not them. I apologize if it came off that way. Trust me, there’s some married men I know that I would do some dirty things to given the chance 😂",
                                    "author": null,
                                    "id": "gp63ft0",
                                    "parent_id": "t1_gp635v2",
                                    "score": 7,
                                    "created_utc": 1614518437.0,
                                    "replies": [
                                        {
                                            "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
                                            "author": "lbseida",
                                            "id": "gp63uy6",
                                            "parent_id": "t1_gp63ft0",
                                            "score": 5,
                                            "created_utc": 1614518757.0,
                                            "replies": [
                                                {
                                                    "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                                                    "author": null,
                                                    "id": "gp640x8",
                                                    "parent_id": "t1_gp63uy6",
                                                    "score": 10,
                                                    "created_utc": 1614518882.0,
                                                    "replies": [
                                                        {
                                                            "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                                                            "author": "sucRoseToTheOccasion",
                                                            "id": "gpd79z9",
                                                            "parent_id": "t1_gp640x8",
                                                            "score": 1,
                                                            "created_utc": 1614648549.0,
                                                            "replies": [
                                                                {
                                                                    "body": "True. In that case you are very correct.",
                                                                    "author": null,
                                                                    "id": "gpd7s6s",
                                                                    "parent_id": "t1_gpd79z9",
                                                                    "score": 1,
                                                                    "created_utc": 1614648813.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp6qmvc",
            "parent_id": "t1_gp5zc3z",
            "score": 7,
            "created_utc": 1614529018.0,
            "replies": [
                {
                    "body": "Props to you. I hope you’re enjoying yourself now 😊",
                    "author": null,
                    "id": "gp6r7mu",
                    "parent_id": "t1_gp6qmvc",
                    "score": 4,
                    "created_utc": 1614529213.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gp6ulqj",
                            "parent_id": "t1_gp6r7mu",
                            "score": 5,
                            "created_utc": 1614530412.0,
                            "replies": [
                                {
                                    "body": "Haha thank you. I’m leaving a boring sex life and I’m looking to explore. I’m doing well and don’t need a man, unfortunately some are intimidated by that and eventually it leads to issues. So for now just fun and adventure it is",
                                    "author": null,
                                    "id": "gp6wq2k",
                                    "parent_id": "t1_gp6ulqj",
                                    "score": 3,
                                    "created_utc": 1614531370.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gp737u0",
                                            "parent_id": "t1_gp6wq2k",
                                            "score": 4,
                                            "created_utc": 1614534264.0,
                                            "replies": [
                                                {
                                                    "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                                                    "author": null,
                                                    "id": "gp755ms",
                                                    "parent_id": "t1_gp737u0",
                                                    "score": 3,
                                                    "created_utc": 1614534897.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah but I do not get it either, why can't they just google?",
            "author": "StrangerOdd9606",
            "id": "gp4opha",
            "parent_id": "t1_gp4l7sm",
            "score": 6,
            "created_utc": 1614491000.0,
            "replies": [
                {
                    "body": "Bc they want to get off acting as if  they are rich and tricking girls. Then they show the pictures to their friends to pretend they actually fucked those girls.",
                    "author": "angelhair12",
                    "id": "gp4pldd",
                    "parent_id": "t1_gp4opha",
                    "score": 18,
                    "created_utc": 1614491357.0,
                    "replies": [
                        {
                            "body": "you assume they have friends.",
                            "author": "timrid",
                            "id": "gp58bv6",
                            "parent_id": "t1_gp4pldd",
                            "score": 12,
                            "created_utc": 1614499433.0,
                            "replies": [
                                {
                                    "body": "Or maybe they show girls on meet and greets to pretend that’s their competition.",
                                    "author": "angelhair12",
                                    "id": "gp5aehh",
                                    "parent_id": "t1_gp58bv6",
                                    "score": 6,
                                    "created_utc": 1614500355.0,
                                    "replies": []
                                },
                                {
                                    "body": "😂🖤",
                                    "author": "angelhair12",
                                    "id": "gp5a82r",
                                    "parent_id": "t1_gp58bv6",
                                    "score": 5,
                                    "created_utc": 1614500279.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. I’ve got lots of public pictures published everywhere. I always send a published picture that way I have plausible deniability",
            "author": "daddoms",
            "id": "gp4n8yh",
            "parent_id": "t1_gp4mw01",
            "score": 6,
            "created_utc": 1614490415.0,
            "replies": []
        },
        {
            "body": "No one will be able to screenshot my face on a website. I work for a very conservative organization. I need plausible deniability. I don’t really need SA except as a convenience and nice search capabilities.",
            "author": "daddoms",
            "id": "gp4o7za",
            "parent_id": "t1_gp4ni62",
            "score": 8,
            "created_utc": 1614490809.0,
            "replies": []
        },
        {
            "body": "This. Is why myself(and two other legit sds I'm friends with will never use the sites). Polarizing and marginalizing to gain what? Totally opposite of what a 'community ' is for. Real Daddys have little challenge finding pots... now finding good ones...lol",
            "author": "nucple2xplor",
            "id": "gp6esyc",
            "parent_id": "t1_gp5z2tz",
            "score": 5,
            "created_utc": 1614524977.0,
            "replies": []
        },
        {
            "body": ">> Oh boohoo, you keep running across 19 year olds that don't want to have sex with men in their 60s ☹️\n\nNice stereotyping\n\n>>Do you even realise how absolutely ridiculous and insulting your comparison is? Finding an SB open to intimacy is a million times easier than finding a genuine SD who is not a psycho. Cry me a river\n\nSame for the SDs. Do you know how many babies hop of the rails into crazy town once they settle in? Blackmail, entrapment, false rape accusations. Painting babies as perpetual martyrs are why they are so often taken advantage of. You need to stop spreading this BS and show that we have backbones. We have risks and they do too. Part of being in the bowl.",
            "author": "SnooDucks4705",
            "id": "gp63ug5",
            "parent_id": "t1_gp5z2tz",
            "score": 12,
            "created_utc": 1614518746.0,
            "replies": []
        },
        {
            "body": "I can’t really claim to know exactly what you go through, but I can tell you I’ve had a terribly hard time finding a legitimate SB.\n\nI don’t think fighting about who has it worse really helps, we both go through shit. It’s kind of like when someone on r/twoxchromosomes points out that men are in fact assaulted too and the sub goes into a meltdown.",
            "author": "throwawaysugar1980",
            "id": "gp64a04",
            "parent_id": "t1_gp5z2tz",
            "score": 5,
            "created_utc": 1614519070.0,
            "replies": [
                {
                    "body": ">I’ve had a terribly hard time finding a legitimate SB.\n\nI don't think finding a legitimate SB that you connect with is easy at all. Especially since most are in college so there is always that added risk of flakiness, rinsers, not to mention blackmail/extortion etc.\n\nAnd with the rise of the TikTok babies, these scams are only getting more and more popular thus saturating the bowl with more fake SDs and SBs and making it even more difficult for the genuine ones to find one another.\n\n>I don’t think fighting about who has it worse really helps\n\nYeah, my point was not about who has it better or worse, had he used a different example (such as TSD's unfortunate incident of being robbed at knife point) I would not have left the comment that I did. OP provided multiple scenarios showcasing just how bad the state of sugar is and his response was to cry about young girls not wanting to put out 🙄",
                    "author": "QuirkyComplex",
                    "id": "gp6gzle",
                    "parent_id": "t1_gp64a04",
                    "score": 1,
                    "created_utc": 1614525792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's like you think empathy is a zero sum game. \n\nMost SBs aren't sugaring for survival, that I've come across. They're sugaring for extras in their life or to improve their financial position, primarily. OP doesn't describe a survival situation. So it isn't like the struggle of the SB is inherently more noble than SD's.",
            "author": "OpenAirMarket901",
            "id": "gp64jde",
            "parent_id": "t1_gp5z2tz",
            "score": 3,
            "created_utc": 1614519263.0,
            "replies": []
        },
        {
            "body": "The reason I sugar is for NSA, fun, I like older men and need the support financially. If sugaring is being an emotional support therapist on call 24hrs, 7 days a week for pennies to the dollar, than it's certainly not for me.",
            "author": "True-Consequence3808",
            "id": "gpa6ygk",
            "parent_id": "t1_gp74wap",
            "score": 2,
            "created_utc": 1614589939.0,
            "replies": []
        },
        {
            "body": "No, I said I don't have time to text 24/7 while working and having to sleep, let alone meets. When I started setting an alarm every 2.5 hours during the night to make sure he was responded to I realized things were way out of hand. (He had a weird sleeping schedule). Apparently every one else has this problem as well, so it's not just me.",
            "author": "True-Consequence3808",
            "id": "gpa6qub",
            "parent_id": "t1_gp6cpu1",
            "score": -1,
            "created_utc": 1614589728.0,
            "replies": []
        },
        {
            "body": "Oh I completely agree. I’ve never been the jealous type, he knows what he has at home and he’s a big boy to make the decision if he wants to lose it. Still sucks though honestly. I just personally wouldn’t want to feel at all responsible for causing another woman this kind of pain. Or knowing I was a part of why her kids ask where dad is.",
            "author": null,
            "id": "gp62xf8",
            "parent_id": "t1_gp62ibr",
            "score": 10,
            "created_utc": 1614518049.0,
            "replies": [
                {
                    "body": "Yea it does i really feel for you and you'll come out on top of this stronger and better. I'm sure it hits a personal note for you and keeping your conscience clear is the best peace of mind.",
                    "author": "lbseida",
                    "id": "gp635v2",
                    "parent_id": "t1_gp62xf8",
                    "score": 4,
                    "created_utc": 1614518225.0,
                    "replies": [
                        {
                            "body": "Not at all trying to insult women who do fool around with married men. That’s on the man, not them. I apologize if it came off that way. Trust me, there’s some married men I know that I would do some dirty things to given the chance 😂",
                            "author": null,
                            "id": "gp63ft0",
                            "parent_id": "t1_gp635v2",
                            "score": 7,
                            "created_utc": 1614518437.0,
                            "replies": [
                                {
                                    "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
                                    "author": "lbseida",
                                    "id": "gp63uy6",
                                    "parent_id": "t1_gp63ft0",
                                    "score": 5,
                                    "created_utc": 1614518757.0,
                                    "replies": [
                                        {
                                            "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                                            "author": null,
                                            "id": "gp640x8",
                                            "parent_id": "t1_gp63uy6",
                                            "score": 10,
                                            "created_utc": 1614518882.0,
                                            "replies": [
                                                {
                                                    "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                                                    "author": "sucRoseToTheOccasion",
                                                    "id": "gpd79z9",
                                                    "parent_id": "t1_gp640x8",
                                                    "score": 1,
                                                    "created_utc": 1614648549.0,
                                                    "replies": [
                                                        {
                                                            "body": "True. In that case you are very correct.",
                                                            "author": null,
                                                            "id": "gpd7s6s",
                                                            "parent_id": "t1_gpd79z9",
                                                            "score": 1,
                                                            "created_utc": 1614648813.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Props to you. I hope you’re enjoying yourself now 😊",
            "author": null,
            "id": "gp6r7mu",
            "parent_id": "t1_gp6qmvc",
            "score": 4,
            "created_utc": 1614529213.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp6ulqj",
                    "parent_id": "t1_gp6r7mu",
                    "score": 5,
                    "created_utc": 1614530412.0,
                    "replies": [
                        {
                            "body": "Haha thank you. I’m leaving a boring sex life and I’m looking to explore. I’m doing well and don’t need a man, unfortunately some are intimidated by that and eventually it leads to issues. So for now just fun and adventure it is",
                            "author": null,
                            "id": "gp6wq2k",
                            "parent_id": "t1_gp6ulqj",
                            "score": 3,
                            "created_utc": 1614531370.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gp737u0",
                                    "parent_id": "t1_gp6wq2k",
                                    "score": 4,
                                    "created_utc": 1614534264.0,
                                    "replies": [
                                        {
                                            "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                                            "author": null,
                                            "id": "gp755ms",
                                            "parent_id": "t1_gp737u0",
                                            "score": 3,
                                            "created_utc": 1614534897.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bc they want to get off acting as if  they are rich and tricking girls. Then they show the pictures to their friends to pretend they actually fucked those girls.",
            "author": "angelhair12",
            "id": "gp4pldd",
            "parent_id": "t1_gp4opha",
            "score": 18,
            "created_utc": 1614491357.0,
            "replies": [
                {
                    "body": "you assume they have friends.",
                    "author": "timrid",
                    "id": "gp58bv6",
                    "parent_id": "t1_gp4pldd",
                    "score": 12,
                    "created_utc": 1614499433.0,
                    "replies": [
                        {
                            "body": "Or maybe they show girls on meet and greets to pretend that’s their competition.",
                            "author": "angelhair12",
                            "id": "gp5aehh",
                            "parent_id": "t1_gp58bv6",
                            "score": 6,
                            "created_utc": 1614500355.0,
                            "replies": []
                        },
                        {
                            "body": "😂🖤",
                            "author": "angelhair12",
                            "id": "gp5a82r",
                            "parent_id": "t1_gp58bv6",
                            "score": 5,
                            "created_utc": 1614500279.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I’ve had a terribly hard time finding a legitimate SB.\n\nI don't think finding a legitimate SB that you connect with is easy at all. Especially since most are in college so there is always that added risk of flakiness, rinsers, not to mention blackmail/extortion etc.\n\nAnd with the rise of the TikTok babies, these scams are only getting more and more popular thus saturating the bowl with more fake SDs and SBs and making it even more difficult for the genuine ones to find one another.\n\n>I don’t think fighting about who has it worse really helps\n\nYeah, my point was not about who has it better or worse, had he used a different example (such as TSD's unfortunate incident of being robbed at knife point) I would not have left the comment that I did. OP provided multiple scenarios showcasing just how bad the state of sugar is and his response was to cry about young girls not wanting to put out 🙄",
            "author": "QuirkyComplex",
            "id": "gp6gzle",
            "parent_id": "t1_gp64a04",
            "score": 1,
            "created_utc": 1614525792.0,
            "replies": []
        },
        {
            "body": "Yea it does i really feel for you and you'll come out on top of this stronger and better. I'm sure it hits a personal note for you and keeping your conscience clear is the best peace of mind.",
            "author": "lbseida",
            "id": "gp635v2",
            "parent_id": "t1_gp62xf8",
            "score": 4,
            "created_utc": 1614518225.0,
            "replies": [
                {
                    "body": "Not at all trying to insult women who do fool around with married men. That’s on the man, not them. I apologize if it came off that way. Trust me, there’s some married men I know that I would do some dirty things to given the chance 😂",
                    "author": null,
                    "id": "gp63ft0",
                    "parent_id": "t1_gp635v2",
                    "score": 7,
                    "created_utc": 1614518437.0,
                    "replies": [
                        {
                            "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
                            "author": "lbseida",
                            "id": "gp63uy6",
                            "parent_id": "t1_gp63ft0",
                            "score": 5,
                            "created_utc": 1614518757.0,
                            "replies": [
                                {
                                    "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                                    "author": null,
                                    "id": "gp640x8",
                                    "parent_id": "t1_gp63uy6",
                                    "score": 10,
                                    "created_utc": 1614518882.0,
                                    "replies": [
                                        {
                                            "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                                            "author": "sucRoseToTheOccasion",
                                            "id": "gpd79z9",
                                            "parent_id": "t1_gp640x8",
                                            "score": 1,
                                            "created_utc": 1614648549.0,
                                            "replies": [
                                                {
                                                    "body": "True. In that case you are very correct.",
                                                    "author": null,
                                                    "id": "gpd7s6s",
                                                    "parent_id": "t1_gpd79z9",
                                                    "score": 1,
                                                    "created_utc": 1614648813.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp6ulqj",
            "parent_id": "t1_gp6r7mu",
            "score": 5,
            "created_utc": 1614530412.0,
            "replies": [
                {
                    "body": "Haha thank you. I’m leaving a boring sex life and I’m looking to explore. I’m doing well and don’t need a man, unfortunately some are intimidated by that and eventually it leads to issues. So for now just fun and adventure it is",
                    "author": null,
                    "id": "gp6wq2k",
                    "parent_id": "t1_gp6ulqj",
                    "score": 3,
                    "created_utc": 1614531370.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gp737u0",
                            "parent_id": "t1_gp6wq2k",
                            "score": 4,
                            "created_utc": 1614534264.0,
                            "replies": [
                                {
                                    "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                                    "author": null,
                                    "id": "gp755ms",
                                    "parent_id": "t1_gp737u0",
                                    "score": 3,
                                    "created_utc": 1614534897.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you assume they have friends.",
            "author": "timrid",
            "id": "gp58bv6",
            "parent_id": "t1_gp4pldd",
            "score": 12,
            "created_utc": 1614499433.0,
            "replies": [
                {
                    "body": "Or maybe they show girls on meet and greets to pretend that’s their competition.",
                    "author": "angelhair12",
                    "id": "gp5aehh",
                    "parent_id": "t1_gp58bv6",
                    "score": 6,
                    "created_utc": 1614500355.0,
                    "replies": []
                },
                {
                    "body": "😂🖤",
                    "author": "angelhair12",
                    "id": "gp5a82r",
                    "parent_id": "t1_gp58bv6",
                    "score": 5,
                    "created_utc": 1614500279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not at all trying to insult women who do fool around with married men. That’s on the man, not them. I apologize if it came off that way. Trust me, there’s some married men I know that I would do some dirty things to given the chance 😂",
            "author": null,
            "id": "gp63ft0",
            "parent_id": "t1_gp635v2",
            "score": 7,
            "created_utc": 1614518437.0,
            "replies": [
                {
                    "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
                    "author": "lbseida",
                    "id": "gp63uy6",
                    "parent_id": "t1_gp63ft0",
                    "score": 5,
                    "created_utc": 1614518757.0,
                    "replies": [
                        {
                            "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                            "author": null,
                            "id": "gp640x8",
                            "parent_id": "t1_gp63uy6",
                            "score": 10,
                            "created_utc": 1614518882.0,
                            "replies": [
                                {
                                    "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                                    "author": "sucRoseToTheOccasion",
                                    "id": "gpd79z9",
                                    "parent_id": "t1_gp640x8",
                                    "score": 1,
                                    "created_utc": 1614648549.0,
                                    "replies": [
                                        {
                                            "body": "True. In that case you are very correct.",
                                            "author": null,
                                            "id": "gpd7s6s",
                                            "parent_id": "t1_gpd79z9",
                                            "score": 1,
                                            "created_utc": 1614648813.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha thank you. I’m leaving a boring sex life and I’m looking to explore. I’m doing well and don’t need a man, unfortunately some are intimidated by that and eventually it leads to issues. So for now just fun and adventure it is",
            "author": null,
            "id": "gp6wq2k",
            "parent_id": "t1_gp6ulqj",
            "score": 3,
            "created_utc": 1614531370.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp737u0",
                    "parent_id": "t1_gp6wq2k",
                    "score": 4,
                    "created_utc": 1614534264.0,
                    "replies": [
                        {
                            "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                            "author": null,
                            "id": "gp755ms",
                            "parent_id": "t1_gp737u0",
                            "score": 3,
                            "created_utc": 1614534897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or maybe they show girls on meet and greets to pretend that’s their competition.",
            "author": "angelhair12",
            "id": "gp5aehh",
            "parent_id": "t1_gp58bv6",
            "score": 6,
            "created_utc": 1614500355.0,
            "replies": []
        },
        {
            "body": "😂🖤",
            "author": "angelhair12",
            "id": "gp5a82r",
            "parent_id": "t1_gp58bv6",
            "score": 5,
            "created_utc": 1614500279.0,
            "replies": []
        },
        {
            "body": "No worries doll. I just dislike the \"homewrecker\" narrative since it shifts the blame completely on the other woman. But at the same time I get your point. If I was in your position I would feel the same way. You get both points of view which is really refreshing ❤",
            "author": "lbseida",
            "id": "gp63uy6",
            "parent_id": "t1_gp63ft0",
            "score": 5,
            "created_utc": 1614518757.0,
            "replies": [
                {
                    "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
                    "author": null,
                    "id": "gp640x8",
                    "parent_id": "t1_gp63uy6",
                    "score": 10,
                    "created_utc": 1614518882.0,
                    "replies": [
                        {
                            "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                            "author": "sucRoseToTheOccasion",
                            "id": "gpd79z9",
                            "parent_id": "t1_gp640x8",
                            "score": 1,
                            "created_utc": 1614648549.0,
                            "replies": [
                                {
                                    "body": "True. In that case you are very correct.",
                                    "author": null,
                                    "id": "gpd7s6s",
                                    "parent_id": "t1_gpd79z9",
                                    "score": 1,
                                    "created_utc": 1614648813.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp737u0",
            "parent_id": "t1_gp6wq2k",
            "score": 4,
            "created_utc": 1614534264.0,
            "replies": [
                {
                    "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
                    "author": null,
                    "id": "gp755ms",
                    "parent_id": "t1_gp737u0",
                    "score": 3,
                    "created_utc": 1614534897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater. If it’s not you it’ll just be the next one he OR SHE finds. Girls suck too. Lol \nOn a positive note. I now have the opportunity to find myself a nice non monogamous booty call 😂. Gonna go live my best life.",
            "author": null,
            "id": "gp640x8",
            "parent_id": "t1_gp63uy6",
            "score": 10,
            "created_utc": 1614518882.0,
            "replies": [
                {
                    "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
                    "author": "sucRoseToTheOccasion",
                    "id": "gpd79z9",
                    "parent_id": "t1_gp640x8",
                    "score": 1,
                    "created_utc": 1614648549.0,
                    "replies": [
                        {
                            "body": "True. In that case you are very correct.",
                            "author": null,
                            "id": "gpd7s6s",
                            "parent_id": "t1_gpd79z9",
                            "score": 1,
                            "created_utc": 1614648813.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel like that’s the best set up. Prevents the needy attachment risk lol",
            "author": null,
            "id": "gp755ms",
            "parent_id": "t1_gp737u0",
            "score": 3,
            "created_utc": 1614534897.0,
            "replies": []
        },
        {
            "body": "> Nawh girl I don’t believe in the home wrecker thing at all either. There’s no stopping a cheater.\n\nthat's just not true.\n\nyes, a \"serial cheater\" like Tiger Woods, yes any one of those women didn't matter, so in that case, you are right.\n\nbut there are also affairs \"of the heart\" between a man and woman who are friends for other reasons (they work together, the two couples are close friends, etc) and in those cases, the woman has as much agency as the man, and possibly more if she is the one pushing the affair at the outset.\n\nthe blanket statement of \"blanket belief\" that you are making is not close to being true.",
            "author": "sucRoseToTheOccasion",
            "id": "gpd79z9",
            "parent_id": "t1_gp640x8",
            "score": 1,
            "created_utc": 1614648549.0,
            "replies": [
                {
                    "body": "True. In that case you are very correct.",
                    "author": null,
                    "id": "gpd7s6s",
                    "parent_id": "t1_gpd79z9",
                    "score": 1,
                    "created_utc": 1614648813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True. In that case you are very correct.",
            "author": null,
            "id": "gpd7s6s",
            "parent_id": "t1_gpd79z9",
            "score": 1,
            "created_utc": 1614648813.0,
            "replies": []
        }
    ]
}