{
    "title": "PSA: Why Us Daddies Are Dicks.",
    "post_id": "d13c4l",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/d13c4l/psa_why_us_daddies_are_dicks/",
    "author": "LoftDaddy",
    "body": "Okay, dicks may be a strong word. But probably accurate.\n\nIn civilian life, I am a generous, patient and kind person. I volunteer coach for local youth soccer, donate to charities and make sure my employees have a comfy life with a nice holiday bonus.\n\nIn the bowl, my walls are tall and generosity dries up when on the website. I'm put on a hard outer shell because my thoughtful tendencies get leveraged by nearly every single SB.\n\nIn the past **week** of searching for an arrangement, the following requests have resulted in 9/10 of local babies asking for money / favors **before meeting**:\n\n* Baby 1: Car payment was late ($290), needed it paid to make it to m&g. Sent proof of payment and verified via video chat. Didn't send money, declined to move forward.\n* Baby 2: Asked for ($80) funds to get 'presentable' for a m&g. Next.\n* Baby 3: Desperately needed money to avoid getting kicked out of her room rental ($600). Next.\n* Baby 4: Needed to borrow my truck or get help renting a moving vehicle so she could move back in with parents after being evicted ($100 estimated). No thank you.\n* Baby 5: Didn't ask for money, went to a nice lunch together at a local restaurant. **Looking good here!**\n* Baby 6: Was living behind a dumpster and needed ($350) for a weekly rental. Stunned... next.\n* Baby 7: Met for coffee, asked if I wanted to buy her and her girlfriend (whom hadn't been mentioned before this moment) some prepaid phones to talk and text me videos on. Thanks but no thanks.\n* Baby 8: Met for lunch, was told she would be platonic only, but needed someone to buy her a laptop and webcam setup to launch a cam girl business and was hoping I would be an investor for her. Did not bring prospectus. Next.\n* Baby 9: Was locked out of her room for not paying utility bills to her roommate, needed ($300) to get 'everything she owned in her life' back. Advised her to call the sheriff department. Then politely nexted.\n* Baby 10: Went well, local, amazing, and then dropped the bomb she needed a place to stay because her 'ex' was stalking her after she got an abortion without telling him. Not completely sure if it was a scam since she was just looking for a place to crash and never asked for cash. Probably playing the long game. Next.\n\nAs you can see, the bowl can turn a generous, nice person into a dick. If there is any lesson to this rant, it's that there might be a nice guy underneath the hard shell, just don't push for his generosity upfront and coax it out over time.\n\nThanks for reading, hope all of you lovely people are enjoying a nice weekend!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/d13c4l/psa_why_us_daddies_are_dicks/",
    "score": 194,
    "upvote_ratio": 0.91,
    "created_utc": 1567898694.0,
    "num_comments": 160,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Man, I think we all get the inappropriate $/gift requests, but your ratio is the worst I've ever seen!\n\nI have a slightly different way I think about things.  I am not a dick in real life, and I'm not a dick on Seeking.  But \"not being a dick\" does not require that you be stupid or a willing victim.  As soon as I get the inappropriate request, I next her.  I absolutely do not think I'm being a dick for that.  More importantly, after I next her, I do not get angry or rant, and it does not color the way I interact with my next SB -- at all.  Each SB gets treated with straightforward niceness, and often it stays that way.  For anyone who shows themselves as toxic, manipulators, scammers, etc., they get nexted, and I do my best never to think about it again.  Because I'm so immediate in acting whenever one of my lines is crossed, there's a chance I have, from time to time, next'ed a naive newbie who inadvertently gave toxic-SB signals, but I'm okay with that.  It's prolonged interactions with negative people that tends to bring me down and make me less nice, so I don't do it.",
            "author": "Azurecole",
            "id": "ezgs0a3",
            "parent_id": "t3_d13c4l",
            "score": 51,
            "created_utc": 1567900720.0,
            "replies": [
                {
                    "body": "in the last few months i've had the same experience\n\nlast year i was able to meet lots of wonderful ladies, found one, and had a long term thing then she moved away\n\ni came back in March and it's very much like the list above.",
                    "author": "anonymou555andWich",
                    "id": "ezh3wmb",
                    "parent_id": "t1_ezgs0a3",
                    "score": 4,
                    "created_utc": 1567905220.0,
                    "replies": []
                },
                {
                    "body": "That sounds like a healthy outlook. I think I'll have a prepared 'next' message and just send that and then block the number.",
                    "author": "LoftDaddy",
                    "id": "ezgseu1",
                    "parent_id": "t1_ezgs0a3",
                    "score": 2,
                    "created_utc": 1567900869.0,
                    "replies": []
                },
                {
                    "body": "Thank you for sharing this. I feel exactly the same",
                    "author": "Cybercoot43",
                    "id": "ezi3z08",
                    "parent_id": "t1_ezgs0a3",
                    "score": 2,
                    "created_utc": 1567920897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">was hoping I would be an investor for her. Did not bring prospectus. Next.\n\nOkay, that made me laugh. Did she offer a percentage of her earnings? What was the ROI?",
            "author": null,
            "id": "ezguxth",
            "parent_id": "t3_d13c4l",
            "score": 58,
            "created_utc": 1567901812.0,
            "replies": [
                {
                    "body": "I don't believe she was prepared to answer that without legal counsel present.",
                    "author": "LoftDaddy",
                    "id": "ezgvf0i",
                    "parent_id": "t1_ezguxth",
                    "score": 33,
                    "created_utc": 1567901992.0,
                    "replies": [
                        {
                            "body": "I got a nice chuckle out of this one. She probably would’ve brought Michael Avenatti should negotiations have progressed further",
                            "author": "Musiq_afficianado",
                            "id": "ezh0foa",
                            "parent_id": "t1_ezgvf0i",
                            "score": 12,
                            "created_utc": 1567903906.0,
                            "replies": []
                        },
                        {
                            "body": "Legal counsel to be funded out of investment capital.",
                            "author": "tra24602",
                            "id": "ezjaa3c",
                            "parent_id": "t1_ezgvf0i",
                            "score": 4,
                            "created_utc": 1567941356.0,
                            "replies": [
                                {
                                    "body": "Good call! This was certainly Series A funding.",
                                    "author": "LoftDaddy",
                                    "id": "ezk7r89",
                                    "parent_id": "t1_ezjaa3c",
                                    "score": 2,
                                    "created_utc": 1567956344.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This! In my head I imagined you genuinely hearing her out, or at least trying to, but getting nowherrrre!\n\nIs this the sugar bowl or shark tank?",
                    "author": "CrispyMann",
                    "id": "ezjmqk1",
                    "parent_id": "t1_ezguxth",
                    "score": 3,
                    "created_utc": 1567946993.0,
                    "replies": [
                        {
                            "body": "I need my own \"Shark Tank\" for every aspect of my life...",
                            "author": null,
                            "id": "ezjqw2y",
                            "parent_id": "t1_ezjmqk1",
                            "score": 2,
                            "created_utc": 1567948912.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was wondering that too.  free private sessions?  copies of videos of private sessions?  maybe watching live?\n\nbut, is it still \"platonic\" if you get to see her naked?",
                    "author": "joc13",
                    "id": "ezhnbry",
                    "parent_id": "t1_ezguxth",
                    "score": 4,
                    "created_utc": 1567912937.0,
                    "replies": [
                        {
                            "body": "Yes I’ll allow that 😜",
                            "author": "ruphun",
                            "id": "ezjl4fc",
                            "parent_id": "t1_ezhnbry",
                            "score": 3,
                            "created_utc": 1567946324.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Obviously we all know these people exist on SA. BUT, if you are running into these women consistently, what is your criteria when you are searching? \n\nAre you going for the youngest age or the prettiest face? Do you actually read their profile and find something that appeals to you?\n\nI have spoken with SDs mid 40s and up who have decided to tell me about their prior negative experience (never asked to know). All of them were chasing 18/19yr olds. \n\nI'm not judging, you do you (to all the SDs), but when you are looking so young you have to appreciate you are going to run into more of these scenarios. That isn't to suggest all young women this age are scammers, not at all. But they are the generation being fed by social media and we all have seen the type of bullshit influencers are spouting about what you can get for free. \n\nI personally don't engage with SDs profiles who have an age range seeking 18-22yr olds as I feel if they think they will have more in common with the younger generation, then they and I won't relate at all. Again, not judging, you like what you like.",
            "author": null,
            "id": "ezhwn6y",
            "parent_id": "t3_d13c4l",
            "score": 19,
            "created_utc": 1567917753.0,
            "replies": [
                {
                    "body": "Mostly 25-33 and I am 39 myself. I do not waste time with low effort profiles, might just be a sign of being an SD in the inland empire.",
                    "author": "LoftDaddy",
                    "id": "ezhy8my",
                    "parent_id": "t1_ezhwn6y",
                    "score": 5,
                    "created_utc": 1567918419.0,
                    "replies": [
                        {
                            "body": "That's such a shame that it is older women who should know better as they have had more experience in life. \n\nThe bowl is sadly becoming so diluted.",
                            "author": null,
                            "id": "ezi0c28",
                            "parent_id": "t1_ezhy8my",
                            "score": 3,
                            "created_utc": 1567919330.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ezjn10i",
                                    "parent_id": "t1_ezi0c28",
                                    "score": 1,
                                    "created_utc": 1567947114.0,
                                    "replies": [
                                        {
                                            "body": "Mind blown.\n\nTo go from trying to manipulate the money out of you (by way of showing a lack of professionalism and dedication to her business), to then saying it is a requirement for meeting.\n\nI just don't understand the thought process. \n\nI have never been to the States but I haven't experienced at least half of the things I read here being based in Asia.",
                                            "author": null,
                                            "id": "ezjo7cj",
                                            "parent_id": "t1_ezjn10i",
                                            "score": 2,
                                            "created_utc": 1567947599.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow!! I am so thankful. Thankful I don't do this to survive or have this kind of drama in my life. 🥵\n\nI never expect anything from a POT other than to show up on time, cover the drink/coffee/meal, and not try to drug or molest me (at least without consent).😅\n\nThat said, I like to think the POTs who ghost me for something they think is a better match end up with women like these. Probably not kosher, but in my fantasy world, I'm satisfied. 😏",
            "author": "joluna813",
            "id": "ezhdwxy",
            "parent_id": "t3_d13c4l",
            "score": 16,
            "created_utc": 1567909072.0,
            "replies": [
                {
                    "body": "Ok, taking notes... do NOT molest or drug. \n\nIn all seriousness, I’m sorry if any of that did happen to you.",
                    "author": "LoftDaddy",
                    "id": "ezhely9",
                    "parent_id": "t1_ezhdwxy",
                    "score": 7,
                    "created_utc": 1567909342.0,
                    "replies": [
                        {
                            "body": "Well, unless that's her kink in which case molest and drug away! \n\nI've been lucky enough that I've not had any super horrible experiences. Bad, yes, but nothing my therapist can't handle 😉\n\nThe way I see it, we encounter the trash before the treasure on both sides. The input you've received so far sounds reasonable, but it sounds like you've been through this rodeo before. It is hard sometimes not to get completely bitter, but I just remember the amazing experiences I've had and the ex-sds I'm still friends with, and I keep in mind that this is what I signed up for. It's worth it for now 😊💜",
                            "author": "joluna813",
                            "id": "ezhfhfj",
                            "parent_id": "t1_ezhely9",
                            "score": 5,
                            "created_utc": 1567909682.0,
                            "replies": [
                                {
                                    "body": "Unfortunately those kinks aren't so common!",
                                    "author": "YesToAdventure",
                                    "id": "ezjmva3",
                                    "parent_id": "t1_ezhfhfj",
                                    "score": 2,
                                    "created_utc": 1567947048.0,
                                    "replies": [
                                        {
                                            "body": "True. That's what makes us kinky babies a rarity and even more precious 😉😁😆",
                                            "author": "joluna813",
                                            "id": "ezjnpx8",
                                            "parent_id": "t1_ezjmva3",
                                            "score": 3,
                                            "created_utc": 1567947394.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ezjopkv",
                                                    "parent_id": "t1_ezjnpx8",
                                                    "score": 3,
                                                    "created_utc": 1567947800.0,
                                                    "replies": [
                                                        {
                                                            "body": "😅",
                                                            "author": "joluna813",
                                                            "id": "ezjpe45",
                                                            "parent_id": "t1_ezjopkv",
                                                            "score": 2,
                                                            "created_utc": 1567948169.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have had similar experiences. It does make you question everything, everything. Even more so then my business career/experience. But under all this you do find that one gem (then again, like I said, I question everything)",
            "author": "20bagger",
            "id": "ezgorev",
            "parent_id": "t3_d13c4l",
            "score": 21,
            "created_utc": 1567899500.0,
            "replies": []
        },
        {
            "body": "Screen harder. You seem to be dunking into the worst of the lot.",
            "author": null,
            "id": "ezgxm13",
            "parent_id": "t3_d13c4l",
            "score": 16,
            "created_utc": 1567902828.0,
            "replies": [
                {
                    "body": "This",
                    "author": "tankbinding",
                    "id": "ezh9xve",
                    "parent_id": "t1_ezgxm13",
                    "score": 5,
                    "created_utc": 1567907545.0,
                    "replies": []
                },
                {
                    "body": "it really sounds like it. Maybe his profile is lacking or he doesn't read theirs prior to talking. Or IDK maybe the Babies start conversations with \"I live behind a dumpster, please give  me money\" in which case there's nothing he can do to stop those messages from popping into his DMs, just NEXT them",
                    "author": null,
                    "id": "ezkaitb",
                    "parent_id": "t1_ezgxm13",
                    "score": 4,
                    "created_utc": 1567957528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "After reading lots of the comments... Um.. guys and girls... Desperate women turn to the sugar bowl, that's the majority, imo.  Sometimes i even help out the desperate souls, but they definitely are not sugar material.  But even being nice to a desperate soul usually ends up badly.  Just gotta say no, like you have done.  The minority are good potential, and a minority of them are actually good in the long run.",
            "author": "stark_emerson",
            "id": "ezh8biu",
            "parent_id": "t3_d13c4l",
            "score": 6,
            "created_utc": 1567906915.0,
            "replies": []
        },
        {
            "body": "I'd define myself the same way the OP does. However, I've had some wonderful relationships in my 6 years in the bowl. It take time patience and a thick skin. In 60+ M&Gs over the years, there's not been a single case where an advance payment, or payment for the M&G has ever worked out. I live in a conservative Asian country where the SD:SB ratio is roughly equal. but I've never had a problem finding the right person and am happy to say no to the kin of requests the OP has got.",
            "author": "Dean_46",
            "id": "ezhs2u0",
            "parent_id": "t3_d13c4l",
            "score": 6,
            "created_utc": 1567915251.0,
            "replies": []
        },
        {
            "body": " At first I had to make sure I wasn't reading an old journal entry of mine.\n\nSadly, I've been here, done that, with WORSE results - some I actually gave money to.\n\nThousands of dollars gone to single moms, struggling college kids and the odd person just trying to get by.\n\n100% of the time I was rinsed. The college girl who became insanely busy the second the rent check cleared but she must of forgot we were connected on social because her nightly partying told a different story.\n\nOr the single mom who gave me a hard luck story about not being to afford her kids birth certificate or their own place only to be told after that payment was done that she scams dudes on SA for money.\n\nGood times and hard lessons.\n\nThe biggest thing I took away from it is I couldn't control their situation but I could control mine so I started targeting old women (post college), when they asked for money immediately or presented their life as a dumpster fire - I passed and moved on quickly.\n\nAs a result I find myself with more single moms and less college aged women. For some reason, despite being on every social platform known to man + a few others, college age women seem to have forgotten how to respond to text, send a selfie (non nude of course to prove their real and I'm not being catfished - btw I already know they are all real due to social media, I just want to see if the girl will send the photo or if she treats my text and request like a chore).\n\nAt the end of the day I could drive myself nuts trying to figure why people act the way they do. It's a one sided guess and to be fair a lot of these women are in a place in their life where they are doing anything to survive.\n\nAnd finally this - my current SB is one who hit me up back then and needed $200 to help her move. She came over, we had fun and I thought that was the end of it. Short story long 3 months later she's moved back into town, it's some of the best and most connected sex of my life, and we might actually turn this into a SBF/SGF situation.\n\nEvery rose has its thorn type shit huh?\n\nGood luck to you sir, I feel your pain and hopefully with some slight adjustments better days are ahead!",
            "author": "TexasSD",
            "id": "ezkdcbd",
            "parent_id": "t3_d13c4l",
            "score": 6,
            "created_utc": 1567958585.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezgxrhh",
            "parent_id": "t3_d13c4l",
            "score": 16,
            "created_utc": 1567902885.0,
            "replies": [
                {
                    "body": "This is what I was thinking.\n\nIt really makes ‘us’ look bad as a whole. And while  I prefer to think of myself as being on a different level than this, it doesn’t change that a POT may have some SD PTSD based on these awful experiences. It fucks it up for those of us who are real and genuine. Such a shame.",
                    "author": "oh_sugah",
                    "id": "ezhget9",
                    "parent_id": "t1_ezgxrhh",
                    "score": 16,
                    "created_utc": 1567910032.0,
                    "replies": [
                        {
                            "body": "this is similar to what I think when we hear stories of really asshole guys.  they set the women on edge so they learn not to trust any guys, but they also help all the good guys look even better once someone does get to know us.",
                            "author": "joc13",
                            "id": "ezho7my",
                            "parent_id": "t1_ezhget9",
                            "score": 4,
                            "created_utc": 1567913352.0,
                            "replies": []
                        },
                        {
                            "body": "I was thinking the same.",
                            "author": "RealEarthAngel",
                            "id": "ezmdd9b",
                            "parent_id": "t1_ezhget9",
                            "score": 2,
                            "created_utc": 1567990339.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not about looking bad, just that there are reasons some of us SDs have a harder shell. It certainly allows the gems to shine when the right one eventually comes along.",
                    "author": "LoftDaddy",
                    "id": "ezgybqk",
                    "parent_id": "t1_ezgxrhh",
                    "score": 5,
                    "created_utc": 1567903102.0,
                    "replies": []
                },
                {
                    "body": "yeah this is embaarrrasssssinngggg. One M&G daddy told me a POT SB had asked for $40 to go to the dentist before meeting. 1) dentists don't cost that much and 2) I would never dare ask that. I've found daddies are willing to shower me with sugar the more financially independent I am. So I try to keep the money discussion to a minimum, only absolutely necessary conversations about it (obv to establish ppm or allowance). Then be a normal girlfriend and not bring it up all the damn time!",
                    "author": null,
                    "id": "ezk9won",
                    "parent_id": "t1_ezgxrhh",
                    "score": 2,
                    "created_utc": 1567957291.0,
                    "replies": [
                        {
                            "body": "without dental insurance dentists cost far more than 40 for a simple teeth cleaning at least in new york",
                            "author": null,
                            "id": "f0k1ufj",
                            "parent_id": "t1_ezk9won",
                            "score": 1,
                            "created_utc": 1568668242.0,
                            "replies": [
                                {
                                    "body": "another example of why it was an obvious lie! gross!",
                                    "author": null,
                                    "id": "f0ksft7",
                                    "parent_id": "t1_f0k1ufj",
                                    "score": 1,
                                    "created_utc": 1568686902.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, so many in a short time! You have a magnetic 🧲 personality. You are not a dick btw. You have somehow been connecting with bottom feeders. You will find a great SB, and like the perfect golf swing, will forget all the bad ones.",
            "author": "SDforreal",
            "id": "ezgpxji",
            "parent_id": "t3_d13c4l",
            "score": 14,
            "created_utc": 1567899941.0,
            "replies": []
        },
        {
            "body": "I have an ex-SB that I would see in city X that was OK but sometimes unreliable.  A few weeks after it ended she was unable to make rent and I helped.  Then it happened again.  Can she at least suggest she'll fly over to see me? ... In the meantime, I can clearly see she has a vanilla boyfriend who is 10 years older than her.  Can't he help?",
            "author": "mtncityguy",
            "id": "ezgpaz3",
            "parent_id": "t3_d13c4l",
            "score": 11,
            "created_utc": 1567899711.0,
            "replies": [
                {
                    "body": "Maybe she needs the help and maybe not.  Probably she's just milking you a little bit.  Time to just cut her off.  \n\nIf it ends amicably, then I normally keep the allowance going for a couple months (if I ended it).  Or help a couple times (if she ended it).\n\nBut, I think there comes a time when you just say no.",
                    "author": "duckydee543",
                    "id": "ezhqjfu",
                    "parent_id": "t1_ezgpaz3",
                    "score": 9,
                    "created_utc": 1567914480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was thinking about something very like this recently. I've built a solid business, become well-off myself, and now my goal is to help a lot of my key people grow their wealth as well. And I try to be generous to all those around me.\n\nBut when you're generous, people invariably see that and start taking advantage of you. Not always in huge ways, but it definitely happens. And others don't start out trying to take advantage of you, but they need help and you help them, and then they hate to admit they needed help, so they kind of shit on you over time. \n\nYou want to try to stay generous and caring, but over time, you start second-guessing anyone who says they need help.  It can definitely contribute to a hard outer shell.",
            "author": "AvgNxDrNeighbor",
            "id": "ezgvzw1",
            "parent_id": "t3_d13c4l",
            "score": 8,
            "created_utc": 1567902212.0,
            "replies": []
        },
        {
            "body": "Is your profile giving these girls the vibe that you might be a good target for a rinse (in any possible way ) ???",
            "author": "shamloo77",
            "id": "ezhip7y",
            "parent_id": "t3_d13c4l",
            "score": 4,
            "created_utc": 1567910907.0,
            "replies": []
        },
        {
            "body": "Good god I am so sorry. \n\nIt's wild how SA was created for people looking for geniune SRs- but on both sides everyone spends 90% of their time wading through these.",
            "author": "Gremlin_baby",
            "id": "ezhusqk",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567916854.0,
            "replies": []
        },
        {
            "body": "I follow a sugar baby Facebook group and the difference between that group and this forum is astounding. There are sooooo many nasty and entitled opinions on there. \n\nLike the norm to them is that you expect money upfront before meeting, and what some of these girls are charging for ppm... with the way they look and carry themselves I’m really shocked that they have any luck at all. All the same, a lot of new babies join that group and are given really shitty advice and expectations. It’s kind of sad, if you mention having feelings for your SD, most of them laugh at you or treat you as naive. What an unfulfilled existence.",
            "author": "kirathekira",
            "id": "ezhkbf6",
            "parent_id": "t3_d13c4l",
            "score": 9,
            "created_utc": 1567911599.0,
            "replies": [
                {
                    "body": "I’d take anything you read on that FB group (or anywhere on the internet for that matter) with a big grain of salt. I’m sure there’s plenty of exaggerations, self-promotion, and outright lying in these social media groups.",
                    "author": "sd_90210",
                    "id": "ezjib1s",
                    "parent_id": "t1_ezhkbf6",
                    "score": 3,
                    "created_utc": 1567945111.0,
                    "replies": []
                },
                {
                    "body": "Let me guess. There's no SD's in the Facebook group?",
                    "author": "McNihil_88",
                    "id": "ezi37jk",
                    "parent_id": "t1_ezhkbf6",
                    "score": 0,
                    "created_utc": 1567920563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its amazing the number of girls who are late on their phone bill and will gladly meet me after I have sent them the money to pay the bill.",
            "author": "sidecar_ride",
            "id": "ezh3zyd",
            "parent_id": "t3_d13c4l",
            "score": 6,
            "created_utc": 1567905255.0,
            "replies": []
        },
        {
            "body": "Huh. Maybe men really have feelings after all?",
            "author": null,
            "id": "ezgvipl",
            "parent_id": "t3_d13c4l",
            "score": 6,
            "created_utc": 1567902030.0,
            "replies": [
                {
                    "body": "Shhhhhhh. Don't tell anyone!",
                    "author": "LoftDaddy",
                    "id": "ezgwgfb",
                    "parent_id": "t1_ezgvipl",
                    "score": 5,
                    "created_utc": 1567902385.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezgu7x0",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567901550.0,
            "replies": [
                {
                    "body": "Sure thing, Southern California (inland area, outside of Los Angeles) and targeting 21-33 age range.",
                    "author": "LoftDaddy",
                    "id": "ezguxo2",
                    "parent_id": "t1_ezgu7x0",
                    "score": 6,
                    "created_utc": 1567901810.0,
                    "replies": [
                        {
                            "body": "I’m surprised, from the post, I figured 18-25. I’m sorry you’re dealing with such scummy people. There really are great SB’s out there and I hope you find yours.",
                            "author": "dstoffers",
                            "id": "ezgx5ey",
                            "parent_id": "t1_ezguxo2",
                            "score": 3,
                            "created_utc": 1567902654.0,
                            "replies": []
                        },
                        {
                            "body": "Your post is a reason I can’t get myself to sign up again. I live in SoCal and find the other bad end of the stick. These ladies makes everyone look bad.",
                            "author": "misskansast",
                            "id": "ezi4jlg",
                            "parent_id": "t1_ezguxo2",
                            "score": 2,
                            "created_utc": 1567921153.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can’t stop re-reading baby #6. Oscar the Grouch ?",
            "author": "YourExoticBabe",
            "id": "ezhlzc9",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567912325.0,
            "replies": [
                {
                    "body": "Oof. Yeah. I got her the contact info of several shelters but had to block her after that.",
                    "author": "LoftDaddy",
                    "id": "ezhmgh9",
                    "parent_id": "t1_ezhlzc9",
                    "score": 2,
                    "created_utc": 1567912534.0,
                    "replies": [
                        {
                            "body": "Well that was actually very nice of you.",
                            "author": "YourExoticBabe",
                            "id": "ezhmpzd",
                            "parent_id": "t1_ezhmgh9",
                            "score": 1,
                            "created_utc": 1567912655.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would suggest getting more in depth with the ladies you are interested. See where they see themselves in a year and how they plan on getting there. More mature and established ladies who know what they want. It sucks to read this and it only runs it for future SB. I wish you the best and send good and positive vibes! Goodluck",
            "author": "RosseBoss",
            "id": "ezhmuv6",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567912716.0,
            "replies": []
        },
        {
            "body": "I love this a sight on how the sugar daddy feels.",
            "author": "KingTimberlake",
            "id": "ezi2xl6",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567920437.0,
            "replies": []
        },
        {
            "body": "I think results are mixed for both sides. Im a student, work, and pay for my own apartment. A potential SD told me he would prefer I didn't work and was more dependent on him for an income. Some SDs want a SB that will be very dependent on them. I declined, because I will take care of myself and a SD is a side thing.",
            "author": "MaleficentWindrunner",
            "id": "ezjve7r",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567950933.0,
            "replies": []
        },
        {
            "body": "Bro. You’re doing something wrong.",
            "author": "karebareitall",
            "id": "ezkq8iw",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567964715.0,
            "replies": [
                {
                    "body": "I'm sure I am, but I also am seeing other SDs having similar ratios / success in their replies and DMs. I am not complaining, just sharing how experiences shape the attitudes of an SD when searching for a POT and why we come across as cold or next-ing.",
                    "author": "LoftDaddy",
                    "id": "ezkrlke",
                    "parent_id": "t1_ezkq8iw",
                    "score": 2,
                    "created_utc": 1567965379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This seems to me more to be a screening problem than an SA problem. Putting up some strong boundaries for nexting and realizing that this lifestyle is a draw for those who might be desperate (even if they don’t belong) is really not that hard to figure out. I have had many  daddies deal with this stuff and be able to respectfully tell the difference between the rinsers and the real ones. I think it simply takes a certain amount of maturity to realize it’s part of the process, rather than projecting it onto those who are actually worth it (who, will likely do no less than discuss their upcoming needs for allowance/ppm, and at the least ask to be compensated for their travel). I would argue that there are just as many salt or Splenda experiences here that make us SBs have to ask these basic questions, that equally do not have to be responded with anything but a respectful answer.",
            "author": "Misssjackiee",
            "id": "ezijkv5",
            "parent_id": "t3_d13c4l",
            "score": 7,
            "created_utc": 1567928200.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ezgqnx9",
            "parent_id": "t3_d13c4l",
            "score": 8,
            "created_utc": 1567900217.0,
            "replies": [
                {
                    "body": "That seems very reasonable to me and I wouldn't hesitate to offer if I didn't pick a place close to a POT or if there was something like valet. If an SD recommends a place like that and doesn't happily pay, consider that a 'freebie' red flag as to how the arrangement would unfold.",
                    "author": "LoftDaddy",
                    "id": "ezgxuhm",
                    "parent_id": "t1_ezgqnx9",
                    "score": 13,
                    "created_utc": 1567902917.0,
                    "replies": []
                },
                {
                    "body": "Baby #1 was not asking merely for a small thing like Uber or valet money.\n\nBaby #2 was not asking merely for a small thing like Uber or valet money.\n\nBaby #3 was not asking merely for a small thing like Uber or valet money.\n\nSnap quiz: what can be said about Baby #4, Baby #6, Baby #7, Baby #8, Baby #9, and Baby #10?",
                    "author": "highfructoseSD",
                    "id": "ezhcygs",
                    "parent_id": "t1_ezgqnx9",
                    "score": 6,
                    "created_utc": 1567908704.0,
                    "replies": [
                        {
                            "body": "You got me, what is that?",
                            "author": "LoftDaddy",
                            "id": "ezkg8xz",
                            "parent_id": "t1_ezhcygs",
                            "score": 2,
                            "created_utc": 1567959816.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "i'll uber once we are actually in an arrangement\n\nbut seldom for a meet",
                    "author": "anonymou555andWich",
                    "id": "ezh426v",
                    "parent_id": "t1_ezgqnx9",
                    "score": -1,
                    "created_utc": 1567905277.0,
                    "replies": []
                },
                {
                    "body": "Exactly. This is how the insecure male ruling class try to guilt us out of our worth. You never have a *thing* to apologize for, baby, don't let these man-children tell you otherwise. Fr.",
                    "author": null,
                    "id": "ezgz2h7",
                    "parent_id": "t1_ezgqnx9",
                    "score": -3,
                    "created_utc": 1567903383.0,
                    "replies": [
                        {
                            "body": ":-)  :-)  :-)  smile, the OP never ever asked for an apology from any of the SBs  :-)  :-)  :-)",
                            "author": "highfructoseSD",
                            "id": "ezhd4jm",
                            "parent_id": "t1_ezgz2h7",
                            "score": 6,
                            "created_utc": 1567908768.0,
                            "replies": []
                        },
                        {
                            "body": "A real queen never has to let a man know her worth. He recognizes it by her personality, her actions and the way she treats everyone.",
                            "author": "ruphun",
                            "id": "ezjo49z",
                            "parent_id": "t1_ezgz2h7",
                            "score": 2,
                            "created_utc": 1567947564.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've gone through this much in a **day**. 🤣🤣🤣 \n\nNo need for it to make me a dick though. It just is what it is... comes with the territory.",
            "author": "GalaxyQuote",
            "id": "ezgyh4h",
            "parent_id": "t3_d13c4l",
            "score": 7,
            "created_utc": 1567903159.0,
            "replies": [
                {
                    "body": "Good perspective, I guess I figured since I filter out so many within the SA message part of the process that there would be better success. Guess it will be a numbers game!",
                    "author": "LoftDaddy",
                    "id": "ezgyvin",
                    "parent_id": "t1_ezgyh4h",
                    "score": 2,
                    "created_utc": 1567903311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are not alone. A POT SB just asked me for $200 for a dinner to see if we get along. It’s easy to start to put your guard up. Enjoyed the prospectus joke. I guess you just have to laugh at this stuff.",
            "author": "Janhammerfan",
            "id": "ezhffwl",
            "parent_id": "t3_d13c4l",
            "score": 6,
            "created_utc": 1567909665.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezj6vhb",
                    "parent_id": "t1_ezhffwl",
                    "score": 5,
                    "created_utc": 1567939603.0,
                    "replies": [
                        {
                            "body": "I agree entirely.",
                            "author": "RealEarthAngel",
                            "id": "ezn3wpi",
                            "parent_id": "t1_ezj6vhb",
                            "score": 2,
                            "created_utc": 1568000564.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I like your attitude!! :)",
                    "author": "PriusMillionaire777",
                    "id": "ezi4qqz",
                    "parent_id": "t1_ezhffwl",
                    "score": 1,
                    "created_utc": 1567921238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WOW! Guys on SA have it harder than I thought. Out of curiosity how old are you and what is your usual age range ?",
            "author": "Liza6077",
            "id": "ezh13hj",
            "parent_id": "t3_d13c4l",
            "score": 5,
            "created_utc": 1567904156.0,
            "replies": [
                {
                    "body": "21-33, but under 25 I don’t approach unless the profile is well written and obvious effort is presented. I’m 39.",
                    "author": "LoftDaddy",
                    "id": "ezh1exh",
                    "parent_id": "t1_ezh13hj",
                    "score": 7,
                    "created_utc": 1567904274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really can’t stand sugar babies like this because it makes it more difficult for sugar babies that are honest and reliable. I know SD’s usually don’t prefer Sugar babies between the ages of 30-40 but “women” or girls under 30 usually have not learned budgeting, still take part in frivolous spending, bad credit and still trying to get themselves together in life. They may not have the work experience or on a career path where they can make at least half way decent income. Sugaring is not supposed to be a main source of income unless you get married to your sugar daddy. It’s supposed to ease your financial burdens, extra income to pamper yourself, and to enjoy the luxuries in life. Some women are bums. They have no financial goals or life direction. You can give them all the money in the world and they will find a way to fuck it up somehow.",
            "author": "liliflower85",
            "id": "ezhmknf",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567912585.0,
            "replies": []
        },
        {
            "body": "Try going after girls who are not in the teen and early 20s age range and who have legit jobs. Your experience might change.",
            "author": "lakoreanita",
            "id": "ezjyoes",
            "parent_id": "t3_d13c4l",
            "score": 5,
            "created_utc": 1567952299.0,
            "replies": [
                {
                    "body": "My range is 21-33, usually 25+. I’m 39. \n\nOne on the list was my age within a year. \n\nUnfortunately I think it is more of a sign of my area than anything else.",
                    "author": "LoftDaddy",
                    "id": "ezk7ydq",
                    "parent_id": "t1_ezjyoes",
                    "score": 4,
                    "created_utc": 1567956440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy crap! I am a sb and I have to say I am sorry!! I really cannot fathom the nerve these chics have.  I really am I disbelief and feel for you. There will be a precious and rare gem in there but apparently you need dig some more and examine a bit closer before taking them for a fitting over something consumable. Did you by chance take a leak in karma or Wade's Cheerios on accident? Sounds like you are getting the bottom of the bottom. Experiment Suggestion: Pick 2 chics that are the complete opposite of what you normally go for and see if you have the same outcome??",
            "author": "times_passing_by",
            "id": "ezgxnd3",
            "parent_id": "t3_d13c4l",
            "score": 7,
            "created_utc": 1567902842.0,
            "replies": [
                {
                    "body": "Honestly I did. One on the list above is actually a year older than me. Same outcome.",
                    "author": "LoftDaddy",
                    "id": "ezgy51h",
                    "parent_id": "t1_ezgxnd3",
                    "score": 1,
                    "created_utc": 1567903030.0,
                    "replies": [
                        {
                            "body": "Well that blew my theory right out the window.",
                            "author": "times_passing_by",
                            "id": "ezgyeaf",
                            "parent_id": "t1_ezgy51h",
                            "score": 2,
                            "created_utc": 1567903129.0,
                            "replies": []
                        },
                        {
                            "body": "I was hoping it was the one that went well.. LOL",
                            "author": "times_passing_by",
                            "id": "ezgyi2y",
                            "parent_id": "t1_ezgy51h",
                            "score": 1,
                            "created_utc": 1567903169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where are you located? I've never had anything close to that sort of barage.",
            "author": "tenmillionplus",
            "id": "ezgr7pd",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567900419.0,
            "replies": [
                {
                    "body": "Southern California, inland empire",
                    "author": "LoftDaddy",
                    "id": "ezkg43t",
                    "parent_id": "t1_ezgr7pd",
                    "score": 2,
                    "created_utc": 1567959758.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Jeez that’s annoying. Why do all the bad ones gravitate towards you? 😂",
            "author": null,
            "id": "ezh9kyw",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567907400.0,
            "replies": [
                {
                    "body": "I don’t think I am a special case, just not a great area. Wanted to share what the other side goes through if it explains why we have a reaction to getting asked for something upfront because sometimes us SDs are come across as heartless dicks.",
                    "author": "LoftDaddy",
                    "id": "ezkft0h",
                    "parent_id": "t1_ezh9kyw",
                    "score": 2,
                    "created_utc": 1567959629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where are you meeting these women from?",
            "author": "travelingsole",
            "id": "ezhp66x",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567913805.0,
            "replies": [
                {
                    "body": "All from Seeking.com",
                    "author": "LoftDaddy",
                    "id": "ezhr1gx",
                    "parent_id": "t1_ezhp66x",
                    "score": 2,
                    "created_utc": 1567914725.0,
                    "replies": [
                        {
                            "body": "sent you a message!",
                            "author": "travelingsole",
                            "id": "ezhr8hg",
                            "parent_id": "t1_ezhr1gx",
                            "score": 2,
                            "created_utc": 1567914821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So honestly, for someone who’s looking for a POT, what is the best policy? Cause it seems for the most part for SBs the advice is to not give any type of sexual favors for free but at the same time I could see why it’s frustrating to go in these dates with women asking for cash up front without even knowing them. \n\nI’ve been curious about this but the more I read about it the more it seems like a drag (more so than vanilla dating).",
            "author": "spiritravel",
            "id": "ezhqnsi",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567914537.0,
            "replies": []
        },
        {
            "body": "I feel bad for all the daddy's out there that get these type of girls :/ it sucks because I know their are new daddy's and girls out there but dick head SD/SB make it hard for everyone else :/ im always honest but can never find a daddy that is and it sucks a lot, \n\nsorry you have/had dumb SB's youre right most good SD are under a hard shell because they have been hurt and vice verse",
            "author": "UrSexyNerdGirl",
            "id": "ezhz2tq",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567918772.0,
            "replies": []
        },
        {
            "body": "Interestingly to my assessment most these babies were looking for a full ride as opposed to having an income and looking to supplement. \n\nMy preferences are older, preferably with kids. They usually have work and more stable. Now they're possibly less available but thems the breaks",
            "author": "OrnierThanU",
            "id": "ezi1d89",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567919751.0,
            "replies": [
                {
                    "body": "Yes. Imagine how desperate and lonely a woman must be to not have any friends to rely on after having an abortion and an awful ex? And I mean this in the nicest way possible, I feel sorry for her.",
                    "author": "Kokhana",
                    "id": "eziq1zi",
                    "parent_id": "t1_ezi1d89",
                    "score": 2,
                    "created_utc": 1567931320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sometimes I need perspective like this because I tend to forget “what the other side is like” so thank you, OP. Seems like it can be rough from both sides of the bowl. Hopefully the sweet one works out!",
            "author": "Curvyandwet4you",
            "id": "eziea87",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567925645.0,
            "replies": []
        },
        {
            "body": "The mainstreaming of sugar has brought all types into the bowl. I would guess that the absolute number of traditional SBs and SDs on the site is still the same, or increasing at a normal rate, but the total number of people on the site has grown dramatically. There seem to be a lot more platonics, pros, and toe dippers, for example. The result is that one has to sift through many more profiles to find someone legitimate and interested. It sounds like you hit a bad streak of 9 out of 10 POTs looking for free money one way or the other. But you may have better luck with the next 100 profiles, or the 100 after that, or the 100 after that. It's a numbers game. Good luck!",
            "author": "HwdSD",
            "id": "ezigopl",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567926782.0,
            "replies": []
        },
        {
            "body": "I'm not sure, but it looks like you met 3 and one went very well.   If so, that's not a bad record depending on how much time and effort you spent on the other 7.   I think many SD's would be happy with 1 legitimate SB prospect within a week.\n\nI don't get hung up with how many bad matches there are on Seeking, as long as I find ways not to waste too much time on them.",
            "author": "willfromvb",
            "id": "ezio3bn",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567930356.0,
            "replies": []
        },
        {
            "body": "I don't think you next-ing all these girls means you are a dick. Honestly. Their audacity amazes me, and not in a nice way. They have probably watched way too much SheraSeven1 (check her out on YT) and are rather plain in the brain department to not be able to take a good advice and ignore the bad.   \n\n\nKeep giving back to the local community. I hope you meet a great SB who enjoys your company, your generosity and would be smart enough to ask for business mentorship instead of  \"funds to get presentable\", LOL.",
            "author": "Kokhana",
            "id": "ezip6lz",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567930891.0,
            "replies": [
                {
                    "body": "Will do! Thanks for the positive reply. I’ll check out that YouTube link as well.",
                    "author": "LoftDaddy",
                    "id": "ezk8fwn",
                    "parent_id": "t1_ezip6lz",
                    "score": 2,
                    "created_utc": 1567956668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for sharing your experiences.  Glad you have found a SB that sounds like a keeper!",
            "author": "socharmer",
            "id": "ezjuna0",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567950626.0,
            "replies": []
        },
        {
            "body": "... did not bring prospectus.  😂",
            "author": "PersonalRule",
            "id": "ezjv7uj",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567950860.0,
            "replies": []
        },
        {
            "body": "10% success rate sounds pretty high to me.",
            "author": "Wetmommy1",
            "id": "ezjydey",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567952177.0,
            "replies": [
                {
                    "body": "😂🙇‍♂️",
                    "author": "LoftDaddy",
                    "id": "ezk7ztz",
                    "parent_id": "t1_ezjydey",
                    "score": 2,
                    "created_utc": 1567956458.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The dumpster one really got me.",
            "author": "itsbrattanybitch",
            "id": "ezk6hxo",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567955699.0,
            "replies": []
        },
        {
            "body": "If you see the number of groups, forums, podcasts, and youtube videos centered on how to scam sugardaddies for money or rinse them with no intention of ever meeting or engaging in an arrangement...you'd have a much colder perspective of the sugar world. The 18 to 22 crowd has the highest instance of this garbage.\n\nThis is what led me to freestyle exclusively. Never looked back.",
            "author": "SugarPieHunnieBunch",
            "id": "ezklxv8",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567962574.0,
            "replies": []
        },
        {
            "body": "Wow, that's pretty fucked up, for a better word. I mean, I'm platonic. I'm not in it for the money, more for trying to explore the state I currently live in because between a busy work life and school, it's genuinely hard to make friends my age(22) and have anyone besides my even busier boyfriend, to hang out with. Plus I'm a foodie, so I'm always down to trying new restaurants, so travel to me is places to eat.\n\nI think a lot of SBs don't realize that it isn't just about the money, it's also about the experiences you create with the SDs you arrange with.",
            "author": null,
            "id": "ezkpbz7",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567964262.0,
            "replies": []
        },
        {
            "body": "Wow.",
            "author": "greyprometheus",
            "id": "ezldbw9",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567975280.0,
            "replies": []
        },
        {
            "body": "Sheesh I don’t have any problems I just want to have fun & still can’t find a SD",
            "author": "Clove100",
            "id": "ezm13wj",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567984731.0,
            "replies": []
        },
        {
            "body": "Yeah after you seen enough it gets under your nerves.\n\nEg : just want a generous SD, will talk on phone and may be send pics. Not trying to meet or have s$x you old creeps. \n\nDafuq 🧐🧐",
            "author": "joergeie1",
            "id": "eznavyp",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1568003296.0,
            "replies": []
        },
        {
            "body": "Fabulous post! It made me laugh but we have all been there.",
            "author": "GSSD",
            "id": "ezpgnjj",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1568040291.0,
            "replies": []
        },
        {
            "body": "Oh great, I found a way to justify why I'm a dick to everyone! Bad liars!",
            "author": null,
            "id": "ezpv01z",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1568049181.0,
            "replies": []
        },
        {
            "body": "WHAT. THAT IS INSANITY.",
            "author": "KarmatheHusky",
            "id": "ezpzvds",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1568052266.0,
            "replies": []
        },
        {
            "body": "While I dont want an SD who's a dick, I can see how this would harden someone. Like wow lol this kind of makes me feel a bit less self conscious about having a career. In my mind, it seemed like SDs might prefer the girl who has literally next to nothing in terms of commitments on time. Im still building up my career and looking forward to higher salary in the future, but Im 29 and have a job and I budget well enough that I'm mainly just looking for ways to add to my life at the moment. I also totally support women knowing their value but I really dont understand the money before you meet thing. Does that actually work? I guess it would be annoying to go on dates and have SDs not pay anything. Seems like pressure on both sides. People harden after repeated experiences, I totally get it.",
            "author": "SugarmeSB",
            "id": "ezuc420",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1568149285.0,
            "replies": []
        },
        {
            "body": "Jeez Lmaooo",
            "author": "realglucose",
            "id": "ezv8agj",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1568169859.0,
            "replies": []
        },
        {
            "body": "General question.  Do SD find that more mature SB do this type of thing less often or no?  I assume the 18 - 30 year olds are the ones this would happen with more often, but perhaps I am wrong. For many SD the over 30 crowd would still be 20+ years younger, and if more reliable, perhaps a missed opportunity.",
            "author": "socharmer",
            "id": "ezh2z42",
            "parent_id": "t3_d13c4l",
            "score": 4,
            "created_utc": 1567904862.0,
            "replies": [
                {
                    "body": "I tried sugar dating a 33 yr old because I thought that age = maturity.  turned out she was still a 19yr old party girl on the inside, and was completely unpredictable and unreliable.  managed 1 really good date and a couple mediocre dates with her, with plenty of drama, money emergencies, blow ups, apologies, and makeups in between.\n\ncurrent SGF is 30 and a dream. mature, sexy, fun, reliable, motivated in her career.\n\nalso involved a little with a 23 year old. good level of maturity, no drama or money emergencies, but also not letting sugar get in the way of the rest of her life. that lack of priority towards this SR may end up costing her the SR.",
                    "author": "joc13",
                    "id": "ezhpq9d",
                    "parent_id": "t1_ezh2z42",
                    "score": 4,
                    "created_utc": 1567914080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly.... it’s a shame that people live in those conditions and don’t just make it a priority to get a job or a 2nd job. I cannot imagine having to rely on strangers on the internet to keep a roof over my head or have transportation. I’ve never had to ask a daddy for any of the things you mentioned..... EVER. (And I hope I never have to!) I can see how this gets tiring for the genuine SDs.",
            "author": "DallasSugarBaby",
            "id": "ezha0l2",
            "parent_id": "t3_d13c4l",
            "score": 4,
            "created_utc": 1567907577.0,
            "replies": []
        },
        {
            "body": "I’ve never, not once asked for money in advance of a first meeting. I think it’s incredibly rude and crass. I can’t believe women still do that. But, I guess I’m some cases it works. Just seems a bit much for me to be honest. I want to know if I meet his desires and I want him to know me, before just asking for funds. Ick! Sorry this happened to you.",
            "author": "AwaitingAutumn",
            "id": "ezi3uon",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567920844.0,
            "replies": []
        },
        {
            "body": "Nah man. I agree.  I got suckered by the \"I'll need gas money\" scam twice and then realized it WAS a scam.  Never again. Face-to-face meetings only. I'll pay when I'm satisfied. Not going to give handouts as mentioned above. As was stated earlier, each SB is a whole new person, but when the scams come, they're outta here.",
            "author": "beachandmountains",
            "id": "ezi8rh4",
            "parent_id": "t3_d13c4l",
            "score": 3,
            "created_utc": 1567923066.0,
            "replies": []
        },
        {
            "body": "Are you in NJ by any chance?  I think i have met half those babies, lol.",
            "author": "stark_emerson",
            "id": "ezh6bae",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567906144.0,
            "replies": [
                {
                    "body": "Lol no, Southern California",
                    "author": "LoftDaddy",
                    "id": "ezha9up",
                    "parent_id": "t1_ezh6bae",
                    "score": 3,
                    "created_utc": 1567907678.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn... embarrassing. \n\nMy life is full and complete without my SD. He just lightens my load and takes away my stress. We’ve been together for a few years, and yes, he absolutely gives extra help when the occasional issue arises. (I.e. he hired a regular housekeeper for me so that I could focus on my schoolwork, etc) BUT I never outright asked without his coaxing it out of me. He just listens when we chat and provides extra help if he detects a need. \n\nI know that sometimes this sub scoffs at us 30+ SB’s but, I have to wonder.... are these emergency type SB’s part of a younger crowd? This isn’t a generalization, just genuine curiosity.\n\nETA: Nevermind, I skimmed the comments and saw where you already answered similar questions. Ugh. This makes me cringey and sad.",
            "author": "oh_sugah",
            "id": "ezhfixf",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567909698.0,
            "replies": [
                {
                    "body": "It is without judgement. I tend for the mid 25-30 age range and go above it sometimes. I have recently found it to be a lot of people who are not able to function without sugar and are desperate. Hard to be dispassionate, but I’m not here to save everyone, just to find an arrangement.",
                    "author": "LoftDaddy",
                    "id": "ezhgu2b",
                    "parent_id": "t1_ezhfixf",
                    "score": 4,
                    "created_utc": 1567910204.0,
                    "replies": [
                        {
                            "body": "I can completely understand that! Frankly, no ‘SB’ should be here out of desperation (or entitlement) either, but that doesn’t seem to stop them.\n\nHope you find a unicorn soon!",
                            "author": "oh_sugah",
                            "id": "ezhhwt0",
                            "parent_id": "t1_ezhgu2b",
                            "score": 2,
                            "created_utc": 1567910613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No DADDY should ever be a dick.",
            "author": "Woobietodd",
            "id": "ezhtu1x",
            "parent_id": "t3_d13c4l",
            "score": 2,
            "created_utc": 1567916232.0,
            "replies": []
        },
        {
            "body": "Depends on the season. I agree, that EVERY sugar baby that wanted money before a simple coffee has turned me off, even when I met and tried to liven' it up. It's just too transactional and reminds me why I hate escort type arrangements.\n\nGood summary. Keep an open mind and also it's actually nice that these bottom feeders, out themselves. It's time saved, I just don't respond or end discussion quickly and move on.\n\nThank God, there's no shortage of new girls that are also not greedy and are looking for a genuine connection.\n\n\\-------------\n\nEdit: There's one exception of wanting cash for a basic coffee meet. That's if I'm really ugly/fat/repugnant, but I'm not. I can pick up any girl but don't want the blurry line of date/relationship (SB/SD sets it clear from the start). I mean I look more stylish and polished then most of these girls, yet she still has the nerve to ask for cash for a coffee intro meet?! (no please, you're going to change my life by saying how you enjoy watching netflix and how that consumption habit is a hobby 🤣🤣😂😂)",
            "author": "PriusMillionaire777",
            "id": "ezi41sb",
            "parent_id": "t3_d13c4l",
            "score": 1,
            "created_utc": 1567920932.0,
            "replies": []
        },
        {
            "body": "So how long does a POT become an arrangement ?  Months? Weeks? When do you talk about arrangement details $$$?",
            "author": "newsbhere",
            "id": "ezk5on8",
            "parent_id": "t3_d13c4l",
            "score": 1,
            "created_utc": 1567955320.0,
            "replies": [
                {
                    "body": "I’d say within a week and I try to talk details at or before the m&g to avoid wasting time and make sure expectations are understood.",
                    "author": "LoftDaddy",
                    "id": "ezk88t3",
                    "parent_id": "t1_ezk5on8",
                    "score": 2,
                    "created_utc": 1567956576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you are worried about a SB getting over on you for a few hundred bucks and it puts you on guard then save yourself the pain of dating women.  You were put off because she wanted to borrow a truck?   C’mon guy.   Lighten up and enjoy some young hardbodies and all the bullshit that comes with it.",
            "author": "LotBuilder",
            "id": "ezgnqvs",
            "parent_id": "t3_d13c4l",
            "score": -7,
            "created_utc": 1567899123.0,
            "replies": [
                {
                    "body": "Have no problem being generous and sharing with someone that I have met and would be interested in an arrangement with, but these are people I do not know nor would I let borrow a vehicle. Too much liability.",
                    "author": "LoftDaddy",
                    "id": "ezgo0q7",
                    "parent_id": "t1_ezgnqvs",
                    "score": 10,
                    "created_utc": 1567899228.0,
                    "replies": [
                        {
                            "body": "Got it,  misunderstood thinking it was a current SB",
                            "author": "LotBuilder",
                            "id": "ezgoiy2",
                            "parent_id": "t1_ezgo0q7",
                            "score": -1,
                            "created_utc": 1567899413.0,
                            "replies": [
                                {
                                    "body": "There are all POTS, not actual SB",
                                    "author": "ruphun",
                                    "id": "ezgp2n0",
                                    "parent_id": "t1_ezgoiy2",
                                    "score": 3,
                                    "created_utc": 1567899621.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And it’s a few hundred bucks nearly every single time. That was the purpose of my post.",
                    "author": "LoftDaddy",
                    "id": "ezgo3bm",
                    "parent_id": "t1_ezgnqvs",
                    "score": 9,
                    "created_utc": 1567899255.0,
                    "replies": [
                        {
                            "body": "I see the beef but at the same time you have to understand it takes a certain level of financial stress that drives a girl to jump on SA.",
                            "author": "LotBuilder",
                            "id": "ezgovzo",
                            "parent_id": "t1_ezgo3bm",
                            "score": 1,
                            "created_utc": 1567899550.0,
                            "replies": [
                                {
                                    "body": "Very fair and valid point.",
                                    "author": "LoftDaddy",
                                    "id": "ezgozzs",
                                    "parent_id": "t1_ezgovzo",
                                    "score": 3,
                                    "created_utc": 1567899592.0,
                                    "replies": []
                                },
                                {
                                    "body": "None of my SBs have ever shown signs of being in significant financial stress, or they were very good at not mentioning it. They could all pay their bills and cover necessities. A couple of them were quite successful and just downright enjoyed dating older men.",
                                    "author": "nw_SD",
                                    "id": "ezgqin2",
                                    "parent_id": "t1_ezgovzo",
                                    "score": 5,
                                    "created_utc": 1567900164.0,
                                    "replies": [
                                        {
                                            "body": "Then you are not targeting newbies under 24.",
                                            "author": "LotBuilder",
                                            "id": "ezgr1zs",
                                            "parent_id": "t1_ezgqin2",
                                            "score": 1,
                                            "created_utc": 1567900361.0,
                                            "replies": [
                                                {
                                                    "body": "Correct. I target POTs that I find interesting regardless of age (within reason).",
                                                    "author": "nw_SD",
                                                    "id": "ezgsb2j",
                                                    "parent_id": "t1_ezgr1zs",
                                                    "score": 3,
                                                    "created_utc": 1567900829.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The girls jumping on SA out of financial distress/ crisis are the ones that are looking to rinse. You’re not likely going to have a lasting sugar relationship. If you’re happy with a one and done, that might be ok.",
                                    "author": "dstoffers",
                                    "id": "ezgxrtj",
                                    "parent_id": "t1_ezgovzo",
                                    "score": 2,
                                    "created_utc": 1567902889.0,
                                    "replies": [
                                        {
                                            "body": "It’s a high risk high reward game I’ve been playing for 10 years.  You get the rinsers and chaos queens but you also can catch them when they are unjaded and inexperienced and you can create a true long term relationship with very reasonable financial expectations.",
                                            "author": "LotBuilder",
                                            "id": "ezh039s",
                                            "parent_id": "t1_ezgxrtj",
                                            "score": -4,
                                            "created_utc": 1567903777.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm not loaning my truck to some girl I haven't even met yet. No way in hell. And the rest of them? Asking for those kinds of things before meeting? Hard pass. \n\nYou're being WAY to easy if you up for giving money for those lame reasons on day one.",
                    "author": "mraspencer",
                    "id": "ezh9cy9",
                    "parent_id": "t1_ezgnqvs",
                    "score": 4,
                    "created_utc": 1567907318.0,
                    "replies": []
                },
                {
                    "body": "Yeah that's kind of bs man..  I work my ass off for my money and my money works for me.  If you want money for <insert whatever excuse> before you even show up,  yeah fuk that!  There are waaaaaay more \"hotties with hard bodies\" that have basic good sense than there are actually wealthy men willing to engage in a real SR.\n\nI hold the cards, not her.\n\n<Typed as I lay next to my napping SB in Puerto Vallarta before we go partying tonight>",
                    "author": "TXPolyDaddy",
                    "id": "ezgturi",
                    "parent_id": "t1_ezgnqvs",
                    "score": 9,
                    "created_utc": 1567901415.0,
                    "replies": [
                        {
                            "body": "From what I have heard from countless men, I have reason to believe there are more authentic SDs than suitable SBs… and this thread would seem to support that.\nJust being a “hottie with a hardbody” doesn’t automatically qualify one to be a suitable SB (although it definitely doesn’t hurt).  For the SDs with whom I’ve been involved, it also takes a good personality, a modicum of intelligence, and a nice vibe as well to be an SB with any staying power.",
                            "author": "RealEarthAngel",
                            "id": "eznh69h",
                            "parent_id": "t1_ezgturi",
                            "score": 2,
                            "created_utc": 1568005886.0,
                            "replies": []
                        },
                        {
                            "body": "You are living my dream! Hopefully I will find a good SB to go on similar experiences with soon.",
                            "author": "LoftDaddy",
                            "id": "ezgv3em",
                            "parent_id": "t1_ezgturi",
                            "score": 3,
                            "created_utc": 1567901870.0,
                            "replies": [
                                {
                                    "body": "I am lucky man..  She wants to go to a strip club then dancing... aiiight..! sign this geezer up!\n\nThere are good ones out there!  Don't give up!",
                                    "author": "TXPolyDaddy",
                                    "id": "ezgwpnm",
                                    "parent_id": "t1_ezgv3em",
                                    "score": 2,
                                    "created_utc": 1567902485.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No Daddy has any reason to be a dick to their Little. If you know them and you have paid attention to their wants, needs, and desires, you will never have a need to be a dick. If you feel it necessary to be a dick, you might want to look in the mirror.",
            "author": "Woobietodd",
            "id": "ezhr8tp",
            "parent_id": "t3_d13c4l",
            "score": -2,
            "created_utc": 1567914826.0,
            "replies": [
                {
                    "body": "These are all POTs and I have been called a dick for not giving money to a stranger as some here have messaged me privately saying the exact same thing.",
                    "author": "LoftDaddy",
                    "id": "ezhri21",
                    "parent_id": "t1_ezhr8tp",
                    "score": 3,
                    "created_utc": 1567914955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea, uh, really, something tells me you are the *real* baby here.",
            "author": null,
            "id": "ezgy300",
            "parent_id": "t3_d13c4l",
            "score": -8,
            "created_utc": 1567903007.0,
            "replies": [
                {
                    "body": "Perhaps I am. There are always possabilities.",
                    "author": "LoftDaddy",
                    "id": "ezh09qg",
                    "parent_id": "t1_ezgy300",
                    "score": 1,
                    "created_utc": 1567903844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ezgxqg7",
            "parent_id": "t3_d13c4l",
            "score": -11,
            "created_utc": 1567902874.0,
            "replies": [
                {
                    "body": "Sounds like we did each other a favor. Thanks for not entering the bowl.",
                    "author": "LoftDaddy",
                    "id": "ezgyev9",
                    "parent_id": "t1_ezgxqg7",
                    "score": 13,
                    "created_utc": 1567903135.0,
                    "replies": []
                },
                {
                    "body": "Also, these were all POTS that I had only met within the last week. None of these were arrangements. In the past I have taken great care of those I am involved with. See my comment history if you care.",
                    "author": "LoftDaddy",
                    "id": "ezgynn4",
                    "parent_id": "t1_ezgxqg7",
                    "score": 6,
                    "created_utc": 1567903228.0,
                    "replies": []
                },
                {
                    "body": "If you never entered the bowl. Why do you feel the need to comment?  And what in OP's post reads as entitled?",
                    "author": "McNihil_88",
                    "id": "ezh3e71",
                    "parent_id": "t1_ezgxqg7",
                    "score": 3,
                    "created_utc": 1567905026.0,
                    "replies": [
                        {
                            "body": "Because i felt a hint of optimism towards this arrangement. My mistake, honestly, if every man is as insecure and needy as sugardaddy 1.0\n I am not here to expose or embardass anybody, but *really*? If you a grown ass man, act like it. Do NOT treat strong women like displaced examples to justify your shit behavior towards the neglected opposite sex. Grow the fuck up, boys.",
                            "author": null,
                            "id": "ezh4t2s",
                            "parent_id": "t1_ezh3e71",
                            "score": -6,
                            "created_utc": 1567905564.0,
                            "replies": [
                                {
                                    "body": "I just don't understand where the insecure, needy or shit behaviour was displayed.  Is it because the OP didn't give relative strangers money before they even met?",
                                    "author": "McNihil_88",
                                    "id": "ezh6mt9",
                                    "parent_id": "t1_ezh4t2s",
                                    "score": 8,
                                    "created_utc": 1567906267.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why would you even get into being an SD in the first place if you're obviously not generous?",
            "author": "californiacandy",
            "id": "ezh11pe",
            "parent_id": "t3_d13c4l",
            "score": -9,
            "created_utc": 1567904137.0,
            "replies": [
                {
                    "body": "It’s POTs I am not generous to. In an actual arrangement I have no problem going well above and beyond.",
                    "author": "LoftDaddy",
                    "id": "ezh1lc8",
                    "parent_id": "t1_ezh11pe",
                    "score": 10,
                    "created_utc": 1567904336.0,
                    "replies": []
                },
                {
                    "body": "Huge difference between being generous and getting taken for a sucker.",
                    "author": "duckydee543",
                    "id": "ezi7mn4",
                    "parent_id": "t1_ezh11pe",
                    "score": 3,
                    "created_utc": 1567922545.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "in the last few months i've had the same experience\n\nlast year i was able to meet lots of wonderful ladies, found one, and had a long term thing then she moved away\n\ni came back in March and it's very much like the list above.",
            "author": "anonymou555andWich",
            "id": "ezh3wmb",
            "parent_id": "t1_ezgs0a3",
            "score": 4,
            "created_utc": 1567905220.0,
            "replies": []
        },
        {
            "body": "That sounds like a healthy outlook. I think I'll have a prepared 'next' message and just send that and then block the number.",
            "author": "LoftDaddy",
            "id": "ezgseu1",
            "parent_id": "t1_ezgs0a3",
            "score": 2,
            "created_utc": 1567900869.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing this. I feel exactly the same",
            "author": "Cybercoot43",
            "id": "ezi3z08",
            "parent_id": "t1_ezgs0a3",
            "score": 2,
            "created_utc": 1567920897.0,
            "replies": []
        },
        {
            "body": "I don't believe she was prepared to answer that without legal counsel present.",
            "author": "LoftDaddy",
            "id": "ezgvf0i",
            "parent_id": "t1_ezguxth",
            "score": 33,
            "created_utc": 1567901992.0,
            "replies": [
                {
                    "body": "I got a nice chuckle out of this one. She probably would’ve brought Michael Avenatti should negotiations have progressed further",
                    "author": "Musiq_afficianado",
                    "id": "ezh0foa",
                    "parent_id": "t1_ezgvf0i",
                    "score": 12,
                    "created_utc": 1567903906.0,
                    "replies": []
                },
                {
                    "body": "Legal counsel to be funded out of investment capital.",
                    "author": "tra24602",
                    "id": "ezjaa3c",
                    "parent_id": "t1_ezgvf0i",
                    "score": 4,
                    "created_utc": 1567941356.0,
                    "replies": [
                        {
                            "body": "Good call! This was certainly Series A funding.",
                            "author": "LoftDaddy",
                            "id": "ezk7r89",
                            "parent_id": "t1_ezjaa3c",
                            "score": 2,
                            "created_utc": 1567956344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This! In my head I imagined you genuinely hearing her out, or at least trying to, but getting nowherrrre!\n\nIs this the sugar bowl or shark tank?",
            "author": "CrispyMann",
            "id": "ezjmqk1",
            "parent_id": "t1_ezguxth",
            "score": 3,
            "created_utc": 1567946993.0,
            "replies": [
                {
                    "body": "I need my own \"Shark Tank\" for every aspect of my life...",
                    "author": null,
                    "id": "ezjqw2y",
                    "parent_id": "t1_ezjmqk1",
                    "score": 2,
                    "created_utc": 1567948912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was wondering that too.  free private sessions?  copies of videos of private sessions?  maybe watching live?\n\nbut, is it still \"platonic\" if you get to see her naked?",
            "author": "joc13",
            "id": "ezhnbry",
            "parent_id": "t1_ezguxth",
            "score": 4,
            "created_utc": 1567912937.0,
            "replies": [
                {
                    "body": "Yes I’ll allow that 😜",
                    "author": "ruphun",
                    "id": "ezjl4fc",
                    "parent_id": "t1_ezhnbry",
                    "score": 3,
                    "created_utc": 1567946324.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mostly 25-33 and I am 39 myself. I do not waste time with low effort profiles, might just be a sign of being an SD in the inland empire.",
            "author": "LoftDaddy",
            "id": "ezhy8my",
            "parent_id": "t1_ezhwn6y",
            "score": 5,
            "created_utc": 1567918419.0,
            "replies": [
                {
                    "body": "That's such a shame that it is older women who should know better as they have had more experience in life. \n\nThe bowl is sadly becoming so diluted.",
                    "author": null,
                    "id": "ezi0c28",
                    "parent_id": "t1_ezhy8my",
                    "score": 3,
                    "created_utc": 1567919330.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ezjn10i",
                            "parent_id": "t1_ezi0c28",
                            "score": 1,
                            "created_utc": 1567947114.0,
                            "replies": [
                                {
                                    "body": "Mind blown.\n\nTo go from trying to manipulate the money out of you (by way of showing a lack of professionalism and dedication to her business), to then saying it is a requirement for meeting.\n\nI just don't understand the thought process. \n\nI have never been to the States but I haven't experienced at least half of the things I read here being based in Asia.",
                                    "author": null,
                                    "id": "ezjo7cj",
                                    "parent_id": "t1_ezjn10i",
                                    "score": 2,
                                    "created_utc": 1567947599.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, taking notes... do NOT molest or drug. \n\nIn all seriousness, I’m sorry if any of that did happen to you.",
            "author": "LoftDaddy",
            "id": "ezhely9",
            "parent_id": "t1_ezhdwxy",
            "score": 7,
            "created_utc": 1567909342.0,
            "replies": [
                {
                    "body": "Well, unless that's her kink in which case molest and drug away! \n\nI've been lucky enough that I've not had any super horrible experiences. Bad, yes, but nothing my therapist can't handle 😉\n\nThe way I see it, we encounter the trash before the treasure on both sides. The input you've received so far sounds reasonable, but it sounds like you've been through this rodeo before. It is hard sometimes not to get completely bitter, but I just remember the amazing experiences I've had and the ex-sds I'm still friends with, and I keep in mind that this is what I signed up for. It's worth it for now 😊💜",
                    "author": "joluna813",
                    "id": "ezhfhfj",
                    "parent_id": "t1_ezhely9",
                    "score": 5,
                    "created_utc": 1567909682.0,
                    "replies": [
                        {
                            "body": "Unfortunately those kinks aren't so common!",
                            "author": "YesToAdventure",
                            "id": "ezjmva3",
                            "parent_id": "t1_ezhfhfj",
                            "score": 2,
                            "created_utc": 1567947048.0,
                            "replies": [
                                {
                                    "body": "True. That's what makes us kinky babies a rarity and even more precious 😉😁😆",
                                    "author": "joluna813",
                                    "id": "ezjnpx8",
                                    "parent_id": "t1_ezjmva3",
                                    "score": 3,
                                    "created_utc": 1567947394.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ezjopkv",
                                            "parent_id": "t1_ezjnpx8",
                                            "score": 3,
                                            "created_utc": 1567947800.0,
                                            "replies": [
                                                {
                                                    "body": "😅",
                                                    "author": "joluna813",
                                                    "id": "ezjpe45",
                                                    "parent_id": "t1_ezjopkv",
                                                    "score": 2,
                                                    "created_utc": 1567948169.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This",
            "author": "tankbinding",
            "id": "ezh9xve",
            "parent_id": "t1_ezgxm13",
            "score": 5,
            "created_utc": 1567907545.0,
            "replies": []
        },
        {
            "body": "it really sounds like it. Maybe his profile is lacking or he doesn't read theirs prior to talking. Or IDK maybe the Babies start conversations with \"I live behind a dumpster, please give  me money\" in which case there's nothing he can do to stop those messages from popping into his DMs, just NEXT them",
            "author": null,
            "id": "ezkaitb",
            "parent_id": "t1_ezgxm13",
            "score": 4,
            "created_utc": 1567957528.0,
            "replies": []
        },
        {
            "body": "This is what I was thinking.\n\nIt really makes ‘us’ look bad as a whole. And while  I prefer to think of myself as being on a different level than this, it doesn’t change that a POT may have some SD PTSD based on these awful experiences. It fucks it up for those of us who are real and genuine. Such a shame.",
            "author": "oh_sugah",
            "id": "ezhget9",
            "parent_id": "t1_ezgxrhh",
            "score": 16,
            "created_utc": 1567910032.0,
            "replies": [
                {
                    "body": "this is similar to what I think when we hear stories of really asshole guys.  they set the women on edge so they learn not to trust any guys, but they also help all the good guys look even better once someone does get to know us.",
                    "author": "joc13",
                    "id": "ezho7my",
                    "parent_id": "t1_ezhget9",
                    "score": 4,
                    "created_utc": 1567913352.0,
                    "replies": []
                },
                {
                    "body": "I was thinking the same.",
                    "author": "RealEarthAngel",
                    "id": "ezmdd9b",
                    "parent_id": "t1_ezhget9",
                    "score": 2,
                    "created_utc": 1567990339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not about looking bad, just that there are reasons some of us SDs have a harder shell. It certainly allows the gems to shine when the right one eventually comes along.",
            "author": "LoftDaddy",
            "id": "ezgybqk",
            "parent_id": "t1_ezgxrhh",
            "score": 5,
            "created_utc": 1567903102.0,
            "replies": []
        },
        {
            "body": "yeah this is embaarrrasssssinngggg. One M&G daddy told me a POT SB had asked for $40 to go to the dentist before meeting. 1) dentists don't cost that much and 2) I would never dare ask that. I've found daddies are willing to shower me with sugar the more financially independent I am. So I try to keep the money discussion to a minimum, only absolutely necessary conversations about it (obv to establish ppm or allowance). Then be a normal girlfriend and not bring it up all the damn time!",
            "author": null,
            "id": "ezk9won",
            "parent_id": "t1_ezgxrhh",
            "score": 2,
            "created_utc": 1567957291.0,
            "replies": [
                {
                    "body": "without dental insurance dentists cost far more than 40 for a simple teeth cleaning at least in new york",
                    "author": null,
                    "id": "f0k1ufj",
                    "parent_id": "t1_ezk9won",
                    "score": 1,
                    "created_utc": 1568668242.0,
                    "replies": [
                        {
                            "body": "another example of why it was an obvious lie! gross!",
                            "author": null,
                            "id": "f0ksft7",
                            "parent_id": "t1_f0k1ufj",
                            "score": 1,
                            "created_utc": 1568686902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe she needs the help and maybe not.  Probably she's just milking you a little bit.  Time to just cut her off.  \n\nIf it ends amicably, then I normally keep the allowance going for a couple months (if I ended it).  Or help a couple times (if she ended it).\n\nBut, I think there comes a time when you just say no.",
            "author": "duckydee543",
            "id": "ezhqjfu",
            "parent_id": "t1_ezgpaz3",
            "score": 9,
            "created_utc": 1567914480.0,
            "replies": []
        },
        {
            "body": "I’d take anything you read on that FB group (or anywhere on the internet for that matter) with a big grain of salt. I’m sure there’s plenty of exaggerations, self-promotion, and outright lying in these social media groups.",
            "author": "sd_90210",
            "id": "ezjib1s",
            "parent_id": "t1_ezhkbf6",
            "score": 3,
            "created_utc": 1567945111.0,
            "replies": []
        },
        {
            "body": "Let me guess. There's no SD's in the Facebook group?",
            "author": "McNihil_88",
            "id": "ezi37jk",
            "parent_id": "t1_ezhkbf6",
            "score": 0,
            "created_utc": 1567920563.0,
            "replies": []
        },
        {
            "body": "Shhhhhhh. Don't tell anyone!",
            "author": "LoftDaddy",
            "id": "ezgwgfb",
            "parent_id": "t1_ezgvipl",
            "score": 5,
            "created_utc": 1567902385.0,
            "replies": []
        },
        {
            "body": "Sure thing, Southern California (inland area, outside of Los Angeles) and targeting 21-33 age range.",
            "author": "LoftDaddy",
            "id": "ezguxo2",
            "parent_id": "t1_ezgu7x0",
            "score": 6,
            "created_utc": 1567901810.0,
            "replies": [
                {
                    "body": "I’m surprised, from the post, I figured 18-25. I’m sorry you’re dealing with such scummy people. There really are great SB’s out there and I hope you find yours.",
                    "author": "dstoffers",
                    "id": "ezgx5ey",
                    "parent_id": "t1_ezguxo2",
                    "score": 3,
                    "created_utc": 1567902654.0,
                    "replies": []
                },
                {
                    "body": "Your post is a reason I can’t get myself to sign up again. I live in SoCal and find the other bad end of the stick. These ladies makes everyone look bad.",
                    "author": "misskansast",
                    "id": "ezi4jlg",
                    "parent_id": "t1_ezguxo2",
                    "score": 2,
                    "created_utc": 1567921153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oof. Yeah. I got her the contact info of several shelters but had to block her after that.",
            "author": "LoftDaddy",
            "id": "ezhmgh9",
            "parent_id": "t1_ezhlzc9",
            "score": 2,
            "created_utc": 1567912534.0,
            "replies": [
                {
                    "body": "Well that was actually very nice of you.",
                    "author": "YourExoticBabe",
                    "id": "ezhmpzd",
                    "parent_id": "t1_ezhmgh9",
                    "score": 1,
                    "created_utc": 1567912655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm sure I am, but I also am seeing other SDs having similar ratios / success in their replies and DMs. I am not complaining, just sharing how experiences shape the attitudes of an SD when searching for a POT and why we come across as cold or next-ing.",
            "author": "LoftDaddy",
            "id": "ezkrlke",
            "parent_id": "t1_ezkq8iw",
            "score": 2,
            "created_utc": 1567965379.0,
            "replies": []
        },
        {
            "body": "That seems very reasonable to me and I wouldn't hesitate to offer if I didn't pick a place close to a POT or if there was something like valet. If an SD recommends a place like that and doesn't happily pay, consider that a 'freebie' red flag as to how the arrangement would unfold.",
            "author": "LoftDaddy",
            "id": "ezgxuhm",
            "parent_id": "t1_ezgqnx9",
            "score": 13,
            "created_utc": 1567902917.0,
            "replies": []
        },
        {
            "body": "Baby #1 was not asking merely for a small thing like Uber or valet money.\n\nBaby #2 was not asking merely for a small thing like Uber or valet money.\n\nBaby #3 was not asking merely for a small thing like Uber or valet money.\n\nSnap quiz: what can be said about Baby #4, Baby #6, Baby #7, Baby #8, Baby #9, and Baby #10?",
            "author": "highfructoseSD",
            "id": "ezhcygs",
            "parent_id": "t1_ezgqnx9",
            "score": 6,
            "created_utc": 1567908704.0,
            "replies": [
                {
                    "body": "You got me, what is that?",
                    "author": "LoftDaddy",
                    "id": "ezkg8xz",
                    "parent_id": "t1_ezhcygs",
                    "score": 2,
                    "created_utc": 1567959816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i'll uber once we are actually in an arrangement\n\nbut seldom for a meet",
            "author": "anonymou555andWich",
            "id": "ezh426v",
            "parent_id": "t1_ezgqnx9",
            "score": -1,
            "created_utc": 1567905277.0,
            "replies": []
        },
        {
            "body": "Exactly. This is how the insecure male ruling class try to guilt us out of our worth. You never have a *thing* to apologize for, baby, don't let these man-children tell you otherwise. Fr.",
            "author": null,
            "id": "ezgz2h7",
            "parent_id": "t1_ezgqnx9",
            "score": -3,
            "created_utc": 1567903383.0,
            "replies": [
                {
                    "body": ":-)  :-)  :-)  smile, the OP never ever asked for an apology from any of the SBs  :-)  :-)  :-)",
                    "author": "highfructoseSD",
                    "id": "ezhd4jm",
                    "parent_id": "t1_ezgz2h7",
                    "score": 6,
                    "created_utc": 1567908768.0,
                    "replies": []
                },
                {
                    "body": "A real queen never has to let a man know her worth. He recognizes it by her personality, her actions and the way she treats everyone.",
                    "author": "ruphun",
                    "id": "ezjo49z",
                    "parent_id": "t1_ezgz2h7",
                    "score": 2,
                    "created_utc": 1567947564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good perspective, I guess I figured since I filter out so many within the SA message part of the process that there would be better success. Guess it will be a numbers game!",
            "author": "LoftDaddy",
            "id": "ezgyvin",
            "parent_id": "t1_ezgyh4h",
            "score": 2,
            "created_utc": 1567903311.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezj6vhb",
            "parent_id": "t1_ezhffwl",
            "score": 5,
            "created_utc": 1567939603.0,
            "replies": [
                {
                    "body": "I agree entirely.",
                    "author": "RealEarthAngel",
                    "id": "ezn3wpi",
                    "parent_id": "t1_ezj6vhb",
                    "score": 2,
                    "created_utc": 1568000564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like your attitude!! :)",
            "author": "PriusMillionaire777",
            "id": "ezi4qqz",
            "parent_id": "t1_ezhffwl",
            "score": 1,
            "created_utc": 1567921238.0,
            "replies": []
        },
        {
            "body": "21-33, but under 25 I don’t approach unless the profile is well written and obvious effort is presented. I’m 39.",
            "author": "LoftDaddy",
            "id": "ezh1exh",
            "parent_id": "t1_ezh13hj",
            "score": 7,
            "created_utc": 1567904274.0,
            "replies": []
        },
        {
            "body": "My range is 21-33, usually 25+. I’m 39. \n\nOne on the list was my age within a year. \n\nUnfortunately I think it is more of a sign of my area than anything else.",
            "author": "LoftDaddy",
            "id": "ezk7ydq",
            "parent_id": "t1_ezjyoes",
            "score": 4,
            "created_utc": 1567956440.0,
            "replies": []
        },
        {
            "body": "Honestly I did. One on the list above is actually a year older than me. Same outcome.",
            "author": "LoftDaddy",
            "id": "ezgy51h",
            "parent_id": "t1_ezgxnd3",
            "score": 1,
            "created_utc": 1567903030.0,
            "replies": [
                {
                    "body": "Well that blew my theory right out the window.",
                    "author": "times_passing_by",
                    "id": "ezgyeaf",
                    "parent_id": "t1_ezgy51h",
                    "score": 2,
                    "created_utc": 1567903129.0,
                    "replies": []
                },
                {
                    "body": "I was hoping it was the one that went well.. LOL",
                    "author": "times_passing_by",
                    "id": "ezgyi2y",
                    "parent_id": "t1_ezgy51h",
                    "score": 1,
                    "created_utc": 1567903169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Southern California, inland empire",
            "author": "LoftDaddy",
            "id": "ezkg43t",
            "parent_id": "t1_ezgr7pd",
            "score": 2,
            "created_utc": 1567959758.0,
            "replies": []
        },
        {
            "body": "I don’t think I am a special case, just not a great area. Wanted to share what the other side goes through if it explains why we have a reaction to getting asked for something upfront because sometimes us SDs are come across as heartless dicks.",
            "author": "LoftDaddy",
            "id": "ezkft0h",
            "parent_id": "t1_ezh9kyw",
            "score": 2,
            "created_utc": 1567959629.0,
            "replies": []
        },
        {
            "body": "All from Seeking.com",
            "author": "LoftDaddy",
            "id": "ezhr1gx",
            "parent_id": "t1_ezhp66x",
            "score": 2,
            "created_utc": 1567914725.0,
            "replies": [
                {
                    "body": "sent you a message!",
                    "author": "travelingsole",
                    "id": "ezhr8hg",
                    "parent_id": "t1_ezhr1gx",
                    "score": 2,
                    "created_utc": 1567914821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes. Imagine how desperate and lonely a woman must be to not have any friends to rely on after having an abortion and an awful ex? And I mean this in the nicest way possible, I feel sorry for her.",
            "author": "Kokhana",
            "id": "eziq1zi",
            "parent_id": "t1_ezi1d89",
            "score": 2,
            "created_utc": 1567931320.0,
            "replies": []
        },
        {
            "body": "Will do! Thanks for the positive reply. I’ll check out that YouTube link as well.",
            "author": "LoftDaddy",
            "id": "ezk8fwn",
            "parent_id": "t1_ezip6lz",
            "score": 2,
            "created_utc": 1567956668.0,
            "replies": []
        },
        {
            "body": "😂🙇‍♂️",
            "author": "LoftDaddy",
            "id": "ezk7ztz",
            "parent_id": "t1_ezjydey",
            "score": 2,
            "created_utc": 1567956458.0,
            "replies": []
        },
        {
            "body": "I tried sugar dating a 33 yr old because I thought that age = maturity.  turned out she was still a 19yr old party girl on the inside, and was completely unpredictable and unreliable.  managed 1 really good date and a couple mediocre dates with her, with plenty of drama, money emergencies, blow ups, apologies, and makeups in between.\n\ncurrent SGF is 30 and a dream. mature, sexy, fun, reliable, motivated in her career.\n\nalso involved a little with a 23 year old. good level of maturity, no drama or money emergencies, but also not letting sugar get in the way of the rest of her life. that lack of priority towards this SR may end up costing her the SR.",
            "author": "joc13",
            "id": "ezhpq9d",
            "parent_id": "t1_ezh2z42",
            "score": 4,
            "created_utc": 1567914080.0,
            "replies": []
        },
        {
            "body": "Lol no, Southern California",
            "author": "LoftDaddy",
            "id": "ezha9up",
            "parent_id": "t1_ezh6bae",
            "score": 3,
            "created_utc": 1567907678.0,
            "replies": []
        },
        {
            "body": "It is without judgement. I tend for the mid 25-30 age range and go above it sometimes. I have recently found it to be a lot of people who are not able to function without sugar and are desperate. Hard to be dispassionate, but I’m not here to save everyone, just to find an arrangement.",
            "author": "LoftDaddy",
            "id": "ezhgu2b",
            "parent_id": "t1_ezhfixf",
            "score": 4,
            "created_utc": 1567910204.0,
            "replies": [
                {
                    "body": "I can completely understand that! Frankly, no ‘SB’ should be here out of desperation (or entitlement) either, but that doesn’t seem to stop them.\n\nHope you find a unicorn soon!",
                    "author": "oh_sugah",
                    "id": "ezhhwt0",
                    "parent_id": "t1_ezhgu2b",
                    "score": 2,
                    "created_utc": 1567910613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d say within a week and I try to talk details at or before the m&g to avoid wasting time and make sure expectations are understood.",
            "author": "LoftDaddy",
            "id": "ezk88t3",
            "parent_id": "t1_ezk5on8",
            "score": 2,
            "created_utc": 1567956576.0,
            "replies": []
        },
        {
            "body": "Have no problem being generous and sharing with someone that I have met and would be interested in an arrangement with, but these are people I do not know nor would I let borrow a vehicle. Too much liability.",
            "author": "LoftDaddy",
            "id": "ezgo0q7",
            "parent_id": "t1_ezgnqvs",
            "score": 10,
            "created_utc": 1567899228.0,
            "replies": [
                {
                    "body": "Got it,  misunderstood thinking it was a current SB",
                    "author": "LotBuilder",
                    "id": "ezgoiy2",
                    "parent_id": "t1_ezgo0q7",
                    "score": -1,
                    "created_utc": 1567899413.0,
                    "replies": [
                        {
                            "body": "There are all POTS, not actual SB",
                            "author": "ruphun",
                            "id": "ezgp2n0",
                            "parent_id": "t1_ezgoiy2",
                            "score": 3,
                            "created_utc": 1567899621.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And it’s a few hundred bucks nearly every single time. That was the purpose of my post.",
            "author": "LoftDaddy",
            "id": "ezgo3bm",
            "parent_id": "t1_ezgnqvs",
            "score": 9,
            "created_utc": 1567899255.0,
            "replies": [
                {
                    "body": "I see the beef but at the same time you have to understand it takes a certain level of financial stress that drives a girl to jump on SA.",
                    "author": "LotBuilder",
                    "id": "ezgovzo",
                    "parent_id": "t1_ezgo3bm",
                    "score": 1,
                    "created_utc": 1567899550.0,
                    "replies": [
                        {
                            "body": "Very fair and valid point.",
                            "author": "LoftDaddy",
                            "id": "ezgozzs",
                            "parent_id": "t1_ezgovzo",
                            "score": 3,
                            "created_utc": 1567899592.0,
                            "replies": []
                        },
                        {
                            "body": "None of my SBs have ever shown signs of being in significant financial stress, or they were very good at not mentioning it. They could all pay their bills and cover necessities. A couple of them were quite successful and just downright enjoyed dating older men.",
                            "author": "nw_SD",
                            "id": "ezgqin2",
                            "parent_id": "t1_ezgovzo",
                            "score": 5,
                            "created_utc": 1567900164.0,
                            "replies": [
                                {
                                    "body": "Then you are not targeting newbies under 24.",
                                    "author": "LotBuilder",
                                    "id": "ezgr1zs",
                                    "parent_id": "t1_ezgqin2",
                                    "score": 1,
                                    "created_utc": 1567900361.0,
                                    "replies": [
                                        {
                                            "body": "Correct. I target POTs that I find interesting regardless of age (within reason).",
                                            "author": "nw_SD",
                                            "id": "ezgsb2j",
                                            "parent_id": "t1_ezgr1zs",
                                            "score": 3,
                                            "created_utc": 1567900829.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The girls jumping on SA out of financial distress/ crisis are the ones that are looking to rinse. You’re not likely going to have a lasting sugar relationship. If you’re happy with a one and done, that might be ok.",
                            "author": "dstoffers",
                            "id": "ezgxrtj",
                            "parent_id": "t1_ezgovzo",
                            "score": 2,
                            "created_utc": 1567902889.0,
                            "replies": [
                                {
                                    "body": "It’s a high risk high reward game I’ve been playing for 10 years.  You get the rinsers and chaos queens but you also can catch them when they are unjaded and inexperienced and you can create a true long term relationship with very reasonable financial expectations.",
                                    "author": "LotBuilder",
                                    "id": "ezh039s",
                                    "parent_id": "t1_ezgxrtj",
                                    "score": -4,
                                    "created_utc": 1567903777.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not loaning my truck to some girl I haven't even met yet. No way in hell. And the rest of them? Asking for those kinds of things before meeting? Hard pass. \n\nYou're being WAY to easy if you up for giving money for those lame reasons on day one.",
            "author": "mraspencer",
            "id": "ezh9cy9",
            "parent_id": "t1_ezgnqvs",
            "score": 4,
            "created_utc": 1567907318.0,
            "replies": []
        },
        {
            "body": "Yeah that's kind of bs man..  I work my ass off for my money and my money works for me.  If you want money for <insert whatever excuse> before you even show up,  yeah fuk that!  There are waaaaaay more \"hotties with hard bodies\" that have basic good sense than there are actually wealthy men willing to engage in a real SR.\n\nI hold the cards, not her.\n\n<Typed as I lay next to my napping SB in Puerto Vallarta before we go partying tonight>",
            "author": "TXPolyDaddy",
            "id": "ezgturi",
            "parent_id": "t1_ezgnqvs",
            "score": 9,
            "created_utc": 1567901415.0,
            "replies": [
                {
                    "body": "From what I have heard from countless men, I have reason to believe there are more authentic SDs than suitable SBs… and this thread would seem to support that.\nJust being a “hottie with a hardbody” doesn’t automatically qualify one to be a suitable SB (although it definitely doesn’t hurt).  For the SDs with whom I’ve been involved, it also takes a good personality, a modicum of intelligence, and a nice vibe as well to be an SB with any staying power.",
                    "author": "RealEarthAngel",
                    "id": "eznh69h",
                    "parent_id": "t1_ezgturi",
                    "score": 2,
                    "created_utc": 1568005886.0,
                    "replies": []
                },
                {
                    "body": "You are living my dream! Hopefully I will find a good SB to go on similar experiences with soon.",
                    "author": "LoftDaddy",
                    "id": "ezgv3em",
                    "parent_id": "t1_ezgturi",
                    "score": 3,
                    "created_utc": 1567901870.0,
                    "replies": [
                        {
                            "body": "I am lucky man..  She wants to go to a strip club then dancing... aiiight..! sign this geezer up!\n\nThere are good ones out there!  Don't give up!",
                            "author": "TXPolyDaddy",
                            "id": "ezgwpnm",
                            "parent_id": "t1_ezgv3em",
                            "score": 2,
                            "created_utc": 1567902485.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "These are all POTs and I have been called a dick for not giving money to a stranger as some here have messaged me privately saying the exact same thing.",
            "author": "LoftDaddy",
            "id": "ezhri21",
            "parent_id": "t1_ezhr8tp",
            "score": 3,
            "created_utc": 1567914955.0,
            "replies": []
        },
        {
            "body": "Perhaps I am. There are always possabilities.",
            "author": "LoftDaddy",
            "id": "ezh09qg",
            "parent_id": "t1_ezgy300",
            "score": 1,
            "created_utc": 1567903844.0,
            "replies": []
        },
        {
            "body": "Sounds like we did each other a favor. Thanks for not entering the bowl.",
            "author": "LoftDaddy",
            "id": "ezgyev9",
            "parent_id": "t1_ezgxqg7",
            "score": 13,
            "created_utc": 1567903135.0,
            "replies": []
        },
        {
            "body": "Also, these were all POTS that I had only met within the last week. None of these were arrangements. In the past I have taken great care of those I am involved with. See my comment history if you care.",
            "author": "LoftDaddy",
            "id": "ezgynn4",
            "parent_id": "t1_ezgxqg7",
            "score": 6,
            "created_utc": 1567903228.0,
            "replies": []
        },
        {
            "body": "If you never entered the bowl. Why do you feel the need to comment?  And what in OP's post reads as entitled?",
            "author": "McNihil_88",
            "id": "ezh3e71",
            "parent_id": "t1_ezgxqg7",
            "score": 3,
            "created_utc": 1567905026.0,
            "replies": [
                {
                    "body": "Because i felt a hint of optimism towards this arrangement. My mistake, honestly, if every man is as insecure and needy as sugardaddy 1.0\n I am not here to expose or embardass anybody, but *really*? If you a grown ass man, act like it. Do NOT treat strong women like displaced examples to justify your shit behavior towards the neglected opposite sex. Grow the fuck up, boys.",
                    "author": null,
                    "id": "ezh4t2s",
                    "parent_id": "t1_ezh3e71",
                    "score": -6,
                    "created_utc": 1567905564.0,
                    "replies": [
                        {
                            "body": "I just don't understand where the insecure, needy or shit behaviour was displayed.  Is it because the OP didn't give relative strangers money before they even met?",
                            "author": "McNihil_88",
                            "id": "ezh6mt9",
                            "parent_id": "t1_ezh4t2s",
                            "score": 8,
                            "created_utc": 1567906267.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s POTs I am not generous to. In an actual arrangement I have no problem going well above and beyond.",
            "author": "LoftDaddy",
            "id": "ezh1lc8",
            "parent_id": "t1_ezh11pe",
            "score": 10,
            "created_utc": 1567904336.0,
            "replies": []
        },
        {
            "body": "Huge difference between being generous and getting taken for a sucker.",
            "author": "duckydee543",
            "id": "ezi7mn4",
            "parent_id": "t1_ezh11pe",
            "score": 3,
            "created_utc": 1567922545.0,
            "replies": []
        },
        {
            "body": "I got a nice chuckle out of this one. She probably would’ve brought Michael Avenatti should negotiations have progressed further",
            "author": "Musiq_afficianado",
            "id": "ezh0foa",
            "parent_id": "t1_ezgvf0i",
            "score": 12,
            "created_utc": 1567903906.0,
            "replies": []
        },
        {
            "body": "Legal counsel to be funded out of investment capital.",
            "author": "tra24602",
            "id": "ezjaa3c",
            "parent_id": "t1_ezgvf0i",
            "score": 4,
            "created_utc": 1567941356.0,
            "replies": [
                {
                    "body": "Good call! This was certainly Series A funding.",
                    "author": "LoftDaddy",
                    "id": "ezk7r89",
                    "parent_id": "t1_ezjaa3c",
                    "score": 2,
                    "created_utc": 1567956344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I need my own \"Shark Tank\" for every aspect of my life...",
            "author": null,
            "id": "ezjqw2y",
            "parent_id": "t1_ezjmqk1",
            "score": 2,
            "created_utc": 1567948912.0,
            "replies": []
        },
        {
            "body": "Yes I’ll allow that 😜",
            "author": "ruphun",
            "id": "ezjl4fc",
            "parent_id": "t1_ezhnbry",
            "score": 3,
            "created_utc": 1567946324.0,
            "replies": []
        },
        {
            "body": "That's such a shame that it is older women who should know better as they have had more experience in life. \n\nThe bowl is sadly becoming so diluted.",
            "author": null,
            "id": "ezi0c28",
            "parent_id": "t1_ezhy8my",
            "score": 3,
            "created_utc": 1567919330.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezjn10i",
                    "parent_id": "t1_ezi0c28",
                    "score": 1,
                    "created_utc": 1567947114.0,
                    "replies": [
                        {
                            "body": "Mind blown.\n\nTo go from trying to manipulate the money out of you (by way of showing a lack of professionalism and dedication to her business), to then saying it is a requirement for meeting.\n\nI just don't understand the thought process. \n\nI have never been to the States but I haven't experienced at least half of the things I read here being based in Asia.",
                            "author": null,
                            "id": "ezjo7cj",
                            "parent_id": "t1_ezjn10i",
                            "score": 2,
                            "created_utc": 1567947599.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, unless that's her kink in which case molest and drug away! \n\nI've been lucky enough that I've not had any super horrible experiences. Bad, yes, but nothing my therapist can't handle 😉\n\nThe way I see it, we encounter the trash before the treasure on both sides. The input you've received so far sounds reasonable, but it sounds like you've been through this rodeo before. It is hard sometimes not to get completely bitter, but I just remember the amazing experiences I've had and the ex-sds I'm still friends with, and I keep in mind that this is what I signed up for. It's worth it for now 😊💜",
            "author": "joluna813",
            "id": "ezhfhfj",
            "parent_id": "t1_ezhely9",
            "score": 5,
            "created_utc": 1567909682.0,
            "replies": [
                {
                    "body": "Unfortunately those kinks aren't so common!",
                    "author": "YesToAdventure",
                    "id": "ezjmva3",
                    "parent_id": "t1_ezhfhfj",
                    "score": 2,
                    "created_utc": 1567947048.0,
                    "replies": [
                        {
                            "body": "True. That's what makes us kinky babies a rarity and even more precious 😉😁😆",
                            "author": "joluna813",
                            "id": "ezjnpx8",
                            "parent_id": "t1_ezjmva3",
                            "score": 3,
                            "created_utc": 1567947394.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ezjopkv",
                                    "parent_id": "t1_ezjnpx8",
                                    "score": 3,
                                    "created_utc": 1567947800.0,
                                    "replies": [
                                        {
                                            "body": "😅",
                                            "author": "joluna813",
                                            "id": "ezjpe45",
                                            "parent_id": "t1_ezjopkv",
                                            "score": 2,
                                            "created_utc": 1567948169.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "this is similar to what I think when we hear stories of really asshole guys.  they set the women on edge so they learn not to trust any guys, but they also help all the good guys look even better once someone does get to know us.",
            "author": "joc13",
            "id": "ezho7my",
            "parent_id": "t1_ezhget9",
            "score": 4,
            "created_utc": 1567913352.0,
            "replies": []
        },
        {
            "body": "I was thinking the same.",
            "author": "RealEarthAngel",
            "id": "ezmdd9b",
            "parent_id": "t1_ezhget9",
            "score": 2,
            "created_utc": 1567990339.0,
            "replies": []
        },
        {
            "body": "without dental insurance dentists cost far more than 40 for a simple teeth cleaning at least in new york",
            "author": null,
            "id": "f0k1ufj",
            "parent_id": "t1_ezk9won",
            "score": 1,
            "created_utc": 1568668242.0,
            "replies": [
                {
                    "body": "another example of why it was an obvious lie! gross!",
                    "author": null,
                    "id": "f0ksft7",
                    "parent_id": "t1_f0k1ufj",
                    "score": 1,
                    "created_utc": 1568686902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m surprised, from the post, I figured 18-25. I’m sorry you’re dealing with such scummy people. There really are great SB’s out there and I hope you find yours.",
            "author": "dstoffers",
            "id": "ezgx5ey",
            "parent_id": "t1_ezguxo2",
            "score": 3,
            "created_utc": 1567902654.0,
            "replies": []
        },
        {
            "body": "Your post is a reason I can’t get myself to sign up again. I live in SoCal and find the other bad end of the stick. These ladies makes everyone look bad.",
            "author": "misskansast",
            "id": "ezi4jlg",
            "parent_id": "t1_ezguxo2",
            "score": 2,
            "created_utc": 1567921153.0,
            "replies": []
        },
        {
            "body": "Well that was actually very nice of you.",
            "author": "YourExoticBabe",
            "id": "ezhmpzd",
            "parent_id": "t1_ezhmgh9",
            "score": 1,
            "created_utc": 1567912655.0,
            "replies": []
        },
        {
            "body": "You got me, what is that?",
            "author": "LoftDaddy",
            "id": "ezkg8xz",
            "parent_id": "t1_ezhcygs",
            "score": 2,
            "created_utc": 1567959816.0,
            "replies": []
        },
        {
            "body": ":-)  :-)  :-)  smile, the OP never ever asked for an apology from any of the SBs  :-)  :-)  :-)",
            "author": "highfructoseSD",
            "id": "ezhd4jm",
            "parent_id": "t1_ezgz2h7",
            "score": 6,
            "created_utc": 1567908768.0,
            "replies": []
        },
        {
            "body": "A real queen never has to let a man know her worth. He recognizes it by her personality, her actions and the way she treats everyone.",
            "author": "ruphun",
            "id": "ezjo49z",
            "parent_id": "t1_ezgz2h7",
            "score": 2,
            "created_utc": 1567947564.0,
            "replies": []
        },
        {
            "body": "I agree entirely.",
            "author": "RealEarthAngel",
            "id": "ezn3wpi",
            "parent_id": "t1_ezj6vhb",
            "score": 2,
            "created_utc": 1568000564.0,
            "replies": []
        },
        {
            "body": "Well that blew my theory right out the window.",
            "author": "times_passing_by",
            "id": "ezgyeaf",
            "parent_id": "t1_ezgy51h",
            "score": 2,
            "created_utc": 1567903129.0,
            "replies": []
        },
        {
            "body": "I was hoping it was the one that went well.. LOL",
            "author": "times_passing_by",
            "id": "ezgyi2y",
            "parent_id": "t1_ezgy51h",
            "score": 1,
            "created_utc": 1567903169.0,
            "replies": []
        },
        {
            "body": "sent you a message!",
            "author": "travelingsole",
            "id": "ezhr8hg",
            "parent_id": "t1_ezhr1gx",
            "score": 2,
            "created_utc": 1567914821.0,
            "replies": []
        },
        {
            "body": "I can completely understand that! Frankly, no ‘SB’ should be here out of desperation (or entitlement) either, but that doesn’t seem to stop them.\n\nHope you find a unicorn soon!",
            "author": "oh_sugah",
            "id": "ezhhwt0",
            "parent_id": "t1_ezhgu2b",
            "score": 2,
            "created_utc": 1567910613.0,
            "replies": []
        },
        {
            "body": "Got it,  misunderstood thinking it was a current SB",
            "author": "LotBuilder",
            "id": "ezgoiy2",
            "parent_id": "t1_ezgo0q7",
            "score": -1,
            "created_utc": 1567899413.0,
            "replies": [
                {
                    "body": "There are all POTS, not actual SB",
                    "author": "ruphun",
                    "id": "ezgp2n0",
                    "parent_id": "t1_ezgoiy2",
                    "score": 3,
                    "created_utc": 1567899621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see the beef but at the same time you have to understand it takes a certain level of financial stress that drives a girl to jump on SA.",
            "author": "LotBuilder",
            "id": "ezgovzo",
            "parent_id": "t1_ezgo3bm",
            "score": 1,
            "created_utc": 1567899550.0,
            "replies": [
                {
                    "body": "Very fair and valid point.",
                    "author": "LoftDaddy",
                    "id": "ezgozzs",
                    "parent_id": "t1_ezgovzo",
                    "score": 3,
                    "created_utc": 1567899592.0,
                    "replies": []
                },
                {
                    "body": "None of my SBs have ever shown signs of being in significant financial stress, or they were very good at not mentioning it. They could all pay their bills and cover necessities. A couple of them were quite successful and just downright enjoyed dating older men.",
                    "author": "nw_SD",
                    "id": "ezgqin2",
                    "parent_id": "t1_ezgovzo",
                    "score": 5,
                    "created_utc": 1567900164.0,
                    "replies": [
                        {
                            "body": "Then you are not targeting newbies under 24.",
                            "author": "LotBuilder",
                            "id": "ezgr1zs",
                            "parent_id": "t1_ezgqin2",
                            "score": 1,
                            "created_utc": 1567900361.0,
                            "replies": [
                                {
                                    "body": "Correct. I target POTs that I find interesting regardless of age (within reason).",
                                    "author": "nw_SD",
                                    "id": "ezgsb2j",
                                    "parent_id": "t1_ezgr1zs",
                                    "score": 3,
                                    "created_utc": 1567900829.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The girls jumping on SA out of financial distress/ crisis are the ones that are looking to rinse. You’re not likely going to have a lasting sugar relationship. If you’re happy with a one and done, that might be ok.",
                    "author": "dstoffers",
                    "id": "ezgxrtj",
                    "parent_id": "t1_ezgovzo",
                    "score": 2,
                    "created_utc": 1567902889.0,
                    "replies": [
                        {
                            "body": "It’s a high risk high reward game I’ve been playing for 10 years.  You get the rinsers and chaos queens but you also can catch them when they are unjaded and inexperienced and you can create a true long term relationship with very reasonable financial expectations.",
                            "author": "LotBuilder",
                            "id": "ezh039s",
                            "parent_id": "t1_ezgxrtj",
                            "score": -4,
                            "created_utc": 1567903777.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "From what I have heard from countless men, I have reason to believe there are more authentic SDs than suitable SBs… and this thread would seem to support that.\nJust being a “hottie with a hardbody” doesn’t automatically qualify one to be a suitable SB (although it definitely doesn’t hurt).  For the SDs with whom I’ve been involved, it also takes a good personality, a modicum of intelligence, and a nice vibe as well to be an SB with any staying power.",
            "author": "RealEarthAngel",
            "id": "eznh69h",
            "parent_id": "t1_ezgturi",
            "score": 2,
            "created_utc": 1568005886.0,
            "replies": []
        },
        {
            "body": "You are living my dream! Hopefully I will find a good SB to go on similar experiences with soon.",
            "author": "LoftDaddy",
            "id": "ezgv3em",
            "parent_id": "t1_ezgturi",
            "score": 3,
            "created_utc": 1567901870.0,
            "replies": [
                {
                    "body": "I am lucky man..  She wants to go to a strip club then dancing... aiiight..! sign this geezer up!\n\nThere are good ones out there!  Don't give up!",
                    "author": "TXPolyDaddy",
                    "id": "ezgwpnm",
                    "parent_id": "t1_ezgv3em",
                    "score": 2,
                    "created_utc": 1567902485.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because i felt a hint of optimism towards this arrangement. My mistake, honestly, if every man is as insecure and needy as sugardaddy 1.0\n I am not here to expose or embardass anybody, but *really*? If you a grown ass man, act like it. Do NOT treat strong women like displaced examples to justify your shit behavior towards the neglected opposite sex. Grow the fuck up, boys.",
            "author": null,
            "id": "ezh4t2s",
            "parent_id": "t1_ezh3e71",
            "score": -6,
            "created_utc": 1567905564.0,
            "replies": [
                {
                    "body": "I just don't understand where the insecure, needy or shit behaviour was displayed.  Is it because the OP didn't give relative strangers money before they even met?",
                    "author": "McNihil_88",
                    "id": "ezh6mt9",
                    "parent_id": "t1_ezh4t2s",
                    "score": 8,
                    "created_utc": 1567906267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good call! This was certainly Series A funding.",
            "author": "LoftDaddy",
            "id": "ezk7r89",
            "parent_id": "t1_ezjaa3c",
            "score": 2,
            "created_utc": 1567956344.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezjn10i",
            "parent_id": "t1_ezi0c28",
            "score": 1,
            "created_utc": 1567947114.0,
            "replies": [
                {
                    "body": "Mind blown.\n\nTo go from trying to manipulate the money out of you (by way of showing a lack of professionalism and dedication to her business), to then saying it is a requirement for meeting.\n\nI just don't understand the thought process. \n\nI have never been to the States but I haven't experienced at least half of the things I read here being based in Asia.",
                    "author": null,
                    "id": "ezjo7cj",
                    "parent_id": "t1_ezjn10i",
                    "score": 2,
                    "created_utc": 1567947599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately those kinks aren't so common!",
            "author": "YesToAdventure",
            "id": "ezjmva3",
            "parent_id": "t1_ezhfhfj",
            "score": 2,
            "created_utc": 1567947048.0,
            "replies": [
                {
                    "body": "True. That's what makes us kinky babies a rarity and even more precious 😉😁😆",
                    "author": "joluna813",
                    "id": "ezjnpx8",
                    "parent_id": "t1_ezjmva3",
                    "score": 3,
                    "created_utc": 1567947394.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ezjopkv",
                            "parent_id": "t1_ezjnpx8",
                            "score": 3,
                            "created_utc": 1567947800.0,
                            "replies": [
                                {
                                    "body": "😅",
                                    "author": "joluna813",
                                    "id": "ezjpe45",
                                    "parent_id": "t1_ezjopkv",
                                    "score": 2,
                                    "created_utc": 1567948169.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "another example of why it was an obvious lie! gross!",
            "author": null,
            "id": "f0ksft7",
            "parent_id": "t1_f0k1ufj",
            "score": 1,
            "created_utc": 1568686902.0,
            "replies": []
        },
        {
            "body": "There are all POTS, not actual SB",
            "author": "ruphun",
            "id": "ezgp2n0",
            "parent_id": "t1_ezgoiy2",
            "score": 3,
            "created_utc": 1567899621.0,
            "replies": []
        },
        {
            "body": "Very fair and valid point.",
            "author": "LoftDaddy",
            "id": "ezgozzs",
            "parent_id": "t1_ezgovzo",
            "score": 3,
            "created_utc": 1567899592.0,
            "replies": []
        },
        {
            "body": "None of my SBs have ever shown signs of being in significant financial stress, or they were very good at not mentioning it. They could all pay their bills and cover necessities. A couple of them were quite successful and just downright enjoyed dating older men.",
            "author": "nw_SD",
            "id": "ezgqin2",
            "parent_id": "t1_ezgovzo",
            "score": 5,
            "created_utc": 1567900164.0,
            "replies": [
                {
                    "body": "Then you are not targeting newbies under 24.",
                    "author": "LotBuilder",
                    "id": "ezgr1zs",
                    "parent_id": "t1_ezgqin2",
                    "score": 1,
                    "created_utc": 1567900361.0,
                    "replies": [
                        {
                            "body": "Correct. I target POTs that I find interesting regardless of age (within reason).",
                            "author": "nw_SD",
                            "id": "ezgsb2j",
                            "parent_id": "t1_ezgr1zs",
                            "score": 3,
                            "created_utc": 1567900829.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The girls jumping on SA out of financial distress/ crisis are the ones that are looking to rinse. You’re not likely going to have a lasting sugar relationship. If you’re happy with a one and done, that might be ok.",
            "author": "dstoffers",
            "id": "ezgxrtj",
            "parent_id": "t1_ezgovzo",
            "score": 2,
            "created_utc": 1567902889.0,
            "replies": [
                {
                    "body": "It’s a high risk high reward game I’ve been playing for 10 years.  You get the rinsers and chaos queens but you also can catch them when they are unjaded and inexperienced and you can create a true long term relationship with very reasonable financial expectations.",
                    "author": "LotBuilder",
                    "id": "ezh039s",
                    "parent_id": "t1_ezgxrtj",
                    "score": -4,
                    "created_utc": 1567903777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am lucky man..  She wants to go to a strip club then dancing... aiiight..! sign this geezer up!\n\nThere are good ones out there!  Don't give up!",
            "author": "TXPolyDaddy",
            "id": "ezgwpnm",
            "parent_id": "t1_ezgv3em",
            "score": 2,
            "created_utc": 1567902485.0,
            "replies": []
        },
        {
            "body": "I just don't understand where the insecure, needy or shit behaviour was displayed.  Is it because the OP didn't give relative strangers money before they even met?",
            "author": "McNihil_88",
            "id": "ezh6mt9",
            "parent_id": "t1_ezh4t2s",
            "score": 8,
            "created_utc": 1567906267.0,
            "replies": []
        },
        {
            "body": "Mind blown.\n\nTo go from trying to manipulate the money out of you (by way of showing a lack of professionalism and dedication to her business), to then saying it is a requirement for meeting.\n\nI just don't understand the thought process. \n\nI have never been to the States but I haven't experienced at least half of the things I read here being based in Asia.",
            "author": null,
            "id": "ezjo7cj",
            "parent_id": "t1_ezjn10i",
            "score": 2,
            "created_utc": 1567947599.0,
            "replies": []
        },
        {
            "body": "True. That's what makes us kinky babies a rarity and even more precious 😉😁😆",
            "author": "joluna813",
            "id": "ezjnpx8",
            "parent_id": "t1_ezjmva3",
            "score": 3,
            "created_utc": 1567947394.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ezjopkv",
                    "parent_id": "t1_ezjnpx8",
                    "score": 3,
                    "created_utc": 1567947800.0,
                    "replies": [
                        {
                            "body": "😅",
                            "author": "joluna813",
                            "id": "ezjpe45",
                            "parent_id": "t1_ezjopkv",
                            "score": 2,
                            "created_utc": 1567948169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then you are not targeting newbies under 24.",
            "author": "LotBuilder",
            "id": "ezgr1zs",
            "parent_id": "t1_ezgqin2",
            "score": 1,
            "created_utc": 1567900361.0,
            "replies": [
                {
                    "body": "Correct. I target POTs that I find interesting regardless of age (within reason).",
                    "author": "nw_SD",
                    "id": "ezgsb2j",
                    "parent_id": "t1_ezgr1zs",
                    "score": 3,
                    "created_utc": 1567900829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s a high risk high reward game I’ve been playing for 10 years.  You get the rinsers and chaos queens but you also can catch them when they are unjaded and inexperienced and you can create a true long term relationship with very reasonable financial expectations.",
            "author": "LotBuilder",
            "id": "ezh039s",
            "parent_id": "t1_ezgxrtj",
            "score": -4,
            "created_utc": 1567903777.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ezjopkv",
            "parent_id": "t1_ezjnpx8",
            "score": 3,
            "created_utc": 1567947800.0,
            "replies": [
                {
                    "body": "😅",
                    "author": "joluna813",
                    "id": "ezjpe45",
                    "parent_id": "t1_ezjopkv",
                    "score": 2,
                    "created_utc": 1567948169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Correct. I target POTs that I find interesting regardless of age (within reason).",
            "author": "nw_SD",
            "id": "ezgsb2j",
            "parent_id": "t1_ezgr1zs",
            "score": 3,
            "created_utc": 1567900829.0,
            "replies": []
        },
        {
            "body": "😅",
            "author": "joluna813",
            "id": "ezjpe45",
            "parent_id": "t1_ezjopkv",
            "score": 2,
            "created_utc": 1567948169.0,
            "replies": []
        }
    ]
}