{
    "title": "To the man who gave his 101%",
    "post_id": "mzo6is",
    "post_url": "https://www.reddit.com/r/runningman/comments/mzo6is/to_the_man_who_gave_his_101/",
    "author": "its-me-dave",
    "body": "RM has been running for 11 years now and at one point I thought that they could run for another decade or so but with the news that was released today, reality is catching up to us, the runners, but especially to the members.\n\nI've tuned in to RM for a couple of years now. I watched my first episode during the period when I was preparing for the toughest exam of my life which was my licensure exam. I could safely say that RM got me through all the months of stress and sleepless nights. RM has been a comfort and stress reliever for me but I know the show means even more to some of us. \n\nIt's kind of a weird feeling you know; The RM members don't even know me but somehow I feel attached to them like as they were running all those years, I've been running with them and I'd bet a lot of us here feel the same way.\n\nNow, I would like to offer the highest form of appreciation to Lee Kwang soo. RM has given a lot to Kwang soo but Kwang soo has given everything for RM. Kwang soo doesn't even know the meaning of \"No\" in RM. \n\n*Wrestling match with Jihyo?\n\nKwang soo: I got this.\n\n*Eating food that's already been in So min's mouth?\n\nKwang soo: I got this.\n\n*Receives a mission to make a paper plane out of their take out containers but he only has banana and orange peels?\n\nKwang soo: I got this.\n\n*Gets in an accident and injures his foot that normally requires a month or two to recover?\n\nKwang soo: I got this (immediately returns in less than a month)\n\nWe've invaded his apartment, met his parents and we've watched him meet the love of his life. We've seen him in his underwear, his censored butt and many more embarrassing moments throughout his RM run. Yes, he's worn many bald caps, face paints, flour and icing on his face and he even dressed up as a tree, but still he gives 101% percent. Although he's never received one Daesang (Grand prize) for his 11 years of RM work, he has brought millions of laughter and smiles to runners around the globe.\n\nHe may be considered as RM's prince of betrayal but everybody knows that Kwang soo's loyalty will always be with RM. Yes that's a bit cheesy but the truth is sometimes cheesy.\n\nFor over 500 episodes, Kwang soo was always running around and chasing the prize on screen but seeing him always giving his everything, his 101%, in RM and his acting career, I'm happy and confident in saying that this time, success and happiness will be the ones chasing after him now . With all that said, together we shout his forever iconic \"ANDWAAAAAAAAAE\"\n\nEDIT: Reading the comments made me think how huge Kwang soo has contributed to the world of variety entertainment and also, our lives as viewers. I hope he knows how much we appreciate everything he did. Yes, RM is just a show but somehow Kwang soo and RM made life a little bit better you know. Mondays are universally hated but somehow Runners look forward to it because there's gonna be a new subbed RM episode. I can't imagine how the staff and other members must be feeling after being with him for 11 years. We have friends we met in high school or college who we're attached to, how much more a person that's been with you through a decade so now I kind of understand why I and a lot us are emotional. It's nice and comforting to read through the messages and comments of support and unforgettable moments with Kwang soo. To the man who doesn't have \"quit\" and \"give up\" in his vocabulary and to him who is the absolute definition of dedication, we give our highest respect and greatest salute.",
    "url": "https://www.reddit.com/r/runningman/comments/mzo6is/to_the_man_who_gave_his_101/",
    "score": 508,
    "upvote_ratio": 1.0,
    "created_utc": 1619529234.0,
    "num_comments": 16,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Traveled seoul to busan to help out yjs and jsj just because he owe yjs a slap. That's dedication just to receive punishments lol\n\nHe's also prolly the member that challenges and exploits loopholes the most in games. He really did his 101% without major controversies. Will definitely miss him.",
            "author": "xmodifier",
            "id": "gw28l7z",
            "parent_id": "t3_mzo6is",
            "score": 101,
            "created_utc": 1619538195.0,
            "replies": []
        },
        {
            "body": "Cue music [Saint Agnes and the burning train](https://youtu.be/Zn-XxGlw6aU)",
            "author": "lantern_11",
            "id": "gw31dki",
            "parent_id": "t3_mzo6is",
            "score": 35,
            "created_utc": 1619550290.0,
            "replies": []
        },
        {
            "body": "omg youre making me cry😭",
            "author": "howdoyooplay",
            "id": "gw21zah",
            "parent_id": "t3_mzo6is",
            "score": 34,
            "created_utc": 1619535363.0,
            "replies": []
        },
        {
            "body": "I was very saddened by the news. But I keep thinking about how much pain he must’ve been in as he pushed through to do silly tasks to make us laugh. He truly is an entertainer.",
            "author": null,
            "id": "gw3x4ec",
            "parent_id": "t3_mzo6is",
            "score": 18,
            "created_utc": 1619564368.0,
            "replies": []
        },
        {
            "body": "“To the man who gave his 101%” very fitting when describing Kwangsoo",
            "author": "roses__are__rosie",
            "id": "gw1rptz",
            "parent_id": "t3_mzo6is",
            "score": 33,
            "created_utc": 1619530730.0,
            "replies": []
        },
        {
            "body": "It's incredible how long the members lasted...purely from a physical toll the show takes on the body!  \n\nThe guests even said after taping the show, they'd spend the next day in bed, or get physical therapy....that's from one show...imagine doing it every week, or two back to back days for 11 years!  Ha Ha said it in a video that all the members have injuries and they keep on showing up!\n\nMost of the posts and comments are very positive, but just in case you want to be toxic to one of the members, remember what they go through to make you life a little bit better!",
            "author": "brokejackma",
            "id": "gw3ljbn",
            "parent_id": "t3_mzo6is",
            "score": 20,
            "created_utc": 1619558938.0,
            "replies": [
                {
                    "body": "I had read that HaHa said that and it made me sad. I don't want to cause anyone pain for my own entertainment. I love this show with all my heart and LKS has been my bias so I will bawl when the time comes but I am glad he is taking care of himself.",
                    "author": "sassycat13",
                    "id": "gxil4re",
                    "parent_id": "t1_gw3ljbn",
                    "score": 1,
                    "created_utc": 1620580754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And so I give him my respect: Betray! Betray!",
            "author": "KillJoy-Player",
            "id": "gw3n2k6",
            "parent_id": "t3_mzo6is",
            "score": 8,
            "created_utc": 1619559628.0,
            "replies": []
        },
        {
            "body": "Man, if that accident did not happen, then this news will never exist",
            "author": "Black_Crow-09",
            "id": "gw3lbk7",
            "parent_id": "t3_mzo6is",
            "score": 10,
            "created_utc": 1619558839.0,
            "replies": []
        },
        {
            "body": "We need to move on sooner or later.. as a fan I agreed with his decisions..yes without him RM is not the same cause he the man that always go all in in every episode... hope he can come again as guest from time to time.. and hope he success in acting career too. that's all.. we need to move on",
            "author": null,
            "id": "gw1zjh4",
            "parent_id": "t3_mzo6is",
            "score": 13,
            "created_utc": 1619534322.0,
            "replies": [
                {
                    "body": "Lol it's fine for fans to reminisce for the next few days regarding LKS's departure. This rarely happens and you can even say it's a larger impact than Gary leaving.",
                    "author": "Erens-Basement",
                    "id": "gw4ds1a",
                    "parent_id": "t1_gw1zjh4",
                    "score": 8,
                    "created_utc": 1619572722.0,
                    "replies": []
                },
                {
                    "body": "Kwang Soo is my favorite member and he is for sure irreplaceable, but if he's gone I wouldn't mind see Kang han-na, Hong jin young or Lee sang yeob on his place, of course a lot of people would go mad about it, but it was the same with se chan and so min and with time they turned out to be a great addition to the cast, the most important is to keep running man going, with or without kwang soo",
                    "author": "eldelmazo",
                    "id": "gw3jhgi",
                    "parent_id": "t1_gw1zjh4",
                    "score": 6,
                    "created_utc": 1619558012.0,
                    "replies": [
                        {
                            "body": "No. Don't add another member. I'm really sure that person whoever is it is gonna be hated and bullied. They able to maintain RM with 7 member for several years so i think there's no problem in team composition.",
                            "author": "DryDelay8078",
                            "id": "gw3oo05",
                            "parent_id": "t1_gw3jhgi",
                            "score": 10,
                            "created_utc": 1619560359.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just saw the news... I’m shocked and sad. Is it bad that I am a little relieved that he is only leaving due to injury? Like he would stay on the show, but he just physically can’t. \n    \nHe was my first favorite member and has given so much of himself every episode. I will continue to support him in all his movies and dramas in the future. I’m sure he’ll make appearances on RM again as a guest sometimes, right?",
            "author": "lilpuzz",
            "id": "gw4u4tr",
            "parent_id": "t3_mzo6is",
            "score": 2,
            "created_utc": 1619581483.0,
            "replies": []
        },
        {
            "body": "Im crying again. 😭😭 Ive been crying since yesterday 😭😭",
            "author": "afrf",
            "id": "gw4wdpb",
            "parent_id": "t3_mzo6is",
            "score": 2,
            "created_utc": 1619582869.0,
            "replies": []
        },
        {
            "body": "I remember one episode (I think it was one of the food ones with the lobster pizza) when Kwangsoo said, \"It hurts so much every week\" after getting his sideburns pulled. \n\nNo one gave more than him every single week, despite wins and prizes becoming harder to achieve as both the RM members and guests began to sabotage him more frequently (particularly this year).",
            "author": "xander_yi",
            "id": "gw550l4",
            "parent_id": "t3_mzo6is",
            "score": 1,
            "created_utc": 1619589060.0,
            "replies": []
        },
        {
            "body": "I had read that HaHa said that and it made me sad. I don't want to cause anyone pain for my own entertainment. I love this show with all my heart and LKS has been my bias so I will bawl when the time comes but I am glad he is taking care of himself.",
            "author": "sassycat13",
            "id": "gxil4re",
            "parent_id": "t1_gw3ljbn",
            "score": 1,
            "created_utc": 1620580754.0,
            "replies": []
        },
        {
            "body": "Lol it's fine for fans to reminisce for the next few days regarding LKS's departure. This rarely happens and you can even say it's a larger impact than Gary leaving.",
            "author": "Erens-Basement",
            "id": "gw4ds1a",
            "parent_id": "t1_gw1zjh4",
            "score": 8,
            "created_utc": 1619572722.0,
            "replies": []
        },
        {
            "body": "Kwang Soo is my favorite member and he is for sure irreplaceable, but if he's gone I wouldn't mind see Kang han-na, Hong jin young or Lee sang yeob on his place, of course a lot of people would go mad about it, but it was the same with se chan and so min and with time they turned out to be a great addition to the cast, the most important is to keep running man going, with or without kwang soo",
            "author": "eldelmazo",
            "id": "gw3jhgi",
            "parent_id": "t1_gw1zjh4",
            "score": 6,
            "created_utc": 1619558012.0,
            "replies": [
                {
                    "body": "No. Don't add another member. I'm really sure that person whoever is it is gonna be hated and bullied. They able to maintain RM with 7 member for several years so i think there's no problem in team composition.",
                    "author": "DryDelay8078",
                    "id": "gw3oo05",
                    "parent_id": "t1_gw3jhgi",
                    "score": 10,
                    "created_utc": 1619560359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No. Don't add another member. I'm really sure that person whoever is it is gonna be hated and bullied. They able to maintain RM with 7 member for several years so i think there's no problem in team composition.",
            "author": "DryDelay8078",
            "id": "gw3oo05",
            "parent_id": "t1_gw3jhgi",
            "score": 10,
            "created_utc": 1619560359.0,
            "replies": []
        }
    ]
}