{
    "title": "Sasuke had no chill",
    "post_id": "nxqsei",
    "post_url": "https://www.reddit.com/r/dankruto/comments/nxqsei/sasuke_had_no_chill/",
    "author": "TheTruth1410",
    "body": "",
    "url": "https://i.redd.it/bm49vg03gp471.jpg",
    "score": 3712,
    "upvote_ratio": 0.99,
    "created_utc": 1623447055.0,
    "num_comments": 42,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Gotta hand it to sasuke and naruto, both got done fighting and still went for another 1 v 1 after the war hahaha",
            "author": null,
            "id": "h1g8w5u",
            "parent_id": "t3_nxqsei",
            "score": 241,
            "created_utc": 1623447215.0,
            "replies": [
                {
                    "body": "Yet Sasuke easily ran out of Chakra in Boruto.",
                    "author": "x4nter",
                    "id": "h1htjpn",
                    "parent_id": "t1_h1g8w5u",
                    "score": 43,
                    "created_utc": 1623483279.0,
                    "replies": [
                        {
                            "body": "It kinda seems like as ninja age they run outta chakra more easily. Only kinda",
                            "author": "KinkyGCM",
                            "id": "h1ie9zr",
                            "parent_id": "t1_h1htjpn",
                            "score": 11,
                            "created_utc": 1623501894.0,
                            "replies": [
                                {
                                    "body": "No, only if you're Uchiha Sasuke.",
                                    "author": "TyrionGoldenLion",
                                    "id": "h1ijnsd",
                                    "parent_id": "t1_h1ie9zr",
                                    "score": 10,
                                    "created_utc": 1623505359.0,
                                    "replies": [
                                        {
                                            "body": "Kakashi too lol. He is supposed to be this badass, but throughout the series can only churn out one or two moves before getting low on chakra lol.",
                                            "author": "omgrafail",
                                            "id": "h1iq7xr",
                                            "parent_id": "t1_h1ijnsd",
                                            "score": 5,
                                            "created_utc": 1623509024.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, but then in the war he’s able to spam everything without much problem even though he’s older then than in any previous time we’ve seen him fight",
                                                    "author": "frozen2665",
                                                    "id": "h1isscp",
                                                    "parent_id": "t1_h1iq7xr",
                                                    "score": 10,
                                                    "created_utc": 1623510369.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nah you idiot *wheeze* I’m not tired",
                    "author": "suzellezus",
                    "id": "h1hoopp",
                    "parent_id": "t1_h1g8w5u",
                    "score": 29,
                    "created_utc": 1623478934.0,
                    "replies": []
                },
                {
                    "body": "They're good bros, they always have energy for each other.",
                    "author": "TyrionGoldenLion",
                    "id": "h1ijp61",
                    "parent_id": "t1_h1g8w5u",
                    "score": 6,
                    "created_utc": 1623505382.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Real talk though, no one in the series raised the tension as much as sasuke sealing the tailed beasts",
            "author": "Maverick_Raptor",
            "id": "h1h3v6u",
            "parent_id": "t3_nxqsei",
            "score": 132,
            "created_utc": 1623464505.0,
            "replies": [
                {
                    "body": "chunin exams tenten",
                    "author": "Its_Cade",
                    "id": "h1h8occ",
                    "parent_id": "t1_h1h3v6u",
                    "score": 84,
                    "created_utc": 1623467410.0,
                    "replies": [
                        {
                            "body": "I think you meant *the yellow flash of the village",
                            "author": "8rok3n",
                            "id": "h1hafcg",
                            "parent_id": "t1_h1h8occ",
                            "score": 36,
                            "created_utc": 1623468513.0,
                            "replies": [
                                {
                                    "body": "Tenten's nickname so it's the same thing.",
                                    "author": "TyrionGoldenLion",
                                    "id": "h1ijrkn",
                                    "parent_id": "t1_h1hafcg",
                                    "score": 9,
                                    "created_utc": 1623505423.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto: we did it! War’s over!\n\n\nSasuke: Scrap\n\n\n\nNaruto: wha-\n\n\nSasuke: Scrap",
            "author": "Pac_Zach_Attack",
            "id": "h1hmydz",
            "parent_id": "t3_nxqsei",
            "score": 39,
            "created_utc": 1623477466.0,
            "replies": []
        },
        {
            "body": "Dang",
            "author": "Mogon12",
            "id": "h1h0f59",
            "parent_id": "t3_nxqsei",
            "score": 17,
            "created_utc": 1623462508.0,
            "replies": []
        },
        {
            "body": "what was his reasoning again?",
            "author": "Wet-Sox",
            "id": "h1hbmdu",
            "parent_id": "t3_nxqsei",
            "score": 14,
            "created_utc": 1623469278.0,
            "replies": [
                {
                    "body": "There needs to be a person that is hated to bring people together and make the harsh shots I think",
                    "author": "TheBossMeansMe",
                    "id": "h1hcwxm",
                    "parent_id": "t1_h1hbmdu",
                    "score": 49,
                    "created_utc": 1623470122.0,
                    "replies": [
                        {
                            "body": "Just proving that Sasuke learned absolutely nothing until his arm was gone, and even then it’s debatable",
                            "author": "EnflamedHuevos",
                            "id": "h1he59r",
                            "parent_id": "t1_h1hcwxm",
                            "score": 51,
                            "created_utc": 1623470948.0,
                            "replies": [
                                {
                                    "body": "It worked fo lelouch",
                                    "author": "Locked-man",
                                    "id": "h1ho0u3",
                                    "parent_id": "t1_h1he59r",
                                    "score": 18,
                                    "created_utc": 1623478368.0,
                                    "replies": []
                                },
                                {
                                    "body": "The evil was in his arms all along!",
                                    "author": "TyrionGoldenLion",
                                    "id": "h1ijtj7",
                                    "parent_id": "t1_h1he59r",
                                    "score": 6,
                                    "created_utc": 1623505456.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sasuke was ripping off Lelouch and Ozymandias.",
                            "author": "TyrionGoldenLion",
                            "id": "h1ijv83",
                            "parent_id": "t1_h1hcwxm",
                            "score": 3,
                            "created_utc": 1623505483.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Actually his logic makes realistic sense, cause people generally come together only if there's a huge single problem like tsukiyomi by madara. No one would actually stay allies after the war. Take for instance the covid disease irl, people sorta worked together for a core issue but after this, its back to usual.. Sasuke wanted to be that core problem by being hokage and take in all the hatred so everyone is together. Naruto on the other hand says people can change and work together",
                    "author": "Sasuke12187",
                    "id": "h1i92bi",
                    "parent_id": "t1_h1hbmdu",
                    "score": 8,
                    "created_utc": 1623497957.0,
                    "replies": [
                        {
                            "body": "Yeah except in that context, it made no sense. People had already come together against their mutual enemy and Naruto was right.\n\nBesides, Sasuke knew he was part of a shitty cycle of reincarnation who tried to rule with fear and all failed. Sasuke's impulsive made no sense as he had learnt nothing from his experiences.",
                            "author": "TyrionGoldenLion",
                            "id": "h1ik0am",
                            "parent_id": "t1_h1i92bi",
                            "score": 6,
                            "created_utc": 1623505566.0,
                            "replies": [
                                {
                                    "body": "Blame Kishimoto for having planned a Naruto vs Sasuke final battle. He needed to make Sasuke villainous enough for that. Up to point where he joined the alliance I quite loved his character arc. Even when he snapped at the kage summit and started killing samurais who were getting in his way of finding and killing Danzo...I understood why he was like that. The consecutive traumatic experiences he received from Itachi, Orochimaru's curse when he was younger and finally the cruel and unimaginable truth that Tobi revealed to him worsened his mental and emotional state significantly. I'm surprised that he was able to handle all that hatred, anger and depression he received from early on without ever going too far as to kill innocents on a whim. The manipulation that was done to him was also kinda extreme. He still managed to disobey his brother when he instructed him to kill his best friend, outsmart Orochimaru and free the prisoners that he experimented upon, recreate a version of team seven that he came to care for showing us that he never really managed to sever his bonds with them and so on. Even when he learned the truth from Tobi he didn't instantly believe him. His anger towards the leaf stemmed from the fact that they used his brother as an obedient tool to exact their corrupted version of justice which justified his clan's genocide. Still, I don't think he'd target any innocent people first despite what he preached to everyone and to himself. That's why he went to find Danzo first and questioned him about the correct version of events. On top of that he saw Danzo's abomination of an arm that carried his clan's eyes. That was another strong trigger for his sanity. That's why he attacked his former team with the intent to kill(although Sakura was the one who attacked him first both times). Even then he stopped and listened to Naruto's reasoning as to why he doesn't want to give up on him and that he understands the pain and anger he feels after what Konoha has done to him. He was shocked that Naruto felt so strongly for him after everything he did to keep him away. And he agreed to fight him first before attacking everyone else. I believe that he didn't care if he died trying. At least he regained some semblance of sanity and he betrayed Obito and the Akatsuki afterwards. Still, his crimes are not to be justified. But when you think about how many villains got away with much worse and heinous crimes than Sasuke for a longer time...he really wasn't that bad. Plus, his different phases have added a lot of excitement in the series. \nI just can't get behind Kishimoto's last resort to regress his character development further. I mean, I understand the reasoning behind his plan to kill the kages and the jinchurikies and focus all the hatred on him to prevent the nations and villages from going at each others' throats(a plan that resembled Itachi's way of doing things for the peace of Konoha)...but it went against what he took from the previous hokages and his confrontation with Itachi. It all boils down to Kishimoto making the Uchihas a generation originating from a demigod who went evil and attacked everyone and the animosity between the incarnations of Indra and Ashura being destined to clash against each other. Plus Naruto's destiny which entailed him going against a young man with powerful eyes, namely Sasuke. It damaged the series imo and Sasuke wasn't the only one whose quality was reduced. He is still the most interesting who had the most development in my opinion. And he is the highlight of the Boruto series along with Naruto.",
                                    "author": "HoldIllustrious2598",
                                    "id": "h1wjzin",
                                    "parent_id": "t1_h1ik0am",
                                    "score": 2,
                                    "created_utc": 1623797363.0,
                                    "replies": [
                                        {
                                            "body": "I mean, Kishimoto's writing is at fault but that's besides the point. From what I see, he had intended to make Sasuke consistently more insane. First he only wanted to kill Danzo, then the elders, then he demanded Konoha's destruction and then the Gokage. His thirst for revenge was never satiated and I guess that's the message Kishimoto was trying to convey.\n\nBut I guess before anything else, Naruto was a generic shounen with lots of ouutside interference, meaning fan-service (fights included) >>>>> Plot and themes",
                                            "author": "TyrionGoldenLion",
                                            "id": "h1y3mal",
                                            "parent_id": "t1_h1wjzin",
                                            "score": 1,
                                            "created_utc": 1623831819.0,
                                            "replies": [
                                                {
                                                    "body": "I agree that that's the message he managed to convey... Honestly, there are fanfictions out there that explore the themes and characters better than Kishimoto has.",
                                                    "author": "HoldIllustrious2598",
                                                    "id": "h1z3ujj",
                                                    "parent_id": "t1_h1y3mal",
                                                    "score": 1,
                                                    "created_utc": 1623855636.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "h1z7bpu",
                                                            "parent_id": "t1_h1z3ujj",
                                                            "score": 1,
                                                            "created_utc": 1623857094.0,
                                                            "replies": [
                                                                {
                                                                    "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                                                                    "author": "HoldIllustrious2598",
                                                                    "id": "h1zfuzc",
                                                                    "parent_id": "t1_h1z7bpu",
                                                                    "score": 2,
                                                                    "created_utc": 1623860677.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You too!",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "h1zlgbh",
                                                                            "parent_id": "t1_h1zfuzc",
                                                                            "score": 1,
                                                                            "created_utc": 1623863069.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He went to call Naruto **sus**anoo.\n\nI’m so sorry.",
            "author": "Anaverageshitposter6",
            "id": "h1gwcs4",
            "parent_id": "t3_nxqsei",
            "score": 79,
            "created_utc": 1623460165.0,
            "replies": [
                {
                    "body": "GET OUT OF MY HEAD",
                    "author": "Preet0024",
                    "id": "h1gx8lm",
                    "parent_id": "t1_h1gwcs4",
                    "score": 32,
                    "created_utc": 1623460675.0,
                    "replies": []
                },
                {
                    "body": "Sussy baka 🥲🤩😚😄🤣😄🤣😚🤩😘😛😔😝😑😜🙂🤭😙🤗😄😂😄🤩😘😏😘😏☺️😝🥲😉😙😚😛😘😋🥰🥰😋😘😏😚😌😙🥳🤣🥲😂☺️😋😆😋😁😋😆🥳😕😬😟😬😯😟😦😣😦😱🤐😕🤨🤫🤨🤬😐😡🧐😯🙄😯😦😲😕😱🙁🤐😲😲🧐😱🤥🤑🤧🤡🤧🥶🤒🥶😎🥸😎👿🎃👿🤖👹👽👺😇🤡🤧🥶😴😪🌞😪🥵🥵😓🌞😓😫😲😧😲😕🙁🤐🙁😱😧😩😧😣🙁🤐🙁🤐",
                    "author": "ElitenemesisX",
                    "id": "h1h75m0",
                    "parent_id": "t1_h1gwcs4",
                    "score": 14,
                    "created_utc": 1623466452.0,
                    "replies": [
                        {
                            "body": "No emogi on reddit 😡",
                            "author": "mari025",
                            "id": "h1hzwz5",
                            "parent_id": "t1_h1h75m0",
                            "score": -3,
                            "created_utc": 1623489500.0,
                            "replies": [
                                {
                                    "body": "emogi is the plural for emogus",
                                    "author": "LordPos",
                                    "id": "h1j0aor",
                                    "parent_id": "t1_h1hzwz5",
                                    "score": 3,
                                    "created_utc": 1623514265.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That title is pretty much the entire story of Naruto in a nutshell",
            "author": "You8mypizza",
            "id": "h1hgaue",
            "parent_id": "t3_nxqsei",
            "score": 10,
            "created_utc": 1623472415.0,
            "replies": []
        },
        {
            "body": "Gotta say, the fact that sasuke never used his rinnegan to be a cyborg and shoot missiles and lasers at people is just wasted potential",
            "author": "aewitz14",
            "id": "h1i8u2y",
            "parent_id": "t3_nxqsei",
            "score": 7,
            "created_utc": 1623497767.0,
            "replies": [
                {
                    "body": "Why doesn't he just shit deadly rainbows on the Otsutsuku in Burrito?",
                    "author": "TyrionGoldenLion",
                    "id": "h1ik3eo",
                    "parent_id": "t1_h1i8u2y",
                    "score": 3,
                    "created_utc": 1623505618.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's coming back to village...          ...to destroy it!",
            "author": "Over_Room_1889",
            "id": "h1hobq3",
            "parent_id": "t3_nxqsei",
            "score": 6,
            "created_utc": 1623478626.0,
            "replies": []
        },
        {
            "body": "its revolution mfs XD",
            "author": "siddanthnaineni",
            "id": "h1h7qbt",
            "parent_id": "t3_nxqsei",
            "score": 10,
            "created_utc": 1623466801.0,
            "replies": []
        },
        {
            "body": "Sasuke wanting to fight Naruto after the war seemed so rushed and out of pocket to me. It’s like Kishi forgot the whole “naruto and sasuke are destined to fight again” thing and has to pull a “oh shit uh sasuke is still evil” out of his ass to make good on the promise.",
            "author": "Monochrome21",
            "id": "h1ilm0h",
            "parent_id": "t3_nxqsei",
            "score": 2,
            "created_utc": 1623506499.0,
            "replies": []
        },
        {
            "body": "Uchiha is better Dead",
            "author": "Andirion",
            "id": "h1kihob",
            "parent_id": "t3_nxqsei",
            "score": 1,
            "created_utc": 1623542873.0,
            "replies": []
        },
        {
            "body": "Yes, to say hi to everyone, and then up and become Thanos 2.0 with his starting a new world crap.",
            "author": "DatSadWeeb",
            "id": "h1kouv0",
            "parent_id": "t3_nxqsei",
            "score": 1,
            "created_utc": 1623546755.0,
            "replies": []
        },
        {
            "body": "LMAO! Seriously! Just wanna shake that boy and say, \"CALM THE FUCK DOWN, YOU EMO DOUCHE!\" X'D",
            "author": "twinkletoes-rp",
            "id": "h1ky72n",
            "parent_id": "t3_nxqsei",
            "score": 1,
            "created_utc": 1623552496.0,
            "replies": []
        },
        {
            "body": "Yet Sasuke easily ran out of Chakra in Boruto.",
            "author": "x4nter",
            "id": "h1htjpn",
            "parent_id": "t1_h1g8w5u",
            "score": 43,
            "created_utc": 1623483279.0,
            "replies": [
                {
                    "body": "It kinda seems like as ninja age they run outta chakra more easily. Only kinda",
                    "author": "KinkyGCM",
                    "id": "h1ie9zr",
                    "parent_id": "t1_h1htjpn",
                    "score": 11,
                    "created_utc": 1623501894.0,
                    "replies": [
                        {
                            "body": "No, only if you're Uchiha Sasuke.",
                            "author": "TyrionGoldenLion",
                            "id": "h1ijnsd",
                            "parent_id": "t1_h1ie9zr",
                            "score": 10,
                            "created_utc": 1623505359.0,
                            "replies": [
                                {
                                    "body": "Kakashi too lol. He is supposed to be this badass, but throughout the series can only churn out one or two moves before getting low on chakra lol.",
                                    "author": "omgrafail",
                                    "id": "h1iq7xr",
                                    "parent_id": "t1_h1ijnsd",
                                    "score": 5,
                                    "created_utc": 1623509024.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, but then in the war he’s able to spam everything without much problem even though he’s older then than in any previous time we’ve seen him fight",
                                            "author": "frozen2665",
                                            "id": "h1isscp",
                                            "parent_id": "t1_h1iq7xr",
                                            "score": 10,
                                            "created_utc": 1623510369.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah you idiot *wheeze* I’m not tired",
            "author": "suzellezus",
            "id": "h1hoopp",
            "parent_id": "t1_h1g8w5u",
            "score": 29,
            "created_utc": 1623478934.0,
            "replies": []
        },
        {
            "body": "They're good bros, they always have energy for each other.",
            "author": "TyrionGoldenLion",
            "id": "h1ijp61",
            "parent_id": "t1_h1g8w5u",
            "score": 6,
            "created_utc": 1623505382.0,
            "replies": []
        },
        {
            "body": "chunin exams tenten",
            "author": "Its_Cade",
            "id": "h1h8occ",
            "parent_id": "t1_h1h3v6u",
            "score": 84,
            "created_utc": 1623467410.0,
            "replies": [
                {
                    "body": "I think you meant *the yellow flash of the village",
                    "author": "8rok3n",
                    "id": "h1hafcg",
                    "parent_id": "t1_h1h8occ",
                    "score": 36,
                    "created_utc": 1623468513.0,
                    "replies": [
                        {
                            "body": "Tenten's nickname so it's the same thing.",
                            "author": "TyrionGoldenLion",
                            "id": "h1ijrkn",
                            "parent_id": "t1_h1hafcg",
                            "score": 9,
                            "created_utc": 1623505423.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There needs to be a person that is hated to bring people together and make the harsh shots I think",
            "author": "TheBossMeansMe",
            "id": "h1hcwxm",
            "parent_id": "t1_h1hbmdu",
            "score": 49,
            "created_utc": 1623470122.0,
            "replies": [
                {
                    "body": "Just proving that Sasuke learned absolutely nothing until his arm was gone, and even then it’s debatable",
                    "author": "EnflamedHuevos",
                    "id": "h1he59r",
                    "parent_id": "t1_h1hcwxm",
                    "score": 51,
                    "created_utc": 1623470948.0,
                    "replies": [
                        {
                            "body": "It worked fo lelouch",
                            "author": "Locked-man",
                            "id": "h1ho0u3",
                            "parent_id": "t1_h1he59r",
                            "score": 18,
                            "created_utc": 1623478368.0,
                            "replies": []
                        },
                        {
                            "body": "The evil was in his arms all along!",
                            "author": "TyrionGoldenLion",
                            "id": "h1ijtj7",
                            "parent_id": "t1_h1he59r",
                            "score": 6,
                            "created_utc": 1623505456.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sasuke was ripping off Lelouch and Ozymandias.",
                    "author": "TyrionGoldenLion",
                    "id": "h1ijv83",
                    "parent_id": "t1_h1hcwxm",
                    "score": 3,
                    "created_utc": 1623505483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually his logic makes realistic sense, cause people generally come together only if there's a huge single problem like tsukiyomi by madara. No one would actually stay allies after the war. Take for instance the covid disease irl, people sorta worked together for a core issue but after this, its back to usual.. Sasuke wanted to be that core problem by being hokage and take in all the hatred so everyone is together. Naruto on the other hand says people can change and work together",
            "author": "Sasuke12187",
            "id": "h1i92bi",
            "parent_id": "t1_h1hbmdu",
            "score": 8,
            "created_utc": 1623497957.0,
            "replies": [
                {
                    "body": "Yeah except in that context, it made no sense. People had already come together against their mutual enemy and Naruto was right.\n\nBesides, Sasuke knew he was part of a shitty cycle of reincarnation who tried to rule with fear and all failed. Sasuke's impulsive made no sense as he had learnt nothing from his experiences.",
                    "author": "TyrionGoldenLion",
                    "id": "h1ik0am",
                    "parent_id": "t1_h1i92bi",
                    "score": 6,
                    "created_utc": 1623505566.0,
                    "replies": [
                        {
                            "body": "Blame Kishimoto for having planned a Naruto vs Sasuke final battle. He needed to make Sasuke villainous enough for that. Up to point where he joined the alliance I quite loved his character arc. Even when he snapped at the kage summit and started killing samurais who were getting in his way of finding and killing Danzo...I understood why he was like that. The consecutive traumatic experiences he received from Itachi, Orochimaru's curse when he was younger and finally the cruel and unimaginable truth that Tobi revealed to him worsened his mental and emotional state significantly. I'm surprised that he was able to handle all that hatred, anger and depression he received from early on without ever going too far as to kill innocents on a whim. The manipulation that was done to him was also kinda extreme. He still managed to disobey his brother when he instructed him to kill his best friend, outsmart Orochimaru and free the prisoners that he experimented upon, recreate a version of team seven that he came to care for showing us that he never really managed to sever his bonds with them and so on. Even when he learned the truth from Tobi he didn't instantly believe him. His anger towards the leaf stemmed from the fact that they used his brother as an obedient tool to exact their corrupted version of justice which justified his clan's genocide. Still, I don't think he'd target any innocent people first despite what he preached to everyone and to himself. That's why he went to find Danzo first and questioned him about the correct version of events. On top of that he saw Danzo's abomination of an arm that carried his clan's eyes. That was another strong trigger for his sanity. That's why he attacked his former team with the intent to kill(although Sakura was the one who attacked him first both times). Even then he stopped and listened to Naruto's reasoning as to why he doesn't want to give up on him and that he understands the pain and anger he feels after what Konoha has done to him. He was shocked that Naruto felt so strongly for him after everything he did to keep him away. And he agreed to fight him first before attacking everyone else. I believe that he didn't care if he died trying. At least he regained some semblance of sanity and he betrayed Obito and the Akatsuki afterwards. Still, his crimes are not to be justified. But when you think about how many villains got away with much worse and heinous crimes than Sasuke for a longer time...he really wasn't that bad. Plus, his different phases have added a lot of excitement in the series. \nI just can't get behind Kishimoto's last resort to regress his character development further. I mean, I understand the reasoning behind his plan to kill the kages and the jinchurikies and focus all the hatred on him to prevent the nations and villages from going at each others' throats(a plan that resembled Itachi's way of doing things for the peace of Konoha)...but it went against what he took from the previous hokages and his confrontation with Itachi. It all boils down to Kishimoto making the Uchihas a generation originating from a demigod who went evil and attacked everyone and the animosity between the incarnations of Indra and Ashura being destined to clash against each other. Plus Naruto's destiny which entailed him going against a young man with powerful eyes, namely Sasuke. It damaged the series imo and Sasuke wasn't the only one whose quality was reduced. He is still the most interesting who had the most development in my opinion. And he is the highlight of the Boruto series along with Naruto.",
                            "author": "HoldIllustrious2598",
                            "id": "h1wjzin",
                            "parent_id": "t1_h1ik0am",
                            "score": 2,
                            "created_utc": 1623797363.0,
                            "replies": [
                                {
                                    "body": "I mean, Kishimoto's writing is at fault but that's besides the point. From what I see, he had intended to make Sasuke consistently more insane. First he only wanted to kill Danzo, then the elders, then he demanded Konoha's destruction and then the Gokage. His thirst for revenge was never satiated and I guess that's the message Kishimoto was trying to convey.\n\nBut I guess before anything else, Naruto was a generic shounen with lots of ouutside interference, meaning fan-service (fights included) >>>>> Plot and themes",
                                    "author": "TyrionGoldenLion",
                                    "id": "h1y3mal",
                                    "parent_id": "t1_h1wjzin",
                                    "score": 1,
                                    "created_utc": 1623831819.0,
                                    "replies": [
                                        {
                                            "body": "I agree that that's the message he managed to convey... Honestly, there are fanfictions out there that explore the themes and characters better than Kishimoto has.",
                                            "author": "HoldIllustrious2598",
                                            "id": "h1z3ujj",
                                            "parent_id": "t1_h1y3mal",
                                            "score": 1,
                                            "created_utc": 1623855636.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "h1z7bpu",
                                                    "parent_id": "t1_h1z3ujj",
                                                    "score": 1,
                                                    "created_utc": 1623857094.0,
                                                    "replies": [
                                                        {
                                                            "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                                                            "author": "HoldIllustrious2598",
                                                            "id": "h1zfuzc",
                                                            "parent_id": "t1_h1z7bpu",
                                                            "score": 2,
                                                            "created_utc": 1623860677.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You too!",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "h1zlgbh",
                                                                    "parent_id": "t1_h1zfuzc",
                                                                    "score": 1,
                                                                    "created_utc": 1623863069.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "GET OUT OF MY HEAD",
            "author": "Preet0024",
            "id": "h1gx8lm",
            "parent_id": "t1_h1gwcs4",
            "score": 32,
            "created_utc": 1623460675.0,
            "replies": []
        },
        {
            "body": "Sussy baka 🥲🤩😚😄🤣😄🤣😚🤩😘😛😔😝😑😜🙂🤭😙🤗😄😂😄🤩😘😏😘😏☺️😝🥲😉😙😚😛😘😋🥰🥰😋😘😏😚😌😙🥳🤣🥲😂☺️😋😆😋😁😋😆🥳😕😬😟😬😯😟😦😣😦😱🤐😕🤨🤫🤨🤬😐😡🧐😯🙄😯😦😲😕😱🙁🤐😲😲🧐😱🤥🤑🤧🤡🤧🥶🤒🥶😎🥸😎👿🎃👿🤖👹👽👺😇🤡🤧🥶😴😪🌞😪🥵🥵😓🌞😓😫😲😧😲😕🙁🤐🙁😱😧😩😧😣🙁🤐🙁🤐",
            "author": "ElitenemesisX",
            "id": "h1h75m0",
            "parent_id": "t1_h1gwcs4",
            "score": 14,
            "created_utc": 1623466452.0,
            "replies": [
                {
                    "body": "No emogi on reddit 😡",
                    "author": "mari025",
                    "id": "h1hzwz5",
                    "parent_id": "t1_h1h75m0",
                    "score": -3,
                    "created_utc": 1623489500.0,
                    "replies": [
                        {
                            "body": "emogi is the plural for emogus",
                            "author": "LordPos",
                            "id": "h1j0aor",
                            "parent_id": "t1_h1hzwz5",
                            "score": 3,
                            "created_utc": 1623514265.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why doesn't he just shit deadly rainbows on the Otsutsuku in Burrito?",
            "author": "TyrionGoldenLion",
            "id": "h1ik3eo",
            "parent_id": "t1_h1i8u2y",
            "score": 3,
            "created_utc": 1623505618.0,
            "replies": []
        },
        {
            "body": "It kinda seems like as ninja age they run outta chakra more easily. Only kinda",
            "author": "KinkyGCM",
            "id": "h1ie9zr",
            "parent_id": "t1_h1htjpn",
            "score": 11,
            "created_utc": 1623501894.0,
            "replies": [
                {
                    "body": "No, only if you're Uchiha Sasuke.",
                    "author": "TyrionGoldenLion",
                    "id": "h1ijnsd",
                    "parent_id": "t1_h1ie9zr",
                    "score": 10,
                    "created_utc": 1623505359.0,
                    "replies": [
                        {
                            "body": "Kakashi too lol. He is supposed to be this badass, but throughout the series can only churn out one or two moves before getting low on chakra lol.",
                            "author": "omgrafail",
                            "id": "h1iq7xr",
                            "parent_id": "t1_h1ijnsd",
                            "score": 5,
                            "created_utc": 1623509024.0,
                            "replies": [
                                {
                                    "body": "Yeah, but then in the war he’s able to spam everything without much problem even though he’s older then than in any previous time we’ve seen him fight",
                                    "author": "frozen2665",
                                    "id": "h1isscp",
                                    "parent_id": "t1_h1iq7xr",
                                    "score": 10,
                                    "created_utc": 1623510369.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you meant *the yellow flash of the village",
            "author": "8rok3n",
            "id": "h1hafcg",
            "parent_id": "t1_h1h8occ",
            "score": 36,
            "created_utc": 1623468513.0,
            "replies": [
                {
                    "body": "Tenten's nickname so it's the same thing.",
                    "author": "TyrionGoldenLion",
                    "id": "h1ijrkn",
                    "parent_id": "t1_h1hafcg",
                    "score": 9,
                    "created_utc": 1623505423.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just proving that Sasuke learned absolutely nothing until his arm was gone, and even then it’s debatable",
            "author": "EnflamedHuevos",
            "id": "h1he59r",
            "parent_id": "t1_h1hcwxm",
            "score": 51,
            "created_utc": 1623470948.0,
            "replies": [
                {
                    "body": "It worked fo lelouch",
                    "author": "Locked-man",
                    "id": "h1ho0u3",
                    "parent_id": "t1_h1he59r",
                    "score": 18,
                    "created_utc": 1623478368.0,
                    "replies": []
                },
                {
                    "body": "The evil was in his arms all along!",
                    "author": "TyrionGoldenLion",
                    "id": "h1ijtj7",
                    "parent_id": "t1_h1he59r",
                    "score": 6,
                    "created_utc": 1623505456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sasuke was ripping off Lelouch and Ozymandias.",
            "author": "TyrionGoldenLion",
            "id": "h1ijv83",
            "parent_id": "t1_h1hcwxm",
            "score": 3,
            "created_utc": 1623505483.0,
            "replies": []
        },
        {
            "body": "Yeah except in that context, it made no sense. People had already come together against their mutual enemy and Naruto was right.\n\nBesides, Sasuke knew he was part of a shitty cycle of reincarnation who tried to rule with fear and all failed. Sasuke's impulsive made no sense as he had learnt nothing from his experiences.",
            "author": "TyrionGoldenLion",
            "id": "h1ik0am",
            "parent_id": "t1_h1i92bi",
            "score": 6,
            "created_utc": 1623505566.0,
            "replies": [
                {
                    "body": "Blame Kishimoto for having planned a Naruto vs Sasuke final battle. He needed to make Sasuke villainous enough for that. Up to point where he joined the alliance I quite loved his character arc. Even when he snapped at the kage summit and started killing samurais who were getting in his way of finding and killing Danzo...I understood why he was like that. The consecutive traumatic experiences he received from Itachi, Orochimaru's curse when he was younger and finally the cruel and unimaginable truth that Tobi revealed to him worsened his mental and emotional state significantly. I'm surprised that he was able to handle all that hatred, anger and depression he received from early on without ever going too far as to kill innocents on a whim. The manipulation that was done to him was also kinda extreme. He still managed to disobey his brother when he instructed him to kill his best friend, outsmart Orochimaru and free the prisoners that he experimented upon, recreate a version of team seven that he came to care for showing us that he never really managed to sever his bonds with them and so on. Even when he learned the truth from Tobi he didn't instantly believe him. His anger towards the leaf stemmed from the fact that they used his brother as an obedient tool to exact their corrupted version of justice which justified his clan's genocide. Still, I don't think he'd target any innocent people first despite what he preached to everyone and to himself. That's why he went to find Danzo first and questioned him about the correct version of events. On top of that he saw Danzo's abomination of an arm that carried his clan's eyes. That was another strong trigger for his sanity. That's why he attacked his former team with the intent to kill(although Sakura was the one who attacked him first both times). Even then he stopped and listened to Naruto's reasoning as to why he doesn't want to give up on him and that he understands the pain and anger he feels after what Konoha has done to him. He was shocked that Naruto felt so strongly for him after everything he did to keep him away. And he agreed to fight him first before attacking everyone else. I believe that he didn't care if he died trying. At least he regained some semblance of sanity and he betrayed Obito and the Akatsuki afterwards. Still, his crimes are not to be justified. But when you think about how many villains got away with much worse and heinous crimes than Sasuke for a longer time...he really wasn't that bad. Plus, his different phases have added a lot of excitement in the series. \nI just can't get behind Kishimoto's last resort to regress his character development further. I mean, I understand the reasoning behind his plan to kill the kages and the jinchurikies and focus all the hatred on him to prevent the nations and villages from going at each others' throats(a plan that resembled Itachi's way of doing things for the peace of Konoha)...but it went against what he took from the previous hokages and his confrontation with Itachi. It all boils down to Kishimoto making the Uchihas a generation originating from a demigod who went evil and attacked everyone and the animosity between the incarnations of Indra and Ashura being destined to clash against each other. Plus Naruto's destiny which entailed him going against a young man with powerful eyes, namely Sasuke. It damaged the series imo and Sasuke wasn't the only one whose quality was reduced. He is still the most interesting who had the most development in my opinion. And he is the highlight of the Boruto series along with Naruto.",
                    "author": "HoldIllustrious2598",
                    "id": "h1wjzin",
                    "parent_id": "t1_h1ik0am",
                    "score": 2,
                    "created_utc": 1623797363.0,
                    "replies": [
                        {
                            "body": "I mean, Kishimoto's writing is at fault but that's besides the point. From what I see, he had intended to make Sasuke consistently more insane. First he only wanted to kill Danzo, then the elders, then he demanded Konoha's destruction and then the Gokage. His thirst for revenge was never satiated and I guess that's the message Kishimoto was trying to convey.\n\nBut I guess before anything else, Naruto was a generic shounen with lots of ouutside interference, meaning fan-service (fights included) >>>>> Plot and themes",
                            "author": "TyrionGoldenLion",
                            "id": "h1y3mal",
                            "parent_id": "t1_h1wjzin",
                            "score": 1,
                            "created_utc": 1623831819.0,
                            "replies": [
                                {
                                    "body": "I agree that that's the message he managed to convey... Honestly, there are fanfictions out there that explore the themes and characters better than Kishimoto has.",
                                    "author": "HoldIllustrious2598",
                                    "id": "h1z3ujj",
                                    "parent_id": "t1_h1y3mal",
                                    "score": 1,
                                    "created_utc": 1623855636.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
                                            "author": "TyrionGoldenLion",
                                            "id": "h1z7bpu",
                                            "parent_id": "t1_h1z3ujj",
                                            "score": 1,
                                            "created_utc": 1623857094.0,
                                            "replies": [
                                                {
                                                    "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                                                    "author": "HoldIllustrious2598",
                                                    "id": "h1zfuzc",
                                                    "parent_id": "t1_h1z7bpu",
                                                    "score": 2,
                                                    "created_utc": 1623860677.0,
                                                    "replies": [
                                                        {
                                                            "body": "You too!",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "h1zlgbh",
                                                            "parent_id": "t1_h1zfuzc",
                                                            "score": 1,
                                                            "created_utc": 1623863069.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No emogi on reddit 😡",
            "author": "mari025",
            "id": "h1hzwz5",
            "parent_id": "t1_h1h75m0",
            "score": -3,
            "created_utc": 1623489500.0,
            "replies": [
                {
                    "body": "emogi is the plural for emogus",
                    "author": "LordPos",
                    "id": "h1j0aor",
                    "parent_id": "t1_h1hzwz5",
                    "score": 3,
                    "created_utc": 1623514265.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, only if you're Uchiha Sasuke.",
            "author": "TyrionGoldenLion",
            "id": "h1ijnsd",
            "parent_id": "t1_h1ie9zr",
            "score": 10,
            "created_utc": 1623505359.0,
            "replies": [
                {
                    "body": "Kakashi too lol. He is supposed to be this badass, but throughout the series can only churn out one or two moves before getting low on chakra lol.",
                    "author": "omgrafail",
                    "id": "h1iq7xr",
                    "parent_id": "t1_h1ijnsd",
                    "score": 5,
                    "created_utc": 1623509024.0,
                    "replies": [
                        {
                            "body": "Yeah, but then in the war he’s able to spam everything without much problem even though he’s older then than in any previous time we’ve seen him fight",
                            "author": "frozen2665",
                            "id": "h1isscp",
                            "parent_id": "t1_h1iq7xr",
                            "score": 10,
                            "created_utc": 1623510369.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tenten's nickname so it's the same thing.",
            "author": "TyrionGoldenLion",
            "id": "h1ijrkn",
            "parent_id": "t1_h1hafcg",
            "score": 9,
            "created_utc": 1623505423.0,
            "replies": []
        },
        {
            "body": "It worked fo lelouch",
            "author": "Locked-man",
            "id": "h1ho0u3",
            "parent_id": "t1_h1he59r",
            "score": 18,
            "created_utc": 1623478368.0,
            "replies": []
        },
        {
            "body": "The evil was in his arms all along!",
            "author": "TyrionGoldenLion",
            "id": "h1ijtj7",
            "parent_id": "t1_h1he59r",
            "score": 6,
            "created_utc": 1623505456.0,
            "replies": []
        },
        {
            "body": "Blame Kishimoto for having planned a Naruto vs Sasuke final battle. He needed to make Sasuke villainous enough for that. Up to point where he joined the alliance I quite loved his character arc. Even when he snapped at the kage summit and started killing samurais who were getting in his way of finding and killing Danzo...I understood why he was like that. The consecutive traumatic experiences he received from Itachi, Orochimaru's curse when he was younger and finally the cruel and unimaginable truth that Tobi revealed to him worsened his mental and emotional state significantly. I'm surprised that he was able to handle all that hatred, anger and depression he received from early on without ever going too far as to kill innocents on a whim. The manipulation that was done to him was also kinda extreme. He still managed to disobey his brother when he instructed him to kill his best friend, outsmart Orochimaru and free the prisoners that he experimented upon, recreate a version of team seven that he came to care for showing us that he never really managed to sever his bonds with them and so on. Even when he learned the truth from Tobi he didn't instantly believe him. His anger towards the leaf stemmed from the fact that they used his brother as an obedient tool to exact their corrupted version of justice which justified his clan's genocide. Still, I don't think he'd target any innocent people first despite what he preached to everyone and to himself. That's why he went to find Danzo first and questioned him about the correct version of events. On top of that he saw Danzo's abomination of an arm that carried his clan's eyes. That was another strong trigger for his sanity. That's why he attacked his former team with the intent to kill(although Sakura was the one who attacked him first both times). Even then he stopped and listened to Naruto's reasoning as to why he doesn't want to give up on him and that he understands the pain and anger he feels after what Konoha has done to him. He was shocked that Naruto felt so strongly for him after everything he did to keep him away. And he agreed to fight him first before attacking everyone else. I believe that he didn't care if he died trying. At least he regained some semblance of sanity and he betrayed Obito and the Akatsuki afterwards. Still, his crimes are not to be justified. But when you think about how many villains got away with much worse and heinous crimes than Sasuke for a longer time...he really wasn't that bad. Plus, his different phases have added a lot of excitement in the series. \nI just can't get behind Kishimoto's last resort to regress his character development further. I mean, I understand the reasoning behind his plan to kill the kages and the jinchurikies and focus all the hatred on him to prevent the nations and villages from going at each others' throats(a plan that resembled Itachi's way of doing things for the peace of Konoha)...but it went against what he took from the previous hokages and his confrontation with Itachi. It all boils down to Kishimoto making the Uchihas a generation originating from a demigod who went evil and attacked everyone and the animosity between the incarnations of Indra and Ashura being destined to clash against each other. Plus Naruto's destiny which entailed him going against a young man with powerful eyes, namely Sasuke. It damaged the series imo and Sasuke wasn't the only one whose quality was reduced. He is still the most interesting who had the most development in my opinion. And he is the highlight of the Boruto series along with Naruto.",
            "author": "HoldIllustrious2598",
            "id": "h1wjzin",
            "parent_id": "t1_h1ik0am",
            "score": 2,
            "created_utc": 1623797363.0,
            "replies": [
                {
                    "body": "I mean, Kishimoto's writing is at fault but that's besides the point. From what I see, he had intended to make Sasuke consistently more insane. First he only wanted to kill Danzo, then the elders, then he demanded Konoha's destruction and then the Gokage. His thirst for revenge was never satiated and I guess that's the message Kishimoto was trying to convey.\n\nBut I guess before anything else, Naruto was a generic shounen with lots of ouutside interference, meaning fan-service (fights included) >>>>> Plot and themes",
                    "author": "TyrionGoldenLion",
                    "id": "h1y3mal",
                    "parent_id": "t1_h1wjzin",
                    "score": 1,
                    "created_utc": 1623831819.0,
                    "replies": [
                        {
                            "body": "I agree that that's the message he managed to convey... Honestly, there are fanfictions out there that explore the themes and characters better than Kishimoto has.",
                            "author": "HoldIllustrious2598",
                            "id": "h1z3ujj",
                            "parent_id": "t1_h1y3mal",
                            "score": 1,
                            "created_utc": 1623855636.0,
                            "replies": [
                                {
                                    "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
                                    "author": "TyrionGoldenLion",
                                    "id": "h1z7bpu",
                                    "parent_id": "t1_h1z3ujj",
                                    "score": 1,
                                    "created_utc": 1623857094.0,
                                    "replies": [
                                        {
                                            "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                                            "author": "HoldIllustrious2598",
                                            "id": "h1zfuzc",
                                            "parent_id": "t1_h1z7bpu",
                                            "score": 2,
                                            "created_utc": 1623860677.0,
                                            "replies": [
                                                {
                                                    "body": "You too!",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "h1zlgbh",
                                                    "parent_id": "t1_h1zfuzc",
                                                    "score": 1,
                                                    "created_utc": 1623863069.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "emogi is the plural for emogus",
            "author": "LordPos",
            "id": "h1j0aor",
            "parent_id": "t1_h1hzwz5",
            "score": 3,
            "created_utc": 1623514265.0,
            "replies": []
        },
        {
            "body": "Kakashi too lol. He is supposed to be this badass, but throughout the series can only churn out one or two moves before getting low on chakra lol.",
            "author": "omgrafail",
            "id": "h1iq7xr",
            "parent_id": "t1_h1ijnsd",
            "score": 5,
            "created_utc": 1623509024.0,
            "replies": [
                {
                    "body": "Yeah, but then in the war he’s able to spam everything without much problem even though he’s older then than in any previous time we’ve seen him fight",
                    "author": "frozen2665",
                    "id": "h1isscp",
                    "parent_id": "t1_h1iq7xr",
                    "score": 10,
                    "created_utc": 1623510369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, Kishimoto's writing is at fault but that's besides the point. From what I see, he had intended to make Sasuke consistently more insane. First he only wanted to kill Danzo, then the elders, then he demanded Konoha's destruction and then the Gokage. His thirst for revenge was never satiated and I guess that's the message Kishimoto was trying to convey.\n\nBut I guess before anything else, Naruto was a generic shounen with lots of ouutside interference, meaning fan-service (fights included) >>>>> Plot and themes",
            "author": "TyrionGoldenLion",
            "id": "h1y3mal",
            "parent_id": "t1_h1wjzin",
            "score": 1,
            "created_utc": 1623831819.0,
            "replies": [
                {
                    "body": "I agree that that's the message he managed to convey... Honestly, there are fanfictions out there that explore the themes and characters better than Kishimoto has.",
                    "author": "HoldIllustrious2598",
                    "id": "h1z3ujj",
                    "parent_id": "t1_h1y3mal",
                    "score": 1,
                    "created_utc": 1623855636.0,
                    "replies": [
                        {
                            "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
                            "author": "TyrionGoldenLion",
                            "id": "h1z7bpu",
                            "parent_id": "t1_h1z3ujj",
                            "score": 1,
                            "created_utc": 1623857094.0,
                            "replies": [
                                {
                                    "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                                    "author": "HoldIllustrious2598",
                                    "id": "h1zfuzc",
                                    "parent_id": "t1_h1z7bpu",
                                    "score": 2,
                                    "created_utc": 1623860677.0,
                                    "replies": [
                                        {
                                            "body": "You too!",
                                            "author": "TyrionGoldenLion",
                                            "id": "h1zlgbh",
                                            "parent_id": "t1_h1zfuzc",
                                            "score": 1,
                                            "created_utc": 1623863069.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, but then in the war he’s able to spam everything without much problem even though he’s older then than in any previous time we’ve seen him fight",
            "author": "frozen2665",
            "id": "h1isscp",
            "parent_id": "t1_h1iq7xr",
            "score": 10,
            "created_utc": 1623510369.0,
            "replies": []
        },
        {
            "body": "I agree that that's the message he managed to convey... Honestly, there are fanfictions out there that explore the themes and characters better than Kishimoto has.",
            "author": "HoldIllustrious2598",
            "id": "h1z3ujj",
            "parent_id": "t1_h1y3mal",
            "score": 1,
            "created_utc": 1623855636.0,
            "replies": [
                {
                    "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
                    "author": "TyrionGoldenLion",
                    "id": "h1z7bpu",
                    "parent_id": "t1_h1z3ujj",
                    "score": 1,
                    "created_utc": 1623857094.0,
                    "replies": [
                        {
                            "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                            "author": "HoldIllustrious2598",
                            "id": "h1zfuzc",
                            "parent_id": "t1_h1z7bpu",
                            "score": 2,
                            "created_utc": 1623860677.0,
                            "replies": [
                                {
                                    "body": "You too!",
                                    "author": "TyrionGoldenLion",
                                    "id": "h1zlgbh",
                                    "parent_id": "t1_h1zfuzc",
                                    "score": 1,
                                    "created_utc": 1623863069.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah. I don't hold it against him, he was extremely overworked and his editors were quite brutal to him. No wonder he couldn't think everything through.",
            "author": "TyrionGoldenLion",
            "id": "h1z7bpu",
            "parent_id": "t1_h1z3ujj",
            "score": 1,
            "created_utc": 1623857094.0,
            "replies": [
                {
                    "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
                    "author": "HoldIllustrious2598",
                    "id": "h1zfuzc",
                    "parent_id": "t1_h1z7bpu",
                    "score": 2,
                    "created_utc": 1623860677.0,
                    "replies": [
                        {
                            "body": "You too!",
                            "author": "TyrionGoldenLion",
                            "id": "h1zlgbh",
                            "parent_id": "t1_h1zfuzc",
                            "score": 1,
                            "created_utc": 1623863069.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "...I didn't know those details. I get it. Thanks for the conversation! Have a nice day!",
            "author": "HoldIllustrious2598",
            "id": "h1zfuzc",
            "parent_id": "t1_h1z7bpu",
            "score": 2,
            "created_utc": 1623860677.0,
            "replies": [
                {
                    "body": "You too!",
                    "author": "TyrionGoldenLion",
                    "id": "h1zlgbh",
                    "parent_id": "t1_h1zfuzc",
                    "score": 1,
                    "created_utc": 1623863069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You too!",
            "author": "TyrionGoldenLion",
            "id": "h1zlgbh",
            "parent_id": "t1_h1zfuzc",
            "score": 1,
            "created_utc": 1623863069.0,
            "replies": []
        }
    ]
}