{
    "title": "\"It's better to get no comments.\" What do you guys think?",
    "post_id": "10fq3us",
    "post_url": "https://www.reddit.com/r/runningman/comments/10fq3us/its_better_to_get_no_comments_what_do_you_guys/",
    "author": "generictrashlady",
    "body": "",
    "url": "https://i.redd.it/4vpc2nn5eyca1.jpg",
    "score": 353,
    "upvote_ratio": 0.99,
    "created_utc": 1674095745.0,
    "num_comments": 30,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I agree, malicious comments are not a show of interest. It's a person trying to hurt someone. If I see something I don't like I'm not gonna go out of my way to insult someone. It's just being mean. Why be mean?",
            "author": "slothchan9012",
            "id": "j4yflsw",
            "parent_id": "t3_10fq3us",
            "score": 139,
            "created_utc": 1674097903.0,
            "replies": []
        },
        {
            "body": "One should not confuse between harsh critics, honest feedback and hateful comments. Hateful comments aren't there to improve, change, or give any sort of logical opinion. their sole purpose is to hurt someone, and get away with it. (when South Korea started enforcing the law against cyber bullying, it dropped considerably. The bill to punish those who insult others on the Internet with up to three years in jail or a $30,000). \n\nYet, not anyone is able to do that regardless of it not being punishable, like as not anyone is able to commit a crime even when the punishing law supposedly doesn't exist. It needs a geniune wickedness to be able to hate someone without any valid reasons, to the point of wishing that person (artist) , their families, or even someone sympathizing with them, physical and mental harm. To say this is good publicity is total nonsense. People were hurt badly because of it. No one should want that.\n\nWhat's being used nowdays is [bad publicity is also publicity] policy, artists own agencies now, generating buzz with controversies and scandals, and clearing up the misunderstandings later on. Everything goes back to normal, with the artist name being more known to the general public. People tend to be drawn to negativity more than positivity. An article of a scandal is more likely to be clicked on than an article about an outstanding acting or singing performance. But, those who write hateful comments doesn't really care much about scandals or controversial situations, and they are doing it all the time at every opportunity, and won't stop, unless they change themselves [personality], not the artist.\n\nEdit: wording",
            "author": "Minguri22",
            "id": "j4z2ms8",
            "parent_id": "t3_10fq3us",
            "score": 35,
            "created_utc": 1674110374.0,
            "replies": [
                {
                    "body": "Good clarification",
                    "author": "Softspokenclark",
                    "id": "j52ijvm",
                    "parent_id": "t1_j4z2ms8",
                    "score": 4,
                    "created_utc": 1674169189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love him because he’s so wise. People who say malicious comments is showing interest are just enablers who are normalising online bullying. \n\nCriticism is different esp constructive criticism. But malicious comments are self explanatory as named - the intent is to be malicious and that’s never necessary. It’s definitely better to get no comments than to receive malicious ones.",
            "author": "zaichii",
            "id": "j4z22iy",
            "parent_id": "t3_10fq3us",
            "score": 25,
            "created_utc": 1674109996.0,
            "replies": []
        },
        {
            "body": "It's a separate school of thought from the western, \"all publicity is good publicity.\" Negative attention will always follow you around, and in East Asian countries where reputation is everything, malicious comments will have a stronger effect.",
            "author": "lolminna",
            "id": "j4yj1go",
            "parent_id": "t3_10fq3us",
            "score": 57,
            "created_utc": 1674099491.0,
            "replies": []
        },
        {
            "body": "Link to article: https://www.allkpop.com/article/2023/01/yoo-jae-suk-curtly-shares-his-resolute-thoughts-against-malicious-commenting",
            "author": "generictrashlady",
            "id": "j4yav7b",
            "parent_id": "t3_10fq3us",
            "score": 23,
            "created_utc": 1674095809.0,
            "replies": [
                {
                    "body": "Absolutely well said and completely true. It’s like the old saying, if you don’t have anything nice to say better to say nothing at all. Some people need a refresher in that.",
                    "author": "mango_script",
                    "id": "j4ye8en",
                    "parent_id": "t1_j4yav7b",
                    "score": 51,
                    "created_utc": 1674097286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is wisdom talking! 💯",
            "author": "Puzzleheaded-Park-69",
            "id": "j4yk81w",
            "parent_id": "t3_10fq3us",
            "score": 11,
            "created_utc": 1674100053.0,
            "replies": []
        },
        {
            "body": "\"If you ain't got nothing good to say, stay silent\"",
            "author": "Aiirene",
            "id": "j4z890b",
            "parent_id": "t3_10fq3us",
            "score": 7,
            "created_utc": 1674114525.0,
            "replies": []
        },
        {
            "body": "He's not exactly inventing hot water here, is he? An obviously true statement.",
            "author": "LewsThTe",
            "id": "j4zlcu1",
            "parent_id": "t3_10fq3us",
            "score": 7,
            "created_utc": 1674125296.0,
            "replies": []
        },
        {
            "body": "ily jaesuk 🤟",
            "author": "semaur",
            "id": "j4z6hmr",
            "parent_id": "t3_10fq3us",
            "score": 4,
            "created_utc": 1674113160.0,
            "replies": []
        },
        {
            "body": "![img](emote|t5_2u830|4974)",
            "author": "Jimin_9132",
            "id": "j516lf2",
            "parent_id": "t3_10fq3us",
            "score": 4,
            "created_utc": 1674151472.0,
            "replies": []
        },
        {
            "body": "Yeah, these comments aren't just \"your show stinks!\" (which is also unnecessary). People send death threats and harassment, even to celebrity's family members (it happened to So Min, it also happened to one of the cast of *Busted*).    \nI always report hate comments/accounts whenever I see them.",
            "author": "TopCoconut2",
            "id": "j52jmnz",
            "parent_id": "t3_10fq3us",
            "score": 6,
            "created_utc": 1674169893.0,
            "replies": []
        },
        {
            "body": "I think it’s pointless to think about what you’d ‘rather’ have as you can’t control it. It’s your outlook that’s important. Ricky Gervais has the best take here imo: hate comments are just the modern version of writing stupid shit on the toilet stall when you’re annoyed at something’. We shouldn’t treat them so seriously, an eye roll at the most- as hard as it is to train yourself to do so in practice. (Edit spelling)",
            "author": "KimHeenimmm",
            "id": "j4yej3i",
            "parent_id": "t3_10fq3us",
            "score": 8,
            "created_utc": 1674097418.0,
            "replies": [
                {
                    "body": "Sadly this cannot fully apply in countries where suicide rates are high due to bullying, scandal and hateful comments.",
                    "author": "Seiralacroix",
                    "id": "j4yo7rj",
                    "parent_id": "t1_j4yej3i",
                    "score": 10,
                    "created_utc": 1674102004.0,
                    "replies": []
                },
                {
                    "body": "I agree to a point. Hateful comments are unavoidable but there's a difference with bathroom stall comments that aren't personal to purposefully hurtful words that attack someone. The point YJS and the other speakers were making is that malicious comments have the power to kill and that's what they want to avoid most of all. So yeah, I agree that hateful comments are unavoidable but suicide is and reducing malicious comments that intentionally attack people can do that",
                    "author": "generictrashlady",
                    "id": "j4yhlst",
                    "parent_id": "t1_j4yej3i",
                    "score": 17,
                    "created_utc": 1674098823.0,
                    "replies": []
                },
                {
                    "body": "Ricky does not understand the social pressure in eastern countries. The problem is also the culture but that also brings up this perfectionism idealogy. Here in Western countries cancel culture is not as big a problem.",
                    "author": "sickfordays1234",
                    "id": "j50kgbz",
                    "parent_id": "t1_j4yej3i",
                    "score": 2,
                    "created_utc": 1674143321.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "j4yfy9w",
            "parent_id": "t3_10fq3us",
            "score": 10,
            "created_utc": 1674098065.0,
            "replies": [
                {
                    "body": "\nHonestly, you can't stop those malicious comments. However, you definitely shouldn't stay silent either. I'm with that professor on that. Maybe leaving nice comments is one day (partially the reason I make it a point to leave positive comments on JSM), but I think even more important is to call out those hateful toxic comments. \n\nBTW, criticism is completely different than hate. \n\nThe truth is, at least on Running Man, they haven't dealt with the issues of malicious comments the best way. They've brought up such comments several times, and about the members who recieve it most: JSM, JSJ and YSC. But it's never to address them, only to laugh about them. Also not laugh at them. Just...about them. Which is odd to me. (Edit to add another example:) Even with JinYoung, when she said a fan of KJK DMed her and said they're gonna kill her if she flirts. They laughed, they made jokes (\"even his fans are thugs\" or sth) and that was that. That deeply upset me.  \n\nIt always looks like they're trying to protect SJH, whose fans were the ones who started those malicious attacks on the new members, especially JSM. In fact, they are still to this day around and mouthing off in comment sections even on Reddit. On Instagram, you will not be able to see who is following SJH's account and the fans who keep writing hate comments have disabled the ability to see who they follow. I only know this because someone else noticed. I have screenshots of their profiles from months before, they were following only SJH fanpages or sometimes Monday couple fanpages so clearly they're their fans. In fact, a Korean reporter did a report on SJH's fandom and how toxic they are. Their comments on that video literally prove him right. There have been numerous incidents as well. Let's see... \n\n- JSM x YSC getting hate for joining\n- JSM getting hate and being called PDs wife because she was more active \n- according to those fans, JSM was rude and stealing SJH's spotlight and SJH was a saint who was letting the new members shine \n- editors were cutting SJH scenes\n- sound guy was cutting SJH microphone off \n- any post on the official instagram involving JSM got upwards of 5k comments most of which insults and threats and \"out\" messages all because SJH was no longer the only woman... \n- JSM video of winning best variety star getting disliked more than liked and reported so many times it was taken off and re-uploaded \n- JSM's instagram reported so many times she got locked out \n- threats to kill her or harm her in some way if she attended the Vietnamese fanmeeting in 2019 (tiny saw those comments, his Twitter comments are still up.) \n- sending malicious comments to JSM brother \n- sending threats to her brother \n- organizing Facebook groups with 100k plus members for spreading hate \n- attacking KJK for a picture with JSM on his instagram (and LKS and YSC in the picture) \n- attacking JSJ on HIS BIRTHDAY for posting a picture without SJH so that he was forced to upload a picture with her and apologize to her fans \n- Attacking KJK because he wasn't comfortable with a forced loveline\n- attacking KJK on his company's instagram account for being closer to JSM \n- attacking KJK's mom in comments \n- SJH stylist got so much hate over her hairstyle, which she didn't disclose was her drunken choice and the stylist HD nothing to do with until month after, they even brought it up on running man...\n- commenting on SJH's hair, body, weight, clothing, whom she dates, what she does and actually at times demanding things: in fact, they once brought it up on the show that the reason she was being more active on social media was because her fans demanded it and she was doing it to keep them happy. They wanted her stylist fired for the haircut, not knowing it was her own choice. They act like they own her or something, that they get to insult and demand someone be fired from her team? \n\nAnd tbh a lot more (about Gary too). The fact that a running man member knows the dangers of such harassment and knows how it feels to get hate comments, but the show has never addressed it is kind of disheartening. \n\nThey've been candid about several things on the show. But never about the toxicity in their fandom, and I have a suspicion they won't because it's SJH's fans and they're afraid of them. Either because they think they're a huge portion of the viewers (which is odd, because she's barely in the episodes. If someone like LKS leaving didn't bring RM down... There's no way SJH is a bigger draw than LKS. This isn't hate. It's my opinion based on performance I've seen.) OR because of the whole firing issue. \n\nAnyways... I have a lot to say about this. And I am not gonna stay around and hope the haters go away. RM members don't deserve that treatment. I don't think we should hope it expect fans to be mature enough not to leave such comments. I think we should fight back against those and drown them out.\n\nEdit: I'm very high so this might be gibberish at times and filled with mistakes at best. I'll try to fix it tmr\n\nEdit2: \nImportant to make it clear I don't wanna generalize so not all SJH fans or entire fandom just the problematic ones and am only pointing out those things because I've been a huge JSM fan so I've seen those most. Although I do have a problem with her staying silent about this and all the hate comments, I in no way think she has anything to do with it. She's a victim of it herself at times...\n\n\nHow is this comment a rule violation? 🤔",
                    "author": "Ancient_Reply4583",
                    "id": "j50hq5z",
                    "parent_id": "t1_j4yfy9w",
                    "score": 3,
                    "created_utc": 1674142271.0,
                    "replies": [
                        {
                            "body": "Ingay nito",
                            "author": "Witty_Inspection_310",
                            "id": "j5jkmec",
                            "parent_id": "t1_j50hq5z",
                            "score": 1,
                            "created_utc": 1674481653.0,
                            "replies": [
                                {
                                    "body": "?",
                                    "author": "Ancient_Reply4583",
                                    "id": "j5kdfug",
                                    "parent_id": "t1_j5jkmec",
                                    "score": 0,
                                    "created_utc": 1674493578.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree giving no comments is better. However, sometimes criticism of performance is taken as hate. People can't always tell the difference as they assume the person's intention is malicious when it might not be. I think I'm guilty of this. \n\nI believe if hate comments are coming from one colleagues fan to another, it's important for that celebrity to address not ignore it and show overt support to that colleague/person being attacked. Jessi does this often and deserves to be admired for this. On Instagram she called out the person telling her to slap Somin and put her in her place when news of her being cast in Sixth Sense with Somin was announced. She was overly affectionate with Somin on the show which must have disappointed the malicious commentor. Jessi also told her fans to treat Sunmi (who had replaced her on Showterview) well. That's classy behaviour. Somin did something similar, showing support and closeness to Sechan by posting a picture with him (before the next episode aired) when he was attacked for being super insensitive to Somin in an episode. Somin has followed up by posting more pictures with Sechan since and interacting a lot with him on air. It is the perfect way to tell her fans to behave themselves and not go over the top on her behalf. Most recently JSJ is another RM member who has spoken out when other members have been accused of 'bullying' him.\nEdit: fixed grammar",
            "author": "Mission-Loquat9290",
            "id": "j53lztd",
            "parent_id": "t3_10fq3us",
            "score": 3,
            "created_utc": 1674186622.0,
            "replies": [
                {
                    "body": "Exactly. Well said. \n\nMy comment got flagged for breaking the rules when I mentioned this! 😐 \n\nBut this is 100% true. How people handle hate comments that are thrown at their close co-workers on their behalf is so important. I'm so sorry for SoMin that her co-workers didn't handle it right. I'm also very proud that she didn't continue and didn't follow in their footsteps, and stood up for her colleague when a smaller-scale version of that was about to happen to him. It made me respect her so much more.",
                    "author": "Ancient_Reply4583",
                    "id": "j543e8p",
                    "parent_id": "t1_j53lztd",
                    "score": 4,
                    "created_utc": 1674196412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even during times of war, people say that no news is good news. There’s nothing good about getting malicious comments.",
            "author": "babykoalalalala",
            "id": "j52he9z",
            "parent_id": "t3_10fq3us",
            "score": 2,
            "created_utc": 1674168736.0,
            "replies": []
        },
        {
            "body": "If it's just a pure hate comment with no substance at all then yes. I don't need people negativity on my life",
            "author": "No_Independence_1067",
            "id": "j5jxhsg",
            "parent_id": "t3_10fq3us",
            "score": 2,
            "created_utc": 1674487393.0,
            "replies": []
        },
        {
            "body": "It's kinda hard to differentiate and tell the difference between malicious comments and productive criticism. Don't really agree, but if the comment is clearly just to be a jackass then yeah it shouldn't be given attention to.",
            "author": "DanRelkiyn",
            "id": "j4znlvg",
            "parent_id": "t3_10fq3us",
            "score": 2,
            "created_utc": 1674127014.0,
            "replies": []
        },
        {
            "body": "Well said...",
            "author": "Z4br1g",
            "id": "j4yocsv",
            "parent_id": "t3_10fq3us",
            "score": 1,
            "created_utc": 1674102073.0,
            "replies": []
        },
        {
            "body": "definitely agree. Don't crave attention that will strain you.",
            "author": "solarbie",
            "id": "j7c4v8z",
            "parent_id": "t3_10fq3us",
            "score": 1,
            "created_utc": 1675621476.0,
            "replies": []
        },
        {
            "body": "Good clarification",
            "author": "Softspokenclark",
            "id": "j52ijvm",
            "parent_id": "t1_j4z2ms8",
            "score": 4,
            "created_utc": 1674169189.0,
            "replies": []
        },
        {
            "body": "Absolutely well said and completely true. It’s like the old saying, if you don’t have anything nice to say better to say nothing at all. Some people need a refresher in that.",
            "author": "mango_script",
            "id": "j4ye8en",
            "parent_id": "t1_j4yav7b",
            "score": 51,
            "created_utc": 1674097286.0,
            "replies": []
        },
        {
            "body": "Sadly this cannot fully apply in countries where suicide rates are high due to bullying, scandal and hateful comments.",
            "author": "Seiralacroix",
            "id": "j4yo7rj",
            "parent_id": "t1_j4yej3i",
            "score": 10,
            "created_utc": 1674102004.0,
            "replies": []
        },
        {
            "body": "I agree to a point. Hateful comments are unavoidable but there's a difference with bathroom stall comments that aren't personal to purposefully hurtful words that attack someone. The point YJS and the other speakers were making is that malicious comments have the power to kill and that's what they want to avoid most of all. So yeah, I agree that hateful comments are unavoidable but suicide is and reducing malicious comments that intentionally attack people can do that",
            "author": "generictrashlady",
            "id": "j4yhlst",
            "parent_id": "t1_j4yej3i",
            "score": 17,
            "created_utc": 1674098823.0,
            "replies": []
        },
        {
            "body": "Ricky does not understand the social pressure in eastern countries. The problem is also the culture but that also brings up this perfectionism idealogy. Here in Western countries cancel culture is not as big a problem.",
            "author": "sickfordays1234",
            "id": "j50kgbz",
            "parent_id": "t1_j4yej3i",
            "score": 2,
            "created_utc": 1674143321.0,
            "replies": []
        },
        {
            "body": "\nHonestly, you can't stop those malicious comments. However, you definitely shouldn't stay silent either. I'm with that professor on that. Maybe leaving nice comments is one day (partially the reason I make it a point to leave positive comments on JSM), but I think even more important is to call out those hateful toxic comments. \n\nBTW, criticism is completely different than hate. \n\nThe truth is, at least on Running Man, they haven't dealt with the issues of malicious comments the best way. They've brought up such comments several times, and about the members who recieve it most: JSM, JSJ and YSC. But it's never to address them, only to laugh about them. Also not laugh at them. Just...about them. Which is odd to me. (Edit to add another example:) Even with JinYoung, when she said a fan of KJK DMed her and said they're gonna kill her if she flirts. They laughed, they made jokes (\"even his fans are thugs\" or sth) and that was that. That deeply upset me.  \n\nIt always looks like they're trying to protect SJH, whose fans were the ones who started those malicious attacks on the new members, especially JSM. In fact, they are still to this day around and mouthing off in comment sections even on Reddit. On Instagram, you will not be able to see who is following SJH's account and the fans who keep writing hate comments have disabled the ability to see who they follow. I only know this because someone else noticed. I have screenshots of their profiles from months before, they were following only SJH fanpages or sometimes Monday couple fanpages so clearly they're their fans. In fact, a Korean reporter did a report on SJH's fandom and how toxic they are. Their comments on that video literally prove him right. There have been numerous incidents as well. Let's see... \n\n- JSM x YSC getting hate for joining\n- JSM getting hate and being called PDs wife because she was more active \n- according to those fans, JSM was rude and stealing SJH's spotlight and SJH was a saint who was letting the new members shine \n- editors were cutting SJH scenes\n- sound guy was cutting SJH microphone off \n- any post on the official instagram involving JSM got upwards of 5k comments most of which insults and threats and \"out\" messages all because SJH was no longer the only woman... \n- JSM video of winning best variety star getting disliked more than liked and reported so many times it was taken off and re-uploaded \n- JSM's instagram reported so many times she got locked out \n- threats to kill her or harm her in some way if she attended the Vietnamese fanmeeting in 2019 (tiny saw those comments, his Twitter comments are still up.) \n- sending malicious comments to JSM brother \n- sending threats to her brother \n- organizing Facebook groups with 100k plus members for spreading hate \n- attacking KJK for a picture with JSM on his instagram (and LKS and YSC in the picture) \n- attacking JSJ on HIS BIRTHDAY for posting a picture without SJH so that he was forced to upload a picture with her and apologize to her fans \n- Attacking KJK because he wasn't comfortable with a forced loveline\n- attacking KJK on his company's instagram account for being closer to JSM \n- attacking KJK's mom in comments \n- SJH stylist got so much hate over her hairstyle, which she didn't disclose was her drunken choice and the stylist HD nothing to do with until month after, they even brought it up on running man...\n- commenting on SJH's hair, body, weight, clothing, whom she dates, what she does and actually at times demanding things: in fact, they once brought it up on the show that the reason she was being more active on social media was because her fans demanded it and she was doing it to keep them happy. They wanted her stylist fired for the haircut, not knowing it was her own choice. They act like they own her or something, that they get to insult and demand someone be fired from her team? \n\nAnd tbh a lot more (about Gary too). The fact that a running man member knows the dangers of such harassment and knows how it feels to get hate comments, but the show has never addressed it is kind of disheartening. \n\nThey've been candid about several things on the show. But never about the toxicity in their fandom, and I have a suspicion they won't because it's SJH's fans and they're afraid of them. Either because they think they're a huge portion of the viewers (which is odd, because she's barely in the episodes. If someone like LKS leaving didn't bring RM down... There's no way SJH is a bigger draw than LKS. This isn't hate. It's my opinion based on performance I've seen.) OR because of the whole firing issue. \n\nAnyways... I have a lot to say about this. And I am not gonna stay around and hope the haters go away. RM members don't deserve that treatment. I don't think we should hope it expect fans to be mature enough not to leave such comments. I think we should fight back against those and drown them out.\n\nEdit: I'm very high so this might be gibberish at times and filled with mistakes at best. I'll try to fix it tmr\n\nEdit2: \nImportant to make it clear I don't wanna generalize so not all SJH fans or entire fandom just the problematic ones and am only pointing out those things because I've been a huge JSM fan so I've seen those most. Although I do have a problem with her staying silent about this and all the hate comments, I in no way think she has anything to do with it. She's a victim of it herself at times...\n\n\nHow is this comment a rule violation? 🤔",
            "author": "Ancient_Reply4583",
            "id": "j50hq5z",
            "parent_id": "t1_j4yfy9w",
            "score": 3,
            "created_utc": 1674142271.0,
            "replies": [
                {
                    "body": "Ingay nito",
                    "author": "Witty_Inspection_310",
                    "id": "j5jkmec",
                    "parent_id": "t1_j50hq5z",
                    "score": 1,
                    "created_utc": 1674481653.0,
                    "replies": [
                        {
                            "body": "?",
                            "author": "Ancient_Reply4583",
                            "id": "j5kdfug",
                            "parent_id": "t1_j5jkmec",
                            "score": 0,
                            "created_utc": 1674493578.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. Well said. \n\nMy comment got flagged for breaking the rules when I mentioned this! 😐 \n\nBut this is 100% true. How people handle hate comments that are thrown at their close co-workers on their behalf is so important. I'm so sorry for SoMin that her co-workers didn't handle it right. I'm also very proud that she didn't continue and didn't follow in their footsteps, and stood up for her colleague when a smaller-scale version of that was about to happen to him. It made me respect her so much more.",
            "author": "Ancient_Reply4583",
            "id": "j543e8p",
            "parent_id": "t1_j53lztd",
            "score": 4,
            "created_utc": 1674196412.0,
            "replies": []
        },
        {
            "body": "Ingay nito",
            "author": "Witty_Inspection_310",
            "id": "j5jkmec",
            "parent_id": "t1_j50hq5z",
            "score": 1,
            "created_utc": 1674481653.0,
            "replies": [
                {
                    "body": "?",
                    "author": "Ancient_Reply4583",
                    "id": "j5kdfug",
                    "parent_id": "t1_j5jkmec",
                    "score": 0,
                    "created_utc": 1674493578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "?",
            "author": "Ancient_Reply4583",
            "id": "j5kdfug",
            "parent_id": "t1_j5jkmec",
            "score": 0,
            "created_utc": 1674493578.0,
            "replies": []
        }
    ]
}