{
    "title": "This scene still moves me to tears.",
    "post_id": "mzwfbs",
    "post_url": "https://www.reddit.com/r/runningman/comments/mzwfbs/this_scene_still_moves_me_to_tears/",
    "author": "MrAjusshi",
    "body": "",
    "url": "https://v.redd.it/82dgrarmorv61",
    "score": 629,
    "upvote_ratio": 0.99,
    "created_utc": 1619551591.0,
    "num_comments": 31,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I love this scene. LKS was always a character to him and he was even in doubt about how he should act around his noona because  some of the things he did was rude to her but he did it cause it will make good entertainment. \n\nI really like how he said he was torn between giving his best for entertainment and being respectful and not hurting his castmates feelings. And I just can’t. The feels.",
            "author": "echofades",
            "id": "gw3yy2l",
            "parent_id": "t3_mzwfbs",
            "score": 87,
            "created_utc": 1619565281.0,
            "replies": [
                {
                    "body": "Kwang Soo framing Ji Hyo, and Gary's crush leading to Monday Couple, those two things always gave her something to be comfortable with on the show as she found her place amongst much more outgoing, talkative personalities.",
                    "author": "MegalomaniacHack",
                    "id": "gw4638k",
                    "parent_id": "t1_gw3yy2l",
                    "score": 48,
                    "created_utc": 1619568870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kwang Soo’s voice is so different when he’s being serious. Deeper and softer",
            "author": "lilpuzz",
            "id": "gw4k6lp",
            "parent_id": "t3_mzwfbs",
            "score": 60,
            "created_utc": 1619575923.0,
            "replies": [
                {
                    "body": "Yeah I feel like this is one of the few scenes where we see the real Kwang Soo, not the actor or comedian, just the dude.",
                    "author": "kyramaro",
                    "id": "gw7is3l",
                    "parent_id": "t1_gw4k6lp",
                    "score": 17,
                    "created_utc": 1619638115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even all being performers, trying to be entertaining so you never know quite how real they are, that episode was a really emotional one. We know Kwang Soo is perhaps the most loyal member when the camera's off, and at the height of rivalries in the show, Kim Jong Kook was basically looking after Kwang Soo and helping him get stronger off camera. So what they show us on screen is a show. And yet, this episode felt very real.\n\nThey'd joke from time to time about when people thought about leaving, and Jae Suk teases Suk Jin about it to this day, but each of them talked about their insecurities that episode and how they'd leaned on each other for support. Kind of epitomizes why Running Man has felt so inviting and comfortable for so long.",
            "author": "MegalomaniacHack",
            "id": "gw45mn7",
            "parent_id": "t3_mzwfbs",
            "score": 41,
            "created_utc": 1619568636.0,
            "replies": []
        },
        {
            "body": "The one comment that I loved the most is that: I feel sorry but if I say sorry then I shouldn't do it again and I know I will.\n\nthats a GREAT PERSON QUOTE RIGHT THEREEEE AND A LIFE LESSON FOR ALLLL\n\nIf you say sorry you should try ur best to stop doing it. Well it could be a personal thing since I hate it when one says sorry then keeps on doing it or don't try to stop doing it. So for me that comment was golder than gold 😤😤😤😤😤😤😤😤👏👏👏",
            "author": "miloray66",
            "id": "gw3ze6x",
            "parent_id": "t3_mzwfbs",
            "score": 65,
            "created_utc": 1619565507.0,
            "replies": []
        },
        {
            "body": "There will be major, major waterworks out of everyone on Kwangsoo’s last episode. Nothing is going to be able to prepare me for it. I’m doomed.",
            "author": "buddhabear07",
            "id": "gw3k2lo",
            "parent_id": "t3_mzwfbs",
            "score": 85,
            "created_utc": 1619558281.0,
            "replies": [
                {
                    "body": "So much pride for what he's become and sadness that they won't be working with him. Even if they weren't friends and close off camera, they're all losing a very giving performing partner.\n\nEveryone on the show has some of their best interactions and jokes when they play off of Kwang Soo. Whether he's playing an apprentice (and betrayer) to YJS, JSJ or KJK, a co-conspirator with Ha Ha, teasing SJH and JSM, or being teased by YJS or YSC, he's kind of the default person to go to for a reaction.\n\nI think more attention will shift to JSJ and JSM for that moving forward, since both already do a lot of that, and maybe someone else will surprise us, but the PD and cast have their work cut out for them now. A lot of games are going to be a lot less chaotic and surprising, and a lot of moments will be a lot more awkward without a perfectly-timed clown moment from Kwang Soo.",
                    "author": "MegalomaniacHack",
                    "id": "gw46vev",
                    "parent_id": "t1_gw3k2lo",
                    "score": 39,
                    "created_utc": 1619569258.0,
                    "replies": [
                        {
                            "body": "Yep. I expect less physicality as well. He is really the only under 47 (Korean age) guy on the show who is able to do a lot of physical missions. And yeah, he creates so much fun no matter who he is paired with. Will really miss those LKS-JSJ and LKS-YJS moments especially. Yoo-Lee is basically the biggest highlight of most of the recent 100 episodes",
                            "author": "chromelogan",
                            "id": "gw4zwz1",
                            "parent_id": "t1_gw46vev",
                            "score": 16,
                            "created_utc": 1619585253.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We know LKS is well known for his unlucky moments. But we all can agree he is one of the luckiest thing ever happened to our life. I just glad God created a fella like him.\n\n& hopefully he will recover, get married & come back soon!",
            "author": "azizulaziz88",
            "id": "gw4jutu",
            "parent_id": "t3_mzwfbs",
            "score": 28,
            "created_utc": 1619575756.0,
            "replies": [
                {
                    "body": "😭😭😭 stop! I've read so many post but this one  makes me cry lol",
                    "author": "xmodifier",
                    "id": "gw54dlw",
                    "parent_id": "t1_gw4jutu",
                    "score": 3,
                    "created_utc": 1619588557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was waiting to see who was going to recall this episode. All I could think about when Gary left was this episode and I feel the same now with LKS leaving",
            "author": "mdg31",
            "id": "gw3630b",
            "parent_id": "t3_mzwfbs",
            "score": 39,
            "created_utc": 1619552226.0,
            "replies": []
        },
        {
            "body": "i actually really liked this episode with everyones heart to hearts even though it was so cringeworthy for all the members lol I kinda hope they do this style again when he leaves with somin and sechan",
            "author": "catsandtings",
            "id": "gw3n6sn",
            "parent_id": "t3_mzwfbs",
            "score": 23,
            "created_utc": 1619559683.0,
            "replies": []
        },
        {
            "body": "Just imagine if they actually use this concept again for his last episode, I’m not sure if I can finish the whole episode then… :’(",
            "author": "Realistic_Boss_5642",
            "id": "gw4ewjw",
            "parent_id": "t3_mzwfbs",
            "score": 9,
            "created_utc": 1619573274.0,
            "replies": []
        },
        {
            "body": "Gotta say LKS is the best actor + comedian RunningMan could ask for.",
            "author": "ali19900",
            "id": "gw502zg",
            "parent_id": "t3_mzwfbs",
            "score": 5,
            "created_utc": 1619585370.0,
            "replies": []
        },
        {
            "body": "What episode was this?",
            "author": "AYOSHINA",
            "id": "gw36op4",
            "parent_id": "t3_mzwfbs",
            "score": 10,
            "created_utc": 1619552485.0,
            "replies": [
                {
                    "body": " Episode 295",
                    "author": "MrAjusshi",
                    "id": "gw39k39",
                    "parent_id": "t1_gw36op4",
                    "score": 20,
                    "created_utc": 1619553693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I barely held back my tears. I don't think I can watch the episode the last episode that Lee Kwang Soo is in...",
            "author": "chromelogan",
            "id": "gw4zds6",
            "parent_id": "t3_mzwfbs",
            "score": 4,
            "created_utc": 1619584881.0,
            "replies": []
        },
        {
            "body": "We've seen how every members emotions in this episode and when Gary left. Would be interesting to see how sechan and somin will react his last episode lol",
            "author": "xmodifier",
            "id": "gw547ve",
            "parent_id": "t3_mzwfbs",
            "score": 4,
            "created_utc": 1619588429.0,
            "replies": []
        },
        {
            "body": "Ji Hyo’s smile when she says “You held on to me” always gets me, and now she has to let him go. Their friendship is so precious. Kwangmong is love.",
            "author": "lijiburr",
            "id": "gw976f0",
            "parent_id": "t3_mzwfbs",
            "score": 4,
            "created_utc": 1619666308.0,
            "replies": []
        },
        {
            "body": "I don't want to be sad because I know May won't be the last time we see Kwangsoo. I love actor Kwangsoo and real life Kwangsoo, but Running Man Kwangsoo has always overshadowed his other sides. I expect Running Man will still call Kwangsoo during missions even if it's just to tease him. I also look forward to his guestings. I look forward to a continuous flower path with Kwangsoo, and a more successful acting career for him, which I will wholeheartedly support. There are so many things to look forward to, Runners. Kwangsoo is forever!",
            "author": "Edenelle",
            "id": "gw8szc9",
            "parent_id": "t3_mzwfbs",
            "score": 4,
            "created_utc": 1619659208.0,
            "replies": []
        },
        {
            "body": "I watched this episode and it moved me. I was able to see their hearts and how all of them have been struggling off-screen.\n\nIt’s really nice to see the members just being honest with each other especially YJS and KJK as well as Ji Suk Jin. We see KJK as someone strong but deep inside that he’s struggling with how to act his role. Everone expects him to always be strong but he’s a human like us who has limits too. Ji Suk Jin on the other hand struggled being a part of the group and honestly, I’d feel the same way he did too. It’s great that he was able to overcome those feelings and be one with Running Man family.\n\nAnd now, Kwang Soo’s leaving. They’ve been through a lot together. Especially when Gary left, it was hard for Ji Hyo and Kwang Soo was there to support her especially during the times that she wanted to quit the show. Kwang Soo became her pillar. I’m not ready to see Ji Hyo cry again 💔\n\nI love this family so much :( They always make me smile when I feel so down. Nothing could ever compare 😭",
            "author": "mondaysx_",
            "id": "gw9e30m",
            "parent_id": "t3_mzwfbs",
            "score": 4,
            "created_utc": 1619670423.0,
            "replies": []
        },
        {
            "body": "woah wth, why does LKS sound so mature and deep?!",
            "author": "nelson_manvella",
            "id": "gw51jik",
            "parent_id": "t3_mzwfbs",
            "score": 3,
            "created_utc": 1619586416.0,
            "replies": []
        },
        {
            "body": "She’s such a guy. She doesn’t like to talk about her feelings and she acts tough. Newer fans who never saw her during the RM hay day are always criticizing her for not being funny enough or not being talkative. JH was as talkative as so min once and you can see her transition, from the talkative member into a reactive member. Let’s also be honest about one thing, variety shows in Korea is a male dominated field and therefore the forefront of the shows are males. They are expected to get a bigger screen time and dominate the conversation. Women are there to be the “trying hard” to play with the men. They’re there for the visual and the occasional games between women that ads to the appeal of the show. Women in variety shows are never treated as equal when it comes to physical games. JH made it possible for women in variety shows especially actresses to be active and loose their feminine charms in order to win the games. For these reasons, i believed SJ was hired. She was not an average Korean actress, sure she’s beautiful and charming, but she’s also feisty and tough, she doesn’t act like a girl when she’s cornered, she fights back when she’s hurt. RM fans loved her because of those qualities, she made being a girl in variety show an advantage rather than liability. She has the advantage of being seen as weak, therefore not a real competition for men who are not only sexists but also a bully. Fans now a days thinks that the casts should either have more active games or get replaced by new members. They have ideas who they want to see, but often forget that the reason they are able to watch RM now after all these years is because of the original casts and the staff’s hard work. Each and everyone of them made it possible to reach 11yrs. The original casts worked hard for 7 yrs thru ups and downs and to say that SJ or some other member is not helping RM is not only disrespectful but also delusional on their part. Without the original 7 or even Jong Ki, we wouldn’t have been able to watch their 11th year anniversary.",
            "author": "Turbulent-Draw-8623",
            "id": "h59prql",
            "parent_id": "t3_mzwfbs",
            "score": 3,
            "created_utc": 1626353539.0,
            "replies": []
        },
        {
            "body": "This scene and his speech in the 2016 SBS Entertainment Awards...",
            "author": "Sw4nSea",
            "id": "gw48y7e",
            "parent_id": "t3_mzwfbs",
            "score": 2,
            "created_utc": 1619570301.0,
            "replies": []
        },
        {
            "body": "I don’t know how I’ll watch his last episode, this and every other appreciation post already has me sobbing 😭",
            "author": "real_highlight_reel",
            "id": "gw4s86w",
            "parent_id": "t3_mzwfbs",
            "score": 2,
            "created_utc": 1619580348.0,
            "replies": []
        },
        {
            "body": "man, i hope i'd still get to see him on movies/series, this is heartbreaking, hes my main reason i got into RM. and i try to be like him, to be able to make people's day by making them laugh, cant bear to see the episode when he says his farewell to the cast, producers, staffs and fans.",
            "author": "irieislo",
            "id": "gw5hksb",
            "parent_id": "t3_mzwfbs",
            "score": 2,
            "created_utc": 1619600111.0,
            "replies": []
        },
        {
            "body": "I love this scene very much! Before I didn't know if they were so close each other until this episode. I always like the way LKS treat SJH. Good actor, comedian plus he has a good voice!",
            "author": "kuliner100",
            "id": "gwb48d8",
            "parent_id": "t3_mzwfbs",
            "score": 2,
            "created_utc": 1619711332.0,
            "replies": []
        },
        {
            "body": "Okay so I cried again.\n\nI really can't imagine how painful the last shoot will be for Jihyo.",
            "author": "elixir0193",
            "id": "gwjau8z",
            "parent_id": "t3_mzwfbs",
            "score": 2,
            "created_utc": 1619873693.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gwjsk8e",
                    "parent_id": "t1_gwjau8z",
                    "score": 1,
                    "created_utc": 1619882685.0,
                    "replies": [
                        {
                            "body": "And I remember Jihyo saying that she approached Kwangsoo when she ran away from home or something like that, so I think she's comfortable with him the most maybe? That's just my assumption.",
                            "author": "elixir0193",
                            "id": "gwjt10m",
                            "parent_id": "t1_gwjsk8e",
                            "score": 1,
                            "created_utc": 1619882878.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bro what is this lmaoooo I’m dead and I don’t even know what’s goin on.... also this was sad and I don’t know who these people are lol",
            "author": "HardCashOut",
            "id": "h79wvih",
            "parent_id": "t3_mzwfbs",
            "score": 1,
            "created_utc": 1627788243.0,
            "replies": []
        },
        {
            "body": "Kwang Soo framing Ji Hyo, and Gary's crush leading to Monday Couple, those two things always gave her something to be comfortable with on the show as she found her place amongst much more outgoing, talkative personalities.",
            "author": "MegalomaniacHack",
            "id": "gw4638k",
            "parent_id": "t1_gw3yy2l",
            "score": 48,
            "created_utc": 1619568870.0,
            "replies": []
        },
        {
            "body": "Yeah I feel like this is one of the few scenes where we see the real Kwang Soo, not the actor or comedian, just the dude.",
            "author": "kyramaro",
            "id": "gw7is3l",
            "parent_id": "t1_gw4k6lp",
            "score": 17,
            "created_utc": 1619638115.0,
            "replies": []
        },
        {
            "body": "So much pride for what he's become and sadness that they won't be working with him. Even if they weren't friends and close off camera, they're all losing a very giving performing partner.\n\nEveryone on the show has some of their best interactions and jokes when they play off of Kwang Soo. Whether he's playing an apprentice (and betrayer) to YJS, JSJ or KJK, a co-conspirator with Ha Ha, teasing SJH and JSM, or being teased by YJS or YSC, he's kind of the default person to go to for a reaction.\n\nI think more attention will shift to JSJ and JSM for that moving forward, since both already do a lot of that, and maybe someone else will surprise us, but the PD and cast have their work cut out for them now. A lot of games are going to be a lot less chaotic and surprising, and a lot of moments will be a lot more awkward without a perfectly-timed clown moment from Kwang Soo.",
            "author": "MegalomaniacHack",
            "id": "gw46vev",
            "parent_id": "t1_gw3k2lo",
            "score": 39,
            "created_utc": 1619569258.0,
            "replies": [
                {
                    "body": "Yep. I expect less physicality as well. He is really the only under 47 (Korean age) guy on the show who is able to do a lot of physical missions. And yeah, he creates so much fun no matter who he is paired with. Will really miss those LKS-JSJ and LKS-YJS moments especially. Yoo-Lee is basically the biggest highlight of most of the recent 100 episodes",
                    "author": "chromelogan",
                    "id": "gw4zwz1",
                    "parent_id": "t1_gw46vev",
                    "score": 16,
                    "created_utc": 1619585253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😭😭😭 stop! I've read so many post but this one  makes me cry lol",
            "author": "xmodifier",
            "id": "gw54dlw",
            "parent_id": "t1_gw4jutu",
            "score": 3,
            "created_utc": 1619588557.0,
            "replies": []
        },
        {
            "body": " Episode 295",
            "author": "MrAjusshi",
            "id": "gw39k39",
            "parent_id": "t1_gw36op4",
            "score": 20,
            "created_utc": 1619553693.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwjsk8e",
            "parent_id": "t1_gwjau8z",
            "score": 1,
            "created_utc": 1619882685.0,
            "replies": [
                {
                    "body": "And I remember Jihyo saying that she approached Kwangsoo when she ran away from home or something like that, so I think she's comfortable with him the most maybe? That's just my assumption.",
                    "author": "elixir0193",
                    "id": "gwjt10m",
                    "parent_id": "t1_gwjsk8e",
                    "score": 1,
                    "created_utc": 1619882878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep. I expect less physicality as well. He is really the only under 47 (Korean age) guy on the show who is able to do a lot of physical missions. And yeah, he creates so much fun no matter who he is paired with. Will really miss those LKS-JSJ and LKS-YJS moments especially. Yoo-Lee is basically the biggest highlight of most of the recent 100 episodes",
            "author": "chromelogan",
            "id": "gw4zwz1",
            "parent_id": "t1_gw46vev",
            "score": 16,
            "created_utc": 1619585253.0,
            "replies": []
        },
        {
            "body": "And I remember Jihyo saying that she approached Kwangsoo when she ran away from home or something like that, so I think she's comfortable with him the most maybe? That's just my assumption.",
            "author": "elixir0193",
            "id": "gwjt10m",
            "parent_id": "t1_gwjsk8e",
            "score": 1,
            "created_utc": 1619882878.0,
            "replies": []
        }
    ]
}