{
    "title": "Just the facts both sd's and sb's should be prepared",
    "post_id": "fn7n12",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fn7n12/just_the_facts_both_sds_and_sbs_should_be_prepared/",
    "author": "youngerwomanlove",
    "body": "I just want everyone to be prepared. Even after the CV-19 is over the economy isn't going to come right back.\n\nIn 1933 the stock market declined by 32%\n\nLast month the stock market declined by 34.5%\n\nUnemployment in the Great Depression at the worst was 24.7%\n\nThey estimate unemployment now will hit 20% within a month.\n\nIn the Great Recession the unemployment was 9.8%\n\nThings are going to change long term on both sides of bowl.\n\nEvery one be safe and careful. Be prepared",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fn7n12/just_the_facts_both_sds_and_sbs_should_be_prepared/",
    "score": 101,
    "upvote_ratio": 0.89,
    "created_utc": 1584912623.0,
    "num_comments": 85,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "If things don't start turning around in the next 2 to 3 weeks (drastically), there won't be a bowl for a long time.  It will be too toxic, predators on both sides. Sadly, already seeing that on SA.",
            "author": "oso8daddy",
            "id": "fl81asu",
            "parent_id": "t3_fn7n12",
            "score": 46,
            "created_utc": 1584913791.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fl84uxc",
                    "parent_id": "t1_fl81asu",
                    "score": 6,
                    "created_utc": 1584915911.0,
                    "replies": [
                        {
                            "body": "Sugar has lasted for more than 2,000 years.  Evolution will occur but not extermination .",
                            "author": "pinotandsugar",
                            "id": "fl8ven4",
                            "parent_id": "t1_fl84uxc",
                            "score": 16,
                            "created_utc": 1584933298.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Predators?",
                    "author": "redditisrandom",
                    "id": "fl81m8w",
                    "parent_id": "t1_fl81asu",
                    "score": 2,
                    "created_utc": 1584913988.0,
                    "replies": [
                        {
                            "body": "\"SD\"s offering money and taking advantage of SBs, or \"SB\"s rinsing/stealing from SDs.",
                            "author": "SD22112211",
                            "id": "fl84zjz",
                            "parent_id": "t1_fl81m8w",
                            "score": 18,
                            "created_utc": 1584915987.0,
                            "replies": [
                                {
                                    "body": "That just recently happened to me. Taken advantage of and raped in the process. It was awful. Totally out of the bowl since then",
                                    "author": null,
                                    "id": "fl8insw",
                                    "parent_id": "t1_fl84zjz",
                                    "score": 20,
                                    "created_utc": 1584924557.0,
                                    "replies": [
                                        {
                                            "body": "I hope you get the care and support you need 💜",
                                            "author": "druggiethrowaway4206",
                                            "id": "fl8kew1",
                                            "parent_id": "t1_fl8insw",
                                            "score": 18,
                                            "created_utc": 1584925732.0,
                                            "replies": [
                                                {
                                                    "body": "I did but don’t go to the ER for PEP because they don’t do anything for you. \nI’ve gone into camming and absolutely love it",
                                                    "author": null,
                                                    "id": "fl8owq7",
                                                    "parent_id": "t1_fl8kew1",
                                                    "score": 9,
                                                    "created_utc": 1584928747.0,
                                                    "replies": [
                                                        {
                                                            "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
                                                            "author": "highfructoseSD",
                                                            "id": "fl8pzma",
                                                            "parent_id": "t1_fl8owq7",
                                                            "score": 5,
                                                            "created_utc": 1584929469.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                                                                    "author": "lofibunny",
                                                                    "id": "fl8qppt",
                                                                    "parent_id": "t1_fl8pzma",
                                                                    "score": 5,
                                                                    "created_utc": 1584929967.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Im so sorry.",
                                            "author": "dade_murphy1",
                                            "id": "fl8wakx",
                                            "parent_id": "t1_fl8insw",
                                            "score": 3,
                                            "created_utc": 1584933946.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I figured, just clarifying",
                                    "author": "redditisrandom",
                                    "id": "fl85313",
                                    "parent_id": "t1_fl84zjz",
                                    "score": 1,
                                    "created_utc": 1584916045.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "As in specifically the predator, that one ugly looking mother fucker!",
                            "author": "BigBearSD",
                            "id": "fl9fv5n",
                            "parent_id": "t1_fl81m8w",
                            "score": 1,
                            "created_utc": 1584953815.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My observations:\n\n - One on one meetings are well within most lockdown guidelines.  \n - Public Meet & Greets, dining out, movies and clubs, etc are a problem since most options are closed in bigger cities. \n - Many college SBs have had to leave their campuses and take online classes.  Most have returned home and have less flexibility to meet while home with Mom & Dad. \n - SBs with children will have child care issues that limit their availability. \n - Many SBs work retail, restaurant or hospitality jobs and are out of work and in greater need of financial support.\n - Many SDs have seen large impacts to their work, income and wealth impacting their ability to provide an allowance. \n - Many SDs may be working from home and have less availability if they are married or otherwise attached. \n - Many SDs are older, have health issues and may fall into high risk categories.   As a result they are less willing to meet. \n\nI'm a single man in my mid 50s, still in very good health, live alone and mostly insulated from the economic impact of the pandemic.   SBs seem to be very willing to go on lockdown together.  It's a great way to ride through a quarantine.",
                    "author": "willfromvb",
                    "id": "fl9k9ou",
                    "parent_id": "t1_fl81asu",
                    "score": 4,
                    "created_utc": 1584959507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fl864ys",
            "parent_id": "t3_fn7n12",
            "score": 13,
            "created_utc": 1584916677.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fl86n64",
                    "parent_id": "t1_fl864ys",
                    "score": 7,
                    "created_utc": 1584916980.0,
                    "replies": [
                        {
                            "body": ">Literally no one has any idea how or when this thing \"ends\" and even what the \"end\" looks like. \n\nChina is already reopenings schools and taking down temporal hospitals.\n\nThey are also massively expanding foreign aid to deal with the virus.\n\nIt seems like they are past the peak and getting back to normal everyday.",
                            "author": null,
                            "id": "fl91qbp",
                            "parent_id": "t1_fl86n64",
                            "score": 0,
                            "created_utc": 1584938265.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fl91uu8",
                                    "parent_id": "t1_fl91qbp",
                                    "score": 8,
                                    "created_utc": 1584938370.0,
                                    "replies": [
                                        {
                                            "body": ">We only know what China wants us to know \n\nDidn't you see the whistleblowers? The thousands of vids on Twitter? (Which supposedly doesn't exist in China).\n\nThey couldn't control the spread of information and they won't be able to if thousands are still dying everyday.\n\nAnd this virus has even reached high ranking communist party members and their families, they can't just dissapear those people.",
                                            "author": null,
                                            "id": "fl926xo",
                                            "parent_id": "t1_fl91uu8",
                                            "score": 2,
                                            "created_utc": 1584938654.0,
                                            "replies": [
                                                {
                                                    "body": "Is this what youre referring to? [https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower](https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower)",
                                                    "author": "ilovecookies86",
                                                    "id": "fl9uq9i",
                                                    "parent_id": "t1_fl926xo",
                                                    "score": 2,
                                                    "created_utc": 1584969793.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "fl92api",
                                                    "parent_id": "t1_fl926xo",
                                                    "score": 1,
                                                    "created_utc": 1584938745.0,
                                                    "replies": [
                                                        {
                                                            "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
                                                            "author": "highjinx411",
                                                            "id": "fl953w2",
                                                            "parent_id": "t1_fl92api",
                                                            "score": 2,
                                                            "created_utc": 1584941317.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "China shows the world only what they want us to see and believe. \n\nPut little value on their figures.\n\nThis is the same country that told the world that there was no covid-19 epidemic. Their word means nothing.",
                                    "author": "TonyMarcaroni",
                                    "id": "fl93dxt",
                                    "parent_id": "t1_fl91qbp",
                                    "score": 0,
                                    "created_utc": 1584939716.0,
                                    "replies": [
                                        {
                                            "body": "Agreed. The looming question though is, what is the state of the virus there? They’re an example of what might happen here.",
                                            "author": "why_so_sexy_",
                                            "id": "flago37",
                                            "parent_id": "t1_fl93dxt",
                                            "score": 2,
                                            "created_utc": 1584983503.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It only took 8 years to recover and your right it was WWII that pulled us out of the depression. We can't borrow any money if no one buys our tbills",
                    "author": "youngerwomanlove",
                    "id": "fl89ul8",
                    "parent_id": "t1_fl864ys",
                    "score": 3,
                    "created_utc": 1584918932.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fl8mo28",
                            "parent_id": "t1_fl89ul8",
                            "score": 2,
                            "created_utc": 1584927241.0,
                            "replies": [
                                {
                                    "body": "Interesting. Wasn't this same industry big during the years 2009-2012 (approximately)? \"Don't put your money in the US stock market, it will never recover / the recovery that's occurred to date is fake and the market will soon turn down again.\"",
                                    "author": "highfructoseSD",
                                    "id": "fl8qe20",
                                    "parent_id": "t1_fl8mo28",
                                    "score": 1,
                                    "created_utc": 1584929744.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Or we could do what Germany did to get out of the depression (and versailles treaty)... elect someone like Hitler, ramp up military spending, say fuck it to all of our foreign debt and obligations (imho we should do that with China since they essentially caused all of this), start persecuting some great \"other\" and start annexing nearby places, then start a world war... i am being facetious, but we (the US) did not get hit as badly by the depression as some did (Germany and the Soviet Union being extreme examples). \n\nI mean in the Soviet Union you had famine, Stalin solidifying his control and centralization of the USSR,  famine and purges killing tens of millions of people during the height of the world wide depression.\n\nWorld War II didnt just get the USA out of the depression, but got the world out of a depression. It only took the largest and bloodiest war in all of human history to do that...\n\nI hope it wont take WWIII for us to turn a corner. \n\nBut again back to my first point Nazi Germany ignored their WWI debt bills and managed to do just fine, until you know Poland....",
                            "author": "BigBearSD",
                            "id": "fl9gkq1",
                            "parent_id": "t1_fl89ul8",
                            "score": 2,
                            "created_utc": 1584954752.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah the Great Depression started to wind down as we inched closer to war. Also, some years were worse than others. Some countries had it far worse than others (hit USA pretty bad, but in places like say Germany it hit them so hard the Nazis came to power...). While this Corona Virus stuff is bad, in a historical context things can get a shit ton worse. Question is will we get to that point, or not.",
                    "author": "BigBearSD",
                    "id": "fl9g2lh",
                    "parent_id": "t1_fl864ys",
                    "score": 2,
                    "created_utc": 1584954085.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fl8r9l5",
                    "parent_id": "t1_fl864ys",
                    "score": 2,
                    "created_utc": 1584930347.0,
                    "replies": [
                        {
                            "body": "I want one of them to teach me how all this crap works. I feel like an idiot lol.",
                            "author": "FickleImagination8",
                            "id": "fl8z1kq",
                            "parent_id": "t1_fl8r9l5",
                            "score": 1,
                            "created_utc": 1584936049.0,
                            "replies": []
                        },
                        {
                            "body": "I'm so bored I'm half considering suggesting a Zoom SLF happy hour where we all drink wine and say hi.",
                            "author": "ilovecookies86",
                            "id": "fl9ut9i",
                            "parent_id": "t1_fl8r9l5",
                            "score": 1,
                            "created_utc": 1584969858.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl82rz0",
            "parent_id": "t3_fn7n12",
            "score": 54,
            "created_utc": 1584914687.0,
            "replies": [
                {
                    "body": "To be fair, a few weeks ago most news (in the States) where either down playing this or ignoring it. While social media (of which reddit is one type) was sharing the news from around the world that was much more accurate than what came from traditional media on CORVID19.",
                    "author": "SD22112211",
                    "id": "fl84wcl",
                    "parent_id": "t1_fl82rz0",
                    "score": 20,
                    "created_utc": 1584915935.0,
                    "replies": [
                        {
                            "body": "You mean Trump was down playing it and only recently has started taking it seriously. Most legitimate news outlets have been sounding the alarm for over a month.",
                            "author": "willfromvb",
                            "id": "fl86mht",
                            "parent_id": "t1_fl84wcl",
                            "score": 16,
                            "created_utc": 1584916969.0,
                            "replies": [
                                {
                                    "body": "Not really. (If we are talking NBC/ABC/CNN/etc.) It wasn't until a month ago that it started to become a big thing. Really until after Super Tuesday on March 3rd. Until that point the race for the Dem nomination was the main talking point, and COVID would be regulated to the C block on most news (if talked about at all). Hell when CPAC happened (Feb 26-29th) a few people they brought in there had it (and was known) but they didn't even bother to tell their guests until weeks later. It really has not been a major news outlet story until recently. While Weibo/twitter/reddit/etc. where talking about it as a major (globally) issue back in December.",
                                    "author": "SD22112211",
                                    "id": "fl879ei",
                                    "parent_id": "t1_fl86mht",
                                    "score": 8,
                                    "created_utc": 1584917353.0,
                                    "replies": []
                                },
                                {
                                    "body": "I recall a lot of people on this forum downplaying it and arguing that it won't have an effect.",
                                    "author": "UseTheForceRey",
                                    "id": "fl8bp77",
                                    "parent_id": "t1_fl86mht",
                                    "score": 8,
                                    "created_utc": 1584920065.0,
                                    "replies": [
                                        {
                                            "body": "I still dont see this forum as a good source for Coronavirus information",
                                            "author": "willfromvb",
                                            "id": "fl8ekye",
                                            "parent_id": "t1_fl8bp77",
                                            "score": 10,
                                            "created_utc": 1584921900.0,
                                            "replies": [
                                                {
                                                    "body": "Certainly true.",
                                                    "author": "UseTheForceRey",
                                                    "id": "fl8fces",
                                                    "parent_id": "t1_fl8ekye",
                                                    "score": 3,
                                                    "created_utc": 1584922391.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Trump was saying it was a hoax and several people had it and it be down to 0 soon in US a couple weeks ago anyone can watch the videos. And also the warm weather would make it go away.",
                                            "author": "Davge107",
                                            "id": "fl9af5n",
                                            "parent_id": "t1_fl8bp77",
                                            "score": 1,
                                            "created_utc": 1584946966.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you mean I shouldn’t have bought two bottles of rose tonight? 😂",
            "author": "Savvvyg1",
            "id": "fl8hci0",
            "parent_id": "t3_fn7n12",
            "score": 6,
            "created_utc": 1584923699.0,
            "replies": [
                {
                    "body": "Me as I just grabbed a glass from my fridge haha!",
                    "author": "loungegirl",
                    "id": "fl8shwh",
                    "parent_id": "t1_fl8hci0",
                    "score": 1,
                    "created_utc": 1584931210.0,
                    "replies": [
                        {
                            "body": "Me as I just drank an entire bottle tonight",
                            "author": "Savvvyg1",
                            "id": "fl8wdc1",
                            "parent_id": "t1_fl8shwh",
                            "score": 1,
                            "created_utc": 1584934004.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": " it will be a buyers market for sure. sugaring allowances will drop through the floor.",
            "author": "Academic_Set",
            "id": "fl8271z",
            "parent_id": "t3_fn7n12",
            "score": 25,
            "created_utc": 1584914338.0,
            "replies": [
                {
                    "body": "My company is involved in oil field services and with the price of oil falling through the basement I can tell you it will have a huge impact on the Texas bowl.\n\nEven field workers made 150-200k a year in 2019.\n\nMost of those people were furloughed this month.\n\nBoth sides need to stay safe and avoid quick money scams that are too good to be true. When people are vulnerable they get preyed upon.",
                    "author": "KnocDown",
                    "id": "fl8ixm0",
                    "parent_id": "t1_fl8271z",
                    "score": 15,
                    "created_utc": 1584924739.0,
                    "replies": [
                        {
                            "body": "PEOPLE for the love of god please stay away from MLMs",
                            "author": "sugarprincessp",
                            "id": "fl8qyhi",
                            "parent_id": "t1_fl8ixm0",
                            "score": 5,
                            "created_utc": 1584930132.0,
                            "replies": [
                                {
                                    "body": "What?! Tea tree oil doesn't kill covid 19 when defused?! I've been lied to!",
                                    "author": "KnocDown",
                                    "id": "fl8teac",
                                    "parent_id": "t1_fl8qyhi",
                                    "score": 7,
                                    "created_utc": 1584931840.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ve already started to hear the “a lot of girls are desperate right now, so you’re going to have to adjust” narrative from friends, and from a guy who wants me to do stuff with him for free lol.\n\nBut so far it’s been the opposite for me, everyone is bored, scared and horny and I’ve been asked to go on dates by old POTs / SDs daily, with the same or even better ppm due to the situation (I declined all except 1 so far though).",
                    "author": null,
                    "id": "fl97imj",
                    "parent_id": "t1_fl8271z",
                    "score": 2,
                    "created_utc": 1584943769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In 1930, there was no Ben Bernanke, the massively underrated hero who saved us from 1930s repeat in 2008.\n\nIn 2020, we know Fiscal Stimulus and intervention works. Expect Government to flood helicopter money again to limit the damages. There will be pain, but we have far more tools to combat it",
            "author": "xanfiles",
            "id": "fl86qd3",
            "parent_id": "t3_fn7n12",
            "score": 11,
            "created_utc": 1584917033.0,
            "replies": [
                {
                    "body": "This is contrary to what most experts are saying.\n\nThere will be little economic activity for months. And even when things start up again, millions will be unemployed and those that aren't will not be in a hurry to spend.\n\nI really wish this was just a quick downturn but that is extremely unlikely. We don't even know when things will be back to normal. It could be 4 weeks, it could be 4 months or it could be longer.\n\nEven with govenrnent fiscal help, it will probably just help huge corporations survive. Small business owners, which represent a large portion of the economy, will be decemated and this will have a domino effect on eveything.",
                    "author": "TonyMarcaroni",
                    "id": "fl931ab",
                    "parent_id": "t1_fl86qd3",
                    "score": 3,
                    "created_utc": 1584939398.0,
                    "replies": [
                        {
                            "body": "I'm not denying anything what you are saying.\n\nBut in 2020 we have found ways to  boost the economy operating under capacity. (Thanks to Keynes, Bernanke and the modern federal reserve way of thinking). \n\nThat's why there is nary a pip this time when Fed was ready to print money or the treasury was ready to stimulate with $1T or $2T deficit spending",
                            "author": "xanfiles",
                            "id": "fl99k70",
                            "parent_id": "t1_fl931ab",
                            "score": 1,
                            "created_utc": 1584945983.0,
                            "replies": []
                        },
                        {
                            "body": "Small businesses are a majority of businesses (99%), but they represent less than half of GDP (43%) and only just over half of jobs (64%). It will be bad and you’re right that it’ll be large businesses best positioned to survive, but it’s also not black and white. \n\nAlso remember that “small business” doesn’t just mean Joe’s Bar. It also includes plumbers, McDonald’s franchisees, and your local CPA, none of which are being destroyed by this crisis...yet.",
                            "author": "captcreamfiller",
                            "id": "flajkc5",
                            "parent_id": "t1_fl931ab",
                            "score": 1,
                            "created_utc": 1584985151.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "St. Louis Fed predicting 30% unemployment and GDP down 50% in Q2.  That would be absolutely devastating.\n\nhttps://www.bloomberg.com/news/articles/2020-03-22/fed-s-bullard-says-u-s-jobless-rate-may-soar-to-30-in-2q",
            "author": "Foonka83",
            "id": "fl91its",
            "parent_id": "t3_fn7n12",
            "score": 6,
            "created_utc": 1584938091.0,
            "replies": [
                {
                    "body": "You know what surprised me, some people here saying this will be temporary and things will be back to normal soon enough.\n\n\"loans will fix everything\". \n\nI'm not sure if they're in denial or they really believe this. \n\nUnfortunately, We're in this terrible mess for the long haul.",
                    "author": "TonyMarcaroni",
                    "id": "fl93qrx",
                    "parent_id": "t1_fl91its",
                    "score": 4,
                    "created_utc": 1584940044.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve noticed a huge flood of online scammers appear since the end of January. Abhorrent behavior from both sides of the fence. Such a disgrace. Stay safe out there everyone! 💋",
            "author": "EmmaLouzer",
            "id": "fl8lvwq",
            "parent_id": "t3_fn7n12",
            "score": 4,
            "created_utc": 1584926720.0,
            "replies": []
        },
        {
            "body": "It will take months for ths pandemic to blow over.  Bad news is a vaccine is at least a year away.  Good news is for most all of us, this will be a cold.  But you're right, it will be months for the economy to get moving again.  IMHO, 6 months things should be better but still not back to normal.\nHang in there everyone.",
            "author": "Life_b_beautiful",
            "id": "fl82e4g",
            "parent_id": "t3_fn7n12",
            "score": 9,
            "created_utc": 1584914455.0,
            "replies": []
        },
        {
            "body": "My SD already dropped me. I have no income now lol :( and I’m not eligible for unemployment. This all fucking sucks",
            "author": null,
            "id": "fl8mt8r",
            "parent_id": "t3_fn7n12",
            "score": 8,
            "created_utc": 1584927337.0,
            "replies": []
        },
        {
            "body": "I am at the end of the rope when when it comes to all of this virus doomsday nonsense here and elsewhere. I reached it when a young man I knew committed suicide yesterday. He had depression issues but I know for certain all of this rhetoric was the end for him. I should have seen it coming, he was in panic, completely absorbed in the doom being fed to him by the media and social networks.  I am to the point of just being completely disgusted by it. I cannot begin to imagine what it's like to be a child right now, this has to be pure fear for them.",
            "author": null,
            "id": "fl8cscr",
            "parent_id": "t3_fn7n12",
            "score": 11,
            "created_utc": 1584920751.0,
            "replies": [
                {
                    "body": "I agree",
                    "author": "BaddBunneyy",
                    "id": "fl8gmbp",
                    "parent_id": "t1_fl8cscr",
                    "score": 5,
                    "created_utc": 1584923225.0,
                    "replies": []
                },
                {
                    "body": "Oh my gosh, im so sorry. My kiddo is pretty young but ive been open and positive and am giving him enough information to feel informed but not enough to overwhelm him. We are doing a lot of cleaning and gardening and animal tending. Basic life skill stuff. Our house feels safe and calm and thats the best i can do for now.",
                    "author": "OliviaWildflower2332",
                    "id": "fl8likc",
                    "parent_id": "t1_fl8cscr",
                    "score": 4,
                    "created_utc": 1584926473.0,
                    "replies": [
                        {
                            "body": "Absolutely.  A large part of how the kids feel will be based on how their parents/guardians react to all this.  Kids can be amazingly resilient to changes in circumstances.",
                            "author": "LemonadeIncome",
                            "id": "fl8mhd9",
                            "parent_id": "t1_fl8likc",
                            "score": 5,
                            "created_utc": 1584927115.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My SD sent me a message that he's cutting me off until it gets better, as he can't see me in person. I had all these cute lingerie sets prepped for our skype sessions. So sad 😔",
            "author": "Iam_nanette_manoir",
            "id": "fl8ms3a",
            "parent_id": "t3_fn7n12",
            "score": 9,
            "created_utc": 1584927316.0,
            "replies": [
                {
                    "body": "Before anyone says anything, I am able to support myself on my own.  I am going to miss the perks and fun.",
                    "author": "Iam_nanette_manoir",
                    "id": "fl8n0bz",
                    "parent_id": "t1_fl8ms3a",
                    "score": 7,
                    "created_utc": 1584927471.0,
                    "replies": [
                        {
                            "body": "I'm sorry to hear this <3",
                            "author": "awaiting_sugar",
                            "id": "flabhj2",
                            "parent_id": "t1_fl8n0bz",
                            "score": 1,
                            "created_utc": 1584980571.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "🥺...😭...Sending hugs. 💕",
                    "author": "EmmaLouzer",
                    "id": "fl8n4jc",
                    "parent_id": "t1_fl8ms3a",
                    "score": 2,
                    "created_utc": 1584927551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a blizzard... not a hurricane.  It’s a mess but the underlying infrastructure is still there.  Banks will be lending at historically low rates and things will be ok.",
            "author": "LotBuilder",
            "id": "fl8hef4",
            "parent_id": "t3_fn7n12",
            "score": 6,
            "created_utc": 1584923735.0,
            "replies": [
                {
                    "body": "Banks will feel the pinch once loans go bad.",
                    "author": null,
                    "id": "fl8ljes",
                    "parent_id": "t1_fl8hef4",
                    "score": 4,
                    "created_utc": 1584926488.0,
                    "replies": [
                        {
                            "body": "The average LTV in the US on residential loans is under 60%.  Banks are praying that happens",
                            "author": "LotBuilder",
                            "id": "fl8mhdf",
                            "parent_id": "t1_fl8ljes",
                            "score": 1,
                            "created_utc": 1584927115.0,
                            "replies": [
                                {
                                    "body": "Corporate debt is likely the bigger problem this time! Cos have raised “cheap debt” to buyback stock and enrich execs. Won’t end well in these circumstances!",
                                    "author": null,
                                    "id": "fl8mogo",
                                    "parent_id": "t1_fl8mhdf",
                                    "score": 3,
                                    "created_utc": 1584927248.0,
                                    "replies": [
                                        {
                                            "body": "People will be pulling the equity out of their homes to get them by. Banks have to worry about commercial properties, small businesses going out of business and junk bonds. There was no one to buy mortgaged back securities on 03/13/2020. That is why the government started buying them.",
                                            "author": "youngerwomanlove",
                                            "id": "fl8rape",
                                            "parent_id": "t1_fl8mogo",
                                            "score": 1,
                                            "created_utc": 1584930368.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly my point. The contagion will be heavy. Once defaults start it’s hard to slow them. Plenty of people will file for bankruptcy in coming weeks.",
                                                    "author": null,
                                                    "id": "fl8yudr",
                                                    "parent_id": "t1_fl8rape",
                                                    "score": 3,
                                                    "created_utc": 1584935897.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl8m8vf",
            "parent_id": "t3_fn7n12",
            "score": 5,
            "created_utc": 1584926959.0,
            "replies": [
                {
                    "body": " I hope you are like a very rare case cause we don’t want online / platonic sugar babies to thrive ...",
                    "author": null,
                    "id": "fl9727p",
                    "parent_id": "t1_fl8m8vf",
                    "score": 0,
                    "created_utc": 1584943292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree. The key right now is to ask yourself the hard question, what if my income was shut out for 3 mos, 6 mos, 9 mos, 18 mos, 24 mos, 36 mos, would I still be able to survive.",
            "author": null,
            "id": "fl80nwm",
            "parent_id": "t3_fn7n12",
            "score": 4,
            "created_utc": 1584913412.0,
            "replies": []
        },
        {
            "body": "The main concern in this is people who never been in the bowl are going to jump in there and guys posing as sd’s will come with lower amounts and people get desperate and will take what ever and then end up hurt in all sorts of ways. \nI have already seen this with some sb’s contacting for less than half. Pretty much giving it away. Please ladies don’t stoop and degrade yourself and hope none gets taken advantage of by posers.",
            "author": "DiligentHall5",
            "id": "fl8oqaf",
            "parent_id": "t3_fn7n12",
            "score": 3,
            "created_utc": 1584928626.0,
            "replies": [
                {
                    "body": "Not sure people will come in with lower amounts if they arent working.",
                    "author": "dade_murphy1",
                    "id": "fl9arwo",
                    "parent_id": "t1_fl8oqaf",
                    "score": 2,
                    "created_utc": 1584947388.0,
                    "replies": []
                },
                {
                    "body": "But it's the law of Supply and demand. That's just the way things work.\n\nIf they don't lower their price, SDs will move on to the next one.\n\nThey might not even be able to find anyone if they keep their old price. What then?",
                    "author": "TonyMarcaroni",
                    "id": "fl93wfl",
                    "parent_id": "t1_fl8oqaf",
                    "score": 1,
                    "created_utc": 1584940189.0,
                    "replies": [
                        {
                            "body": "Sad but yes that true but most the girls I know are women and don’t think they would reduce to half price and I hope they can see through the prosers",
                            "author": "DiligentHall5",
                            "id": "fl942c5",
                            "parent_id": "t1_fl93wfl",
                            "score": 3,
                            "created_utc": 1584940340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The economic damage has already been done by the under preparedness of the world at large. Things will not bounce back quickly. \n\nSadly, the world did not need to shut down. Rarely do we have the luxury of knowing so clearly who is at risk from a disease, we could have strategically isolated those populations without shutting down the economy and trying to frighten gen Z into staying inside when they have a near 0% chance of mortality and are exactly who should be exposed to the illness now to develop immunity. They will be angry, and justifiably so, when they realize they are the ones paying the greatest price for all this insane over-reaction.",
            "author": "doctorlw",
            "id": "fl8u8gz",
            "parent_id": "t3_fn7n12",
            "score": 3,
            "created_utc": 1584932436.0,
            "replies": [
                {
                    "body": "You are on point. We live in a gerontocracy where old people make decisions that benefit themselves, first and foremost. We could have managed this crisis by forcibly sequestering at risk individuals and we chose not to.",
                    "author": "captcreamfiller",
                    "id": "flaik2k",
                    "parent_id": "t1_fl8u8gz",
                    "score": 1,
                    "created_utc": 1584984581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I refused to do it and told him no. I told him good bye and told him i am not going to be scammed by him at all",
            "author": "ShariD1978",
            "id": "fl8c43z",
            "parent_id": "t3_fn7n12",
            "score": 2,
            "created_utc": 1584920326.0,
            "replies": [
                {
                    "body": "Well I am gone from home 20 days home 10 and in my industry is will slow but doubt the impact will really affect me as for work. \nWith that being said I offered her my place instead of allowance but everything is there and nothing needed. Still get the perks being she do t have a regular job. Plus now I have a house sitter.",
                    "author": "DiligentHall5",
                    "id": "fl8pnox",
                    "parent_id": "t1_fl8c43z",
                    "score": 1,
                    "created_utc": 1584929244.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A reminder to be grateful for any existing and happy/healthy SRs we may have!",
            "author": "ilovecookies86",
            "id": "fl9ufhe",
            "parent_id": "t3_fn7n12",
            "score": 1,
            "created_utc": 1584969563.0,
            "replies": [
                {
                    "body": "and if anyone wants a little bit of nostalgia, Roddy McDowall's home movies from the 60s in Malibu are a temporary mental escape and a reminder of what life WILL be like again: [https://www.dailymotion.com/video/xkvcaq](https://www.dailymotion.com/video/xkvcaq)",
                    "author": "ilovecookies86",
                    "id": "fl9uhjn",
                    "parent_id": "t1_fl9ufhe",
                    "score": 1,
                    "created_utc": 1584969607.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The stock market plunge and unemployment rise were caused by different things than during the depression.  In some ways were more vulnerable but also more capable.  Either way it's not going to be good.",
            "author": "rjjr1963",
            "id": "flbqsc8",
            "parent_id": "t3_fn7n12",
            "score": 1,
            "created_utc": 1585010491.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fl8dt9f",
            "parent_id": "t3_fn7n12",
            "score": -2,
            "created_utc": 1584921408.0,
            "replies": [
                {
                    "body": "Blah blah blah eat my shorts.",
                    "author": "DevinMills93",
                    "id": "fl8mgn3",
                    "parent_id": "t1_fl8dt9f",
                    "score": 9,
                    "created_utc": 1584927102.0,
                    "replies": [
                        {
                            "body": "Lmao",
                            "author": "DiligentHall5",
                            "id": "fl8pe7c",
                            "parent_id": "t1_fl8mgn3",
                            "score": 6,
                            "created_utc": 1584929065.0,
                            "replies": []
                        },
                        {
                            "body": "You might be eating your own shorts.",
                            "author": null,
                            "id": "fl9wjrt",
                            "parent_id": "t1_fl8mgn3",
                            "score": 0,
                            "created_utc": 1584971164.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a SD tell me that he can not get to his account and asked me to send him mone. I told him i can not do that at all because i know better then to do that he has never gave me any money i have only talked to him that is all. I am staying safe with those wanting me to send them money",
            "author": "ShariD1978",
            "id": "fl87eys",
            "parent_id": "t3_fn7n12",
            "score": -3,
            "created_utc": 1584917448.0,
            "replies": [
                {
                    "body": "An alleged SD asking you to send him money? Uh, no.",
                    "author": "BinghamtonSD",
                    "id": "fl8af60",
                    "parent_id": "t1_fl87eys",
                    "score": 10,
                    "created_utc": 1584919279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl84uxc",
            "parent_id": "t1_fl81asu",
            "score": 6,
            "created_utc": 1584915911.0,
            "replies": [
                {
                    "body": "Sugar has lasted for more than 2,000 years.  Evolution will occur but not extermination .",
                    "author": "pinotandsugar",
                    "id": "fl8ven4",
                    "parent_id": "t1_fl84uxc",
                    "score": 16,
                    "created_utc": 1584933298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Predators?",
            "author": "redditisrandom",
            "id": "fl81m8w",
            "parent_id": "t1_fl81asu",
            "score": 2,
            "created_utc": 1584913988.0,
            "replies": [
                {
                    "body": "\"SD\"s offering money and taking advantage of SBs, or \"SB\"s rinsing/stealing from SDs.",
                    "author": "SD22112211",
                    "id": "fl84zjz",
                    "parent_id": "t1_fl81m8w",
                    "score": 18,
                    "created_utc": 1584915987.0,
                    "replies": [
                        {
                            "body": "That just recently happened to me. Taken advantage of and raped in the process. It was awful. Totally out of the bowl since then",
                            "author": null,
                            "id": "fl8insw",
                            "parent_id": "t1_fl84zjz",
                            "score": 20,
                            "created_utc": 1584924557.0,
                            "replies": [
                                {
                                    "body": "I hope you get the care and support you need 💜",
                                    "author": "druggiethrowaway4206",
                                    "id": "fl8kew1",
                                    "parent_id": "t1_fl8insw",
                                    "score": 18,
                                    "created_utc": 1584925732.0,
                                    "replies": [
                                        {
                                            "body": "I did but don’t go to the ER for PEP because they don’t do anything for you. \nI’ve gone into camming and absolutely love it",
                                            "author": null,
                                            "id": "fl8owq7",
                                            "parent_id": "t1_fl8kew1",
                                            "score": 9,
                                            "created_utc": 1584928747.0,
                                            "replies": [
                                                {
                                                    "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
                                                    "author": "highfructoseSD",
                                                    "id": "fl8pzma",
                                                    "parent_id": "t1_fl8owq7",
                                                    "score": 5,
                                                    "created_utc": 1584929469.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                                                            "author": "lofibunny",
                                                            "id": "fl8qppt",
                                                            "parent_id": "t1_fl8pzma",
                                                            "score": 5,
                                                            "created_utc": 1584929967.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Im so sorry.",
                                    "author": "dade_murphy1",
                                    "id": "fl8wakx",
                                    "parent_id": "t1_fl8insw",
                                    "score": 3,
                                    "created_utc": 1584933946.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I figured, just clarifying",
                            "author": "redditisrandom",
                            "id": "fl85313",
                            "parent_id": "t1_fl84zjz",
                            "score": 1,
                            "created_utc": 1584916045.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As in specifically the predator, that one ugly looking mother fucker!",
                    "author": "BigBearSD",
                    "id": "fl9fv5n",
                    "parent_id": "t1_fl81m8w",
                    "score": 1,
                    "created_utc": 1584953815.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My observations:\n\n - One on one meetings are well within most lockdown guidelines.  \n - Public Meet & Greets, dining out, movies and clubs, etc are a problem since most options are closed in bigger cities. \n - Many college SBs have had to leave their campuses and take online classes.  Most have returned home and have less flexibility to meet while home with Mom & Dad. \n - SBs with children will have child care issues that limit their availability. \n - Many SBs work retail, restaurant or hospitality jobs and are out of work and in greater need of financial support.\n - Many SDs have seen large impacts to their work, income and wealth impacting their ability to provide an allowance. \n - Many SDs may be working from home and have less availability if they are married or otherwise attached. \n - Many SDs are older, have health issues and may fall into high risk categories.   As a result they are less willing to meet. \n\nI'm a single man in my mid 50s, still in very good health, live alone and mostly insulated from the economic impact of the pandemic.   SBs seem to be very willing to go on lockdown together.  It's a great way to ride through a quarantine.",
            "author": "willfromvb",
            "id": "fl9k9ou",
            "parent_id": "t1_fl81asu",
            "score": 4,
            "created_utc": 1584959507.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fl86n64",
            "parent_id": "t1_fl864ys",
            "score": 7,
            "created_utc": 1584916980.0,
            "replies": [
                {
                    "body": ">Literally no one has any idea how or when this thing \"ends\" and even what the \"end\" looks like. \n\nChina is already reopenings schools and taking down temporal hospitals.\n\nThey are also massively expanding foreign aid to deal with the virus.\n\nIt seems like they are past the peak and getting back to normal everyday.",
                    "author": null,
                    "id": "fl91qbp",
                    "parent_id": "t1_fl86n64",
                    "score": 0,
                    "created_utc": 1584938265.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fl91uu8",
                            "parent_id": "t1_fl91qbp",
                            "score": 8,
                            "created_utc": 1584938370.0,
                            "replies": [
                                {
                                    "body": ">We only know what China wants us to know \n\nDidn't you see the whistleblowers? The thousands of vids on Twitter? (Which supposedly doesn't exist in China).\n\nThey couldn't control the spread of information and they won't be able to if thousands are still dying everyday.\n\nAnd this virus has even reached high ranking communist party members and their families, they can't just dissapear those people.",
                                    "author": null,
                                    "id": "fl926xo",
                                    "parent_id": "t1_fl91uu8",
                                    "score": 2,
                                    "created_utc": 1584938654.0,
                                    "replies": [
                                        {
                                            "body": "Is this what youre referring to? [https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower](https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower)",
                                            "author": "ilovecookies86",
                                            "id": "fl9uq9i",
                                            "parent_id": "t1_fl926xo",
                                            "score": 2,
                                            "created_utc": 1584969793.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fl92api",
                                            "parent_id": "t1_fl926xo",
                                            "score": 1,
                                            "created_utc": 1584938745.0,
                                            "replies": [
                                                {
                                                    "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
                                                    "author": "highjinx411",
                                                    "id": "fl953w2",
                                                    "parent_id": "t1_fl92api",
                                                    "score": 2,
                                                    "created_utc": 1584941317.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "China shows the world only what they want us to see and believe. \n\nPut little value on their figures.\n\nThis is the same country that told the world that there was no covid-19 epidemic. Their word means nothing.",
                            "author": "TonyMarcaroni",
                            "id": "fl93dxt",
                            "parent_id": "t1_fl91qbp",
                            "score": 0,
                            "created_utc": 1584939716.0,
                            "replies": [
                                {
                                    "body": "Agreed. The looming question though is, what is the state of the virus there? They’re an example of what might happen here.",
                                    "author": "why_so_sexy_",
                                    "id": "flago37",
                                    "parent_id": "t1_fl93dxt",
                                    "score": 2,
                                    "created_utc": 1584983503.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It only took 8 years to recover and your right it was WWII that pulled us out of the depression. We can't borrow any money if no one buys our tbills",
            "author": "youngerwomanlove",
            "id": "fl89ul8",
            "parent_id": "t1_fl864ys",
            "score": 3,
            "created_utc": 1584918932.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fl8mo28",
                    "parent_id": "t1_fl89ul8",
                    "score": 2,
                    "created_utc": 1584927241.0,
                    "replies": [
                        {
                            "body": "Interesting. Wasn't this same industry big during the years 2009-2012 (approximately)? \"Don't put your money in the US stock market, it will never recover / the recovery that's occurred to date is fake and the market will soon turn down again.\"",
                            "author": "highfructoseSD",
                            "id": "fl8qe20",
                            "parent_id": "t1_fl8mo28",
                            "score": 1,
                            "created_utc": 1584929744.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Or we could do what Germany did to get out of the depression (and versailles treaty)... elect someone like Hitler, ramp up military spending, say fuck it to all of our foreign debt and obligations (imho we should do that with China since they essentially caused all of this), start persecuting some great \"other\" and start annexing nearby places, then start a world war... i am being facetious, but we (the US) did not get hit as badly by the depression as some did (Germany and the Soviet Union being extreme examples). \n\nI mean in the Soviet Union you had famine, Stalin solidifying his control and centralization of the USSR,  famine and purges killing tens of millions of people during the height of the world wide depression.\n\nWorld War II didnt just get the USA out of the depression, but got the world out of a depression. It only took the largest and bloodiest war in all of human history to do that...\n\nI hope it wont take WWIII for us to turn a corner. \n\nBut again back to my first point Nazi Germany ignored their WWI debt bills and managed to do just fine, until you know Poland....",
                    "author": "BigBearSD",
                    "id": "fl9gkq1",
                    "parent_id": "t1_fl89ul8",
                    "score": 2,
                    "created_utc": 1584954752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah the Great Depression started to wind down as we inched closer to war. Also, some years were worse than others. Some countries had it far worse than others (hit USA pretty bad, but in places like say Germany it hit them so hard the Nazis came to power...). While this Corona Virus stuff is bad, in a historical context things can get a shit ton worse. Question is will we get to that point, or not.",
            "author": "BigBearSD",
            "id": "fl9g2lh",
            "parent_id": "t1_fl864ys",
            "score": 2,
            "created_utc": 1584954085.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl8r9l5",
            "parent_id": "t1_fl864ys",
            "score": 2,
            "created_utc": 1584930347.0,
            "replies": [
                {
                    "body": "I want one of them to teach me how all this crap works. I feel like an idiot lol.",
                    "author": "FickleImagination8",
                    "id": "fl8z1kq",
                    "parent_id": "t1_fl8r9l5",
                    "score": 1,
                    "created_utc": 1584936049.0,
                    "replies": []
                },
                {
                    "body": "I'm so bored I'm half considering suggesting a Zoom SLF happy hour where we all drink wine and say hi.",
                    "author": "ilovecookies86",
                    "id": "fl9ut9i",
                    "parent_id": "t1_fl8r9l5",
                    "score": 1,
                    "created_utc": 1584969858.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be fair, a few weeks ago most news (in the States) where either down playing this or ignoring it. While social media (of which reddit is one type) was sharing the news from around the world that was much more accurate than what came from traditional media on CORVID19.",
            "author": "SD22112211",
            "id": "fl84wcl",
            "parent_id": "t1_fl82rz0",
            "score": 20,
            "created_utc": 1584915935.0,
            "replies": [
                {
                    "body": "You mean Trump was down playing it and only recently has started taking it seriously. Most legitimate news outlets have been sounding the alarm for over a month.",
                    "author": "willfromvb",
                    "id": "fl86mht",
                    "parent_id": "t1_fl84wcl",
                    "score": 16,
                    "created_utc": 1584916969.0,
                    "replies": [
                        {
                            "body": "Not really. (If we are talking NBC/ABC/CNN/etc.) It wasn't until a month ago that it started to become a big thing. Really until after Super Tuesday on March 3rd. Until that point the race for the Dem nomination was the main talking point, and COVID would be regulated to the C block on most news (if talked about at all). Hell when CPAC happened (Feb 26-29th) a few people they brought in there had it (and was known) but they didn't even bother to tell their guests until weeks later. It really has not been a major news outlet story until recently. While Weibo/twitter/reddit/etc. where talking about it as a major (globally) issue back in December.",
                            "author": "SD22112211",
                            "id": "fl879ei",
                            "parent_id": "t1_fl86mht",
                            "score": 8,
                            "created_utc": 1584917353.0,
                            "replies": []
                        },
                        {
                            "body": "I recall a lot of people on this forum downplaying it and arguing that it won't have an effect.",
                            "author": "UseTheForceRey",
                            "id": "fl8bp77",
                            "parent_id": "t1_fl86mht",
                            "score": 8,
                            "created_utc": 1584920065.0,
                            "replies": [
                                {
                                    "body": "I still dont see this forum as a good source for Coronavirus information",
                                    "author": "willfromvb",
                                    "id": "fl8ekye",
                                    "parent_id": "t1_fl8bp77",
                                    "score": 10,
                                    "created_utc": 1584921900.0,
                                    "replies": [
                                        {
                                            "body": "Certainly true.",
                                            "author": "UseTheForceRey",
                                            "id": "fl8fces",
                                            "parent_id": "t1_fl8ekye",
                                            "score": 3,
                                            "created_utc": 1584922391.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Trump was saying it was a hoax and several people had it and it be down to 0 soon in US a couple weeks ago anyone can watch the videos. And also the warm weather would make it go away.",
                                    "author": "Davge107",
                                    "id": "fl9af5n",
                                    "parent_id": "t1_fl8bp77",
                                    "score": 1,
                                    "created_utc": 1584946966.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me as I just grabbed a glass from my fridge haha!",
            "author": "loungegirl",
            "id": "fl8shwh",
            "parent_id": "t1_fl8hci0",
            "score": 1,
            "created_utc": 1584931210.0,
            "replies": [
                {
                    "body": "Me as I just drank an entire bottle tonight",
                    "author": "Savvvyg1",
                    "id": "fl8wdc1",
                    "parent_id": "t1_fl8shwh",
                    "score": 1,
                    "created_utc": 1584934004.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My company is involved in oil field services and with the price of oil falling through the basement I can tell you it will have a huge impact on the Texas bowl.\n\nEven field workers made 150-200k a year in 2019.\n\nMost of those people were furloughed this month.\n\nBoth sides need to stay safe and avoid quick money scams that are too good to be true. When people are vulnerable they get preyed upon.",
            "author": "KnocDown",
            "id": "fl8ixm0",
            "parent_id": "t1_fl8271z",
            "score": 15,
            "created_utc": 1584924739.0,
            "replies": [
                {
                    "body": "PEOPLE for the love of god please stay away from MLMs",
                    "author": "sugarprincessp",
                    "id": "fl8qyhi",
                    "parent_id": "t1_fl8ixm0",
                    "score": 5,
                    "created_utc": 1584930132.0,
                    "replies": [
                        {
                            "body": "What?! Tea tree oil doesn't kill covid 19 when defused?! I've been lied to!",
                            "author": "KnocDown",
                            "id": "fl8teac",
                            "parent_id": "t1_fl8qyhi",
                            "score": 7,
                            "created_utc": 1584931840.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve already started to hear the “a lot of girls are desperate right now, so you’re going to have to adjust” narrative from friends, and from a guy who wants me to do stuff with him for free lol.\n\nBut so far it’s been the opposite for me, everyone is bored, scared and horny and I’ve been asked to go on dates by old POTs / SDs daily, with the same or even better ppm due to the situation (I declined all except 1 so far though).",
            "author": null,
            "id": "fl97imj",
            "parent_id": "t1_fl8271z",
            "score": 2,
            "created_utc": 1584943769.0,
            "replies": []
        },
        {
            "body": "This is contrary to what most experts are saying.\n\nThere will be little economic activity for months. And even when things start up again, millions will be unemployed and those that aren't will not be in a hurry to spend.\n\nI really wish this was just a quick downturn but that is extremely unlikely. We don't even know when things will be back to normal. It could be 4 weeks, it could be 4 months or it could be longer.\n\nEven with govenrnent fiscal help, it will probably just help huge corporations survive. Small business owners, which represent a large portion of the economy, will be decemated and this will have a domino effect on eveything.",
            "author": "TonyMarcaroni",
            "id": "fl931ab",
            "parent_id": "t1_fl86qd3",
            "score": 3,
            "created_utc": 1584939398.0,
            "replies": [
                {
                    "body": "I'm not denying anything what you are saying.\n\nBut in 2020 we have found ways to  boost the economy operating under capacity. (Thanks to Keynes, Bernanke and the modern federal reserve way of thinking). \n\nThat's why there is nary a pip this time when Fed was ready to print money or the treasury was ready to stimulate with $1T or $2T deficit spending",
                    "author": "xanfiles",
                    "id": "fl99k70",
                    "parent_id": "t1_fl931ab",
                    "score": 1,
                    "created_utc": 1584945983.0,
                    "replies": []
                },
                {
                    "body": "Small businesses are a majority of businesses (99%), but they represent less than half of GDP (43%) and only just over half of jobs (64%). It will be bad and you’re right that it’ll be large businesses best positioned to survive, but it’s also not black and white. \n\nAlso remember that “small business” doesn’t just mean Joe’s Bar. It also includes plumbers, McDonald’s franchisees, and your local CPA, none of which are being destroyed by this crisis...yet.",
                    "author": "captcreamfiller",
                    "id": "flajkc5",
                    "parent_id": "t1_fl931ab",
                    "score": 1,
                    "created_utc": 1584985151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know what surprised me, some people here saying this will be temporary and things will be back to normal soon enough.\n\n\"loans will fix everything\". \n\nI'm not sure if they're in denial or they really believe this. \n\nUnfortunately, We're in this terrible mess for the long haul.",
            "author": "TonyMarcaroni",
            "id": "fl93qrx",
            "parent_id": "t1_fl91its",
            "score": 4,
            "created_utc": 1584940044.0,
            "replies": []
        },
        {
            "body": "I agree",
            "author": "BaddBunneyy",
            "id": "fl8gmbp",
            "parent_id": "t1_fl8cscr",
            "score": 5,
            "created_utc": 1584923225.0,
            "replies": []
        },
        {
            "body": "Oh my gosh, im so sorry. My kiddo is pretty young but ive been open and positive and am giving him enough information to feel informed but not enough to overwhelm him. We are doing a lot of cleaning and gardening and animal tending. Basic life skill stuff. Our house feels safe and calm and thats the best i can do for now.",
            "author": "OliviaWildflower2332",
            "id": "fl8likc",
            "parent_id": "t1_fl8cscr",
            "score": 4,
            "created_utc": 1584926473.0,
            "replies": [
                {
                    "body": "Absolutely.  A large part of how the kids feel will be based on how their parents/guardians react to all this.  Kids can be amazingly resilient to changes in circumstances.",
                    "author": "LemonadeIncome",
                    "id": "fl8mhd9",
                    "parent_id": "t1_fl8likc",
                    "score": 5,
                    "created_utc": 1584927115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Before anyone says anything, I am able to support myself on my own.  I am going to miss the perks and fun.",
            "author": "Iam_nanette_manoir",
            "id": "fl8n0bz",
            "parent_id": "t1_fl8ms3a",
            "score": 7,
            "created_utc": 1584927471.0,
            "replies": [
                {
                    "body": "I'm sorry to hear this <3",
                    "author": "awaiting_sugar",
                    "id": "flabhj2",
                    "parent_id": "t1_fl8n0bz",
                    "score": 1,
                    "created_utc": 1584980571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🥺...😭...Sending hugs. 💕",
            "author": "EmmaLouzer",
            "id": "fl8n4jc",
            "parent_id": "t1_fl8ms3a",
            "score": 2,
            "created_utc": 1584927551.0,
            "replies": []
        },
        {
            "body": "Banks will feel the pinch once loans go bad.",
            "author": null,
            "id": "fl8ljes",
            "parent_id": "t1_fl8hef4",
            "score": 4,
            "created_utc": 1584926488.0,
            "replies": [
                {
                    "body": "The average LTV in the US on residential loans is under 60%.  Banks are praying that happens",
                    "author": "LotBuilder",
                    "id": "fl8mhdf",
                    "parent_id": "t1_fl8ljes",
                    "score": 1,
                    "created_utc": 1584927115.0,
                    "replies": [
                        {
                            "body": "Corporate debt is likely the bigger problem this time! Cos have raised “cheap debt” to buyback stock and enrich execs. Won’t end well in these circumstances!",
                            "author": null,
                            "id": "fl8mogo",
                            "parent_id": "t1_fl8mhdf",
                            "score": 3,
                            "created_utc": 1584927248.0,
                            "replies": [
                                {
                                    "body": "People will be pulling the equity out of their homes to get them by. Banks have to worry about commercial properties, small businesses going out of business and junk bonds. There was no one to buy mortgaged back securities on 03/13/2020. That is why the government started buying them.",
                                    "author": "youngerwomanlove",
                                    "id": "fl8rape",
                                    "parent_id": "t1_fl8mogo",
                                    "score": 1,
                                    "created_utc": 1584930368.0,
                                    "replies": [
                                        {
                                            "body": "Exactly my point. The contagion will be heavy. Once defaults start it’s hard to slow them. Plenty of people will file for bankruptcy in coming weeks.",
                                            "author": null,
                                            "id": "fl8yudr",
                                            "parent_id": "t1_fl8rape",
                                            "score": 3,
                                            "created_utc": 1584935897.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": " I hope you are like a very rare case cause we don’t want online / platonic sugar babies to thrive ...",
            "author": null,
            "id": "fl9727p",
            "parent_id": "t1_fl8m8vf",
            "score": 0,
            "created_utc": 1584943292.0,
            "replies": []
        },
        {
            "body": "Not sure people will come in with lower amounts if they arent working.",
            "author": "dade_murphy1",
            "id": "fl9arwo",
            "parent_id": "t1_fl8oqaf",
            "score": 2,
            "created_utc": 1584947388.0,
            "replies": []
        },
        {
            "body": "But it's the law of Supply and demand. That's just the way things work.\n\nIf they don't lower their price, SDs will move on to the next one.\n\nThey might not even be able to find anyone if they keep their old price. What then?",
            "author": "TonyMarcaroni",
            "id": "fl93wfl",
            "parent_id": "t1_fl8oqaf",
            "score": 1,
            "created_utc": 1584940189.0,
            "replies": [
                {
                    "body": "Sad but yes that true but most the girls I know are women and don’t think they would reduce to half price and I hope they can see through the prosers",
                    "author": "DiligentHall5",
                    "id": "fl942c5",
                    "parent_id": "t1_fl93wfl",
                    "score": 3,
                    "created_utc": 1584940340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are on point. We live in a gerontocracy where old people make decisions that benefit themselves, first and foremost. We could have managed this crisis by forcibly sequestering at risk individuals and we chose not to.",
            "author": "captcreamfiller",
            "id": "flaik2k",
            "parent_id": "t1_fl8u8gz",
            "score": 1,
            "created_utc": 1584984581.0,
            "replies": []
        },
        {
            "body": "Well I am gone from home 20 days home 10 and in my industry is will slow but doubt the impact will really affect me as for work. \nWith that being said I offered her my place instead of allowance but everything is there and nothing needed. Still get the perks being she do t have a regular job. Plus now I have a house sitter.",
            "author": "DiligentHall5",
            "id": "fl8pnox",
            "parent_id": "t1_fl8c43z",
            "score": 1,
            "created_utc": 1584929244.0,
            "replies": []
        },
        {
            "body": "and if anyone wants a little bit of nostalgia, Roddy McDowall's home movies from the 60s in Malibu are a temporary mental escape and a reminder of what life WILL be like again: [https://www.dailymotion.com/video/xkvcaq](https://www.dailymotion.com/video/xkvcaq)",
            "author": "ilovecookies86",
            "id": "fl9uhjn",
            "parent_id": "t1_fl9ufhe",
            "score": 1,
            "created_utc": 1584969607.0,
            "replies": []
        },
        {
            "body": "Blah blah blah eat my shorts.",
            "author": "DevinMills93",
            "id": "fl8mgn3",
            "parent_id": "t1_fl8dt9f",
            "score": 9,
            "created_utc": 1584927102.0,
            "replies": [
                {
                    "body": "Lmao",
                    "author": "DiligentHall5",
                    "id": "fl8pe7c",
                    "parent_id": "t1_fl8mgn3",
                    "score": 6,
                    "created_utc": 1584929065.0,
                    "replies": []
                },
                {
                    "body": "You might be eating your own shorts.",
                    "author": null,
                    "id": "fl9wjrt",
                    "parent_id": "t1_fl8mgn3",
                    "score": 0,
                    "created_utc": 1584971164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An alleged SD asking you to send him money? Uh, no.",
            "author": "BinghamtonSD",
            "id": "fl8af60",
            "parent_id": "t1_fl87eys",
            "score": 10,
            "created_utc": 1584919279.0,
            "replies": []
        },
        {
            "body": "Sugar has lasted for more than 2,000 years.  Evolution will occur but not extermination .",
            "author": "pinotandsugar",
            "id": "fl8ven4",
            "parent_id": "t1_fl84uxc",
            "score": 16,
            "created_utc": 1584933298.0,
            "replies": []
        },
        {
            "body": "\"SD\"s offering money and taking advantage of SBs, or \"SB\"s rinsing/stealing from SDs.",
            "author": "SD22112211",
            "id": "fl84zjz",
            "parent_id": "t1_fl81m8w",
            "score": 18,
            "created_utc": 1584915987.0,
            "replies": [
                {
                    "body": "That just recently happened to me. Taken advantage of and raped in the process. It was awful. Totally out of the bowl since then",
                    "author": null,
                    "id": "fl8insw",
                    "parent_id": "t1_fl84zjz",
                    "score": 20,
                    "created_utc": 1584924557.0,
                    "replies": [
                        {
                            "body": "I hope you get the care and support you need 💜",
                            "author": "druggiethrowaway4206",
                            "id": "fl8kew1",
                            "parent_id": "t1_fl8insw",
                            "score": 18,
                            "created_utc": 1584925732.0,
                            "replies": [
                                {
                                    "body": "I did but don’t go to the ER for PEP because they don’t do anything for you. \nI’ve gone into camming and absolutely love it",
                                    "author": null,
                                    "id": "fl8owq7",
                                    "parent_id": "t1_fl8kew1",
                                    "score": 9,
                                    "created_utc": 1584928747.0,
                                    "replies": [
                                        {
                                            "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
                                            "author": "highfructoseSD",
                                            "id": "fl8pzma",
                                            "parent_id": "t1_fl8owq7",
                                            "score": 5,
                                            "created_utc": 1584929469.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                                                    "author": "lofibunny",
                                                    "id": "fl8qppt",
                                                    "parent_id": "t1_fl8pzma",
                                                    "score": 5,
                                                    "created_utc": 1584929967.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Im so sorry.",
                            "author": "dade_murphy1",
                            "id": "fl8wakx",
                            "parent_id": "t1_fl8insw",
                            "score": 3,
                            "created_utc": 1584933946.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I figured, just clarifying",
                    "author": "redditisrandom",
                    "id": "fl85313",
                    "parent_id": "t1_fl84zjz",
                    "score": 1,
                    "created_utc": 1584916045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As in specifically the predator, that one ugly looking mother fucker!",
            "author": "BigBearSD",
            "id": "fl9fv5n",
            "parent_id": "t1_fl81m8w",
            "score": 1,
            "created_utc": 1584953815.0,
            "replies": []
        },
        {
            "body": ">Literally no one has any idea how or when this thing \"ends\" and even what the \"end\" looks like. \n\nChina is already reopenings schools and taking down temporal hospitals.\n\nThey are also massively expanding foreign aid to deal with the virus.\n\nIt seems like they are past the peak and getting back to normal everyday.",
            "author": null,
            "id": "fl91qbp",
            "parent_id": "t1_fl86n64",
            "score": 0,
            "created_utc": 1584938265.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fl91uu8",
                    "parent_id": "t1_fl91qbp",
                    "score": 8,
                    "created_utc": 1584938370.0,
                    "replies": [
                        {
                            "body": ">We only know what China wants us to know \n\nDidn't you see the whistleblowers? The thousands of vids on Twitter? (Which supposedly doesn't exist in China).\n\nThey couldn't control the spread of information and they won't be able to if thousands are still dying everyday.\n\nAnd this virus has even reached high ranking communist party members and their families, they can't just dissapear those people.",
                            "author": null,
                            "id": "fl926xo",
                            "parent_id": "t1_fl91uu8",
                            "score": 2,
                            "created_utc": 1584938654.0,
                            "replies": [
                                {
                                    "body": "Is this what youre referring to? [https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower](https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower)",
                                    "author": "ilovecookies86",
                                    "id": "fl9uq9i",
                                    "parent_id": "t1_fl926xo",
                                    "score": 2,
                                    "created_utc": 1584969793.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fl92api",
                                    "parent_id": "t1_fl926xo",
                                    "score": 1,
                                    "created_utc": 1584938745.0,
                                    "replies": [
                                        {
                                            "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
                                            "author": "highjinx411",
                                            "id": "fl953w2",
                                            "parent_id": "t1_fl92api",
                                            "score": 2,
                                            "created_utc": 1584941317.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "China shows the world only what they want us to see and believe. \n\nPut little value on their figures.\n\nThis is the same country that told the world that there was no covid-19 epidemic. Their word means nothing.",
                    "author": "TonyMarcaroni",
                    "id": "fl93dxt",
                    "parent_id": "t1_fl91qbp",
                    "score": 0,
                    "created_utc": 1584939716.0,
                    "replies": [
                        {
                            "body": "Agreed. The looming question though is, what is the state of the virus there? They’re an example of what might happen here.",
                            "author": "why_so_sexy_",
                            "id": "flago37",
                            "parent_id": "t1_fl93dxt",
                            "score": 2,
                            "created_utc": 1584983503.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fl8mo28",
            "parent_id": "t1_fl89ul8",
            "score": 2,
            "created_utc": 1584927241.0,
            "replies": [
                {
                    "body": "Interesting. Wasn't this same industry big during the years 2009-2012 (approximately)? \"Don't put your money in the US stock market, it will never recover / the recovery that's occurred to date is fake and the market will soon turn down again.\"",
                    "author": "highfructoseSD",
                    "id": "fl8qe20",
                    "parent_id": "t1_fl8mo28",
                    "score": 1,
                    "created_utc": 1584929744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or we could do what Germany did to get out of the depression (and versailles treaty)... elect someone like Hitler, ramp up military spending, say fuck it to all of our foreign debt and obligations (imho we should do that with China since they essentially caused all of this), start persecuting some great \"other\" and start annexing nearby places, then start a world war... i am being facetious, but we (the US) did not get hit as badly by the depression as some did (Germany and the Soviet Union being extreme examples). \n\nI mean in the Soviet Union you had famine, Stalin solidifying his control and centralization of the USSR,  famine and purges killing tens of millions of people during the height of the world wide depression.\n\nWorld War II didnt just get the USA out of the depression, but got the world out of a depression. It only took the largest and bloodiest war in all of human history to do that...\n\nI hope it wont take WWIII for us to turn a corner. \n\nBut again back to my first point Nazi Germany ignored their WWI debt bills and managed to do just fine, until you know Poland....",
            "author": "BigBearSD",
            "id": "fl9gkq1",
            "parent_id": "t1_fl89ul8",
            "score": 2,
            "created_utc": 1584954752.0,
            "replies": []
        },
        {
            "body": "I want one of them to teach me how all this crap works. I feel like an idiot lol.",
            "author": "FickleImagination8",
            "id": "fl8z1kq",
            "parent_id": "t1_fl8r9l5",
            "score": 1,
            "created_utc": 1584936049.0,
            "replies": []
        },
        {
            "body": "I'm so bored I'm half considering suggesting a Zoom SLF happy hour where we all drink wine and say hi.",
            "author": "ilovecookies86",
            "id": "fl9ut9i",
            "parent_id": "t1_fl8r9l5",
            "score": 1,
            "created_utc": 1584969858.0,
            "replies": []
        },
        {
            "body": "You mean Trump was down playing it and only recently has started taking it seriously. Most legitimate news outlets have been sounding the alarm for over a month.",
            "author": "willfromvb",
            "id": "fl86mht",
            "parent_id": "t1_fl84wcl",
            "score": 16,
            "created_utc": 1584916969.0,
            "replies": [
                {
                    "body": "Not really. (If we are talking NBC/ABC/CNN/etc.) It wasn't until a month ago that it started to become a big thing. Really until after Super Tuesday on March 3rd. Until that point the race for the Dem nomination was the main talking point, and COVID would be regulated to the C block on most news (if talked about at all). Hell when CPAC happened (Feb 26-29th) a few people they brought in there had it (and was known) but they didn't even bother to tell their guests until weeks later. It really has not been a major news outlet story until recently. While Weibo/twitter/reddit/etc. where talking about it as a major (globally) issue back in December.",
                    "author": "SD22112211",
                    "id": "fl879ei",
                    "parent_id": "t1_fl86mht",
                    "score": 8,
                    "created_utc": 1584917353.0,
                    "replies": []
                },
                {
                    "body": "I recall a lot of people on this forum downplaying it and arguing that it won't have an effect.",
                    "author": "UseTheForceRey",
                    "id": "fl8bp77",
                    "parent_id": "t1_fl86mht",
                    "score": 8,
                    "created_utc": 1584920065.0,
                    "replies": [
                        {
                            "body": "I still dont see this forum as a good source for Coronavirus information",
                            "author": "willfromvb",
                            "id": "fl8ekye",
                            "parent_id": "t1_fl8bp77",
                            "score": 10,
                            "created_utc": 1584921900.0,
                            "replies": [
                                {
                                    "body": "Certainly true.",
                                    "author": "UseTheForceRey",
                                    "id": "fl8fces",
                                    "parent_id": "t1_fl8ekye",
                                    "score": 3,
                                    "created_utc": 1584922391.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Trump was saying it was a hoax and several people had it and it be down to 0 soon in US a couple weeks ago anyone can watch the videos. And also the warm weather would make it go away.",
                            "author": "Davge107",
                            "id": "fl9af5n",
                            "parent_id": "t1_fl8bp77",
                            "score": 1,
                            "created_utc": 1584946966.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me as I just drank an entire bottle tonight",
            "author": "Savvvyg1",
            "id": "fl8wdc1",
            "parent_id": "t1_fl8shwh",
            "score": 1,
            "created_utc": 1584934004.0,
            "replies": []
        },
        {
            "body": "PEOPLE for the love of god please stay away from MLMs",
            "author": "sugarprincessp",
            "id": "fl8qyhi",
            "parent_id": "t1_fl8ixm0",
            "score": 5,
            "created_utc": 1584930132.0,
            "replies": [
                {
                    "body": "What?! Tea tree oil doesn't kill covid 19 when defused?! I've been lied to!",
                    "author": "KnocDown",
                    "id": "fl8teac",
                    "parent_id": "t1_fl8qyhi",
                    "score": 7,
                    "created_utc": 1584931840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm not denying anything what you are saying.\n\nBut in 2020 we have found ways to  boost the economy operating under capacity. (Thanks to Keynes, Bernanke and the modern federal reserve way of thinking). \n\nThat's why there is nary a pip this time when Fed was ready to print money or the treasury was ready to stimulate with $1T or $2T deficit spending",
            "author": "xanfiles",
            "id": "fl99k70",
            "parent_id": "t1_fl931ab",
            "score": 1,
            "created_utc": 1584945983.0,
            "replies": []
        },
        {
            "body": "Small businesses are a majority of businesses (99%), but they represent less than half of GDP (43%) and only just over half of jobs (64%). It will be bad and you’re right that it’ll be large businesses best positioned to survive, but it’s also not black and white. \n\nAlso remember that “small business” doesn’t just mean Joe’s Bar. It also includes plumbers, McDonald’s franchisees, and your local CPA, none of which are being destroyed by this crisis...yet.",
            "author": "captcreamfiller",
            "id": "flajkc5",
            "parent_id": "t1_fl931ab",
            "score": 1,
            "created_utc": 1584985151.0,
            "replies": []
        },
        {
            "body": "Absolutely.  A large part of how the kids feel will be based on how their parents/guardians react to all this.  Kids can be amazingly resilient to changes in circumstances.",
            "author": "LemonadeIncome",
            "id": "fl8mhd9",
            "parent_id": "t1_fl8likc",
            "score": 5,
            "created_utc": 1584927115.0,
            "replies": []
        },
        {
            "body": "I'm sorry to hear this <3",
            "author": "awaiting_sugar",
            "id": "flabhj2",
            "parent_id": "t1_fl8n0bz",
            "score": 1,
            "created_utc": 1584980571.0,
            "replies": []
        },
        {
            "body": "The average LTV in the US on residential loans is under 60%.  Banks are praying that happens",
            "author": "LotBuilder",
            "id": "fl8mhdf",
            "parent_id": "t1_fl8ljes",
            "score": 1,
            "created_utc": 1584927115.0,
            "replies": [
                {
                    "body": "Corporate debt is likely the bigger problem this time! Cos have raised “cheap debt” to buyback stock and enrich execs. Won’t end well in these circumstances!",
                    "author": null,
                    "id": "fl8mogo",
                    "parent_id": "t1_fl8mhdf",
                    "score": 3,
                    "created_utc": 1584927248.0,
                    "replies": [
                        {
                            "body": "People will be pulling the equity out of their homes to get them by. Banks have to worry about commercial properties, small businesses going out of business and junk bonds. There was no one to buy mortgaged back securities on 03/13/2020. That is why the government started buying them.",
                            "author": "youngerwomanlove",
                            "id": "fl8rape",
                            "parent_id": "t1_fl8mogo",
                            "score": 1,
                            "created_utc": 1584930368.0,
                            "replies": [
                                {
                                    "body": "Exactly my point. The contagion will be heavy. Once defaults start it’s hard to slow them. Plenty of people will file for bankruptcy in coming weeks.",
                                    "author": null,
                                    "id": "fl8yudr",
                                    "parent_id": "t1_fl8rape",
                                    "score": 3,
                                    "created_utc": 1584935897.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sad but yes that true but most the girls I know are women and don’t think they would reduce to half price and I hope they can see through the prosers",
            "author": "DiligentHall5",
            "id": "fl942c5",
            "parent_id": "t1_fl93wfl",
            "score": 3,
            "created_utc": 1584940340.0,
            "replies": []
        },
        {
            "body": "Lmao",
            "author": "DiligentHall5",
            "id": "fl8pe7c",
            "parent_id": "t1_fl8mgn3",
            "score": 6,
            "created_utc": 1584929065.0,
            "replies": []
        },
        {
            "body": "You might be eating your own shorts.",
            "author": null,
            "id": "fl9wjrt",
            "parent_id": "t1_fl8mgn3",
            "score": 0,
            "created_utc": 1584971164.0,
            "replies": []
        },
        {
            "body": "That just recently happened to me. Taken advantage of and raped in the process. It was awful. Totally out of the bowl since then",
            "author": null,
            "id": "fl8insw",
            "parent_id": "t1_fl84zjz",
            "score": 20,
            "created_utc": 1584924557.0,
            "replies": [
                {
                    "body": "I hope you get the care and support you need 💜",
                    "author": "druggiethrowaway4206",
                    "id": "fl8kew1",
                    "parent_id": "t1_fl8insw",
                    "score": 18,
                    "created_utc": 1584925732.0,
                    "replies": [
                        {
                            "body": "I did but don’t go to the ER for PEP because they don’t do anything for you. \nI’ve gone into camming and absolutely love it",
                            "author": null,
                            "id": "fl8owq7",
                            "parent_id": "t1_fl8kew1",
                            "score": 9,
                            "created_utc": 1584928747.0,
                            "replies": [
                                {
                                    "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
                                    "author": "highfructoseSD",
                                    "id": "fl8pzma",
                                    "parent_id": "t1_fl8owq7",
                                    "score": 5,
                                    "created_utc": 1584929469.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                                            "author": "lofibunny",
                                            "id": "fl8qppt",
                                            "parent_id": "t1_fl8pzma",
                                            "score": 5,
                                            "created_utc": 1584929967.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Im so sorry.",
                    "author": "dade_murphy1",
                    "id": "fl8wakx",
                    "parent_id": "t1_fl8insw",
                    "score": 3,
                    "created_utc": 1584933946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I figured, just clarifying",
            "author": "redditisrandom",
            "id": "fl85313",
            "parent_id": "t1_fl84zjz",
            "score": 1,
            "created_utc": 1584916045.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fl91uu8",
            "parent_id": "t1_fl91qbp",
            "score": 8,
            "created_utc": 1584938370.0,
            "replies": [
                {
                    "body": ">We only know what China wants us to know \n\nDidn't you see the whistleblowers? The thousands of vids on Twitter? (Which supposedly doesn't exist in China).\n\nThey couldn't control the spread of information and they won't be able to if thousands are still dying everyday.\n\nAnd this virus has even reached high ranking communist party members and their families, they can't just dissapear those people.",
                    "author": null,
                    "id": "fl926xo",
                    "parent_id": "t1_fl91uu8",
                    "score": 2,
                    "created_utc": 1584938654.0,
                    "replies": [
                        {
                            "body": "Is this what youre referring to? [https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower](https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower)",
                            "author": "ilovecookies86",
                            "id": "fl9uq9i",
                            "parent_id": "t1_fl926xo",
                            "score": 2,
                            "created_utc": 1584969793.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fl92api",
                            "parent_id": "t1_fl926xo",
                            "score": 1,
                            "created_utc": 1584938745.0,
                            "replies": [
                                {
                                    "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
                                    "author": "highjinx411",
                                    "id": "fl953w2",
                                    "parent_id": "t1_fl92api",
                                    "score": 2,
                                    "created_utc": 1584941317.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "China shows the world only what they want us to see and believe. \n\nPut little value on their figures.\n\nThis is the same country that told the world that there was no covid-19 epidemic. Their word means nothing.",
            "author": "TonyMarcaroni",
            "id": "fl93dxt",
            "parent_id": "t1_fl91qbp",
            "score": 0,
            "created_utc": 1584939716.0,
            "replies": [
                {
                    "body": "Agreed. The looming question though is, what is the state of the virus there? They’re an example of what might happen here.",
                    "author": "why_so_sexy_",
                    "id": "flago37",
                    "parent_id": "t1_fl93dxt",
                    "score": 2,
                    "created_utc": 1584983503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting. Wasn't this same industry big during the years 2009-2012 (approximately)? \"Don't put your money in the US stock market, it will never recover / the recovery that's occurred to date is fake and the market will soon turn down again.\"",
            "author": "highfructoseSD",
            "id": "fl8qe20",
            "parent_id": "t1_fl8mo28",
            "score": 1,
            "created_utc": 1584929744.0,
            "replies": []
        },
        {
            "body": "Not really. (If we are talking NBC/ABC/CNN/etc.) It wasn't until a month ago that it started to become a big thing. Really until after Super Tuesday on March 3rd. Until that point the race for the Dem nomination was the main talking point, and COVID would be regulated to the C block on most news (if talked about at all). Hell when CPAC happened (Feb 26-29th) a few people they brought in there had it (and was known) but they didn't even bother to tell their guests until weeks later. It really has not been a major news outlet story until recently. While Weibo/twitter/reddit/etc. where talking about it as a major (globally) issue back in December.",
            "author": "SD22112211",
            "id": "fl879ei",
            "parent_id": "t1_fl86mht",
            "score": 8,
            "created_utc": 1584917353.0,
            "replies": []
        },
        {
            "body": "I recall a lot of people on this forum downplaying it and arguing that it won't have an effect.",
            "author": "UseTheForceRey",
            "id": "fl8bp77",
            "parent_id": "t1_fl86mht",
            "score": 8,
            "created_utc": 1584920065.0,
            "replies": [
                {
                    "body": "I still dont see this forum as a good source for Coronavirus information",
                    "author": "willfromvb",
                    "id": "fl8ekye",
                    "parent_id": "t1_fl8bp77",
                    "score": 10,
                    "created_utc": 1584921900.0,
                    "replies": [
                        {
                            "body": "Certainly true.",
                            "author": "UseTheForceRey",
                            "id": "fl8fces",
                            "parent_id": "t1_fl8ekye",
                            "score": 3,
                            "created_utc": 1584922391.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Trump was saying it was a hoax and several people had it and it be down to 0 soon in US a couple weeks ago anyone can watch the videos. And also the warm weather would make it go away.",
                    "author": "Davge107",
                    "id": "fl9af5n",
                    "parent_id": "t1_fl8bp77",
                    "score": 1,
                    "created_utc": 1584946966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What?! Tea tree oil doesn't kill covid 19 when defused?! I've been lied to!",
            "author": "KnocDown",
            "id": "fl8teac",
            "parent_id": "t1_fl8qyhi",
            "score": 7,
            "created_utc": 1584931840.0,
            "replies": []
        },
        {
            "body": "Corporate debt is likely the bigger problem this time! Cos have raised “cheap debt” to buyback stock and enrich execs. Won’t end well in these circumstances!",
            "author": null,
            "id": "fl8mogo",
            "parent_id": "t1_fl8mhdf",
            "score": 3,
            "created_utc": 1584927248.0,
            "replies": [
                {
                    "body": "People will be pulling the equity out of their homes to get them by. Banks have to worry about commercial properties, small businesses going out of business and junk bonds. There was no one to buy mortgaged back securities on 03/13/2020. That is why the government started buying them.",
                    "author": "youngerwomanlove",
                    "id": "fl8rape",
                    "parent_id": "t1_fl8mogo",
                    "score": 1,
                    "created_utc": 1584930368.0,
                    "replies": [
                        {
                            "body": "Exactly my point. The contagion will be heavy. Once defaults start it’s hard to slow them. Plenty of people will file for bankruptcy in coming weeks.",
                            "author": null,
                            "id": "fl8yudr",
                            "parent_id": "t1_fl8rape",
                            "score": 3,
                            "created_utc": 1584935897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope you get the care and support you need 💜",
            "author": "druggiethrowaway4206",
            "id": "fl8kew1",
            "parent_id": "t1_fl8insw",
            "score": 18,
            "created_utc": 1584925732.0,
            "replies": [
                {
                    "body": "I did but don’t go to the ER for PEP because they don’t do anything for you. \nI’ve gone into camming and absolutely love it",
                    "author": null,
                    "id": "fl8owq7",
                    "parent_id": "t1_fl8kew1",
                    "score": 9,
                    "created_utc": 1584928747.0,
                    "replies": [
                        {
                            "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
                            "author": "highfructoseSD",
                            "id": "fl8pzma",
                            "parent_id": "t1_fl8owq7",
                            "score": 5,
                            "created_utc": 1584929469.0,
                            "replies": [
                                {
                                    "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                                    "author": "lofibunny",
                                    "id": "fl8qppt",
                                    "parent_id": "t1_fl8pzma",
                                    "score": 5,
                                    "created_utc": 1584929967.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im so sorry.",
            "author": "dade_murphy1",
            "id": "fl8wakx",
            "parent_id": "t1_fl8insw",
            "score": 3,
            "created_utc": 1584933946.0,
            "replies": []
        },
        {
            "body": ">We only know what China wants us to know \n\nDidn't you see the whistleblowers? The thousands of vids on Twitter? (Which supposedly doesn't exist in China).\n\nThey couldn't control the spread of information and they won't be able to if thousands are still dying everyday.\n\nAnd this virus has even reached high ranking communist party members and their families, they can't just dissapear those people.",
            "author": null,
            "id": "fl926xo",
            "parent_id": "t1_fl91uu8",
            "score": 2,
            "created_utc": 1584938654.0,
            "replies": [
                {
                    "body": "Is this what youre referring to? [https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower](https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower)",
                    "author": "ilovecookies86",
                    "id": "fl9uq9i",
                    "parent_id": "t1_fl926xo",
                    "score": 2,
                    "created_utc": 1584969793.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fl92api",
                    "parent_id": "t1_fl926xo",
                    "score": 1,
                    "created_utc": 1584938745.0,
                    "replies": [
                        {
                            "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
                            "author": "highjinx411",
                            "id": "fl953w2",
                            "parent_id": "t1_fl92api",
                            "score": 2,
                            "created_utc": 1584941317.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed. The looming question though is, what is the state of the virus there? They’re an example of what might happen here.",
            "author": "why_so_sexy_",
            "id": "flago37",
            "parent_id": "t1_fl93dxt",
            "score": 2,
            "created_utc": 1584983503.0,
            "replies": []
        },
        {
            "body": "I still dont see this forum as a good source for Coronavirus information",
            "author": "willfromvb",
            "id": "fl8ekye",
            "parent_id": "t1_fl8bp77",
            "score": 10,
            "created_utc": 1584921900.0,
            "replies": [
                {
                    "body": "Certainly true.",
                    "author": "UseTheForceRey",
                    "id": "fl8fces",
                    "parent_id": "t1_fl8ekye",
                    "score": 3,
                    "created_utc": 1584922391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Trump was saying it was a hoax and several people had it and it be down to 0 soon in US a couple weeks ago anyone can watch the videos. And also the warm weather would make it go away.",
            "author": "Davge107",
            "id": "fl9af5n",
            "parent_id": "t1_fl8bp77",
            "score": 1,
            "created_utc": 1584946966.0,
            "replies": []
        },
        {
            "body": "People will be pulling the equity out of their homes to get them by. Banks have to worry about commercial properties, small businesses going out of business and junk bonds. There was no one to buy mortgaged back securities on 03/13/2020. That is why the government started buying them.",
            "author": "youngerwomanlove",
            "id": "fl8rape",
            "parent_id": "t1_fl8mogo",
            "score": 1,
            "created_utc": 1584930368.0,
            "replies": [
                {
                    "body": "Exactly my point. The contagion will be heavy. Once defaults start it’s hard to slow them. Plenty of people will file for bankruptcy in coming weeks.",
                    "author": null,
                    "id": "fl8yudr",
                    "parent_id": "t1_fl8rape",
                    "score": 3,
                    "created_utc": 1584935897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did but don’t go to the ER for PEP because they don’t do anything for you. \nI’ve gone into camming and absolutely love it",
            "author": null,
            "id": "fl8owq7",
            "parent_id": "t1_fl8kew1",
            "score": 9,
            "created_utc": 1584928747.0,
            "replies": [
                {
                    "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
                    "author": "highfructoseSD",
                    "id": "fl8pzma",
                    "parent_id": "t1_fl8owq7",
                    "score": 5,
                    "created_utc": 1584929469.0,
                    "replies": [
                        {
                            "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                            "author": "lofibunny",
                            "id": "fl8qppt",
                            "parent_id": "t1_fl8pzma",
                            "score": 5,
                            "created_utc": 1584929967.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is this what youre referring to? [https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower](https://www.npr.org/sections/coronavirus-live-updates/2020/03/19/818295972/chinese-authorities-admit-improper-response-to-coronavirus-whistleblower)",
            "author": "ilovecookies86",
            "id": "fl9uq9i",
            "parent_id": "t1_fl926xo",
            "score": 2,
            "created_utc": 1584969793.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fl92api",
            "parent_id": "t1_fl926xo",
            "score": 1,
            "created_utc": 1584938745.0,
            "replies": [
                {
                    "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
                    "author": "highjinx411",
                    "id": "fl953w2",
                    "parent_id": "t1_fl92api",
                    "score": 2,
                    "created_utc": 1584941317.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Certainly true.",
            "author": "UseTheForceRey",
            "id": "fl8fces",
            "parent_id": "t1_fl8ekye",
            "score": 3,
            "created_utc": 1584922391.0,
            "replies": []
        },
        {
            "body": "Exactly my point. The contagion will be heavy. Once defaults start it’s hard to slow them. Plenty of people will file for bankruptcy in coming weeks.",
            "author": null,
            "id": "fl8yudr",
            "parent_id": "t1_fl8rape",
            "score": 3,
            "created_utc": 1584935897.0,
            "replies": []
        },
        {
            "body": "It's disturbing to think that going into hospitals now is dangerous (because of risk of COVID infection), therefore many people who have legitimate reasons to seek care in the ER will avoid it.",
            "author": "highfructoseSD",
            "id": "fl8pzma",
            "parent_id": "t1_fl8owq7",
            "score": 5,
            "created_utc": 1584929469.0,
            "replies": [
                {
                    "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
                    "author": "lofibunny",
                    "id": "fl8qppt",
                    "parent_id": "t1_fl8pzma",
                    "score": 5,
                    "created_utc": 1584929967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They also have the ability to tell the world whatever they want to tell the world. Lockdown or not. Oh and the US will force people here soon. It’s coming. Laugh now.",
            "author": "highjinx411",
            "id": "fl953w2",
            "parent_id": "t1_fl92api",
            "score": 2,
            "created_utc": 1584941317.0,
            "replies": []
        },
        {
            "body": "Yeah, my dad works at a hospital and he says it’s been quiet. Tbf though a lot of the people who go to the ER don’t actually *need* to, so now that covid is around they just stopped going.",
            "author": "lofibunny",
            "id": "fl8qppt",
            "parent_id": "t1_fl8pzma",
            "score": 5,
            "created_utc": 1584929967.0,
            "replies": []
        }
    ]
}