{
    "title": "You want to meet a whale?",
    "post_id": "t2pa96",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t2pa96/you_want_to_meet_a_whale/",
    "author": null,
    "body": "Freestyle. Most “wealthy” men do not need to pay sites like SA. It’s a waste of money for them (if they even know about SA) let alone an embarrassment. \n\nFind you a young tech guy entrepreneur you can befriend and hang out with. He’s always networking to grow his capital and most often partnering with older more established high net worth business men. When he goes out, go out with him. Look your best—stand out like money. Talk about entrepreneurship, current events, politics, and express wanting to learn more about increasing your capacity. \n\nAfter a while, you will find yourself in business conversations with success sprinkled with some cat and mouse chasing. \n\nWith whales, they don’t “seek” arrangements. They seek beautiful intelligent women who are hungry for success and drive to make a way for themselves. They will provide/sponsor you to help you grow your capacity. They will remove impediments to make your path easier. What they’re doing is investing in you FOR A PURPOSE AND OUTCOME that has nothing to do with accumulation of purses. \n\nSource: My personal experiences with bonafide whales.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t2pa96/you_want_to_meet_a_whale/",
    "score": 243,
    "upvote_ratio": 0.89,
    "created_utc": 1645971846.0,
    "num_comments": 131,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I'm in an arrangement with a whale now that I met through SA. The main thing in this post that I found to be true with this particular whale is the part that they will provide/sponsor you. My SD pretty much made it clear he wants me to start going to college while we're together and he'll take care of me so I can focus on it 100%. This is the first time a SD presented me with that option. I can't speak about where to find whales because finding him was absolute luck and devine timing.",
            "author": null,
            "id": "hyogijn",
            "parent_id": "t3_t2pa96",
            "score": 52,
            "created_utc": 1645989003.0,
            "replies": [
                {
                    "body": "I love it hear it!! High five. 😊",
                    "author": null,
                    "id": "hyp0z6t",
                    "parent_id": "t1_hyogijn",
                    "score": 2,
                    "created_utc": 1645997125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, you certainly can TRY, but success is rare and limited. You should read the stories from girls trying to actually launch businesses in the bay area with great tech possibilities that got chewed up and used for basically nothing, strung along by the idea of getting invested it. They weren't looking for sugar, but they got even less than that after the promises fell through.\n\nNot that I disbelieve that there is absolutely the chance of it happening, just that I don't think there's huge opportunity for it - just a tiny one.",
            "author": "Payingfor",
            "id": "hynlwg5",
            "parent_id": "t3_t2pa96",
            "score": 68,
            "created_utc": 1645977067.0,
            "replies": [
                {
                    "body": "A tiny is more than none. Start small and make iterations of success.\n\nWhen you go in biting off more than you can chew at that time, it’s a possibility you can fail. But it doesn’t mean you can’t get up and start again. This is not a one time let me get rich process. I’m talking about the long haul process that considers where I want to be in my retirement, when I want to retire, how I want to support my grandkids, take care of my parents when they age. All of which is $$$ and not quick scheme money.",
                    "author": null,
                    "id": "hynnuli",
                    "parent_id": "t1_hynlwg5",
                    "score": 4,
                    "created_utc": 1645977864.0,
                    "replies": []
                },
                {
                    "body": "Nothing beats a try but a failure! Go for it! Prove the Cynics wrong",
                    "author": "YakiMe",
                    "id": "hyp6u08",
                    "parent_id": "t1_hynlwg5",
                    "score": 1,
                    "created_utc": 1645999497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been around some extraordinarily wealthy tech people.  Some of my business partners are at $100M+ net worth.  The main guy I know that engaged in this lifestyle indeed did not use SA.  However, I wouldn't say that he was trying to find women who are \"hungry for success,\" in fact I'd say that he purposely shied away from such women after sleeping with them a few times.\n\nGenerally speaking...the women he came across were intentionally hanging around in areas and social circles where they knew they'd meet wealthy men.  His approach was to walk around with a $60K, very flashy watch with lots of diamonds on it.  This got women - at least those who are impressed by such things - to at least listen to what he had to say. He is quite an extrovert, which is why he didn't use sites like SA.  I wouldn't say that he avoided it specifically because he would have been embarrassed by it, though he did have a security clearance because of one of his other businesses, so that might have influenced his decision.\n\nHere are the ones I recall and how they met:\n\n1. He dated a Hooter's waitress, that he met at...Hooter's.  She was probably the most genuine of the bunch.  If she were seeking wealthy men, Hooter's probably wouldn't be the first choice.\n2. He dated 2 real estate agents.  One sold him a house and was constantly working in the circle of wealthy men in their city, and had no qualms about using her sex appeal to move up in the world.  The second one cold-emailed him trying to get him to buy a house, knowing that he lived in a $12M house, and had her professional-but-suggestive picture in the signature of the email.  I got to know her relatively well, and she admitted that she had been cold-emailing wealthy men in the area for months, hoping for either high end home sales or a relationship with a wealthy man - whatever would improve her life.\n3. He dated a woman that was half his age who was a software engineer.  He met her at an industry conference. She once told me that she first noticed his watch.  I don't think she was a gold digger, but she was certainly impressed by the watch and then he had enough game to take it from there.\n4. He dated a waitress from an extremely high end hotel restaurant near his home.  He constantly flirted with her whenever we would go there, and she flirted back.  He eventually offered her a job as a personal assistant, and as a broke college student, she took it.  It wasn't long before he was sleeping with her and paying some bills (he was 46, she was 20).\n5. He dated someone who turned out to be a Las Vegas stripper, who he met at an extremely high end bar in a sleepy but very wealthy city in Southern California.  She was also there intentionally trying to find wealthy men.\n6. He dated (and eventually married) another woman that was half his age (23 at the time) at another industry conference.  I was there and initially flirted with her, then introduced her to him, and she basically ignored me after seeing his watch.  She was 100% seeking the wealthiest man she could find, and slept with him the first night despite the fact that she was married to someone else at the time.  They are still married, however he constantly cheats on her with other women.\n\nSo I wouldn't say that whales are looking for driven women or even those that are that intelligent.  They date and help attractive women that enter their field of vision in one way or another, and because \"normal\" people aren't usually in those areas/social circles, those tend to be women that are there for the specific purpose of finding a wealthy man.\n\nLong story short, if you're looking for a \"whale\"...be hot, young, and flirty and hang out or work in areas where wealthy men are.  Then shoot your shot with as many as you can, and you'll likely wind up in some form of relationship, SR or otherwise, with a whale.",
            "author": "awesomedude2016_2016",
            "id": "hyntduk",
            "parent_id": "t3_t2pa96",
            "score": 66,
            "created_utc": 1645980072.0,
            "replies": [
                {
                    "body": "So he’s married but constantly cheats on her with other women. Doesn’t sound like a satisfying life in the end.",
                    "author": "FigureSorry",
                    "id": "hyokp5l",
                    "parent_id": "t1_hyntduk",
                    "score": 17,
                    "created_utc": 1645990625.0,
                    "replies": [
                        {
                            "body": "Agreed, though they still seem to have a loving marriage.  I suspect she knows, as he spends enough time with other women that it’s not possible that she hasn’t become suspicious - but he claims she has never caught him.  It’s certainly not how I would do things, cheating isn’t how I roll.  I don’t think I am any better at resisting women than he is, but I won’t ever get into a marriage that isn’t open, where she knows everything and is on board with it, and she has the same freedom.",
                            "author": "awesomedude2016_2016",
                            "id": "hypjuae",
                            "parent_id": "t1_hyokp5l",
                            "score": 6,
                            "created_utc": 1646004996.0,
                            "replies": [
                                {
                                    "body": "you ever ask him or he ever say why he decided to get married?",
                                    "author": "sicrm",
                                    "id": "hyqik0u",
                                    "parent_id": "t1_hypjuae",
                                    "score": 2,
                                    "created_utc": 1646020986.0,
                                    "replies": [
                                        {
                                            "body": "He got her pregnant while she was still married to her high school sweetheart.  She had to tell her husband and get a divorce, then marry my business partner.  He is from a culture where having children out of wedlock is a serious problem, and abortion isn't even a discussion.  Even with a 9 figure net worth, his parents are still an enormous part of his life and his entire family would have shamed him for not marrying her.",
                                            "author": "awesomedude2016_2016",
                                            "id": "hyqk2dq",
                                            "parent_id": "t1_hyqik0u",
                                            "score": 5,
                                            "created_utc": 1646021749.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "For you. Some love it. Have your cake and eat it too. Don’t judge.",
                            "author": "MountWestSD",
                            "id": "hyotn5b",
                            "parent_id": "t1_hyokp5l",
                            "score": 0,
                            "created_utc": 1645994187.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ambition, intelligence, etc. are very attractive to women, but it doesn't work the opposite way for men. \n\nEven for men that care about those qualities, they are listed \\*after\\* \"hot\" and \"preferably young\"., (except for the woke reddit rangers of SLF)",
                    "author": null,
                    "id": "hyo09t0",
                    "parent_id": "t1_hyntduk",
                    "score": 18,
                    "created_utc": 1645982755.0,
                    "replies": [
                        {
                            "body": "I think you mean that it doesn’t get our dicks hard.  It draws us to people out of the comfort of being around a peer if that is your relationship template.  It’s not hot, it just feels natural.\n\nWhen I look around at the women my wealthy, attractive friends cheat with, they’re usually not the hottest women they can find.  They are two people who drift together for other reasons and a lot of that is through peer groups - so many are with women vying to be a on a level with them or people in roles that are respected and critical to the non-sexual needs of these whales.",
                            "author": "JDMultralight",
                            "id": "hyqrbl6",
                            "parent_id": "t1_hyo09t0",
                            "score": 5,
                            "created_utc": 1646025663.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agree. I think as women, we over think how to \"keep\" a whale. They are men, after all.",
                    "author": null,
                    "id": "hyof0oj",
                    "parent_id": "t1_hyntduk",
                    "score": 7,
                    "created_utc": 1645988416.0,
                    "replies": []
                },
                {
                    "body": "Man I need a watch. Is my takeaway and a hundred plus million dollars. That’s it!",
                    "author": "highjinx411",
                    "id": "hyokvss",
                    "parent_id": "t1_hyntduk",
                    "score": 7,
                    "created_utc": 1645990696.0,
                    "replies": [
                        {
                            "body": "That watch opened lots of doors for him with women, for sure.  You can’t tattoo your net worth on your forehead, but you can wear part of it on your wrist.  To many women, stuff like this at least gives them a moment of pause, no matter what the age difference or lack of physical attraction.  If you combine it with even a little bit of game, a watch like that will take you far.  But if you only have the watch and not the lifestyle/money to back up the image it creates in the minds of the women that are impressed by it, then a watch like that is a waste of money and time.",
                            "author": "awesomedude2016_2016",
                            "id": "hyonpzg",
                            "parent_id": "t1_hyokvss",
                            "score": 8,
                            "created_utc": 1645991818.0,
                            "replies": [
                                {
                                    "body": "I have a 5k watch I wear and not many people have noticed like I thought. It reflects me about right. More than your average person but not 12 million dollar house rich. Its funny because I tell the SBs I have met to look at the watch and know the brands/values if high end watches.",
                                    "author": "highjinx411",
                                    "id": "hypeh7t",
                                    "parent_id": "t1_hyonpzg",
                                    "score": 2,
                                    "created_utc": 1646002691.0,
                                    "replies": [
                                        {
                                            "body": "He specifically chose this watch for the bling factor. I have seen $300k watches that are much more understated than this one (some Patek’s fall in this category).  \n\nApparently, women like diamonds.  Who knew lol.  Personally, I thought it was a extremely gaudy.",
                                            "author": "awesomedude2016_2016",
                                            "id": "hypfwn1",
                                            "parent_id": "t1_hypeh7t",
                                            "score": 5,
                                            "created_utc": 1646003292.0,
                                            "replies": [
                                                {
                                                    "body": "So its a “diamond” covered watch?",
                                                    "author": "SipCoconuts",
                                                    "id": "hyqmxd4",
                                                    "parent_id": "t1_hypfwn1",
                                                    "score": 0,
                                                    "created_utc": 1646023249.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
                                                            "author": "awesomedude2016_2016",
                                                            "id": "hyqo12e",
                                                            "parent_id": "t1_hyqmxd4",
                                                            "score": 1,
                                                            "created_utc": 1646023836.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wow",
                    "author": "401kisfun",
                    "id": "hynytet",
                    "parent_id": "t1_hyntduk",
                    "score": 3,
                    "created_utc": 1645982198.0,
                    "replies": []
                },
                {
                    "body": "I'm out shopping for a fake 60k watch. eBay here I come!",
                    "author": "JeaneyBowl",
                    "id": "hyorzv5",
                    "parent_id": "t1_hyntduk",
                    "score": 3,
                    "created_utc": 1645993529.0,
                    "replies": []
                },
                {
                    "body": "Where's the gay version of this?",
                    "author": "verelset",
                    "id": "hyowe9n",
                    "parent_id": "t1_hyntduk",
                    "score": 2,
                    "created_utc": 1645995285.0,
                    "replies": []
                },
                {
                    "body": "Can you tell me what industry conferences these are ? And where is it that wealthy men hang out? \nI’m on SA but just don’t want my story of meeting my husband was from the website lol \n\nI wanna meet someone IRL but don’t know where these men hang out or conferences they go to. Appreciate any suggestions 🙏",
                    "author": "natayy",
                    "id": "hyocp1x",
                    "parent_id": "t1_hyntduk",
                    "score": 3,
                    "created_utc": 1645987522.0,
                    "replies": [
                        {
                            "body": "You know I as a lesser SD would love to escort SBs to an industry event to help them try to find a high end SD. I wouldn’t even ask for anything physical the company would be great. It also would boost my status as they would see me with a beautiful woman. Just something to think about as I think other SDs would agree with this.",
                            "author": "highjinx411",
                            "id": "hyombar",
                            "parent_id": "t1_hyocp1x",
                            "score": 10,
                            "created_utc": 1645991262.0,
                            "replies": [
                                {
                                    "body": "That’s actually a really interesting idea.  Having you as a bridge, you would know which guys would actually be worth it for them to talk to. Not all whales are wearing a crazy watch to identify themselves.  “Oh he’s the founder of Xyz, they make millions” etc.",
                                    "author": "awesomedude2016_2016",
                                    "id": "hyoqgbg",
                                    "parent_id": "t1_hyombar",
                                    "score": 7,
                                    "created_utc": 1645992910.0,
                                    "replies": [
                                        {
                                            "body": "you just skipped like 4 levels to the end of the game🤣🤣",
                                            "author": "SweetD79",
                                            "id": "hyq0ebl",
                                            "parent_id": "t1_hyoqgbg",
                                            "score": 2,
                                            "created_utc": 1646012505.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The business we were in together was in the financial services industry (software for banks).  These conferences often had a mix of bank executives, tech executives from the software companies trying to sell to the banks, and lower level sales/tech people actually working the exhibition booths. Both of the women he wound up with from conferences were there working booths for their companies, but the hotel bars at these conferences were also full of women looking to hook up with wealthy men.  So if you’re looking at that angle, look for conferences/conventions in your area that would attract top executives in whatever field.  The smaller and more exclusive the conference, the better.  Go hang at a hotel bar there during prime time for a day or two.\n\nAs far as where they hang out under normal circumstances, think bars and restaurants in very wealthy areas.  Not necessarily tourist zones…like places that someone who lives in the area would go.  If you’re attractive enough, merely being in these places and paying attention to what the men hitting on your are wearing/driving/whatever, you can pretty easily wind up with a rich guy.\n\nFinally, I wouldn’t entirely discount the idea that you will find a whale online, even on SA. Don’t be afraid to reach out to someone you can identify as being very wealthy, whatever the platform.  I know a handful of wealthy men that have dated women they met through LinkedIn.  Just post a picture that is hot but appropriate for the platform (bikini is great on IG, not so much on LinkedIn..etc), and reach out.",
                            "author": "awesomedude2016_2016",
                            "id": "hyombg9",
                            "parent_id": "t1_hyocp1x",
                            "score": 6,
                            "created_utc": 1645991264.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hyox2jz",
                    "parent_id": "t1_hyntduk",
                    "score": 2,
                    "created_utc": 1645995556.0,
                    "replies": [
                        {
                            "body": "I'm not rich at all, but I absolutely love wearing watches and am thinking about saving up for one I really love. I much prefer just looking at my wrist rather than getting my phone up, and it's an everyday accessory that goes with almost any outfit without looking blingy :)",
                            "author": "Rorquall",
                            "id": "hyp7zfz",
                            "parent_id": "t1_hyox2jz",
                            "score": 6,
                            "created_utc": 1645999970.0,
                            "replies": []
                        },
                        {
                            "body": "There's nothing sophisticated or discerning about looking at a phone for the time. Literally everyone does that. Logic does not equal taste, and what makes sense logically does not equate to what differentiates someone with style. When I wear a watch (not often), it's because I enjoy the analog experience. By your explanation women's earrings serve no purpose either, but clearly they do.",
                            "author": "supersalacious",
                            "id": "hyp0p5w",
                            "parent_id": "t1_hyox2jz",
                            "score": 1,
                            "created_utc": 1645997013.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is vanilla dating. And also an ugly way to measure people by their net worth. I wouldn't have generated my high net worth if I treated people this way in business. \n\nAll the whales I met through angel investment groups, business conferences, personal dating events didn't date or marry any women who were into business conversations or entrepreneurship. They want a relief from their daily routines. And they met women through church, friends, dating services, online sites etc. \n\nSA is just a tiny microcosm of this greater world and is being completely normalized for women doing what they've done for generations, date up for men with status.",
            "author": "JohnnyKemmer009",
            "id": "hyo4bnv",
            "parent_id": "t3_t2pa96",
            "score": 44,
            "created_utc": 1645984308.0,
            "replies": [
                {
                    "body": "I respect your perspective but I believe it’s like mine one of many. 🙂 But bringing what has been effective for you to this community it’s what it’s about.\n\nShare your experience…the more the helpful for SBs starting out or in a much different place than you/me/others.",
                    "author": null,
                    "id": "hyo9qfx",
                    "parent_id": "t1_hyo4bnv",
                    "score": 6,
                    "created_utc": 1645986372.0,
                    "replies": []
                },
                {
                    "body": "Yes, I do not know a lot of power couples who imhabit the same professional space besides real estate people.  Usually if the woman is also a killer she is highly successful in another field - doctor, intellectual, artistic.  \n\nThat being said, I generally date women with a hard-core immigrant mentality because that is what I respect most and it balances out the fact that I’m a spacey dreamer who is utterly unable to do the actual hands-on work.",
                    "author": "JDMultralight",
                    "id": "hyqqjby",
                    "parent_id": "t1_hyo4bnv",
                    "score": 2,
                    "created_utc": 1646025218.0,
                    "replies": []
                },
                {
                    "body": "Ambitious men attracted to ambitious women, I find are more likely to support.",
                    "author": "SipCoconuts",
                    "id": "hyqma5v",
                    "parent_id": "t1_hyo4bnv",
                    "score": 1,
                    "created_utc": 1646022909.0,
                    "replies": [
                        {
                            "body": "The difference is that ambitious men are most frequently focused on business and often the bay of sharks.  In contrast the women are more commonly focused on arts, medicine, social activities.",
                            "author": "pinotandsugar",
                            "id": "hyr447b",
                            "parent_id": "t1_hyqma5v",
                            "score": 1,
                            "created_utc": 1646034008.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hyo3ll2",
            "parent_id": "t3_t2pa96",
            "score": 37,
            "created_utc": 1645984036.0,
            "replies": [
                {
                    "body": "Well said, many whales just date vanilla with women born from upper-class families or Ivy league/upper State school educations",
                    "author": "JohnnyKemmer009",
                    "id": "hyoaljq",
                    "parent_id": "t1_hyo3ll2",
                    "score": 13,
                    "created_utc": 1645986709.0,
                    "replies": []
                },
                {
                    "body": "I probably roamed between the sharks and the whales.  The SB's whom I related best to over several decades were those for whom the relationship was about far more than the $ (to achieve worthwhile goals)   and seldom about the Gucci babbles. \n\nThose who wanted the Gucci bag I felt only sorrow for.   There were those who sought  assistance in both economic and spiritual support  to make an exponential advance in both their economic situation and their career path that were irresistible and for whom the allowance was not an expense but rather an investment . \n\nOne completed her BS and went on to her MD and a successful career on the strength of her character and some sugar applied at a critical point in her struggle.  A decade later we still exchange birthday and Christmas greetings/",
                    "author": "pinotandsugar",
                    "id": "hyr3sgz",
                    "parent_id": "t1_hyo3ll2",
                    "score": 2,
                    "created_utc": 1646033773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So this is what SA means when they say “Dating Up”. Sounds nice, but isn’t applicable for everyone’s career paths unfortunately… But if it works for you then go for it.",
            "author": "curly_spice",
            "id": "hynzlx8",
            "parent_id": "t3_t2pa96",
            "score": 9,
            "created_utc": 1645982501.0,
            "replies": [
                {
                    "body": "dating up has nothing to do with career paths. It has to do with a wealth or looks disparity",
                    "author": "NickPfromYuma",
                    "id": "hypjld7",
                    "parent_id": "t1_hynzlx8",
                    "score": 2,
                    "created_utc": 1646004886.0,
                    "replies": [
                        {
                            "body": "I think dating up is about socio-economic status but I havent put much thought into the idea.",
                            "author": "JDMultralight",
                            "id": "hyqqmwu",
                            "parent_id": "t1_hypjld7",
                            "score": 3,
                            "created_utc": 1646025276.0,
                            "replies": [
                                {
                                    "body": "Sure for women it’s dating in another socio-economic status and for the man it’s usually dating up out of his league of attractiveness usually because of a large age gap.\n\nI think what many people fail to realize is that before Seeking existed there were no such thing as sugar relationships. Sure there have been SD for 100 years, but sugar relationships were just vanilla relationships with a large age gap and a major wealth disparity.  A sugar baby was nothing more then a spoiled GF of an older wealthy man no matter if that relationship was committed or casual. They were both dating up.  I’m pretty sure that the modern sugar arrangement created by Seeking is what allowed sugar relationships to become more like sex work rather than a dating relationship. To me, Seeking is moving away from being a sugar arrangement site and more towards the original concept of sugar where it was an actual relationship.",
                                    "author": "NickPfromYuma",
                                    "id": "hyrm4ez",
                                    "parent_id": "t1_hyqqmwu",
                                    "score": 0,
                                    "created_utc": 1646048097.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "ofc.\n\nif you arent in the right social circles it wont matter though.",
            "author": "bookworm010101",
            "id": "hyo7up7",
            "parent_id": "t3_t2pa96",
            "score": 11,
            "created_utc": 1645985645.0,
            "replies": [
                {
                    "body": "Driving…\n\nBut if that’s step one then build it into the plan. I really believe SBs get sugaring for more reasons than acquiring fashion accessories. It may start that way but women nowadays…we’re smart cookies. Especially with the right mentors",
                    "author": null,
                    "id": "hyo92fv",
                    "parent_id": "t1_hyo7up7",
                    "score": 1,
                    "created_utc": 1645986113.0,
                    "replies": [
                        {
                            "body": "no disagreement.",
                            "author": "bookworm010101",
                            "id": "hyo9oyy",
                            "parent_id": "t1_hyo92fv",
                            "score": 1,
                            "created_utc": 1645986356.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like I always say, your network is your net worth\n\nMy \"whale\" is not from SA. Mostly, these guys don't have social media or have little time to work on those things based on my experience.",
            "author": "Creepy-Night936",
            "id": "hyno4x3",
            "parent_id": "t3_t2pa96",
            "score": 12,
            "created_utc": 1645977982.0,
            "replies": [
                {
                    "body": "My network isn’t very good though. I don’t think this is always true. There are guys who have high net worth without a high net work.",
                    "author": "highjinx411",
                    "id": "hypfm01",
                    "parent_id": "t1_hyno4x3",
                    "score": 3,
                    "created_utc": 1646003165.0,
                    "replies": []
                },
                {
                    "body": "Exactly. One day the lightbulb will switch on and a few ladies in here will pivot accordingly.\n\nWhat I don’t want is 3 years from now the same SB is on here ranting about her SD shorted her a couple benes and she’s furious trying to get back at him. \n\nNo evolve. Think bigger, build a long term plan, and get into working that plan. We all will have to face major lifestyle milestones (kids, grandkids, retirement, etc.) so we have to reverse engineer our journey and tailor our activities around where we want to be in the future.",
                    "author": null,
                    "id": "hynpwtg",
                    "parent_id": "t1_hyno4x3",
                    "score": 4,
                    "created_utc": 1645978701.0,
                    "replies": [
                        {
                            "body": "I think you are operating on a different level than most SBs here, and even if you tell them, won’t be able to execute.\n\nDo you see the dangerous positions so many of them put themselves in? They just aren’t able to do it.",
                            "author": "garret6758",
                            "id": "hynwa02",
                            "parent_id": "t1_hynpwtg",
                            "score": 7,
                            "created_utc": 1645981208.0,
                            "replies": [
                                {
                                    "body": "I agree with this. It’s not for all SBs so they could be missing out on an ok guy because they are searching for a whale.",
                                    "author": "highjinx411",
                                    "id": "hypfdta",
                                    "parent_id": "t1_hynwa02",
                                    "score": 2,
                                    "created_utc": 1646003071.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or, instead of doing all that work, you could just snap a few pic of yourself, write a few lines and sift thru the potentials on your SD account.",
            "author": "sortasapien",
            "id": "hynlgnk",
            "parent_id": "t3_t2pa96",
            "score": 6,
            "created_utc": 1645976889.0,
            "replies": [
                {
                    "body": "Boring for a shark like myself 😄. I like the challenge always have.",
                    "author": null,
                    "id": "hyno44q",
                    "parent_id": "t1_hynlgnk",
                    "score": 1,
                    "created_utc": 1645977973.0,
                    "replies": [
                        {
                            "body": "When you live in less popular places like the Midwest, SA can be a godsend.",
                            "author": "FigureSorry",
                            "id": "hyolhmb",
                            "parent_id": "t1_hyno44q",
                            "score": 5,
                            "created_utc": 1645990934.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will concur with this approach. I have many \"young tech guy entrepreneur\" friends in Toronto, Miami and New York City, and I've seen this play out numerous times. Currently, the stereotype is an extremely well put together late 20s lady, fit body, hints at bisexuality, bachelor's degree of some sort, used to work in marketing and now looking for a new roll, and discusses crypto, blockchain, nft, crypto all the time, and always follows  partiers back to some fancy condos for an after party with drinks and coke. Repeat a few times a week.\n\nThere is always a red flag as to how this lady inserted herself into the crew, but eventually the 'whale' falls in love. And now I have to book a trip to Australia for a wedding. (True story)\n\nI will say this is only successful for the ladies that can feign membership of an upper social class.  This lady won't be treated in the same way as the hot bottle service lady or waitress that you meet at the club. \n\nIsn't this just gold digging?",
            "author": "darteduncle",
            "id": "hynhiai",
            "parent_id": "t3_t2pa96",
            "score": 11,
            "created_utc": 1645975225.0,
            "replies": [
                {
                    "body": "All of this minus the coke 😄. I don’t participate, but I’ll be the lifeguard.\n\nIf I were a man looking to expand and be supported would you call me a “gold digger”? \n\nNope. You’re gonna say I’m a mini version of you looking to build my own path.",
                    "author": null,
                    "id": "hynix0v",
                    "parent_id": "t1_hynhiai",
                    "score": 12,
                    "created_utc": 1645975831.0,
                    "replies": []
                },
                {
                    "body": "Gold digging is the literal difference between vanilla and the bowl.",
                    "author": "Pacwing",
                    "id": "hynjwhf",
                    "parent_id": "t1_hynhiai",
                    "score": 4,
                    "created_utc": 1645976244.0,
                    "replies": []
                },
                {
                    "body": "Gold diggers are looking for an easy lifestyle where they get a free ride. Ambitious women working on something for themselves are not gold diggers, but they are highly attractive for that attitude.",
                    "author": "57hz",
                    "id": "hynvxoj",
                    "parent_id": "t1_hynhiai",
                    "score": 4,
                    "created_utc": 1645981071.0,
                    "replies": []
                },
                {
                    "body": "Maybe gold digging isn't the correct term. I'm more thinking of the Heather Graham character from Bowfinger.",
                    "author": "darteduncle",
                    "id": "hyoc644",
                    "parent_id": "t1_hynhiai",
                    "score": 1,
                    "created_utc": 1645987316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Y’all have a good afternoon/morning. I’m literally about to go back to lurking while catching up on the news before I have meet friends for lunch. \n\nThank you for the dialogue and I genuinely hope it’s helpful and motivates a couple SBs on here.",
            "author": null,
            "id": "hynqxj9",
            "parent_id": "t3_t2pa96",
            "score": 9,
            "created_utc": 1645979100.0,
            "replies": []
        },
        {
            "body": "I don't know. I often go to family gatherings and they talk about this topic often. Like how this and that guy having a start up and make millions and a whole host of single women circle around him like sharks.\n\nI think a lot more girls are looking to be rich wives rather than sugar babies with these guys. Or more ambitious ones: mistresses.\n\nIt's a long term effort and you need a lot of commitment to hunt down a guy you want. This sort of thing is not for the women who just want a little help from time to time.",
            "author": "Orange_Overlord",
            "id": "hyo08vt",
            "parent_id": "t3_t2pa96",
            "score": 4,
            "created_utc": 1645982745.0,
            "replies": []
        },
        {
            "body": "I've rarely seen a post with such a large amount of sweeping generalisations with nothing to back it up except for an anecdotal experience.",
            "author": "YlangScent",
            "id": "hyngo68",
            "parent_id": "t3_t2pa96",
            "score": 21,
            "created_utc": 1645974866.0,
            "replies": [
                {
                    "body": "I’m not sure what you’re expecting as evidence. These kinds of successful women are not participating in sugaring surveys. You’re more likely to read about their startup in *Fortune*.",
                    "author": "57hz",
                    "id": "hynvovl",
                    "parent_id": "t1_hyngo68",
                    "score": 7,
                    "created_utc": 1645980976.0,
                    "replies": [
                        {
                            "body": "I'm talking about statements such as whales never messaging a woman or making use of SA or being interested in an arrangement or being attracted to anyone other than someone who reflects their ambition etc etc.\n\nIt's just based on absolutely no substance, no research, no evidence and directly contradicts the experience of many such people.\n\nOn top of that it is completely and totally useless advice. Because even if that scenario was true, the vast majority of currently succesful SBs would be utterly unfit or uninterested in chasing such a relationship.\n\nBut sure, let's pretend that succesful people don't have time for social media or internet platforms while she claims to have found success and is posting here on such a platform.",
                            "author": "YlangScent",
                            "id": "hyoi6dl",
                            "parent_id": "t1_hynvovl",
                            "score": 3,
                            "created_utc": 1645989663.0,
                            "replies": [
                                {
                                    "body": "I agree with this.  Those claims seemed far-fetched. \n\n I go fishing as my hobby/obsession in a place with like 300 species to catch.  There are some very rare and extremely highly valued ones.  Ask the guys at the pier how to catch those and you’ll get incoherent advice because no one person has seen enough of them to know what works.  \n\nThe best advice is not to choose your gear to catch one of those.  If you get one, fantastic - but it’s just bizarre to go out targeting a fish that 999/1000 fishermen will ever get in their lifetime.  Will break your focus on catching good fish you can be proud of.",
                                    "author": "JDMultralight",
                                    "id": "hyqsq5t",
                                    "parent_id": "t1_hyoi6dl",
                                    "score": 3,
                                    "created_utc": 1646026473.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Last time I checked, there is only \\_one\\_  woman on the Forbes list that didn't get her money from a man, either her father, via inheritance, or ex-husband, via divorce.",
                            "author": null,
                            "id": "hyo0qzk",
                            "parent_id": "t1_hynvovl",
                            "score": 4,
                            "created_utc": 1645982938.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It okay. I appreciate your contribution though. No offense taken. 😄",
                    "author": null,
                    "id": "hynjzps",
                    "parent_id": "t1_hyngo68",
                    "score": 1,
                    "created_utc": 1645976281.0,
                    "replies": [
                        {
                            "body": "Since I know you and your posts I'll be less confrontational with my reply. I fully believe you have been as successful as you state in your post, however that has very little to do with any external actions you took, aside from perhaps deciding to focus solely on your career and less on chasing immediate returns for long term investments from non-Seeking SDs, and everything to do with your intelligence and personality.\n\nAll SBs need to be physically attractive, and as the makeup thread the other day taught us some of them spend an inordinate amount of money in order to meet that qualification. However, while your method will indeed get you more in the long run it will fail for nearly all SBs and leave them fucked with little to nothing to show for it. By nearly all I mean 998/1000.\n\nI will agree that trying to find a more traditional arrangement will indeed net bigger returns long term for you, but there is also the risk of getting absolutely nothing. You are able to navigate that, most SBs need the security of a pre-determined allowance or they won't end up with anything at all.",
                            "author": "storm170",
                            "id": "hyo1xox",
                            "parent_id": "t1_hynjzps",
                            "score": 7,
                            "created_utc": 1645983400.0,
                            "replies": [
                                {
                                    "body": "You know I’m non confrontational but love a good banter offline.\n\nI appreciate your post. 🙂",
                                    "author": null,
                                    "id": "hyoaig3",
                                    "parent_id": "t1_hyo1xox",
                                    "score": 1,
                                    "created_utc": 1645986675.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You make good points albeit seeking can be rather efficient at finding specific demographics. A wealthy man knows he is going to be generous anyways so seeking can be efficient EXCEPT the type of dynamic you describe is much more aligned with what is desired. The influx of PPM etc makes what you describe not the norm — anymore. With freestyling things can progress naturally. You will know if you are being taken care of.",
            "author": "daddoms",
            "id": "hynfj14",
            "parent_id": "t3_t2pa96",
            "score": 10,
            "created_utc": 1645974366.0,
            "replies": [
                {
                    "body": "The more a lady becomes focused on building her own business and changing her social circle to the likes of the very business owners she’s trying to mirror, the more she will run into whales/investors.\n\nSome of my friends are like WTF how did you sky rocket so fast! Well I stopped partying with them (waste of time) and started evening networking with the csuite executives, owners, venture capitalists because I want to build my business—blood sweat tears. My extra curricular time was repurposed to ensure I achieve success and low behold I found myself in the middle of wealthy people. My guy friend is a baby whale (low double digit million) younger than me (35) who brings me along because he says I help him close deals. He in turn helps me by putting me in circles I couldn’t otherwise be in. \n\nMen are the infrastructure to our economy. They dominate all four corners. So I had to ditch the girl time and go where the deals are being discussed and I can listen, learn, and apply. No night clubs, no IG/Tiktok BS, etc.",
                    "author": null,
                    "id": "hynhg61",
                    "parent_id": "t1_hynfj14",
                    "score": 16,
                    "created_utc": 1645975200.0,
                    "replies": [
                        {
                            "body": "Well done Miss! From what I have read here you certainly come off as intelligent, analytical, and goal oriented. You also certainly seem to have realized that you get where you want to go you have to make sacrifices in other areas. To me that also indicates you have great self-discipline. Congratulations sincerely.",
                            "author": "puckhead4",
                            "id": "hyoui2e",
                            "parent_id": "t1_hynhg61",
                            "score": 3,
                            "created_utc": 1645994533.0,
                            "replies": []
                        },
                        {
                            "body": "I don’t know if this works as a general technique, because you have to be stylish, smart, and able to impress the boys with your business conversation, but I would agree that this is the best way to attract men with serious money.",
                            "author": "57hz",
                            "id": "hynvb9v",
                            "parent_id": "t1_hynhg61",
                            "score": 5,
                            "created_utc": 1645980828.0,
                            "replies": [
                                {
                                    "body": "This doesn’t work “as a general technique” because the vast majority of potential SBs do not fit anything close to the OP’s profile. That is, they are waaay younger than 35 and not in the midst of creating their own businesses, with attendant need for investment capital. Most are on Seeking because they are 18-26, students and/or working retail (managerial or lower), and simply looking to get rent covered along with some extra spoiling.  Expectations are totally different from OPs.  That said, her message makes sense for those with her own profile and I applaud her drive.",
                                    "author": "jacknjilled",
                                    "id": "hyny4wr",
                                    "parent_id": "t1_hynvb9v",
                                    "score": 8,
                                    "created_utc": 1645981934.0,
                                    "replies": [
                                        {
                                            "body": "I think if you target SBs from East Asia, The Near East or Eastern Europe (Nigeria too) it is pretty likely you will run into one with this mindset.\n\nSugaring is too much of a killer financial deal for ambitious and highly girls to ignore.",
                                            "author": "JDMultralight",
                                            "id": "hyqs08y",
                                            "parent_id": "t1_hyny4wr",
                                            "score": 2,
                                            "created_utc": 1646026057.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well thought out and written. \nApplies to so many things in life….plan a few steps ahead",
            "author": "PB6161",
            "id": "hynbodk",
            "parent_id": "t3_t2pa96",
            "score": 13,
            "created_utc": 1645972610.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": null,
                    "id": "hynbw2z",
                    "parent_id": "t1_hynbodk",
                    "score": 5,
                    "created_utc": 1645972714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hyngo60",
            "parent_id": "t3_t2pa96",
            "score": 6,
            "created_utc": 1645974866.0,
            "replies": [
                {
                    "body": "Yes on the multiples because it’s incorporated with networking. I learned to keep certain cards close to my chest. If I run into a Sponsor while meeting with another, it’s business. In fact, they know what’s up and will make sure they don’t disrupt. \n\nWhat monetary and non monetary gifts I receive along the way, I don’t disclose because it’s no one’s business. I do have an SD who supports me but he understands his capacity to provide is only a % of the outcome I’m trying to achieve. He’s comfortable with it. I am too and we keep things in perspective. \n\nI am six figures by myself and my three degrees (which isn’t enough for me). My goal was to grow my passive income and establish a brand (business). I’m aiming freedom (one source of income is not freedom), options, multiple avenues of cash flow. At some point you evolve and want more than bags, shoes, trips, etc (been there done that). My business friends are buying Aston Martins, acres of land, commercial property all from their successful businesses—I’m working to make sure I’m right there with them. Don’t throw me a purse…\n\nIt may not be fitting for some. My post is for those (you know who you are) who have bigger goals and need a few tips on how to propel them forward.",
                    "author": null,
                    "id": "hynn1b6",
                    "parent_id": "t1_hyngo60",
                    "score": 11,
                    "created_utc": 1645977532.0,
                    "replies": [
                        {
                            "body": "No Aston Martins - that’s just conspicuous consumption - but I love commercial and residential rental property and other income-producing assets.",
                            "author": "57hz",
                            "id": "hynwbfz",
                            "parent_id": "t1_hynn1b6",
                            "score": 5,
                            "created_utc": 1645981224.0,
                            "replies": []
                        },
                        {
                            "body": "OK as I continue to read and notice certain traits you also have the value of knowing the importance of personal security and not making your business other peoples business well done again",
                            "author": "puckhead4",
                            "id": "hyovr2f",
                            "parent_id": "t1_hynn1b6",
                            "score": 2,
                            "created_utc": 1645995029.0,
                            "replies": []
                        },
                        {
                            "body": "Why do you want more degrees?",
                            "author": "JDMultralight",
                            "id": "hyqt11x",
                            "parent_id": "t1_hynn1b6",
                            "score": 1,
                            "created_utc": 1646026653.0,
                            "replies": [
                                {
                                    "body": "I meant to say my income of six figures is not enough; although I’m comfortable. There’s more to acquire.",
                                    "author": null,
                                    "id": "hyqvmy0",
                                    "parent_id": "t1_hyqt11x",
                                    "score": 1,
                                    "created_utc": 1646028264.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There is an amazing amount of tech in Chicago, Kansas City, etc.  much of middle America has us in tech, real estate, equities, who love women and can teach.",
                    "author": "DrZenRoot",
                    "id": "hynx41j",
                    "parent_id": "t1_hyngo60",
                    "score": 1,
                    "created_utc": 1645981535.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hynyi0n",
                            "parent_id": "t1_hynx41j",
                            "score": 2,
                            "created_utc": 1645982075.0,
                            "replies": [
                                {
                                    "body": "Medical technology is huge here.  \n\nAlso a ton of smaller, startup stuff. There’s a lot of first Gen entrepreneurs here.  Cerner was started locally and the labor they had spun off a ton of technology. \nGarmin also came from Kansas. \nThere’s a lot of Gen X and older mellenials with tech startups who can compete.",
                                    "author": "DrZenRoot",
                                    "id": "hyo0akv",
                                    "parent_id": "t1_hynyi0n",
                                    "score": 1,
                                    "created_utc": 1645982764.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is really good advice that I don't often see spoken about in the community. Not about freestyling or whales in particular, but about being ambitious with your dating and making a higher than average attempt at working towards your goal as opposed to hoping it falls into your lap because of beauty standards.\n\nUsing online resources is a low effort form of dating that somehow always ends up costing users more effort overall churning through falsely advertised personalities represented by both sides of the gender spectrum.\n\nMost wealthy men will have a natural inclination towards women who have a sense of ambition surrounding them.  It falls into the 'show me, don't tell me' spectrum.  A woman can claim ambition on a dating profile, but women who are genuinely ambitious in their relationships are putting in ground work in the real world to reach their goals.\n\nIt's extremely close to education and career in that way.  You put in the effort for the education but never the effort for the real life experience in the career field.  Now you're sitting in a bunch of college debt working as a barista, pissed off at a broken educational system that somehow works for other people, but not you and wondering why.",
            "author": "Pacwing",
            "id": "hync1au",
            "parent_id": "t3_t2pa96",
            "score": 11,
            "created_utc": 1645972784.0,
            "replies": [
                {
                    "body": "Yes! They have worked hard to attain their wealth and wouldn’t consider just giving it away to some girl who feels entitled because she gets triple digit likes on social media. \n\nI have been around old and new money. None of the women in the circle look like IG models. They’re all mini versions of the whales that sponsor them. Hungry, relentless, and driving towards building their own capital. The whales see this as a complement and continue to be their support until one day the woman says “look look no hands”.",
                    "author": null,
                    "id": "hyndxsc",
                    "parent_id": "t1_hync1au",
                    "score": 15,
                    "created_utc": 1645973658.0,
                    "replies": [
                        {
                            "body": "F",
                            "author": null,
                            "id": "hyo0e7i",
                            "parent_id": "t1_hyndxsc",
                            "score": -1,
                            "created_utc": 1645982802.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well put.",
            "author": "MrRhoarke",
            "id": "hynjnu1",
            "parent_id": "t3_t2pa96",
            "score": 4,
            "created_utc": 1645976142.0,
            "replies": []
        },
        {
            "body": "Savvy strategy!",
            "author": "roscoe7585",
            "id": "hyndeuk",
            "parent_id": "t3_t2pa96",
            "score": 4,
            "created_utc": 1645973424.0,
            "replies": []
        },
        {
            "body": "Uh yeah if you’re hot on seeking you can get a meeting in about 20 minutes. Whale time takes months if not years to develop.\n\n so yeah if I was a SB my only route would be seeking and not waiting years for the results.",
            "author": "iamoptimusprime312",
            "id": "hynpy9a",
            "parent_id": "t3_t2pa96",
            "score": 4,
            "created_utc": 1645978717.0,
            "replies": []
        },
        {
            "body": "I’m not sure many whales will be sitting at a bar alone, nor out with colleagues/networking and appear to be picking up a young woman. It would give off the appearance of talking to a high class prostitute. This whole idea seems fundamentally flawed.",
            "author": "rockydennis99",
            "id": "hynhv1y",
            "parent_id": "t3_t2pa96",
            "score": 6,
            "created_utc": 1645975380.0,
            "replies": [
                {
                    "body": "Depends on your location. Major cities they are and it doesn’t come across as “picking up on someone”. It’s indirect.\n\nI’m only sharing what I know and can personally attest to.",
                    "author": null,
                    "id": "hynieju",
                    "parent_id": "t1_hynhv1y",
                    "score": 4,
                    "created_utc": 1645975612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I met my whale on SA. He did not promote himself as such.  After good deal of messaging, we were satisfied enough with the sincerity, intellect, and common interest to plan a M&G. We had never talked business or finances before, only that he’d had a SB for 6 years and had to end it bc she wanted to marry him. Things went very well, and before the end of the week, he sent me specifics on who he is (I hadn’t asked) and information to back it up. He loved the easy, comfortable, casual conversation AND the fact we hadn’t talked business, and I didn’t pressure him for anything. Trust and a genuine connection is what many of us want, even a whale.",
            "author": "BeautyBaby247",
            "id": "hypc34v",
            "parent_id": "t3_t2pa96",
            "score": 2,
            "created_utc": 1646001675.0,
            "replies": [
                {
                    "body": "What’s what’s up! I don’t think people understood my post in that I said “most” whales meaning there are some but if you expect to run into on SA majority of time. It seems like the expectation is the opposite—hence why there’s so much consternation.\n\nSo if you find one on SA great. If not, diversity and build a plan to get in the circle where they are at.",
                    "author": null,
                    "id": "hyphxha",
                    "parent_id": "t1_hypc34v",
                    "score": 1,
                    "created_utc": 1646004162.0,
                    "replies": [
                        {
                            "body": "We are all just sharing thoughts, ideas, experiences.  Just as you have. All is well. None of us should express our views and opinions without expecting others to “chime in” with their own. It’s a great way to learn from others. Otherwise, if it’s so bothersome, one shouldn’t share. \nBlessings",
                            "author": "BeautyBaby247",
                            "id": "hypk91o",
                            "parent_id": "t1_hyphxha",
                            "score": 2,
                            "created_utc": 1646005179.0,
                            "replies": [
                                {
                                    "body": "Exactly! There’s 50 ways to skin a cat. Find your way and work it",
                                    "author": null,
                                    "id": "hypkxfv",
                                    "parent_id": "t1_hypk91o",
                                    "score": 1,
                                    "created_utc": 1646005476.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not seeing how any of this advice would get you into the same room as someone I'd consider a whale. \n\nBefriending a salesman (that's the \"young tech guy entrepreneur\"), to find older salesmen (\"more established high net worth business men\"), will never get you near a whale. Those types of people spend their lives looking for people who have money to invest in them or through them. The older guy is looking for crumbs, the younger guy is a scam artist. A CEO of a new company with an actual product is busy working, not out networking to get funding. A worthwhile new company has people banging down his door offering him cash. Literally one call to any venture capital firm is all it takes.\n\nYou've got multiple layers between the older guy and anyone with actual wealth.\n\nIt goes whale -> whale's holding company/director of holding company -> manager -> some analyst (with a boosted title to make him look important to outsiders), who manages/gambles a small percentage of the money who has relationships with venture capital firms.\n\nThe analyst can't get into a room with the whale, nevermind some random \"businessman\" or \"entrepreneur\" who tries to pitch stuff to the analyst.\n\nYou're not going to find whales, the closest you might get is the founder of some publicly traded company who's getting harassed by these guys. Even if you did meet a real whale, you'd probably never know it.\n\nWhales find you, not the other way around. You will find some whales on SA, since some guys don't like outsourcing their relationships, but you won't find them in the circles you described.\n\nSource: Me.",
            "author": "Whale_SD",
            "id": "hyr5mu6",
            "parent_id": "t3_t2pa96",
            "score": 2,
            "created_utc": 1646035113.0,
            "replies": [
                {
                    "body": "Okay.",
                    "author": null,
                    "id": "hyryy5b",
                    "parent_id": "t1_hyr5mu6",
                    "score": 1,
                    "created_utc": 1646055834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's really no need for SA if you're truly wealthy because women lurks where there are powerful wealthy men.  It's been that way since the beginning of civilization.  You'll find that almost all wealthy men have more than one romantic interest tied by money.  So this is nothing new.  Usually wealthy men find their women near their business and connections.",
            "author": "MKTekke",
            "id": "hys9pp1",
            "parent_id": "t3_t2pa96",
            "score": 2,
            "created_utc": 1646060850.0,
            "replies": []
        },
        {
            "body": "We whales are on SA, so I don't agree with that part of your post. The fellow whales I know are almost all on SA as well.\n\nBut yes, the networking part of your post is correct. That's a very good way to meet whales. You don't even need to know any whales to get started or open doors. Just start going to tech networking events for example, especially the ones where startup pitches are made (think 'Shark Tank' but with an audience). There will be plenty of 8 and 9 figure guys there.\n\nWe troll these events looking for startups to invest in, but we also keep our eyes out for beautiful young ladies we can hire as assistants (or like you mentioned, young ladies who are looking to start their own businesses are even more attractive overall). And those hires often morph into SD/SB relationships.",
            "author": "Nomad_Bill",
            "id": "hynq6b4",
            "parent_id": "t3_t2pa96",
            "score": 7,
            "created_utc": 1645978805.0,
            "replies": []
        },
        {
            "body": "This will work if you are already rich (but not whaley) and/or have a PhD or are a tech professional. there's a whole army of wannabes competing for our attention, mostly young men pitching their startup ideas.  \nThere are many silicon valley stories of women who genuinely wanted to raise money for their companies (and not find a whale SD) and started socializing, only to \"discover\" what men really want. Google them, they are not pleasant.  \nYour attitude does give you an advantage over the purse and lipstick types, but it takes more to build the image of a future business exec.",
            "author": "JeaneyBowl",
            "id": "hyoq8lt",
            "parent_id": "t3_t2pa96",
            "score": 3,
            "created_utc": 1645992825.0,
            "replies": []
        },
        {
            "body": "This is awesome. What if you don’t personally have goals in the tech/business sector though? My vanilla interests don’t overlap at all with those.",
            "author": "NorthernGirlHere",
            "id": "hynh1oe",
            "parent_id": "t3_t2pa96",
            "score": 2,
            "created_utc": 1645975031.0,
            "replies": [
                {
                    "body": "If you have goals (entrepreneurship), I think it’s best to surround yourself with leaders in that field. There’s a lot of money in tech, oil, big pharma. You want to get into that circle of people and leverage accordingly.",
                    "author": null,
                    "id": "hynjsdp",
                    "parent_id": "t1_hynh1oe",
                    "score": 2,
                    "created_utc": 1645976195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💯! The real daddies aren’t on seeking! But sometimes there’s a few smedium ass men on there.",
            "author": "kaprikash",
            "id": "hynimvf",
            "parent_id": "t3_t2pa96",
            "score": 2,
            "created_utc": 1645975713.0,
            "replies": []
        },
        {
            "body": "*Talk about entrepreneurship, current events, politics, and express wanting to learn more about increasing your capacity.*\n\nAnd what if you are one of those innumerable POT SB's whose entire conversational arsenal consists of \"Hey\" \"Heyy\" and \"WYD?\"",
            "author": "BinghamtonSD",
            "id": "hynhqi7",
            "parent_id": "t3_t2pa96",
            "score": 3,
            "created_utc": 1645975324.0,
            "replies": [
                {
                    "body": "Grow up. Build your 3-5 year career plan and work that plan. Listen more than run your mouth. Read, read, and keep up on current events. \n\nFocus on the long game, not short and fast game.",
                    "author": null,
                    "id": "hyni6a0",
                    "parent_id": "t1_hynhqi7",
                    "score": 5,
                    "created_utc": 1645975514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This sounds a lot like sleeping your way to success and it can lead to a LOT of trouble for guys in today’s environment with tech firms accused of being toxic workplaces",
            "author": "Spartan44BB",
            "id": "hyq0wmw",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1646012741.0,
            "replies": [
                {
                    "body": "Bad assumption that  sex is involved lol",
                    "author": null,
                    "id": "hyq16tq",
                    "parent_id": "t1_hyq0wmw",
                    "score": 1,
                    "created_utc": 1646012873.0,
                    "replies": [
                        {
                            "body": "Maybe we’re in the wrong forum.. is there one for entrepreneurship?",
                            "author": "Spartan44BB",
                            "id": "hyq1t5o",
                            "parent_id": "t1_hyq16tq",
                            "score": 2,
                            "created_utc": 1646013161.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How exactly do you bring up ppm with someone of that caliber? I’m almost positive they’d be offended, right? And I don’t do anything for free so I’m not sure how this would work for me",
            "author": "all-time-tacos",
            "id": "hyoa3wf",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1645986518.0,
            "replies": [
                {
                    "body": "Interesting to hear responses.  I have an ex-SB who ended up with a Whale with a capital W.  Now engaged!  I asked her how she was going to play it, and she said \"you don't bring up money with guys like this, you make it so he adores you and just does it on his own\".  So based on my huge sample size of one 🤣 , I don't think \"freestyle a whale\" and \"I don't do anything for free\" are compatible philosophies.   This is similar to what I've read from other SBs who are looking for higher end SRs, things are not explicitly negotiated.  \n\nIt's an interesting topic in that it's a type of SR that isn't super commonly discussed.",
                    "author": "Azurecole",
                    "id": "hyok8a6",
                    "parent_id": "t1_hyoa3wf",
                    "score": 8,
                    "created_utc": 1645990447.0,
                    "replies": []
                },
                {
                    "body": "You don’t bring up PPM or money.  Focus on understanding what it is about you that made this person/whale interested in you (set you apart), and find ways to maintain his interest.  Support and generosity will come naturally.",
                    "author": "BlissfulSB",
                    "id": "hyoriy6",
                    "parent_id": "t1_hyoa3wf",
                    "score": 6,
                    "created_utc": 1645993341.0,
                    "replies": []
                },
                {
                    "body": "For situations like that, you never bring up PPM. You never ask for money outright. You hint at being dissatisfied with your financial situation. You hint at things you wish you could afford. If they like you, they’ll take care of all of it, baby.",
                    "author": "FigureSorry",
                    "id": "hyon5d0",
                    "parent_id": "t1_hyoa3wf",
                    "score": 3,
                    "created_utc": 1645991589.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Whales aren’t satisfied with just the girls within their social circle. Why limit yourself when you got the whole world including the influencers in IG and babes in SA?",
            "author": "Smooth-Database2959",
            "id": "hyoxih5",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1645995735.0,
            "replies": []
        },
        {
            "body": "you need to be a petite white/asian girl who isnt trashy too\n\n\n#minnowlife",
            "author": "vtec__",
            "id": "hyoayzv",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1645986855.0,
            "replies": [
                {
                    "body": "I’m not going to get into appearances. But y’all can just please do so by starting a new thread. \n\nThank you for respecting that. 🙂",
                    "author": null,
                    "id": "hyocaio",
                    "parent_id": "t1_hyoayzv",
                    "score": 2,
                    "created_utc": 1645987364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have you seen Twitter? Easier to just message girls there but it seems like more escort type situations but you never know. The popular hot girls, are expecting probably a lot more than what is norm on SA",
            "author": "amoonshotgirl",
            "id": "hynce9a",
            "parent_id": "t3_t2pa96",
            "score": 0,
            "created_utc": 1645972954.0,
            "replies": [
                {
                    "body": "I intentionally don’t have any social media. Again, no establish high $M capital man is going to waste his time DMing women on Twitter. There is a certain degree of arrogance that will prevent them from doing that.",
                    "author": null,
                    "id": "hyncpjt",
                    "parent_id": "t1_hynce9a",
                    "score": 4,
                    "created_utc": 1645973096.0,
                    "replies": [
                        {
                            "body": "Many ultra wealthy men are confident and project success. Without even trying. In social events, business meetings etc, they encounter smart good looking women, and men being men, will flirt and pursue those women. They do not need or want to\nWaste time on social media.\nSo Op, I agree with you, just my take",
                            "author": "PB6161",
                            "id": "hyndy85",
                            "parent_id": "t1_hyncpjt",
                            "score": 6,
                            "created_utc": 1645973663.0,
                            "replies": [
                                {
                                    "body": "Thank you.",
                                    "author": null,
                                    "id": "hyne527",
                                    "parent_id": "t1_hyndy85",
                                    "score": 2,
                                    "created_utc": 1645973749.0,
                                    "replies": [
                                        {
                                            "body": "Do you avoid rich men that flaunt their lifestyle on Instagram? For example, a flashy real estate agent that makes humble brag posts about the last house he sold in Scottsdale, etc.. are they worth the trouble?",
                                            "author": "FigureSorry",
                                            "id": "hyonig9",
                                            "parent_id": "t1_hyne527",
                                            "score": 2,
                                            "created_utc": 1645991733.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not on social media in that capacity. My encounters have been in person. Who I ignore is the guy who comes into flashy and loud—wearing his money. He may have it but I don’t gravitate to those types. I have turned down very successful high net worth people because of the “flashy mentality”.  I don’t like a lot if attention even though it comes—I’m not tap dancing for it.",
                                                    "author": null,
                                                    "id": "hyp0mef",
                                                    "parent_id": "t1_hyonig9",
                                                    "score": 1,
                                                    "created_utc": 1645996982.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
                                                            "author": "FigureSorry",
                                                            "id": "hyp3es1",
                                                            "parent_id": "t1_hyp0mef",
                                                            "score": 1,
                                                            "created_utc": 1645998112.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                                                                    "author": null,
                                                                    "id": "hyp8mrd",
                                                                    "parent_id": "t1_hyp3es1",
                                                                    "score": 1,
                                                                    "created_utc": 1646000243.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                                                                            "author": "FigureSorry",
                                                                            "id": "hypeyon",
                                                                            "parent_id": "t1_hyp8mrd",
                                                                            "score": 1,
                                                                            "created_utc": 1646002895.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I should really try to go to Sea World again before all the orcas are gone.",
            "author": "non_giant_panda",
            "id": "hyp14ru",
            "parent_id": "t3_t2pa96",
            "score": 0,
            "created_utc": 1645997188.0,
            "replies": []
        },
        {
            "body": "Curious, are women seeking whales usually looking for it to be their primary source of income?\n\nI sometimes wonder if I’m not the whale type because I’m successful in my own right, intelligent, independent, etc. I don’t really feel the need for “mentorship” as I’m successful in my career, and know full well how to climb my particular industry’s ladder. \n\nI get a lot of traction on SA but might honestly feel weird if my supplemental sugar income outpaced my salary. Maybe I’m just not the luxury type.",
            "author": null,
            "id": "hypdadn",
            "parent_id": "t3_t2pa96",
            "score": 0,
            "created_utc": 1646002186.0,
            "replies": []
        },
        {
            "body": "Lol! That should sum it up.",
            "author": null,
            "id": "hynlbbu",
            "parent_id": "t3_t2pa96",
            "score": -3,
            "created_utc": 1645976828.0,
            "replies": []
        },
        {
            "body": "Goodluck with this approach all whales and smaller whales know that there are these women gunning for us.  Obviously you have to be extremely careful who you let into the circle.",
            "author": "Mirroruniverseudie",
            "id": "hyq385q",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1646013819.0,
            "replies": [
                {
                    "body": "Thank you for the caution. I will make sure I’m careful. 😊",
                    "author": null,
                    "id": "hyq8h10",
                    "parent_id": "t1_hyq385q",
                    "score": 1,
                    "created_utc": 1646016235.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True true true\n\n-Whale dater",
            "author": "SipCoconuts",
            "id": "hyqm19v",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1646022779.0,
            "replies": []
        },
        {
            "body": "What is considered a whale? I’m around $25m and 35y/o and I have no idea if that makes me a whale or a guppy I’m the SD world.",
            "author": "TheFunKindofTrouble",
            "id": "hyqtvcr",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1646027161.0,
            "replies": []
        },
        {
            "body": "There’s no blanket answer for anything. I like fun. Are you fun to be around? Are you genuine? That’s all I care about.",
            "author": "JamesGarrison",
            "id": "hys00zj",
            "parent_id": "t3_t2pa96",
            "score": 1,
            "created_utc": 1646056378.0,
            "replies": []
        },
        {
            "body": "I love it hear it!! High five. 😊",
            "author": null,
            "id": "hyp0z6t",
            "parent_id": "t1_hyogijn",
            "score": 2,
            "created_utc": 1645997125.0,
            "replies": []
        },
        {
            "body": "A tiny is more than none. Start small and make iterations of success.\n\nWhen you go in biting off more than you can chew at that time, it’s a possibility you can fail. But it doesn’t mean you can’t get up and start again. This is not a one time let me get rich process. I’m talking about the long haul process that considers where I want to be in my retirement, when I want to retire, how I want to support my grandkids, take care of my parents when they age. All of which is $$$ and not quick scheme money.",
            "author": null,
            "id": "hynnuli",
            "parent_id": "t1_hynlwg5",
            "score": 4,
            "created_utc": 1645977864.0,
            "replies": []
        },
        {
            "body": "Nothing beats a try but a failure! Go for it! Prove the Cynics wrong",
            "author": "YakiMe",
            "id": "hyp6u08",
            "parent_id": "t1_hynlwg5",
            "score": 1,
            "created_utc": 1645999497.0,
            "replies": []
        },
        {
            "body": "So he’s married but constantly cheats on her with other women. Doesn’t sound like a satisfying life in the end.",
            "author": "FigureSorry",
            "id": "hyokp5l",
            "parent_id": "t1_hyntduk",
            "score": 17,
            "created_utc": 1645990625.0,
            "replies": [
                {
                    "body": "Agreed, though they still seem to have a loving marriage.  I suspect she knows, as he spends enough time with other women that it’s not possible that she hasn’t become suspicious - but he claims she has never caught him.  It’s certainly not how I would do things, cheating isn’t how I roll.  I don’t think I am any better at resisting women than he is, but I won’t ever get into a marriage that isn’t open, where she knows everything and is on board with it, and she has the same freedom.",
                    "author": "awesomedude2016_2016",
                    "id": "hypjuae",
                    "parent_id": "t1_hyokp5l",
                    "score": 6,
                    "created_utc": 1646004996.0,
                    "replies": [
                        {
                            "body": "you ever ask him or he ever say why he decided to get married?",
                            "author": "sicrm",
                            "id": "hyqik0u",
                            "parent_id": "t1_hypjuae",
                            "score": 2,
                            "created_utc": 1646020986.0,
                            "replies": [
                                {
                                    "body": "He got her pregnant while she was still married to her high school sweetheart.  She had to tell her husband and get a divorce, then marry my business partner.  He is from a culture where having children out of wedlock is a serious problem, and abortion isn't even a discussion.  Even with a 9 figure net worth, his parents are still an enormous part of his life and his entire family would have shamed him for not marrying her.",
                                    "author": "awesomedude2016_2016",
                                    "id": "hyqk2dq",
                                    "parent_id": "t1_hyqik0u",
                                    "score": 5,
                                    "created_utc": 1646021749.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For you. Some love it. Have your cake and eat it too. Don’t judge.",
                    "author": "MountWestSD",
                    "id": "hyotn5b",
                    "parent_id": "t1_hyokp5l",
                    "score": 0,
                    "created_utc": 1645994187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ambition, intelligence, etc. are very attractive to women, but it doesn't work the opposite way for men. \n\nEven for men that care about those qualities, they are listed \\*after\\* \"hot\" and \"preferably young\"., (except for the woke reddit rangers of SLF)",
            "author": null,
            "id": "hyo09t0",
            "parent_id": "t1_hyntduk",
            "score": 18,
            "created_utc": 1645982755.0,
            "replies": [
                {
                    "body": "I think you mean that it doesn’t get our dicks hard.  It draws us to people out of the comfort of being around a peer if that is your relationship template.  It’s not hot, it just feels natural.\n\nWhen I look around at the women my wealthy, attractive friends cheat with, they’re usually not the hottest women they can find.  They are two people who drift together for other reasons and a lot of that is through peer groups - so many are with women vying to be a on a level with them or people in roles that are respected and critical to the non-sexual needs of these whales.",
                    "author": "JDMultralight",
                    "id": "hyqrbl6",
                    "parent_id": "t1_hyo09t0",
                    "score": 5,
                    "created_utc": 1646025663.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree. I think as women, we over think how to \"keep\" a whale. They are men, after all.",
            "author": null,
            "id": "hyof0oj",
            "parent_id": "t1_hyntduk",
            "score": 7,
            "created_utc": 1645988416.0,
            "replies": []
        },
        {
            "body": "Man I need a watch. Is my takeaway and a hundred plus million dollars. That’s it!",
            "author": "highjinx411",
            "id": "hyokvss",
            "parent_id": "t1_hyntduk",
            "score": 7,
            "created_utc": 1645990696.0,
            "replies": [
                {
                    "body": "That watch opened lots of doors for him with women, for sure.  You can’t tattoo your net worth on your forehead, but you can wear part of it on your wrist.  To many women, stuff like this at least gives them a moment of pause, no matter what the age difference or lack of physical attraction.  If you combine it with even a little bit of game, a watch like that will take you far.  But if you only have the watch and not the lifestyle/money to back up the image it creates in the minds of the women that are impressed by it, then a watch like that is a waste of money and time.",
                    "author": "awesomedude2016_2016",
                    "id": "hyonpzg",
                    "parent_id": "t1_hyokvss",
                    "score": 8,
                    "created_utc": 1645991818.0,
                    "replies": [
                        {
                            "body": "I have a 5k watch I wear and not many people have noticed like I thought. It reflects me about right. More than your average person but not 12 million dollar house rich. Its funny because I tell the SBs I have met to look at the watch and know the brands/values if high end watches.",
                            "author": "highjinx411",
                            "id": "hypeh7t",
                            "parent_id": "t1_hyonpzg",
                            "score": 2,
                            "created_utc": 1646002691.0,
                            "replies": [
                                {
                                    "body": "He specifically chose this watch for the bling factor. I have seen $300k watches that are much more understated than this one (some Patek’s fall in this category).  \n\nApparently, women like diamonds.  Who knew lol.  Personally, I thought it was a extremely gaudy.",
                                    "author": "awesomedude2016_2016",
                                    "id": "hypfwn1",
                                    "parent_id": "t1_hypeh7t",
                                    "score": 5,
                                    "created_utc": 1646003292.0,
                                    "replies": [
                                        {
                                            "body": "So its a “diamond” covered watch?",
                                            "author": "SipCoconuts",
                                            "id": "hyqmxd4",
                                            "parent_id": "t1_hypfwn1",
                                            "score": 0,
                                            "created_utc": 1646023249.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
                                                    "author": "awesomedude2016_2016",
                                                    "id": "hyqo12e",
                                                    "parent_id": "t1_hyqmxd4",
                                                    "score": 1,
                                                    "created_utc": 1646023836.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow",
            "author": "401kisfun",
            "id": "hynytet",
            "parent_id": "t1_hyntduk",
            "score": 3,
            "created_utc": 1645982198.0,
            "replies": []
        },
        {
            "body": "I'm out shopping for a fake 60k watch. eBay here I come!",
            "author": "JeaneyBowl",
            "id": "hyorzv5",
            "parent_id": "t1_hyntduk",
            "score": 3,
            "created_utc": 1645993529.0,
            "replies": []
        },
        {
            "body": "Where's the gay version of this?",
            "author": "verelset",
            "id": "hyowe9n",
            "parent_id": "t1_hyntduk",
            "score": 2,
            "created_utc": 1645995285.0,
            "replies": []
        },
        {
            "body": "Can you tell me what industry conferences these are ? And where is it that wealthy men hang out? \nI’m on SA but just don’t want my story of meeting my husband was from the website lol \n\nI wanna meet someone IRL but don’t know where these men hang out or conferences they go to. Appreciate any suggestions 🙏",
            "author": "natayy",
            "id": "hyocp1x",
            "parent_id": "t1_hyntduk",
            "score": 3,
            "created_utc": 1645987522.0,
            "replies": [
                {
                    "body": "You know I as a lesser SD would love to escort SBs to an industry event to help them try to find a high end SD. I wouldn’t even ask for anything physical the company would be great. It also would boost my status as they would see me with a beautiful woman. Just something to think about as I think other SDs would agree with this.",
                    "author": "highjinx411",
                    "id": "hyombar",
                    "parent_id": "t1_hyocp1x",
                    "score": 10,
                    "created_utc": 1645991262.0,
                    "replies": [
                        {
                            "body": "That’s actually a really interesting idea.  Having you as a bridge, you would know which guys would actually be worth it for them to talk to. Not all whales are wearing a crazy watch to identify themselves.  “Oh he’s the founder of Xyz, they make millions” etc.",
                            "author": "awesomedude2016_2016",
                            "id": "hyoqgbg",
                            "parent_id": "t1_hyombar",
                            "score": 7,
                            "created_utc": 1645992910.0,
                            "replies": [
                                {
                                    "body": "you just skipped like 4 levels to the end of the game🤣🤣",
                                    "author": "SweetD79",
                                    "id": "hyq0ebl",
                                    "parent_id": "t1_hyoqgbg",
                                    "score": 2,
                                    "created_utc": 1646012505.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The business we were in together was in the financial services industry (software for banks).  These conferences often had a mix of bank executives, tech executives from the software companies trying to sell to the banks, and lower level sales/tech people actually working the exhibition booths. Both of the women he wound up with from conferences were there working booths for their companies, but the hotel bars at these conferences were also full of women looking to hook up with wealthy men.  So if you’re looking at that angle, look for conferences/conventions in your area that would attract top executives in whatever field.  The smaller and more exclusive the conference, the better.  Go hang at a hotel bar there during prime time for a day or two.\n\nAs far as where they hang out under normal circumstances, think bars and restaurants in very wealthy areas.  Not necessarily tourist zones…like places that someone who lives in the area would go.  If you’re attractive enough, merely being in these places and paying attention to what the men hitting on your are wearing/driving/whatever, you can pretty easily wind up with a rich guy.\n\nFinally, I wouldn’t entirely discount the idea that you will find a whale online, even on SA. Don’t be afraid to reach out to someone you can identify as being very wealthy, whatever the platform.  I know a handful of wealthy men that have dated women they met through LinkedIn.  Just post a picture that is hot but appropriate for the platform (bikini is great on IG, not so much on LinkedIn..etc), and reach out.",
                    "author": "awesomedude2016_2016",
                    "id": "hyombg9",
                    "parent_id": "t1_hyocp1x",
                    "score": 6,
                    "created_utc": 1645991264.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hyox2jz",
            "parent_id": "t1_hyntduk",
            "score": 2,
            "created_utc": 1645995556.0,
            "replies": [
                {
                    "body": "I'm not rich at all, but I absolutely love wearing watches and am thinking about saving up for one I really love. I much prefer just looking at my wrist rather than getting my phone up, and it's an everyday accessory that goes with almost any outfit without looking blingy :)",
                    "author": "Rorquall",
                    "id": "hyp7zfz",
                    "parent_id": "t1_hyox2jz",
                    "score": 6,
                    "created_utc": 1645999970.0,
                    "replies": []
                },
                {
                    "body": "There's nothing sophisticated or discerning about looking at a phone for the time. Literally everyone does that. Logic does not equal taste, and what makes sense logically does not equate to what differentiates someone with style. When I wear a watch (not often), it's because I enjoy the analog experience. By your explanation women's earrings serve no purpose either, but clearly they do.",
                    "author": "supersalacious",
                    "id": "hyp0p5w",
                    "parent_id": "t1_hyox2jz",
                    "score": 1,
                    "created_utc": 1645997013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I respect your perspective but I believe it’s like mine one of many. 🙂 But bringing what has been effective for you to this community it’s what it’s about.\n\nShare your experience…the more the helpful for SBs starting out or in a much different place than you/me/others.",
            "author": null,
            "id": "hyo9qfx",
            "parent_id": "t1_hyo4bnv",
            "score": 6,
            "created_utc": 1645986372.0,
            "replies": []
        },
        {
            "body": "Yes, I do not know a lot of power couples who imhabit the same professional space besides real estate people.  Usually if the woman is also a killer she is highly successful in another field - doctor, intellectual, artistic.  \n\nThat being said, I generally date women with a hard-core immigrant mentality because that is what I respect most and it balances out the fact that I’m a spacey dreamer who is utterly unable to do the actual hands-on work.",
            "author": "JDMultralight",
            "id": "hyqqjby",
            "parent_id": "t1_hyo4bnv",
            "score": 2,
            "created_utc": 1646025218.0,
            "replies": []
        },
        {
            "body": "Ambitious men attracted to ambitious women, I find are more likely to support.",
            "author": "SipCoconuts",
            "id": "hyqma5v",
            "parent_id": "t1_hyo4bnv",
            "score": 1,
            "created_utc": 1646022909.0,
            "replies": [
                {
                    "body": "The difference is that ambitious men are most frequently focused on business and often the bay of sharks.  In contrast the women are more commonly focused on arts, medicine, social activities.",
                    "author": "pinotandsugar",
                    "id": "hyr447b",
                    "parent_id": "t1_hyqma5v",
                    "score": 1,
                    "created_utc": 1646034008.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said, many whales just date vanilla with women born from upper-class families or Ivy league/upper State school educations",
            "author": "JohnnyKemmer009",
            "id": "hyoaljq",
            "parent_id": "t1_hyo3ll2",
            "score": 13,
            "created_utc": 1645986709.0,
            "replies": []
        },
        {
            "body": "I probably roamed between the sharks and the whales.  The SB's whom I related best to over several decades were those for whom the relationship was about far more than the $ (to achieve worthwhile goals)   and seldom about the Gucci babbles. \n\nThose who wanted the Gucci bag I felt only sorrow for.   There were those who sought  assistance in both economic and spiritual support  to make an exponential advance in both their economic situation and their career path that were irresistible and for whom the allowance was not an expense but rather an investment . \n\nOne completed her BS and went on to her MD and a successful career on the strength of her character and some sugar applied at a critical point in her struggle.  A decade later we still exchange birthday and Christmas greetings/",
            "author": "pinotandsugar",
            "id": "hyr3sgz",
            "parent_id": "t1_hyo3ll2",
            "score": 2,
            "created_utc": 1646033773.0,
            "replies": []
        },
        {
            "body": "dating up has nothing to do with career paths. It has to do with a wealth or looks disparity",
            "author": "NickPfromYuma",
            "id": "hypjld7",
            "parent_id": "t1_hynzlx8",
            "score": 2,
            "created_utc": 1646004886.0,
            "replies": [
                {
                    "body": "I think dating up is about socio-economic status but I havent put much thought into the idea.",
                    "author": "JDMultralight",
                    "id": "hyqqmwu",
                    "parent_id": "t1_hypjld7",
                    "score": 3,
                    "created_utc": 1646025276.0,
                    "replies": [
                        {
                            "body": "Sure for women it’s dating in another socio-economic status and for the man it’s usually dating up out of his league of attractiveness usually because of a large age gap.\n\nI think what many people fail to realize is that before Seeking existed there were no such thing as sugar relationships. Sure there have been SD for 100 years, but sugar relationships were just vanilla relationships with a large age gap and a major wealth disparity.  A sugar baby was nothing more then a spoiled GF of an older wealthy man no matter if that relationship was committed or casual. They were both dating up.  I’m pretty sure that the modern sugar arrangement created by Seeking is what allowed sugar relationships to become more like sex work rather than a dating relationship. To me, Seeking is moving away from being a sugar arrangement site and more towards the original concept of sugar where it was an actual relationship.",
                            "author": "NickPfromYuma",
                            "id": "hyrm4ez",
                            "parent_id": "t1_hyqqmwu",
                            "score": 0,
                            "created_utc": 1646048097.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Driving…\n\nBut if that’s step one then build it into the plan. I really believe SBs get sugaring for more reasons than acquiring fashion accessories. It may start that way but women nowadays…we’re smart cookies. Especially with the right mentors",
            "author": null,
            "id": "hyo92fv",
            "parent_id": "t1_hyo7up7",
            "score": 1,
            "created_utc": 1645986113.0,
            "replies": [
                {
                    "body": "no disagreement.",
                    "author": "bookworm010101",
                    "id": "hyo9oyy",
                    "parent_id": "t1_hyo92fv",
                    "score": 1,
                    "created_utc": 1645986356.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My network isn’t very good though. I don’t think this is always true. There are guys who have high net worth without a high net work.",
            "author": "highjinx411",
            "id": "hypfm01",
            "parent_id": "t1_hyno4x3",
            "score": 3,
            "created_utc": 1646003165.0,
            "replies": []
        },
        {
            "body": "Exactly. One day the lightbulb will switch on and a few ladies in here will pivot accordingly.\n\nWhat I don’t want is 3 years from now the same SB is on here ranting about her SD shorted her a couple benes and she’s furious trying to get back at him. \n\nNo evolve. Think bigger, build a long term plan, and get into working that plan. We all will have to face major lifestyle milestones (kids, grandkids, retirement, etc.) so we have to reverse engineer our journey and tailor our activities around where we want to be in the future.",
            "author": null,
            "id": "hynpwtg",
            "parent_id": "t1_hyno4x3",
            "score": 4,
            "created_utc": 1645978701.0,
            "replies": [
                {
                    "body": "I think you are operating on a different level than most SBs here, and even if you tell them, won’t be able to execute.\n\nDo you see the dangerous positions so many of them put themselves in? They just aren’t able to do it.",
                    "author": "garret6758",
                    "id": "hynwa02",
                    "parent_id": "t1_hynpwtg",
                    "score": 7,
                    "created_utc": 1645981208.0,
                    "replies": [
                        {
                            "body": "I agree with this. It’s not for all SBs so they could be missing out on an ok guy because they are searching for a whale.",
                            "author": "highjinx411",
                            "id": "hypfdta",
                            "parent_id": "t1_hynwa02",
                            "score": 2,
                            "created_utc": 1646003071.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Boring for a shark like myself 😄. I like the challenge always have.",
            "author": null,
            "id": "hyno44q",
            "parent_id": "t1_hynlgnk",
            "score": 1,
            "created_utc": 1645977973.0,
            "replies": [
                {
                    "body": "When you live in less popular places like the Midwest, SA can be a godsend.",
                    "author": "FigureSorry",
                    "id": "hyolhmb",
                    "parent_id": "t1_hyno44q",
                    "score": 5,
                    "created_utc": 1645990934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All of this minus the coke 😄. I don’t participate, but I’ll be the lifeguard.\n\nIf I were a man looking to expand and be supported would you call me a “gold digger”? \n\nNope. You’re gonna say I’m a mini version of you looking to build my own path.",
            "author": null,
            "id": "hynix0v",
            "parent_id": "t1_hynhiai",
            "score": 12,
            "created_utc": 1645975831.0,
            "replies": []
        },
        {
            "body": "Gold digging is the literal difference between vanilla and the bowl.",
            "author": "Pacwing",
            "id": "hynjwhf",
            "parent_id": "t1_hynhiai",
            "score": 4,
            "created_utc": 1645976244.0,
            "replies": []
        },
        {
            "body": "Gold diggers are looking for an easy lifestyle where they get a free ride. Ambitious women working on something for themselves are not gold diggers, but they are highly attractive for that attitude.",
            "author": "57hz",
            "id": "hynvxoj",
            "parent_id": "t1_hynhiai",
            "score": 4,
            "created_utc": 1645981071.0,
            "replies": []
        },
        {
            "body": "Maybe gold digging isn't the correct term. I'm more thinking of the Heather Graham character from Bowfinger.",
            "author": "darteduncle",
            "id": "hyoc644",
            "parent_id": "t1_hynhiai",
            "score": 1,
            "created_utc": 1645987316.0,
            "replies": []
        },
        {
            "body": "I’m not sure what you’re expecting as evidence. These kinds of successful women are not participating in sugaring surveys. You’re more likely to read about their startup in *Fortune*.",
            "author": "57hz",
            "id": "hynvovl",
            "parent_id": "t1_hyngo68",
            "score": 7,
            "created_utc": 1645980976.0,
            "replies": [
                {
                    "body": "I'm talking about statements such as whales never messaging a woman or making use of SA or being interested in an arrangement or being attracted to anyone other than someone who reflects their ambition etc etc.\n\nIt's just based on absolutely no substance, no research, no evidence and directly contradicts the experience of many such people.\n\nOn top of that it is completely and totally useless advice. Because even if that scenario was true, the vast majority of currently succesful SBs would be utterly unfit or uninterested in chasing such a relationship.\n\nBut sure, let's pretend that succesful people don't have time for social media or internet platforms while she claims to have found success and is posting here on such a platform.",
                    "author": "YlangScent",
                    "id": "hyoi6dl",
                    "parent_id": "t1_hynvovl",
                    "score": 3,
                    "created_utc": 1645989663.0,
                    "replies": [
                        {
                            "body": "I agree with this.  Those claims seemed far-fetched. \n\n I go fishing as my hobby/obsession in a place with like 300 species to catch.  There are some very rare and extremely highly valued ones.  Ask the guys at the pier how to catch those and you’ll get incoherent advice because no one person has seen enough of them to know what works.  \n\nThe best advice is not to choose your gear to catch one of those.  If you get one, fantastic - but it’s just bizarre to go out targeting a fish that 999/1000 fishermen will ever get in their lifetime.  Will break your focus on catching good fish you can be proud of.",
                            "author": "JDMultralight",
                            "id": "hyqsq5t",
                            "parent_id": "t1_hyoi6dl",
                            "score": 3,
                            "created_utc": 1646026473.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Last time I checked, there is only \\_one\\_  woman on the Forbes list that didn't get her money from a man, either her father, via inheritance, or ex-husband, via divorce.",
                    "author": null,
                    "id": "hyo0qzk",
                    "parent_id": "t1_hynvovl",
                    "score": 4,
                    "created_utc": 1645982938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It okay. I appreciate your contribution though. No offense taken. 😄",
            "author": null,
            "id": "hynjzps",
            "parent_id": "t1_hyngo68",
            "score": 1,
            "created_utc": 1645976281.0,
            "replies": [
                {
                    "body": "Since I know you and your posts I'll be less confrontational with my reply. I fully believe you have been as successful as you state in your post, however that has very little to do with any external actions you took, aside from perhaps deciding to focus solely on your career and less on chasing immediate returns for long term investments from non-Seeking SDs, and everything to do with your intelligence and personality.\n\nAll SBs need to be physically attractive, and as the makeup thread the other day taught us some of them spend an inordinate amount of money in order to meet that qualification. However, while your method will indeed get you more in the long run it will fail for nearly all SBs and leave them fucked with little to nothing to show for it. By nearly all I mean 998/1000.\n\nI will agree that trying to find a more traditional arrangement will indeed net bigger returns long term for you, but there is also the risk of getting absolutely nothing. You are able to navigate that, most SBs need the security of a pre-determined allowance or they won't end up with anything at all.",
                    "author": "storm170",
                    "id": "hyo1xox",
                    "parent_id": "t1_hynjzps",
                    "score": 7,
                    "created_utc": 1645983400.0,
                    "replies": [
                        {
                            "body": "You know I’m non confrontational but love a good banter offline.\n\nI appreciate your post. 🙂",
                            "author": null,
                            "id": "hyoaig3",
                            "parent_id": "t1_hyo1xox",
                            "score": 1,
                            "created_utc": 1645986675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The more a lady becomes focused on building her own business and changing her social circle to the likes of the very business owners she’s trying to mirror, the more she will run into whales/investors.\n\nSome of my friends are like WTF how did you sky rocket so fast! Well I stopped partying with them (waste of time) and started evening networking with the csuite executives, owners, venture capitalists because I want to build my business—blood sweat tears. My extra curricular time was repurposed to ensure I achieve success and low behold I found myself in the middle of wealthy people. My guy friend is a baby whale (low double digit million) younger than me (35) who brings me along because he says I help him close deals. He in turn helps me by putting me in circles I couldn’t otherwise be in. \n\nMen are the infrastructure to our economy. They dominate all four corners. So I had to ditch the girl time and go where the deals are being discussed and I can listen, learn, and apply. No night clubs, no IG/Tiktok BS, etc.",
            "author": null,
            "id": "hynhg61",
            "parent_id": "t1_hynfj14",
            "score": 16,
            "created_utc": 1645975200.0,
            "replies": [
                {
                    "body": "Well done Miss! From what I have read here you certainly come off as intelligent, analytical, and goal oriented. You also certainly seem to have realized that you get where you want to go you have to make sacrifices in other areas. To me that also indicates you have great self-discipline. Congratulations sincerely.",
                    "author": "puckhead4",
                    "id": "hyoui2e",
                    "parent_id": "t1_hynhg61",
                    "score": 3,
                    "created_utc": 1645994533.0,
                    "replies": []
                },
                {
                    "body": "I don’t know if this works as a general technique, because you have to be stylish, smart, and able to impress the boys with your business conversation, but I would agree that this is the best way to attract men with serious money.",
                    "author": "57hz",
                    "id": "hynvb9v",
                    "parent_id": "t1_hynhg61",
                    "score": 5,
                    "created_utc": 1645980828.0,
                    "replies": [
                        {
                            "body": "This doesn’t work “as a general technique” because the vast majority of potential SBs do not fit anything close to the OP’s profile. That is, they are waaay younger than 35 and not in the midst of creating their own businesses, with attendant need for investment capital. Most are on Seeking because they are 18-26, students and/or working retail (managerial or lower), and simply looking to get rent covered along with some extra spoiling.  Expectations are totally different from OPs.  That said, her message makes sense for those with her own profile and I applaud her drive.",
                            "author": "jacknjilled",
                            "id": "hyny4wr",
                            "parent_id": "t1_hynvb9v",
                            "score": 8,
                            "created_utc": 1645981934.0,
                            "replies": [
                                {
                                    "body": "I think if you target SBs from East Asia, The Near East or Eastern Europe (Nigeria too) it is pretty likely you will run into one with this mindset.\n\nSugaring is too much of a killer financial deal for ambitious and highly girls to ignore.",
                                    "author": "JDMultralight",
                                    "id": "hyqs08y",
                                    "parent_id": "t1_hyny4wr",
                                    "score": 2,
                                    "created_utc": 1646026057.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you",
            "author": null,
            "id": "hynbw2z",
            "parent_id": "t1_hynbodk",
            "score": 5,
            "created_utc": 1645972714.0,
            "replies": []
        },
        {
            "body": "Yes on the multiples because it’s incorporated with networking. I learned to keep certain cards close to my chest. If I run into a Sponsor while meeting with another, it’s business. In fact, they know what’s up and will make sure they don’t disrupt. \n\nWhat monetary and non monetary gifts I receive along the way, I don’t disclose because it’s no one’s business. I do have an SD who supports me but he understands his capacity to provide is only a % of the outcome I’m trying to achieve. He’s comfortable with it. I am too and we keep things in perspective. \n\nI am six figures by myself and my three degrees (which isn’t enough for me). My goal was to grow my passive income and establish a brand (business). I’m aiming freedom (one source of income is not freedom), options, multiple avenues of cash flow. At some point you evolve and want more than bags, shoes, trips, etc (been there done that). My business friends are buying Aston Martins, acres of land, commercial property all from their successful businesses—I’m working to make sure I’m right there with them. Don’t throw me a purse…\n\nIt may not be fitting for some. My post is for those (you know who you are) who have bigger goals and need a few tips on how to propel them forward.",
            "author": null,
            "id": "hynn1b6",
            "parent_id": "t1_hyngo60",
            "score": 11,
            "created_utc": 1645977532.0,
            "replies": [
                {
                    "body": "No Aston Martins - that’s just conspicuous consumption - but I love commercial and residential rental property and other income-producing assets.",
                    "author": "57hz",
                    "id": "hynwbfz",
                    "parent_id": "t1_hynn1b6",
                    "score": 5,
                    "created_utc": 1645981224.0,
                    "replies": []
                },
                {
                    "body": "OK as I continue to read and notice certain traits you also have the value of knowing the importance of personal security and not making your business other peoples business well done again",
                    "author": "puckhead4",
                    "id": "hyovr2f",
                    "parent_id": "t1_hynn1b6",
                    "score": 2,
                    "created_utc": 1645995029.0,
                    "replies": []
                },
                {
                    "body": "Why do you want more degrees?",
                    "author": "JDMultralight",
                    "id": "hyqt11x",
                    "parent_id": "t1_hynn1b6",
                    "score": 1,
                    "created_utc": 1646026653.0,
                    "replies": [
                        {
                            "body": "I meant to say my income of six figures is not enough; although I’m comfortable. There’s more to acquire.",
                            "author": null,
                            "id": "hyqvmy0",
                            "parent_id": "t1_hyqt11x",
                            "score": 1,
                            "created_utc": 1646028264.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is an amazing amount of tech in Chicago, Kansas City, etc.  much of middle America has us in tech, real estate, equities, who love women and can teach.",
            "author": "DrZenRoot",
            "id": "hynx41j",
            "parent_id": "t1_hyngo60",
            "score": 1,
            "created_utc": 1645981535.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hynyi0n",
                    "parent_id": "t1_hynx41j",
                    "score": 2,
                    "created_utc": 1645982075.0,
                    "replies": [
                        {
                            "body": "Medical technology is huge here.  \n\nAlso a ton of smaller, startup stuff. There’s a lot of first Gen entrepreneurs here.  Cerner was started locally and the labor they had spun off a ton of technology. \nGarmin also came from Kansas. \nThere’s a lot of Gen X and older mellenials with tech startups who can compete.",
                            "author": "DrZenRoot",
                            "id": "hyo0akv",
                            "parent_id": "t1_hynyi0n",
                            "score": 1,
                            "created_utc": 1645982764.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! They have worked hard to attain their wealth and wouldn’t consider just giving it away to some girl who feels entitled because she gets triple digit likes on social media. \n\nI have been around old and new money. None of the women in the circle look like IG models. They’re all mini versions of the whales that sponsor them. Hungry, relentless, and driving towards building their own capital. The whales see this as a complement and continue to be their support until one day the woman says “look look no hands”.",
            "author": null,
            "id": "hyndxsc",
            "parent_id": "t1_hync1au",
            "score": 15,
            "created_utc": 1645973658.0,
            "replies": [
                {
                    "body": "F",
                    "author": null,
                    "id": "hyo0e7i",
                    "parent_id": "t1_hyndxsc",
                    "score": -1,
                    "created_utc": 1645982802.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Depends on your location. Major cities they are and it doesn’t come across as “picking up on someone”. It’s indirect.\n\nI’m only sharing what I know and can personally attest to.",
            "author": null,
            "id": "hynieju",
            "parent_id": "t1_hynhv1y",
            "score": 4,
            "created_utc": 1645975612.0,
            "replies": []
        },
        {
            "body": "What’s what’s up! I don’t think people understood my post in that I said “most” whales meaning there are some but if you expect to run into on SA majority of time. It seems like the expectation is the opposite—hence why there’s so much consternation.\n\nSo if you find one on SA great. If not, diversity and build a plan to get in the circle where they are at.",
            "author": null,
            "id": "hyphxha",
            "parent_id": "t1_hypc34v",
            "score": 1,
            "created_utc": 1646004162.0,
            "replies": [
                {
                    "body": "We are all just sharing thoughts, ideas, experiences.  Just as you have. All is well. None of us should express our views and opinions without expecting others to “chime in” with their own. It’s a great way to learn from others. Otherwise, if it’s so bothersome, one shouldn’t share. \nBlessings",
                    "author": "BeautyBaby247",
                    "id": "hypk91o",
                    "parent_id": "t1_hyphxha",
                    "score": 2,
                    "created_utc": 1646005179.0,
                    "replies": [
                        {
                            "body": "Exactly! There’s 50 ways to skin a cat. Find your way and work it",
                            "author": null,
                            "id": "hypkxfv",
                            "parent_id": "t1_hypk91o",
                            "score": 1,
                            "created_utc": 1646005476.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay.",
            "author": null,
            "id": "hyryy5b",
            "parent_id": "t1_hyr5mu6",
            "score": 1,
            "created_utc": 1646055834.0,
            "replies": []
        },
        {
            "body": "If you have goals (entrepreneurship), I think it’s best to surround yourself with leaders in that field. There’s a lot of money in tech, oil, big pharma. You want to get into that circle of people and leverage accordingly.",
            "author": null,
            "id": "hynjsdp",
            "parent_id": "t1_hynh1oe",
            "score": 2,
            "created_utc": 1645976195.0,
            "replies": []
        },
        {
            "body": "Grow up. Build your 3-5 year career plan and work that plan. Listen more than run your mouth. Read, read, and keep up on current events. \n\nFocus on the long game, not short and fast game.",
            "author": null,
            "id": "hyni6a0",
            "parent_id": "t1_hynhqi7",
            "score": 5,
            "created_utc": 1645975514.0,
            "replies": []
        },
        {
            "body": "Bad assumption that  sex is involved lol",
            "author": null,
            "id": "hyq16tq",
            "parent_id": "t1_hyq0wmw",
            "score": 1,
            "created_utc": 1646012873.0,
            "replies": [
                {
                    "body": "Maybe we’re in the wrong forum.. is there one for entrepreneurship?",
                    "author": "Spartan44BB",
                    "id": "hyq1t5o",
                    "parent_id": "t1_hyq16tq",
                    "score": 2,
                    "created_utc": 1646013161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting to hear responses.  I have an ex-SB who ended up with a Whale with a capital W.  Now engaged!  I asked her how she was going to play it, and she said \"you don't bring up money with guys like this, you make it so he adores you and just does it on his own\".  So based on my huge sample size of one 🤣 , I don't think \"freestyle a whale\" and \"I don't do anything for free\" are compatible philosophies.   This is similar to what I've read from other SBs who are looking for higher end SRs, things are not explicitly negotiated.  \n\nIt's an interesting topic in that it's a type of SR that isn't super commonly discussed.",
            "author": "Azurecole",
            "id": "hyok8a6",
            "parent_id": "t1_hyoa3wf",
            "score": 8,
            "created_utc": 1645990447.0,
            "replies": []
        },
        {
            "body": "You don’t bring up PPM or money.  Focus on understanding what it is about you that made this person/whale interested in you (set you apart), and find ways to maintain his interest.  Support and generosity will come naturally.",
            "author": "BlissfulSB",
            "id": "hyoriy6",
            "parent_id": "t1_hyoa3wf",
            "score": 6,
            "created_utc": 1645993341.0,
            "replies": []
        },
        {
            "body": "For situations like that, you never bring up PPM. You never ask for money outright. You hint at being dissatisfied with your financial situation. You hint at things you wish you could afford. If they like you, they’ll take care of all of it, baby.",
            "author": "FigureSorry",
            "id": "hyon5d0",
            "parent_id": "t1_hyoa3wf",
            "score": 3,
            "created_utc": 1645991589.0,
            "replies": []
        },
        {
            "body": "I’m not going to get into appearances. But y’all can just please do so by starting a new thread. \n\nThank you for respecting that. 🙂",
            "author": null,
            "id": "hyocaio",
            "parent_id": "t1_hyoayzv",
            "score": 2,
            "created_utc": 1645987364.0,
            "replies": []
        },
        {
            "body": "I intentionally don’t have any social media. Again, no establish high $M capital man is going to waste his time DMing women on Twitter. There is a certain degree of arrogance that will prevent them from doing that.",
            "author": null,
            "id": "hyncpjt",
            "parent_id": "t1_hynce9a",
            "score": 4,
            "created_utc": 1645973096.0,
            "replies": [
                {
                    "body": "Many ultra wealthy men are confident and project success. Without even trying. In social events, business meetings etc, they encounter smart good looking women, and men being men, will flirt and pursue those women. They do not need or want to\nWaste time on social media.\nSo Op, I agree with you, just my take",
                    "author": "PB6161",
                    "id": "hyndy85",
                    "parent_id": "t1_hyncpjt",
                    "score": 6,
                    "created_utc": 1645973663.0,
                    "replies": [
                        {
                            "body": "Thank you.",
                            "author": null,
                            "id": "hyne527",
                            "parent_id": "t1_hyndy85",
                            "score": 2,
                            "created_utc": 1645973749.0,
                            "replies": [
                                {
                                    "body": "Do you avoid rich men that flaunt their lifestyle on Instagram? For example, a flashy real estate agent that makes humble brag posts about the last house he sold in Scottsdale, etc.. are they worth the trouble?",
                                    "author": "FigureSorry",
                                    "id": "hyonig9",
                                    "parent_id": "t1_hyne527",
                                    "score": 2,
                                    "created_utc": 1645991733.0,
                                    "replies": [
                                        {
                                            "body": "I’m not on social media in that capacity. My encounters have been in person. Who I ignore is the guy who comes into flashy and loud—wearing his money. He may have it but I don’t gravitate to those types. I have turned down very successful high net worth people because of the “flashy mentality”.  I don’t like a lot if attention even though it comes—I’m not tap dancing for it.",
                                            "author": null,
                                            "id": "hyp0mef",
                                            "parent_id": "t1_hyonig9",
                                            "score": 1,
                                            "created_utc": 1645996982.0,
                                            "replies": [
                                                {
                                                    "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
                                                    "author": "FigureSorry",
                                                    "id": "hyp3es1",
                                                    "parent_id": "t1_hyp0mef",
                                                    "score": 1,
                                                    "created_utc": 1645998112.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                                                            "author": null,
                                                            "id": "hyp8mrd",
                                                            "parent_id": "t1_hyp3es1",
                                                            "score": 1,
                                                            "created_utc": 1646000243.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                                                                    "author": "FigureSorry",
                                                                    "id": "hypeyon",
                                                                    "parent_id": "t1_hyp8mrd",
                                                                    "score": 1,
                                                                    "created_utc": 1646002895.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for the caution. I will make sure I’m careful. 😊",
            "author": null,
            "id": "hyq8h10",
            "parent_id": "t1_hyq385q",
            "score": 1,
            "created_utc": 1646016235.0,
            "replies": []
        },
        {
            "body": "Agreed, though they still seem to have a loving marriage.  I suspect she knows, as he spends enough time with other women that it’s not possible that she hasn’t become suspicious - but he claims she has never caught him.  It’s certainly not how I would do things, cheating isn’t how I roll.  I don’t think I am any better at resisting women than he is, but I won’t ever get into a marriage that isn’t open, where she knows everything and is on board with it, and she has the same freedom.",
            "author": "awesomedude2016_2016",
            "id": "hypjuae",
            "parent_id": "t1_hyokp5l",
            "score": 6,
            "created_utc": 1646004996.0,
            "replies": [
                {
                    "body": "you ever ask him or he ever say why he decided to get married?",
                    "author": "sicrm",
                    "id": "hyqik0u",
                    "parent_id": "t1_hypjuae",
                    "score": 2,
                    "created_utc": 1646020986.0,
                    "replies": [
                        {
                            "body": "He got her pregnant while she was still married to her high school sweetheart.  She had to tell her husband and get a divorce, then marry my business partner.  He is from a culture where having children out of wedlock is a serious problem, and abortion isn't even a discussion.  Even with a 9 figure net worth, his parents are still an enormous part of his life and his entire family would have shamed him for not marrying her.",
                            "author": "awesomedude2016_2016",
                            "id": "hyqk2dq",
                            "parent_id": "t1_hyqik0u",
                            "score": 5,
                            "created_utc": 1646021749.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For you. Some love it. Have your cake and eat it too. Don’t judge.",
            "author": "MountWestSD",
            "id": "hyotn5b",
            "parent_id": "t1_hyokp5l",
            "score": 0,
            "created_utc": 1645994187.0,
            "replies": []
        },
        {
            "body": "I think you mean that it doesn’t get our dicks hard.  It draws us to people out of the comfort of being around a peer if that is your relationship template.  It’s not hot, it just feels natural.\n\nWhen I look around at the women my wealthy, attractive friends cheat with, they’re usually not the hottest women they can find.  They are two people who drift together for other reasons and a lot of that is through peer groups - so many are with women vying to be a on a level with them or people in roles that are respected and critical to the non-sexual needs of these whales.",
            "author": "JDMultralight",
            "id": "hyqrbl6",
            "parent_id": "t1_hyo09t0",
            "score": 5,
            "created_utc": 1646025663.0,
            "replies": []
        },
        {
            "body": "That watch opened lots of doors for him with women, for sure.  You can’t tattoo your net worth on your forehead, but you can wear part of it on your wrist.  To many women, stuff like this at least gives them a moment of pause, no matter what the age difference or lack of physical attraction.  If you combine it with even a little bit of game, a watch like that will take you far.  But if you only have the watch and not the lifestyle/money to back up the image it creates in the minds of the women that are impressed by it, then a watch like that is a waste of money and time.",
            "author": "awesomedude2016_2016",
            "id": "hyonpzg",
            "parent_id": "t1_hyokvss",
            "score": 8,
            "created_utc": 1645991818.0,
            "replies": [
                {
                    "body": "I have a 5k watch I wear and not many people have noticed like I thought. It reflects me about right. More than your average person but not 12 million dollar house rich. Its funny because I tell the SBs I have met to look at the watch and know the brands/values if high end watches.",
                    "author": "highjinx411",
                    "id": "hypeh7t",
                    "parent_id": "t1_hyonpzg",
                    "score": 2,
                    "created_utc": 1646002691.0,
                    "replies": [
                        {
                            "body": "He specifically chose this watch for the bling factor. I have seen $300k watches that are much more understated than this one (some Patek’s fall in this category).  \n\nApparently, women like diamonds.  Who knew lol.  Personally, I thought it was a extremely gaudy.",
                            "author": "awesomedude2016_2016",
                            "id": "hypfwn1",
                            "parent_id": "t1_hypeh7t",
                            "score": 5,
                            "created_utc": 1646003292.0,
                            "replies": [
                                {
                                    "body": "So its a “diamond” covered watch?",
                                    "author": "SipCoconuts",
                                    "id": "hyqmxd4",
                                    "parent_id": "t1_hypfwn1",
                                    "score": 0,
                                    "created_utc": 1646023249.0,
                                    "replies": [
                                        {
                                            "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
                                            "author": "awesomedude2016_2016",
                                            "id": "hyqo12e",
                                            "parent_id": "t1_hyqmxd4",
                                            "score": 1,
                                            "created_utc": 1646023836.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know I as a lesser SD would love to escort SBs to an industry event to help them try to find a high end SD. I wouldn’t even ask for anything physical the company would be great. It also would boost my status as they would see me with a beautiful woman. Just something to think about as I think other SDs would agree with this.",
            "author": "highjinx411",
            "id": "hyombar",
            "parent_id": "t1_hyocp1x",
            "score": 10,
            "created_utc": 1645991262.0,
            "replies": [
                {
                    "body": "That’s actually a really interesting idea.  Having you as a bridge, you would know which guys would actually be worth it for them to talk to. Not all whales are wearing a crazy watch to identify themselves.  “Oh he’s the founder of Xyz, they make millions” etc.",
                    "author": "awesomedude2016_2016",
                    "id": "hyoqgbg",
                    "parent_id": "t1_hyombar",
                    "score": 7,
                    "created_utc": 1645992910.0,
                    "replies": [
                        {
                            "body": "you just skipped like 4 levels to the end of the game🤣🤣",
                            "author": "SweetD79",
                            "id": "hyq0ebl",
                            "parent_id": "t1_hyoqgbg",
                            "score": 2,
                            "created_utc": 1646012505.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The business we were in together was in the financial services industry (software for banks).  These conferences often had a mix of bank executives, tech executives from the software companies trying to sell to the banks, and lower level sales/tech people actually working the exhibition booths. Both of the women he wound up with from conferences were there working booths for their companies, but the hotel bars at these conferences were also full of women looking to hook up with wealthy men.  So if you’re looking at that angle, look for conferences/conventions in your area that would attract top executives in whatever field.  The smaller and more exclusive the conference, the better.  Go hang at a hotel bar there during prime time for a day or two.\n\nAs far as where they hang out under normal circumstances, think bars and restaurants in very wealthy areas.  Not necessarily tourist zones…like places that someone who lives in the area would go.  If you’re attractive enough, merely being in these places and paying attention to what the men hitting on your are wearing/driving/whatever, you can pretty easily wind up with a rich guy.\n\nFinally, I wouldn’t entirely discount the idea that you will find a whale online, even on SA. Don’t be afraid to reach out to someone you can identify as being very wealthy, whatever the platform.  I know a handful of wealthy men that have dated women they met through LinkedIn.  Just post a picture that is hot but appropriate for the platform (bikini is great on IG, not so much on LinkedIn..etc), and reach out.",
            "author": "awesomedude2016_2016",
            "id": "hyombg9",
            "parent_id": "t1_hyocp1x",
            "score": 6,
            "created_utc": 1645991264.0,
            "replies": []
        },
        {
            "body": "I'm not rich at all, but I absolutely love wearing watches and am thinking about saving up for one I really love. I much prefer just looking at my wrist rather than getting my phone up, and it's an everyday accessory that goes with almost any outfit without looking blingy :)",
            "author": "Rorquall",
            "id": "hyp7zfz",
            "parent_id": "t1_hyox2jz",
            "score": 6,
            "created_utc": 1645999970.0,
            "replies": []
        },
        {
            "body": "There's nothing sophisticated or discerning about looking at a phone for the time. Literally everyone does that. Logic does not equal taste, and what makes sense logically does not equate to what differentiates someone with style. When I wear a watch (not often), it's because I enjoy the analog experience. By your explanation women's earrings serve no purpose either, but clearly they do.",
            "author": "supersalacious",
            "id": "hyp0p5w",
            "parent_id": "t1_hyox2jz",
            "score": 1,
            "created_utc": 1645997013.0,
            "replies": []
        },
        {
            "body": "The difference is that ambitious men are most frequently focused on business and often the bay of sharks.  In contrast the women are more commonly focused on arts, medicine, social activities.",
            "author": "pinotandsugar",
            "id": "hyr447b",
            "parent_id": "t1_hyqma5v",
            "score": 1,
            "created_utc": 1646034008.0,
            "replies": []
        },
        {
            "body": "I think dating up is about socio-economic status but I havent put much thought into the idea.",
            "author": "JDMultralight",
            "id": "hyqqmwu",
            "parent_id": "t1_hypjld7",
            "score": 3,
            "created_utc": 1646025276.0,
            "replies": [
                {
                    "body": "Sure for women it’s dating in another socio-economic status and for the man it’s usually dating up out of his league of attractiveness usually because of a large age gap.\n\nI think what many people fail to realize is that before Seeking existed there were no such thing as sugar relationships. Sure there have been SD for 100 years, but sugar relationships were just vanilla relationships with a large age gap and a major wealth disparity.  A sugar baby was nothing more then a spoiled GF of an older wealthy man no matter if that relationship was committed or casual. They were both dating up.  I’m pretty sure that the modern sugar arrangement created by Seeking is what allowed sugar relationships to become more like sex work rather than a dating relationship. To me, Seeking is moving away from being a sugar arrangement site and more towards the original concept of sugar where it was an actual relationship.",
                    "author": "NickPfromYuma",
                    "id": "hyrm4ez",
                    "parent_id": "t1_hyqqmwu",
                    "score": 0,
                    "created_utc": 1646048097.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "no disagreement.",
            "author": "bookworm010101",
            "id": "hyo9oyy",
            "parent_id": "t1_hyo92fv",
            "score": 1,
            "created_utc": 1645986356.0,
            "replies": []
        },
        {
            "body": "I think you are operating on a different level than most SBs here, and even if you tell them, won’t be able to execute.\n\nDo you see the dangerous positions so many of them put themselves in? They just aren’t able to do it.",
            "author": "garret6758",
            "id": "hynwa02",
            "parent_id": "t1_hynpwtg",
            "score": 7,
            "created_utc": 1645981208.0,
            "replies": [
                {
                    "body": "I agree with this. It’s not for all SBs so they could be missing out on an ok guy because they are searching for a whale.",
                    "author": "highjinx411",
                    "id": "hypfdta",
                    "parent_id": "t1_hynwa02",
                    "score": 2,
                    "created_utc": 1646003071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When you live in less popular places like the Midwest, SA can be a godsend.",
            "author": "FigureSorry",
            "id": "hyolhmb",
            "parent_id": "t1_hyno44q",
            "score": 5,
            "created_utc": 1645990934.0,
            "replies": []
        },
        {
            "body": "I'm talking about statements such as whales never messaging a woman or making use of SA or being interested in an arrangement or being attracted to anyone other than someone who reflects their ambition etc etc.\n\nIt's just based on absolutely no substance, no research, no evidence and directly contradicts the experience of many such people.\n\nOn top of that it is completely and totally useless advice. Because even if that scenario was true, the vast majority of currently succesful SBs would be utterly unfit or uninterested in chasing such a relationship.\n\nBut sure, let's pretend that succesful people don't have time for social media or internet platforms while she claims to have found success and is posting here on such a platform.",
            "author": "YlangScent",
            "id": "hyoi6dl",
            "parent_id": "t1_hynvovl",
            "score": 3,
            "created_utc": 1645989663.0,
            "replies": [
                {
                    "body": "I agree with this.  Those claims seemed far-fetched. \n\n I go fishing as my hobby/obsession in a place with like 300 species to catch.  There are some very rare and extremely highly valued ones.  Ask the guys at the pier how to catch those and you’ll get incoherent advice because no one person has seen enough of them to know what works.  \n\nThe best advice is not to choose your gear to catch one of those.  If you get one, fantastic - but it’s just bizarre to go out targeting a fish that 999/1000 fishermen will ever get in their lifetime.  Will break your focus on catching good fish you can be proud of.",
                    "author": "JDMultralight",
                    "id": "hyqsq5t",
                    "parent_id": "t1_hyoi6dl",
                    "score": 3,
                    "created_utc": 1646026473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Last time I checked, there is only \\_one\\_  woman on the Forbes list that didn't get her money from a man, either her father, via inheritance, or ex-husband, via divorce.",
            "author": null,
            "id": "hyo0qzk",
            "parent_id": "t1_hynvovl",
            "score": 4,
            "created_utc": 1645982938.0,
            "replies": []
        },
        {
            "body": "Since I know you and your posts I'll be less confrontational with my reply. I fully believe you have been as successful as you state in your post, however that has very little to do with any external actions you took, aside from perhaps deciding to focus solely on your career and less on chasing immediate returns for long term investments from non-Seeking SDs, and everything to do with your intelligence and personality.\n\nAll SBs need to be physically attractive, and as the makeup thread the other day taught us some of them spend an inordinate amount of money in order to meet that qualification. However, while your method will indeed get you more in the long run it will fail for nearly all SBs and leave them fucked with little to nothing to show for it. By nearly all I mean 998/1000.\n\nI will agree that trying to find a more traditional arrangement will indeed net bigger returns long term for you, but there is also the risk of getting absolutely nothing. You are able to navigate that, most SBs need the security of a pre-determined allowance or they won't end up with anything at all.",
            "author": "storm170",
            "id": "hyo1xox",
            "parent_id": "t1_hynjzps",
            "score": 7,
            "created_utc": 1645983400.0,
            "replies": [
                {
                    "body": "You know I’m non confrontational but love a good banter offline.\n\nI appreciate your post. 🙂",
                    "author": null,
                    "id": "hyoaig3",
                    "parent_id": "t1_hyo1xox",
                    "score": 1,
                    "created_utc": 1645986675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well done Miss! From what I have read here you certainly come off as intelligent, analytical, and goal oriented. You also certainly seem to have realized that you get where you want to go you have to make sacrifices in other areas. To me that also indicates you have great self-discipline. Congratulations sincerely.",
            "author": "puckhead4",
            "id": "hyoui2e",
            "parent_id": "t1_hynhg61",
            "score": 3,
            "created_utc": 1645994533.0,
            "replies": []
        },
        {
            "body": "I don’t know if this works as a general technique, because you have to be stylish, smart, and able to impress the boys with your business conversation, but I would agree that this is the best way to attract men with serious money.",
            "author": "57hz",
            "id": "hynvb9v",
            "parent_id": "t1_hynhg61",
            "score": 5,
            "created_utc": 1645980828.0,
            "replies": [
                {
                    "body": "This doesn’t work “as a general technique” because the vast majority of potential SBs do not fit anything close to the OP’s profile. That is, they are waaay younger than 35 and not in the midst of creating their own businesses, with attendant need for investment capital. Most are on Seeking because they are 18-26, students and/or working retail (managerial or lower), and simply looking to get rent covered along with some extra spoiling.  Expectations are totally different from OPs.  That said, her message makes sense for those with her own profile and I applaud her drive.",
                    "author": "jacknjilled",
                    "id": "hyny4wr",
                    "parent_id": "t1_hynvb9v",
                    "score": 8,
                    "created_utc": 1645981934.0,
                    "replies": [
                        {
                            "body": "I think if you target SBs from East Asia, The Near East or Eastern Europe (Nigeria too) it is pretty likely you will run into one with this mindset.\n\nSugaring is too much of a killer financial deal for ambitious and highly girls to ignore.",
                            "author": "JDMultralight",
                            "id": "hyqs08y",
                            "parent_id": "t1_hyny4wr",
                            "score": 2,
                            "created_utc": 1646026057.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No Aston Martins - that’s just conspicuous consumption - but I love commercial and residential rental property and other income-producing assets.",
            "author": "57hz",
            "id": "hynwbfz",
            "parent_id": "t1_hynn1b6",
            "score": 5,
            "created_utc": 1645981224.0,
            "replies": []
        },
        {
            "body": "OK as I continue to read and notice certain traits you also have the value of knowing the importance of personal security and not making your business other peoples business well done again",
            "author": "puckhead4",
            "id": "hyovr2f",
            "parent_id": "t1_hynn1b6",
            "score": 2,
            "created_utc": 1645995029.0,
            "replies": []
        },
        {
            "body": "Why do you want more degrees?",
            "author": "JDMultralight",
            "id": "hyqt11x",
            "parent_id": "t1_hynn1b6",
            "score": 1,
            "created_utc": 1646026653.0,
            "replies": [
                {
                    "body": "I meant to say my income of six figures is not enough; although I’m comfortable. There’s more to acquire.",
                    "author": null,
                    "id": "hyqvmy0",
                    "parent_id": "t1_hyqt11x",
                    "score": 1,
                    "created_utc": 1646028264.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hynyi0n",
            "parent_id": "t1_hynx41j",
            "score": 2,
            "created_utc": 1645982075.0,
            "replies": [
                {
                    "body": "Medical technology is huge here.  \n\nAlso a ton of smaller, startup stuff. There’s a lot of first Gen entrepreneurs here.  Cerner was started locally and the labor they had spun off a ton of technology. \nGarmin also came from Kansas. \nThere’s a lot of Gen X and older mellenials with tech startups who can compete.",
                    "author": "DrZenRoot",
                    "id": "hyo0akv",
                    "parent_id": "t1_hynyi0n",
                    "score": 1,
                    "created_utc": 1645982764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "F",
            "author": null,
            "id": "hyo0e7i",
            "parent_id": "t1_hyndxsc",
            "score": -1,
            "created_utc": 1645982802.0,
            "replies": []
        },
        {
            "body": "We are all just sharing thoughts, ideas, experiences.  Just as you have. All is well. None of us should express our views and opinions without expecting others to “chime in” with their own. It’s a great way to learn from others. Otherwise, if it’s so bothersome, one shouldn’t share. \nBlessings",
            "author": "BeautyBaby247",
            "id": "hypk91o",
            "parent_id": "t1_hyphxha",
            "score": 2,
            "created_utc": 1646005179.0,
            "replies": [
                {
                    "body": "Exactly! There’s 50 ways to skin a cat. Find your way and work it",
                    "author": null,
                    "id": "hypkxfv",
                    "parent_id": "t1_hypk91o",
                    "score": 1,
                    "created_utc": 1646005476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe we’re in the wrong forum.. is there one for entrepreneurship?",
            "author": "Spartan44BB",
            "id": "hyq1t5o",
            "parent_id": "t1_hyq16tq",
            "score": 2,
            "created_utc": 1646013161.0,
            "replies": []
        },
        {
            "body": "Many ultra wealthy men are confident and project success. Without even trying. In social events, business meetings etc, they encounter smart good looking women, and men being men, will flirt and pursue those women. They do not need or want to\nWaste time on social media.\nSo Op, I agree with you, just my take",
            "author": "PB6161",
            "id": "hyndy85",
            "parent_id": "t1_hyncpjt",
            "score": 6,
            "created_utc": 1645973663.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": null,
                    "id": "hyne527",
                    "parent_id": "t1_hyndy85",
                    "score": 2,
                    "created_utc": 1645973749.0,
                    "replies": [
                        {
                            "body": "Do you avoid rich men that flaunt their lifestyle on Instagram? For example, a flashy real estate agent that makes humble brag posts about the last house he sold in Scottsdale, etc.. are they worth the trouble?",
                            "author": "FigureSorry",
                            "id": "hyonig9",
                            "parent_id": "t1_hyne527",
                            "score": 2,
                            "created_utc": 1645991733.0,
                            "replies": [
                                {
                                    "body": "I’m not on social media in that capacity. My encounters have been in person. Who I ignore is the guy who comes into flashy and loud—wearing his money. He may have it but I don’t gravitate to those types. I have turned down very successful high net worth people because of the “flashy mentality”.  I don’t like a lot if attention even though it comes—I’m not tap dancing for it.",
                                    "author": null,
                                    "id": "hyp0mef",
                                    "parent_id": "t1_hyonig9",
                                    "score": 1,
                                    "created_utc": 1645996982.0,
                                    "replies": [
                                        {
                                            "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
                                            "author": "FigureSorry",
                                            "id": "hyp3es1",
                                            "parent_id": "t1_hyp0mef",
                                            "score": 1,
                                            "created_utc": 1645998112.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                                                    "author": null,
                                                    "id": "hyp8mrd",
                                                    "parent_id": "t1_hyp3es1",
                                                    "score": 1,
                                                    "created_utc": 1646000243.0,
                                                    "replies": [
                                                        {
                                                            "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                                                            "author": "FigureSorry",
                                                            "id": "hypeyon",
                                                            "parent_id": "t1_hyp8mrd",
                                                            "score": 1,
                                                            "created_utc": 1646002895.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you ever ask him or he ever say why he decided to get married?",
            "author": "sicrm",
            "id": "hyqik0u",
            "parent_id": "t1_hypjuae",
            "score": 2,
            "created_utc": 1646020986.0,
            "replies": [
                {
                    "body": "He got her pregnant while she was still married to her high school sweetheart.  She had to tell her husband and get a divorce, then marry my business partner.  He is from a culture where having children out of wedlock is a serious problem, and abortion isn't even a discussion.  Even with a 9 figure net worth, his parents are still an enormous part of his life and his entire family would have shamed him for not marrying her.",
                    "author": "awesomedude2016_2016",
                    "id": "hyqk2dq",
                    "parent_id": "t1_hyqik0u",
                    "score": 5,
                    "created_utc": 1646021749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a 5k watch I wear and not many people have noticed like I thought. It reflects me about right. More than your average person but not 12 million dollar house rich. Its funny because I tell the SBs I have met to look at the watch and know the brands/values if high end watches.",
            "author": "highjinx411",
            "id": "hypeh7t",
            "parent_id": "t1_hyonpzg",
            "score": 2,
            "created_utc": 1646002691.0,
            "replies": [
                {
                    "body": "He specifically chose this watch for the bling factor. I have seen $300k watches that are much more understated than this one (some Patek’s fall in this category).  \n\nApparently, women like diamonds.  Who knew lol.  Personally, I thought it was a extremely gaudy.",
                    "author": "awesomedude2016_2016",
                    "id": "hypfwn1",
                    "parent_id": "t1_hypeh7t",
                    "score": 5,
                    "created_utc": 1646003292.0,
                    "replies": [
                        {
                            "body": "So its a “diamond” covered watch?",
                            "author": "SipCoconuts",
                            "id": "hyqmxd4",
                            "parent_id": "t1_hypfwn1",
                            "score": 0,
                            "created_utc": 1646023249.0,
                            "replies": [
                                {
                                    "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
                                    "author": "awesomedude2016_2016",
                                    "id": "hyqo12e",
                                    "parent_id": "t1_hyqmxd4",
                                    "score": 1,
                                    "created_utc": 1646023836.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s actually a really interesting idea.  Having you as a bridge, you would know which guys would actually be worth it for them to talk to. Not all whales are wearing a crazy watch to identify themselves.  “Oh he’s the founder of Xyz, they make millions” etc.",
            "author": "awesomedude2016_2016",
            "id": "hyoqgbg",
            "parent_id": "t1_hyombar",
            "score": 7,
            "created_utc": 1645992910.0,
            "replies": [
                {
                    "body": "you just skipped like 4 levels to the end of the game🤣🤣",
                    "author": "SweetD79",
                    "id": "hyq0ebl",
                    "parent_id": "t1_hyoqgbg",
                    "score": 2,
                    "created_utc": 1646012505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure for women it’s dating in another socio-economic status and for the man it’s usually dating up out of his league of attractiveness usually because of a large age gap.\n\nI think what many people fail to realize is that before Seeking existed there were no such thing as sugar relationships. Sure there have been SD for 100 years, but sugar relationships were just vanilla relationships with a large age gap and a major wealth disparity.  A sugar baby was nothing more then a spoiled GF of an older wealthy man no matter if that relationship was committed or casual. They were both dating up.  I’m pretty sure that the modern sugar arrangement created by Seeking is what allowed sugar relationships to become more like sex work rather than a dating relationship. To me, Seeking is moving away from being a sugar arrangement site and more towards the original concept of sugar where it was an actual relationship.",
            "author": "NickPfromYuma",
            "id": "hyrm4ez",
            "parent_id": "t1_hyqqmwu",
            "score": 0,
            "created_utc": 1646048097.0,
            "replies": []
        },
        {
            "body": "I agree with this. It’s not for all SBs so they could be missing out on an ok guy because they are searching for a whale.",
            "author": "highjinx411",
            "id": "hypfdta",
            "parent_id": "t1_hynwa02",
            "score": 2,
            "created_utc": 1646003071.0,
            "replies": []
        },
        {
            "body": "I agree with this.  Those claims seemed far-fetched. \n\n I go fishing as my hobby/obsession in a place with like 300 species to catch.  There are some very rare and extremely highly valued ones.  Ask the guys at the pier how to catch those and you’ll get incoherent advice because no one person has seen enough of them to know what works.  \n\nThe best advice is not to choose your gear to catch one of those.  If you get one, fantastic - but it’s just bizarre to go out targeting a fish that 999/1000 fishermen will ever get in their lifetime.  Will break your focus on catching good fish you can be proud of.",
            "author": "JDMultralight",
            "id": "hyqsq5t",
            "parent_id": "t1_hyoi6dl",
            "score": 3,
            "created_utc": 1646026473.0,
            "replies": []
        },
        {
            "body": "You know I’m non confrontational but love a good banter offline.\n\nI appreciate your post. 🙂",
            "author": null,
            "id": "hyoaig3",
            "parent_id": "t1_hyo1xox",
            "score": 1,
            "created_utc": 1645986675.0,
            "replies": []
        },
        {
            "body": "This doesn’t work “as a general technique” because the vast majority of potential SBs do not fit anything close to the OP’s profile. That is, they are waaay younger than 35 and not in the midst of creating their own businesses, with attendant need for investment capital. Most are on Seeking because they are 18-26, students and/or working retail (managerial or lower), and simply looking to get rent covered along with some extra spoiling.  Expectations are totally different from OPs.  That said, her message makes sense for those with her own profile and I applaud her drive.",
            "author": "jacknjilled",
            "id": "hyny4wr",
            "parent_id": "t1_hynvb9v",
            "score": 8,
            "created_utc": 1645981934.0,
            "replies": [
                {
                    "body": "I think if you target SBs from East Asia, The Near East or Eastern Europe (Nigeria too) it is pretty likely you will run into one with this mindset.\n\nSugaring is too much of a killer financial deal for ambitious and highly girls to ignore.",
                    "author": "JDMultralight",
                    "id": "hyqs08y",
                    "parent_id": "t1_hyny4wr",
                    "score": 2,
                    "created_utc": 1646026057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I meant to say my income of six figures is not enough; although I’m comfortable. There’s more to acquire.",
            "author": null,
            "id": "hyqvmy0",
            "parent_id": "t1_hyqt11x",
            "score": 1,
            "created_utc": 1646028264.0,
            "replies": []
        },
        {
            "body": "Medical technology is huge here.  \n\nAlso a ton of smaller, startup stuff. There’s a lot of first Gen entrepreneurs here.  Cerner was started locally and the labor they had spun off a ton of technology. \nGarmin also came from Kansas. \nThere’s a lot of Gen X and older mellenials with tech startups who can compete.",
            "author": "DrZenRoot",
            "id": "hyo0akv",
            "parent_id": "t1_hynyi0n",
            "score": 1,
            "created_utc": 1645982764.0,
            "replies": []
        },
        {
            "body": "Exactly! There’s 50 ways to skin a cat. Find your way and work it",
            "author": null,
            "id": "hypkxfv",
            "parent_id": "t1_hypk91o",
            "score": 1,
            "created_utc": 1646005476.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": null,
            "id": "hyne527",
            "parent_id": "t1_hyndy85",
            "score": 2,
            "created_utc": 1645973749.0,
            "replies": [
                {
                    "body": "Do you avoid rich men that flaunt their lifestyle on Instagram? For example, a flashy real estate agent that makes humble brag posts about the last house he sold in Scottsdale, etc.. are they worth the trouble?",
                    "author": "FigureSorry",
                    "id": "hyonig9",
                    "parent_id": "t1_hyne527",
                    "score": 2,
                    "created_utc": 1645991733.0,
                    "replies": [
                        {
                            "body": "I’m not on social media in that capacity. My encounters have been in person. Who I ignore is the guy who comes into flashy and loud—wearing his money. He may have it but I don’t gravitate to those types. I have turned down very successful high net worth people because of the “flashy mentality”.  I don’t like a lot if attention even though it comes—I’m not tap dancing for it.",
                            "author": null,
                            "id": "hyp0mef",
                            "parent_id": "t1_hyonig9",
                            "score": 1,
                            "created_utc": 1645996982.0,
                            "replies": [
                                {
                                    "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
                                    "author": "FigureSorry",
                                    "id": "hyp3es1",
                                    "parent_id": "t1_hyp0mef",
                                    "score": 1,
                                    "created_utc": 1645998112.0,
                                    "replies": [
                                        {
                                            "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                                            "author": null,
                                            "id": "hyp8mrd",
                                            "parent_id": "t1_hyp3es1",
                                            "score": 1,
                                            "created_utc": 1646000243.0,
                                            "replies": [
                                                {
                                                    "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                                                    "author": "FigureSorry",
                                                    "id": "hypeyon",
                                                    "parent_id": "t1_hyp8mrd",
                                                    "score": 1,
                                                    "created_utc": 1646002895.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He got her pregnant while she was still married to her high school sweetheart.  She had to tell her husband and get a divorce, then marry my business partner.  He is from a culture where having children out of wedlock is a serious problem, and abortion isn't even a discussion.  Even with a 9 figure net worth, his parents are still an enormous part of his life and his entire family would have shamed him for not marrying her.",
            "author": "awesomedude2016_2016",
            "id": "hyqk2dq",
            "parent_id": "t1_hyqik0u",
            "score": 5,
            "created_utc": 1646021749.0,
            "replies": []
        },
        {
            "body": "He specifically chose this watch for the bling factor. I have seen $300k watches that are much more understated than this one (some Patek’s fall in this category).  \n\nApparently, women like diamonds.  Who knew lol.  Personally, I thought it was a extremely gaudy.",
            "author": "awesomedude2016_2016",
            "id": "hypfwn1",
            "parent_id": "t1_hypeh7t",
            "score": 5,
            "created_utc": 1646003292.0,
            "replies": [
                {
                    "body": "So its a “diamond” covered watch?",
                    "author": "SipCoconuts",
                    "id": "hyqmxd4",
                    "parent_id": "t1_hypfwn1",
                    "score": 0,
                    "created_utc": 1646023249.0,
                    "replies": [
                        {
                            "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
                            "author": "awesomedude2016_2016",
                            "id": "hyqo12e",
                            "parent_id": "t1_hyqmxd4",
                            "score": 1,
                            "created_utc": 1646023836.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "you just skipped like 4 levels to the end of the game🤣🤣",
            "author": "SweetD79",
            "id": "hyq0ebl",
            "parent_id": "t1_hyoqgbg",
            "score": 2,
            "created_utc": 1646012505.0,
            "replies": []
        },
        {
            "body": "I think if you target SBs from East Asia, The Near East or Eastern Europe (Nigeria too) it is pretty likely you will run into one with this mindset.\n\nSugaring is too much of a killer financial deal for ambitious and highly girls to ignore.",
            "author": "JDMultralight",
            "id": "hyqs08y",
            "parent_id": "t1_hyny4wr",
            "score": 2,
            "created_utc": 1646026057.0,
            "replies": []
        },
        {
            "body": "Do you avoid rich men that flaunt their lifestyle on Instagram? For example, a flashy real estate agent that makes humble brag posts about the last house he sold in Scottsdale, etc.. are they worth the trouble?",
            "author": "FigureSorry",
            "id": "hyonig9",
            "parent_id": "t1_hyne527",
            "score": 2,
            "created_utc": 1645991733.0,
            "replies": [
                {
                    "body": "I’m not on social media in that capacity. My encounters have been in person. Who I ignore is the guy who comes into flashy and loud—wearing his money. He may have it but I don’t gravitate to those types. I have turned down very successful high net worth people because of the “flashy mentality”.  I don’t like a lot if attention even though it comes—I’m not tap dancing for it.",
                    "author": null,
                    "id": "hyp0mef",
                    "parent_id": "t1_hyonig9",
                    "score": 1,
                    "created_utc": 1645996982.0,
                    "replies": [
                        {
                            "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
                            "author": "FigureSorry",
                            "id": "hyp3es1",
                            "parent_id": "t1_hyp0mef",
                            "score": 1,
                            "created_utc": 1645998112.0,
                            "replies": [
                                {
                                    "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                                    "author": null,
                                    "id": "hyp8mrd",
                                    "parent_id": "t1_hyp3es1",
                                    "score": 1,
                                    "created_utc": 1646000243.0,
                                    "replies": [
                                        {
                                            "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                                            "author": "FigureSorry",
                                            "id": "hypeyon",
                                            "parent_id": "t1_hyp8mrd",
                                            "score": 1,
                                            "created_utc": 1646002895.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So its a “diamond” covered watch?",
            "author": "SipCoconuts",
            "id": "hyqmxd4",
            "parent_id": "t1_hypfwn1",
            "score": 0,
            "created_utc": 1646023249.0,
            "replies": [
                {
                    "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
                    "author": "awesomedude2016_2016",
                    "id": "hyqo12e",
                    "parent_id": "t1_hyqmxd4",
                    "score": 1,
                    "created_utc": 1646023836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not on social media in that capacity. My encounters have been in person. Who I ignore is the guy who comes into flashy and loud—wearing his money. He may have it but I don’t gravitate to those types. I have turned down very successful high net worth people because of the “flashy mentality”.  I don’t like a lot if attention even though it comes—I’m not tap dancing for it.",
            "author": null,
            "id": "hyp0mef",
            "parent_id": "t1_hyonig9",
            "score": 1,
            "created_utc": 1645996982.0,
            "replies": [
                {
                    "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
                    "author": "FigureSorry",
                    "id": "hyp3es1",
                    "parent_id": "t1_hyp0mef",
                    "score": 1,
                    "created_utc": 1645998112.0,
                    "replies": [
                        {
                            "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                            "author": null,
                            "id": "hyp8mrd",
                            "parent_id": "t1_hyp3es1",
                            "score": 1,
                            "created_utc": 1646000243.0,
                            "replies": [
                                {
                                    "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                                    "author": "FigureSorry",
                                    "id": "hypeyon",
                                    "parent_id": "t1_hyp8mrd",
                                    "score": 1,
                                    "created_utc": 1646002895.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, it had diamonds and if I remember correctly it's white gold.",
            "author": "awesomedude2016_2016",
            "id": "hyqo12e",
            "parent_id": "t1_hyqmxd4",
            "score": 1,
            "created_utc": 1646023836.0,
            "replies": []
        },
        {
            "body": "I’m really attracted to him, he is 43 and I am 32. Every other post is how awesome his life is, how much this house sold for- oh, a celebration post, quick, let’s raise a toast and take a pic. Sadly, I think I’m attracted to his sociopathic, successful nature. I also hate myself for finding him attractive. Like you, I don’t like attention in public either.",
            "author": "FigureSorry",
            "id": "hyp3es1",
            "parent_id": "t1_hyp0mef",
            "score": 1,
            "created_utc": 1645998112.0,
            "replies": [
                {
                    "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
                    "author": null,
                    "id": "hyp8mrd",
                    "parent_id": "t1_hyp3es1",
                    "score": 1,
                    "created_utc": 1646000243.0,
                    "replies": [
                        {
                            "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                            "author": "FigureSorry",
                            "id": "hypeyon",
                            "parent_id": "t1_hyp8mrd",
                            "score": 1,
                            "created_utc": 1646002895.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah that would be a turn off for me. How is his circle of friends? Do they do the same?",
            "author": null,
            "id": "hyp8mrd",
            "parent_id": "t1_hyp3es1",
            "score": 1,
            "created_utc": 1646000243.0,
            "replies": [
                {
                    "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
                    "author": "FigureSorry",
                    "id": "hypeyon",
                    "parent_id": "t1_hyp8mrd",
                    "score": 1,
                    "created_utc": 1646002895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I believe his circle of friends are more low key than he is. When I first met up with him at a local lounge, I sat at the table with him and his brother who is the same age as me, who was also sitting with us, asked me, “what kind of car do you drive?” I answered him honestly but I was kind of shocked because I’ve never been asked that by someone I just met. It was kind of tacky and dumb. I’m not a materialistic person and I’m not really a car person, either.",
            "author": "FigureSorry",
            "id": "hypeyon",
            "parent_id": "t1_hyp8mrd",
            "score": 1,
            "created_utc": 1646002895.0,
            "replies": []
        }
    ]
}